["About this rating", "In late summer 2019, multiple news accounts reported that a Wisconsin woman had endured a frightening encounter with a supermarket product tamperer who, the articles said, had added hair remover to a bottle of conditioner, causing the woman's hair to fall out.", "On Aug. 1, the website Distractify published an article under the headline \"Woman Loses Hair After Buying Tampered-With Conditioner That Was Mixed With Nair,\" reporting that:", "Taffy Jo Trimm [sic] and her daughter Ashley Rose recently bought this bottle of Pantene from a Walmart in New Richmond, Wisconsin. In a now-viral Facebook post, Taffy explains that the bottle must have been tampered with. Someone must have mixed in Nair or some other hair removal product with the conditioner because, when Taffy's daughter Ashley used the conditioner, her hair started falling out. In clumps. How horrifying is that?", "'Attention New Richmond Wisconsin Walmart shoppers,' Taffy's Facebook post reads, \"be aware of shampoo and conditioner you buy there as my daughter Ashley Rose bought some two days ago and someone mixed Nair in her conditioner bottle!!!! As I speak she is losing hair and crying!! Conditioner below this conditioner [sic] is supposed to be white. It is an ugly pink color.\"", "Other reports went beyond the parameters of that single purported incident, claiming without evidence that it was part of a broader trend. The websites Popbuzz and Rare.us both published articles using headlines that stated \"People are Putting Hair Removal Cream in Shampoo,\" while one Twitter user posted a viral tweet that claimed \"people\" were mixing Nair into shampoo and conditioner bottles:", "Please check your hair products before you buy them, people are mixing Nair into shampoo & conditioner in the store smh pic.twitter.com/iCuDpZLpmL", "— ???? ??????? (@shandiditbetter) July 30, 2019", "We have been unable to verify the claim that the woman in question lost her hair involuntarily as a result of exposure to a substance deliberately added to a bottle of hair conditioner before she purchased it from Walmart. The details follow.", "The narrative began on July 28, when Taffy Jo Timm wrote on Facebook that her daughter, 21-year-old Ashley Robinson, was \"losing her hair and crying\" after using conditioner she had purchased two days earlier from the Walmart in New Richmond. Timm's post was accompanied by a photograph of a bottle of Pantene conditioner and a photograph showing what appeared to be black hair deposited in a shower:", "Later that night, Robinson herself posted the same photograph of black hair, along with a brief account of what had happened earlier that evening:", "\"... Got in shower, shampoo [sic] and conditioned my hair, got out, something was different and didn’t smell the greatest. I carried on sat down for a bit and then decided to go blow dry my hair, I took my hair out of the towel and it smelt terrible, got back in the shower used my other shampoo and rubbed that in, as I took my hands out of my hair it was covered in hair and just kept on falling out.\"", "Robinson said she visited the emergency room due to a burning sensation and was later discharged. The following evening, she wrote on Facebook that she had undergone a \"consultation\" but had resigned herself to having to shave her head. On July 30, Robinson posted a photograph of herself bald, and on Aug. 1, Minneapolis television station WCCO interviewed her:", "﻿", "On Aug. 1, the New Richmond Police Department announced they had opened an investigation into potential product tampering after having received a formal complaint about Robinson's experience. Their news release on the subject stated that:", "Due to the significance of this offense, New Richmond officers and detectives have been working with Wal-Mart staff to identify potential suspects and review video surveillance. The New Richmond Police Department will continue to follow the facts of this case. While this appears to be an isolated case at this time, the New Richmond Police Department is asking anyone in this area that has been a recent victim of this type of activity to please report it immediately to your local police/sheriff’s department. The New Richmond Police Department is also reminding people to be diligent in checking products for safety seals and prior to any use to make sure it is consistent with the product you are expecting.", "We have so far been unable to independently verify that Ashley Robinson's hair loss was involuntary and came about as the result of her using conditioner tainted with Nair (or some other hair-removal product, or any other substance) following an act of product tampering at the Walmart in New Richmond. If or when we receive evidence that would verify that sequence of events, we will update this article accordingly.", "We do know that Robinson experienced hair loss, and that she did indeed visit the emergency room at Westfields Hospital and Clinic in New Richmond on July 28, 2019. Her mother provided Snopes with a photograph of part of Robinson's after-visit summary. We have redacted certain personal details, but the doctor's summary clearly establishes that Robinson had experienced hair loss and suffered chemical burns on her scalp:", "\"If [she] develops further burning sensation please ... re-rinse her hair. You can follow up in your clinic regarding hair regrowth. Based on the appearance of her scalp, that will likely grow back normally. However, follow-up may be necessary if you're [sic] hair is not coming in as expected.\"", "The doctor listed the diagnosis as: \"Chemical burn of scalp, unspecified corrosion degree, initial encounter.\"", "However, beyond this documentation, we have found no evidence that corroborates the claim that Robinson's conditioner was deliberately contaminated with hair-removal cream by a third party. Furthermore, we have discovered certain details that subtract, rather than add, support to that theory.", "Dispute over dates", "First, significant confusion exists over when Robinson actually purchased the conditioner that she believes caused her hair loss. In her original Facebook post, Timm said her daughter had bought it from Walmart around two days earlier, which would be July 26. However, Timm later told Snopes that Robinson bought it on July 23. And in its Aug. 1 news report, WCCO said she Robinson bought it on the same day as her hair began to fall out, July 28. When we asked Timm to clear up those discrepancies, she insisted that her daughter had indeed purchased the conditioner on July 23 and said she had asked WCCO to correct its reporting.", "However, a spokesperson for Walmart told us that a team of employees had extensively reviewed video surveillance footage from the company's New Richmond location and found evidence that a customer who appeared to be Robinson had, in fact, purchased what appeared to be similar conditioner two weeks before the onset of her hair loss, not five days before it. Walmart found no evidence of Robinson's purchasing conditioner there at any other time in the ensuing two weeks.", "Walmart also reviewed footage of the same aisle from before Robinson's visit and saw no evidence of an individual's tampering with shampoo or conditioner bottles.", "We again put this discrepancy to Timm, who told us she could not explain it and said she had been told by her daughter that July 23 was the date on which her daughter bought the conditioner in question. We also asked Robinson about this discrepancy, checking whether it was possible she had misremembered either the date of the purchase or the location of the Walmart. She told us she was certain she made the purchase at the New Richmond Walmart and was \"almost positive\" she did so on July 23.", "Robinson also told us that July 28 was the first time she had used the conditioner, meaning it would have been sitting unused in her home for either five days (by her account), or around two weeks (based on Walmart's surveillance footage). We asked Robinson whether any possibility existed that a visitor to her home during that time might have contaminated the conditioner before she first used it, and she told us she had not had any visitors during that time.", "The smell test", "Furthermore, Walmart's review of the surveillance footage found evidence that the customer who resembled Robinson had unscrewed the pump-top cap from several bottles of conditioner, smelling each item before settling on one for purchase.", "This is potentially a significant finding. Robinson, in her July 28 Facebook post, asserted that she quickly realized something had gone awry in washing her hair because she could detect the odor of another substance in her conditioner (\"something was different and didn’t smell the greatest,\" \"I took my hair out of the towel and it smelt terrible\").", "If the conditioner did contain a contaminant (whether hair removal cream or some other substance) which smelled strongly enough at the time that it struck Robinson as \"terrible,\" it stands to reason that she would have detected it in the first place if she were \"sniff-testing\" conditioners in Walmart before she chose the one she purchased. We put this question to Robinson, who claimed that she had opened bottles of shampoo when she visited the store, but not bottles of conditioner.", "In a statement, Walmart told us they had \"inspected all products in our store, reviewed surveillance footage and found no evidence of tampering.\" The company removed no products from its shelves, despite Robinson and Timm's claims of product-tampering, and according to their statement, Walmart employees have \"attempted to reach out to the customer to discuss this further and have received no response.\" Robinson told us she had not yet contacted Walmart because she was waiting to meet with her attorney.", "Two different colors", "Significant difference appears to exist between the look of the hair shown deposited in the shower in Robinson's original July 28 photographs, and that of the hair shown in photographs posted later.", "The hair in the photograph below appears to be black in color, and some strands look to be relatively long:", "By contrast, Robinson later posted three photographs of herself on Facebook, which appeared to show her with brown or even blonde hair, apparently shorter than the black hair shown deposited in the shower. Timm told us that these photographs had been taken in the hospital on July 28. This means that, according to Timm and Robinson's version of events, her hair appeared black when she washed it on the evening on July 28, but had significantly lightened in color within a matter of hours:", "Timm also sent us a fourth photograph, which she said was taken on the day after the event. It even more clearly illustrated the change in apparent hair color that, according to the two women's account, took place:", "Courtesy of Taffy Jo Timm.", "We put those discrepancies to Timm, who told us that her daughter had dyed her hair and speculated that whatever substance was purportedly added to the conditioner removed the dye from her hair, as well as removing portions of the hair itself: \"I feel whatever was put into [the] conditioner stripped the hair color and removed big clumps of hair.\"", "Robinson told us she had dyed her hair dark brown two months earlier, but her roots sometimes appeared \"medium brown\" and \"even a little blonder-looking.\" The hair shown in the shower appeared darker than it really was, she told us, because it was wet. And the hair shown in the subsequent Facebook photographs appeared lighter than it really was due to the effect of the camera's light.", "Robinson later posted to Facebook a photograph of herself with dyed hair, which she said was taken the day before her hair loss began, and various photographs on her Facebook account demonstrated that she did indeed periodically dye her hair.", "We haven't been able to verify that any substance was added to Robinson's conditioner in the first place, or that the conditioner was the cause of her hair loss, placing doubt on Timm's hypothesis that a contaminant added to the conditioner removed the dye from her daughter's hair and led to a significant difference in hair color across the photographs.", "Furthermore, the difference between the apparent color of the hair in the first photograph and its appearance in the other four remains significant enough that, while we are by no means dismissing it, Robinson's explanation remains open to reasonable doubt.", "Finally, other elements are absent that would add credibility to the \"Walmart tampering\" account of Robinson's hair loss. For example, New Richmond police Chief Craig Yehlik told us that his department had received no other recent reports of product tampering of any kind in the New Richmond area. This absence of reports of similar incidents does not destroy the credibility of Timm and Robinson's version of events, but neither does it enhance it.", "Although not definitive, Walmart's internal investigation into many hours of surveillance footage yielded no evidence of product tampering at its New Richmond store, but it did reveal evidence that cast doubt on Timm and Robinson's version of events. It is noteworthy that the company has decided not to withdraw any items from sale at that store, despite widely publicized allegations that product-tampering took place there.", "Zlotnick, Robin.  \"Woman Loses Hair After Buying Tampered-With Conditioner That Was Mixed With Nair.\"\r\n  Distractify.  1 August 2019.", "Duribe, Jazmin.  \"People Are Putting Hair Removal Cream in Shampoo Bottles and WTF.\" \r\n  PopBuzz.  1 August 2019.", "Jasso, Silke.  \"Warning! People Are Putting Hair Removal Cream in Shampoo Bottles.\"\r\n  Rare.us.  30 July 2019.", "Yehlik, Craig.  \"Press Release -- Product Tampering.\"\r\n  New Richmond Police/Facebook.  1 August 2019.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]