["About this rating", "On 2 November 2017, the disreputable web site Neon Nettle reported falsely that seven \"key witnesses\" to the mass shooting on the Las Vegas Strip one month earlier had died under \"suspicious circumstances\", and that there was a \"sinister\" plot afoot to snuff out people who made statements in the immediate aftermath of the massacre that appeared to support the conspiracy theory trope that there was more than one shooter that night.", "Law enforcement leading the investigation into the massacre have concluded that Stephen Paddock, 64, was the lone gunman on 1 October 2017, when he opened fire with a modified weapon from the 32nd floor of the Mandalay Bay Resort and Casino onto a crowd below attending an outdoor country music festival. Neon Nettle, along with other conspiratorial web sites, have been aggressively pushing the idea that Paddock had an accomplice. Conspiracy buffs have decided that the Las Vegas shooting was yet another massive cover-up — a \"false flag,\" or government-engineered catastrophe meant to facilitate a nationwide gun-grab in the service of an ominous global cabal waiting in the wings to seize world power.", "With great paranoia, Neon Nettle reported:", "In the month that followed the incident, a staggering seven key witnesses have died in very suspicious circumstances.", "Whether this series of disturbing deaths and disappearances are purely coincidental or whether there is something deeply sinister afoot has yet to be determined.In cases like these, however, there's no such thing as coincidence.", "None of the deaths of \"key witnesses\" mentioned in the Neon Nettle story were linked, other than the fact some of them were part of a crowd of at least 22,000 people attending the outdoor Route 91 Harvest Festival when the shooting took place. Among the seven named, two died in an apparent car accident. One appears to have been misidentified by conspiracy theorists. A third is, in fact, not dead, while another had serious medical complications. In another instance, the deceased had no link whatsoever to the mass shooting, while the final \"key witness\" named, in display of sheer laziness by Neon Nettle, is Paddock, the shooter.", "Dennis and Lorraine Carver: Lorraine Carver allegedly wrote on social media that her husband protected her from \"shooters\". Carver and her husband Dennis were killed on 16 October 2017 in a car accident near their home in Murrieta, California, when their car veered off a curve in a road at 10:50 P.M., striking a metal gate and catching fire. Both were pronounced dead at the scene.", "Danny Contreras: On 23 October 2017, police and fire personnel discovered the body of Danny Contreras, 35, who died of multiple gunshot wounds in a vacant home in Las Vegas. Police said they believe the homicide was narcotics-related. According to Neon Nettle, a now-suspended Twitter account apparently being used by a person using that name posted that he was lucky to have gotten out of the concert alive after being chased by two men with guns. However there is no evidence that the homicide victim was the same person who wrote the tweets — comparison of an image on a fundraiser for the murdered man launched on 25 October 2017 in North Las Vegas and the profile picture of the man pointed out by Neon Nettle appears to demonstrate that they are in fact two different people.", "Chad Nishimura: Neon Nettle initially and falsely reported Nishimura, a Mandalay Bay hotel worker \"disappeared\" after he told a local news station he had valeted Paddock's car and said Paddock \"didn't have any crazy bags with him that I can remember.\" The conspiratorial web site is now reporting Nishimura was murdered outside the Las Vegas church, Iglesia La Luz del Mundo. A man named Hector Antonio Lemus-Flores, 45, of North Las Vegas, was murdered on 16 October 2017 outside that church. Neon Nettle simply transposed the details of Lemus-Flores' death onto their story to falsely claim the victim had been Nishimura, who is alive.", "Kymberley Suchomel: 28-year-old Suchomel passed away in her sleep a week after the massacre. According to her grandmother, who found her in bed in her Apple Valley, California home on 9 October 2017, Suchomel had seizures and was taking medication for a tumor. Suchomel was apparently experiencing trouble sleeping as sounds and images from the massacre would terrorize her at night. She drew the attention of conspiracy theorists with a now-private Facebook post attributed to her in which she said there was more than one shooter, writing:", "We couldn’t hide because they (and I do mean THEY) were chasing us.", "John Beilman: On 4 October 2017, Beilman, 60, shot and killed his severely-disabled 27-year-old daughter in the backyard of their Fairport, New York home before turning the gun on himself. There is no connection between that tragedy and the Las Vegas massacre — a link between the two deadly incidents was established exclusively by disreputable conspiracy sites like WhatDoesItMean. According to RationalWiki, the work on that web site is of such quality that \"even other conspiracy nutters don't think much of it.\"", "The seventh \"key witness\" included on Neon Nettle's list is the shooter himself, Stephen Paddock. After shooting at the crowd for 10 minutes, Paddock turned his weapon on himself. Of course Paddock wasn't a \"witness.\" He was the perpetrator. He was included in the list perhaps as an effort to ramp up the cloak-and-dagger effect or simply beef up the body count — Neon Nettle implied there had been suspicious circumstances for his death as well:", "Reports varied about how Paddock was killed with some initial statements saying he was killed in a police shootout, with the \"official\" story now saying he turned a weapon on himself.", "According to police radio traffic which can be found archived at Broadcastify, Paddock did not exchange gunfire with police. When they breached the door and went inside, Paddock was already down.", "Greenberg, Jay. \"7 Las Vegas Shooting Witnesses Now Dead Within 1 Month of Attack.\"\r\n  Neon Nettle. 2 November 2017.", "Wesson, Gail. \"Pair Identified in Fiery La Cresta Crash Near Murrieta.\"\r\n  The Press-Enterprise. 19 October 2017.", "Lacanlale, Rio. \"Police Investigate Homicide in Northeast Las Vegas.\"\r\n  Las Vegas Review-Journal. 23 October 2017.", "Shoro, Mike. \"Man Killed Upon Arrival at Central Las Vegas Church Identified.\"\r\n  Las Vegas Review-Journal. 19 October 2017.", "De La Cruz, Rene Ray. \"Vegas Shooting Survivor, California Charity Co-Founder Dies Suddenly.\"\r\n  Portsmouth Herald. 11 October 2017.", "Andreatta, David. \"There's No Las Vegas Link to Fairport Murder-Suicide.\"\r\n  USA Today. 11 October 2017.", "Dwyer, Colin. \"LISTEN: Amid Chaos in Las Vegas, Police Dispatches Reveal an Evolving Response.\"\r\n  NPR. 4 October 2017.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]