["The claim was published here on Facebook on April 18, 2020. It has been shared more than 17,000 times.", "Below is a screenshot of the misleading post:", "The Sinhala-language post translates to English as: “China's Wuhan asked for the 1290 deaths recorded yesterday, by opening the city.\n\tLet's make sure we dont experience the same plight because of elections.\"", "China ended its lockdown of Wuhan, the city where COVID-19 pandemic is believed to have first emerged, on April 8, 2020. Here is an AFP report on the re-opening of the city.", "Sri Lanka is set to hold elections on June 20, 2020. Sri Lanka's President Gotabaya Rajapaksa issued this gazette on March 2, 2020 dissolving the Parliament, thus announcing a general election on April 25, 2020. As the COVID-19 crisis deepened, the Election Commission said a gazette was issued on April 20, 2020 anouncing the delay of polls until June.", "A similar claim was also been shared here, here, here and here on Facebook.", "The claim is misleading; Chinese officials did raise its death toll for Wuhan by 1,290 on April 17, 2020, but authorities said these were cases that were “belated, missed and mistaken” at the peak of the pandemic.", "A keyword search found this report published by China’s state news agency Xinhua on April 17, 2020, which includes a full transcript of the statement issued by officials in Wuhan.", "It states, in part: “The total number of confirmed COVID-19 cases in Wuhan as of the end of April 16 was revised up by 325 to 50,333, and the number of fatalities up by 1,290 to 3,869.”", "The report listed several reasons for “the data discrepancies”, saying: “First, a surging number of patients at the early stage of the epidemic overwhelmed medical resources and the admission capacity of medical institutions. Some patients died at home without having been treated in hospitals.", "“Second, during the height of their treating efforts, hospitals were operating beyond their capacities and medical staff were preoccupied with saving and treating patients, resulting in belated, missed and mistaken reporting.", "“Third, due to a rapid increase of designated hospitals for treating COVID-19 patients, including those administered by ministries, Hubei Province, Wuhan city and its districts, those affiliated to companies, as well as private hospitals and makeshift hospitals, a few medical institutions were not linked to the epidemic information network and failed to report their data in time.", "“Fourth, the registered information of some of the deceased patients was incomplete, and there were repetitions and mistakes in the reporting.”", "According to this daily report issued by China’s National Health Commission on April 22, 2020, no new COVID-related deaths were recorded in Hubei province immediately after the lockdown was lifted in Wuhan.", "It reads, in part: “On April 21, Hubei province reported no new cases of confirmed infections, no new cases of suspected infections, and no deaths. 5 patients (all in Wuhan) were released from hospital after being cured.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]