["A 16-year-old HIV-positive Kenyan girl recounts her story at a center run by a Kenyan NGO in 2015. She spoke on condition of anonymity to avoid stigma from her community.", "International leaders continue to try and shine a light on the AIDS epidemic in sub-Saharan Africa. But do they get their facts right?", "Canadian Prime Minister Justin Trudeau recently penned a letter decrying the impact of poverty and disease on young girls in Africa, a group he says make up a disproportionate amount of new HIV infections among young people.", "Trudeau wrote the letter in response to the One Campaign, which sent out an appeal to global leaders asking them to help combat gender inequality. The One Campaign is a worldwide advocacy program that works to raise awareness about poverty and preventable disease.", "Included in Trudeau’s message was a claim that young women \"account for a shocking 74 percent of all new HIV infections among adolescents in Africa.\"", "We’ve seen this statistic floating around before. Our partners at Africa Check investigated a nearly identical claim featured in an online article published in April. They concluded that the source of the data was ambiguous, but their independent calculations mostly fell in line with the overall message of the claim.", "PolitiFact decided to dig into Trudeau’s claim in more detail.", "Running the numbers", "Trudeau’s office informed us that the source of his claim is a 2015 reference report authored by UNAIDS and the African Union. The report, titled \"Empower young women and adolescent girls,\" contains a figure claiming that in 2013, 74 percent of new HIV infections among people between ages 15 and 24 in Africa occurred in adolescent girls.", "But the report’s footnotes section only lists \"2013 UNAIDS data\" as its source. Where did this data come from, and is it still accurate today?", "First, it’s important to note that although Trudeau named the entire continent of Africa in his claim, the majority of AIDS estimates in Africa specifically examine sub-Saharan Africa. Alasdair Reid, deputy director of communications and global advocacy at UNAIDS said that discussion of AIDS in the continent usually focuses on sub-Saharan Africa and treats North Africa as a separate region or as part of the Middle East.", "Katie Smith, communications associate at the Kaiser Family Foundation, referred us to the 2016 Prevention Gap Report, a collection of HIV data and analysis of infection trends from 146 countries. The press release for the report states, \"In eastern and southern Africa three-quarters of all new HIV infections among adolescents aged 10–19 years are among adolescent girls.\" The report made no reference to data analyzing sub-Saharan Africa as a whole.", "We reached out to UNAIDS to obtain the most recent data for the entire region. The agency pointed us to the 2016 Prevention Gap Report as well, but also gave us up-to-date figures taken from aidsinfoonline.org, a database of AIDS-related statistics.", "According to a spreadsheet provided by UNAIDS, in 2015, 76 percent of all new HIV infections among adolescents aged 10-19 in sub-Saharan Africa were among adolescent girls. The age range used in the sheet is lower than the 15-24 group used by Trudeau’s source.", "The officials we spoke to told us that Trudeau’s claim was basically correct, and was actually slightly lower than more recent numbers because it was based on data from 2013.", "Why girls are so vulnerable to HIV", "Trudeau’s sobering statistic made us wonder why African girls are so disproportionately affected by a virus that can infect any human being.", "The experts we talked to stressed that a wide variety of factors ranging from economic circumstances to societal gender norms were responsible for the gap.", "Anurita Baines, the HIV/AIDS regional advisor at UNICEF’s Eastern and Southern Africa Regional Office, stressed that the obstacles most girls in poverty face even when healthy make avoiding HIV infection more difficult.", "\"The primary reasons that girls are more vulnerable have to do with gender inequality, including lack of access to education,\" she said. \"These issues prevent women and girls from negotiating for condoms and safe sex practices.\"", "One particular problem is the phenomenon of intergenerational sex, where poor young girls have sex with men who are often at least a decade older. Reid told us that these \"blessers\" shower poor girls with gifts and money, who then become dependent on the men to stay in school. The result is often unprotected exposure to an HIV-positive partner.", "However, in recent years an array of initiatives has been developed and implemented to specifically protect young women from HIV infection. Baines highlighted UNICEF’s social protection programs in countries such as Kenya and Malawi that give small cash grants for households with school-age girls. The purpose of the grants is to keep girls in school longer, which delays their sexual debut and reduces their risk of contracting HIV.", "Ultimately, Baines is hopeful that increased international attention could further advance efforts to fight the disease.", "\"To have someone at a high political level make a statement like that is very encouraging,\" she said of Trudeau’s claim. \"What has to come next is the funding and the support for programs that actually reach these girls and help them.\"", "Our ruling", "Trudeau claimed that young women \"account for a shocking 74 percent of all new HIV infections among adolescents in Africa.\"", "The data from UNAIDS and UNICEF closely matches his numbers, though Trudeau would have been more precise if he said sub-Saharan Africa. Evidence there shows that young girls between the ages of 10 and 19 are significantly more vulnerable to HIV infection than their male peers due to a wide variety of economic and gender-related issues.", "Trudeau’s claim is accurate with the small caveat about his use of Africa and not sub-Saharan Africa. We rate his claim Mostly True.", "https://www.sharethefacts.co/share/565b33e4-ee02-4513-a724-3e3deeeb8d6c", "Africa Check, \"Are 74% of African girls aged 15 to 24 HIV+? Not even close,\" May 3, 2016.\n\nEmail and phone interview with Alasdair Reid, deputy director of communications and global advocacy at UNAIDS, August 31, 2016.", "Email interview with Amala Reddy, regional strategic information advisor at UNAIDS, August 30, 2016.", "Email interview with Desire Rwodzi, database consultant at UNAIDS, August 31, 2016.", "Email interview with Katie Smith, communications associate at the Kaiser Family Foundation, August 30, 2016.", "Inter Press Service, \"Plan for poorer countries to fund HIV response raises concerns,\" April 11, 2016.", "Justin Trudeau, \"I wholeheartedly agree: Poverty is Sexist,\" August 25, 2016.\n\nOne.org, \"Poverty is sexist,\" accessed August 24, 2016.\n\nPhone interview with Anurita Baines, HIV/AIDS regional advisor at UNICEF’s Eastern and Southern Africa Regional Office, August 31, 2016.\n\nPhone interview with Olivier Duchesneau, deputy director of communications at the Prime Minister’s Office, August 29, 2016.\n\nUNAIDS, \"Prevention gap report,\" accessed August 25, 2016.\n\nUNAIDS, \"Empower young women and adolescent girls: fast-tracking the end of the AIDS epidemic in Africa,\" 2015.\n\nUNAIDS, \"Press release: UNAIDS warns that after significant reductions, declines in new HIV infections among adults have stalled and are rising in some regions,\" July 12, 2016.\n\nUNAIDS spreadsheet, \"New HIV infections among adolescents (10-19),\" August 31, 2016.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]