["BJP spokesperson Sambit Patra wrote “Sanskrit” in bold letters while tweeting pictures of the signboard at Dehradun railway station. While the first photograph shows the city’s name written in Hindi, English and Urdu, the second picture shows Urdu replaced with Sanskrit. The tweet garnered close to 20,000 retweets and more than 88,000 likes as of this writing. An archived link of the tweet can be accessed here.", "SANSKRIT pic.twitter.com/6coUpaIQyF", "— Sambit Patra (@sambitswaraj) July 13, 2020", "Most people commenting on Patra’s tweet believe that the language was recently changed on the board.", "A reverse-image search on Yandex took us to a report by Hindustan Times from February 18, 2020, which carries the same photograph. “View of Dehradun railway station with the name written in Sanskrit on the day (February 8, 2020) the station re-opened for public after three months,” reads its description. The image has been credited to photographer Pravin Dandriyal.", "According to the report, “In a bid to promote use of Sanskrit in Uttarakhand, the Railways ministry decided to rename the name of its stations in the state. The signboards which have names of railway stations written in Hindi, English and Urdu will now be written in Hindi, English and Sanskrit…Last week (first week of February 2020), name of Dehradun railway station was written in Sanskrit as Dehradunam, along with Hindi and English, when the station re-opened for public after three months.”", "A report in The Times of India states, “According to railway officials, the decision has been taken as per provisions of the Railway Manual, which says that names of the railway stations should be written in Hindi, English and in the second language of the state.”", "In January 2010, the Uttarakhand government led by Chief Minister Ramesh Pokhriyal of the BJP gave Sanskrit the status of the second official language of the state. Hindi remains the first official language.", "A controversy erupted in February this year when Urdu was replaced with Sanskrit on a signboard. According to Hindustan Times, Rekha Sharma, senior divisional commercial manager Moradabad railway division, which manages the stations falling under Garhwal region, told local media, “The name was written by the construction agency which was renovating the station. They had put up a board with the name written in Sanskrit. The board was removed as soon as the matter came to light.”", "“The state government has to provide us with how the names of the railway stations are to be written in Sanskrit. Only then we would be writing to the railway headquarter to clarify on that fact of adding a fourth language on station signboards,” Sharma added.", "On February 7, Division Railway Manager (DRM) Moradabad issued a clarification notice regarding the replacement of Urdu with Sanskrit from Railway signboard in Uttarakhand. As per the letter, “Indian Railways has neither replaced Urdu language from any station nor has any intention to do so at this point in time. Sanskrit may be used as an additional language apart from existing languages in the signboards at railway stations but will not replace Urdu wherever the same exists.”", "Clarification regarding replacement of Urdu language at stations in Uttarakhand pic.twitter.com/zQFb9PhK6a", "— DRM Moradabad (@drm_moradabad) February 7, 2020", "However, a senior railway official from Kathgodam railway station in Nainital was quoted by Hindustan Times as saying, “Even though official orders have not been received, preparations are afoot to write names of stations in Sanskrit.”", "Urdu was put back in place of Sanskirt after it was removed in February. A photograph of a man sticking a paper over ‘Dehradunam’ with the name written in Urdu was shared by Aaj Tak on February 14. The outlet spoke with Dehradun Station Director Ganesh Chandra Thakur who clarified that the railway work manual dictates that names in only three languages can appear on the board. According to him, there were no plans yet to remove Urdu.", "Aaj Tak had also aired a ground report from the station where the paper with Urdu text can be seen placed on the earlier Sanskrit text.", "Alt News was able to get a photo of the board clicked by a local resident today. Here as well, the paper is clearly visible.", "The Sanskrit text on a signboard at Haridwar railway station was also similarly replaced with Urdu.", "BJP spokesperson Sambit Patra, therefore, shared an old photograph of a signboard at Dehradun station with the city’s name written in Urdu replaced with the Sanskrit language. The board was altered to its earlier form a few days later but Patra did not share this information. An Alt News compilation on the numerous instances of misinformation shared by Sambit Patra can be read here.", "Donate Now", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]