["About this rating", "We now accept as commonplace the notion that actors in popular television shows are set for life financially, as we read about how cast members in hit shows such as \"Friends,\" \"Seinfeld,\" and \"The Big Bang Theory\" not only were paid upwards of $1 million per episode during those series' initial runs, but then earned millions of dollars more in residuals and royalties from syndication deals, DVD sales, and video streaming.", "That wasn't always the case, however. The actors from television shows of decades past — shows whose episodes have been continuously rerun countless thousands of times all over the world and are touchstones of popular culture — did not reap any such bounty. Those cast members were typically paid salaries that ranged from modest to pretty good, and they may have received additional payments for the first few airings of episodes in which they appeared, but that was it — they collected little or no residuals when their shows were sold into syndication, and no royalties from a home video market that didn't yet exist.", "As Eve Plumb, who portrayed Jan Brady on the 1970s sitcom \"The Brady Bunch,\" revealed in 2011: “The biggest misconception is that we’re all rich from it, but we are not. We have not been paid for reruns of the show for many, many years. We are not making money off of it at all.”", "The one notable exception to this circumstance, according to legend, is actress Dawn Wells, who played the character of Mary Ann Summers in the 1960s sitcom \"Gilligan's Island.\" Numerous websites such as Mental Floss have offered versions of the following tale about how Wells supposedly parlayed her three seasons on the show into a lifetime of paychecks:", "Wells was married to talent agent Larry Rosen when she was hired for the Gilligan cast, and it was Rosen who noted the clause in her contract (which was standard at the time) that limited her to collecting residuals only the first five times any episode re-ran after its original airing. Rosen told Wells that if the series was a success, this clause could cost her a lot of money. Wells was the only castaway who asked for an amendment to that residual clause in her contract, and the producers granted it, never thinking the series would be on the air 40 years later. As a result, [producer] Sherwood Schwartz and Dawn Wells are the only two folks connected with the show who still receive money from it.", "This narrative seems quite improbable on its face. Actors are generally represented by a bevy of various unions, guilds, agents, and lawyers, and the idea that only one person in the whole television industry possessed the savvy to recognize that a contractual entitlement to residuals was a potentially lucrative reward worth pursuing strains credulity.", "Moreover, the goal of most television producers in that era was to keep their shows going long enough (generally three years) to amass a sufficient number of episodes for syndication deals after those series ended their original network runs, as the syndication market provided the bulk of potential profits. While producers may not have expected their shows to still be airing \"40 years later,\" they certainly hoped their series would enjoy long TV afterlives, and they would not be keen on sharing those revenues with actors who had little bargaining power (nor would they want to set a precedent for other actors to follow). A minor actor in a secondary role who dared to press for a contractual guarantee to perpetual royalties likely would have been curtly informed how quickly and easily she could be replaced.", "We don't need to speculate on the state of 1960s television to know the answer here, though, because Wells herself has repeatedly stated that this legend is false. In 2014, for example, Wells said during an interview that she was paid a salary roughly equivalent to $50,000 in today's dollars and \"never received any residuals\":", "Q: They stopped making Gilligan’s Island 47 years ago. Do you still receive residuals?", "A: We never received any residuals.", "Q: How much money did you make for Gilligan’s Island?", "A: Nothing. I don’t know, maybe I made $700 a week. I understand (the producer) Mr. Schwartz made $90 million on the reruns alone. I think we got paid ... maybe we made $50,000, I don’t know.", "And in a 2016 interview, she answered the question, \"What’s one big myth about [Gilligan's Island]?\" by asserting that the actors \"didn't really get a dime\" in residuals:", "A misconception is that we must be wealthy, rolling in the dough, because we got residuals. We didn’t really get a dime. I think my salary -- of course, I was low on the totem pole, Ginger [Tina Louise] and Thurston [Jim Backus] got more -- was $750 a week. Sherwood Schwartz, our producer, reportedly made $90 million on the reruns alone!", "A 2014 Washington Post obituary of Wells' cast mate Russell Johnson, who played the Professor, also observed that Johnson \"resented ... that he and other cast members were left out of the bulk of the syndication profits.\"", "For what it's worth, the daughter of \"Gilligan's Island\" creator Sherwood Schwartz disputed the oft-repeated claim that her father realized as much as $90 million from the series:", "Schwartz’s daughter Hope Juber dismissed that estimate as an urban myth. “While he, and my family were certainly comfortable, that kind of wild estimate is ridiculous and surprising,” she wrote in an email. She said her father made his own deal with the studio just like the cast members, but not for that kind of money. She added, “If there is $90 million, it must be buried in a chest on the island somewhere because we’ve never seen it.”", "Mackie, John.   \"Full Interview With: Mary Ann on Gilligan’s Island.\"\r\n    Vancouver Sun.   22 January 2014.", "Bernstein, Adam.   \"Russell Johnson, Actor Who Played the Professor on ‘Gilligan’s Island,’ Dies at 89.\"\r\n    The Washington Post.   16 January 2019.", "Malito, Alessandra.   \"Why We Keep Hearing About Once-Famous TV Actors in Financial Trouble.\"\r\n    MarketWatch.   10 September 2018.", "Kovalchik, Kara.   \"TV-Holic: Still on Gilligan’s Island.\"\r\n    Mental Floss.   8 September 2010.", "OK!.   \"Eve Plumb Not Paid for 'Brady Bunch' Reruns.\"\r\n    3 February 2011.", "Goldberg, Lesley.   \"Why the 'Big Bang Theory' Stars Took Surprising Pay Cuts.\"\r\n    The Hollywood Reporter.   29 March 2017.", "Clash, Jim.   \"Interview: Actress Dawn Wells Answers the Big Ginger/Mary Ann Question, More.\"\r\n    Forbes.   18 March 2016.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]