["About this rating", "Novo Nordisk-manufactured human insulin can be purchased at Walmart stores without a prescription for $24.88 a vial (except in Indiana).", "The most commonly prescribed form of insulin is insulin analogs, which require a prescription and are currently the subject of a controversy over soaring prices.", "In early February 2019, amid continued public outcry over the soaring cost of life-saving pharmaceuticals, readers shared a screen-captured image on social media of a local news station's reporting on the story of a woman who said she bought inexpensive insulin without a prescription at Walmart:", "Readers asked us whether this was true. It is true, although you should note Walmart sells human insulin, an older version of the glucose-moderating hormone, whereas most insulin-dependent diabetics are currently prescribed insulin analogs that have evolved to help prevent dangerous swings in blood-glucose levels.", "The screenshot above was taken from a 4 February 2019 news broadcast from Dallas–Fort Worth television station KDFW:", "We confirmed with Walmart that the retail chain does indeed sell human insulin without a prescription (except in Indiana). That product is Novo Nordisk-manufactured Novolin, which Walmart has branded as ReliOn and sells for $24.88 per vial. Walmart spokeswoman Marilee McInnis confirmed to us that the company has \"maintained, through negotiation, the same retail to patients since 2011.\" To say that the insulin is sold \"over-the-counter\" isn't quite accurate, however, as customers must ask a pharmacist for it.", "Although this revelation might be important, life-saving information for diabetics, an important caveat is that human insulin behaves differently than the newer analog insulin currently retailing for more than $300 a vial.", "Dr. Todd Hobbs, chief medical officer for Novo Nordisk, wrote that the different types of insulin have the same effect of lowering blood-glucose levels, but, \"Training is required whenever someone is prescribed insulin, whether that be human insulin or the newer analog insulin products. Differences in the timing of all types of insulin must be considered for patients to effectively use them ... The difference in the types of insulin is related to how slowly or rapidly they are absorbed once injected. Scientific advances over the years have made improvements on the speed and length of time this absorption occurs.\"", "Diabetes Forecast, a health-oriented magazine associated with the American Diabetics Association, explained the history of the two types of insulin and the difference in health benefits this way:", "In the 1970s, researchers discovered how to program bacteria in the lab to manufacture human insulin, and in 1982, regular human insulin became the first “recombinant DNA” drug product. “It’s a very pure, clean product, and it’s exactly what we as humans make,” [Virginia Commonwealth University School of Pharmacy associate professor and a spokesman for the American Association of Diabetes Educators Evan] Sisson says. Human insulin is now available as short-acting “regular” (or “R”) insulin, which is used at mealtimes, and intermediate-acting NPH (or “N”) insulin, which is used as a basal insulin ...", "While the development of human insulin was a major advancement, it wasn’t perfect. Regular insulin didn’t hit the bloodstream quick enough to cover the rapid absorption of carbohydrates after meals, and it stuck around too long after meals, causing hypoglycemia [low blood glucose, which can lead to unconsciousness and death if untreated]. In 1996, Eli Lilly introduced the first rapid-acting insulin analog to the market: insulin lispro (Humalog). Insulin aspart (Novo Nordisk’s Novolog) and insulin glulisine (Sanofi’s Apidra) quickly followed. With rapid-acting insulin analogs, onset occurs 10 to 20 minutes after injection, instead of the 30 to 60 minutes it takes for regular human insulin to take effect. This allows people to inject their insulin right before a meal, rather than having to dose 30 minutes or more before eating ...", "Deliver a dose of NPH [human] insulin, and it’ll reach its peak about six to eight hours later. This means your insulin may peak while you’re sleeping, posing a serious danger if you don’t wake up to treat. Long-acting analogs, on the other hand, don’t peak, resulting in more-stable blood glucose levels and fewer unexpected highs or lows. In fact, one study showed that long-acting analog insulin glargine reduced overnight bouts of hypoglycemia by up to 48 percent compared with NPH. In another study, detemir reduced nighttime hypoglycemia by 34 percent. This is especially beneficial for people with type 1, who need to be much more precise about matching insulin dosages with their insulin needs to avoid nighttime lows, says Sisson.", "Note, there are two types of diabetes. Type 1 diabetics' bodies cannot manufacture insulin, the hormone responsible for glucose absorption. Type 2 diabetics' bodies, on the other hand, become resistant to insulin. In most cases, Type 1 diabetes starts in childhood, whereas Type 2 is sometimes referred to as \"adult-onset\" diabetes.", "Writing for Insulin Nation, Nicki Nichols explained why the older form of human insulin is difficult to control in children:", "When my child was first diagnosed, she was on NPH. It was incredibly difficult to limit a growing child’s diet to such a strict schedule. Here’s what it looked like:", "8 a.m.- 45-carb meal\n10:30 a.m. – 15-carb snack\n12 p.m. – 45-carb meal\n2 p.m. – 15-carb snack\n5 p.m. – 45-carb meal\n7:30 p.m. – 15-20 carb snack before bed to keep blood sugar up overnight.", "I cannot tell you how many times my child refused to eat the 45 carbs in her dinner. There is something wrong when you are fussing at your 5-year-old to stop eating her green beans and to eat her bread, or mashed potatoes, or pasta.", "The screen shot from the KDFW report no doubt went viral as a result of an ongoing controversy over the cost of analog insulin, which as of 7 February 2019 soared to a retail price of more than $300 per vial. Americans have been awash in medical horror stories such the death of Jesse Lutgen, a 32-year-old Type 1 diabetic who lost his job at a distribution center in Dubuque, Iowa, and with it, his health insurance. He was found dead in his home in February 2018, having run out of insulin. His last vials of the medication were given to him by a friend.", "Hobbs, Todd, MD.   \"The Truth About Human Insulin.\"\r\n    Novo Nordisk.   29 November 2018.", "Tsai, Allison.   \"Can Switching from Analog to Human Insulin Save You Money?\"\r\n    Diabetes Forecast.   March 2017.", "Johnson, Carolyn Y.   \"Why Treating Diabetes Keeps Getting More Expensive.\"\r\n    The Washington Post.   31 October 2016.", "Nichols, Nicki.   \"Why Walmart Insulins Aren’t the Answer to High Insulin Prices.\"\r\n    Insulin Nation.   16 September 2016.", "Des Moines Register.   \"Iowa Man Loses Job, Health Insurance, Access to Insulin and His Life. When Will Congress Act?\"\r\n    6 February 2019.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]