["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Presumptive Republican nominee Donald Trump says U.S. District Court Judge Gonzalo Curiel is \"not treating me fairly.\"", "Curiel ruled that the public can see internal papers from the now defunct Trump University. Trump’s critics and reporters have pounced on the documents. They’ve pointed to examples of a calculated effort to target people who could ill-afford expensive training sessions and had little chance of profiting from them.", "But for Trump, the bad press stems from a bad legal decision that has more to do with his immigration policies than the merits of a lawsuit. He said it is \"just common sense\" that Curiel’s ties to Mexico explain his ruling. Curiel, born and raised in Indiana, had parents who were naturalized U.S. citizens from Mexico.", "CBS News host John Dickerson pressed Trump as to what his parents had to do with him not ruling in Trump’s favor.", "\"He is a member of a club or society, very strongly pro-Mexican, which is all fine,\" Trump said on Face the Nation on June 5. \"But I say, he's got bias. I want to build a wall.\"", "It’s a serious matter to accuse federal judges of bias solely because of their ethnic background, and top-ranking Republicans have rejected Trump’s line.", "Our interest though is strictly in this club that Trump referenced. Is it actually \"strongly pro-Mexican\" as he said?", "We reached out to the Trump campaign for details and did not hear back.", "The group in question is the California La Raza Lawyers Association. It dates back to 1977. The group’s immediate past president, Joel Murillo, told us that it was formed in response to stereotyping coming from judges and lawyers.", "\"There were judges on the bench saying people with Spanish surnames were prone to be savages,\" Murillo said. \"When we tried to integrate with the mainstream bar association, we were denied. We were marginalized. The only people who were willing to work with us were us.\"", "Murillo says the days of stereotyping are over, and the group now focuses on the professional development of Latino lawyers and encouraging students to pursue a career in law. He called Trump’s description of the association as very strongly pro-Mexican a \"misnomer.\" Murillo said most of the group’s recent work targets improving the quality of education for all students in California.", "The group has not been involved in the immigration debate.", "\"The closest was when there were beatings by police and others that offended the constitutional rights of people,\" Murillo said. \"We made suggestions of ways to ameliorate attacks on people with Spanish surnames.\"", "Our search of the Nexis newspaper database found an episode in 2004 when the association wrote a letter calling for the cancellation of a popular Los Angeles reality television show in which illegal immigrants competed for the free services of an immigration lawyer to apply for a green card.", "The show \"functions as a magnet to encourage people to enter this country without documentation,\" the letter said.", "The group’s bylaws state, \"The purpose and goal of this association is to promote the interests of the Latino communities throughout the state and the professional interests of the membership.\" That membership is now about half Latino, Murillo said, and in terms of party affiliation, \"the lawyers who belong pretty much reflect the population.\" California is about 43 percent Democratic, 28 percent Republican and about 24 percent undeclared.", "Murillo also noted that strictly speaking, the group is focused on the Latino community, a term that is much broader than people with family roots in Mexico.", "The association’s website, last updated in 2013, describes a judicial committee that \"seeks to increase the number of Latinos appointed to judgeships.\"", "Kevin Johnson, dean of the University of California Davis School of Law, told us the association is \"seen as a pretty moderate group\" that’s mainly focused on civil rights.", "On the legal front, we found the group filed a 2012 friend of the court brief in support of Sergio Garcia, an undocumented immigrant from Mexico seeking admission to the State Bar of California. But the issue was broader than simple Hispanic solidarity. That brief was co-written by the Asian/Pacific Bar Association of Sacramento.", "In 2002, the San Francisco chapter joined with nine other organizations to support an appeal on the grounds that racism tainted the jury selection process. The defendant, Stanley Williams, did not have a Spanish surname, and the other organizations included the NAACP, the Southern Christian Leadership Conference of Los Angeles, the Asian Law Caucus and the American Civil Liberties Union of Northern California.", "We asked Johnson if including \"La Raza\" in the group’s name carried a special meaning. He said the term is \"sort of a product of its times\" that emerged from the Chicano civil rights movement of the 1960s.", "\"The founders and presidents have not been remarkable, in a political sense,\" Johnson said.", "The group is often confused with the National Council of La Raza, an advocacy group often criticized by conservatives. Aside from a similarity in their names, the only tie we found was a link to the National Council of La Raza on the lawyers association website. But that list of links also includes the National Latino Police Officers Association and the Hispanic Chamber of Commerce.", "The conservative website Redstate posted an op-ed rebuking Trump’s use of the California lawyers group as proof of Judge Curiel’s political motives. The writer, Leon Wolf, called the effort to disparage the association \"dishonest.\"", "\"As far as I can tell, they appear to be a pretty garden variety special interest lawyers association,\" Wolf wrote. \"Every state has these chapters for Hispanic lawyers, black lawyers, women lawyers, Mormon lawyers, Christian lawyers, Jewish lawyers -- you name it, there is a lawyer association for it in every state.\"", "Our ruling", "Trump said Curiel belonged to a group that is very strongly pro-Mexican. The California La Raza Lawyers Association does advance the interests of the Latino legal community and works on issues that matter in Latino communities more broadly.", "However, it has stayed on the sidelines in the immigration debate. The one exception is one letter from a dozen years ago which objected to a television show on the grounds that the program encouraged people to enter the country without documentation. The group’s rare court filings focus on civil rights in general.", "Trump’s statement is accurate only in the sense that the association’s mission aims to support Latinos, but even that is flawed because he said the group was pro-Mexican and the Latino designation reaches a wider set of people. The claim ignores critical facts that would give a very different impression.", "We rate this assertion Mostly False.", "https://www.sharethefacts.co/share/65caa1ee-d498-4628-bfb0-06dfb82e4b14", "CBS News, Face the Nation, June 5, 2016", "California La Raza Lawyers Association, home page, accessed June 6, 2016", "Washington Times, Going extreme to pursue dream, Aug. 18, 2016", "Supreme Court of the State of California, Brief of amici curiae in re: Sergio Garcia, July 23, 2012", "U.S. Court of Appeals 9th Circuit, Brief of amici curiae in re: Stanley Williams, Nov. 6, 2002", "California State University Fresno, California Latino Leadership Summit, 2015", "New York Times, That Judge Attacked by Donald Trump? He’s Faced a Lot Worse, June 3, 2016", "Redstate, The Dishonest Attempt to Associate Gonzalo Curiel with \"La Raza\", June 3, 2016", "Interview Kevin Johnson, dean, University of California Davis School of Law, June 6, 2016", "Interview, Joel Murillo, past president, California La Raza Lawyers Association, June 6, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]