["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Kenosha police did allow Kyle Rittenhouse to walk away the night prosecutors say he killed two protesters and injured a third with an AR-15-style rifle.", "But an organization that tracks extremist activity says they haven’t found any evidence linking Rittenhouse to white supremacy.", "A volatile climate in Kenosha turned violent after an Illinois teen allegedly killed two protesters and injured another amid turmoil over the shooting by police of Jacob Blake.", "Kyle Rittenhouse, 17, was charged with first-degree intentional homicide and five other crimes on Aug. 27, 2020. He is accused of using an AR-15-style rifle to shoot and kill Joseph Rosenbaum, 36, and Anthony Huber, 26, and injure Gaige Grosskreutz, 26.", "The violence came days after Blake, a 29-year-old Black man, was shot in the back seven times at point-blank range by a Kenosha police officer. Blake remains hospitalized and paralyzed from the waist down, according to his family, as protesters renew calls to combat police brutality that disproportionately affects Black people.", "Rittenhouse’s arrest prompted scrutiny of the teenager’s background and frustration over his treatment by Kenosha police — particularly when compared to Blake’s treatment by officers days prior.", "U.S. Rep. Gwen Moore, a Milwaukee Democrat, weighed in with this tweet Aug. 26, 2020:", "\"The same police department who shot an unarmed black man 7 times in the back for walking away from them just let an armed white supremacist walk right past them after shooting people.\"", "We previously looked at claims about the shooting of Blake, and whether he was armed, including that he \"declared he had a gun in the car and was going to go get it\" and was \"brandishing\" a knife. We rated that claim False. There was no gun, and while there are varying reports of whether he had a knife in his hand or it was found on the floorboard of the car he was entering, he was not \"brandishing\" it at police on the scene.", "So we will focus here on Moore’s characterization of how authorities in Kenosha treated Rittenhouse in the moments after the shooting.", "Let’s take a look at her account.", "When asked for evidence to support Moore’s claim, her office pointed to four news articles about the Aug. 25, 2020 incident that led to Rittenhouse’s arrest.", "Here’s what we know:", "According to eyewitness videos and the criminal complaint, Rittenhouse shot and killed Rosenbaum in a parking lot after Rosenbaum chased him and tried to grab his gun.", "Rittenhouse then began running slowly down the street, but tripped and fell as a crowd began to follow him. While he was on the ground, Huber approached him with a skateboard in one hand and reached for Rittenhouse’s gun with the other. Rittenhouse fired one round that hit Huber in the chest and killed him.", "Rittenhouse sat up and pointed his gun at Grosskreutz, who took a step back but then moved toward Rittenhouse. He fired a shot that hit Grosskreutz in the arm.", "Afterward, video footage showed Rittenhouse approaching police vehicles with his hands raised. Several vehicles passed him after he waved toward the first. A voice can be heard yelling, \"Hey, he just shot them! Hey, dude right here just shot them!\" Another voice on a police loudspeaker is heard saying, \"Someone injured, straight ahead.\"", "Rittenhouse ultimately returned to his hometown of nearby Antioch, Illinois, where he was later arrested.", "Kenosha Police Chief Daniel Miskinis defended his department’s actions in an Aug. 28, 2020 news conference, saying the police in the vehicles didn’t see Rittenhouse as a threat and wouldn’t have heard yelling from the crowd over other noise. He said officers were more focused on the injuries and what happened down the street.", "So, multiple sources — including the Kenosha Police Department — have verified that Rittenhouse walked by police after the shootings. Moore is on target with that part of the claim.", "Merriam-Webster defines a white supremacist as someone who \"believes that the white race is inherently superior to other races and that white people should have control over people of other races.\"", "Video taken before the shootings showed Rittenhouse with a group of armed, older men linked to a local group called the Kenosha Guard. Leaders of the group, which that afternoon put out a call for people to bring weapons to defend Kenosha businesses, say Rittenhouse is not a member. But according to the Milwaukee Journal Sentinel, Rittenhouse identifies with such groups.", "\"People are getting injured and our job is to protect this business,\" Rittenhouse said in a video interview that night with The Daily Caller. \"And my job also is to protect people. If someone is hurt, I’m running into harm’s way. That’s why I have my rifle; I’ve gotta protect myself, obviously. But I also have my med kit.\"", "Before it was taken down, Rittenhouse’s Facebook page showed several pro-police photos, including one that featured the phrase, \"Blue lives matter.\"", "Three of the four news reports cited by Moore’s office do not reference white supremacy or extremism. And the only one that does, an Aug. 27, 2020 article from CBS News, cites the Anti-Defamation League as saying Rittenhouse does not appear to be involved with any extremist movements.", "Oren Segal, vice president of the Anti-Defamation League’s Center on Extremism, echoed that in an interview with PolitiFact Wisconsin. Based on a review of Rittenhouse’s TikTok, Facebook and Instagram accounts, Segal said, the organization has not found evidence linking Rittenhouse to white supremacist groups.", "Segal noted that Rittenhouse appears to embrace the Blue Lives Matter movement, which backs police officers and was created in the wake of the Black Lives Matter movement. Segal said Blue Lives Matter is supported by some extremist groups, but also by many other people.", "He contends misidentifying someone as a white supremacist can amount to \"crying wolf\" and minimize the seriousness of extremist beliefs and behaviors.", "\"We need to really be sober about what we are seeing, and we need to tackle it with some honesty and not just fall prey to inaccurate, perhaps politically expedient categorizations,\" Segal said.", "In a tweet, Moore said in contrast to how a Black man who was shot by police was treated, Kenosha police officers \"let an armed white supremacist walk right past them after shooting people.\"", "Kenosha police did let Rittenhouse walk by and ultimately return home to Illinois after prosecutors say he killed two protesters and injured a third.", "But social media posts and profiles haven’t revealed any evidence linking him to white supremacist groups, according to a key organization that tracks extremist activity.", "A statement is Half True when it’s partially accurate but leaves out important details or takes things out of context.", "That fits here.", "Milwaukee Journal Sentinel, Kyle Rittenhouse has been charged with intentional and reckless homicide in Kenosha protest shootings, Aug, 27, 2020.", "Milwaukee Journal Sentinel, Kyle Rittenhouse was charged with homicide. Here's what we learned about the Kenosha shootings from the charging documents, Aug. 27, 2020.", "Milwaukee Journal Sentinel, Much of Kenosha's deadly protest shooting was captured in social media videos. Here's what they show, Aug. 26, 2020.", "Milwaukee Journal Sentinel, Kenosha's sheriff says he hasn't watched video of police shooting Jacob Blake, and other things we learned from Friday's press conference, Aug. 28, 2020.", "Chicago Tribune, 17-year-old from Illinois arrested in fatal shootings during Kenosha protest; Wisconsin authorities ID cop who shot Jacob Blake, Aug. 26, 2020.", "WMTV, Report: Teen arrested in connection with Kenosha killings, Aug. 26, 2020.", "KIRO 7, Jacob Blake case: 17-year-old arrested after 2 killed; Wisconsin AG says violence ‘despicable,’ Aug. 26, 2020.", "CBS News, Teen accused of fatal shooting during Kenosha protests arrested in Illinois, Aug. 27, 2020.", "Email from Samara Sheff, press secretary for U.S. Rep. Gwen Moore, Aug. 28, 2020.", "Merriam-Webster, accessed Aug. 31, 2020.", "Interview with Oren Segal, vice president of the Anti-Defamation League’s Center on Extremism, Aug. 31, 2020.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]