["The video, which features a superimposed red circle to highlight police officers allegedly standing idle beside stone-throwing protesters, was published on Facebook here on March 2, 2020.", "It has been viewed more than 8,000 times.", "Below is a screenshot of the misleading Facebook post:", "The post’s Hindi caption translates to English as: “To those who think that Delhi Police is doing a great job, they should clear their misunderstanding and watch this video of them during the clashes.”", "At least 50 people have been killed in sectarian violence that broke out in Delhi in February 2020, AFP reported here on March 7, 2020.", "On March 1, 2020, Digvijay Singh, a prominent politician in India's main opposition Congress Party, shared the video on his official Facebook here alongside a similar claim. The post has been viewed more than 65,00 times.", "The two-minute 14 seconds video was also shared alongside a similar claim on Facebook here, here and here; on Twitter here and here; and on YouTube here.", "The claim is false.", "A reverse image search on Yandex for a keyframe extracted from the footage found it has circulated in reports about police firing at anti-citizenship law protests in Firozabad, a city in the Indian state of Uttar Pradesh.", "The video was published without the superimposed red circle on Twitter here on January 1, 2020, by a journalist working for The Times of India, a Mumbai-based English-language newspaper.", "Below is a screenshot comparison of the video in the misleading posts (L) and the Twitter video (R):", "The journalist, Arvind Chauhan, also published an article about the video in The Times of India on January 1, 2020.", "“Days after a senior police official of Agra range in UP claimed that no bullet was fired during the anti-CAA protest in Firozabad on December 20, at least four videos have emerged in which police are not only shows purportedly firing at the protesting mob, but are also helped by unidentified civilians, who are seen throwing stones from their side,” the article reads.", "Violence in Firozabad on December 20, 2019, was also reported by several other media outlets, for example here, here and here.", "The unrest erupted after India passed a new citizenship law which critics have claimed discriminates against Muslims, AFP reported on December 12, 2019.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]