["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "After a weekend of nationwide demonstrations in protest of immigration restrictions on entry from seven nations, President Donald Trump blamed the media for misreporting his controversial executive order and said it was an extension of former President Barack Obama’s policies.", "\"My policy is similar to what President Obama did in 2011 when he banned visas for refugees from Iraq for six months. The seven countries named in the Executive Order are the same countries previously identified by the Obama administration as sources of terror,\" Trump wrote in a Jan. 29 statement. \"To be clear, this is not a Muslim ban, as the media is falsely reporting.\"", "To refresh, Trump issued an executive order on Jan. 27 barring citizens of Iraq, Syria, Iran, Yemen, Somalia, Sudan and Libya from entering the United States for 90 days. It also puts Syrian refugee admissions on hold indefinitely. (We go over some of the key issues in this explainer.)", "In 2011, Obama’s state department stopped processing Iraqi refugee requests for six months, though it didn’t disclose the policy like Trump did, ABC reported in 2013.", "So, are the policies similar as Trump claimed?", "In the most superficial of ways, yes. They both limit immigration into the United States on a temporary basis. But there are two significant differences that Trump omits.", "In 2011, there was a specific threat", "First, Obama’s suspension was in direct response to a failed plot by Iraqi nationals living in Bowling Green, Ky., to send money, explosives and weapons to al-Qaida. The two men were arrested by the FBI in May 2011 for actions committed in Iraq and trying to assist overseas terrorist groups.", "Both had entered the United States as refugees after lying about their past terrorism ties on paperwork. One man worked as a bombmaker in Iraq, and the FBI even matched his fingerprints to an unexploded IED discovered in 2005 in Iraq, raising questions about the thoroughness of the vetting process.", "Trump’s ban, meanwhile, is more preemptive. As PolitiFact reported, no refugee or immigrant from any of the seven countries targeted by the ban has been implicated in any fatal terrorist attack in the United States, though perpetrators of at least three non-deadly cases were connected to Iran or Somalia.", "Obama’s order was narrower in scope", "Second, the scope of the two policies is slightly different. Obama’s 2011 order put a pause on refugee processing, whereas Trump’s halt in entries applies to all non-U.S. visitors.", "It should also be noted that Iraqi refugees were still admitted to the United States every month in 2011, though there was a significant drop after May of that year. Here’s a chart with data from the state department:", "According to the New York Times, the Obama administration also required new background checks for visa applicants from Iraq after the Bowling Green incident. Lawmakers at a 2012 congressional hearing also indicated that the Department of Homeland Security expanded screening to the Iraqi refugees already settled in the United States.", "But again, these are different from a blanket ban on visitors. Obama, speaking through a spokesperson, disagreed with the comparison in a statement.", "There are other precedents for temporary halts in immigration. A 2016 Congressional Research Service report notes that refugee admissions were also briefly suspended after the Sept. 11, 2001, terrorist attack to review the security procedures, leading to an overhaul of the system. A special subset of refugee admissions for reuniting families was suspended in 2008 in certain locations in Africa after higher rates of fraud.", "So like Obama’s 2011 suspension, both the post-9/11 and African cases were in reaction to immediate issues and limited to refugees.", "Trump’s order is broader, and his administration has provided no evidence it is in response to any particular event.", "The seven countries on Trump’s list", "While not necessarily part of this fact-check, Trump’s suggestion that he selected the seven countries as a continuation of Obama’s policy is imprecise.", "According to the executive order, Trump’s action applies to \"countries designated pursuant to Division O, Title II, Section 203 of the 2016 consolidated Appropriations Act.\"", "That refers to a 2015 act, signed into law by Obama, revising the United States’ visa waiver program. The visa waiver program allows citizens from 38 countries to enter the United States without a visa for up to 90 days. Under the legislation, citizens of those 38 countries who had traveled to Iraq, Syria, Iran, and Sudan after March 2011 were no longer eligible for the visa waiver. Libya, Yemen, and Somalia were later added to the list.", "In other words, Obama’s actions dealt with people who had visited Iraq, Syria, Iran, Sudan, Libya, Somalia and Yemen, not citizens of those countries, and it did not prohibit them from entering the United States.", "Our ruling", "Trump said, \"My policy is similar to what President Obama did in 2011 when he banned visas for refugees from Iraq for six months.\"", "The Obama administration in 2011 delayed processing Iraqi refugees for six months following evidence of a failed plot by two Iraqi refugees.", "Trump’s executive order temporarily bars travel to the United States for all citizens from seven countries, and it is not in direct response to actions from citizens of those countries.", "Furthermore, Iraqi refugees were nonetheless admitted to the United States during the 2011 suspension while Trump has put an indefinite ban on Syrian refugees.", "We rate Trump’s claim Mostly False.", "PolitiFact, \"Trump's immigration ban: 4 key questions answered,\" Jan. 29, 2017", "PolitiFact, \"Rep. Peter King says Islamic State tried to attack Fort Knox in 2011,\" Sept. 23, 2014", "PolitiFact, \"No terrorist attacks post 9/11 by people from countries in Trump's travel ban?,\" Jan. 29, 2017", "State Department, Summary of Refugee Admission, FY 2009, 2010, 2011, 2012 and 2013", "Washington Post, \"Obama rejects comparison between Trump’s immigration policy and his own, encourages protests,\" Jan. 30, 2017", "Congressional Research Report, \"Refugee Admissions and Resettlement Policy,\" Nov. 30, 2016", "Huffington Post, Draft of Executive Order, accessed Jan. 30", "Congress.gov, H.R.158, Jan. 6, 2015", "Washington Post, \"Trump's facile claim that his refugee policy is similar to Obama's in 2011,\" Jan. 29, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]