["A Chick-fil-A fast food restaurant in Jacksonville. Chick-fil-A, specializing in chicken sandwiches, has over 1,700 restaurants in the United States. (Shutterstock)", "Some Facebook users are implicating Chick-fil-A in a Ugandan bill that would impose the death penalty for gay sex.", "\"Today Uganda announced a bill to legalize murdering gay people,\" reads one popular post, which was published Oct. 14. \"National Christian Organization paid a preacher to go to Uganda and help their lawmakers with the bill. Chick-fil-a (sic) funds National Christian Org.\"", "\"If you eat at Chick-fil-a, this is what your money goes to.\"", "The post, which is a screenshot of a tweet, was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.) The post refers to a bill in Uganda, where homosexuality is already illegal, that would punish gay sex with death. The bill was nullified five years ago on a technicality, but lawmakers have announced plans to revive it.", "In essence, the post is claiming that Chick-fil-A’s charitable contributions have been used to promote the death penalty for gay people in Uganda. Similar claims about the fried chicken chain and the Uganda bill have been shared thousands of times, so we wanted to check it out.", "Here’s what we found:", "• The nonprofit the Facebook post is referencing is the National Christian Foundation.", "• The preacher mentioned in the post did travel to Uganda around the time lawmakers were debating an anti-LGBTQ bill, but there’s no evidence he helped craft it.", "• The foundation run by Chick-fil-A’s owners has donated to the National Christian Foundation in the past, but it doesn’t currently.", "An American evangelical preacher supported by the National Christian Foundation did travel to Uganda in 2010, the same year the country was debating an anti-LGBTQ bill. But Colorado-based preacher Lou Engle didn’t \"help their lawmakers with the bill,\" as the Facebook post claims.", "Let’s focus first on what Engle did or didn’t do while in Uganda.", "Engle is the co-founder of TheCall Ministries, a defunct evangelical Christian group known for anti-LGBTQ views. It aimed to start \"a John the Baptist type movement to fast and pray in preparation for a 3rd great awakening.\"", "In 2010, Engle traveled to Kampala, Uganda, to be the guest of honor at a Sunday prayer and rally about \"homosexuality, witchcraft, corruption and the fear of violence leading up to the country’s presidential election next year,\" the New York Times reported.", "Uganda's President Yoweri Museveni signs a new anti-gay bill that sets harsh penalties for homosexual sex, in Entebbe, Uganda Monday, Feb. 24, 2014. (AP)", "At the time, Ugandan lawmakers were debating a bill that broadened the criminalization of homosexuality and imposed the death penalty. A different version of the bill, which imposed life sentences instead of the death penalty, was signed into law in 2014, resulting in sanctions from the United States and other countries. A court annulled it later that year due to a legislative technicality.", "Engle was not directly linked to the legislation in Uganda, and he issued a statement ahead of his rally condemning the bill’s harsh penalties for homosexuality. However, during his rally in Kampala, Engle did praise the country’s \"courage\" and \"righteousness\" in pursuing the bill, the Times reported.", "The National Christian Foundation is a Georgia-based religious nonprofit and one of the largest charities in the United States. It was founded in 1982 by tax attorney Terry Parker, financial adviser Ron Blue and evangelical Christian author Larry Burkett.", "The National Christian Foundation gave TheCall $500 in 2009 and $300 in 2010, according to the group’s public tax documents. In 2008, TheCall received a much larger donation from the foundation — more than $160,000.", "It’s unclear to what extent those donations were explicitly for traveling to Uganda, if at all. TheCall announced it was closing sometime in 2018, according to the Wayback Machine.", "A 2012 investigation from the Atlantic found that, in 2008, the National Christian Foundation gave money to Ed Silvoso, a minister who founded a fundamentalist group called Harvest Evangelism, to work with a Ugandan bishop advocating for legislation imposing the death penalty for gay sex.", "Chick-fil-A did not support Uganda’s anti-gay bill, and connecting the company to it requires several steps.", "Most of the company and its owners’ charitable giving is conducted through two nonprofit foundations: the Chick-fil-A Foundation and the WinShape Foundation. The former was created by the company in 2012 and the latter was founded by the Cathy family 1984.", "Public tax records show the Chick-fil-A Foundation has not contributed money to the National Christian Foundation. However, the reverse is true — the National Christian Foundation gave the Chick-fil-A Foundation hundreds of thousands of dollars in 2014 and 2015.", "The WinShape Foundation’s tax records paint a different picture.", "We analyzed the foundation’s returns dating back to 2009, when the National Christian Foundation was donating to Engle’s TheCall. We found that WinShape’s contributions to the National Christian Foundation totaled $240,000 in 2009 and $247,500 in both 2010 and 2011. The National Christian Foundation has also donated hundreds of thousands of dollars to WinShape over the past decade.", "RELATED: Instagram post misconstrues food companies’ support for Donald Trump", "We asked Chick-fil-A and the WinShape Foundation why they passed money back and forth over the years. WinShape didn’t respond, and the company didn’t comment on the tax returns.", "\"The WinShape Foundation is a private family organization. The Chick-fil-A Foundation is the official philanthropic arm of Chick-fil-A, Inc.,\" the spokesperson said. \"Chick-fil-A has not supported legislative campaigns of any kind in Uganda.\"", "The National Christian Foundation has a track record of donating to anti-LGBTQ groups, such as the Alliance Defending Freedom and the Family Research Council. The former has supported sterilizing transgender people while the latter has defended the discredited practice of conversion therapy.", "In 2012, following comments from Chick-fil-A CEO Dan Cathy opposing same-sex marriage, Chick-fil-A said it would \"leave the policy debate over same-sex marriage to the government and political arena.\" But 2017 tax documents from the company and its owners’ foundations show it still donates to organizations with negative views of homosexuality, including the Fellowship of Christian Athletes and the Paul Anderson Youth Home.", "A Facebook post of a tweet claimed that Chick-fil-A has contributed to the National Christian Foundation, which then funded a preacher to travel to Uganda to help lawmakers craft an anti-gay bill.", "News reports show that the evangelical preacher Lou Engle did travel to Uganda in 2010, around the time that lawmakers were crafting a bill that would have imposed the death penalty for gay sex. However, Engle did not directly contribute to the legislation. While he complimented Ugandans for their stance against homosexuality, he denounced the harsh penalties proposed in the bill.", "Federal tax returns show that the National Christian Foundation contributed to Engle’s evangelical Christian group in 2009, before his trip. Documents also show that the WinShape Foundation, which is run by Chick-fil-A’s owners, donated to the National Christian Foundation in 2009, but the link between the company and Uganda’s anti-gay legislation is weak.", "The post contains an element of truth but ignores critical facts that would give a different impression. We rate it Mostly False.", "The Atlantic, \"Mission From God: The Upstart Christian Sect Driving Invisible Children and Changing Africa,\" April 10, 2012", "BBC, \"Uganda court annuls anti-homosexuality law,\" Aug. 1, 2014", "BBC, \"Ugandan President Yoweri Museveni signs anti-gay bill,\" Feb. 24, 2014", "BBC, \"US imposes sanctions on Uganda for anti-gay law,\" June 19, 2014", "Business Insider, \"Here's How Much Money Chick-fil-A Gives To Anti-Gay Groups,\" July 5, 2012", "TheCall, \"A Letter from the Desk of Lou Engle,\" accessed Oct. 22, 2019", "CBS News, \"Family Research Council Lobbied Congress on Resolution Denouncing Ugandan Anti-Gay Bill,\" June 4, 2010", "Chick-fil-A Foundation Inc., Form 990 for period ending December 2012", "Chick-fil-A Foundation Inc., Form 990 for period ending December 2013", "Chick-fil-A Foundation Inc., Form 990 for period ending December 2014", "Chick-fil-A Foundation Inc., Form 990 for period ending December 2015", "Chick-fil-A Foundation Inc., Full text of \"Form 990PF\" for fiscal year ending Dec. 2016", "Chick-fil-A Foundation Inc., Full text of \"Form 990, Schedule B\" for fiscal year ending Dec. 2016", "Chick-fil-A Foundation Inc., Full text of \"Form 990PF\" for fiscal year ending Dec. 2017", "Chick-fil-A Foundation Inc., Full text of \"Form 990, Schedule B\" for fiscal year ending Dec. 2017", "Email interview with a Chick-fil-A spokesperson, Oct. 23, 2019", "Facebook post, Oct. 14, 2019", "Family Research Council, \"Homosexuality,\" accessed Oct. 22, 2019", "National Christian Charitable Foundation Inc., Form 990 for period ending December 2008", "National Christian Charitable Foundation Inc., Form 990 for period ending December 2009", "National Christian Charitable Foundation Inc., Form 990 for period ending December 2010", "National Christian Foundation about page, accessed Oct. 23, 2019", "Newsweek, \"U.S.’s biggest Christian charity reportedly channeled $56.1 million to purported hate groups,\" March 20, 2019", "The New York Times, \"Chick-fil-A Thrust Back Into Spotlight on Gay Rights,\" July 25, 2012", "Press release from Chick-fil-A, \"Chick-fil-A Response to Recent Controversy,\" July 31, 2012", "Press release from Chick-fil-A, \"Where does the Foundation donate money?\" March 21, 2019", "Reddit post, Oct. 12, 2019", "Reuters, \"Uganda plans bill imposing death penalty for gay sex,\" Oct. 10, 2019", "Southern Poverty Law Center, \"Lou Engle,\" accessed Oct. 21, 2019", "ThinkProgress, \"Chick-fil-A donated to anti-LGBTQ group that bars employees from ‘homosexual acts,’\" March 20, 2019", "Tweet, Oct. 12, 2019", "Tweet, Oct. 13, 2019", "TWOCare, \"The National Christian Foundation Anti-LGBT Funding Encyclopedia,\" June 14, 2014", "WhoIs, accessed Oct. 22, 2019", "WinShape Foundation about page, accessed Oct. 22, 2019", "WinShape Foundation Inc., Form 990 for period ending December 2009", "WinShape Foundation Inc., Form 990 for period ending December 2010", "WinShape Foundation Inc., Form 990 for period ending December 2011", "WinShape Foundation Inc., Form 990 for period ending December 2012", "WinShape Foundation Inc., Form 990 for period ending December 2013", "WinShape Foundation Inc., Form 990 for period ending December 2014", "WinShape Foundation Inc., Form 990 for period ending December 2015", "WinShape Foundation Inc., Full text of \"Form 990PF\" for fiscal year ending Dec. 2016", "WinShape Foundation Inc., Full text of \"Form 990, Schedule B\" for fiscal year ending Dec. 2016", "WinShape Foundation Inc., Full text of \"Form 990PF\" for fiscal year ending Dec. 2017", "WinShape Foundation Inc., Full text of \"Form 990, Schedule B\" for fiscal year ending Dec. 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]