["About this rating", "A heartwarming story set in an East Tennessee hospital in 2016 received international coverage, but without confirmation of key details:", "Eric Schmitt-Matzen looks every bit the part of Santa Claus.", "His 6-foot frame carries 310 pounds, leaving “just enough of a lap for the kids to sit on,” he says with a gentle Kringley chuckle right out of Central Casting.", "No fake facial fuzz for this guy. Schmitt-Matzen’s snowy beard is the real thing, albeit regularly bleached to maintain its whiteness. His shag is so spectacular, in fact, it won first place in the “natural full beard, styled moustache” division of a 2016 national contest sponsored by the Just For Men hair products company.", "There’s more.", "He’s professionally trained. Custom-tailored in red. Was born on Dec. 6 (that’s Saint Nicholas Day, of course; are you surprised?) Works approximately 80 gigs annually. Wife Sharon plays an authentic Mrs. Claus. His cellphone, with a “Jingle Bells” ringtone, continually counts down the days until Christmas. Even his civilian attire always includes Santa suspenders.", "The whole shtick is designed to spread joy and have fun.", "Which it does – except for the role he played several weeks ago at a local hospital.", "“I cried all the way home,” Schmitt-Matzen told me. “I was crying so hard, I had a tough time seeing good enough to drive.", "“My wife and I were scheduled to visit our grandchildren in Nashville the next day, but I told her to go by herself. I was a basket case for three days. It took me a week or two to stop thinking about it all the time. Actually, I thought I might crack up and never be able to play the part again.”", "This is what happens when a terminally ill child dies in Santa’s arms.", "“I’d just gotten home from work that day,” recalled Schmitt-Matzen, 60, a mechanical engineer and president of Packing Seals & Engineering in Jacksboro.", "“The telephone rang. It was a nurse I know who works at the hospital. She said there was a very sick 5-year-old boy who wanted to see Santa Claus.", "“I told her, ‘OK, just let me change into my outfit.’ She said, ‘There isn’t time for that. Your Santa suspenders are good enough. Come right now.’ ”", "Schmitt-Matzen got to the hospital in 15 minutes. He met the lad’s mother and several family members.", "“She’d bought a toy from (the TV show) PAW Patrol and wanted me to give it to him,” he said, voice growing husky. “I sized up the situation and told everyone, ‘If you think you’re going to lose it, please leave the room. If I see you crying, I’ll break down and can’t do my job.’ ”", "Nobody entered with him. They watched, sobbing, from a hallway window in the Intensive Care Unit.", "I’m now going to relay what happened next, just as Schmitt-Matzen spoke to me. Space does not allow inclusion of the numerous pauses he took while struggling to maintain composure:", "“When I walked in, he was laying there, so weak it looked like he was ready to fall asleep. I sat down on his bed and asked, ‘Say, what’s this I hear about you’re gonna miss Christmas? There’s no way you can miss Christmas! Why, you’re my Number One elf!", "“He looked up and said, ‘I am?’", "“I said, ‘Sure!’", "“I gave him the present. He was so weak he could barely open the wrapping paper. When he saw what was inside, he flashed a big smile and laid his head back down.", "‘“They say I’m gonna die,’ he told me. ‘How can I tell when I get to where I’m going?’", "“I said, ‘Can you do me a big favor?’", "“He said, ‘Sure!’", "“When you get there, you tell ’em you’re Santa’s Number One elf, and I know they’ll let you in.", "“He said, ‘They will?’", "“I said, ‘Sure!’", "“He kinda sat up and gave me a big hug and asked one more question: ‘Santa, can you help me?’", "“I wrapped my arms around him. Before I could say anything, he died right there. I let him stay, just kept hugging and holding on to him.", "“Everyone outside the room realized what happened. His mother ran in. She was screaming, ‘No, no, not yet!’ I handed her son back and left as fast as I could.", "“I spent four years in the Army with the 75th Rangers, and I’ve seen my share of (stuff). But I ran by the nurses’ station bawling my head off. I know nurses and doctors see things like that every day, but I don’t know how they can take it.’”", "In despair, Schmitt-Matzen was ready to hang up his suit. “I’m just not cut out for this,” he reasoned.", "But he mustered the strength to work one more show.", "“When I saw all those children laughing, it brought me back into the fold. It made me realize the role I have to play.", "“For them and for me.”", "Eric Schmitt-Matzen's account of an encounter with a 5-year-old boy was first printed by the Knoxville News-Sentinel on 12 December 2016, before it was picked up by USA Today.  Schmitt-Matzen himself did interviews with both local and international outlets.", "According to the story by columnist Sam Venable, Schmitt-Matzen, a mechanical engineer who moonlights as a part-time Santa Claus, was contacted by a friend working as a nurse at a local hospital and asked to visit the boy. Schmitt-Matzen arrived moments before the boy's death, having just enough time to hold him in his final moments.", "Venable told us that Schmitt-Matzen has refused to identify the family, the hospital, or the nurse involved in the story in follow-up interviews. However, Schmitt-Matzen did backtrack from his initial claim that he reached the facility in 15 minutes, saying instead that it was in East Tennessee.", "According to Venable, the News-Sentinel was still investigating Schmitt-Matzen's claim, proclaiming: \"Certainly, if we are in error on this, we want to be the very first to come out and say -- if there is an error -- it's on us.\"", "We contacted several hospitals in Knoxville for comment. Both the East Tennessee Children's Hospital and the University of Tennessee Medical Center confirmed that a visit like the one Schmitt-Matzen described did not occur at their respective facilities. Tennova Healthcare, which manages several hospitals in the area, told the Washington Post that it did not take place at any affiliated facility.", "It is unclear whether a scenario like the one Schmitt-Matzen described constitutes privacy violations for the patient and his family under the Health Insurance Portability and Accountability Act of 1996. We contacted both the Tennessee Department of Health and the federal Department of Health and Human Services seeking comment.", "On 14 December 2016, the News-Sentinel released a separate story, attributed to Venable and Editor Jack McElroy, saying they could not verify the story:", "The News Sentinel cannot establish that Schmitt-Matzen’s account is inaccurate, but more importantly, ongoing reporting cannot establish that it is accurate.", "Therefore, because the story does not meet the newspaper’s standards of verification, we are no longer standing by the veracity of Schmitt-Matzen’s account.", "Another Knoxville news outlet, WBIR-TV, posted a story a day later saying that it \"verified several critical details of this story\" while agreeing not to publish them.", "The station's story cited interviews with Schmitt-Matzen's wife, Sharon Schmitt-Matzen, as well as a friend identified as Daniel Cunningham. It also cited -- but did not quote -- text messages sent from Eric Schmitt-Matzen's phone to Cunningham and another friend on the night of the alleged visit, which WBIR said took place in October 2016. It does not, however, state whether the station confirmed this account with any healthcare facility. Reporter Becca Habegger told us:", "We're pointing everyone to our web story online and letting that speak for itself.", "Since Schmitt-Matzen has reiterated his account of the visit, we cannot say with absolute certainty that it didn't happen — nor do we want to have to say it. He did not respond to a request for comment from us but did tell the Post:", "If some people want to call me a liar ... I can handle that better than I can handle a child in my arms dying. It’s sticks and stones.", "However, it's also impossible to say that it did, because of an apparent lack of vetting of his claims by the multiple media outlets that ran with the story without following up on Venable's initial reporting or finding a second source for the claim.", "In this way, this particular Santa tale served an instructive purpose: it showed how an unvetted story can spread regardless of how true it might be, with each news outlet repeating it making it seem that much closer to the truth until it is, at last, uncritically reported as fact.", "Venable, Sam.   \"Story of Santa with Dying Child Can't Be Cerified.\" \r\n    USA Today.   14 December 2016.", "Konstantinides, Anneta and Hannah Parry.   \"Terminally-Ill Boy, Five, Dies in Santa Claus' Arms After Fulfilling One Last Wish to See Him.\" \r\n    Daily Mail.   12 December 2016.", "McElroy, Jack and Sam Venable.   \"Story of Santa Claus with Dying Child Can't Be Verified.\" \r\n    Knoxville News-Sentinel.   14 December 2016.", "Crowe, Michael and Becca Habegger.   \"Facts Verified in Santa's Hospital Visit Story.\" \r\n    WBIR-TV.    15 December 2016.", "Larimer, Sarah et al.   \"Everyone Forwarded This Viral Santa Story. But It Might Not Be True.\" \r\n    The Washington Post.   14 December 2016.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]