["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "President Joe Biden boards Air Force One at Andrews Air Force Base, Md., for a weekend trip to Wilmington, Del., Friday, Feb. 5, 2021. (AP Photo)", "• Any Air Force plane carrying the president is technically Air Force One.", "• Two planes are typically designated with the Air Force One call sign: an iconic military plane and a smaller one used for domestic flights. On a trip to Delaware on Feb. 5, Biden took the smaller plane.", "• Joe Biden is the president of the United States. ​", "On Friday, Feb. 5, President Joe Biden boarded Air Force One and flew to his home state of Delaware.", "As images of the trip emerged, some social media users seized on the fact that Biden was taking a plane different from the one that often transported Donald Trump when he was president.", "\"Biden’s Air Force One is not the same as Trump’s Air Force One,\" reads the title of a video published Feb. 6 on Bitchute, which shows the photos of the different planes sandwiched between graphics that show the word \"LIE\" stamped across headlines declaring \"Biden Wins.\"", "\"Media lied to you about Joe flying on AF1,\" reads a Feb. 7 Facebook post with a similar claim. \"Notice the difference... AF1 is in the top photo complete with seal. The bottom plane is a Boeing C-40 the one Joe flew on … used for high profile government officials to fly on but NOT the President. President flies on AF1 or Marine 1. Notice the little things... and you’ll catch them in their lies!\"", "These posts imply that Biden is not flying on Air Force One because he is not the real commander-in-chief, furthering a baseless conspiracy theory that the November election was not legitimate.", "This theory is not based in fact, and it rests on a flawed understanding of Air Force One.", "Air Force One isn’t the name of a particular plane. It’s the air traffic control sign designating any Air Force aircraft carrying the president. In other words, any Air Force plane carrying the president is called Air Force One.", "There are two types of planes typically designated for carrying the president: a Boeing VC-25A and a Boeing C-32. The VC-25A is the iconic military plane most commonly associated with Air Force One, while the C-32 is typically used for shorter domestic flights and flights to small airports that can’t support the much larger VC-25A.", "Biden’s flight from Washington, D.C. to Delaware lasted only 25 minutes, so he took the C-32 plane. Images from Feb. 5 show him disembarking from the plane at Wilmington Airport.", "Former President Donald Trump was frequently filmed and photographed taking the C-32 plane as well. So was President Barack Obama.", "Joe Biden is the president of the United States. He was duly inaugurated as the 46th U.S. president on Jan. 20. The day’s events were witnessed and documented by elected officials, former presidents, military members, reporters, photographers and performers. They were also broadcast and live-streamed by several outlets including ABC, CNN, C-SPAN, Fox News, NBC and PBS.", "Posts claim that \"Biden’s Air Force One is not the same as Trump’s Air Force One,\" which means that Biden is not the real president.", "Any Air Force plane transporting the president is designated with the Air Force One call sign.", "On a trip to Delaware, Biden took a small plane the president uses for short domestic flights and flights to small airports. Trump also took that plane when he was president.", "These posts are inaccurate and ridiculous. Pants on Fire!", "RELATED: Biden took a private plane to his inauguration. He’s still the legitimate president", "Bitchute video, Feb. 6, 2021", "Facebook post, Feb. 7, 2021", "Whitehouse.gov, Air Force One", "PolitiFact, Yes, Biden’s inauguration was legitimate. No, this isn’t a movie, Jan. 29, 2021", "New York Times, After years in government, Biden has a new perk: Air Force One, Feb. 5, 2021", "Onward State, University Park Airport ideal destination for slimmer Air Force One, Feb. 4, 2011", "U.S. Air Force, C-32 Fact Sheet, Sep. 21, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]