["North Carolina Gov. Roy Cooper speaks at a press conference about the coronavirus outbreak.", "To limit the spread of coronavirus, authorities are asking some businesses to close and allowing some to stay open.", "That’s the case in North Carolina, where Gov. Roy Cooper has issued a stay-at-home order and deemed some businesses \"essential.\" Gas stations, grocery stores and home supply stores like Home Depot are among the businesses considered essential and allowed to stay open.", "North Carolina’s state-run liquor stores are also considered essential.", "Why? NC state Sen. Jeff Jackson, a Democrat from Mecklenburg County, recently addressed that question on Twitter.", "\"Why are liquor stores still open?\" Jackson asked rhetorically in an April 6 tweet.", "\"It’s because we have a lot of people who are chemically dependent on alcohol and if we suddenly cut off their access they would go into withdrawal and flood the emergency rooms, which we can’t have right now,\" he said.", "Is that true?", "The governor’s office is in charge of designating which businesses are \"essential\" and allowed to stay open. But Cooper’s executive order didn’t offer a reason why liquor stores or any other businesses are considered essential.", "Kelly Haight Connor, spokeswoman for North Carolina’s Department of Health and Human Services, told PolitiFact in an email that the reasoning was simple.", "\"People need to stay home as much as possible. And while restaurants, bars and other areas of communal gathering must be closed, people should be able to buy items used in their day to day lives,\" she said.", "PolitiFact could find no proof that Cooper’s decision to designate liquor stores as essential businesses was made to accommodate people who might be dependent on alcohol.", "Further, if liquor stores were hypothetically asked to close, North Carolinians could still access alcohol in the form of wine and beer at grocery stores.", "When we reached out to Jackson about this claim, his office noted that individual ABC boards across the state have the flexibility to decide whether or not they want to remain open.", "Jeff Strickland, a spokesman for the ABC Commission, confirmed each of the state’s 170 boards does, indeed, have that freedom. \"If a board wants to close down, they have that authority,\" Strickland said.", "The commission doesn’t have an official stance on why its stores should or shouldn’t remain open, he added.", "To that end, Jackson’s office pointed out that some ABC store operators have cited alcohol dependency as a reason for staying open.", "Jackson’s office emailed us an article by WLOS in Asheville, where local ABC manager Jason Thacker told WLOS that he’s heard concerns about overwhelming hospitals.", "\"Studies show that abruptly limiting access to alcohol could lead to an increase in withdrawal for people with severe alcohol use disorder and add to the burden of the health care system, which is the last thing that needs to happen right now,\" Thacker told WLOS.", "Jackson’s office also provided links to stories about why liquor stores are being kept open in other states such as Connecticut, New Jersey and Texas. In Connecticut, for example, Gov. Ned Lamont said there’s a medical reason behind the exemption for liquor stores.", "\"I think the thought process by the (Connecticut) governor is that if we do close the liquor stores this could create an unnecessary problem and really cut off a needed resource,\" Dr. Andrew Lim, the medical director of Bristol Hospital’s Emergency Department, told NBC News in Connecticut.", "However, addiction specialists aren’t unified in their belief that liquor store access will prevent emergency room admissions.", "John Watkins, who owns Johnston Counseling Services, told WRAL that people who are physically dependent on alcohol could suffer withdrawal symptoms in less than a day if they can’t access it.", "But Ward Blanchard, president of The Blanchard Institute addiction recovery center in Charlotte, told Spectrum News that leaving ABC stores open could also lead to ER admissions. He said some who are dependent on alcohol could, if left alone with high volumes of it, go overboard.", "\"When you are in a situation where people are isolated and there is already stress and anxiety, and then you throw liquor on top of that, I think that would overthrow a healthcare system more so than closing it would,\" Blanchard said.", "Jackson said liquor stores are still open because \"we have a lot of people who are chemically dependent on alcohol and if we suddenly cut off their access they would go into withdrawal and flood the emergency rooms, which we can’t have right now.\"", "Gov. Cooper is responsible for determining which businesses are considered essential, and his administration hasn’t mentioned alcohol dependency as a reason for the designation.", "The only evidence Jackson cited was an ABC operations manager in Asheville who said some store owners are concerned about closures potentially affecting the hospital system. But it’s not clear that that concern is shared among all 170 ABC store owners.", "Jackson’s statement contains an element of truth but ignores critical facts that would give a different impression about North Carolina’s Executive Order. We rate it Mostly False.", "Tweet by North Carolina state Senator Jeff Jackson on April 6, 2020.", "North Carolina Gov. Roy Cooper’s Executive Order on March 27, 2020.", "Email correspondence with Dylan Arant, spokesman for NC Sen. Jeff Jackson.", "Email statement from Kelly Haight Connor, spokeswoman for North Carolina’s Department of Health and Human Services.", "Telephone interview with Jeff Strickland, spokesman for the ABC Commission.", "Story by WLOS, \"Why are liquor stores open during stay home orders?\" posted April 9, 2020.", "Story by NBC Connecticut, \"Liquor Stores Essential for Health Reasons, Other Businesses Left in Limbo,\" posted March 23, 2020.", "Story by MSN, \"Nearly all businesses in NJ are closed. Why are liquor stores considered 'essential'?\" posted March 29, 2020.", "Story by the Houston Chronicle, \"Here’s why Harris County allowed liquor stores to remain open,\" posted March 25, 2020.", "Story by WRAL, \"Two Johnston County ABC store workers tested for COVID-19,\" posted April 2, 2020.", "Story by Spectrum News in Charlotte, \"Why ABC Liquor Stores are Considered Essential,\" posted March 26, 2020.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]