["About this rating", "Speaking to listeners on Feb. 13, 2020, conservative commentator and radio host Rush Limbaugh first told listeners of the nationally syndicated \"Rush Limbaugh Show\" that he had advanced lung cancer.", "Roughly one year later, when he died on Feb. 17, 2021, Snopes readers turned to us to investigate whether that announcement — or anything else — led to his retirement or an official end to his broadcasting career.", "During the 2020 segment, the 69-year-old said doctors discovered the disease after he complained of some shortness of breath and that he was preparing to undergo treatment immediately, taking him off-air for a few days, multiple reputable news outlets reported. \"It is what it is,\" he reportedly said. \"This has happened, and my intention is to come here every day I can.\"", "Then, months later, he told listeners in another episode that his cancer was progressing, despite several treatment regimens. “It’s tough to realize that the days where I do not think I’m under a death sentence are over,” Limbaugh said in October, according to news reports.", "But Limbaugh said at that time that he intended to keep headlining the show, and he did.", "We found no evidence of Limbaugh announcing his retirement since his show debuted in 1988. He last hosted an episode on Feb. 2, 2021, before his death, according to video archives of the show. After that, guests rotated through the hosting spot, but there was no indication (whether in show notes or public statements) that Limbaugh would not return, or that he had officially ended his career in the public eye.", "According to former President Donald Trump, who called into Fox News Channel as news of Limbaugh's death circulated, the broadcaster remained active in the high-profile conservative media sphere \"till the very end,\" and that they spoke three or four days prior to his death.", "For those reasons, we rate this claim \"False.\"", "At its peak, Limbaugh's program drew in more than 20 million listeners. The National Association of Broadcasters Hall of Fame inducted him in 1998, and, in early 2020, Trump awarded Limbaugh the Presidential Medal of Freedom. Simultaneously, he was widely criticized for bigoted, racist, sexist, homophobic and false remarks. See our investigations into his comments over the years here.", "Jessica Lee is Snopes' Senior Assignments Editor with expertise in investigative storytelling, media literacy advocacy and digital audience engagement.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]