["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Andrew White, shown here at an Austin gathering in January 2018, separately said a large number of Texas school districts don't offer sex education. HALF TRUE, PolitiFact Texas found (MARK MATSON, for the Austin American-Statesman).", "Houston businessman Andrew White, a Democratic aspirant for governor, said that when he’s elected, he’ll step up sex education in schools.", "White, speaking in January 2018 to David Martin Davies of Texas Public Radio, declared: \"There is a large number of schools in Texas that don’t even offer sex education. Now that, to me, it’s bizarre. So we have to make these investments. If you really are serious about reducing the demand for abortion, there are some really simple ways to do that -- sex education and access to contraceptives.\"", "We wondered if a large number of Texas schools don’t offer sex education.", "After emailing White's campaign to ask how he reached his conclusion, we noticed that the Austin-based Texas Freedom Network, which describes itself as the state’s watchdog for monitoring far-right issues, estimated in 2017 that 25.1 percent of the state’s school districts in 2015-16 didn’t teach sex education in their secondary schools--when just 2 percent weren’t doing so in 2007-08, the group previously found.", "Broadly, the group’s February 2017 report states that in 2015-16, about eight in 10 Texas school districts taught abstinence alone \"or nothing at all when it comes to sex education.\" Abstinence-plus programs, including information on contraceptives, showed up in nearly 17 percent of districts.", "The results were reached starting from a survey sent to 138 of 976 Texas school districts that had high schools that weren’t also charter school districts--plus the state’s 10 highest-enrollment districts. Districts were \"representative of the diversity in geography, enrollment, racial demographics and district type (rural, urban or non-metropolitan/smaller cities) in Texas public schools,\" the report says.", "The report concedes that it didn’t pin down precisely what’s taught to students in each district.", "Rather, the group asked which textbooks, third-party programs or curricula and/or speakers that districts had obtained and/or used to teach sex education in middle and high schools. Also, the report says, \"we asked specifically for materials districts had obtained from crisis pregnancy centers or other alternative-to-abortion organizations, any materials that cover sexual orientation, gender identity/expression or abortion, and copies of class schedules and district policies.\"", "To our inquiry, a network spokesman, Dan Quinn, listed the 35 sampled districts found not to be teaching sex education--nearly all of them rural.", "Health class in high schools", "Quinn also told us by email: \"A key factor in the increase in the percentage of school districts not offering sex education appears to be the Legislature’s decision in 2009 to drop health class as a high school graduation requirement.\"", "The 2009 Legislature and then-Gov. Rick Perry advanced House Bill 3 into law. It directed the State Board of Education to spell out the classes students would have to pass to fulfill different kinds of graduation plans. Yet the law barred the board from specifying electives, such as health, as classes that had to be taken to graduate.", "Quinn wrote: \"Health class is often where students get sex ed. Many school districts either continue to offer health as an elective or make it a local graduation requirement, but a substantial number of school districts appear to have dropped health classes since 2009.\"", "The network’s 2017 report states: \"We found that districts with no health class were more than four times more likely to offer no sex education at all (as compared with the overall distribution of districts). Conversely, school districts with health classes were more likely to offer either abstinence-plus or abstinence-only sex education. This finding suggests that the decision to remove health education as a state graduation requirement has contributed to the rise in the percentage of districts that teach students nothing at all about human sexuality in high school,\" the report says.", "Health classes don’t necessarily cover sex education", "We further learned that just because a district offers a health class doesn’t mean its students take the class or that the class covers more than the state-required emphasis on abstinence alone as the best practice.", "The state’s curriculum guidelines for the one-semester health class call for students to analyze the \"effectiveness and ineffectiveness of barrier protection and other contraceptive methods.\" They otherwise say each student is expected to analyze the importance of abstinence from sex as the only method that’s 100 percent effective in preventing pregnancy and sexually-transmitted diseases.", "But Lauren Callahan, a spokeswoman for the Texas Education Agency, cautioned against presuming the guidelines show what’s being taught because, she noted, that’s up to individual districts. State law requires each district board of trustees to establish a local school health advisory council to \"assist the district in ensuring that local community values are reflected in the district's health education instruction.\" Also, the law says each board shall choose course materials related to sex education with the council’s advice.", "Notably too, not all students lately take health classes. Callahan pointed us to annual school health surveys undertaken by the agency. Per the latest results, nearly 52 percent of districts and charter schools in 2015-16 indicated they weren’t requiring all high school students to take \"health education\" to graduate--with 48 percent replying that they did require every student to take a class in health education.", "Study: Abstinence-plus instruction isn’t widespread", "The study estimated that 58 percent of districts offered abstinence-only sex education. In contrast, the study says, nearly 17 percent of districts were taking an abstinence-plus approach by having medically accurate information on condoms and other forms of contraception. Quinn noted that in 2007-08, the network previously found, about 4 percent of districts took an abstinence-plus approach.", "Quinn, asked to identify the districts in its 2017 sample that were found to have abstinence-plus teaching materials, listed 30 districts, including eight of the state’s 10 highest-enrollment districts--such as the Houston, Dallas, Fort Worth and Austin districts. But, Quinn wrote, determining \"how those ab-plus materials are used in classrooms — whether teachers use them as suggested, skip portions, or whatever — was beyond the scope of this project.\"", "Similarly, David C. Wiley, a Texas State University education professor who worked on the study, told us by phone: \"There’s no guarantee that teachers are actually teaching that information.\"", "Upshot: \"Texas kids don’t get much information about contraception,\" Wiley said.", "As we completed this research, Desi Canela of White's campaign said by email that White reached his conclusion about schools not offering sex education based on the network's 2017 study.", "Our ruling", "White said a \"large number\" of Texas schools don’t offer sex education.", "In fact, most districts offered sex education in high school in 2015-16, according to a statewide analysis, though nearly 60 percent were teaching abstinence alone. The study estimated that 25 percent of districts didn't offer sex education.", "On balance, we rate this claim Half True.", "HALF TRUE – The statement is partially accurate but leaves out important details or takes things out of context. Click here for more on the six PolitiFact ratings and how we select facts to check.", "Web post and audio, \"Texas Matters: White, Valdez Vie For Democratic Gubernatorial Nomination,\" Texas Public Radio, Jan. 26, 2018 (statement at 9:37 mark)", "Emails, Dan Quinn, communications director, Texas Freedom Network,  Jan. 31 and Feb. 2 and 5-7, 2018", "Report, \"Conspiracy of Silence, Sexuality Education in Texas Public Schools,\" Texas Freedom Network, February 2017", "News story, \"Study: A quarter of Texas public schools no longer teach sex ed,\" the Texas Tribune, Feb. 14, 2017", "Texas Administrative Code, Section 115.32, \"Health 1, Grades 9-10 (One-Half Credit),\" effective Sept. 1, 1998 (accessed Feb. 13, 2018)", "Phone interview, David C. Wiley, PhD, professor of education, Texas State University, Feb. 6, 2018", "Legislation, House Bill 3, \"History,\" \"Actions,\" \"Text\" and \"Enrolled Bill Summary,\" 2009 regular legislative session, Texas Legislature Online (accessed Feb. 5, 2018)", "Emails, Lauren Callahan, media relations and social media manager, Texas Education Agency, Feb. 1 and 6, 2018", "Email, Desi Canela, communications director, Andrew White campaign, Feb. 8, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]