["The administrator of the General Services Administration has formally designated Joe Biden the apparent winner of the presidential election, and some of Biden’s supporters are gloating.", "\"If you’re having a bad day, just remember, Trump is watching Biden’s inaugural stage being built on the White House North Lawn,\" reads the description of an image circulating on Facebook. \"For the next 59 days :-).\"", "The picture shows a bird’s-eye view of two white structures across from the White House. Several posts sharing the image were flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "That’s because it’s from 1993 and shows a viewing stand from Bill Clinton’s presidential inauguration.", "Construction is underway on the presidential inaugural platform for 2021, but it’s being erected in its usual spot, on the west side of the Capitol (you can see images here and here).", "The National Park Service has also issued a permit for the construction of the inaugural facilities in Lafayette Square, which includes the stand where the new president watches the parade and a media riser, the Washington Post reported.", "But the image that’s being shared on Facebook doesn’t show Biden’s inaugural stage being built, as posts claim.", "We rate them False.", "This fact check is available at IFCN’s 2020 US Elections #Chatbot on WhatsApp. Click here, for more.", "Facebook post, Nov. 23, 2020", "The New York Times, The G.S.A. administrator has formally designated Biden the apparent winner of the presidential election, Nov. 24, 2020", "Smithsonian, William J. Clinton presidential inauguration, aerial view of White House, 1993", "Washington Post, What will Inauguration Day look like amid a pandemic? Nov. 19, 2020", "Roll Call, Biden or Trump, inaugural planning and construction well underway on Capitol Hill, Nov. 5, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]