["A 37-second clip of a press conference addressed by president of the United States Donald Trump and Matt Sauce, president and CEO of the North-American division of Roche Diagnostics is widely circulating on social media. As per the accompanying claim, president Trump announced that the pharmaceutical company has succeeded in developing a vaccine for the novel coronavirus (COVID-19) which will be launched “next Sunday”.", "Trump announced that Roche Medical Company will launch the vaccine next Sunday, and millions of doses are ready from it !!! The end of the play", "What’s app forward", "Test Kit is ready not the vaccine by Pranjali Dani", "Posted by Shivani Dani Wakhare on Monday, 16 March 2020", "In the clip, Sauce can be heard saying, “From Roche, we want to thank the FDA for their rapid approval of our coronavirus test. We really appreciate the partnership with the CDC and the FDA to get that to market it as fast a possible because it is critical for us to make that available to help patients in need and working with laboratories to get it going in the near future which will bring hundreds and thousands of tests available to patients in need in the United States.”", "Now, Donald Trump announced that Roche Medical Company will launch the vaccine next Sunday and millions of doses are ready for it.. The end of the play.#CoronavirusOutbreak pic.twitter.com/euQhkmg5Xq", "— Naheed Tariq (@NaheedTariq5) March 16, 2020", "The fact that CEO of Roche Diagnostics, Matt Sauce, spoke of testing, not a vaccine, is the first clue which points at the falseness of the viral message. The 37 seconds have been clipped from a press conference held at the White House by president Trump and can be watched from 18:40 minutes in the video below. As evident, Sauce thanks the Food and Drug Administration (FDA) and the Centers for Disease Control and Prevention (CDC) for the “rapid approval” of the coronavirus test developed by his company.", "This was also tweeted by Roche Diagnostics. As reported, the new coronavirus test speeds up the ability to test suspected patients by tenfold.", "Thanks @RocheDiaUSA for sharing, and to all the manufacturing and logistics teams involved in making this happen. #coronavirus #COVID19 https://t.co/d8tloXcnAH", "— Roche Diagnostics (@RocheDia) March 17, 2020", "US senator Rand Paul wrote in a tweet, “Good news: FDA approves Roche coronavirus test that is 10 times faster than current test.”", "Good news: FDA approves Roche coronavirus test that is 10 times faster than current test.", "We should push hard for further and continued removal of government barriers while fighting this crisis. https://t.co/X3otO3BKIF", "— Senator Rand Paul (@RandPaul) March 16, 2020", "The viral claim that Swiss drugmaker Roche Diagnostics has successfully developed a coronavirus vaccine is therefore false. In fact, there are no approved vaccines for the infection yet. Drug companies and researchers are trying to find ways to handle the new coronavirus. As per a Forbes Tracker, the status of the research is in the trial period. Organisations have either begun human testing or have partnered with international bodies such as the World Health Organisation (WHO), CDC, etc, regarding testing. Some of the vaccines are also in the development stage. As per Forbes, a new vaccine takes 10-15 years to be developed however the process can be more rapid due to the advancement of technology in the last few years,", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]