["About this rating", "UPDATE [May 20, 2022]: The rating on this fact check has been changed from \"Unproven\" to \"False\" following several reports about the continued existence — albeit in a reduced form — of Amber Heard's role in \"Aquaman 2.\" In July 2021, the film's producer, Peter Safran, rejected claims that social media pressure led Heard to be fired from the film. “I don’t think we’re ever going to react to, honestly, pure fan pressure,” said Safran. “You gotta do what’s best for the movie … We felt that if it’s James Wan, and Jason Momoa, it should be Amber Heard. That’s really what it was.” In late April 2022, film reporter Grace Randolph tweeted that Heard has \"less than 10 min of screentime\" in the film, scheduled for release in March 2023.", "On Feb. 28, 2021, several publications reported that actress Amber Heard had been fired from her role in the upcoming \"Aquaman 2\" film. She had played the character Mera in the first installment as well as in an earlier DC Universe film, \"Justice League.\" These reports have not been confirmed by Warner Bros. or DC Entertainment, and the claims come amid a larger dispute between Heard, Heard's ex-husband, Johnny Depp, and the pair's respective fan bases.", "In an article published on the website Latestly, and then syndicated in a Yahoo! News story, an anonymous source was quoted as saying:", "Amber Heard did not pass her physical examination. She’s put on some pounds and is in terrible shape. There is a clause in her contract which says she is required to be in good form ahead of shooting and she violated that.", "Heard's purported firing, if true, would be the result many fans or defenders of actor Depp had been pushing for since Depp was removed from production of the movie \"Fantastic Beasts 3.\" Depp and Heard have accused each other of domestic violence and abuse, and their divorce has been messy and public, as described by the comic book focused news site CBR:", "Heard wrote a piece for the Washington Post in late 2018 describing Depp's abuse and Depp sued her for defamation in early 2019, seeking $50 million in damages, as he believed that the claims of abuse led to Disney declining to include Depp in their upcoming Pirates of the Caribbean reboot.", "After failing to get the suit dismissed, Heard then countersued with her own defamation suit, seeking $100 million in damages. Recently, Depp lost a related defamation suit in the United Kingdom where he sued a British newspaper for repeating Heard's claims in an article.", "The judge in the case ruled that the facts supported referring to Depp as a \"wife-beater.\" As a result, Depp was then fired from the upcoming Fantastic Beasts sequel.", "In response to Depp's being fired from \"Fantastic Beasts 3,\" his fans started several petitions to have Heard, who has been accused of abuse by Depp, removed from \"Aquaman 2.\"", "At this time, however, the claim that Heard is no longer involved in \"Aquaman 2\" is an unverified rumor. When the claim first went viral, Ryan Parker, a senior writer for The Hollywood Reporter, tweeted that he was \"told by a reliable source that reports of Amber Heard being fired off \"Aquaman 2\" are inaccurate.\"", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]