["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Bernie Sanders and Hillary Clinton are battling for the \"most progressive\" label in the Democratic presidential primary, and for Sanders that includes his call for free tuition at public colleges and universities.", "During the Feb. 4 debate in New Hampshire, Sanders argued that there is a precedent for free tuition in the United States and overseas.", "\"Now, all of the ideas that I'm talking about, they are not radical ideas,\" Sanders said. \"Making public colleges and universities tuition-free, that exists in countries all over the world, used to exist in the United States.\"", "How common is free college tuition worldwide and did it used to exist in the United States?", "College costs overseas", "A spokesman for Sanders referred us to a 2014 report from the Organization for Economic Co‑operation and Development, a group that compares data on a variety of topics in advanced industrial nations.", "We obtained the 2015 report from OECD that showed the number of countries with no tuition as of 2013-14: Denmark, Estonia, Finland, Norway, Slovak Republic, Slovenia, Sweden and Turkey.", "Germany also now has free tuition at public universities, although students pay some fees.", "\"Yes, it’s free -- it’s the German taxpayer paying for it,\" said Peter Kerrigan, deputy director of German Academic Exchange Service. \"Somebody is footing the bill. It’s just not the student.\"", "For the Nordic countries that charge no tuition, individuals face high income tax rates.", "The approach to funding higher education \"reflects these countries’ deeply rooted social values, such as equality of opportunity and social equity,\" states an OECD report.", "College tuition in the U.S.", "College tuition has never been set on a nationwide basis, said John R. Thelin, professor at the University of Kentucky and author of A History of American Higher Education. Instead, it has been set by each state or college and is subject to approval by the legislature or board of trustees.", "However, there are examples of some colleges or universities offering free tuition decades ago, especially universities established through federal land grants starting in the 1860s.", "\"Public colleges and universities were often free at their founding in the United States, but over time, as public support was reduced or not increased sufficiently to compensate for their growth in students and costs (faculty and staff salaries, utilities etc.), they moved first to a low tuition and eventually higher tuition policy,\" said Cornell University professor Ronald Gordon Ehrenberg.", "For example, California offered free tuition to in-state students until the 1970s, although it charged an \"incidental fee\" starting in 1921.", "Baruch College in New York was founded in 1847 as the Free Academy, the first free public institution of higher education in the nation, according to the college, which is now part of the City University system of New York. At least some students were paying by the early 20th century, and 1976 marked the end of any tuition-free policy.", "At the University of Florida, a school catalog from 1905-06 stated: \"No tuition is charged to students whose home is in Florida.  All other students will be required to pay a tuition fee of twenty ($20) dollars per year.\"", "Public higher education was often free when a very small percentage of students attended, said Roger L. Geiger, education professor at Penn State and author of The History of American Higher Education: Learning and Culture from the Founding to World War II.", "\"Historically, many individual institutions refrained from student charges, including early Stanford. Community colleges were often free, being considered an extension of secondary schools.\" he said.", "In Sanders’ home state at the University of Vermont, a book about the school’s history indicates that tuition was charged in the 19th century. Senior class tuition was $8.34 in 1827.", "\"I don't think there was ever a time that UVM did not charge tuition,\" said Jeffrey D. Marshall, director of research collections.", "Sanders talked about public colleges, but we heard about at least one private university that offered free tuition for decades: Rice Institute, later which became Rice University. That university in Texas charged tuition for the first time in 1965. There are also a few small private colleges or universities that are tuition free today, such as Berea College.", "Our ruling", "Sanders said, \"Making public colleges and universities tuition free, that exists in countries all over the world, used to exist in the United States.\"", "There are at least nine advanced countries that offer free college, including the recent addition of Germany.", "There was a time in the United States when some public colleges and universities charged no tuition. However, tuition has never been set as a national policy -- it is a decision for each school or state government officials. And some colleges charged tuition dating back to the 1800s.", "Sanders' statement is accurate but needs clarification. We rate this statement Mostly True.", "Organization for Economic Cooperation and Development, \"Education at a Glance,\" 2014", "Good, \"Whatever happened to when college was free?\" April 3, 2010", "City University of New York, \"When tuition at CUNY was free, sort of,\" Oct. 12, 2011", "Baruch College, Overview, Accessed Feb. 9, 2016", "The Daily Californian, \"The history of UC tuition since 1868,\" Dec. 22, 2014", "University of California, History digital archives, Accessed Feb. 9, 2016", "Reason, \"What Bernie doesn’t understand about Germany’s free college,\" Oct. 22, 2015", "BBC, \"How US students get a university degree for free in Germany,\" June 3, 2015", "Washington Post op-ed by Bernie Sanders, \"Make college free for all,\" Oct. 22, 2015", "The European, \"An American dilemma,\" Feb. 4, 2015", "Times Higher Education, \"Germany’s great tuition fees U-Turn,\" Feb. 13, 2014", "Los Angeles Times, \"Why you can get a free college education in Germany but not California,\" Oct. 29, 2015", "Best College Reviews, \"8 colleges where students attend for free,\" Accessed Feb. 8, 206", "Interview, Warren Gunnels, Bernie Sanders campaign spokesman, Feb. 8, 2016", "Interview, John R. Thelin, University of Kentucky research professor and author of A History of American Higher Education, Feb. 8, 2016", "Interview, Roger L. Geiger, education professor at Penn State and author of The History of American Higher Education: Learning and Culture from the Founding to World War II, Feb. 8, 2016", "Interview, Roger Williams, former executive director of Penn State Alumni Association and author of The Origins of Federal Support for Higher Education: George W. Atherton and the Land-Grant College Movement, Feb. 9, 2016", "Interview, Ronald Ehrenberg, Cornell University professor of industrial and labor relations and economics, Feb. 8, 2016", "Interview, Andrew P. Kelly, American Enterprise Institute, Resident Scholar in Education Policy Studies, Director, Center on Higher Education Reform, Feb. 9, 2016", "Interview, Peter R. Kerrigan, Deputy Director, German Academic Exchange Service (DAAD) in New York, Feb. 9, 2016", "Interview, Suzanne Bronski, Baruch College spokeswoman, Feb. 9, 2016", "Interview, B.J. Almond, Rice University spokesman, Feb. 8, 2016", "Interview, Dianne Klein, University of California Office of the President spokeswoman, Feb. 9, 2016", "Interview, Jeffrey D. Marshall, University of Vermont director of research collections, Feb. 8, 206", "Interview, Dennis Kramer, Assistant Professor of Higher Education and the Associate Director of the University of Florida’s Institute for Higher Education, Feb. 8, 2016", "Interview, Peggy McBride, University of Florida university archivist, Feb. 9, 2016", "Interview, Donna Winchester, University of Florida spokesperson, Feb. 9, 2016", "Interview, Miguel Gorman, Organization for Economic Cooperation and Development, Feb. 8, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]