["The 3 min 32 sec video appears in this Facebook post published on January 27, 2019, and since viewed more than 1.8 million times.", "It is a series of shots showing roads built on steep mountain slopes, across valleys and over rivers.", "The post's caption says: \"China has now opened the 880 km highway linking their country to Pakistan See what it looks like…\"", "Many other online posts containing the same video and a similar caption have been viewed more than two million times across various social media platforms – for example here and here on Facebook, here and here on Twitter, and here on YouTube.", "A reverse image search traces the footage to this January 7, 2019 Twitter post by China Xinhua News, a verified English-language account of China’s state news agency Xinhua.", "The caption of the Xinhua post says: \"An engineering marvel. Over half of the Ya'an-Xichang Expressway in Sichuan is viaducts and tunnels. #AmazingChina\"", "An engineering marvel. Over half of the Ya'an-Xichang Expressway in Sichuan is viaducts and tunnels. #AmazingChina pic.twitter.com/Ab9N0Ryxen", "The Ya'an-Xichang Expressway, also known as Yaxi Highway, is \"a 240-kilometer-long road connecting Ya'an and Xichang in southwest China's Sichuan province\", says China.org.cn, a Chinese government website.", "It opened to drivers in April 2012, according to this Facebook post by state-run newspaper China Daily.", "Many of the shots in the video carried by the misleading posts match those in the shorter video in the Xinhua tweet, as can be seen in the composite image below:", "This post on Chinese social network Weibo by Sichuan Daily, one of the main local media outlets in Sichuan province, contains the same 3 min 32 sec video that appears in the misleading posts.", "The clip does not feature white text overlaid on the footage, as seen in the video posted by Xinhua.", "The caption on the Weibo post says: \"Incredible! Sichuan's 'web star road', Yaxi Highway. Driving on the expressway, going through mountains and above the water, is extremely spectacular\".", "There is a road which connects China and Pakistan through northwest China's Xinjiang province, called Karakoram Highway.", "The 1,300-kilometre road, also known as the China-Pakistan Friendship Highway, was built by Chinese and Pakistani governments decades ago. Here is an AFP report about the Karakoram Highway.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]