["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Winston Churchill wasn’t known to shy away from making bold statements.", "But in today’s world, internet quote generators make it incredibly easy to attribute any statement to any historical figure without proper sourcing or documentation.", "Such is the case for a meme recently shared on Facebook that quotes the famed British leader as saying, \"When Muslims are the minority they are concerned with minority rights, when they are in the majority there are no minority rights.\" One user then captioned the post, \"From Winston Churchill: an undeniable source.\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Spoiler alert: There’s no evidence that Churchill ever said that.", "We consulted the National Churchill Museum at Westminster College in Fulton, Mo., for any record of the quote.", "Timothy Riley, chief curator of the museum, told PolitiFact he found no evidence to suggest that Churchill made the statement.", "\"There is no record in the vast written record to attribute this to Winston Churchill,\" Riley wrote.", "A search for the quote on the International Churchill Society website also yielded no results.", "Richard Langworth, senior fellow at the Hillsdale College Churchill Project, included the quote in his running list of \"All the ‘Quotes’ Winston Churchill Never Said.\"", "Snopes reported that the quote doesn’t seem to have appeared anywhere prior to 2015 — \"making it extremely unlikely they originated with a man who passed away in 1965.\"", "We rate this false Churchill quote Pants on Fire!", "Facebook post, Dec. 19, 2018", "PolitiFact.com, \"NFL's Colin Kaepernick incorrectly credits Winston Churchill for quote about lies,\" Oct. 9, 2017", "PolitiFact.com, \"Greg Abbott tweets bogus Winston Churchill quotation about anti-fascists,\" Aug. 7, 2018", "Snopes.com, \"Winston Churchill on Muslims and Minority Rights,\" Nov. 28, 2018", "Richard M. Langworth, \"All the \"Quotes\" Winston Churchill Never Said (2),\" Nov. 16, 2018", "International Churchill Society resources, Accessed Dec. 20, 2018", "Email interview, Timothy Riley, chief curator of the National Churchill Museum, Dec. 20, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]