["About this rating", "The Joker character, as portrayed by actor Heath Ledger in Christopher Nolan's 2008 Batman film The Dark Knight, is often regarded as one of the greatest movie antagonists of all time. The late actor was responsible for some of the film's most memorable moments, such as the opening bank robbery, the gruesome disappearance of a pencil, and the time the Joker jumped over an injured Batman on a skateboard.", "That last part, at least, appears to be the story behind a doctored viral photograph:", "This image has been circulating online since at least 2009, and although a number of websites have weighed in and determined that the skateboard visible in the picture is a digital addition, the image continues to fool a few internet users every time it's reposted on social media.", "One of the most famous scenes from Nolan's Dark Knight took place on the streets of Gotham (Chicago), as Batman attempted to chase down the Joker and his band of thieves. At the end of the pursuit, Christian Bale's Dark Knight swerved his vehicle to avoid running over Gotham's new villain, crashing it and ending up sprawled prone on the street.", "The Joker then approached the motionless Batman and did a little jump over his body. The original unedited image almost certainly stems from the filming of this scene, which can be glimpsed around the 4-minute mark in the following video:", "The original picture was used as a promotional image for the film by Warner Bros. and has been archived on the Movie Stills Database since November 2008.", "Here's a comparison of the genuine film still (left) and the doctored skateboard image (right):", "A faint Warner Bros. watermark can be spotted in the bottom right corner of both of these images.", "Although this viral image is a doctored one, actor Heath Ledger truly did skateboard around Chicago during the filming of The Dark Knight.  As far as we can tell, however, Warner Bros. did not release any official images of the actor costumed as the Joker while riding a skateboard:", "Chan, Casey.   \"Why the Joker in The Dark Knight Was the Ultimate Villain.\"\r\n    Gizmodo.   23 August 2016.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]