["About this rating", "A video shared to the nature appreciation subreddit r/NatureIsFuckingLit in November 2020 showed a woman breaking the stem of a plant apart and blowing what appear to be bubbles from its sap.", "The video in question was posted by user @bravebroccoli and had received more than 106,000 views at the time of this writing. But it’s not the first video to show these “bubble plants,” which have been cropping up on the internet since at least 2016. A number of Snopes readers asked us to verify the legitimacy of this video, which we determined to be authentic.", "Commonly known as the “Barbados Nut,” Jatropha curcas joins more commonly known plants like the cassava and cassava-oil plant in the family Euphorbiaceae. More than 175 species of this semi-evergreen shrub-like tree exist. It is native to the tropical regions of Central America, Mexico, and the Caribbean, but it can also be found in Southeast Asia and Africa. J. curcas can grow up to 20 feet tall and, oddly enough, its milky sap can also be used to blow bubbles.", "\"[The sap] seems to be full of saponins which are the sudsy part of soap. I knew the plant for its biofuel uses. The seeds are high in oil content and can be processed into biofuel and it grows easily in waste areas of warm climates,\" Emily Magnaghi, botany collections manager at the California Academy of Sciences in San Francisco, told Snopes in an email.", "“The greenish, viscid juice and pounded leaves are rubefacient and styptic and can cause inflammation of the eyes. The sap can cause dermatitis but is used by children in Malaysia and in Africa for blowing bubbles,” wrote the authors of the Botanical Dermatology Database, an electronically digitized version of the 1979 book of the same name.", "Toxicity varies from tree to tree, so before you go blowing bubbles, be sure that the sap you're tapping into doesn't contain harmful toxins.", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]