["A global survey from around 2014 found that 24% of people thought the USA was the country that posed the greatest danger to world peace.", "Correct.", "“A few years ago, I think it was 2014 but don’t hold me to that, Gallup which is an American polling company, did a global survey, 66 countries, over 100,000 people, so this was not just radical, crazy, leftist, and they asked people which country in the world was the greatest danger to world peace. This was before Trump came into office. 25%—24% to be precise—responded the United States of America.”", "Akala, 10 May 2018", "This widely-reported figure appears to come from a poll done by the WIN/Gallup International network of market research agencies.", "It dates from 2013, when Barack Obama was President of the United States.", "An archived press release tells us that “The US was the overwhelming choice (24% of respondents) for the country that represents the greatest threat to peace in the world today. This was followed by Pakistan (8%), China (6%), North Korea, Israel and Iran (5%). Respondents in Russia (54%), China (49%) and Bosnia (49%) were the most fearful of the US as a threat.” We’ve not been able to find more detailed results of the survey.", "According to the press release, the questions were asked in 65 countries, to around a thousand people in each country.", "Gallup International (not to be confused with the separate US polling firm Gallup) does not appear to have repeated the question more recently.", "Full Fact fights for good, reliable information in the media, online, and in politics.", "Bad information ruins lives. It promotes hate, damages people’s health, and hurts democracy. You deserve better.", "Full Fact, 17 Oval Way, London, SE11 5RR", "Full Fact is a registered charity (no. 1158683) and a non-profit company (no. 06975984) limited by guarantee and registered in England and Wales. © Copyright 2010-2023 Full Fact. Thanks to Bytemark for donating our web hosting.\n                        \n                        Privacy, terms and conditions."]