["About this rating", "In early August 2020, Snopes readers inquired about a widely seen Facebook post containing dozens of names of political and public figures alongside sexual-misconduct accusations against them — and the claim that the names represented an \"unsealed\" list  maintained by Ghislaine Maxwell, a long-time associate of billionaire financier and convicted sex offender Jeffrey Epstein.", "\"Giselle Maxwell's list became unsealed some time yesterday and here's what happened while everyone was strategically distracted by the covid bullsh*t,\" the message of the Facebook post read, misspelling Maxwell's first name. \"Shows connection to Epstein over the years.\"", "The list contains the names of familiar men, such as Virginia State Sen. Joe Morrisey, disgraced former Subway ad spokesman Jared Fogle, and film director Roman Polanski. The cases listed are not connected to each other or to the Epstein case, but instead are a compilation of (mostly) influential men who have been accused and/or convicted of sexual misconduct.", "Epstein was arrested in July 2019 on sex-trafficking charges and committed suicide in jail while awaiting trial. The billionaire financier and previously convicted sex offender was accused of trafficking girls to be victimized by some of the most powerful people in the world. Maxwell, Epstein's ex-girlfriend, was arrested on related charges in July 2020; prosecutors claim she facilitated Epstein's sexual abuse of minors.", "Because Epstein and Maxwell associated with the world's political and celebrity elite, their activities have been the subject of public fascination and rumor.", "It's true that a federal judge made public previously sealed court documents from a defamation lawsuit against Maxwell filed by Epstein accuser Virginia Giuffre; among the documents were transcripts from a 2016 deposition given by Giuffre. But the unsealed documents, which were uploaded from the federal court records database PACER and posted online by the legal news website Law & Crime, don't contain the list of names in the Facebook post.", "We should note several \"lists\" exist associated with the Epstein case, including the names of people who have flown on his private plane and the people listed in Epstein's \"black book\" directory. However, these lists have been in the public domain since well before the most recent court documents were unsealed.", "Chappell, Bill and Scott Neuman. \"Judge Releases Trove Of Sealed Records Related To Lawsuit Against Ghislaine Maxwell.\"\r\n  NPR. 31 July 2020.", "Keller, Aaron. \"Secret Jeffrey Epstein Documents Have Been Released by Court Order. Read Them All Here.\"\r\n  Law & Crime. 30 July 2020.", "Winter, Tom. \"Who is Jeffrey Epstein, and Why Has He Been Arrested Again?\"\r\n  NBC News. 11 July 2019.", "Weiser, Benjamin and Nicole Hong. \"Ghislaine Maxwell Tried to Hide When F.B.I. Knocked, Prosecutors Say.\"\r\n  The New York Times. 13 July 2020.", "Chappell, Bill. \"Ghislaine Maxwell Arrested, Charged in Connection to Jeffrey Epstein Abuse Case.\"\r\n  NPR. 2 July 2020.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]