["Throughout Joe Biden's presidential campaign and transition, he has promised to address the disproportionate economic damage the coronavirus pandemic has had on minority communities.", "After he discussed prioritizing aid to small businesses owned by people of color and women at an event Jan. 8, conservative critics are using a 30-second clip from a roughly 25-minute speech to accuse Biden of discriminating against white men.", "“Listen to this clip where Joe Biden is openly recommending racial discrimination,” far-right podcast host Dan Bongino said when introducing the clip.", "“Our focus will be on small businesses on Main Street that aren’t wealthy and well-connected, that are facing real economic hardships through no fault of their own,” Biden says. “Our priority will be Black, Latino, Asian and Native American-owned small businesses, women-owned businesses, and finally having equal access to resources needed to reopen and rebuild. But we’re going to make a concerted effort to help small businesses in low-income communities in big cities, small towns and rural communities that have faced systematic barriers to relief.”", "Fact check:What's true about the Capitol riot, from antifa to BLM to Chuck Norris", "“Did I just hear Joe Biden say that they’re basically going to de-prioritize aid relief to white males who own businesses?” Bongino asked after showing the clip. “No, that’s exactly what he said.”", "Bongino encouraged viewers to read an article titled “Biden Pushes Idea of Discriminating Based on Race, Sex in Stimulus Plan” on the conservative website Townhall.", "Other conservative critics, such as former George W. Bush Press Secretary Ari Fleischer and Fox News commentator Brit Hume, criticized Biden on Twitter for his remarks.", "Bongino, whose video has more than 59,000 reactions and 16,000 comments, has not responded to USA TODAY’s request for comment.", "USA TODAY has fact-checked another claim by Bongino contending that a Black Democrat had expressed racist views toward white people.", "Fact check:Opinion piece on Trump misattributed to former California mayor", "Biden made the statement at an event at the Queen theater in Wilmington, Delaware, where he was announcing Cabinet picks.", "C-SPAN video of Biden’s announcement shows he was discussing anticipated increased access to relief for businesses owned by people of color and women because they have been disproportionately affected by COVID-19 economic hardship.", "The Biden-Harris transition team shared an 87-second clip of Biden’s remarks on Twitter Jan. 10.", "“Think of the mom-and-pop owner with a couple of employees who can’t pick up the phone and call a banker, who doesn’t have a lawyer, an accountant, to help them through this complicated process, to know if they’re even qualified, or who simply didn’t know where this relief is available in the first place,” Biden continues in the longer video.", "He did not specifically explain how his plan would prioritize people of color or women.", "On Jan. 14, Biden announced a $1.9 trillion spending package focused on quickening vaccine distribution and providing economic relief. His plan includes $15 billion in grants for small businesses.", "Throughout his campaign, Biden has criticized  former President Donald Trump's economic response to the pandemic, which he claims “largely shut out minority business owners from COVID-19 recovery funds.”", "Fact check:The Insurrection Act is not in effect and is unnecessary in DC", "On his campaign website he promised to “swiftly end the racial inequity in small business support by ensuring that minority-owned businesses get effective access to all of these tools, as well as access to technical assistance – such as accounting support and legal advice – so that they are not shut out of federal aid programs.”", "USA TODAY contacted Biden’s transition team for comment and has yet to receive a response.", "The pandemic has hit small businesses hard, and the damage has been even more devastating for businesses owned by people of color.", "According to data from the National Bureau of Economic Research, African American businesses saw a 41% drop in business activity from February until April, Latino businesses saw a 32% drop, and Asian businesses dropped by 26%. Female-owned businesses saw a similarly disproportionate effect with a 25% decrease in business activity.", "That is in contrast to a 17% decrease white business owners have faced.", "A University of Michigan study found that in May 2020, less than 0.5% of Black business owners reported they had received COVID-19 aid from the government, compared with 9% of non-Black business owners.", "Fact check:Fake tweet used to claim AOC called for a 'purge' of conservatives", "The researchers concluded that the disparity was likely a result of systemic barriers that prevented Black business owners from accessing relief.", "We rate the claim that President-elect Joe Biden admitted plans to discriminate against white men in COVID-19 economic relief MISSING CONTEXT because it is misleading without additional information. Longer video of Biden's remarks shows he was discussing increasing aid to businesses owned by people of color and women because they have been disproportionately affected by the economic crisis.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]