["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The administration of former President John F. Kennedy sent National Guard troops to accompany the first black students admitted to the universities of Mississippi and Alabama. Did Kennedy also wonder whether God is black?", "\"What if we go to heaven and we, all our lives, have treated the Negro as an inferior, and God is there, and we look up and He is not white?\" begins a quote a May 6 Facebook post attributes to JFK. \"What then is our response?\"", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The photo of the Kennedy featured in the post isn’t JFK, though. It’s his brother, Robert F. Kennedy.", "And it was RFK — not the former president — who actually made the statement in question.", "RFK was a senator when, two years before he was assassinated in Los Angeles, he went to South Africa in 1966 and gave a speech against apartheid. When he returned to the United States, he wrote about the trip in Look magazine. The article was titled, \"Suppose God Is Black.\" He wrote:", "\"During five days this summer, my wife Ethel and I visited South Africa, talking to all kinds of people representing all viewpoints. Wherever we went — Pretoria, Cape Town, Durban, Stellenbosch, Johannesburg — apartheid was at the heart of the discussion and debate.", "\"Our aim was not simply to criticize but to engage in a dialogue to see if, together, we could elevate reason about prejudice and myth. At the University of Natal in Durban, I was told the church to which most of the white population belongs teaches apartheid as a moral necessity. A questioner declared that few churches allow black Africans to pray with the white because the Bible says that is the way it should be, because God created Negroes to serve.", "\"‘But suppose God is black,’ I replied. ‘What if we go to heaven and we, all our lives, have treated the Negro as an inferior, and God is there, and we look up and hs is not white? What then is our response?'\"", "The post named the wrong Kennedy. We rate this claim False.", "Facebook post, May 6, 2019", "AP Images, RFK Home, June 19, 1966", "AP Images, Kennedy brothers, Aug. 23, 1963", "NPR, \"Remembering RFK’s visit to the ‘Land of Apartheid,\" Aug. 12, 2011", "Look, \"Suppose God Is Black,\" Aug. 23, 1966", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]