["About this rating", "On Oct. 22, 2019, Daily World Update published an article positing that three leading U.S. Democrats were under investigation for orchestrating a coup d'etat against President Donald Trump:", "Three Leading Democrats Facing Indictment for Orchestrating a Coup d’etat", "Inside sources at Justice say there are three prominent Democrats under investigation for orchestrating a coup d’etat against the President. If you’re not certain what the law considers a coup, here it is:", "Coup D’Etat (v) from the Latin “to overthrow” – A Coup d’etat occurs when anyone from an opposing political party plans to oust the opposing party’s leader through means other than those prescribed by the US Constitution. A coup doesn’t have to include violence; it can also come in the form of false charges of crimes they may or may not have committed or through deriding a person’s character by exposing their personal shortcomings.", "This item was not a factual recounting of real-life events. The article originated with a website that describes its output as being humorous or satirical in nature, as follows:", "Everything on this website is fiction. It is not a lie and it is not fake news because it is not real. If you believe that it is real, you should have your head examined. Any similarities between this site’s pure fantasy and actual people, places, and events are purely coincidental and all images should be considered altered and satirical. See above if you’re still having an issue with that satire thing.", "Readers could have also determined that the article about was a work of fiction by checking on the category in which it was published (\"Satire Guaranteed to Enrage the Common Tater\") or by clicking on any of the links in the article.", "While links are typically used to direct readers to related content and supporting information, the links here directed readers to various joke content, such as a gif of Hillary Clinton laughing, a definition for the word \"dementia,\" and a Google translate page for the term \"Prepare to read the dumbest shit imaginable.\"", "For background, here is why we sometimes write about satire/humor.", "Daily World Update.   \"Three Leading Democrats Facing Indictment for Orchestrating a Coup d'etat.\r\n    22 October 2019.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]