["Conservative media outlets have circulated articles claiming that President Donald Trump’s 2020 campaign is selling plastic straws with the president’s name on them.", "\"Triggering leftists, Trump's reelection campaign is selling plastic straws,\" reads a headline from one of the outlets, PJ Media, on July 20, 2019.", "One website, PoliticalCowboy.com, praises the merchandise as \"brilliant, hilarious and timely\" and mentions that \"bans on single-use plastics (especially drinking straws) are all the rage in leftist circles today.\" LouderWithCrowder.com described Trump’s \"troll game\" as \"top notch.\"", "These posts were flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.) We wondered if the headlines were really true.", "Yes, it is. Red straws etched with the white lettering of \"Trump\" are available in a pack of 10 on the Trump 2020 online collection of campaign merchandise.", "\"Liberal paper straws don’t work. STAND WITH PRESIDENT TRUMP and buy your pack of recyclable straws today,\" reads the description of the straws.", "The campaign told PolitiFact that the straws were added to the online store last week.", "Local and state governments, such as Seattle and California, have enacted restrictions on single-use plastic straws. Alternative straws, such as paper ones, are being sold in affected areas like San Francisco.", "The stories shared on Facebook follow a July 18 tweet from Brad Parscale, Trump’s 2020 presidential campaign manager, about paper straws.", "I’m so over paper straws. #LiberalProgress This is exactly what they would do to the economy as well. Squeeze it until it doesn’t work. pic.twitter.com/zKfiZiSHV5", "The Trump straws sold out on July 19, according to a tweet from Elizabeth Harrington, national spokesperson for the Republican National Committee. Parscale tweeted later that day that they were \"once again available.\"", "Parscale also tweeted July 22 that the campaign had raised more than $200,000 from the Trump straws.", "We have sold more than 140,000 straws. That is over $200,000 raised.More than half of all Straw purchasers were BRAND NEW small dollar donors.Amazing!", "The Trump campaign is selling plastic straws. They are advertised as reusable.", "We rate this headline True.", "Shop.DonaldJTrump.com, 2020, Accessed July 22, 2019", "Shop.DonaldJTrump.com, Trump Straws - Pack of 10, Accessed July 22, 2019", "PJ Media, Triggering Leftists, Trump's Reelection Campaign Is Selling Plastic Straws, July 20, 2019", "LouderwithCrowder.com, Trump Trolls Leftists by Selling Plastic Straws on Campaign Site, July 21, 2019", "New York Post, Trump fighting ‘liberal paper straws’ with $15 plastic set during campaign, July 21, 2019", "PoliticalCowboy.com, Trump Campaign’s Latest Merch Offering Is Absolutely Brilliant, July 22, 2019", "Email exchange with the Trump campaign, July 22, 2019", "Brad Parscale tweet, July 18, 2019", "Brad Parscale tweet, July 19, 2019", "Brad Parscale tweet, July 22, 2019", "Elizabeth Harrington tweet, July 19, 2019", "The Hill, Trump: 'We have bigger problems than plastic straws,’ July 19, 2019", "The Washington Post, Trump: ‘I do think we have bigger problems than plastic straws,’ July 19, 2019", "California Legislative Information, AB-1884 Food facilities: single-use plastic straws, September 20, 2018", "Business Insider, California just became the first US state to ban plastic straws in restaurants — unless customers ask, September 21, 2018", "CBS News, Seattle becomes first U.S. city to ban plastic utensils and straws, July 2, 2019", "SF Environment, Plastic, Litter, and Toxics Reduction Law, Accessed July 23, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]