["About this rating", "The Tsarnaev brothers' father applied for political asylum after arriving in the United States.", "The Tsarnaev family entered the United States by claiming to be refugees.", "Globally divisive debate over a Syrian refugee crisis reached a fever pitch after 130 people were killed and hundreds more were injured in terror attacks on Paris by ISIS militants on 13 November 2015.", "In the aftermath of those attacks, old rumors about the purported chaos inflicted by refugees on continental Europe flourished, and in response to a rise in anti-refugee sentiment a number of American governors pledged not to allow Syrian asylum seekers to enter their respective states. Debate raged on social media, with one side holding that Syrian refugees were ISIS militants in disguise, the other maintaining that those fleeing Syria sought to escape the same horrors that ISIS had visited upon Paris.", "Members of both camps turned to previous events to solidify their positions. Those who welcomed the refugees claimed none had ever carried out such crimes on American soil, while their debate opponents suggested that Boston Marathon bombers Tamerlan and Dzhokhar Tsarnaev were the perfect examples of how refugees might turn on the country that welcomed them and bring mayhem and death after years of enjoying safe harbor.", "In November 2015, many social media users shared a Washington Post article from April 2013 titled \"Tamerlan Tsarnaev and Dzhokhar Tsarnaev Were Refugees from Brutal Chechen Conflict,\" which reported that:", "The family lived in Tokmok, a town of about 55,000 people in northern Kyrgyzstan, near the border with Kazakhstan, the Kyrgyz National State Security Committee said. Kyrgyz officials said the family left the country about 12 years ago for Dagestan, and after a year there immigrated to the United States.", "Anzor Tsarnaev and his wife arrived in the United States in early 2002 after gaining refu­gee status. Their two sons and two daughters followed a short time later with an aunt.", "That article was published on 19 April 2013. The Boston Marathon bombing perpetrated by the Tsarnaev brothers had occurred four days earlier, and the pursuit, gun battles, and standoff which resulted in the death of Tamerlan and capture of Dzhokhar took place on 18-19 April. Information carried by the Washington Post in the midst of those events was preliminary, published before the Tsarnaev brothers became household names.", "The intervening months between the Washington Post article and Rolling Stone's controversial 17 July 2013 piece \"Jahar's World\" saw the introduction of far more information about the Tsarnaev brothers and their early lives. According to the later, in-depth profile, the Tsarnaev family were technically not refugees when they entered the U.S.: they arrived in the country on tourist visas and later applied for political asylum:", "After Russia invaded Chechnya in 1999, setting off the second of the decade's bloody wars, Anzor was fired from his job as part of a large-scale purge of Chechens from the ranks of the Kyrgyz government. The Tsarnaevs then fled to Zubeidat's native Dage­stan, but war followed close behind. In the spring of 2002, Anzor, Zubeidat and Jahar, then eight, arrived in America on a tourist visa and quickly applied for political asylum. The three older children, Ailina, Bella and Tamerlan, stayed behind with relatives.", "As the article explained, the application for political asylum was initiated after the Tsarnaev family had already arrived in the United States. The situation described was not strictly relevant to debate over refugees from Syria, Chechnya, or elsewhere, as the Tsarnaevs didn't identify themselves as refugees (subject to far more stringent screening than tourists) when they entered the United States:", "During their first month in America, Jahar and his parents lived in the Boston-area home of Dr. Khassan Baiev, a Chechen physician and friend of Anzor's sister, who recalled Anzor speaking of discrimination in Kyrgyzstan that \"went as far as beatings.\" This abuse would be the premise of the Tsarnaevs' claim for asylum, which they were granted a year later.", "In December 2013, the local Boston Globe published a long-form piece about the Tsarnaevs titled \"The Fall of the House of Tsarnaev.\" The paper held not only that the family did not enter as refugees, but that their claim for asylum was possibly of dubious merit:", "Mark Kramer, program director of Harvard University's Project on Cold War Studies, who has testified in a number of asylum cases from the region, says he sees, \"no basis for their being granted asylum at all.\"", "So, too, do associates of the family in Kyrgyzstan scoff at the notion of such persecution. As the family friend Tsokaev, put it, \"He made that up ... so that the Americans would give him a visa.\"", "While attention paid to the Tsarnaev family's manner of entry might seem to be nitpicking, the distinction is important. Refugees and political asylum seekers are tasked with proving claims of persecution in their homelands, whereas tourists can obtain entry visas issued with far less rigorous inspection:", "Where the Tsarnaevs were applying from, like many of the details of the narrative at this point, is not entirely clear. In 2001, they apparently moved to Kyrgyzstan, which may have been where the family lived when it applied.", "This visa application is the first point at which the government would begin the most important part of the process: conducting a security screening of the applicants. Given the number of tourists who visit the United States each year and the limited time period of the tourist visa (six months, at most), this is the least rigorous security screening conducted. (For what it's worth, the 9/11 hijackers used tourist and business visas to access the country.)", "At some point within their first year of being here, the family would have had to apply for asylum. (If they'd already outstayed their six-month visa, they could have applied defensively if the government was trying to deport them.) Asylum-seekers, like those seeking refugee status, must demonstrate that they have a \"well-founded fear\" of persecution in their home countries. This is a necessarily subjective determination for the government to make, one that has been subject to various legal decisions over the years. (For those curious: Asylum seekers apply for refugee status from within the U.S.; refugees seek it from their home countries.)", "An April 2015 book published by Masha Gessen titled The Brothers, The Road to an American Tragedy described the Tsarnaevs as \"new émigrés\":", "It is there that the history of the Tsarnaev brothers truly begins, as descendants of ethnic Chechens deported to Central Asia in the Stalin era. Gessen follows the family in their futile attempts to make a life for themselves in one war-torn locale after another and then, as new émigrés, in the looking-glass, utterly disorienting world of Cambridge, Massachusetts. Most crucially, she reconstructs the struggle between assimilation and alienation that ensued for each of the brothers, incubating a deadly sense of mission. And she traces how such a split in identity can fuel the metamorphosis into a new breed of homegrown terrorist, with feet on American soil but sense of self elsewhere.", "While it's true the Tsarnaev brothers were not infrequently described as \"refugees\" in media accounts, their resemblance to the flood of asylum seekers from Syria was passing at best. Like the Tsarnaevs, many Syrian refugees are Muslims, and many have endured seemingly endless war, death, and destruction in their homeland. The suspected attackers in Paris also had traits in common with the Dzhokhar Tsarnaev: the younger Tsarnaev was a naturalized American citizen, and several of the identified attackers in Paris were French nationals.", "But the \"refugee\" question is largely semantic in nature when applied to the Tsarnaevs, with respect to whether current refugees present a homegrown terrorist threat. Given that the Tsarnaev family arrived in the United States as vacation-goers, their tourist visas were unlikely to trigger initial asylum-seeker-type screening (to which Syrian refugees are subject). Clamping down on the admission of refugees would not affect individuals like the Tsarnaev family, who entered the U.S. with a stated intent of leisure travel.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]