["Were two mermaids killed in the controversial \"fire pool\" of President Jacob Zuma’s home in Nkandla and taken to a research facility in Durban?", "A picture posted on the EFF Supporter website - sourced from Nigerian website Gist Us - shows two female figures, lying head to snake-like tails on a display table. The face of the \"mermaid\" turned to the camera seems to be contorted in rigor mortis; her mouth agape and eyes frozen half open.", "As if the president does not have enough headaches at the moment, the headline hurls another allegation: \"President Jacob Zuma Accused Of Witchcraft!\"", "The leader of the Economic Freedom Fighters (EFF), Julius Malema, is even quoted as supposedly saying that Zuma is \"using the mermaids to prevent him from losing his place in leadership\".To", "To this, a reader wrote in the comment section: \"Why Julius Malema he is so against President Jacob Zuma? He is jealous or what? If he want to be a president why he should do something like this? Tjo I think he should mind his own business.\"\nBut Zuma can cross this \"attack\" from his list: These mermaids were actually props in the movie Pirates of the Caribbean: On Stranger Tides that was released in 2011. They are on display in the Jack Pierce Memorial Museum of the Cinema Makeup School in Los Angeles that opened last year.", "Since then pictures of them have been circulating the globe as proof of mermaids' existence in Pakistan and India, among many others.", "Watch the intricate sculpting of the mermaid props on YouTube.", "Please complete this form to receive the HTML sharing code.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "For democracy to function, public figures need to be held to account for what they say. The claims they make need to be checked, openly and impartially. Africa Check is an independent, non-partisan organisation which assesses claims made in the public arena using journalistic skills and evidence drawn from the latest online tools, readers, public sources and experts, sorting fact from fiction and publishing the results.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "© 2023 - Africa Check - All rights reserved.", "We will never charge you for verified, reliable information. Help us keep it that way by supporting our work.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "Support independent fact-checking in Africa."]