["About this rating", "A popular internet theory holds that actor David Adkins, better known as the comedian Sinbad, played a genie in a popular children's movie released sometime in the 1990s called \"Shazaam.\"", "The movie Shazaam, from the 1990s, staring Sinbad was never a real movie. Myself and thousands of others remember watching this movie, but apparently it was never made.", "I've tried looking it up myself and haven't found anything about it. There is an article about the oddity that was on Facebook. Someone commented a screenshot of the vhs in the comments, but again, I could not find this picture on the internet myself.", "Although this movie does not actually exist, social media users have circulated an image in an attempt to fool viewers into believing the film is real:", "The \"genie\" in the above-displayed image actually features the chest and arms of WWE wrestler Chavo Guerrero, with Sinbad's face digitally added to the scene:", "Despite the total lack of evidence that any such film starring Sinbad was ever made — no extant footage, no still shots documenting its creation, no news articles or movie reviews mentioning it, it has no entry in the Internet Movie Database (IMDb), and Sinbad himself has stated that he never played a genie in a movie called Shazaam — many people still they remember seeing the movie.", "But why?", "While we cannot pinpoint an exact origin of this collective false memory, several circumstantial aspects suggest why people may mistakenly recall Sinbad's having starred in a genie movie.", "The name: Depending on when you grew up, the name \"Sinbad\" likely recalls memories of one of two things: either a popular 1990s comedian, or a fictional sailor who had adventures (sometimes involving genies) in the Middle East. It is possible that some viewers have conflated the two characters in recalling a 1990s-era film about a genie.", "Sinbad himself did once host a showing of the movie \"Sinbad and the Eye of the Tiger\" on TNT in 1994:", "@hapotter solved the sinbad genie mystery. I hosted an afternoon of sinbad movies o 1994 (sinbad the sailor movies) pic.twitter.com/yCE65Q3aK5", "— Sinbad (@sinbadbad) October 3, 2016", "Kazaam: A simpler explanation is that some fans are misremembering the details of another movie from the 1990s that featured a popular actor playing a genie. In 1996, Shaquille O'Neal essayed the role of a genie in the film \"Kazaam\":", "Sinbad appeared in several popular childrens' movies in the 1990s, so it would not be particularly surprising if some viewers mistakenly remembered him in this particular genie film (which, naturally, would not go unnoticed by Internet pranksters). In fact, a preview for Kazaam was reportedly featured during the previews on some VHS copies of the Sinbad movie The First Kid:", "It appears that this Sinbad-genie phenomenon is another instance of the \"Mandela Effect,\" an informal term for a collective false memory. The term was coined by a woman who discovered that she and hundreds of other people believed, and remembered, that Nelson Rolihlahla Mandela had died in prison in the 1980s.  Mandela actually died in 2013, after serving as South Africa's first black president and winning the Nobel Peace Prize (along with another former president, Frederik Willem de Klerk, who ended the system of segregation known in South Africa as apartheid during his time in power) in 1993 — all of which, of course, would have been impossible if Mandela had been dead for a decade.", "As an April Fool's Day joke in 2017, the College Humor web site posted \"lost footage\" from the non-existent \"Shazaam\" film starring Sinbad (complete with references to the Mandela Effect):", "Update [June 27, 2022]: Updated formatting.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]