["Hillary Clinton at the New Hampshire Democratic presidential debate. (AP)", "During a Democratic presidential debate in New Hampshire, Hillary Clinton took a shot at Republican primary frontrunner Donald Trump, saying that his rhetoric is a gift to ISIS.", "\"We also need to make sure that the really discriminatory messages that Trump is sending around the world don't fall on receptive ears,\" Clinton said during the debate. \"He is becoming ISIS's best recruiter. They are going to people showing videos of Donald Trump insulting Islam and Muslims in order to recruit more radical jihadists.\"", "Not having heard that before, our eyebrows went up when we heard Clinton’s comment, and we weren’t alone. The Twittersphere, on both the right and the left, picked up on Clinton’s statement and questioned whether she had any evidence for it.", "Extensive Google searches did not turn up any evidence. And the response from the Clinton campaign did not point to any specific videos.", "The campaign pointed to an NBC News article that quoted Rita Katz of the SITE Intelligence Group, which monitors the social media activities of Islamic terrorist groups.", "\"They love him from the sense that he is supporting their rhetoric,\" she said. \"They follow everything Donald Trump says. When he says, 'No Muslims should be allowed in America,' they tell people, 'We told you America hates Muslims and here is proof.' \"", "The article also quoted David Phillips, director of the Program on Peace-Building and Rights at Columbia University's Institute for the Study of Human Rights, saying that \"Trump's incendiary anti-Muslim comments will surely be used by ISIS social media to demonize the United States and attract recruits to fight in Iraq and Syria.\"", "But while such quotes support the notion that ISIS could be making recruiting videos, or will do so, they do not support Clinton’s contention -- offered in the present tense -- that they are currently doing so.", "Vox.com tweeted at J.M. Berger, author of the book ISIS: The State of Terror, and Berger tweeted back, \"I would be surprised if they had and we didn't hear about it in a big way.\"", "For now, it seems that Clinton has turned speculative left-of-center rhetoric into fact.", "Others have wondered if ISIS will use Trump’s statements against the United States. On Dec. 14, New York Gov. Andrew Cuomo, a Democrat, told Alisyn Camerota on CNN’s New Day that \"Donald Trump could be a recruitment poster for ISIS because he is fanning the flames of hate.\"", "A few days earlier, Robert Kuttner of the American Prospect, a liberal magazine, wrote a column titled, \"How ISIS and Trump Enable Each Other.\" In it, he wrote, \"Trump’s collected speeches are like an ISIS recruiting video.\"", "At PolitiFact, the burden of proof is on the person making the claim. We’ll update our fact-check in the event solid evidence emerges. But for now, that evidence does not exist.", "Our ruling", "Clinton said that ISIS is \"going to people showing videos of Donald Trump insulting Islam and Muslims in order to recruit more radical jihadists.\"", "We were unable to find any evidence to support this. The Clinton campaign did not provide any evidence that this is already happening -- only that it could be happening, or that it may in the future. If ISIS was using Trump for recruitment videos, we would expect a frenzy of media coverage over it. We rate this claim False.", "UPDATE, Jan. 5, 2016: About two weeks after Clinton’s comment, various news outlets reported that the terrorist group Al Shabaab had released a recruitment video that featured clips of Trump speaking shortly after the Dec. 2 terrorist shootings in San Bernardino, Calif., about his proposal for a temporary but \"total and complete shutdown of Muslims entering the U.S.\" As we noted in greater depth here, we aren’t changing our rating, because we rate statements based on evidence that was public at the time the statement was made. Before she made her comment, Clinton had no way of knowing about the Al Shabaab video. SITE Intelligence Group, which found the video, said it was distributed on Twitter on Dec. 31. In addition, Al Shabbab is not affiliated with ISIS.", "Vox.com, \"Hillary Clinton: Donald Trump is 'becoming ISIS's best recruiter,' \" Dec. 19, 2015", "American Prospect, \"How ISIS and Trump Enable Each Other,\" Dec. 8, 2015", "CNN, \"New York governor calls Trump 'recruitment poster' for ISIS,\" Dec. 14, 2015", "NBC News, \"Donald Trump's Muslim Bashing Aids Cause of Terror Networks, Say Experts,\" Dec. 8, 2015", "Email interview with Nick Merrill, spokesman for Hillary Clinton, Dec. 19, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]