["Richmond Mayor LeVar Stoney recently said Virginia needs to dramatically expand covid-19 testing before it reopens its economy.", "\"We’re not doing the kind of real-time, instantaneous testing that I think we need to do in communities throughout the Commonwealth of Virginia,\" Stoney, a Democrat, said during an April 10 interview on Newsradio WRVA. \"We’ve lagged behind other states when it comes to testing.\"", "We fact checked whether Virginia really is trailing in coronavirus testing.", "Jim Nolan, Stoney’s communications director, said the mayor got his information from the Coronavirus Resource Center at Johns Hopkins University, a widely-cited website for covid-19 data. On every day in mid April, it shows Virginia ranked either 49th or 50th among states in covid-19 testing per capita.", "On April 21 - the date of this writing - Virginia was last. It had conducted 58,394 tests, or, on a per capita basis, 738 tests per 100,000 residents. The next lowest was California, at 747 tests per 100,000.", "Across the U.S., 1,168 tests had been conducted per 100,000. New York, hardest hit by covid-10, had tested a leading 3,851 per 100,000.", "Here’s how Virginia compared to its neighbors, in number of tests per 100.000:", "West Virginia, 1,514;", "Tennessee, 1,479;", "Maryland, 1,142;", "Kentucky, 941;", "North Carolina, 794;", "Virginia, 738.", "On April 10, when Stoney made his statement, Virginia was 49th in per capita testing, leading Kansas.", "While Virginia has been at the bottom in testing, other Johns Hopkins data shows it ranks in the middle in the spread of the disease. On April 21, there had been 110 infected Virginians per 100,000. That’s 21st per capita.", "The controversy", "Testing numbers have a huge role in debate in Virginia and across the country over when governors should ease their stay-at-home restrictions and allow widespread business reopenings.", "President Donald Trump has called for lifting restrictions and is urging supporters to \"liberate\" several states where Democratic governors issued the orders. That includes Virginia, where Gov. Ralph Northam's order lasts until June 10. Virginia has seen several recent protests demanding Northam open the state now.", "Northam, a pediatric neurologist, says he set the date cautiously, noting that some projections show the virus may not peak in Virginia until late May. He recently appointed a work group to ramp up Virginia’s testing. \"The ability to run large numbers of tests is key to lifting restrictions on businesses and gathering,\" Northam said at an April 20 news conference.", "Northam’s explanation", "The governor and his advisors say they’ve had trouble competing with other states for scarce testing supplies. \"We’re scouring the country for the equipment to help our institutions increase testing,\" Daniel Carey, Virginia’s Secretary of Health and Human Resources, said on April 17. \"We just haven’t been successful because of the national shortage, but we realize we have to get significantly more testing…\"", "Northam says Trump has given \"limited guidance\" on how states can work through the competition.", "Many governors have voiced similar complaints. The Northam administration also gives reasons that may be unique to Virginia.", "Commissioner of Health Norman Oliver says Virginia had a slow start because - unlike some other states - no Virginia hospitals or labs developed their own tests. That meant, for a while, Virginia had to rely almost solely on the state lab for testing. The state lab was so crunched, Oliver says, that it set guidelines that limited testing to the most vulnerable patients.  As a result, he says, many Virginia physicians didn’t seek tests for patients showing mild covid-19 symptoms.", "Carey also says Virginia’s method of reporting tests may create a time lag that hurts Virginia when compared to other states.", "Northam says Virginia’s has improved as the state’s private labs, universities and hospitals have begun creating their own tests. During the first three weeks of April, the total number of tests conducted in Virginia has quadrupled. Many states have seen similar expansions.", "Northam told clinicians this week they should start testing anyone who’s symptomatic. And the state’s now testing all patients and workers in extended-care facilities.", "Our ruling", "On April 10, Stoney said Virginia has \"lagged behind other states when it comes to (covid-19) testing.\"", "On any given date from the eve of the mayor's statement through this April 21 writing, Virginia has been last, or next to last, in per capita testing.  So we rate Stoney’s statement True.", "Mayor LeVar Stoney, Comments to Newsradio WRVA, April 10, 2020 (7:07 mark).", "Texts from Jim Nolan, Stoney’s director of communications, April 14, 2020.", "Coronavirus Resource Center at Johns Hopkins University, Testing rate map, accessed April 10-21, 2020.", "The Covid Tracking Center, \"U.S. Historical Data,\" accessed April 20, 2020.", "Associated Press, \"Northam: Virginia coronavirus cases could peak in late May,\"  April 2, 2020.", "Gov. Ralph Northam, news conference, April 20, 2020.", "Daniel Carey, news conference comments, April 17, 2020 (36:05 mark).", "Email from Alena Yarmoskey, Northam press secretary, April 20, 2020.", "Statement from Norman Oliver, Virginia commissioner of health, April 20, 2020.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]