["Before recent reforms, fewer than one in 10 stops and searches led to an arrest. Now the rate is the highest on record.", "Correct. Figures from 2008-2011 showed 9% of all stops and searches resulted in an arrest. By 2015/16, this was up to 16% - the highest on record.", "The use of stop and search has fallen by almost two thirds since reforms to the system.", "Correct.", "In London, stop and searches have similar ‘success rates’ for white people and black people.", "The rates are similar, but white people are slightly more likely to have some action taken against them as a result of a stop and search.", "A third of stops and searches in London results in something being found.", "Correct.", "“In London, about one in three stops and searches results in some positive thing being found… something that you shouldn't have... that is quite a high proportion, frankly.", "“Our outcome rate—one in three positive—is the same, whether you're black or white or whoever you are.”", "Cressida Dick, 8 August 2017", "“…before the reforms took effect, of more than one million stops taking place each year, fewer than one in ten ever led to an arrest… Since the reforms, the number of stop and searches has come down by almost two thirds while latest figures show that the stop-to-arrest rate is now the highest on record.”", "Amber Rudd, 9 August 2017", "It’s correct that the use of stops and searches has fallen both in London and across England and Wales, following policy changes a few years ago. Officers do find something in about a third of cases in London, that’s more than the average for the whole of England and Wales.", "Black people remain much more likely to be stopped and searched than white people, and this gap has widened in the most recent year we have figures for.", "Honesty in public debate matters", "You can help us take action – and get our regular free email", "I’m in", "Almost all stops and searches take place under section 1 of the Police and Criminal Evidence Act 1984 and laws associated with that. It’s used by police to search people for things like drugs, weapons and stolen property, provided the officer has a reasonable cause to suspect they will find something. The use of section 1 searches has been declining rapidly in the last few years.", "Stops and searches can take place under different laws as well, but those have also been falling rapidly and have now fallen largely out of use. This is due to changes in policy since 2012 to increase ‘fair use’ of the powers by the Home Office and Metropolitan Police.", "The government also started a new scheme in 2014 called ‘Best use of stop and search’ which aimed to increase transparency around how stops and searches happened and to make forces more effective at identifying appropriate cases for using the powers.", "These changes have led to sharp falls in the use of stop and search both in London and throughout England and Wales.", "The use of stop and search in England and Wales peaked in 2008/09 when over 1.5 million were carried out. It has declined in every year since then. Since 2011/12—just before the police changes were brought in—stops and searches have fallen by two-thirds, as Amber Rudd correctly says.", "The latest figures put them at under 400,000 in 2015/16.", "London has seen the same pattern. Stops and searches peaked in 2008/09 at nearly 600,000 and have fallen since to just under 160,000.", "Stop and searches are still much more common in London, once you factor in the resident population. This doesn’t take into account of the fact that a lot of people come to London from outside on a daily basis as well and could be stopped and searched but not counted in the population figures.", "Amber Rudd is correct about the increased arrest rate from stops and searches. Only 9% of stops and searches resulted in an arrest at the peak of its use between 2008 and 2011. That proportion has increased in the years since and was 16% by 2015/16.", "Arrests are more likely in London—with 19% of searches resulting in arrest in the same year. The most recent figures to June this year show the rate now at 20%.", "That’s according to figures gathered over the last year by the Metropolitan Police, and matches Cressida Dick’s claim.", "These are called “positive outcome” searches—which refers to any case where action is taken against people who’ve been stopped and searched. This includes arrest cases but also covers other resolutions like warnings and Penalty Notices. All cases where there isn’t a positive outcome are called ‘No Further Actions’.", "As Cressida Dick also says, the outcome rates are similar whatever people’s ethnicity is. White people are slightly more likely to have something found on them than black or Asian people, but the rate is roughly a third for all three groups.", "Across the rest of England and Wales, about a quarter of stops and searches had a positive outcome in 2015/16. This figure could be higher in reality because some No Further Action cases do involve detentions under the Mental Health Act or informal advice being given when an officer has found something untoward.", "At least, that’s what the latest ‘experimental figures’—i.e. to be interpreted with caution—show. These cover figures from just under half of police forces in England and Wales, not including the Metropolitan Police in London.", "They also find that whether someone is white or not makes little difference—the rate is still about 20%.", "Again, these cover ‘positive outcomes’ of stops and searches, but they’re different to the figures mentioned in the previous section because they only include cases where the officer found what they were searching for in the first place.", "The majority of the population is white and the majority of stops and searches involve white people. Per person, black people are more likely to be stopped and searched.", "Black people are about six times as likely to be stopped and searched as white people. Five in every 1,000 white people was stopped and searched in 2015/16, compared to 31 in every 1,000 black people.", "The difference in rates between white and black people has grown since last year. Stops and searches have fallen in the last year overall but those involving white people have fallen faster than those involving black people.", "Black people are most likely to be arrested following a stop and search. 22% of stops and searches on black people resulted in an arrest in 2015/16, compared to 14% of those conducted on white people.", "We have more figures just for the Metropolitan Police in London covering the 11 months from August 2016 to June 2017.", "Black people seem more likely to be stopped in London than elsewhere in the country in recent years. White people are also more likely to be stopped in the capital.", "Black people were four times as likely to be stopped and searched in London as white people—they were stopped 38.5 times per 1,000 people compared to 9.8 times for white people.", "Full Fact fights for good, reliable information in the media, online, and in politics.", "Bad information ruins lives. It promotes hate, damages people’s health, and hurts democracy. You deserve better.", "Full Fact, 17 Oval Way, London, SE11 5RR", "Full Fact is a registered charity (no. 1158683) and a non-profit company (no. 06975984) limited by guarantee and registered in England and Wales. © Copyright 2010-2023 Full Fact. Thanks to Bytemark for donating our web hosting.\n                        \n                        Privacy, terms and conditions."]