["About this rating", "In early August 2020, Snopes readers inquired about a video promoting the 2020 reelection campaign of U.S. President Donald Trump after it was shared on Facebook alongside a caption that claimed it was \"being banned by Facebook.\"", "Other readers reported they saw a different version of the message that claimed the video was banned by the video platform YouTube.", "We checked with both YouTube and Facebook and found no evidence that the video is being banned or suppressed on either platform — in fact it's been seen by many viewers on both.", "The video posted to Facebook in June 2020 bears the text \"President Trump campaign ad being banned by Facebook\" although it has been shared, as of this writing, 163,000 times and remains live on Facebook. Another version of the same video (without the caption), posted in March 2020 to YouTube, has more than half-a-million views.", "The video contains a montage of footage depicting various notable events and figures in American history, coupled with audio of Trump giving a portion of his Feb. 4, 2020, State of the Union address.", "The video in question doesn't appear to be an actual campaign advertisement, but rather an unofficial fan video.", "Facebook did previously remove campaign ads by Trump and Vice President Mike Pence in June 2020 for violating the platform's policy against organized hate. The ad contained a symbol used by the Nazis to identify political prisoners in concentration camps.", "We sent questions to both YouTube and Facebook asking whether any actions have been taken against the video. A spokeswoman for YouTube said she was \"unaware of any forthcoming action.\" We didn't hear back from Facebook before publication. Because the video remains live on both Facebook and YouTube as of this writing and also has been widely viewed, we rate the claim that the video was banned or censored by either platform \"False.\"", "WhiteHouse.gov. \"Remarks by President Trump in State of the Union Address.\"\r\n    4 February 2020.", "Newton, Casey.   \"The Real Bias on Social Networks Isn’t Against Conservatives.\"\r\n    The Verge.   11 April 2019.", "Tucker, Eric and Barbara Ortutay. \"Facebook Removes Trump Ads with Symbols Once Used By Nazis.\"\r\n  The Associated Press. 18 June 2020.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]