["About this rating", "A eulogist heard on Iranian state TV during the funeral procession of Qassem Soleimani called for an $80M bounty on President Trump's head.", "The call for a bounty on Trump is not yet known to have been authorized by, or represent the official position of, Iranian authorities.", "On Jan. 5, 2020, news editor M. Hanif Jazayeri posted a tweet stating that Iran had placed an $80 million bounty on the head of U.S. President Donald Trump in retaliation for a U.S. airstrike in Baghdad that killed Iranian Major General Qassem Soleimani:", "The EN24 website similarly reported that the offer had been made on Iranian state television, and the amount of the bounty was based on Iran's population:", "In the propaganda war against the United States and its president, the Iranian mullah regime is now using a particularly perfidious tactic.", "The state television announced during the broadcast of a funeral service for the killed terror general Ghassem Soleimani that $80 million bounty would be placed on US President Donald Trump. The one who kills him should receive this amount.", "“Iran has 80 million inhabitants. Based on the Iranian population, we want to raise $80 million, which is a reward for those who get close to the head of President Trump,” it said on state TV. Each Iranian should therefore donate a dollar to pay the amount to the alleged murderer.", "The video attached to social media reports of the bounty showed large crowds mourning and/or protesting Soleimani's death, with a male voice said to be that of a eulogist at Soleimani's funeral procession seemingly calling for the placement of a bounty on Trump's head:", "The eulogist at the funeral procession of prominent Iranian military commander Qassem Soleimani in Iran put an 80-million-dollar prize on US President Donald Trump’s head on live state TV.", "“We are 80 million Iranians, if each one of us puts aside one American dollar, we will have 80 million American dollars, and we will reward anyone who brings us [Trump]’s head with that amount,” he said, addressing a large crowd in Iran’s north-eastern city of Mashhad.", "The funeral procession was being broadcast live on Iran’s Channel One as the eulogist made his proposal.", "A Heavy article on the subject stated it was \"a little misleading\" to say that Iranian \"state television\" had announced the bounty, \"because it was the eulogist who made that announcement, not state TV. It was, however, being broadcast on state TV.\"", "EN24.   \"Propaganda on Iranian TV: $80 Million Bounty on Donald Trump – Politics Abroad.\"\r\n    5 January 2020.", "Heavy.   Iran Eulogist Puts $80 Million Bounty on Trump’s Head: Reports.\"\r\n    5 January 2020.", "Fazeli, Yaghoub   \"Soleimani Funeral Procession Eulogist Puts Prize on Trump’s Head.\"\r\n    Al Arabiya.   5 January 2020.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]