["Federal officers dispatched to protests in Portland, Ore., have agreed to withdraw from the city if the state can secure the federal courthouse downtown. The nightly demonstrations against police brutality escalated after the officers arrived in Portland and aggressively confronted participants.", "But protesters were not photographed \"trying to blind federal officers,\" leaving \"some possibly blinded for life,\" as a recent Facebook post claimed.", "The post has since been updated to reflect that the photo was not taken in Portland, but the image that’s being shared on social media still includes a description that’s inaccurate.", "\"Time to deport all PORTLAND terrorists to GITMO with their ACLU legal criminals,\" reads the caption below a photo of a crowd of people with face coverings, many crouching, aiming green lasers in front of them. \"LOOK WHAT THESE VERMIN ARE DOING! AWAKEN!\"", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "That’s because the photo isn’t from Portland. It was taken by a Getty photographer in November 2019 in Santiago, Chile, where demonstrators pointed lasers at riot police during a protest against inequality and the policies of Chilean President Sebastian Pinera. The updated post says, \"This picture is from protests in Chile however the protesters are also using them in Portland.\"", "Over the past decade, protesters around the world have increasingly used laser pointers to distract or repel riot police, according to a 2019 report in The Atlantic magazine. They’re also used in celebrations, to show solidarity in groups, or to communicate.", "Protesters in Portland have shined lasers at federal officers and at security cameras surrounding the courthouse to try to block the officers’ view of the crowd, according to the New York Times.", "In a March story about the use of lasers in protests, the Harvard Political Review wrote that lasers may temporarily blind people when shined directly into the eye and, \"in the most extreme cases, laser pointers may seriously burn the retina, causing permanent blindness.\"", "But this photo does not show Portland protesters trying to blind federal officers.", "We rate this miscaptioned post False.", "Facebook post, June 29, 2020", "The New York Times, Federal agencies agree to withdraw from Portland, with conditions, July 29, 2020", "The Atlantic, The lasers of discontent, Nov. 19, 2019", "The New York Times, Fact check: How violent are the Portland protests, July 28, 2020", "Wired, The Portland protests are a war zone—but only on the internet, July 28, 2020", "Forbes, White House: 3 federal officers likely permanently blinded by Portland protesters, July 24, 2020", "Harvard Political Review, Lasers: The future of protests, March 19, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]