["About this rating", "Frequent internet users have likely come across at least one story about the generosity of actor Keanu Reeves.", "Perhaps it was the video of the Speed star giving up his seat on the subway, or maybe it was a report about his involvement with charitable causes such as PETA, or his donations to fund children's hospital and cancer research. Or maybe it was the story of how Keanu bought motorcycles for the stuntmen after filming The Matrix. Or, most likely, it was the (exaggerated) tale of how the actor gave away a portion of his Matrix salary to the crew.", "Stories of Reeves' generosity became so prevalent that by February 2018 they had morphed into a bit of an internet joke. Internet users started sharing outlandish and imaginary tales about how he had come to their unlikely rescue.", "The following meme, for instance, claimed that Reeves randomly gave an envelope full of cash to a stranger after learning that the man's son needed a kidney transplant:", "Today Keanu Reeves pulled up at my place of work so we started talking then I mentioned that my son needed a kidney transplant surgery and I couldn't afford it at the moment he stood silent for a few minutes then went to this car and came back and gave me this envelope full of money.", "This is not a true story, and the two images seen above both antedate this meme and are not related to one another.", "The photograph of Reeves and a fan was taken in January 2018. The original photographs have been deleted from Facebook but a Keanu Reeves fan page stated that it was taken by \"Mar Felipe\" somewhere in Los Angeles. When these images first circulated they were not attached to any claims about a kidney transplant:", "We haven't been able to locate the exact origins of the photograph featuring an envelope full of cash, but this image has been circulating since at least February 2017, well before it was associated with a story about Keanu Reeves and a kidney transplant.", "Keanu Reeves' off-screen life has proven to be a popular subject on the internet. In December 2016, for instance, a viral (and mostly true) video relayed some tragic moments from the actor's personal life.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]