["By Angelo Fichera", "Posted on February 17, 2021 | Updated on April 28, 2021", "Evidence of the efficacy of face masks to help control the spread of the novel coronavirus has grown since the start of the pandemic. But a Facebook video, viewed tens of thousands of times, uses false and misleading claims to tell viewers that masks are “unsafe” and “ineffective.”", "Multiple lines of evidence back the use of face masks to protect against the coronavirus, although some uncertainty remains as to how effective mask interventions are in preventing spread in the community.", "Lab tests, for example, show that certain masks and N95 respirators can partially block exhaled respiratory droplets or aerosols, which are thought to be the primary ways the virus spreads.", "Observational studies, while limited, have generally found mask-wearing to be associated with a reduced risk of contracting the virus or fewer COVID-19 cases in a community.", "A few randomized controlled trials have found that providing free masks and encouraging people to wear them results in a small to moderate reduction in transmission, although these results have not always been statistically significant.", "Masks should not be viewed as foolproof, as no mask is thought to offer complete protection to the wearer or to others. The Centers for Disease Control and Prevention recommends that people wear the most protective mask that fits well and can be worn consistently. Loosely woven cloth masks are the least protective. Layered, tightly woven cloth masks offer more protection, while well-fitting surgical masks and KN95 respirators provide even more protection and N95 respirators are the most protective.", "Link to this", "A Missouri-based chiropractor — who has been previously warned by federal officials to stop spreading misleading content regarding unproven COVID-19 treatments — is now wrongly telling Facebook users that face masks have been proven “unsafe” and “ineffective.”", "In a Feb. 11 video live-streamed on Facebook and viewed more than 70,000 times, Eric Nepute rattles off a list of 20 arguments against wearing face masks — claiming, for example, that they cause cavities and “facial deformities” and increase the chances of contracting the novel coronavirus that causes COVID-19.", "But many of Nepute’s claims are false, misleading or unsupported. And a central takeaway — that masks are “ineffective” — is rebuffed by recent evidence to the contrary.", "Two doctors at the Centers for Disease Control and Prevention recently summarized the growing evidence that masks can help to control community spread of the virus. In a piece for the Journal of the American Medical Association, they wrote: “Compelling data now demonstrate that community mask wearing is an effective nonpharmacologic intervention to reduce the spread of this infection, especially as source control to prevent spread from infected persons, but also as protection to reduce wearers’ exposure to infection.”", "Rather than cite credible research on masks, Nepute largely adapted his claims from a January post on the website of the Canada-based Centre for Research on Globalization. That website has pushed conspiracy theories about the 9/11 terrorist attacks and other topics; a recent State Department report said the website “has been a steady source of anti-U.S. and anti-Western disinformation and propaganda ever since” its 2001 debut.", "For his part, Nepute has spread unsound advice before, drawing the scrutiny of the Federal Trade Commission. The FTC in May sent a letter warning Nepute that he was unlawfully advertising products and services — including chiropractic care and intravenous vitamin therapy — to treat or prevent COVID-19. The letter advised him to “immediately cease making all such claims.”", "Update, April 28: The FTC and Department of Justice announced on April 15 that the government had charged Nepute with violating the COVID-19 Consumer Protection Act and the Federal Trade Commission Act “by deceptively marketing products containing vitamin D and zinc as scientifically proven to treat or prevent COVID-19.” It was the first civil complaint alleging violations of the COVID-19 Consumer Protection Act, which was part of an appropriations package signed into law in December.", "Throughout Nepute’s 24-minute video about masks, he repeatedly urges viewers to visit his website for vitamins while presenting the faulty claims about face masks — and later, COVID-19 vaccines and more.", "Here, we’ll fact-check a few of the claims in the video.", "Nepute begins: “Reason no. 1 — this is wild right here. Cavities. I didn’t even know this was a thing until I started digging into it about a week or so ago. New York dentists are reporting that half their patients are suffering from decaying teeth at a higher rate in 2021 and 2020 than they had been before, due to — and this is Dr. Rob Raimondi — he told Fox News that just a week ago, that people are getting cavities from wearing a mask.”", "The underlying story from the Centre for Research on Globalization that is being used by Nepute refers to an interview that Raimondi, a dentist in New York, did with the New York Post in August, which was republished on the Fox News website. Raimondi told the Post that his practice was seeing people with gum inflammation and “cavities in people who have never had them before … about 50% of our patients are being impacted by this.”", "But the American Dental Association told us in a statement that “[t]o date, we have seen no evidence of an increase in cavities in the last year, or that wearing a mask affects your risk of cavities.”", "Dr. Patricia Corby, associate dean of translational research in the department of oral medicine at the University of Pennsylvania, similarly told us in an email that “there is no rationale why wearing a mask would increase decay or periodontal disease. Also, no research has been done to prove otherwise.”", "What Raimondi and a colleague told the Post, more specifically, was that wearing a mask can increase mouth dryness, since people may breathe more through their mouth when wearing a mask, which can lead to bacteria building up. But they didn’t advocate against wearing masks.", "Raimondi in a subsequent Instagram post about the interview said, “We absolutely support mask wearing.” He recommended some ideas for avoiding dry mouth.", "The American Dental Association likewise told us that “excessive breathing through your mouth, whether you are wearing a mask or not, may increase development of dry mouth, which increases the risk of cavities. Saliva helps to keep the mouth moist and remineralize tooth enamel which helps fight decay. Even when wearing a mask, it is best to breathe through your nose. Another good way to decrease the risk of cavities is to drink fluoridated water. This can help to avoid dry mouth as the fluoride in the water will help prevent tooth decay.”", "Corby said COVID-19 could have affected individuals’ dental and oral health in another way: The pandemic prompted dental clinics around the world to shut down — and some practices to close completely. Even when some could reopen, she said, the pace was slow and some patients were hesitant to visit the dentist.", "“No. 2: Facial deformities. Masking children triggers mouth breathing, which has been shown to cause narrowing of the face, narrowing of the mouth, high vaults in the palate, dental malocclusions — and the list goes on and on,” Nepute tells his viewers. “This is according to the Journal of General Dentistry. They say you shouldn’t wear one.”", "He’s referring to the Academy of General Dentistry’s journal, General Dentistry, which did not say not to wear a mask. The report being referenced didn’t evaluate masks at all.", "Instead, the 2009 report looked at the implications of mouth breathing in children.", "Dr. Callan White, a dentist and national spokesperson for the Academy of General Dentistry, told us by phone that the video’s claim requires “several jumps.” There is no scientific evidence showing that children resort to exclusively breathing through their mouth while wearing a mask, he said, and that they do so for long enough to mirror children who experience chronic mouth breathing.", "“Children who suffer from these conditions aren’t able to breathe through their nose at all, or very little, at all times. This condition creates the most harmful effects at night while the child is sleeping,” he told us in an email. “There is a significant difference in frequency and duration of the habit” of mouth breathing due to wearing a mask.", "“With this said, remind children to breathe through their nose while wearing a mask, make sure the mask properly fits the child, take mask breaks when possible, and clean/disinfect cloth masks frequently (discard disposable masks as directed by manufacturer),” he added.", "Nepute also misleadingly claims that face masks are associated with an “increased risk of COVID-19.”", "“What, wait a minute, I thought I was wearing a mask to stop the spread of COVID-19?” he says. “Just like when they told me that I’m getting a vaccine to stop the spread, that doesn’t do it either.” (We’ll address his factual distortions about vaccines later in this story.) He then cites “public health officials of Ontario” to claim that “mask use by the general public could be associated with the … theoretical elevated (risk) of COVID-19.”", "That’s a reference to a September document issued by Public Health Ontario that described what the agency knew about the use of masks to control the spread of the coronavirus — including the benefits, which Nepute fails to mention.", "Instead, Nepute homes in on only one part of the document, which says: “Mask use by the general public could be associated with a theoretical elevated risk of COVID-19 through decreased physical distancing and self-contamination.”", "But those, again, are theoretical risks — and ones that can be mitigated if other steps are taken while wearing masks.", "The first theoretical risk is that people wearing masks may not maintain physical distancing. But that’s why health officials have continued to advise that masks should be worn in addition to, not in place of, distancing.", "And the second theoretical risk Nepute is citing, of self-contamination, “refers to evidence that shows the frequency of face-touching behaviour in general,” Public Health Ontario told us in an email.", "The agency said “the point about the ‘theoretical elevated risk’ is taken out of context.”", "“If the outside of a mask is contaminated, there would be a theoretical risk that touching the mask then touching your face could result in exposure to virus … the mitigation for that is frequent hand hygiene,” PHO told us. “PHO continues to monitor and review the emerging evidence on non-medical masks and COVID-19.”", "The agency further noted that the same document being cited also said on its first page that “the evidence shows that public mask-wearing is likely beneficial as source control and mandatory public mask policies have been associated with a decrease in new COVID-19 cases compared to regions without such policies.”", "“Bacterial pneumonia is on the rise,” Nepute says. “We’ve seen a ton of that in our practices. We’ve seen so much respiratory bacterial infections it’s not even funny, especially among children.”", "He adds: “In Oklahoma press conference, Dr. James Meehan indeed testified, reporting coming from all of his colleagues are showing, across the world, increase in bacterial pneumonia.”", "Nepute is referencing an ophthalmologist who was speaking out against a mask mandate in Tulsa, Oklahoma, in August. Meehan claimed (at 4:40) that “reports coming from my colleagues all over the world are suggesting that bacterial pneumonias are on the rise.” He went to say he believed “untrained members of the public are wearing medical masks repeatedly, in a non-sterile fashion.”", "It’s true that experts do not recommend that medical masks that are meant to be worn once be reused.", "But we found no evidence to suggest that cases of bacterial pneumonia are on the rise — or that masks are causing such a trend. And experts have debunked different iterations of the same claim before.", "For example, Dr. Catharine Paules, an assistant professor at Penn State who specializes in infectious diseases, has said “there is no data” to support the claim that masks trap in bacteria and fungus and make people more susceptible to bacterial or fungal pneumonia.", "And our fact-checking colleagues at Reuters debunked a viral falsehood in September that mask-wearers were “arriving in ICU with antibiotic resistant strains of pneumonia from breathing in the pathogenic organisms they were meant to exhale.”", "Nepute goes on to wrongly claim that “oh, by the way, that’s the No. 1 thing that killed everybody during the Spanish Flu of 1918. Not the virus, but the bacterial infections. These masks are causing this.”", "That’s inaccurate, too.", "In 2008, researchers at the National Institute of Allergy and Infectious Diseases — including the institute’s director, Dr. Anthony Fauci — published a study that found that most deaths from the 1918 flu pandemic likely resulted from secondary bacterial pneumonia after contracting the flu.", "“The pneumonia was caused when bacteria that normally inhabit the nose and throat invaded the lungs along a pathway created when the virus destroyed the cells that line the bronchial tubes and lungs,” the National Institutes of Health said in a release explaining the study.", "So to suggest the flu wasn’t involved in those deaths is wrong. Furthermore, that study made no mention of masks.", "After trying to discredit masks and erroneously suggesting vaccines are ineffective, Nepute asks, “Why are you not doing the things that do work?” and turns his attention to vitamin D. He later pitches an offer for a “patriot pack” of vitamins that includes vitamin D3 and zinc.", "Nepute shows a Healthline story from October, headlined: “New Study Found 80% of COVID-19 Patients Were Vitamin D Deficient.”", "“That’s why you should be taking vitamin D every day,” he says. “This is like the 100th study that’s shown vitamin D helps with this.”", "He’s overstating things.", "We addressed this topic several months ago and explained that, while vitamin D might be helpful in terms of COVID-19, there isn’t enough scientific evidence yet to know whether it can treat or prevent the disease. Research is ongoing.", "That said, health experts do advise getting enough vitamin D as part of a healthy lifestyle, regardless. Most of a person’s vitamin D is made in the skin by exposure to sunlight.", "The Healthline story was about a study published in October in the Journal of Clinical Endocrinology & Metabolism that evaluated the vitamin D levels of 216 hospitalized COVID-19 patients. It found that the hospitalized patients had lower levels of vitamin D compared with a group in the general population — although it didn’t identify a relationship between lower vitamin D levels and more severe disease among those patients.", "While suggestive, the study doesn’t prove that vitamin D was a factor in whether those patients fell ill or that taking vitamin D supplements would have helped, as it was not a randomized controlled trial.", "Nepute again returns to the topic of COVID-19 vaccines, asking: “What do you mean it works?” He goes on to add: “Effective in what? It does not stop the spread of the virus. You understand that, right?”", "First of all, the main point of the vaccines is to prevent those who contract the novel coronavirus from becoming seriously ill with the COVID-19 disease. And in that regard, they are highly effective. For more information, see our SciCheck story “Q&A on COVID-19 Vaccines.”", "As for Nepute’s suggestion that vaccines won’t stop the spread of the virus, as we’ve explained before, it’s currently unclear how much the vaccines will limit transmission. But there’s a good chance they will help curb transmission to some degree: Experts say with other vaccines, a vaccinated person, even if infected with the virus, often sheds less virus, therefore making them less contagious.", "Nepute also shows viewers the CDC’s Vaccine Adverse Event Reporting System, scrolling through entries and saying, for example: “Here’s what happened, this person had this done — it was the Pfizer vaccine — they died. This person had abdominal pain, it was life-threatening.”", "But as we’ve explained before, anyone can report to that system through an online form, and there is no vetting of the reports. And there is no evidence that authorized COVID-19 vaccines are harming people on any kind of wide scale. Many have the expected sore arms or temporary flu-like symptoms following vaccination, but serious side effects are uncommon, according to the CDC.", "The CDC notes that reports of death to VAERS following vaccination “do not necessarily mean the vaccine caused the death” and that it “follows up on any report of death to request additional information and learn more about what occurred and to determine whether the death was a result of the vaccine or unrelated.”", "It adds: “To date, VAERS has not detected patterns in cause of death that would indicate a safety problem with COVID-19 vaccines.”", "About 20 minutes into his video, Nepute also claims that COVID-19 cases have dropped “because they’ve already changed the testing.”", "“That happened on Inauguration Day, the World Health Organization said, stop the PCR testing, start switching to antibody testing,” he claims.", "That’s false. As we’ve previously explained, the WHO’s notice on Jan. 20 was a memo to lab professionals about the proper use of PCR tests. It was distorted on social media, with dubious websites wrongly claiming the guidance represented a massive change in testing protocol.", "Editor’s note: SciCheck’s COVID-19/Vaccination Project is made possible by a grant from the Robert Wood Johnson Foundation. The foundation has no control over our editorial decisions, and the views expressed in our articles do not necessarily reflect the views of the foundation. The goal of the project is to increase exposure to accurate information about COVID-19 and vaccines, while decreasing the impact of misinformation.", "American Dental Association. Email statement to FactCheck.org. 12 Feb 2021.", "“Bacterial Pneumonia Caused Most Deaths in 1918 Influenza Pandemic.” Press release, National Institutes of Health. 19 Aug 2008.", "Brooks, John T. and Jay C. Butler. “Effectiveness of Mask Wearing to Control Community Spread of SARS-CoV-2.” Journal of the American Medical Association. 10 Feb 2021.", "Corby, Patricia. Associate dean of translational research, department of oral medicine, University of Pennsylvania. Email to FactCheck.org. 16 Feb 2021.", "“Fact check: People have not been developing antibiotic-resistant pneumonia from wearing face masks.” Reuters. 23 Sep 2020.", "Fichera, Angelo. “Viral Posts Distort WHO Guidance on COVID-19 Tests.” FactCheck.org. 29 Jan 2021.", "“Group filing lawsuit over Tulsa mask mandate.” Facebook Live Video. FOX23 News. 18 Aug 2020.", "Hernández, José L., et al. “Vitamin D Status in Hospitalized Patients with SARS-CoV-2 Infection.” The Journal of Clinical Endocrinology & Metabolism. 27 Oct 2020.", "Jefferson, Yosh. “Mouth breathing: Adverse effects on facial growth, health, academics, and behavior.” General Dentistry. January 2010.", "Kasprak, Alex. “‘Real Doctor’ Promoting Tonic Water for COVID-19 Spreads Dangerous Misinfo.” Snopes. 15 Apr 2020.", "Licea, Melkorka. “‘Mask mouth’ is a seriously stinky side effect of wearing masks.” New York Post. 5 Aug 2020.", "“The Medical Minute: Separating mask myths from facts.” Penn State Health. 9 Jul 2020.", "McDonald, Jessica. “Does Vitamin D Protect Against COVID-19?” FactCheck.org. 8 Jun 2020.", "McDonald, Jessica. “Q&A on COVID-19 Vaccines.” FactCheck.org. Updated 29 Jan 2021.", "McDonald, Jessica. “Video Makes Bogus Claims About ‘War Crimes’ and COVID-19 Vaccine Safety.” FactCheck.org. 12 Feb 2021.", "Morens, David M., et. al. “Predominant Role of Bacterial Pneumonia as a Cause of Death in Pandemic Influenza: Implications for Pandemic Influenza Preparedness.” Journal of Infectious Diseases. 1 Oct 2008.", "Public Health Ontario. Email to FactCheck.org. 12 Feb 2021.", "“Safety of COVID-19 Vaccine.”Centers for Disease Control and Prevention. Updated 11 Feb 2021.", "“Selected Adverse Events Reported after COVID-19 Vaccination.” Centers for Disease Control and Prevention. Updated 16 Feb 2021.", "U.S. Department of State. “GEC Special Report | Pillars of Russia’s Disinformation and Propaganda Ecosystem.” August 2020.", "Warning Letter to Eric Nepute. Federal Trade Commission. 21 May 2020.", "“Wearing Masks in Public and COVID-19 – What We Know So Far.” Public Health Ontario. 14 Sep 2021.", "White, Callan. National spokesperson, Academy of General Dentistry. Phone interview. 17 Feb 2021.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]