["By Lori Robertson", "Posted on April 6, 2017", "President Donald Trump said the Obama administration “had a great opportunity to solve” the crisis in Syria when Obama set a “red line” for military intervention. But when Obama didn’t launch such intervention, “I think that set us back a long ways,” Trump said. However, Trump ignores his repeated calls at the time to “not attack Syria.”", "Trump is free to criticize President Barack Obama’s handling of Syria and the “red-line” episode. As we said in 2013, Obama blurred the facts on the issue in trying to downplay his remarks. But Trump’s comment also blurs the history of his own statements on the issue.", "The White House released a brief statement by Trump on April 4, the day a chemical bombing in a rebel-held area of northern Syria killed dozens of people. Humanitarian groups said the death toll was as high as 100, the New York Times reported. Trump blamed the Syrian government for the attack, but also the Obama administration’s foreign policy.", "Trump, April 4 statement: These heinous actions by the Bashar al-Assad regime are a consequence of the past administration’s weakness and irresolution. President Obama said in 2012 that he would establish a “red line” against the use of chemical weapons and then did nothing.", "In an April 5 press conference with Jordan’s King Abdullah, Trump again criticized Obama, saying: “I think the Obama administration had a great opportunity to solve this crisis a long time ago when he said the red line in the sand. And when he didn’t cross that line after making the threat, I think that set us back a long ways, not only in Syria but in many other parts of the world because it was a blank threat.”", "Trump said the recent chemical attack had “a big impact on me” and that his “attitude toward Syria and Assad has changed very much,” but he stopped short of saying he had changed his mind about military intervention in Syria. “I’m not saying I’m doing anything one way or the other,” he said.", "At the time of the red-line episode, Trump didn’t describe it as “a great opportunity to solve this crisis.” He instead advocated not intervening in Syria.", "Let’s look back at Obama’s 2012 statement, subsequent actions and Trump’s public statements at the time.", "In an Aug. 20, 2012, press conference, Obama was asked whether he “envision[ed] using U.S. military” in Syria “if simply for nothing else, the safekeeping of the chemical weapons.” Obama said, “I have, at this point, not ordered military engagement in the situation. But the point that you made about chemical and biological weapons is critical. … We have been very clear to the [Bashar] Assad regime, but also to other players on the ground, that a red line for us is we start seeing a whole bunch of chemical weapons moving around or being utilized. … We have communicated in no uncertain terms with every player in the region that that’s a red line for us and that there would be enormous consequences if we start seeing movement on the chemical weapons front or the use of chemical weapons.”", "Months later, some Republicans pressed Obama to enforce that red line in some way — though not with a commitment of troops — when the U.S. believed Assad had used chemical weapons.", "And in August 2013, a chemical weapons attack in the Damascus suburbs killed more than 1,400 people, an act the U.S. determined with “high confidence” was conducted by the Assad government. Days later, on Sept. 4, 2013, as the president was seeking support for military action, Obama claimed that his “red-line” statement wasn’t his red line, but instead one set by the international community and Congress, which had passed legislation in 2003 forbidding Syria from using chemical weapons.", "Trump’s stance at the time? He was firmly in the “stay out of Syria” camp. As the New York Times noted, he tweeted more than a dozen times about Syria in 2013, urging Obama not to take action. Through Trump’s prolific use of Twitter, he advised Obama to “forget Syria,” to “NOT attack Syria” and to “stay out of Syria.” And he urged Obama to “not attack” regardless of what Trump called Obama’s “very dumb RED LINE statement.” Some examples:", "The only reason President Obama wants to attack Syria is to save face over his very dumb RED LINE statement. Do NOT attack Syria,fix U.S.A.", "— Donald J. Trump (@realDonaldTrump) September 5, 2013", "AGAIN, TO OUR VERY FOOLISH LEADER, DO NOT ATTACK SYRIA – IF YOU DO MANY VERY BAD THINGS WILL HAPPEN & FROM THAT FIGHT THE U.S. GETS NOTHING!", "— Donald J. Trump (@realDonaldTrump) September 5, 2013", "President Obama, do not attack Syria. There is no upside and tremendous downside. Save your \"powder\" for another (and more important) day!", "— Donald J. Trump (@realDonaldTrump) September 7, 2013", "We should stop talking, stay out of Syria and other countries that hate us, rebuild our own country and make it strong and great again-USA!", "— Donald J. Trump (@realDonaldTrump) September 13, 2013", "On Aug. 29, 2013, Trump’s tweet on the topic said that “Obama needs Congressional approval” for action in Syria, which is exactly what Obama sought two days later.", "What will we get for bombing Syria besides more debt and a possible long term conflict? Obama needs Congressional approval.", "— Donald J. Trump (@realDonaldTrump) August 29, 2013", "On Aug. 31, 2013, Obama, who had been considering ordering a military strike unilaterally, decided to seek Congress’ approval. But there was plenty of division on such an authorization among lawmakers, and public opinion polls showed low support for military action. By mid-September, Secretary of State John Kerry and his Russian counterpart, Sergei Lavrov, had reached a diplomatic solution: an agreement between the United States and Russia to have Syria turn over its chemical weapons to international inspectors — a problematic agreement as it turns out.", "In a Sept. 13, 2013, interview on CNN, Trump criticized Obama for indecision: “Well, it all began when we he used the term red line, he’s going to draw a line in the sand essentially and don’t cross,” Trump said. “That they crossed but he didn’t do anything and then it became very late, and he decides to go back to Congress, and Congress is having fits over it, and it looks like he wasn’t going to even come close to getting to vote and he started looking very, very ineffective.”", "“It’s the most incredible thing I’ve ever witnessed as opposed to just either doing it or nothing,” Trump said, adding that he didn’t think military intervention should be done.", "Trump maintained his position of no intervention during the presidential campaign, even disagreeing with Mike Pence, his running mate, on the topic during the second presidential debate.", "Moderator Martha Raddatz, Oct. 9, 2016, presidential debate: Mr. Trump, let me repeat the question. If you were president … what would you do about Syria and the humanitarian crisis in Aleppo? And I want to remind you what your running mate said. He said provocations by Russia need to be met with American strength and that if Russia continues to be involved in air strikes along with the Syrian government forces of Assad, the United States of America should be prepared to use military force to strike the military targets of the Assad regime.", "Trump: OK. He and I haven’t spoken, and I disagree. I disagree. …", "I think you have to knock out ISIS. Right now, Syria is fighting ISIS.", "Politicians are certainly free to change their minds, and Trump indicated in his April 5 press conference that his attitude toward Assad had changed. And, as we said, Trump is free to criticize the Obama administration’s actions. But the president’s claim that Obama missed “a great opportunity to solve this crisis” when Obama set a red line glosses over Trump’s past statements against intervention.", "FactCheck.org Rating:", "Read More", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]