["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Many politicians portray themselves as pro-small business, including U.S. Rep. Jason Smith, a Republican, who was recently re-elected to represent Missouri’s 8th District.", "In a Nov. 9 Twitter post, after receiving an award from the National Federation of Independent Business, Smith said that \"in fact 7 out of 10 new jobs in America are created by small businesses.\"", "PolitiFact Missouri verified a similar statement by Sen. Claire McCaskill in 2017, except she claimed that it was two out of three new jobs.", "So how did Smith come up with a different statistic?", "For background, a small business, as defined by the government, is a business that employs fewer than 500 people. As of 2013, according to the Small Business Administration, there were 28.8 million U.S. small businesses.", "As of how many jobs small businesses created, the past fact-check cited a Small Business Administration article saying \"small businesses provide 55 percent of all jobs and 66 percent of all net new jobs since the 1970s.\" That’s a bit lower than what Smith cited.", "To understand where that \"seven out of 10\" statistic came from, we reached out to Smith’s office for evidence. Joey Brown, his communications director, pointed to two files from the Small Business Administration. Those two cited close to a 66 percent net new job creation.", "After all the searching, we went straight to the source itself for the most recent data – the Bureau of Labor Statistics, which publishes annual gross job gains and losses based on firm size.", "It measures firm size in two ways: base size (the size of a business at the start of a year) and average size (the average between the sizes at the beginning and end of the year). The reason for this split is that the size of a business or firm isn’t static, said BLS economist Sadeghi Akbar.", "\"If a business grows from five to 100 employees in a year, what size do you take?\" he said. \"A lot of research has shown that average sizing is the least biased when assigning size to a company.\"", "Therefore, using the average-sizing data, we calculated how many net new jobs small businesses have created from 1994 to 2017 compared to big businesses. The result: around two out of every three.", "That’s for net new job gains, which takes into account gains as well as job losses.", "When we calculated using only job gains and ignored any job losses since 1994, the number came to around 70 percent — closer to what Smith said. Even from calculating with data from just 2017, it was also around 70 percent of all new jobs.", "The percent of new jobs created by small businesses should not be confused with the percent of people employed by small businesses.", "Smith said that seven out of 10 new jobs are due to small businesses.", "Based on our calculations, he is correct for job gains. Factoring in job losses, as is standard with most economic measurements, would put the statistic closer to two out of every three new jobs.", "That’s pretty close, though — the difference between 66 percent and 70 percent.", "We rate this statement True.", "Rep. Jason Smith, tweet, Nov. 9, 2018.", "PolitiFact, \"Sen. McCaskill right about small business job creation,\" Mar. 17, 2017.", "Washington Post, \"Who actually creates jobs: Start-ups, small businesses or big corporations?\", April 25, 2013.", "Small Business Adminstration, Frequently Asked Questions, accessed Nov. 14, 2018.", "Forbes, \"16 surprising statistics about small businesses,\" Sep. 9, 2013.", "Bureau of Labor Statistics, Research Data on Business Employment Dynamics by Age and Size, accessed Nov. 14, 2018.", "Phone conversation with Sadeghi Akbar, economist at Bureau of Labor Statistics, Nov. 14, 2018.", "Email exchange with Joey Brown, communications director for Rep. Jason Smith, Nov. 15, 2018.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]