["About this rating", "In late November 2016, a photograph of what looks like a threatening letter from a \"neighborhood town watch\" appeared and subsequently made its way around social media:", "We are writing to you as the newly organized Neighborhood Town Watch. We understand that you currently wear a scarf on your head and we would like to put you on notice that this will no longer be tolerated in our neighborhood.", "Now that America is great again, we would like to offer you two opportunities to avoid any consequences on your poor previous decisions. First, you can take your radical attire of and live like all Americans. Or, your second option, you can go back to the God Forsaken land you came from.", "America is Great Again,", "Neighborhood Town Watch", "The photograph appeared with a wide range of different claims. When it was posted to Reddit on 20 November 2016, it was accompanied by a message claiming that the letter had been circulated to Muslims in Massachusetts. Facebook users shared the image claiming that the letter was sent to a \"hijabi Muslim woman in Harrisburg, PA\". Others said that it had been taken in Michigan, while the earliest posting of this image we uncovered, which was shared on 11 November 2016, alleged that it was from somewhere in Delaware:", "This picture is a couple of degrees of separation from me and comes from Delaware. One of my coworkers got this picture from his nephew. It is his nephew holding the letter. A coworker of the nephew had this letter left on her car. What a horrible thing to be done in Trump's name.", "Despite the number of people saying that they had encountered this letter from their \"neighborhood town watch\" in various parts of the country, the exact same image was used to accompany all of those claims. While it is possible that at least one of the aforementioned claims is true (the first version did reportedly originate in Delaware), there is no way that the same photograph was taken in multiple cities at once.", "While the image does appear to be of a real (rather than a digitally altered) photograph, there is no evidence that it was widely circulated to Muslims around the United States. It either documents an isolated incident (which has not warranted media coverage or police reports), or the work of a hoaxster who typed the letter, printed out a copy, photographed it, then shared it online with a fictional story.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]