["About this rating", "On 22 February 2019, the junk news site America's Last Line of Defense (LLOD) published a story headlined, \"Denzel Washington Leaves Democrat Party: ‘I’ve Had it With the Lies.’\" The story included a fabricated quote supposedly offered by the Oscar-winning actor during an exclusive interview with LLOD:", "The Democrats are just liars. I mean ... I’ve seen it. They make Facebook pages and write fake stories with sensational headlines to prove conservatives don’t research, which is preposterous. The liberals are the ones who can’t do facts.", "The fact is, my brothers like R. Kelly and Jussie Smollett are showing the true nature of our society and how out of control it is. I mean ... We’re letting kids listen to music older people might not like and encouraging them to dress, speak, and act like their opinion matters. What we say goes, kids. Sit down.", "Nothing posted to the network of websites operating under the LLOD banner should be believed, as LLOD traffics in made-up stories labeled \"satire.\" Even though the story itself bore a tag that said \"warm fuzzy fiction,\" readers were still confused and asked Snopes.com to verify whether the story was true.", "Falsely claiming that Washington's political views flipped from supporting Democrats to supporting Donald Trump is a frequent theme of junk news and social media hoaxes. In the lead-up to the 2016 presidential election, a widely shared story that falsely reported that the actor supported then-candidate Trump rocketed around Facebook via a series of junk sites. It gained so much traction that Washington and his publicist were forced to address it, confirming that it was \"100% complete fabrication.\"", "Despite being debunked, it continued to circulate online.", "BBC News.   \"Denzel Washington Hit by Facebook Fake News Story on Trump.\"\r\n    14 November 2016.", "Eagleton, Flagg.   \"Denzel Washington Leaves Democrat Party: 'I've Had It with the Lies.'\"\r\n    America's Last Line of Defense.   22 February 2019.", "Smiley, Lauren.   \"Denzel Washington Talks Obama Presidency, Fake News at San Francisco 'Fences' Premiere.\"\r\n    The Hollywood Reporter.   16 December 2016.", "Bump, Philip.   \"Denzel Washington Endorsed Trump, According to AmericaNews, Breitbartt, USANewsHome — and Facebook.\"\r\n    The Washington Post.   14 November 2016.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]