["In case you need an incentive to stay awake on the job, a nap cost a Texas morgue employee his life, claims a fake news story.", "\"Morgue employee cremated by mistake while taking a nap,\" states the headline on worldnewsdailyreport.com, a website that posts a disclaimer stating that it is satirical.", "Facebook users flagged the post as being potentially fabricated, as part of the social network’s efforts to combat fake news.", "This fake article has been circulating on Facebook at least since March and a more recent version copies the story but changes the location to Macomb, Mich. The story has gained enough attention that Texas police have had to publicly refute it.", "The article stated that an employee of the Jefferson County morgue, Henri Paul Johnson, decided to take a nap on a stretcher after working for 16 hours straight.", "\"While he was sleeping, another employee mistook him for the corpse of a 52-year-old car accident victim and carried him to the crematory,\" stated the website.", "Jenna Davis, a morgue employee, claimed that the coworker who caused the accidental cremation was a new employee and had forgotten to check for the toe tag to make sure he had the right body.", "The Beaumont Police opened a criminal investigation, the website stated.", "Actually, the police department did no such thing.", "Carol Riley, public information officer for the police department, told PolitiFact that her department was inundated with phone calls about the story when it first appeared months ago.", "\"People were sharing it on our Facebook messenger, they were calling our local media, calling to see if it had any teeth to it,\" Riley said.", "The story is \"absolutely fake news,\" she said. \"It did not happen.\"", "Helga Briscoe, administrator for Forensic Medical that does autopsies for 14 counties including Jefferson County, told PolitiFact that the privately-run facility doesn’t even do cremations.", "A search of the photos in Google Images shows that the photos were lifted from other news stories.", "The photo of the alleged Jenna Davis, the morgue coworker, is actually Dr. Lisa Funte, a  forensic pathologist at the morgue photographed by the Beaumont Enterprise newspaper in 2012.", "But the photo of the wide-eyed smiling man who was allegedly cremated was totally unrelated to the morgue: it matches the image of a DeSoto County constable arrested for DUI in 2015, Snopes found.", "A worldnewsdailyreport.com headline stated, \"morgue employee cremated by mistake while taking a nap.\" The Beaumont police department confirmed that this allegation is fiction.", "This story is ridiculous, and we rate it Pants on Fire.", "Worldnewsdailyreport.com, \"Morgue employee cremated by mistake while taking a nap,\" March 3, 2017", "Triggerresent.net, \"Worker at Morgue Takes a Nap; Another Employee Loads Him Into the…,\" Dec. 7, 2017", "Beaumont Enterprise, \"Take a look at the Jefferson County Morgue, and the woman who \"reads\" the bodies,\" May 23, 2012", "WJTV12, \"DeSoto County constable charged with DUI,\" Oct. 5, 2015", "Forensic Medical, Website, Accessed Dec. 12, 2017", "Snopes, \"Was a Morgue Employee Cremated by Mistake While Taking a Nap?\" March 3, 2017", "Interview, Officer Carol Riley, Beaumont Police Department public information officer, Dec. 12, 2017", "Interview, Helga Briscoe, Forensic Medical administrator, Dec. 12, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]