["The 45-second video was published in this Facebook post on October 20, 2019. It has been shared more than 2,600 times.", "Below is a screenshot of the misleading post:", "The post’s Indonesian-language caption translates to English as: “I take refuge in God from evil of the cursed… It was seen in the House of Representatives’ car park building … It really happened that spirits were also present during the inauguration of their brothers JOKOWI-MA'RUF. You should be grateful to God oh the nation of spirits because, for a great wisdom, God has made you spirits invisible from the vision of human being, if not you will feel how humans can become very cruel. God knows best...”", "“Jokowi” is the nickname for President Joko Widodo, while “Ma’ruf” refers to Vice President Ma’ruf Amin.", "The two were sworn in at the House of Representative building on October 20, 2019. Here is an AFP report published on October 20, 2019 about their swearing-in ceremony.", "The video was also shared on Facebook here, here and here; and on Twitter here, where it has been viewed more than 55,000 times and retweeted more than 500 times, with a similar claim.", "The claim is false; the video was created in 2016 by a Nicaraguan company using computer-generated imagery (CGI).", "Text superimposed on the video in the top right-hand corner in the misleading video reads: “JJPD Producciones.”", "Keyword searches on Google using the text found this one-minute video that was published on the official YouTube channel of JJPD Producciones on May 23, 2016.", "The video’s Spanish-language caption translates to English as: “JJPD Productions. Goblin in parking lot 2016 (Spanish version) CGI Video (computer generated imagery) If you liked the video, like and subscribe, :) Managua-Nicaragua-2016.”", "Computer-generated imagery (CGI) refers to special effects created using computer; it is used in films, television programs or commercials.", "According to the description on its YouTube channel and its Facebook page, JJPD Producciones is based in Nicaragua and specializes in special effects, animations and short films.", "Two Nicaraguan brothers are listed in the company’s social media accounts: Jose Joacquin Perez as producer, director and editor; Jimmy Perez as animator.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]