["About this rating", "A 13 December 2016 meeting between President-elect Donald Trump and hip-hop artist Kanye West led to immediate rumors that the entertainer had been offered or appointed to a position in the new administration's cabinet.", "West had made controversial comments at a November 2016 concert stating that he \"would have\" voted for Trump — if he had voted at all. West and Trump expressed mutual admiration and gamely posed together after the meeting (but took no questions):", "It didn't take long for the meeting (the reason for which is still not known) to inspire a number of hoax and satire stories reporting that Trump had appointed West to various cabinet positions, most of which didn't exist.", "In some versions, Trump was said to have appointed West as his vice president, but that job was already taken by Mike Pence:", "Versions of that claim circulated on web sites in parts of Africa, and Trump's legally impossible appointment was said to have been in an effort to \"prove\" he was not racist:", "US President elect, Donald Trump has announced that rapper Kanye West will become the vice president of the United States of America. “I am pleased to announce that I have chosen Kanye West as my Vice President. News conference tomorrow at 11:00 A.M.,” Donald Trump tweeted.", "Early this week, Kanye West visited Donald Trump and the media had been left guessing as to the real reason why West visited at that moment he (West) did not reveal the reasons for his visit. Analysts have said the pick might be a way for Donald Trump to fix his reputation as a racist and show the people that he is a reformed man. One political analyst who works for the CNN said “This is a huge political stunt. Here Donald is basically telling people that, listen, I do not hate black people. I will make one of your own vice president to prove it.”", "Fake news outlet Satira Tribune mocked West's hospitalization, which was widely attributed in news reports as related to post-traumatic stress and exhaustion. Satira Tribune asserted Trump appointed West as his \"Mental Health Advisor\":", "President-elect Trump has appointed artist Kanye West as his Mental Health Advisor. The position does not need to be voted on by Congress but the decision has left many people confused.", "“He’s not a doctor, first of all,” said Brian Williams. “Second, he’s a bit of a nutcase. Just because he seeked mental health care doesn’t qualify him to advise the president.”", "A third story, which was more easily recognizable as fabrication, came from The Beaverton. This particular article was clearly inspired by West's infamous September 2005 off-script remarks during a Hurricane Katrina fundraiser:", "That story, riffing off of the Katrina fundraiser controversy, reported that Trump appointed West \"Secretary of Caring About Black People\":", "After a meeting this week, followed by a flurry of rumours and speculation, U.S. President-elect Donald J. Trump has named Kanye West as Secretary of Caring About Black People.", "Both Trump and West agreed that the American musician was “tremendous” and uniquely qualified for the newly created position, considering West’s proven ability to discern whether sitting American Presidents cared about black people or not.", "“Honestly, it’s a relief,” said Trump ... \"When I was thinking about what it was going to be like being President, I was worried I would have to spend several minutes each day caring about black people. Thinking about how poor they are, being sad that they were being murdered by police. Now I have an incredible secretary who will do that for me.”", "West was also enthusiastic about the appointment, saying, “Normally getting a job as part of a Presidential cabinet would be weird for a guy like me, but there are so many other super-rich crazy people in this thing that I think I’m going to fit right in.”", "West sent several tweets after the meeting providing further details:", "I wanted to meet with Trump today to discuss multicultural issues.", "— KANYE WEST (@kanyewest) December 13, 2016", "These issues included bullying, supporting teachers, modernizing curriculums, and violence in Chicago. — KANYE WEST (@kanyewest) December 13, 2016", "I feel it is important to have a direct line of communication with our future President if we truly want change.", "— KANYE WEST (@kanyewest) December 13, 2016", "Kanye West said that he would not be pursuing a presidential run, and did not say that he had been offered any cabinet position. Circulating claims to the contrary were either fake news, or misconstrued claims from outlets outside the United States.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]