["Former Maryland Gov. Martin O'Malley, a possible contender for the Democratic presidential nomination, speaks during a visit to Indianola, Iowa. Iowa has the nation's first presidential caucuses in 2016.", "President Barack Obama’s efforts to pursue a landmark trade agreement with countries on the Pacific Rim has split his own party.", "Obama is seeking to finalize an agreement known as the Trans-Pacific Partnership. The deal has been in negotiation since 2009 between the United States, Australia, Brunei, Canada, Chile, Japan, Malaysia, Mexico, New Zealand, Peru, Singapore and Vietnam. Combined, these countries account for roughly 40 percent of the world’s economy.", "Trade deals often draw opposition from the left, due in part to concerns from labor unions -- a key Democratic-leaning constituency. For this reason, Obama’s push for the deal has forced Democratic officeholders and candidates to decide whether or not they will back the president’s agenda.", "Martin O’Malley, the former Maryland governor who is a potential presidential candidate, took a strong stand against pursuing such a deal during an interview with NPR on April 20, 2015, saying the public wouldn’t get to read the agreement before it was approved.", "Here’s the excerpt that aired; a longer version with more back-and-forth is available as a transcript on the NPR website.", "Inskeep: \"Let me ask about another issue on which Democrats seem to be divided. You have said in recent days that you oppose the proposed Trans-Pacific Partnership, a trade deal that would tie a dozen nations, including the United States, into free trade. What's wrong with that?\"", "O’Malley: \"Yeah, I do oppose it. What's wrong with it is first and foremost that we're not allowed to read it before representatives vote on it. What's wrong with it is that right now what we should be doing are things that make our economy stronger here at home. And that's my concern, that the Trans-Pacific Partnership, this deal, is a race to the bottom, a chasing of lower wages abroad. And I believe that that does nothing to help us build a stronger economy here at home.\"", "A reader asked us to take a closer look at whether Americans won’t get to read the deal before Congress casts a vote on it. So we did.", "As we discussed this question with trade experts, we concluded that O’Malley’s problem was conflating two pieces of legislation -- Trade Promotion Authority and the Trans-Pacific Partnership. Despite their similar acronyms (TPA and TPP), they are different, with different degrees of transparency.", "Trade Promotion Authority, sometimes informally known as \"fast-track,\" is a method for putting trade agreements before Congress. If Congress passes Trade Promotion Authority legislation, it’s granting the president broad leeway to negotiate a trade agreement.", "Once the executive branch finalizes a deal with its foreign counterparts, Congress will have a separate up-or-down vote to ratify the agreement, in the process, changing U.S. law to fit the agreement’s provisions. This second bill must be considered under streamlined procedural rules and voted on without any amendments from lawmakers.", "The bill introduced in Congress on April 16, 2015, was for Trade Promotion Authority, giving Obama the right to strike a deal and laying out the process for voting on the agreement once the administration finalizes it. Since the Trans-Pacific Partnership is the only significant trade deal that’s likely to be sent to Congress anytime soon, these two bills are intertwined. But their distinctions are important -- including the degree of transparency before each vote, which is the part that O’Malley was referencing.", "At the time Congress votes on whether to grant Trade Promotion Authority to Obama, the details of the Trans-Pacific Partnership won’t be known yet. But if Trade Promotion Authority is passed, and if the Obama administration succeeds in striking a deal, then the provisions of the deal will emerge before lawmakers cast the second vote.", "So in a strict sense, what O’Malley said is wrong. When lawmakers vote on the actual Trans-Pacific Partnership -- the second vote -- they will indeed have the full details of what the deal entails. The confusion enters because when Congress casts the first vote -- the one currently on Congress’ agenda, to empower Obama to strike the deal -- they won’t yet know the details of the Trans-Pacific Partnership.", "That’s the way the process was designed to work. Congress votes first to authorize the negotiations, and then votes a second time  -- weeks, months or even years later -- on whether to approve the agreement produced by the negotiations it authorized.", "\"There is congressional input into the negotiations as they proceed, but the negotiations take place behind closed doors and are not made open to the public or all members of Congress,\" said Robert M. Stern, an emeritus professor of economics and public policy at the University of Michigan. \"There may be a democratic deficit, but if the details of the negotiations were publicly available, there would likely be endless discussion and debates about various parts of the negotiations.\"", "That sticks in the craw of critics, including O’Malley. Doing it this way puts lawmakers in an uncomfortable position -- they are being asked to approve a process that will produce a bill they won’t have the ability to amend when it comes up for a vote later.", "O’Malley \"believes that Congress and the American people should be able to read the agreement before Congress votes on giving away their authority -- our authority -- to change it,\" his staff said in a statement to PolitiFact. \"The deal will not be made public until after fast track is approved -- and then at that point, there can be no changes. That leaves the general public in the dark.\"", "O’Malley does have a point that transparency has been lacking so far.", "Negotiations on the Trans-Pacific Partnership have been under way for years, even before passage of Trade Promotion Authority, but they’ve been conducted with extreme secrecy. In fact, much of what the public knows about them so far comes from draft documents obtained and publicized by Wikileaks.", "And under the Trade Promotion Authority bill now being considered in Congress, \"detailed and timely information\" will be shared with lawmakers and staff with \"proper security clearances as appropriate.\" Even before passage of Trade Promotion Authority, the Obama administration said, lawmakers and staff with security clearances have access to negotiating texts and summaries and has held hundreds of briefings.", "Some House Democrats say that isn’t enough enough openness. Rep. Rosa DeLauro, D-Conn., told The Hill that the administration is being \"needlessly secretive. … Even now, when they are finally beginning to share details of the proposed deal with members of Congress, they are denying us the ability to consult with our staff or discuss details of the agreement with experts.\"", "Our ruling", "O’Malley said that \"we're not allowed to read it (the Trans-Pacific Partnership) before representatives vote on it.\"", "Strictly speaking, he’s wrong -- Congress, and the American public, will be fully informed of what’s in the Trans-Pacific Partnership before lawmakers vote to make the agreement part of United States law.", "But he has a point that lawmakers won’t know what’s in the Trans-Pacific Partnership before they cast a separate, precursor vote -- the vote to authorize Obama to negotiate the Trans-Pacific Partnership on a fast-track basis in the first place.", "In a meandering radio conversation, O’Malley made a reasonable point that transparency about the deal has been lacking, but in doing so, he conflated two separate congressional votes. On balance, we rate his claim Mostly False.", "UPDATE, Apr. 25, 2015: This version adds additional information from the Office of the U.S. Trade Representative regarding the transparency policies afforded members of Congress prior to the passage of Trade Promotion Authority.", "Martin O’Malley, full interview transcript of interview with NPR, April 20, 2015", "Martin O’Malley, part 1 and part 2 of aired NPR interview, April 20, 2015", "House Ways and Means Committee, \"Hatch, Wyden and Ryan Introduce Trade Promotion Authority Legislation,\" April 16, 2015", "Wikileaks, \"Press release: Secret Trans-Pacific Partnership Agreement (TPP) - Environment Chapter,\" accessed April 23, 2015", "Margot E. Kaminski, \"Don’t Keep the Trans-Pacific Partnership Talks Secret,\" April 14, 2015", "Email interview with Joel P. Trachtman, professor of international law at the Fletcher School of Law and Diplomacy at Tufts University, April 21, 2015", "Email interview with Bruce Stokes, director of global economic attitudes at the Pew Research Center and former trade correspondent for National Journal, April 21, 2015", "Email interview with Robert M. Stern, an emeritus professor of economics and public policy at the University of Michigan, April 21, 2015", "Email interview with Dan Pearson, senior fellow in trade policy studies at the Cato Institute, April 21, 2015", "Email interview with Emily J. Blanchard, assistant professor of business administration at the Dartmouth Tuck School of Business, April 23, 2015", "Email interview with Matthew McAlvanah, spokesman for the Office of the U.S. Trade Representative, April 23, 2015", "Email interview with Haley Morris, spokesperson for Martin O’Malley, April 21, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]