["About this rating", "On 18 September 2015, a video was published on YouTube purportedly showing a spectator attending the 19 August 1995 heavyweight boxing match between Mike Tyson and Peter McNeeley and using a technology that did not yet exist (a camera phone) to take photographs of the match:", "1995 fight between Mike Tyson and Peter McNeeley in Las Vegas. Someone in the crowd is seen taking a picture from what appears to a smart phone device, or a device way ahead of the 90's. Aliens!!!", "I dunno if it's a time traveller or not, but no one can explain what camera it is; a QV-100 doesn't have a silver bit on the right, and this camera doesn't seem to have a black line under the lens.", "The clip shown above is real footage from the 1995 Tyson-McNeeley fight and does include glimpses of an audience member using a device (which makes its first appearance at the 2:50 mark of the video) similar in appearance to a modern camera phone, the first example of which was not sold until 2000:", "Although the photographic device seen here does resemble a type of camera phone not sold until several years after 1995, it also resembles any one of a number of handheld cameras that were in fact widely available in 1995. The resolution and size of the original video make it difficult to determine specific features of the device glimpsed here, but we found a number of cameras that are both similar to what's seen in the video and were commonly available in 1995, most notably the Casio QV-10A, the Casio QV-100 and the Logitech Fotoman:", "This footage much more likely captured someone using a pocket camera similar to one of the examples referenced above than a time-traveler from the future who journeyed back to 1995 to snap pictures of Mike Tyson with a 2000-era camera phone. (And, in any case, the gap between 1995 and the advent of the first camera phone technology was only a few years, so someone who possessed a camera phone in 1995 would not really have been \"way ahead\" of his time.)", "This isn't the first time that a \"time traveler\" has supposedly been spotted in older images. These rumors can nearly always be explained by taking a closer look at the clothing and technology extant at the time in question.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]