["It isn’t often that President Donald Trump and House Minority Leader Nancy Pelosi, D-Calif., use a similar talking point. But it happened recently with regard to funding for school safety — and neither Trump nor Pelosi was accurate.", "In remarks to the National Rifle Association on May 4, Trump said, \"I recently signed legislation that includes more than $2 billion to improve school safety, including the funding for training, and metal detectors, and security and mental health.\" Two weeks later, Vice President Mike Pence repeated that $2 billion figure in a speech in Indianapolis.", "Our friends at the Washington Post Fact Checker awarded these comments Four Pinocchios, their worst rating.", "Pelosi, however, used much the same logic during a CNN town hall on May 23. She touted new funding for school security, using a somewhat smaller figure of $1.6 billion to $1.8 billion.", "Here’s the exchange with host Chris Cuomo:", "Cuomo: \"The building we're in now, the building that you work in, the point of entry there is secure. You don't walk in with a trench coat with a shotgun underneath your jacket and get in. It doesn't happen. You know this. Why can't that be part of the equation? Talk about universal background checks, fine. Talk about mental health, how to identify them. The money for treatment. But why either/or? Why not make the schools safer? I know it's a state issue, but they're going to ask for money…\"", "Pelosi: \"It is a state issue.\"", "Cuomo: \"And that's where the federal government comes in. … You could offer them money to make schools so that when you go there as a guest, and you walk in, of course, they'll have multiple points of egress for emergencies. But you're going to be looked at when you go in that school and you're not going to walk in with a gun under your coat.\"", "Pelosi: \"In our omnibus bill that we passed just a few weeks ago, we had $1.8 billion — I think it was $1.8 billion, it could be $1.6 billion — in there for this purpose, for schools to make — to give them an opportunity to secure them. And those schools have to make those decisions.\"", "So, did a recent spending bill include at least $1.6 billion for school security or safety? No.", "When we checked with Pelosi’s office, they said she was referring to the Student Support and Academic Enrichment grants program, known as SSAE for short. This program, run by the Education Department, has been authorized to spend up to $1.6 billion.", "However, both the dollar figure and the nature of the grants don’t hold up to scrutiny.", "First, while the program has been authorized to spend up to $1.6 billion, the most recent spending bill only provided a portion of that amount, $1.1 billion.", "Pelosi \"misspoke on the specific amount,\" said spokesman Drew Hammill.", "It’s important to remember that Cuomo’s question focused on what could be done to boost security against armed school attacks. The SSAE program, it turns out, isn’t geared exclusively toward school security.", "Rather, it’s focused broadly on providing \"all students with access to a well-rounded education,\" improving \"school conditions for student learning,\" and improving \"the use of technology in order to improve the academic achievement and digital literacy of all students.\"", "School violence is one of the specific areas cited in the law. The grants may also be used for improving school-based mental health services, which can ease the causes of some school-violence incidents.", "However, these are just two of the areas these grants can be used for. Some of the others are:", "• Technologies such as software, simulations, online databases, computer-based assessments, and educational access tools for rural areas.", "• The prevention, early intervention, rehabilitation referral, recovery support services, or education related to the illegal use of drugs.", "• Schools, or dedicated programs within schools, to engage students in \"rigorous, relevant, and integrated learning experiences focused on science, technology, engineering, and mathematics (STEM), including computer science.\"", "The explanation of the spending bill published in the Congressional Record on March 28 emphasized that SSAE grants \"can be utilized for a wide range of uses.\"", "While the uses mentioned in the explanation included \"school-based violence prevention strategies,\" the explanation emphasized that the bill \"encourages the department to especially support pre-kindergarten through grade 12 computer science education programs that address the enrollment and achievement gap for underrepresented students such as minorities, girls, and youth from families living at or below the poverty line.\"", "And a House committee report describing the bill highlighted that \"programs designed to support non-cognitive factors such as critical thinking skills, social skills, work ethic, problem solving, and community responsibility are an eligible use of funds under SSAE grants supporting a well-rounded education.\"", "So the $1.1 billion in the spending bill won’t necessarily be spent on school security of the type Cuomo was asking about.", "Ultimately, \"school safety has to compete with STEM, foreign language learning, technology enhancements and numerous other educational priorities for those SSAE funds,\" said Bob Farrace, the director of public affairs for the National Association of Secondary School Principals. \"With that single funding pool, school leaders have to balance the need to safeguard the school with the need to make the school a place worth coming to.\"", "Pelosi’s spokesman, Hammill, emphasized that protecting students from attacks is about more than just hardening infrastructure.", "The grants, he said, promote \" ‘soft’ efforts to ensure schools can combat bullying, harassment, while offering school personnel training, mental health resources, comprehensive school mental and behavioral health services, drug and violence prevention, training on trauma-informed practices, and health and physical education.\"", "While those areas are covered as acceptable uses, the expressed desire by Congress is that these grants also foster such goals as boosting STEM education, digital learning and distance education — and that suggests that not all $1.1 billion will be used on efforts that address school violence, even indirectly.", "Responding to a question about preventing gun violence in schools, Pelosi said that a recent spending bill had at least \"$1.6 billion in there ... for schools to give them an opportunity to secure them.\"", "Her office acknowledged to PolitiFact that she should have said $1.1 billion, the amount devoted to a federal grant program for schools that was funded in the bill.", "Still, even that figure is likely exaggerated. When the Education Department distributes $1.1 billion in grants under the program she was referencing, school security will have to fight for that money against such items as STEM education and digital education.", "We rate the statement Mostly False.", "Nancy Pelosi, remarks in a CNN town hall, May 23, 2018", "Congressional Record, \"Explanation of the Consolidated Appropriations Act, 2018,\" March 22, 2018", "Education Department/National Center on Safe Supportive Learning Environments, \"ESSA, Title IV, Part A, Student Support and Academic Enrichment (SSAE) Program,\" accessed May 24, 2018", "House of Representatives, \"H. Rept. 115-244: Depts. of Labor, Health and Human Services, and Education, and Related Agencies Appropriation Bill, 2018,\" July 24, 2017", "Donald Trump, remarks to the National Rifle Association, May 4, 2018", "Mike Pence, remarks in Indianapolis, May 18, 2018", "Consortium for School Networking, \"The Student Support and Academic Enrichment (SSAE) Grant Program,\" accessed May 24, 2018", "Washington Post Fact Checker, \"The Trump administration’s bogus spin that it obtained $2 billion for ‘school safety,’\" May 23, 2018", "Email interview with Bob Farrace, director of public affairs for the National Association of Secondary School Principals, May 24, 2018", "Email interview with Drew Hammill, spokesman for Nancy Pelosi, May 24, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]