["By Lori Robertson", "Posted on May 1, 2018", "President Donald Trump falsely claimed in a tweet that there were “No questions on Collusion” in a list of questions the special counsel reportedly has for the president. There are several inquiries about possible collusion among the questions published by the New York Times.", "On April 30, the Times reported that special counsel Robert S. Mueller III had “at least four dozen questions on an exhaustive array of subjects he wants to ask President Trump to learn more about his ties to Russia and determine whether he obstructed the inquiry itself.” The Times published the list and said it came out of discussions between Trump’s lawyers and the special counsel’s office, which has sought to question the president.", "The next morning, Trump said on Twitter that it was “disgraceful” that the questions were “leaked,” adding that there were none on “collusion,” which he called “a made up, phony crime.”", "So disgraceful that the questions concerning the Russian Witch Hunt were “leaked” to the media. No questions on Collusion. Oh, I see…you have a made up, phony crime, Collusion, that never existed, and an investigation begun with illegally leaked classified information. Nice!", "— Donald J. Trump (@realDonaldTrump) May 1, 2018", "But there are several questions in the published list about possible collusion. The Times divided the list into four categories, related to: former National Security Adviser Michael Flynn, former FBI Director James Comey, Attorney General Jeff Sessions and campaign coordination with Russia. That last category includes:", "For more on the key moments in the FBI’s and special counsel’s probe of Russia’s interference in the 2016 election, see our “Timeline of Russia Investigation.”", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]