["A nurse prepares a vial of the COVID-19 vaccine to administer to an elderly resident at a nursing home in Belgium, Dec. 28, 2020. (AP)", "• Thirty-three elderly people in Norway died after receiving the COVID-19 vaccine.", "• Those who died were very frail nursing home residents with serious underlying illnesses. The inoculation was not determined to be the cause of death.", "• Norwegian health authorities say that in some of the cases, relatively mild side effects from the vaccine such as fever and nausea could have contributed to the deaths of the most frail patients.", "As countries around the world begin COVID-19 inoculations, vaccine critics are promoting the notion that the shots can easily cause injury or death — even though the evidence does not support their claims.", "That’s what happened after Norway reported the deaths of elderly people who had received the COVID-19 vaccine.", "Social media posts, like this one from Fox News commentator Jan Morgan, point to the Norway deaths as evidence that the vaccine causes harm: \"23 die within hours of taking COVID vaccine. ... I’ve never taken a flu shot and I’m certainly NOT letting anyone inject this garbage in to my body.\"", "Morgan’s Facebook post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Initial Norwegian reports on Jan. 15 indicated that 23 people had died after receiving COVID-19 vaccines. By Jan. 18, the number of deaths had increased to 33, out of about 48,000 vaccinated. Though the Facebook post says people died \"within hours\" of receiving the vaccine, Norwegian authorities said only that 23 deaths occurred within six days of vaccination, and published reports do not indicate the time frame for the remaining 10 deaths.", "The Norwegian government said the country’s vaccination program is initially targeting the most vulnerable — the elderly and those in nursing homes — and \"a high proportion\" of the latter were very frail or terminally ill and already very near the end of their lives.", "As a result, health authorities said, \"It is expected that deaths close to the time of vaccination may occur.\"", "There’s no proof that the COVID-19 vaccines caused the deaths, the Norwegian Medicines Agency said. Norway’s strong \"reporting culture\" for vaccine adverse reactions means that \"health care professionals have a low threshold for reporting possible adverse reactions, even when the causal relationships appear very unclear,\" a government report said.", "An average of 45 people die each day in Norwegian nursing homes and similar institutions, according to the Norwegian Medicines Agency. Therefore, \"it is not a given that this represents any excess mortality or that there is a causal connection,\" Camilla Stoltenberg, head of the Norwegian Institute of Public Health, said at a press conference on Jan. 18.", "The COVID-19 vaccines were developed quickly but rely on scientific research that is decades old, and they underwent a rigorous review process, PolitiFact has reported. That hasn’t prevented a barrage of misinformation about them, including claims that they can cause death and infertility and that they are part of a plan to implant people with microchips — claims that have all been debunked by PolitiFact.", "U.S. health experts were aware of the possibility that deaths following vaccination would be perceived as being caused by the vaccine. Dr. Helen Keipp Talbot, a member of the U.S. federal Advisory Committee on Immunization Practices, said in December that the likelihood of nursing home patients dying from other causes shortly after vaccination could erode public confidence in the safety of the vaccines. She said that’s why she voted against prioritizing residents of long-term care facilities for vaccines.", "However, residents and staff of long-term care facilities in the U.S. are among the most vulnerable when it comes to COVID-19. They represent 40% of COVID-19 deaths nationwide, though they make up less than 1% of the U.S. population. Other members of the advisory committee voted to include nursing home residents in the earliest phase.", "Of the 33 Norwegians who died after receiving the vaccine, 13 of their cases have been completely assessed by health authorities. The 13 people were all older than 80, with some older than 90, and were considered severely frail, which was defined as having serious heart failure, dementia, chronic obstructive pulmonary disease and similar conditions.", "As of Jan. 18, Norway had vaccinated more than 48,000 people, the majority of whom were nursing home residents. The 33 fatalities represent fewer than 1 out of 1,000 of those who were vaccinated, Steinar Madsen, the medical director of Norwegian Medicines Agency, told Bloomberg.", "For some of the frailest patients, though, \"the possibility that relatively mild side effects of the vaccine could have serious consequences cannot be ruled out,\" health officials said. Common vaccine reactions — including fever, nausea and diarrhea — could have contributed to some of the deaths in the 13 cases for which investigations have been completed.", "\"There is a possibility that these common adverse reactions, that are not dangerous in fitter, younger patients and are not unusual with vaccines, may aggravate underlying disease in the elderly,\" Madsen told the medical journal BMJ. \"We are not alarmed or worried about this, because these are very rare occurrences and they occurred in very frail patients with very serious disease.\"", "The risks of the COVID-19 vaccine for much older people are not as well understood, because a limited number of people 85 and older participated in the large clinical trials. Madsen said Norwegian officials are now recommending careful medical evaluation of the very frail before deciding whether vaccination is appropriate.", "A Facebook post says, \"23 people die within hours of taking the COVID vaccine. ... I’ve never taken a flu shot and I’m certainly NOT letting anyone inject this garbage in to my body.\" The claim implies the deaths were caused by the vaccine.", "Norway health officials said 33 elderly people died after receiving the COVID-19 vaccine. (The initial figure of 23 was later updated.) But the vaccine has not been proved to be the cause of death, and those who died were very frail nursing home residents with serious underlying illnesses. The Facebook post says people died \"within hours\" of getting the vaccine, but authorities said only that 23 deaths occurred within six days of vaccination, and published reports do not indicate when the other 10 deaths occurred.", "An average of 45 people die each day in Norwegian nursing homes and similar institutions, so it is not clear that the deaths represent any excess mortality or a connection to the vaccine.", "Because it lacks important context and misrepresents when the deaths occured, we rate this post Mostly False.", "Bloomberg, \"Norway moves to calm vaccine anxiety after elderly deaths,\" Jan. 18, 2021", "Bloomberg, \"What to know about vaccine-linked deaths, allergies,\" Jan. 18, 2021", "BMJ, \"Covid-19: Norway investigates 23 deaths in frail elderly patients after vaccination,\" Jan. 15, 2021", "Facebook post, Jan. 17, 2021", "Faktisk, \"Too soon to say whether 23 Norwegians died because of the COVID-19 vaccine,\" Jan. 19, 2021", "Kaiser Health News, \"What seniors can expect when COVID vaccines begin to roll out,\" Dec. 9, 2020", "Norwegian Institute of Public Health, \"International interest about deaths following coronavirus vaccination,\" Jan. 19, 2021", "Norwegian Medicines Agency, \"COVID-19 vaccination associated with adverse drug reactions in elederly people who are frail,\" Jan. 15, 2021", "Norwegian Medicines Agency, \"Reported suspected adverse reactions of COVID-19 vaccines,\" Jan. 15, 2021", "Norwegian Medicines Agency, \"Weekly report on suspected adverse drug reactions to coronavirus vaccines,\" Jan. 14, 2021", "NPR, \"Health care workers, nursing home residents to be prioritized for COVID-19 vaccine,\" Dec. 1, 2020", "PolitiFact, \"8 facts and 4 unknowns about the coronavirus vaccines,\" Dec. 17, 2020", "PolitiFact, \"Vaccine misinformation: preparing for infodemic’s ‘second wave,’\" Dec. 21, 2020", "Washington Post, \"Health-care workers and nursing home residents should be the first to get coronavirus vaccines, CDC advisory group says,\" Dec. 3, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]