["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Since the confirmation hearing for U.S. Secretary of Education Betsy DeVos, charter schools have been under increased scrutiny.", "In Missouri, charter schools have only been built in Kansas City and St. Louis, but a bill now before the legislature may make it easier for the schools to pop up in other towns.", "On March 17, the Missouri House of Representatives narrowly passed and sent House Bill 634 to the Senate to allow for the expansion of charter schools. One legislator who didn’t vote in favor for House Bill 634 was Rep. Nate Walker.", "The Republican from Kirksville told MissouriNet that Speaker Todd Richardson, R-Poplar Bluff, tried to persuade him to change his mind, but Walker wouldn’t budge. One reason, Walker said, was because \"(charter schools in Missouri) are actually failing in greater capacity than public school systems.\"", "But are they? Walker didn’t provide a definition for what he meant by failing, and the Missouri education department doesn’t have a specific definition, either. However, after looking at the education department's performance reviews, the data shows that charter schools are performing about the same as nearby public schools.", "Definitions of failing", "When PolitiFact called Walker and asked him where he got his data, he said he got it from a \"lot of different things,\" and began providing some numbers.", "\"Sixty-four percent of Missouri Charter Schools have failed or are failing,\" he said, without citing the source of these statistics. \"Since 1999, we’ve had 59 charter schools open in the state. Thirty-eight of the 59 charter schools have failed or are failing students.\"", "However, according to the data from the Missouri Department of Elementary and Secondary Education, for the 2016-17 year there were 72 individual charter schools within 39 charter school districts. And since 1999, the year after charter school law was enacted, there have been 63 charter school districts, and 21 — or 33 percent — have closed.", "When we asked Walker in a phone interview what his definition was for \"failing,\" this was his response:", "\"Well, they’re not meeting the standards of the (education department). You go check the facts, I’m not a reporter. You’ve got a degree in journalism and understand factual information, but I stand by my comments, and all you need to do is go do your research and find I’m absolutely right. Probably more than right.\"", "We went to the education department to learn more. Sarah Potter, the communications coordinator for the department, wrote in an email, \"There are no parameters in state statute for a ‘failing’ charter school.\"", "However, the department does issue an Annual Performance Review score for both charter and traditional public schools to determine how well they’re educating the students. Charter schools are independent public schools freed from certain regulations. They are also subject to other rules defined by their contracts with their sponsors, such as universities, who then hold charter schools accountable for their results instead of the state.", "This performance review takes into account standardized test scores, attendance rates and graduation rates along with financial status and leadership stability.", "There are four levels of accreditation. \"Accredited with Distinction\" and \"Accredited\" signify that the school or district is meeting performance standards. Schools or districts must earn a 70 percent or higher on their performance review to earn those classifications. \"Provisionally Accredited\" and \"Unaccredited\" indicate that the school or district isn’t meeting performance standards and earned a performance review score below 70 percent and below 50 percent, respectively.", "In fact, in our phone interview with Walker, he did mention accreditation, saying: \"Of the 38 charter schools (districts) currently open for business, 11 have been deemed Provisionally Accredited, six would have been deemed Unaccredited and four were too new to receive a score. Right now 46 percent of the active charter schools would be classified as Accredited.\"", "These numbers are correct — though there were 39 districts and not 38 as Walker said — according to the latest data available at the state education department’s website.", "For comparison, 99 percent of traditional public school districts earned Accredited or above while only 46 percent of charter school districts earned that status. It’s not looking so good for Missouri charter schools.", "Charter schools vs. traditional public schools", "Not so fast, said Doug Thaman, the executive director of the Missouri Charter Public School Association.", "\"One of the concerns we have is that when statements are made like (the one) Walker made, that’s a comparison of charter schools to an entire school district, and that is just not a true comparison,\" he said. \"You can’t compare a single school to an entire district or to the entire state.\"", "What Thaman means is that performance scores are assigned to both individual schools and the districts in which several schools reside, and the scores are often different. He also pointed out that charter schools, which have to accept any student who applies, often educate lower-performing students whose needs haven't been met by traditional public schools, so charter schools score poorly on the performance review because they're helping students who score below grade level catch up.", "Thaman suggested it would be better to compare the performance score of individual charter schools to individual competitor public schools within the same district. So we did.", "In Kansas City, the charter schools reside inside public school district Kansas City 33, which had an overall performance score of 70 percent, which is also the lowest score to earn an Accredited or above rating.", "Both the Kansas City charter schools and traditional public schools in the district had 32 sites that were assigned a performance score in the 2015-16 school year, But more individual charter schools — 21— were performing at or above district’s rate of 70 percent than individual public schools — 12. And even when you compare charter school districts’ performance scores to Kansas City 33’s performance score, over 60 percent of the charter school districts meets or exceeds the district's score.", "So overall, it appears that most charter schools in Kansas City are doing just fine when compared to Kansas City 33 district and its schools.", "Now let’s take a look at St. Louis. This one is a little harder to compare because the public school district the charter schools are located within — the St. Louis City district — has 71 sites with performance scores, compared to only 22 charter school sites. St. Louis City district has an overall performance score of 74.6 percent.", "Just as with Kansas City, it appears that individual St. Louis charter schools are performing about the same as their public school counterparts. Fifty percent of charter schools and 48 percent of public schools earned an Accredited rating, or a 70 percent performance score.", "However, when comparing districts’ scores, the scales tip toward the public schools. St. Louis City district has an overall score of 74.6 percent. Nine charter school districts, or 56 percent, score below that. However, 57 percent of the traditional public schools fall below their districts’ performance rate.", "Our ruling", "Rep. Walker said, \"(Charter schools in Missouri) are actually failing in a greater capacity than the public school systems.\"", "Neither Walker nor the education department gave a definition for a failing charter school. And although charter school districts performance scores are nowhere near the 99 percent of public school districts that are Accredited, current charter schools are performing on par with with the public schools in their city.", "Walker’s statement contains an element of truth but ignores critical facts that would give a different impression. We rate this claim as Mostly False.", "GOP legislator expects proposed charter schools expansion to fail in Missouri Senate. Missourinet.com. Accessed 11 April 2017.", "House Bill 634. 99th Missouri General Assembly. Accessed 11 April 2017.", "House Bill 634 Voting Record in House of Representative. 99th Missouri General Assembly. Accessed 11 April 2017.", "Charter Schools Program Office. Missouri Department of Elementary and Secondary Education. Accessed 11 April 2017.", "Sarah Potter. Communications Coordinator, Missouri Department of Elementary and Secondary Education. Email interview 9 April 2017 and 4 April 2017.", "Missouri Charter Schools at a Glance - 2016 APR Data. Missouri Department of Elementary and Secondary Education. Accessed 11 April 2017.", "Charter School Renewals and Closures. Missouri Department of Elementary and Secondary Education. Accessed 11 April 2017.", "Frequently Asked Questions: Charter Schools. Missouri Department of Elementary and Secondary Education. Accessed 11 April 2017.", "Doug Thaman. Executive Director, Missouri Charter Public School Association. Phone and Email Interview. 4 April 2017.", "Missouri 2016 APR Summary By Buildings. APR - MSIP5 State Accountability. Missouri Department of Elementary and Secondary Education Comprehensive Data System. Accessed 1 April 2017.", "Missouri 2016 APR Summary By Districts. APR - MSIP5 State Accountability. Missouri Department of Elementary and Secondary Education Comprehensive Data System. Accessed 1 April 2017.", "Kansas City Charter Schools. Missouri Department of Elementary and Secondary Education. Accessed 20 April 2017.", "St. Louis Charter Schools. Missouri Department of Elementary and Secondary Education. Accessed 20 April 2017.", "Missouri Revised Statutes. Chapter 160 Schools—General Provisions. Section 160.400.1. Accessed 20 April 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]