["On International Women’s Day Coca-Cola Nigeria tweeted a video claiming 50% of young women in northern Nigeria have no formal education.", "To mark International Women’s Day in 2019, the Nigeria unit of beverages giant Coca-Cola tweeted a eye-raising statistic.", "“50% of young women in northern Nigeria have no formal education,” it said in a much-shared video. Reliable surveys show this is correct.", "The reasons for this include religious and cultural beliefs, insecurity and poverty, experts said.", "​​​​​​To mark International Women’s Day in March 2019, Coca-Cola Nigeria tweeted a video that opened with the claim that “50% of young women in northern Nigeria have no formal education”.", "The video is part of a campaign by the multinational beverages company to help small businesses run by women.", "But are half of young women in the north of Nigeria, Africa’s most populous country, without formal education?", "Coca-Cola Nigeria is yet to respond to our request for more information about this claim, including how it defined “formal education” or what age range “young women” fell into.", "The video attributed the claim to the Education Policy and Data Center, a research arm of US-based international non-profit organisation FHI 360,  which is focused on “healthcare, education and economic participation”.", "In an undated article, Schooling in northern Nigeria: Challenges for girls' education, the centre’s researchers state that “in many northern states more than 50% of young women ages 15-24 have no experience with formal education”. (Note: The centre has not responded to us but using this approach we established the article was first published in 2014.)", "The centre calculated this number using data from the 2011 Nigeria Multiple Indicator Cluster Survey (MICS 2011). This is an internationally comparable survey developed by UN agency Unicef to track the progress of women and children.", "The 2011 survey put the literacy rate among women aged 15 to 24 in Nigeria’s three northern geopolitical zones at 32% in North West, 37% in North East and 65% in North Central.", "This averages to a literacy rate of 44.7% among young women aged 15 to 24 in northern Nigeria.", "The most recent Multiple Indicator Cluster Survey is the 2016/17 edition, published in October 2017. Here the average literacy rate of women aged 15 to 24 in the three northern geopolitical zones worked out to 47.3%.", "But is literacy rate enough to gauge formal education?", "Africa Check asked Dr Isiaka Olarewaju, director of household statistics at Nigeria’s National Bureau of Statistics, how “literacy” is defined.", "He told us that those who have not attended a formal school are considered “not literate”, as is the small number of women  who attended only primary school but failed the Nigeria Multiple Indicator Cluster Survey literacy test.", "The test requires a woman to read “a short simple statement” like “I am going to market” or “My name is Peace”, according to the survey report.", "“The majority of those who could not read and write had no formal education,” Olarewaju said of the 2011 survey. “All those who attended secondary school could read and write, but only about 11% of those who ended their education in primary school could read and write. And this cuts across geopolitical zones.”", "But passing a test is not the same as having formal education, a number of academics told Africa Check.", "We asked Prof Tijjani Abubakar, the dean of the faculty of education at the Ahmadu Bello University in Zaria, Nigeria, what qualified as formal education.", "“Anyone who has not attended primary school, secondary school, university, polytechnic or college of education does not have formal education,” Abubakar said.", "“Even if you didn't finish primary school, you can still be said to have formal education.”", "Segun Adedeji, a professor of education management at the University of Ibadan agreed, noting that anyone who has had the experience of being enrolled, attending and being taught in a school has formal education.", "“You do not have to pass an examination or receive a certificate before you can be referred to as one who has formal education,” he said.", "Educational attainment was not measured in the 2011 and 2016/17 MICS, Dr Olarwaju from the National Bureau of Statistics  told Africa Check.", "But the Demographic and Health Survey 2013 has data on the educational level  reached by women. Oriyomi Ogunwale, who is project lead at education-focused organisation Eduplana, told Africa Check this.", "This survey found that 30.5% of women aged 15 to 24 did not have formal education, while a further 12.4% had only attended or completed primary school.", "But the 2013 survey  did not break this down by geographical region, Erica Nybro, the senior advisor for communication at the Demographic and Health Surveys Program told Africa Check. (Note: The survey did find that 55.13% of women aged 15-49 in the north have no formal education. In the south this was only 6.23%.)", "The Nigeria Demographic and Health Survey 2018 preliminary report was released in May 2019. But this does not contain data on educational attainment. The full dataset from this will be available by September 2019, Nybro said.", "Educational attainment among women in northern Nigeria is generally low, education professor at the University of Ibadan Segun Adedeji told Africa Check", "The reasons for this include “religious and cultural beliefs, insecurity and poverty”.", "On International Women’s Day, Coca Cola Nigeria tweeted a video that claimed that 50% of young women in northern Nigeria have no formal education.", "Two reliable data sources - the Multiple Indicator Cluster Survey and the Demographic and Health Survey - show that this is accurate.", "Religious and cultural beliefs, insecurity and poverty contribute to lower access to education in northern Nigeria than in the south,  Segun Adedeji, an education professor at the University of Ibadan said.", "Further reading:", "https://africacheck.org/reports/number-of-qualified-primary-school-teachers-and-grade-6-literacy-in-nigeria-higher-than-claimed/", "https://africacheck.org/reports/nigeria-girls-school-worldwide-activist-malala-claimed/", "Please complete this form to receive the HTML sharing code.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "For democracy to function, public figures need to be held to account for what they say. The claims they make need to be checked, openly and impartially. Africa Check is an independent, non-partisan organisation which assesses claims made in the public arena using journalistic skills and evidence drawn from the latest online tools, readers, public sources and experts, sorting fact from fiction and publishing the results.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "© 2023 - Africa Check - All rights reserved.", "We will never charge you for verified, reliable information. Help us keep it that way by supporting our work.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "Support independent fact-checking in Africa."]