["About this rating", "Some conspiracy theories refuse to die. In October 2020, ABQ RAW — a self-described \"guerrilla filmmaking\" news organization — posted a YouTube video claiming that they had visited Jeffrey Epstein’s ranch between Santa Fe and Albuquerque, New Mexico, and spotted a man there who they believed was Epstein.", "Epstein was a financier and convicted sex offender, who died in August 2019 while awaiting trial in a New York jail.", "The man is seen pulling up in a truck around 50 seconds into the video. The caption for the video says: “Jeffrey Epstein may have not killed himself and may be still be alive. We visited the Zorro Ranch recently and saw some interesting things. Take a look at the video and see if Jeffrey Epstein is in fact alive and well.”", "According to the people behind the video, they saw a red truck pull up as they were filming, and a man inside it held up his phone to record them. Based on a very blurry zoom, the man was said to look like Epstein. The video concludes with the question: “Did Jeffrey Epstein kill himself? It may be completely possible that he has ridden off into the New Mexico sunset.”", "We know that this is completely false. Multiple reputable sources have confirmed to the media before that Epstein is in fact dead, including Dr. Barbara Sampson, the chief medical examiner in New York City, who ruled his death a suicide by hanging. Dr. Michael Baden, a forensic pathologist hired by Epstein’s brother, disputed the official findings and claimed that he had been strangled instead. Baden also observed the autopsy done by city officials.", "Epstein’s Zorro Ranch, known for being the place where many of his accusers say they were trafficked and raped, is comprised of both public and private property. In 2019, state officials said they were trying to seize the land.", "Given that multiple experts confirmed Epstein's autopsy took place, and one cannot have an autopsy without a dead body, we know that Epstein was certainly not on the ranch, and therefore rate this claim as “False.”", "Nur Nasreen Ibrahim is a reporter with experience working in television, international news coverage, fact checking, and creative writing.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]