["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "President Barack Obama shakes hands with President-elect Donald Trump following a meeting in the Oval Office Nov. 10, 2016, in Washington. (Getty)", "The Obama administration declared swine flu, or H1N1, a public health emergency six weeks before H1N1 was declared a pandemic.", "No H1N1 deaths had yet been recorded in the United States.", "Six months after that initial declaration, when more than 1,000 deaths had occurred, Obama himself declared H1N1 a national emergency.", "President Donald Trump’s response to the coronavirus is being defended with an attack on how President Barack Obama handled the outbreak of H1N1, also known as swine flu, in 2009.", "The headline of an article shared on Facebook made this claim:", "\"Flashback: Obama waited six months to call swine flu an emergency after thousands died.\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The article was published on Prntly, which describes itself as a conservative news website that defends Trump. The article goes on to say that \"it wasn’t until six months after\" H1N1 became a global pandemic that \"then-President Obama declared a public health emergency on what was already a pandemic. By that time, the disease had infected millions of Americans and more than 1,000 people had died in the U.S.\"", "Not only is this timeline wrong, but the story and headline eliminate important facts and distort others, imparting a false narrative that social media users are resharing.", "Let’s take a look.", "Online, fact-based news is going to be very important in the coming weeks. Please consider donating to PolitiFact today.", "The H1N1 influenza virus was discovered in the United States in the spring of 2009 and spread around the world.", "It was originally referred to as \"swine flu\" because many genes in the virus were similar to influenza viruses that normally occur in pigs in North America.", "It was serious. From April 12, 2009, to April 10, 2010, in the United States, there were 60.8 million cases of swine flu, 274,304 hospitalizations and 12,469 deaths, the U.S. Centers for Disease Control and Prevention (CDC) estimated.", "Obama and his administration issued two emergency declarations, but the article refers only to one.", "Obama’s acting director of health and human services declared H1N1 a public health emergency on April 26, 2009.", "That was when only 20 cases of H1N1 — and no deaths — around the country had been confirmed.", "Two days later, the administration made an initial funding request for H1N1 to Congress. Eventually $7.65 billion was allocated for a vaccine and other measures.", "H1N1 was declared a pandemic by the World Health Organization on June 11, 2009.", "In other words, the Obama administration’s public health emergency declaration came more than six weeks before the pandemic designation.", "Now to Obama’s second action.", "On Oct. 24, 2009, six months after his administration declared H1N1 a public health emergency, Obama declared it a national emergency.", "At that point, H1N1 had claimed more than 1,000 American lives, according to the CDC.", "When Obama made his declaration, the New York Times reported at the time, thousands of people were lining up in cities across the country to receive vaccinations, as federal officials acknowledged that their vaccination program had gotten off to a slow start, with some states having requested 10 times the amount they have been allotted.", "Millions of people in the United States had had H1N1.", "The national emergency declaration allowed the federal government to temporarily waive or modify requirements of the Medicare, Medicaid, and State Children's Health Insurance programs. It also permitted doctors and hospitals to bypass certain requirements as they responded to H1N1.", "By way of comparison, Trump declared the coronavirus a public health emergency on Jan. 31, 2020, also prior to any deaths in the United States. One effect was that U.S. citizens who had been in China's Hubei Province, the source of the outbreak, in the previous 14 days were subjected to 14 days of mandatory quarantine if they traveled back to the United States.", "NBC News reported March 3, 2020, that the Federal Emergency Management Agency is planning for the possibility that Trump could make a national emergency declaration to bring in extra funds and personnel to assist the administration's coronavirus response.", "The headline of an article shared on Facebook claimed: \"Obama waited six months to call swine flu an emergency after thousands died.\"", "In October 2009, after more than 1,000 people in the United States had died of swine flu, also known as H1N1, Obama declared a national emergency.", "But six months earlier, his administration declared H1N1 a public health emergency. At that point, no deaths in the United States had occurred.", "We rate the statement False.", "Prntly.com, \"Flashback: Obama waited 6 months to call Swine Flu an emergency after thousands died,\" Feb. 29, 2020", "Snopes, \"Did Obama Declare Swine Flu an Emergency Only After ‘Millions’ Were Infected?\" March 2, 2020", "U.S. Centers for Disease Control and Prevention, \"WHO Pandemic Declaration,\" accessed March 3, 2020", "U.S. Centers for Disease Control and Prevention, \"2009 H1N1 Flu (‘Swine Flu’) and You,\" Feb. 10, 2010", "U.S. Centers for Disease Control and Prevention, \"2009 H1N1 Pandemic,\" June 11, 2019", "CNN, \"Obama declares H1N1 emergency,\" Oct. 26, 2009,", "World Health Organization, \"What is the pandemic (H1N1) 2009 virus?\" Feb. 24, 2010", "PublicHealthEmergency.gov, \"An HHS Retrospective on the 2009 H1N1 Influenza Pandemic to Advance All Hazards Preparedness,\" June 15, 2012", "The White House, \"Declaration Of A National Emergency With Respect To The 2009 H1n1 Influenza Pandemic,\" Oct. 24, 2009", "MedPage Today, \"Obama Declares H1N1 a National Emergency,\" Oct. 24, 2009", "New York Times, \"H1N1 Widespread in 46 States as Vaccines Lag,\" Oct. 24, 2009", "New York Times, \"U.S. Declares Public Health Emergency Over Swine Flu,\" April 26, 2009", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]