["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Less than 24 hours after meeting with German Chancellor Angela Merkel, President Donald Trump took to Twitter to criticize Germany for shirking on its defense payments to the North Atlantic Treaty Organization and the United States.", "\"Despite what you have heard from the FAKE NEWS, I had a GREAT meeting with German Chancellor Angela Merkel,\" Trump wrote in a tweet March 18. \"Nevertheless, Germany owes vast sums of money to NATO & the United States must be paid more for the powerful, and very expensive, defense it provides to Germany!\"", "Despite what you have heard from the FAKE NEWS, I had a GREAT meeting with German Chancellor Angela Merkel. Nevertheless, Germany owes.....", "...vast sums of money to NATO & the United States must be paid more for the powerful, and very expensive, defense it provides to Germany!", "Trump has repeatedly called on NATO countries to contribute more to that military alliance, so we decided to fact-check his claim about Germany.", "What we found is that Trump is misunderstanding how NATO’s joint defense is paid for, and that Germany doesn’t owe anything.", "‘Germany owes vast sums of money to NATO’", "NATO, formally the North Atlantic Treaty Organization, was created in 1949 to provide collective security against the Soviet Union. Currently, 28 countries (including the United States and Germany) are members.", "The members agreed that \"an armed attack against one or more of them … shall be considered an attack against them all\" and that following such an attack, each member would take \"such action as it deems necessary, including the use of armed force.\"", "We never heard back from Trump’s team about what money Germany owes. But Trump likely was alluding to the fact Germany has not yet met the NATO target commitment for overall defense funding.", "As of 2014, NATO’s collective agreement directed members to spend 2 percent of their GDP on defense spending by 2024. According to NATO, only five counties meet that obligation today: the United States, Greece, Estonia, Poland and the United Kingdom.", "As you can see from the graphic above, Germany only pays 1.2 percent of their GDP on defense spending. German leaders have said they intend to boost military spending.", "The problem with Trump’s claim, however, is that Germany doesn’t pay that money to NATO or the United States or any other country, said Daniel Benjamin, a senior fellow at the Brookings Institution.", "\"(Germany) has, like many members, fallen short of its commitments, which is obviously not good,\" Benjamin said. \"But there is no central bank this money goes into, and there is no transaction.\"", "Other experts we consulted agreed.", "The United States decides what level of military spending it wants to have, as do all other NATO  members.", "\"The relatively low levels of military spending among U.S. allies is completely rational,\" said Christopher Preble, the vice president for defense and foreign policy studies at the libertarian-leaning Cato Institute. \"They don't see a pressing need to spend more.\"", "Trump’s argument that the United States needs to be paid more also misrepresents how NATO works, experts told us.", "\"Trump seems to represent the NATO alliance as a licensing deal — one in which countries like Germany pay the United States for its power and influence,\" said Laicie Heeley, a military budget expert at the Stimson Center, a defense policy think tank. \"This is not the case.\"", "The United States does provide an outsized military commitment to NATO, but this is not done as a favor for Europe; it’s done to benefit all countries in the alliance, experts said. And the United States has several high-profile military bases in Germany that are vital, serving as a key launching point for attacks against terrorists in the Middle East.", "Our ruling", "Trump said Germany \"owes vast sums of money to NATO\" and the United States \"must be paid more\" for the defense it provides to Germany.", "NATO members agreed to spend 2 percent of their country’s GDP on defense by 2024. But that’s not in payments to NATO. Each country funds its own defense, while NATO serves as an umbrella organization meant to protect all members.", "Experts say Trump is mistaken.", "We rate this claim False.", "Email, Steven Cheung, White House spokesperson, March 19", "Interview, Jeremy Shapiro, research director for the European Council on Foreign Relations at  Brookings, March 19", "Email interview, Stephen M. Saideman, international relations professor at Carleton University's Norman Paterson School of International Affairs, March 19", "Email interview, Christopher Preble, the vice president for defense and foreign-policy studies at the Cato Institute, March 19", "Email interview, Dartmouth professor Daniel Benjamin, March 19", "Email interview, Laicie Heeley, fellow, Stimson Center, March 19", "PolitiFact Wisconsin, \"Only 3 of NATO's 28 members spend what they promised on defense, Rep. Paul Ryan says,\" June 19, 2016.", "PolitiFact, \"Donald Trump mostly wrong that 'we get practically nothing' from South Korea for U.S. troop presence,\" Jan. 10, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]