["About this rating", "On July 23, 2019, U.S. President Donald Trump delivered a speech at an event hosted by the young conservative group Turning Point USA. As pictures and videos of the speech started to circulate on social media, some keen-eyed observers noticed something appeared to be off with the presidential seal displayed on the wall behind him:", "Are young conservatives trolling Trump or are they just stupid?", "Trump spoke at Turning Point in front of a fake presidential seal featuring the Russian Coat of Arms & golf clubs created to illustrate his love for Putin and the fact he’s spent 30% of his term playing golf#Trimp pic.twitter.com/B7vEunRoC6", "— Bryan Dawson (@BryanDawsonUSA) July 25, 2019", "While the seal in the above-displayed photograph may look official at first glance, it is actually a manipulated version of the official symbol. It features a two-headed eagle similar to Russia's coat of arms instead of the American single-headed bald eagle, golf clubs instead of arrows, and the phrase \"45 es un titere” (which translates to \"45 is a puppet\") instead of the traditional United States motto \"e pluribus unum\" (\"out of many, one\").", "Several photographs of Trump with this fake presidential seal are available via Getty Images. One such photograph (featured above) is captioned:", "\"WASHINGTON, DC - JULY 23: U.S. President Donald Trump applauds in front of a doctored presidential seal with a double headed eagle and a set of golf clubs as he arrives to address the Teen Student Action Summit July 23, 2019 in Washington, DC. Conservative high school students gathered for the 4-day invited-only conference hosted by Turning Point USA to hear from conservative leaders and activists, receive activism and leadership training, and network with other attendees and organizations from across the U.S. (Photo by Alex Wong/Getty Images)", "The fake seal can also be glimpsed in this video of the event from Fox News. Keep an eye on the left of the stage as President Trump enters at the start of the video to see it:", "A spokesperson for Turning Point USA told the Washington Post that the fake presidential seal was a mistake and that it was not the group's intention to insult the president:", "\"I can’t figure out where the breakdown was — but it was a last minute throw-up, and that’s all it was,” he said. “I can’t figure out who did it yet.”", "“I don’t know where they got the image from,” he added.", "He said the team included both Turning Point USA and hotel staff.", "“Somewhere there was a breakdown. I think it was as simple as a rushed move throwing up an image, and it was the wrong one,” the spokesman told the Post. “It was an A/V mistake ... it certainly wasn’t our intention.”", "The fake presidential seal was online long before the 2019 Turning Point USA event, and someone could have searched for the seal and accidentally (or purposefully) downloaded the fake version from a free image site such as Free PNG Library.", "Indeed, the Post later reported that the fake presidential seal had been created and put online years earlier by a \"former Republican fed up with Trump,\" a 46-year-old graphic designer named Charles Leazott:", "[Leazott] threw it together after the 2016 presidential election -- it was one park joke, one part catharsis. He used to be a proud Republican. He voted for George W. Bush. Twice.", "But Donald J. Trump's GOP was no longer his party. So he created a mock presidential seal to prove his point.", "\"I'm a graphic designer, it's just something I tossed together, he said. \"This was just a goofy thing for some people I knew. I had no idea it would blow up like this.\"", "Turning Point USA said the mistaken use of the fake seal was an unintentional \"last-minute oversight,\" although Leazott himself didn't buy that explanation:", "[T]he Turning Point spokesman said the group had identified the staffer responsible for turning Leazott's design into a trending topic. He called the incident a last-minute oversight, the result of a quick online search to find a second high-resolution photo of the presidential seal to place behind Trump. He said the mistake was \"unacceptable.\"", "\"We did let the individual go,\" the spokesman said. \"I don't think it was malicious intent, but nevertheless.\"", "Leazott doesn't buy it. He thinks whoever was responsible had to know exactly what they were looking for. He believes the person dug up the image he created and used it intentionally.", "\"That's a load of crap,\" he said in response to Turning Point's explanation. \"You have to look for this. There's no way this was an accident is all I'm saying.\"", "Here's a side-by-side comparison of the official presidential seal (right) and the fake version (left) displayed behind President Trump during his speech:", "Leazott also expressed that he was pleased with the mix-up, whether it was deliberate or accidental:", "A photo of Trump in front of his seal is now [Leazott's] computer background, and the person who used it at the event is \"either wildly incompetent or the best troll ever -- either way, I love them.\"", "\" ... I've got to be honest, I am so tickled in the most petty way possible that the president of the United States, who I despise, stood up and gave a talk in front of this graphic. Whoever put that up is my absolute hero.\"", "Frazin, Rachel.   \"Turning Point USA Looking Into How Altered Presidential Seal Appeared During Trump Introduction.\"\r\n    The Hill.   25 July 2019.", "Novak, Matt.   \"Trump Stands Next to Photoshopped Presidential Seal That Reads '45 Is a Puppet' in Spanish.\"\r\n    Gizmodo.   25 July 2019.", "Thebault, Reis and Michael Brice-Saddler.   \"Meet the Man Who Created the Fake Presidential Seal -- A Former Republican Fed Up with Trump.\"\r\n    The Washington Post.   25 July 2019.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]