["About this rating", "In early 2019, an Oklahoma lawmaker's two-year-old comments about abortion re-emerged online and prompted skeptical inquiries from our readers.", "On 15 February, the Gaily Grind web site posted an article with the headline \"GOP Lawmaker Who Called Pregnant Women 'Hosts' Pushing Bill Requiring Men to Approve All Abortions,\" which reported that:", "Oklahoma state legislator Rep. Justin Humphrey (R) has sponsored a draconian bill that would require a woman to get the written consent of the fetus’s father before obtaining an abortion. The bill, HB 1441, which passed out of a House committee Tuesday, would also require a woman “to provide, in writing, the identity of the father of the fetus to the physician who is to perform or induce the abortion,” according to the bill’s language.", "“If the person identified as the father of the fetus challenges the fact that he is the father, such individual may demand that a paternity test be performed.” In justifying the bill, Rep. Humphrey told The Intercept that women have no right to their bodies once they become pregnant because they are mere “hosts.”", "The Gaily Grind's 2019 article created the impression that it was describing current events, but in reality Humphrey had made his remarks two years earlier, in February 2017, and they had generated a wave of outrage at the time.", "Humphrey did indeed say that he viewed a woman as a \"host\" for a fetus, although he stipulated that this view was limited to the context of pregnancy and abortion, stating that his more general view of female bodily autonomy was \"your body is your body.\"", "On 6 February 2017, State Representative Justice Humphrey, a Republican who represents the 19th District in southeastern Oklahoma, introduced House Bill 1441, which would have prohibited any abortion that took place without the written informed consent of the fetus' father, except in cases of rape or incest, or the father was deceased, or the woman's life was in danger.", "On 14 February 2017, the State Legislature's Public Health Committee voted in favor of the bill, but it never came before the general assembly and was never passed into law.", "In the landmark 1992 case Planned Parenthood of Southeastern Pennsylvania vs. Casey case, the U.S. Supreme Court ruled as unconstitutional a part of a Pennsylvania state law requiring that a married woman provide her husband with advance notification that she intended to undergo an abortion. As a result, any law requiring a woman to obtain the consent of her sexual partner for an abortion would almost certainly have been overturned in court on the basis that it imposed an \"undue burden\" on a woman's right of access to abortion, as set out in the 1973 U.S. Supreme Court decision in Roe vs. Wade.", "In an interview with the Intercept web site, published on 13 February 2017, Humphrey outlined the rationale behind his proposed legislation:", "At first, Humphrey said that the original intention of the bill was to ensure that fathers are involved in supporting a child from conception. “I was wanting fathers to have to pay child support at the beginning,” he said, but that specific language was excised from the bill.", "Ultimately, he said, his intent was to let men have a say. “I believe one of the breakdowns in our society is that we have excluded the man out of all of these types of decisions,” he said. “I understand that they feel like that is their body,” he said of women. “I feel like it is a separate -- what I call them is, is you’re a ‘host.’ And you know when you enter into a relationship you’re going to be that host and so, you know, if you pre-know that then take all precautions and don’t get pregnant,” he explained. “So that’s where I’m at. I’m like, hey, your body is your body and be responsible with it. But after you’re irresponsible then don’t claim, well, I can just go and do this with another body, when you’re the host and you invited that in.”", "So Humphrey did indeed say that once a woman has become pregnant, in his view she is a \"host\" for the fetus, and that her obligation to the fetus stems from that dynamic. However, he did also indicate that outside the context of pregnancy, his view of a woman's bodily autonomy was \"Hey, your body is your body and be responsible with it.\"", "This nuance was not fully acknowledged in some of the initial reporting on Humphrey's remarks, such as the February 2017 article on the web site of New York magazine's \"The Cut,\" whose headline read: \"Oklahoma Anti-Abortion Lawmaker Says Women Are Merely 'Hosts',\" or an opinion column on the web site Bustle, which read:", "Of all the ridiculous things male politicians have said about abortion policy -- looking at you, Todd \"Legitimate Rape\" Akin -- saying that women's bodies literally aren't theirs is among the worst I've heard. So, too, is the bizarre idea of women as \"hosts,\" the same word you'd use for an organism being victimized by a parasite. Anti-choice politicians are sometimes criticized for allegedly treating women as mere incubators; Humphrey, in that interview, seems to explicitly endorse that train of thought.", "It's true that Humphrey did say he viewed a woman as a \"host\" for a fetus once she has become pregnant, but he did not reduce the entire status of women in society to that of a host, even stipulating that beyond the context of pregnancy, \"your body is your body.\" It is a matter of subjective opinion whether or not one accepts his distinction as being sincere or meaningful, but the fact remains that Humphrey did express such a viewpoint.", "The Gaily Grind.   \"GOP Lawmaker Who Called Pregnant Women 'Hosts' Pushing Bill Requiring Men to Approve All Abortions.\"\r\n    15 February 2019.", "Stone, Michael .  \"Oklahoma Lawmaker: Men Must Approve Abortion; Women Are 'Hosts.'\"\r\n    Patheos.   13 February 2017.", "Parthasarathy, Maya.   \"How to Call Justin Humphrey & Tell Him What You Think About Calling Women 'Hosts.'\"\r\n    Bustle.   14 February 2017.", "Humphrey, Justin.   \"House Bill 1441 -- An Act Relating to Public Health and Safety ...\"\r\n    Oklahoma State Legislature.   6 February 2017.", "U.S. Supreme Court/Oyez.org.   \"Planned Parenthood of Southeastern Pennsylvania vs. Casey.\"\r\n    29 June 1992.", "U.S. Supreme Court/Oyez.org.   \"Roe vs. Wade.\"\r\n    22 January 1973.", "Smith, Jordan.   \"Oklahoma Lawmakers Want Men to Approve All Abortions.\"\r\n    The Intercept.   13 February 2017.", "Ryan, Lisa.   \"Oklahoma Anti-Abortion Lawmaker Says Women Are Merely 'Hosts.'\"\r\n    The Cut/New York Magazine.   13 February 2017.", "Strassner, Elizabeth.   \"The Oklahoma Abortion Bill Proves Why We Desperately Need More Women in Government.\"\r\n    Bustle.   16 February 2017.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]