["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A Feb. 10 Facebook post incorrectly quotes \"Shark Tank\" investor Mark Cuban as saying, “I worry that millions of millennials are voting Democrat this year because they fact-check everything.”", "Fact-checking is driving millions of young people to vote Democratic, so says Shark Tank investor and Dallas Mavericks owner Mark Cuban. Or at least that’s what a Facebook post says.", "Readers shared with us this picture that features Mark Cuban, a self-described libertarian and Sharknado 3 president of the United States, saying, \"I worry that millions of millennials are voting Democrat this year because they fact-check everything and they know Republicans are completely out of touch and are running a campaign of hatred and lies.\"", "We love shoutouts to fact-checking, but this post needs its own facts checked. We can’t find any evidence, anywhere, that Cuban said this or anything like it.", "We scoured the Internet, news archives, Cuban’s blog and social media accounts, but we didn’t find anything that matches the quote paired with this picture.", "We were able to reach Cuban over Twitter, asking him if this is something he ever said. He replied, \"No.\"", "We traced the image to a post on a Facebook page called \"Point Counter Point,\" which bills itself as \"responding to Republican lies.\" We reached out to the page administrator via Facebook message to see how they came up with this quote but have yet to hear back.", "We did find a recent instance in which Cuban discussed why millennials seem to support Democrats, particularly Vermont Sen. Bernie Sanders. In the same post, he criticizes Republicans alongside Democrats.", "Millennials like Sanders because they believe in \"sociocapitalism\" rather than just capitalism, meaning they expect businesses to have some sort of charitable element and inclusive practices, Cuban wrote on his blog, \"Maverick Blog: Mark Cuban’s Weblog,\" on Feb. 8. He’s noticed this trend through his experience listening to business pitches from 20-somethings as an investor on ABC’s Shark Tank.", "\"So how can it be a surprise that millennials are excited about Bernie Sanders?\" he wrote. \"Millennials expect capitalism to reflect a socialist element.\"", "He wrote that no candidate in either party has shown a single instance of leadership; rather, they are too focused on conforming to party principles. They’re all also \"technologically illiterate\" and unprepared to handle the country’s growing technological needs.", "But his post did not reference fact-checking, nor did he say Republicans are \"running a campaign of hatred and lies.\" If we find a verified instance of him saying what the post alleges, we will revisit the fact-check.", "Cuban remains an undecided voter, as far as we can tell. He has said, though, that he wants \"anybody but\" Sen. Ted Cruz, R-Texas, and he thinks fellow billionaire Donald Trump is shaking up politics in a good way because he speaks his mind and doesn’t just play to the base of the Republican Party.", "Cuban has said he shares Republicans’ desire for small government, but disagrees with many of their social positions. Cuban says he voted for President Barack Obama in 2008.", "Our ruling", "A Facebook post quotes Mark Cuban as saying, \"I worry that millions of millennials are voting Democrat this year because they fact-check everything.\"", "There’s no evidence Cuban ever said that. As far as we can tell, it’s a made-up quotation.", "Pants on Fire!", "Editor's note: Shortly after publishing this article, Cuban confirmed that he never said this quote. We've updated the story to include his response.", "Point Counter Point, Facebook post, Feb. 10, 2016", "Blog Maverick, \"Some Thoughts on the Presidential Race and SocioCapitalism,\" Feb. 8, 2016", "Search of Cuban’s Facebook, blog and Twitter, conducted Feb. 12, 2016", "Search of Nexis, conducted Feb. 12, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]