["About this rating", "The origins of this artifact are unknown.", "In November 2020, photographs and videos supposedly showing a monolith that was discovered somewhere in Utah started to circulate on social media:", "While we don't know too much about what this object is or who put it there, this is a genuine image of a surprising discovery. This photograph was taken by the Utah Department of Public Safety Aero Bureau and was posted to their official social media pages on Nov. 20. The bureau explained that they discovered the monolith a few days before while conducting a count of big horn sheep in the area.", "The Bureau wrote on Instagram: \"Counting big horn sheep with DWR this week. During the counts we came across this, in the middle of nowhere, buried deep in the rock. Inquiring minds want to know, what the heck is it? Anyone? ??\"", "In a news release, the organization said that the discovery was made on Nov. 18 somewhere in southeastern Utah. The group did not want to give the exact location of the object, fearing that — since it was in an isolated area — it would lead to visitors who could potentially get lost and stranded.", "The object is made of metal and judging from the photographs it stands over 10 feet tall. While it's unclear who erected this monolith, the government agency noted that it was illegal \"to install structures or art without authorization on federally managed public lands, no matter what planet you’re from.\"", "Here's the full press release and some additional photographs of the monolith:", "On November 18, 2020, the Utah Department of Public Safety Aero Bureau was working with the Utah Division of Wildlife Resources to conduct a count of big horn sheep in a portion of southeastern Utah.", "While on this mission, they spotted an unusual object and landed nearby to investigate further.", "The crew members found a metal monolith installed in the ground in a remote area of red rock.", "The crew said there was no obvious indication of who might have put the monolith there.", "The exact location of the installation is not being disclosed since it is in a very remote area and if individuals were to attempt to visit the area, there is a significant possibility they may become stranded and require rescue.", "It is illegal to install structures or art without authorization on federally managed public lands, no matter what planet you’re from.", "The Bureau of Land Management will be determining if they need to investigate further.", "While we can't say for certain where this monolith comes from, the most likely explanation is that it was some form of art installation. It's possible that it was undertaken in the same spirit as the crop circle hoaxes that popped up around England in the 1970s and convinced a generation of people that aliens were communicating via corn fields.", "A monolith is defined in the dictionary as a \"great stone often in the form of an obelisk or column,\" but this word has become closely associated with alien encounters, thanks in large part to Stanley Kubrick's 1968 film \"2001: A Space Odyssey.\" In fact, the monolith that was discovered in Utah bares a resemblance to the alien monolith depicted in the film:", "It should also be noted that although news of this mysterious monolith went viral in November 2020, imagery from Google Maps indicates that the odd artifact has been in its current location since at least 2015-16.", "Here are a few additional videos of this monolith from the Utah Department of Public Safety:", "https://streamable.com/2xght9", "https://streamable.com/s1wcq8", "https://streamable.com/7o87qz", "Shortly after these images went viral, it was reported that this mysterious monolith had \"disappeared.\" But there was nothing otherworldly about its disappearance. USA Today reported that four humans removed the structure from the area. Monolith mania continued through the end of November as a similar structure was found in Romania.", "As of this writing, the most likely explanation for these monoliths continues to be artists/bored humans.", "Updated [1 December 2020]: Added info about a second monolith found in Romania.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]