["A video of policemen firing shots at a crowd was tweeted by a Twitter user @javaidShaikh with a message, “Warning: Graphic Content PG18+ Kashmiris shot down at point blank range in Indian Occupied Kashmir”. It has garnered more than 500 retweets after being posted on October 27.", "Warning: Graphic Content PG18+ Kashmiris shot down at point blank range in Indian Occupied Kashmir #KashmirBlackDay pic.twitter.com/IAoBhSfmD3", "— جاوید شیخ (@javaidShaikh) October 27, 2018", "Several individual users have also tweeted the same video with similar claims. Amer Khan, a Twitter handle from Pakistan had also tweeted the video saying, “Kashmiris shot down at point blank range, where is Pakistani liberal Mombati Brigade???? Gulalae Brothers????”.", "Khurram N Gandapur, secretary general of the Pakistan Awami Tehreek party had also retweeted the same video.", "The video is familiar. In July this year, it was circulated with a narrative that police was firing shots at farmers protesting for their demands in Mandsaur, Madhya Pradesh. However, Alt News found that it was representative of a mock drill conducted by Jharkhand police on October 31, 2017 in Khunti district.", "Here is a video of the same drill from a different perspective and time-frame, which makes it clear that it was a simulation and NOT an actual incident.", "Recently, a prominent Pakistani journalist Hamid Mir and some news channels in Pakistan had passed off a gruesome video of Pakistani SSG commando training claiming it to be representative of Kashmiris being tortured in India. Now, this is yet another video circulating with a completely false narrative and creating a propaganda vis-a-vis Kashmir in the Pakistani social media ecosystem. Social media users are tempted to share such videos which suit their political biases. It must be reiterated here that videos and images on social media are often contextualized to further a political agenda. Hence, it is incumbent on netizens to cross-check and verify such provocative content on social media.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]