["This image has been shared over 4,800 times since being posted to Facebook on December 17, 2019.", "Below is a screenshot of the misleading Facebook post:", "The Sinhala-language text in the image translates to English as: “Americans don't donate blood for free. The American blood bank pay 30 USD - 50 USD per unit of blood. The American blood bank also does not provide blood to hospitals free of charge. They sell each unit of blood for a price of 180 - 300 USD to each hospital. Even the hospitals sell the blood to needy patients at a very high price. / But Sri Lankans donate blood without any expectation of a payment. / Long queues are formed whenever a blood camp is held to donate blood free of charge, even Lankan hospitals provide blood free of charge. How much greater are we than Americans?\"", "Similar claims were also published here, here, here and here on Facebook.", "The claim is misleading, While the US has not banned paying for blood donations, hospitals choose not to use products from paid donors, according to the FDA, a federal agency responsible for protecting public health and regulating medical and food supplies.", "The FDA began requiring strict labeling for paid blood donations in 1978.", "“All blood and blood components that are intended for transfusion and collected during the donation at which the donor received the monetary payment must be labeled with the 'paid donor' classification statement,” according to the FDA’s policy here.", "The \"paid donor\" label, the FDA adds here, must be in “no less prominence than the proper name” of the blood type or blood byproduct.", "“In practical terms, hospitals choose not to use products that are labeled from a paid donor for liability reasons,” the FDA notes in a separate policy document here.", "According to the Centers for Disease Control and Prevention, authorities began controlling paid blood donations after it was determined that a monetary system increased the spreading of diseases.", "“Recipients of blood from paid donors were at higher risk of developing post-transfusion hepatitis than were recipients of blood from non-paid donors,” the CDC, the US’ health protection agency, stated here.", "The CDC added that the “shift from a paid to a non-paid blood donor base substantially reduced” the incidences of post-transfusion disease.", "Multiple nonprofit health organisations also note that blood donors are not paid in the US.", "The American Association of Blood Banks (AABB), a group that has developed standards concerning blood collection in the US, states on its website that “blood collected for transfusion in the US is collected from volunteer blood donors.”", "Below is a screenshot of the AABB’s website’s Blood Donation FAQ page. AFP has highlighted the relevant portion in red:", "The American Cancer Society (ACS) also asserts that “blood from paid donors cannot be used in the United States for transfusion purposes.”", "Below is a screenshot of the ACS website:", "The effort to eliminate paid blood donations is a global movement. In 2010, the World Health Organization and the International Federation of Red Cross and Red Crescent Societies announced a global framework aimed at achieving 100 percent voluntary blood donations worldwide.", "“The donation of blood by voluntary non-remunerated blood donors is recognized as being crucial for the safety and sustainability of national blood supplies,” the organisations noted in their 2010 report.", "The report adds that paid blood donations pose “serious threats to the health and safety of the recipients” and that “paid donors are vulnerable to exploitation and commercialization of the human body as they usually come from the poorer sectors of society and become paid blood donors due to economic difficulties.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]