["President Donald Trump speaks during a news conference at the Trump National Golf Club in Bedminster, N.J., Saturday, Aug. 8, 2020. (AP Photo)", "President Donald Trump criticized Democrats at a press briefing at his golf club in Bedminster, N.J., where he signed four executive actions on evictions, payroll taxes, unemployment benefits and student loans.", "Trump’s executive order on evictions tells federal agencies to consider ways to try to assist renters and homeowners faced with the threat of eviction amid the COVID-19 pandemic.", "\"The Democrats don’t want to do anything having to do with protecting people from eviction,\" Trump said at the briefing.", "He doubled down on that claim at an Aug. 11 press conference, but it’s false. Congressional Democrats have proposed and supported legislation to temporarily ban evictions and help residents pay rent.", "The CARES Act, a bipartisan coronavirus relief law passed in March, banned evictions for certain renters, including those in federal housing assistance programs.", "In May, the House passed the HEROES Act, a $3.4 trillion coronavirus relief package introduced by Democratic Rep. Nita Lowey of New York, which would extend the ban on evictions for renters and provide people with rent assistance.", "White House Deputy Press Secretary Sarah Matthews told PolitiFact in an email that the bill was \"unserious,\" in part because it includes a portion that would provide cannabis businesses with banking access.", "\"If Democrats were serious about providing relief for the American people, then they shouldn’t have rejected the multiple clean bills put forward by Republicans,\" Matthews said.", "Meanwhile, Democrats are critical of the HEALS Act, a $1.1 trillion Republican-backed coronavirus relief package that doesn’t include an eviction moratorium.", "In addition to protecting renters in federal housing assistance programs from evictions, the over $2 trillion CARES Act also protects those in properties with federally backed mortgages.", "The economic stimulus law was introduced by Rep. Joe Courtney, D-Conn., in January and passed in the House and Senate with widespread bipartisan support.", "The Federal Reserve Bank of Atlanta estimates that the CARES Act’s eviction provisions covered between 28% and 46% of rental units in the country. That’s up to 20 million units, but the law’s four-month eviction ban expired in late July, and Trump’s executive order did not extend it.", "Over 200 congressional Democrats voted to support the HEROES Act, which would extend the eviction moratorium for up to a year and expand it to protect homeowners. The bill would also allocate $100 billion to provide residents with emergency rental assistance.", "\"Being able to give money to people to pay their rent then also helps landlords be able to afford the mortgage on the property, the utilities, taxes, all of the things that it takes to maintain a property,\" said Peggy Bailey, vice president for housing policy at the Center on Budget and Policy Priorities, a liberal think tank.", "The HEROES Act, which has not been voted on in the Senate, passed in the House along party lines, with 184 Republicans opposing the bill.", "Trump said, \"The Democrats don’t want to do anything having to do with protecting people from eviction.\"", "Congressional Democrats passed and supported bills that set out to protect people from evictions, including through an eviction moratorium and rental assistance.", "We rate Trump’s claim False.", "Rev, Donald Trump Press Conference Transcript August 8, Aug. 8, 2020", "PolitiFact, Donald Trump’s executive order on evictions, explained, Aug. 11, 2020", "Email interview with Sarah Matthews, White House deputy press secretary, Aug. 12, 2020", "Committee for a Responsible Federal Budget, What’s in the $3 Trillion HEROES Act?, May 27, 2020", "Center on Budget and Policy Priorities, Extend CARES Act Eviction Moratorium, Combine With Rental Assistance to Promote Housing Stability, July 27, 2020", "Forbes, As The Eviction Moratorium Ends, Here Are The Bills In Congress For More Rent Relief, July 25, 2020", "Phone interview with Peggy Bailey, vice president for housing policy at the Center on Budget and Policy Priorities, Aug. 12, 2020", "Federal Reserve Bank of Atlanta, Housing Policy Impact: Federal Eviction Protection Coverage and the Need for Better Data, accessed Aug. 12, 2020", "The White House, Executive Order on Fighting the Spread of COVID-19 by Providing Assistance to Renters and Homeowners, Aug. 8, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]