["About this rating", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "In mid-March 2020, social media users posted a message cautioning that scammers were victimizing elderly people amid the COVID-19 pandemic by impersonating Red Cross volunteers:", "A variation of this meme contained a similar warning, along with an image of people clad in white biohazard suits. (We cropped the image out for the sake of privacy.)", "This is indeed a scam. Red Cross chapters have warned of criminals exploiting the coronavirus disease in various ways, which has sickened and killed thousands globally and isolated people in their homes worldwide. In a statement emailed to Snopes, a Red Cross spokesperson said:", "The American Red Cross has seen widespread reports of this scam across the United States, along with other countries, on social media platforms.", "We would like to emphasize that this rumor is not true. The Red Cross is not going to people's homes to offer coronavirus tests. If someone comes to your house claiming that they work for the Red Cross and that they're authorized to do coronavirus testing, do not allow them in your home. Our most important guidance is for people to please be safe. Should such an incident occur, we ask that you call the police as soon as possible.", "The Oklahoma chapter, for example, advised the public to be wary of scammers impersonating Red Cross volunteers offering coronavirus testing door-to-door:", "A similar warning was issued by the British Red Cross Northwest Branch. \"We would like to make it clear that the Red Cross is not conducting coronavirus tests in Northern Ireland or anywhere else in the UK,\" the statement said.", "Likewise, the Canadian Red Cross issued an alert that scammers impersonating the organization were exploiting the pandemic by sending out text messages offering to sell or give away protective masks.\n\nUnfortunately, scams like these are not new. In a rather cruel variation of this scam during the coronavirus pandemic, a message posted to social media falsely claimed that if you lacked health insurance to pay for a coronavirus diagnostic test, you could donate blood as an alternative because donors must have a blood test.", "The U.S. government has since taken steps to roll out widespread testing for the coronavirus disease at no cost to patients.", "Updated with statement from Red Cross and variation of the meme.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]