["The photo was published here on Facebook on March 13, 2020. It has been shared more than 540 times.", "The post’s Thai-language caption translates to English as: “Spanish flu (spread in 1918-1920) is one of the worst and serious outbreaks in human history. There were 500 million people infected or around 27% of the whole global population which was around 1.9 billion people).", "“This disease was so serious that it killed 17-100 million people, but because this disease happened at the same time as World War I which had a lot of deaths, injuries and starvations so this disease was hidden by that.”", "“Spanish flu” or the 1918 H1N1 flu pandemic occurred in 1918. It killed an estimated 50 million people worldwide, according to this summary by the US Centers for Disease Control and Prevention.", "The photo was also shared here, here on Facebook and here, here on Twitter alongside a similar claim.", "The claim is misleading.", "A reverse image search on TinEye found the same photo published on this Alamy stock photo website about ladies’ fashion in 1913.", "The German-language text written on the bottom of the photo translates to English as: “A new veil fashion. The war in the Balkans has created a new, peculiar fashion. Ladies are nowadays wearing the nose veil that has been used in Turkey for centuries.”", "The Balkan Wars took place between 1912 and 1913.", "Below is a screenshot of the photo in the misleading post (L) and the photo in Alamy Stock photo (R):", "Alamy credited Süddeutsche Zeitung Photo, a Munich-based photo agency as the photo’s contributor.", "In an email to AFP dated June 15, 2020, Süddeutsche Zeitung’s spokesman Sven Riepe said the image dates back to 1913.", "“The original picture description says that the nose veils were the fashion for ladies after the Balkan war,” he said.", "Below is a screenshot of the original photo on Süddeutsche Zeitung’s website:", "Fake History Hunter, a history fact-checker, also debunked the misleading posts in a tweet here.", "The photo was previously used in misleading posts about a purported 19th-century poem regarding self-isolation. AFP Australia debunked the posts here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]