["The photo -- published here on Facebook on September 4, 2019 -- shows dead calves lying in a clearing as a group of people look on. Their faces are blurred.", "The post has been shared on Facebook more than 2,400 times.", "The post's caption says: \"Brutal Ranil's work\".", "Ranil Wickremesinghe is the current prime minister of Sri Lanka.", "Below is a screenshot of the Facebook post:", "The Sinhala-language text across the bottom of the image translates into English as:", "“Mass animal slaughter to feed the Bohra Muslims. Oh the fate that has befallen this Holy Land graced by Buddha\"", "Bohras are a Muslim sect that number around a million people worldwide, including a small community in Sri Lanka.", "Similar claims have been made using the same image for example here on Facebook as well as in an English-language newspaper and a Sinhala-language news website.", "These claims surfaced on Facebook just days after tens of thousands of Bohra Muslims arrived in Colombo to attend the annual Bohra conference -- held between the 1st and 10th of September this year, according to an AFP report.", "A Google reverse image search of the photograph used in the post returned this article published on July 11, 2009 published in the local paper Dinamina.", "Below is a screenshot of the article:", "The newspaper article headline in Sinhala translates to English as:", "“39 calves beaten to death using poles and clubs”", "The article says the calves were found dead in a cowshed located close to the Tabbowa Wewa reservoir located in North Western Sri Lanka.", "Below is a screenshot comparison of the image in the misleading post (L) and the image published in the 2009 article (R):", "Here is the short article translated in full:", "“The Karuwalagaswewa Police states that some 39 calves have been found beaten to death using poles and clubs in a cowshed located near the Thabbowa wewa in Karuwalagaswewa, Puttlam.", "\"The calves were killed on the night of the ninth and every calf was under one year old.", "\"The Police state the man who committed the act has fled the area and that it happened as a result of a personal conflict.”", "Karuwalagaswewa is a village located in North Western Sri Lanka.", "Colombo Municipal Council, Chief Municipal Veterinary Surgeon, Dr. I V P Dharmawardane told AFP by phone that no mass killing of animals took place in the days leading up to or during the Bohra conference.", "“There is absolutely no truth to these claims. As per statutory by-laws, cattle cannot be slaughtered anywhere but the Municipal slaughterhouse. Permits are granted to slaughter animals in private premises but meat procured by such means is allowed only for private consumption.", "“There has not been any increase in the number of permits sought to slaughter animals in private premises and neither has the municipal abattoir slaughtered more cattle than usual in the past few weeks or at present,” he told AFP.", "The Butchers Ordinance Chapter 1, Section 14 refers to where and when animals must be slaughtered -- either at “a place appointed by the proper authority; or any public slaughterhouse”.", "Below is a screenshot of Ch: 1 Sec 14 of the Butchers Ordinance:", "The Colombo Dawoodi Bohra community told AFP no cows were slaughtered and no meat had been illegally transported during the Dawodi Bohra convention of Ashara Mubaraka.", "“The organizers have received all necessary approvals from the Government regarding the slaughter of animals and is using a Government slaughterhouse for procurements of meat. The transport of meat is carried out as per the Government regulations,” they said by email on September 5, 2019.", "UPDATE: this story was updated 13/09/2019 to correct spelling of newspaper name para 12.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]