["About this rating", "The disreputable web site YourNewsWire.com published yet another fake news article on 8 October 2017, this time claiming that a democratic principal in Springfield, Ohio, had been arrested after defecating on his desk during the Pledge of Allegiance:", "An intoxicated school principal at a Springfield, Ohio middle school was arrested Friday morning after defecating in front of hundreds of students during the pledge of allegiance.", "Andrew Whitmore, 53, was “visibly under the influence of alcohol,” according to witnesses, when he decided to take down his pants and defecate on the schoolyard in front of disturbed students and teachers.", "Mr. Whitmore, a registered Democrat, also embarrassed himself further when he lost his balance and “fell to the ground into his own pile of feces” before passing out. He was eventually carried away by local police officers.", "There is no truth to this article.", "This story is a near-verbatim copy of a fake news article that appeared on WorldNewsDailyReport.com, a well-known purveyor of misinformation, in September 2017. The one notable change Your News Wire made to this work of fiction was the addition of the \"Democrat\" detail. Here's a look at how this fake news story originally appeared on WNDR (left) and how it was altered by Your News Wire (right):", "Regardless of political affiliation, this story simply isn't true. Although Your News Wire has a long history of publishing misinformation, they do not carry a readily available disclaimer labeling their content as fiction. But World News Daily Report, where this story originated, does:", "World News Daily Report assumes all responsibility for the satirical nature of its articles and for the fictional nature of their content. All characters appearing in the articles in this website – even those based on real people – are entirely fictional and any resemblance between them and any person, living, dead or undead, is purely a miracle.", "The featured photograph for this false story actually shows Michael Lacey, one of the owners of Backpage.com, who faced charges of trafficking prostitutes and pimping in October 2016:", "This undated photo provided by the Sacramento County Sheriff’s office shows Michael Lacey. Lacey and two other operators of an international website, Backpage.com, that advertises escort services, said in court in Sacramento, Calif., Wednesday, Oct. 12, 2016, that they will challenge charges of trafficking prostitutes and pimping on First Amendment grounds.", "Thompson, Don.   \"Operators of Website Appear in Court on Pimping Charges.\"\r\n    Associated Press.   13 October 2016.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]