["Bill Clinton discussed his family's finances with Cynthia McFadden of NBC News.", "Former President Bill Clinton is back to making claims about his family’s humble financial roots.", "A year ago, he was defending Hillary Clinton for claiming that they left left the White House \"not only dead broke, but in debt\" (which rates Mostly False).", "\"I had the lowest net worth of any American president in the 20th century when I took office,\" Clinton said then (Half True).", "This time, it’s amid scrutiny of all those lucrative speeches and foreign government donations to his family foundation.", "\"I'm grateful for our success,\" Clinton told NBC News’ Cynthia McFadden in an interview that aired May 4. \"But let me remind you. When we moved into the White House, we had the lowest net worth of any family since Harry Truman.\"", "So, did Bill do better by isolating on presidents since Harry Truman?", "The answer is yes.", "A humble haberdasher, Harry S. Truman", "Detailed financial disclosures were not required for presidents through the 1970s, so we’re left to rely on other resources to get a picture of a commander-in-chief’s financial assets, said Paul Brace, a professor of political science at Rice University.", "Still, we do know a lot about their lives. Let’s start with Truman since he’s critical.", "Truman and his wife Bess were not homeowners when he became president. They rented a Washington apartment, and Bess’ mother, who owned the Independence, Mo., home associated with Harry Truman, shared a room with their daughter Margaret, said Alonzo Hamby, a Truman biographer and Ohio University emeritus professor of history.", "Truman’s journey to public office followed bankruptcy-dodging and a failed haberdashery business in the 1920s. He worked his way up from county judge to a U.S. senator, vice president and president upon Franklin D. Roosevelt’s death in 1945. Even when he was earning $10,000 as a senator in 1935 ($171,000 in 2015 dollars), he could not save the family farm his mother owned.", "It was Truman’s post-White House flirtation with bankruptcy that inspired Congress to pass presidential pensions, said Aaron Crawford, a post-doctoral student at Southern Methodist University.", "Experts can’t pinpoint his net worth to a specific dollar figure, but all the evidence points to the number being quite low. Joseph J. Thorndike, director of the Tax History Project at Tax Analysts, explored Truman’s financial highs and lows using tax returns released by his presidential library.", "The man from Hope, and his pre-White House wallet", "The Clintons are certainly unique compared to other first families in modern history for a couple big reasons: They did not inherit sizable family estates, and Hillary Clinton was the family breadwinner as Bill worked as a career politician.", "Before running for the White House in 1992, Clinton brought in $35,000 a year as Arkansas governor, plus some speaking fees, honorariums and in-kind income, such as living in the governor’s residence. Hillary was a senior partner in the Rose Law Firm of Little Rock at the time, earned $92,000 salary and listed her share of her law firm’s profit-sharing and retirement plan between $100,001 and $250,000, according to a New York Times examination of the couple’s finances in 1992.", "The Clintons listed their net worth as nearly $700,000 in a 1992 statement, a substantial hike from the $418,692 net worth reported at the end of the 1989, according to the Washington Post.", "Lest you worry about the financial wealth of the Clintons, the family was still well off by most any standard. The median household net worth for Americans in 2013 was $81,200 (see page 12), according to the Federal Reserve.", "Other presidents since Truman", "The experts we contacted didn’t rattle off hard numbers as they dissected various presidents’ pre-office net worth. Instead, they ruled out the obviously wealthy presidents based on their jobs and family situations. (Truman biographer Hamby used the phrases, \"JFK of course was quite rich,\" \"Reagan was at least quite affluent,\" and \"George H.W. Bush was at least wealthy if not filthy rich.\")", "Eliminating the obvious, experts focused on who might present Clinton with a realistic challenge.", "Richard Nixon? He had a pretty lucrative law practice in New York. Lyndon B. Johnson? Journalists and historians disagree on exactly how he built his wealth, experts said, but he at least married a wealthy woman whose father owned Texas radio stations.", "Dwight D. Eisenhower? Nah, they said, as he was doing well for himself after World War II, landing on corporate boards and enjoying a good military pension and sales of his memoir, Crusade in Europe. \"You save the world, you get good royalties,\" said Jeffrey Engel, director of the Center for Presidential History at Southern Methodist University.", "Most encouraged us to give presidents Jimmy Carter and Gerald Ford a closer look.", "Carter had earned a good living as the owner of a peanut warehouse business in Georgia before running for the state Senate in 1962, said Scott Kaufman, a scholar of Ford and Carter at Francis Marion University.", "In 1979’s Jimmy Carter: A Character Portrait, authors Bruce Mazlish and Edwin Diamond wrote that Carter’s fortune was $814,000 when he became president, Kaufman said. That bests Clinton, without even having to break out the inflation calculator.", "A separate source — a 1976 Washington Post article sent over by the Hillary Clinton campaign — showed Carter had a net worth (when valuing assets at their original cost) of $512,000, which translates to $1.3 million in 1992 dollars, according to 1975 tax returns he released during his campaign against Ford.", "A document from the Gerald R. Ford presidential library suggests Ford had a more modest net worth compared to other presidents. The document, dated Oct. 29, 1973, (the year before Ford became president), showed a net worth of $256,378, which had the same buying power as about $810,000 in 1992. That’s more than the Clintons, though not by much.", "Ford’s finances and dealings were part of the most intense background checks for anyone ever screened for the vice presidency, Kaufman said, coming off the resignation of Nixon vice president Spiro Agnew earlier that month and amid looming worries about legal implications for Nixon in the Watergate scandal.", "\"They didn’t want to appoint someone who might also have problems,\" Kaufman said.", "Our ruling", "Bill Clinton urged Americans to remember the Clintons’ more modest beginnings with his family’s fattened finances in the limelight, saying, \"When we moved into the White House, we had the lowest net worth of any family since Harry Truman.\"", "You can decide whether his point is relevant, but Clinton has improved the accuracy of his factoid since making a similar claim last year.", "We could not find evidence of a president after Truman whose inflation-adjusted net worth was smaller than the Clintons’.", "We rate his claim True.", "Interview with Paul Brace, Rice University political science professor, May 4, 2015", "Email interview with Alonzo Hamby, Ohio University distinguished professor emeritus of history, May 4, 2015", "Interview with Jeffrey Engel, director of the Center for Presidential History at Southern Methodist University, May 4, 2015", "Interview with Scott Kaufman, Francis Marion University political science professor, May 4, 2015", "Email interview with Josh Schwerin, Hillary Clinton campaign spokesman, May 4, 2015", "PunditFact, \"Bill Clinton: 'I had the lowest net worth of any American president in the 20th century',\" June 28, 2014", "NBC News, \"Bill Clinton defends his foundation’s foreign money,\" May 4, 2015", "The New York Times, \"THE 1992 CAMPAIGN: Personal Finances; Wealthy Investment Family a Big Help to Clinton,\" May 2, 1992", "Washington Post, \"Clintons' Net Worth Climbs to $ 700,000; Two Years Ago, They Listed $418,692,\" May 28, 1992  (accessed via Nexis)", "Washington Post The Fix blogpost, \"‘Dead broke’: A deep dive into the Clinton’s finances,\" June 12, 2014", "Washington Post, \"How the Clintons went from ‘dead broke’ to rich: Bill earned $104.9 million for speeches,\" June 26, 2014", "CPI inflation calculator", "Excerpts from Truman by historian David McCullough, via Google Books", "Senate Historical Archive, Senate salaries since 1789", "Gerald Ford library, tax returns and disclosures", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]