["Bihar police is investigating the death of Bollywood actor Sushant Singh Rajput. But the case is also undergoing media trials and overzealous social media vigilance.", "The Indian Express reported that on July 25 Rajput’s father KK Singh filed an FIR at Patna’s Rajiv Nagar police station. Singh accused Sushant Singh Rajput’s ex-girlfriend Rhea Chakraborty and five others of abetment of suicide, criminal intimidation, and criminal conspiracy. On August 6, The Economic Times reported that a four-member Bihar police team left Mumbai after arriving in the city on July 28 for investigating the case. Patna City SP (Central) Vinay Tiwari arrived in Mumbai on August 2. However, he was quarantined by the Brihanmumbai Municipal Corporation (BMC) at the SRPF guest house in suburban Goregaon.", "Around August 9, several social media users tweeted that Tiwari was deputed by the Central Bureau of Investigation (CBI) after his “forced quarantine” by the BMC. Twitter user @rvaidya2000 tweeted, “Master Stroke by Amit Shah..! Vinay Tiwari sent to CBI on deputation. Yes, that Bihar SP who was by force quarantined by Thackrey’s BMC.:)) RT.” This tweet gained around 3,000 tweets. (archive)", "Master Stroke by Amit Shah..!😳 Vinay Tiwari sent to CBI on deputation. Yes, that Bihar SP who was by force quarantined by Thackrey’s BMC.:)) RT", "— RVAIDYA2000 (@rvaidya2000) August 9, 2020", "Similarly, several other Twitter users posted the same claim including — Gaurav Pradhan, editor-in-chief of Gulf Connoisseur Meena Das Narayan, @Shilpi_Flyhigh, @arnab5222, @ThePushpendra_, and @vibhor_anand.", "This slideshow requires JavaScript.", "This claim was also published in a report by the news website Kalinga TV. (archived link)", "Alt News spoke with Tiwari who refuted social media claims regarding his appointment by the CBI. “I am aware that several social media accounts have posted this rumour. I categorically refute these claims,” he said.", "On August 10 Tiwari tweeted in Hindi, “Since yesterday, certain news is circulating. It is totally false, misleading, and a rumour. Kindly pay no attention to it. (कुछ खबरें कल से प्रसारित हो रहीं हैं। वो पूर्णतः गलत, भ्रामक और अफवाह हैं। कृपया उन पर ध्यान ना दें।).", "कुछ खबरें कल से प्रसारित हो रहीं हैं।", "वो पूर्णतः गलत, भ्रामक और अफवाह हैं।", "कृपया उन पर ध्यान ना दें।", "— Vinay Om Tiwari (IPS)/विनय ॐ तिवारी (@IPSVinayTiwari) August 10, 2020", "Thus, social media claims that Panta SP Vinay Tiwari, who is investigating Sushant Singh Rajput’s death, was deputed by CBI is false.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]