["About this rating", "A set of images purportedly comparing the female Defense Ministers of Norway, Sweden, Netherlands, and Germany with the male Defense Minister of Russia is frequently circulated online along with disparaging and sexist remarks implying that women are somehow less capable of holding this government/military position than men are:", "Both the logic behind this argument and the images themselves are outdated.", "The photograph showing the four female defense ministers was taken in 2014 at an annual security conference in Munich, Germany, and captured Ministers of Defense Eriksen Søreide (Norway), Karin Enström (Sweden), Jeanine Hennis-Plasschaert (Netherlands), and Ursula von der Leyen.", "The photograph was originally posted on Twitter by Hennis-Plasschaert:", "#MSC50 \"onderonsje\" MinDefs resp #Norway #Sweden #Netherlands #Germany pic.twitter.com/fNFV0Z61fM", "— Jeanine Hennis (@JeanineHennis) February 1, 2014", "The story behind the taking of the photograph was chronicled by The Guardian:", "It happened at around 3pm on Saturday, in one of the conference rooms at Munich's Bayerischer Hof hotel, where politicians from around the world had gathered for an annual security conference. The female defence ministers of Norway, Sweden and the Netherlands had all met at previous conferences, so they decided to welcome Ursula von der Leyen, their new German counterpart.", "When Belgium's (male) defence minister, Pieter De Crem, spotted the group of women, he quipped: \"Oh, I'll better get out of the picture.\" That's when the Dutch defence minister, Jeanine Hennis-Plasschaert, asked someone to capture the scene on her phone.", "Hennis-Plasschaert told the Guardian: \"[The Dutch politician] Neelie Kroes once said to me that old boys' networks are the oldest form of cartels we have in Europe. She was right, but things are changing, and women can do similar things now.\"", "Although Ine Eriksen Søreide (Norway), Karin Enström (Sweden), Jeanine Hennis-Plasschaert (Netherlands) and Ursula von der Leyen (Germany) were all the Ministers of Defense of their respective countries in 2014, that is no longer the case.", "As of this writing, only Ursula von der Leyen still holds such a position. The Netherlands still has a female minister of defense (Ank Bijleveld), but men have since been appointed to those positions in Sweden and Norway (Peter Hultqvist and Frank Bakke-Jensen respectively).", "The man in this meme is indeed the Russian minister of defense. Sergey Shoigu was first appointed to the job in 2012 and is still in his position as of this writing. The photograph of Shoigu was taken in December 2013 at a military funeral for Mikhail Kalashnikov, the man who designed the AK-47:", "MYTISHCHI, RUSSIA - DECEMBER 27: Russian Defence Minister Sergey Shoigu attends the funeral ceremony for Mikhail Kalashnikov at the Federal Military Memorial Cemetery December 27, 2013 in Mytishchi near Moscow, Russia. Kalashnokov, the designer of legendary AK-47 assault rifle, died at the age of 94.", "Norway, Sweden, the Netherlands, and Germany are hardly the only countries who have had women serve in defense ministry positions. A recent paper by Tiffany Barnes, an assistant professor at the University of Kentucky, and Diana O'Brien, an associate professor at Texas A&M, found that found that \"by 2012, women had been appointed to the ministry of defense in 41 countries.\"", "Barmes, Tiffany.   \"Defending the Realm: The Appointment of Female Defense Ministers Worldwide.\"\r\n    Retrieved 24 July 2018.", "Reuters.   \"Dutch Defense Minister Resigns Over Peacekeepers' Deaths in Mali.\"\r\n    3 October 2017.", "The Local.   \"Sweden Unveils New Defence Minister.\"\r\n    18 April 2012.", "The Local.   Sweden Unveils New Defence minister.\"\r\n    12 April 2012.", "Sauer, Natalie.   \"Norway Names First Woman Foreign Minister.\"\r\n    Politico EU.   20 October 2017.", "Oltermann, Philip.   \"Ursula Von Der Leyen Appointed as Germany's First Female Defence Minister.\"\r\n    The Guardian.   15 December 2013.", "RT.   \"Putin Sacks Defense Minister Amid Embezzlement Probe, Replaces with Ex-Emergencies Minister Shoigu.\"\r\n    6 November 2012.", "Oltermann, Philip.   \"Female Defence Ministers Pledge to Break Europe's Old Boys' Network.\"\r\n    The Guardian.   2 February 2014.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]