["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A fake news story claiming actor Denzel Washington supports President-elect Donald Trump is making its rounds on social media.", "The fake news story resurfaced after American News shared a post on Facebook with the headline, \"Denzel Washington Backs Trump in the Most Epic Way.\" When we looked, the BBC reported the post had been shared 22,000 times.", "The post has been removed since then, but other bloggers have reported similar stories, including American News24 and AmericanPoliticNews, that live on.", "Each story lures in readers with flashy headlines claiming the Hollywood star has thrown his support behind Trump, and spoken out against Obama.", "\"Denzel Washington Switches to Trump Shocks Hollywood, Speaks Out Against Obama,\" reads the headlines from American News 24 and AmericanPoliticNews.", "And each story is very, very wrong.", "The stories claimed Washington praised Trump, saying: \"We need more and more jobs. Unemployment is way up here. He’s hired more employees, more people, than anyone I know in the world.\"", "Washington never said this.", "The quote actually comes from a March 5 New York Post article where Charles Evers, the brother of late civil rights activist Medgar Evers, discusses his endorsement of Trump.", "Furthermore, Washington’s spokesman told the BBC that the story was completed fabricated.", "Our ruling", "AmericanPoliticNews wrote a story claiming that Denzel Washington has thrown his support behind Trump, with the headline, \"Denzel Washington Switches to Trump Shocks Hollywood, Speaks Out Against Obama.\"", "The story is completely fabricated and uses a quote from another story and attributes it to Washington. Pants on Fire!", "https://www.sharethefacts.co/share/d8025533-b897-4a23-910d-81d72aa711e5", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]