["About this rating", "On 15 April 2019, the historic Cathedral of Notre Dame in Paris suffered a catastrophic fire that destroyed most of the structure’s wooden-framed roof and spire. In the days that followed, a feel-good story about a forest of oak trees grown at Versailles for the express purpose of repairing or replacing the wooden spire took off on social media. “These are the Versailles Trees” state several posts with pictures of tall trees, “They are ready.” The claim appears to have its origins in a thinly sourced Twitter thread authored by a user named @_theek_, who tweeted this narrative on the day of the fire:", "The fire department in Paris followed a protocol: Save the people, save the art, save the altar, save what furniture you can, then focus on the structure, in that order. They know what can be rebuilt and what can't.", "This protocol has been in place since the last time the cathedral was destroyed, sacked during the French revolution.", "The steeple and the beams supporting it are 160 years old, and oaks for new beams awaits at Versailles, the grown replacements for oaks cut to rebuild after the revolution.", "This is The Long Now in action. Its what happens when you maintain civilization.", "When asked by other Twitter users for the source of this information, he said, “It was a lecture I attended at Versailles on disaster recovery and long term planning. Once per century events have to be planned for in a city where structures are a thousand years old.” Officials at Versailles, however, told Times of London religious affairs reporter Kaya Burgess that there was no basis in fact for this claim:", "The claim, despite its categorical rejection by multiple officials at Versailles, appears to have gained further exposure from a British parody account named “General Boles,” which tweeted a picture of palm trees in Sri Lanka with a claim that mimicked the original:", "The claim even made it into a 17 April 2019 story on Forbes.com about potential ways to rebuild the Notre Dame roof:", "In the aftermath of the French Revolution, Notre Dame was damaged and used as storage buildings for some years. After the French Revolution, it took almost sixty years to rebuild the cathedral. At the time the wooden beams supporting the roof were replaced and in wise foresight, new oak trees were planted near Versailles, outside the city of Paris. The now 200-year-old trees, still there, could be used to rebuild the roof.", "The supporting link for this claim is an Imgur post that used as its source the same @_theek_ Twitter thread that appears to have started this rumor in the first place. Though no evidence exists that trees were planted 160 years ago at Versailles for Notre Dame repairs, there are elements of fact within the claim. For example, the Cathedral did fall into disrepair during the French Revolution and was in some cases desecrated by rioters, as reported by the BBC:", "The Church, loathed by many as the ally of the Ancien Regime, was taken over by the state. Church bells were removed across the country. In 1791, those of Notre-Dame were crushed and melted down. In 1793, the 28 statues of kings that stand above the front portals of Notre-Dame were decapitated by rioters. [...] When it turned out that the worship of liberty, equality and fraternity did not fill pews, the cathedral was turned into a warehouse for storing food.", "A spire built in the 13th century was removed during this period of history as well, and it was not replaced until several decades later. The spire was, indeed, completed roughly 160 years ago, which is consistent with the viral claim. Between 1844 and 1864, following a revival of interest in the building thanks to Victor Hugo’s 1831 novel The Hunchback of Notre Dame, a massive renovation project included the spire that was burned in 2019:", "By portraying the building as a character, Hugo literally brought it back to life. A nationwide campaign led to a massive renovation project. The work, between 1844 and 1864, returned the cathedral to its former glory — and more. Lead architect Eugène Viollet-le-Duc used traditional building methods to secure the buttresses and put up a new spire, the one destroyed by fire this week.", "However, because we can find no independent verification for the claim that trees were planted at Versailles in conjunction with this renovation project, and because officials at Versailles deny that it has any basis in fact, we rank this claim false.", "Bressan, David.   “How Notre Dame Can Be Rebuilt.”\r\n    Forbes.com.   17 April 2019.", "Hester, Jessica Leigh.   “Medieval Cathedral Spires Have Been at Risk from the Get Go for Centuries, They’ve Been Toppled by Lightning, Wind, and More.”\r\n    Atlas Obscura.   19 April 2019.", "Astier, Henri.   “Notre-Dame Fire: Eight Centuries of Turbulent History.”\r\n    BBC News.   20 April 2019.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]