["About this rating", "As many across the United States and the world watched a pro-Trump mob disputing the results of the 2020 presidential election bring violence and chaos to the U.S. Capitol, eagle-eyed viewers noticed something different amongst the American flags, Trump flags, and “Stop the Steal” signs in the crowd. Someone was waving the tricolor Indian flag in the middle of the growing mob outside the Capitol.", "A number of Indian American men were present at the riots, and the Indian flag was spotted in various photographs and video that emerged from that day. In one video shared by WTOP editor Alejandro Alvarez, the flag is clearly visible on the bottom left corner:", "One of the Indian American men, Vincent Xavier Palathingal, a member of the Republican Party, came forward as “the man with the flag.” He expressed his “utmost contempt” towards the “perpetrators of [the] violence” that day.", "He also posted a video from the rally, which included another shot of an Indian flag, which Indian fact-checkers said he later deleted:", "In an interview with Indian television channel NDTV, Palathingal said, “You cannot brand this beautiful nice patriotic rally as [...] bad.” He falsely claimed that some “miscreants” were planted by the “opposition, by the antifa or [Black Lives Matter] people.” Snopes has already disproved this claim.", "Given that the flag was visible in videos at the riots, and one of the men behind it came forward, we rate this claim as “True.”", "Nur Nasreen Ibrahim is a reporter with experience working in television, international news coverage, fact checking, and creative writing.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]