["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A statue of a chef at Florio's of Little Italy restaurant wears a protective face mask on the Hollywood Beach Broadwalk during the new coronavirus pandemic, Thursday, July 2, 2020, in Hollywood, Fla. (AP Photo)", "This claim has been repeated and debated by professionals for the past three months.", "Air-quality monitors take 10 seconds on average to adjust to the air quality in an environment, so they are not ideal for measuring the oxygen concentration in a mask where the air being inhaled and exhaled is changing constantly.", "While some healthy people wearing N95 masks could be affected by low oxygen concentrations, cotton masks and surgical masks shouldn’t limit oxygen.", "A two-and-a-half minute video shared thousands of times on social media warns viewers that the protective face masks recommended to stop the spread of coronavirus are not safe for work.", "The man in the video uses an air-quality monitor to measure the oxygen saturation under his mask before determining that wearing a mask leads to dangerously low oxygen intake.", "This post was flagged by Facebook as part of efforts to combat false news and information on its News Feed. (Read more about our partnership with Facebook.)", "We took a closer look at this claim and found it lacks credibility. First, air quality monitors are not applicable for this kind of experiment. Second, scientists say that overall air quality is not generally adversely affected when healthy people wear most types of masks.", "The video", "Referencing Occupational Safety and Health Administration standards, the man in the video explains that an environment must be at least 19.5% oxygen for it to be safe for someone to work in. To demonstrate, he puts the hose of the air-quality monitor next to his mouth without a mask on and then shows the camera the 20.6% oxygen reading on the monitor.", "The man then puts on a protective face mask like those recommended to protect against the spread of the coronavirus and again tests the air quality, this time placing the hose underneath the mask. After a few seconds the monitor’s alarm begins to go off and the man explains that this means it is measuring a \"hazardous atmosphere.\" After measuring the air for about 17 seconds, he pulls the hose out from under his mask and holds the monitor up to the camera again. The monitor reads 17.4% oxygen. It takes 10 seconds for the monitor’s alarm to stop as it climbs back up to a safe level of 19.5%.", "The man pulls off his mask and explains that if you are \"getting headaches and stuff like that, there’s why, because you’re not getting enough oxygen.\" He goes on to explain that if \"you are exerted ... it’s only going to get worse from there.\"", "A similar but longer video post by Pennsylvania state Senate candidate Jeff Neff arrives at a similar conclusion and has gotten thousands of shares.", "Measuring oxygen in a mask is complicated", "The OSHA guidelines the man in the video references are correct. OSHA defines an atmosphere that is less than 19.5% oxygen as oxygen deficient. A Department of Labor spokesperson told PolitiFact that OSHA has not determined how face masks impact oxygen levels and caution employers to consider how they use masks in atypical work environments. OSHA promotes the use of personal protective equipment and other safety measures by employers.", "As long as the atmosphere outside of your mask is normal and not oxygen deficient, you should be fine. Ben Neuman, a Texas A&M University-Texarkana virologist, explained in another fact-check that masks \"won't materially change the makeup of air that comes through the mask.\"", "The oxygen and carbon dioxide levels in a mask are constantly changing as humans breathe frequently and quickly, about 12 to 25 breaths per minute when at rest. Breathing in a mask, you expel high levels of carbon dioxide before quickly sucking in oxygen from the outside atmosphere into your mask.", "Roy McKay, professor emeritus for environmental and public health sciences at University of Cincinnati, explained that sudden breathing changes within a mask can cause meters like the one in the video to display short \"peak\" values that are tracking a quick change in oxygen concentration.", "Kirsten Koehler, associate professor at Johns Hopkins School of Public Health, agreed that the sensor could have been having a response to a rapid change in oxygen levels. She said that it takes about 10 seconds for a sensor to respond to a change in oxygen concentrations, which can’t keep up with human breathing.", "In an article McKay is writing on the quick changes in carbon dioxide and oxygen concentrations within N95 masks, he concludes that \"most healthy people are unaffected by these concentrations… however, some otherwise healthy people are more sensitive and find the concentrations uncomfortable and possibly cause headaches.\" An N95 mask is designed to form a seal around the mouth and nose, so the only air entering the mask is through a filter. The CDC currently does not recommend the general public wears N95 masks.", "That research is specifically on N95 masks, and doesn’t apply to thin surgical masks and cloth masks, which McKay assumes will have better oxygen concentrations because of their relaxed fit.", "Our rating", "In a video on Facebook, a man uses an air-quality monitor to prove that people are \"not getting enough oxygen\" while wearing masks.", "While the sensor he used is probably showing a somewhat accurate reading, experts explained that this sensor can’t pick up on how the oxygen within the atmosphere of the mask changes with each breath. Unless you are using an N95 or sealed mask, you probably won’t experience dangerously low oxygen levels or get a headache from wearing a mask.", "We rate this claim Mostly False.", "PolitiFact, Masks for COVID-19 are effective, as a six-part Facebook takedown fails, June 12, 2020", "Facebook post, June 23, 2020", "Facebook post, June 27, 2020", "OSHA, Confined or Enclosed Spaces and Other Dangerous Atmospheres: Oxygen-Deficient or Oxygen-Enriched Atmospheres, accessed on July 2, 2020", "OSHA, COVID-19 FAQs, accessed on July 2, 2020", "Cleveland Clinic, Vital Signs, Jan 23, 2019", "FDA, N95 Respirators, Surgical Masks, and Face Masks, June 7, 2020", "CDC, How to Protect Yourself & Others, April 24, 2020", "Email interview with Roy McKay, Professor Emeritus for Environmental and Public Health Sciences at University of Cincinnati, July 1, 2020", "Email interview with Kirsten Koehler, Associate Professor of Environmental Health and Engineering at Johns Hopkins School of Public Health, July 1, 2020", "Email interview with Department of Labor spokesperson, July 2, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]