["Since taking office on Jan. 20, President Joe Biden has issued a flurry of executive orders, including one that is aimed at preventing discrimination on the basis of gender identity or sexual orientation and prohibiting workplace discrimination in the federal government.", "While the move was celebrated by LGBTQ advocates, the announcement brought forth criticism from some conservatives on social media, with claims that the order threatens women's rights. Critics protested with the hashtag #BidenErasedWomen.", "A Facebook post shared on Jan. 23 claims Biden ordered schools to allow transgender athletes to play in women's sports.", "\"This is insane. A Biden Executive order call for Transgenders to be included in Women's sports,\" reads a post from “Students for Trump” founder Ryan Fournier, which has been posted to Facebook as a screenshot by a Facebook user.", "Another user shared a screenshot of a tweet from author Abigail Shrier that reads, \"On day 1, Biden unilaterally eviscerates women's sports. Any educational institution that receives federal funding must admit biologically-male athletes to women's teams, women's scholarships, etc. A new glass ceiling was just placed over girls.\"", "Mark Chase, a spokesperson for Fournier, pointed to Section 1 of the executive order and said education institutions that receive federal funding must allow boys who self-identify as girls to participate in female sports, and that there would be administrative consequences if not. He said the order would build upon the Supreme Court's Bostock v. Clayton case \"in an ambitious manner.\"", "\"Women’s sports is a protected category. This ensures fair competition, which will only be diminished if schools are pushed to give biological men the right to participate in them. This executive order is a threat to decades of women’s achievement thanks to executive fiat,\" Fournier said In a statement to USA TODAY.", "USA TODAY reached out to Shrier and the Facebook users for comment.", "Fact check: Vice President Kamala Harris used 2 Bibles when she was sworn in", "The “Executive Order on Preventing and Combating Discrimination on the Basis of Gender Identity or Sexual Orientation” calls for a broader application of last year's Supreme Court Bostock v. Clayton County ruling, which mandated that LGBTQ people are protected from sex discrimination in the workplace.", "The majority opinion held that, “It is impossible to discriminate against a person for being homosexual or transgender without discriminating against that individual based on sex.”", "The order builds on the landmark ruling and directs federal agencies to extend protections against discrimination based on sexual orientation, gender identity and gender expression, and calls for the Supreme Court ruling to apply to Title IX, the federal law that prohibits discrimination in federally funded schools.", "Under \"Bostock's reasoning,\" Title IX, the Fair Housing Act and Section 412 of the Immigration and Nationality Act “prohibit discrimination on the basis of gender identity or sexual orientation, so long as the laws do not contain sufficient indications to the contrary.”", "\"Every person should be treated with respect and dignity and should be able to live without fear, no matter who they are or whom they love,\" Biden's executive order reads. \"Children should be able to learn without worrying about whether they will be denied access to the restroom, the locker room, or school sports.\"", "The order states that discrimination against LGBTQ people \"overlaps with other forms of prohibited discrimination, including discrimination on the basis of race or disability,\" as spelled out in Title VII of the Civil Rights Act of 1964.", "The executive order does not tie an education institution's federal funding to allowing biological male athletes access to women's sports teams and scholarships, the White House said in a statement issued to USA TODAY.", "The order mandates that all students, including transgender students, be able to learn without facing sex discrimination, and as part of that, transgender women should compete on female teams, according to the statement.", "Fact check:Biden said he plans to increase COVID-19 small business relief to people of color and women", "Advocates for the LGBTQ community also have refuted claims that the executive order takes away women's rights and emphasized that the order spells out existing laws.", "Gillian Branstetter, a spokesperson for the National Women’s Law Center, told Vox that the order is not a \"radical step\" and that the Biden administration is \"merely enforcing the Supreme Court's ruling as it was written.\"", "Branstetter added that Biden's executive order “is not an abandonment of his call for unity by any stretch of the imagination,” and \"it’s frankly a little boilerplate because it’s merely enforcing the Supreme Court (decision) as is the executive branch’s constitutional duty.\"", "Chase Strangio, deputy director for transgender justice at the American Civil Liberties Union, wrote on the ACLU's site that Biden \"most certainly did not 'erase women' —  whatever that means.\"", "\"By stating the administration’s intention to follow Supreme Court precedent and federal law, at core all the newly-elected president did was lay out what the law is and agree, unlike his predecessor, to follow it,\" Strangio wrote, adding that federal statutes are the source of legal protections for LGBTQ people, not Biden's executive order.", "However, what the order does do, according to Strangio, is establish that the Biden administration is prepared to enforce all legal protections under federal law for LGBTQ people.", "\"Every employer, every landlord, every health care provider that is considering firing or evicting or denying health care to a transgender person must now think about the fact that all three branches of the federal government have made clear that anti-LGBTQ discrimination is illegal,\" Strangio wrote.", "More: As transgender troop ban gets reversed, LGBTQ community hopeful for Biden's years to come", "The executive order does not address athletics beyond the mention of discrimination in \"school sports.\" Further, transgender amateur athletes already have policies they must follow in order to compete.", "According to the National Collegiate Athletic Association, which oversees 24 sports at over 1,000 colleges and universities, gender confirming surgery or legal recognition of a player's transitioned sex is not required in order for transgender players to participate on a team.", "When hormones are used, the NCAA requires one year of hormone treatment for trans female athletes prior to competing on a women's team, and trans male athletes remain eligible to compete in women's sports until the athlete begins a physical transition using testosterone.", "In November 2015, the International Olympic Committee agreed that those who transition from female to male are able to compete in male sports without restriction.", "Those who transition from male to female are able to compete in the women's category after declaring the gender identity of female, which cannot be changed for a minimum of four years; and demonstrating testosterone levels below a specific level for at least 12 months before their first competition and then throughout the eligibility period.", "For K-12, according to Transathlete.com, policies vary by state and and school district, with 16 states having policies in place that facilitate the full inclusion of transgender, nonbinary and gender nonconforming students in high school athletics. There are 14 states that require medical proof, and 10 states that did not issue statewide practices but allow schools to create their own policies on a case-by-case basis.", "Fact check: National Guard members didn't turn away from Biden's Inauguration Day motorcade in dissent", "Claims about the executive order follow legal and legislative action aimed at transgender athletes.", "Republican lawmakers in several states are pushing legislation to ban transgender athletes from competing in sports for the gender with which they identify.", "Get these in your inbox: We're fact checking the news and sending it to your inbox. Sign up here to start receiving our newsletter.", "In Montana, a GOP-backed bill bans transgender students from playing on school and college sports teams for the gender with which they identify, the Associated Press reported. Proponents of the bill say allowing transgender athletes to play can result in a an unfair playing field in middle and high school sports.", "A group of female high school runners in Connecticut — one of the states that allows transgender athletes to compete without restrictions — filed a federal lawsuit that seeks to block transgender athletes in the state from participating in female sports, according to the Associated Press.", "The claim that Biden's gender discrimination executive order says transgender women must be allowed to compete on women's teams is MISSING CONTEXT, based on our research. The order protects against discrimination based on sexual orientation and gender identity and states children should not be \"denied access\" to \"school sports.\" The White House said this would include having transgender females play on women's teams. But the posts do not acknowledge that rules for transgender athletes are already in place at the college and Olympic levels, as well as in many states and school districts. Further, it is false to say any educational institution that receives federal funding must add biologically male athletes to teams.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook."]