["About this rating", "In the days following a violent attack on the U.S. Capitol by supporters of U.S. President Donald Trump on Jan. 6, 2021, Snopes readers asked for verification of online rumors that an unspecified Apple software update would remove the emergency alert system on iPhones.", "This is a false rumor that appears to have originated with Lin Wood, an attorney and Trump ally with a track record of making false and incendiary statements.", "Wood rose to prominence by making inflammatory and false public statements. He was one of the most vocal promoters of Trump's months-long disinformation campaign claiming falsely the November 2020 presidential election was beset by fraud, and that Trump, who lost, actually won. Wood also has a habit of making extremely incendiary remarks, like calling for the execution Vice President Mike Pence.", "Wood stated on the social media platform Parler that the Apple update would shut off the emergency broadcast system so that Trump couldn't use the system to send text messages to his supporters after being banned from various social media platforms.", "Trump has been banned, most notably, from Twitter and Facebook among other platforms, over fears he would incite further violence. During the attack on the Capitol, five people were killed, including a Capitol police officer who was beaten to death and a Trump supporter who was shot and killed by police when she tried to breach a barricaded door. Pence and members of Congress were evacuated from House and Senate chambers within hair-raising seconds before rioters reached them, some of whom stated they wanted to kill some of them.", "Parler is currently down because because Amazon booted it from its web hosting service over posts threatening further violence. But we archived the cached version of Wood's posts about the emergency broadcast system:", "Apple banned Parler, a platform favored by Trump supporters and right-wing extremists, from its iPhone app store, and Google Play banned it from downloads onto Android phones.", "But Apple didn't remove emergency alerts in its most recent updates. iPhone users, however, do have the option of turning these alerts off if they don't wish to receive them.", "The emergency broadcast system is for public-safety purposes and is where officials can convey important safety-related information to residents affected by an emergency. It can also be used by the U.S. president in the event of a national emergency, and can be \"used when all other means of alerting the public are unavailable,\" per FEMA's website.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]