["Former U.S. Rep. Dennis Kucinich speaks during a news conference announcing his run for Ohio governor, Wednesday, Jan. 17, 2018, in Middleburg Heights, Ohio. (AP)", "Former Ohio congressman Dennis Kucinich says that young people look with trepidation toward the future because they can’t afford college.", "He has promised if elected governor he will make it possible for every young Ohioan to attend a two-year college tuition free.", "\"The default rate for students 10 years ago was about 40 percent,\" he wrote on his campaign website. But now, the \"default rate approaches 50 percent.\"", "His website also stated \"perhaps as many as 800,000 young Ohioans are facing default on their student loans.\"", "Kucinich is competing in the May 8 Democratic primary for governor. We fact-checked his statistics and found he has a point that student debt is a big problem, but he flubbed some of the numbers about the default rate and then used those to estimate the numbers of Ohioans facing debt.", "Kucinich’s claim that \"the default rate for students 10 years ago was about 40 percent\" is  based on a credible report, but Kucinich presented the number as a default rate in the past while the report cites that figure as a prediction for the future.", "A January report by Columbia professor Judith Scott-Clayton for the Brookings Institution analyzed national data on student debt and repayment, released by the U.S. Education Department in October 2017.", "Scott-Clayton projected that about 40 percent of the students who entered college in 2004 will default by 2023, based on patterns of defaults from earlier cohorts.", "While Kucinich wrote about student debt as a broad problem, the Brookings report said default rates are higher for students who attend for-profit colleges and for students of color.", "\"The results suggest that diffuse concern with rising levels of average debt is misplaced,\" Scott-Clayton wrote wrote.", "Scott-Clayton, the author of the Brookings report, told PolitiFact that her projections do not adjust for changes in student composition, institutional choices, or loan characteristics that might relate to the likelihood of default. It is possible the actual rates will be higher or lower.", "Sandy Baum, who wrote a report for the College Board, sent PolitiFact data showing that the two-year cohort default rate was nowhere near 40 percent in the past couple of decades. The high point in the two-year cohort default rate between 1987 and 2010 was 22.4 percent in 1990. (Default rates are now measured in three-year cohorts.)", "We found no data to support Kucinich’s claim that the student default rate approaches 50 percent today.", "The U.S. Education Department released data in 2017 which showed the national default rate for the 2014 cohort was 11.5 percent. (It was 13.6 percent in Ohio.)", "The Kucinich campaign arrived at the estimated prediction of 800,000 in default based on back-of-the-envelope calculations, which are not borne out by actual data.", "A Kucinich campaign spokesman said that 14 percent of the national population are federal student loan borrowers, or 44 million.", "If that same percentage holds true for Ohio, then 1.6 million Ohio residents have federal student loans.", "Using their estimate that half will default (which we found no data to support) would bring the number to 800,000.", "We went in search of actual numbers of Ohioans who defaulted.", "U.S. Education Department state data for the FY 2014 cohort showed that 28,955 Ohio borrowers defaulted, or 13.6 percent", "Mark Kantrowitz, a national expert on student debt, said that while the 800,000 number isn’t justified, Kucinich has a point about the problem of student debt.", "\"Generally, the burden of paying for college has shifted from the federal and state government to families because of a failure of government support to keep pace with increases in college costs on a per-student, inflation-adjusted basis,\" he said. \"Since family income has been flat and loans are the only form of aid that has any degree of elasticity, this has driven annual increases in borrowing to pay for college.\"", "Kucinich’s campaign website said the default rate for college students has grown from 40 percent 10 years ago to about 50 percent today, and that \"perhaps as many as 800,000 young Ohioans are facing default on their student loans.\"", "That’s based on a report that predicted that 40 percent of students who entered college in 2004 will default by 2023. So that’s a prediction about the future -- not a default rate for 10 years ago.", "We found no data to support Kucinich’s claim that about 50 percent of students default today. U.S. Education Department data showed that the default rate nationally for the 2014 cohort was 11.5 percent.", "Using the 50 percent figure and extrapolating from population numbers, the Kucinich campaign concluded that 800,000 face default on their loans. That figure is not supported by actual data.", "We rate this claim False.", "Dennis Kucinich, Campaign for governor website, Accessed Jan. 29, 2018", "Brookings Institution, \"The looming student loan default crisis is worse than we thought,\" Jan. 11, 2018", "Institute for College Access and Success, Project on Student Debt, 2016", "Institute for College Access and Success, Project on Student Debt, 2015", "Inside Higher Ed, \"New Analysis of Student Loan Default Data,\" Jan. 12, 2018", "U.S. Department of Education, Student default rates,", "College Board, Two-Year Student Loan Default Rates by Degree Completion Status over Time", "PolitiFact Ohio, \"Sherrod Brown says Ohio students graduate from college with an average tuition debt of $27,000,\" May 7, 2012", "Interview, Andy Juniewicz, Dennis Kucinich spokesman, Feb. 9, 2017", "Interview, Judith Scott-Clayton, Brookings Institution nonresident fellow and Associate Professor of Economics and Education at Teachers College, Columbia University, Feb. 1, 2017", "Interview, Emily Hecker, Institute for College Access and Success spokeswoman, Feb. 13, 2018", "Interview, Mark Kantrowitz, national expert on student debt, Feb. 13, 2018", "Interview, Sandy Baum, coauthor of the College Board’s annual publications Trends in Student Aid and Trends in College Pricing, Feb. 13, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]