["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "President Barack Obama celebrated some signals that American manufacturing is strengthening while on a recent multi-state tour.", "\"We invested in clean energy, saved the auto industry, and today, factories are opening their doors at the fastest pace in almost two decades,\" he said in Clinton, Tenn. Jan. 9.", "Manufacturing was already facing challenges in terms of jobs, output and factory closings when the recession hit in the late 2000s. So we wondered about their recovery and Obama’s claim that factories are opening up faster than they have in years.", "The White House told us that they were counting since 1997, about 17 years. The Bureau of Labor Statistics counts the number of factories in its \"Quarterly Census of Employment and Wages.\" We used the agency’s online database to look at the change in the number of factories (manufacturing establishments) since then.", "At the peak -- early on, in 1998, there were 412,453 private manufacturing establishments. That dropped steadily each year, to a low point of 333,565 in 2013. That’s a 19 percent drop and a loss of nearly 80,000 establishments.", "But in the second quarter of 2014 -- the latest data available -- it’s up to 338,304. That’s growth of 1.5 percent from the trough, but far below the peak back in 1998.", "Any growth would constitute factories \"opening their doors at the fastest pace in almost two decades\" because -- except for a couple of short-lived blips -- this is the first time the number of factories has grown at all since the 1990s.", "Here’s a graph showing the overall trend, using the Bureau of Labor Statistics data:", "\"Bottom line, the president's statement is accurate, but positive growth in 2014 would make it the first calendar year to add facilities since the president took office,\" said Taylor Garland, spokeswoman for nonprofit advocacy group Alliance for American Manufacturing.", "A January 2015 paper out of the Information Technology and Innovation Foundation looks at recent trends in manufacturing, including the number of establishments -- using the same Bureau of Labor Statistics data. While the authors noted the modest growth, they said this particular data set has limited usefulness in terms of identifying future trends. The count can include factories that have had a change in their production situation -- like relocating or re-opening after a period of closure -- instead of just capturing the number of brand-new factories.", "A revival?", "The foundation’s report says American manufacturing peaked in the late 1970s. Losses in the industry through the 1990s led to more dramatic losses in the 2000s, coinciding with the rise of globalization and China’s economic prowess. And the recession accelerated the process.", "But Obama and others see the growing number of factories and other positive economic figures about the manufacturing industry as a flicker of hope for a manufacturing revival.", "In his recent speeches, Obama has also said, \"Manufacturing is actually growing faster than the rest of the economy.\" Over the four quarters of most recently available data -- from mid 2013 to mid 2014 -- the United States’ overall GDP grew 2.7 percent. Manufacturing grew faster, at 4.6 percent.", "Some economists, however, are skeptical that the uptick signifies a larger trend.", "The report from the Information Technology and Innovation Foundation says these positive indicators might just be cyclical. International investment bank Goldman Sachs came to a similar conclusion.", "\"Conditions for U.S. manufacturing are certainly better than they were a decade ago, as employment and output are both growing, albeit slowly,\" the report says. \"Despite this improvement, there is not yet evidence to support the notion of a U.S. manufacturing renaissance.\"", "Our ruling", "Obama said, \"Factories are opening their doors at the fastest pace in almost two decades.\"", "The latest figures line up with Obama’s claim. The number of factories steadily decreased from 1998 to 2013. In the first two quarters of 2014, things started to pick up, though they are still nowhere near the 1998 peak. We should note that economists are far from certain that this is a significant trend, or if it will continue.", "This is just one figure of many that could clue us into whether or not manufacturing is making a resurgence, but it’s not enough by itself to make any broad claims about a recovery. We rate Obama’s statement Mostly True.", "White House, \"Remarks by the President at Announcement of Manufacturing Hub,\" Jan. 9, 2015", "Bureau of Labor Statistics, Quarterly Census of Employment and Wages, accessed Jan. 19, 2015", "Bureau of Economic Analysis, Real value added by industry, accessed Jan. 19, 2015", "Information Technology and Innovation Foundation, \"The Myth of America’s Manufacturing Renaissance,\" January 2015", "Businessweek, \"The Manufacturing Renaissance Is Not as Awesome as We Thought,\" Oct. 3, 2014", "VoxEU, \"The U.S. manufacturing base is surprisingly strong,\" Aug. 9, 2014", "Email interview, White House spokeswoman Brandi Hoffine, Jan. 19, 2015", "Email interview, Suzanne Berger, political science professor at the Massachusetts Institute of Technology, Jan. 19, 2015", "Email interview, Taylor Garland, spokesperson for the Alliance for American Manufacturing, Jan. 19, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]