["About this rating", "A study including more than 65,000 individuals in South Korea found that juveniles between the ages of 10 and 19 are just as likely as adults — if not more — to transmit SARS-CoV-2, the virus responsible for COVID-19.", "The study used contact tracing to determine how likely an infected individual is to spread the virus to people who live within their home compared to those they come into contact with outside of the home. It is important to highlight several limitations present in the study that may have influenced or skewed the findings that are described in the article below. Furthermore, the study was pre-released in July 2020 in advance of its October 2020 publish date, and may see further edits before final publication.", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "Adolescents appear to spread SARS-CoV-2, the coronavirus responsible for COVID-19, as quickly and effectively as some adults, according to a study of more than 65,000 individuals in South Korea conducted during the onset of the 2020 pandemic.", "In the context of this study, news reports making such claims are mostly accurate. However, there are some important caveats to note when interpreting the broader implications of the findings.", "After the first case of COVID-19 in South Korea was discovered on Jan. 20, 2020, the nation adopted a “rigorous contact-tracing program” to track its spread throughout the population. Between the first reported case and March 27, researchers with the U.S. and Korea Centers for Disease Control and Prevention (CDC) tracked more than 5,700 individuals diagnosed with COVID-19 by analyzing GPS, credit card transactions, and closed-circuit television. More than 59,000 people had come into contact with the original “index patients,” allowing researchers to determine how likely an infected individual was to transmit the virus to those living in their home and beyond. While researchers did not set out to characterize transmission rates specific to age groups, the claim is a byproduct of the work.", "Children between 10 and 19 years of age were shown to have a higher transmission rate within their households than younger children and were thus able to spread the virus as efficiently as, and in some cases at higher rates than, adults. More specifically, this age group had a transmission rate of over 18% within their own household, which is much higher than adults between the ages of 20 and 59 (ranging 7 and 14.7%). On the other hand, adolescents were much less likely to spread the disease to others outside of their home, and though children under 10 were found to transmit less than adults, they are still believed to contribute to community transmission.", "It is unclear why teens and tweens appear to be transmitting the disease more than adults, though the researchers speculate that it may be due to how children were socializing during the study period.", "“We also found the highest COVID-19 rate for household contacts of school-aged children, and the lowest for household contacts of children [up to nine years] in the middle of school closure. Despite [the] closure of their schools, these children might have interacted with each other, although we do not have data to support that hypothesis,” wrote the authors.", "In all age groups, the virus was shown to spread more between people of the same household than to those outside of the home. Of nearly 10,600 people who lived with someone diagnosed with COVID-19, 11.8% would also experience symptoms, compared with less than 2% of those exposed outside of the house.", "However, researchers note that “given the different thresholds for testing policy between households and non-household contacts,” they “cannot assess the true difference in transmissibility” between the two, concluding that comparing symptomatic COVID-19 patients from both groups would have been more accurate. Because only symptomatic individuals were included as index patients, the researchers further caution that the number of actual cases may be higher.", "Regardless, if higher transmission rates are influenced by how adolescents practice social distancing, the study authors add that the findings mean children's infection rates may be higher when school closures end.", "“Young children may show higher attack rates when the school closure ends, contributing to community transmission of Covid-19,” wrote the study authors adding that younger children are less likely to show symptoms, so it’s possible that the findings may not have captured all of those infected.", "The study is set for publication in the October 2020 issue of the journal Emerging Infectious Diseases, but its early release came as the U.S. was deciding whether to let children return to school for the 2020-2021 academic year. Less than two weeks after the study was pre-released, the CDC issued reopening guidance for schools around the nation, highlighting the risk of transmission and severe complications that COVID-19 infection may have in children. For unknown reasons, children of all ages can become infected with the virus, but are less likely to be as sick as adults or experience severe illness while others may not show symptoms, according to the Mayo Clinic. Even if an adult or child is not experiencing symptoms, evidence presented by the World Health Organization suggests that they may be able to transmit the virus and infect those they come into contact with.", "In mid-August 2020, additional data released from the research team and published in the Archives of Disease in Childhood highlighted that the initially reported findings were inconclusive in determining who was infecting whom. In the first study, the researchers set out to describe contact tracing practices in South Korea at the beginning of the pandemic — not to determine how the disease was transmitted by adults.", "Even so, the overall findings are still generally the same: children under the age of 10 do not seem to spread the disease as much as adults, and one’s ability to transmit appears to increase with age. However, experts told The New York Times that when it comes to informing policy decisions, the publication of the second dataset highlights the importance of looking at extensive evidence as a whole rather than pointing to the findings of one particular study.", "McBride, Jessica.   \"New COVID-19 Study Shows Teens Spread the Virus as Fast as Adults.\"\r\n    Heavy.   22 July 2020.", "Park, Young Joon, et al.   \"Contact Tracing During Coronavirus Disease Outbreak, south Korea, 2020.\"\r\n    Emerging Infectious Diseases.   16 July 2020", "\"The Importance of Reopening America’s Schools This Fall.\"\r\n    CDC.   23 July 2020.", "\"COVID-19 (Coronavirus) in Babies and Children.\"\r\n    Mayo Clinic.   21 July 2020.", "\"Transmission of SARS-CoV-2: Implications for Infection Prevention Precautions.\"\r\n    World Health Organization.   9 July 2020.", "Mandavilli, Apoorva.   \"Older Children and the Coronavirus: A New Wrinkle in the Debate.\"\r\n      The New York Times.   14 Aug 2020.", "Kim, Jieun, et al.   \"Role of Children in Household Transmission of COVID-19.\"\r\n      Archives of Disease in Childhood.   7 Aug 2020.", "Updated to include second dataset published in Archives of Disease in Childhood in August 2020.", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]