["About this rating", "Iran passed a law regarding marriage between parents and children.", "Information spread about that law online is outdated, the law only applies to adoptive daughters, and the law imposed restrictions on such marriages (which were not previously prohibited) rather than “allowing” them.", "In August 2019, an Indian-based website called The Youth published an article headlined \"A controversial Bill passed in Iran, it allows men to marry daughters, draws flak from other nations\" that drew inquiries from many Snopes readers:", "The Youth failed to inform readers of several salient facts about the article, however, including the following:", "According to other sources, the issue was actually contrary to the way it was framed in headlines published by Western news outlets such as The Guardian. Marriage between stepparents and stepchildren had not previously been barred under Iranian law, so in February 2013 Iran's Parliament sought to amend the law and passed a bill incorporating such a ban. Iran's Guardian Council overrode that bill, though, so the Parliament then revised the bill to allow such marriages, but only if they received additional levels of authorization and approval, according to Al-Monitor:", "In mid-February 2013, an act was passed by the parliament on \"Protection of Children and Adolescents with no guardian (adoption).\" In the original act, approved by parliament, marriage between adopted children and their parents was completely banned and it stated that if a foster parent decided to marry his or her adopted child, custody of the child would be taken away from the foster parent.", "The Guardian Council, however, claimed that this bill was against Sharia and returned it to parliament.", "The issue stems from traditional and conservative families, in which the adoptive daughter, since she is not related by blood, would have to wear a veil in the home around her adoptive father. Also, adoptive mothers would have to wear the veil around their adoptive sons. Typically, reciting a prayer would have addressed this issue.", "Because the Guardian Council denied a bill allowing an official ban of this type of marriage, parliament modified the original bill so that marriage between foster parents and their adopted children could take place, however only if it were approved by a judge. Also, according to Title 27 of the revised act, marriage between adopted children and their foster parents could only take place if it were requested by the State Welfare Organization and approved by the court.", "So, rather than lifting an existing ban and \"allowing\" Iranian men to marry their adoptive daughters, the Iranian Parliament attempted to enact a ban on such marriages, which had not previously been barred under the law. Failing that, they passed a bill imposing some restrictions on those marriages:", "The original text of Article 27 read: “Whenever the guardian decides to marry, he must submit the personal information of the intended party to the court. In case of marriage, the [relevant] institution is responsible to report the marriage to the court so to ensure the legal conditions for continuation or termination of shared guardianship are decided upon. Note: Marriage during custody or after between the adoptive parent and adopted child is illegal.” However, the revised note to Article 27 now states: “Marriage during the period of custody or thereafter between the adoptive parent and adopted child is illegal unless the court after consulting the [relevant] organization recognizes the marriage as beneficial to the adopted child.\"", "Opposing sides debated the necessity of the bill in the first place, with one side claiming that such marriages were exceedingly rare, and the other asserting the contrary:", "A jurist in Tehran said, “Marriage between adopted children and foster parents was never banned. There are a lot of absurd laws in the Sharia that no one has ever heard about and no judge ever comes in contact with. It is like opening a can of worms! Until today, no foster parent knew that he could marry his adopted child. Parliament had no reason to feel there is any necessity for such an amendment.”", "People such as Mohammad Nafriyeh, the vice president in charge of social affairs for the State Welfare Organization, defends this law and considers it a step forward. “Unlike what is being said these days, this amendment in fact puts a stop to the possibility of marriage between foster parents and their adopted children. Previously, however, there was no legal restriction regarding such marriages. This is a step forward.”", "Another jurist who is critical of this new legislation told Al-Monitor, “The rate of marriages between foster fathers and their adopted daughters is one in 1 million. What does this mean? It means that there was no need to create such mental distress for thousands of families regarding an issue that only happens one in 1 million cases. Yes, if these marriages were the norm, then this amendment could have been considered a step forward. However, given the current circumstances, how can this be considered a step forward?”", "But this argument was rejected by Mohammad Nafriyeh. In an interview with Iran Labor News Agency, ILNA, he said, “As vice-president of the State Welfare Organization, I can tell you that such marriages are not as rare as one might think. We have had cases like these in the past and based on the information that I have, I consider this amendment to be a step forward which can reduce the number of such marriages in the country.”", "Although at the time The Guardian article was published in September 2013, the revised bill had been passed by the Iranian Parliament but not yet approved by the Guardian Council, the latter's approval was granted shortly afterwards.", "Center for Human Rights in Iran.   \"Outrage After Judicial Parliamentary Committee Rejects Bill to Ban Child Marriages in Iran.\"\r\n    28 December 2018.", "Kamali Dehghan, Saeed.   \"Iran lawmakers Pass Bill Allowing Men to Marry Adopted Daughters.\"\r\n    The Guardian.   26 September 2013.", "Al-Monitor.   \"Anger, Confusion Cloud Iran's Adoption-Marriage Bill.\"\r\n    7 October 2013.", "Abhinandan, Sagar.   \"A Controversial Bill Passed in Iran, It Allows Men to Marry Daughters, Draws Flak from Other Nations?\"\r\n    The Youth.   12 August 2019.", "Justice for Iran.   \"Early and Forced Marriages in the Islamic Republic of Iran.\"\r\n    December 2013.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]