["About this rating", "Any acidic drink corrodes copper in a mug, which leaches back into the drink and increases the level of copper in it, and could thereby potentially cause copper poisoning and its associated symptoms.", "It's not clear how long a cocktail would have to sit in a copper mug, and how many drinks someone would have to drink, in order to feel the symptoms of copper poisoning.", "The exact rate at which copper from a mug leaches into drinks of various acidities.", "In August 2017, several news outlets reported that public health authorities in the state of Iowa had advised against serving certain alcoholic drinks in copper mugs:", "An advisory bulletin from Iowa’s Alcoholic Beverages Division notes that, in keeping with Food and Drug Administration guidelines, copper should not come into contact with acidic foods with a pH below 6. That includes vinegar, fruit juice, wine and, yes, a traditional Moscow mule, whose pH is “well below 6.0.” the bulletin says.", "Iowa's Alcoholic Beverages Division did indeed publish an advisory bulletin on 28 July 2017:", "The recent popularity of Moscow Mules, an alcoholic cocktail typically served in a copper mug, has led to inquiries regarding the safe use of copper mugs and this beverage. The use of copper and copper alloys as a food contact surface is limited in Iowa.", "The bulletin goes on to explain that the Food and Drug Administration food code prohibits food or drink with pH levels of below 6 (that is, relatively acidic food and drinks) coming in contact with copper at a licensed premises like a bar or restaurant. The reasoning behind this, according to page 485 of the FDA food code, is that there is a slight but definite risk of poisoning:", "High concentrations of copper are poisonous and have caused foodborne illness. When copper and copper alloy surfaces contact acidic foods, copper may be leached into the food.", "The FDA code adds that anyone serving beverages (including water) through pipes must also have adequate mechanisms in place to prevent copper from leaching into drinks. It also points out that while copper is an important part of the fermentation required to brew beer, too much copper (above 0.2 mg per liter) kills yeast, so the level of copper leached into successfully-brewed beer falls below what is toxic to humans (about 3.5 mg per liter and above).", "The 28 July 2017 statement by the Iowa Alcoholic Beverages Division does not contain new information, new research, or a new warning about drinking from copper mugs. It is effectively a reminder, in light of the recent popularity of the  Moscow mule, that Iowa has incorporated the federal regulations contained in the FDA food code. That code has contained the same restrictions on copper plumbing and containers, and the same rationale, since at least 1997.", "It's clear that although copper is an important naturally occurring trace element, it can also be toxic to humans. It is also clear that toxic levels of copper can leach into food and water through both copper containers (such as those used for acidic drinks like the Moscow mule and other beverages) and through copper or copper alloy plumbing.", "However, what's less clear is how much copper is enough to make you sick, and how likely it is that you'll be harmed by drinking a cocktail from a copper mug.", "In 1991, the Environmental Protection Agency established a \"maximum contaminant level goal\" for copper of 1.3 mg per liter of fluid (page 130). According to the EPA, the MCLG is \"the maximum level of a contaminant in drinking water at which no known or anticipated adverse effect on the health of persons would occur, allowing an adequate margin of safety\". A 1999 study in the journal Environmental Health Perspectives concluded that copper levels above 3 mg per liter of drinking water were associated with increased instances of nausea, vomiting and abdominal pain.", "The National Research Council also lists several case reports and studies of outbreaks and incidences of copper poisoning. The details of these cases are not entirely reliable since they are not controlled experiments, and outcomes could have be affected by many variables. We asked the FDA for more details on (roughly) how many acidic cocktails an individual would have to consume, and how long the drink would have to remain in a copper container, before they became ill.", "The FDA forwarded our query to the Centers for Disease Control, whose spokesperson indicated it would be difficult to give a definitive answer:", "We do not have any specific information regarding how many Moscow mule drinks one would need to drink out of a copper mug to have a health risk. Generally, acidic drinks would leach copper out of the unlined copper mugs. The amount of copper would depend on the acidity of the drink and the length of time that it is in contact with the mug.", "We also consulted Professor Marc Solioz, a leading microbiologist who has expertise in copper toxicity; he told us that there is something of a biological early warning system that can often stop people from consuming copper-contaminated drinks:", "Long before you reach the highest levels [of copper in a beverage], the drink gets a metallic taste, so this is really a warning that there's too much copper in the drink.", "Solioz was skeptical about the potential risk of poisoning and adverse symptoms (discomfort, nausea, vomiting) from the typical consumption of even acidic beverages like the Moscow mule from a copper container:", "It is clear that in these mugs there will be copper dissolved by the drinks. Most drinks are acidic, and acidic solutions dissolve copper. How much copper this is is very difficult to say. It depends on the acidity, it depends on the volume that's in there, how long it sits in there, whether it's stirred or not.", "But I would think that if you just drink a drink in...  let's say fifteen, twenty minutes, it's probably okay.", "We asked Solioz whether the risk of illness would also be low for a person drinking three to five acidic cocktails from the same copper mug over the course of several hours. He replied:", "Generally low risk, yes. I personally wouldn't be worried about it.", "Solioz emphasized that while the risk from typical consumption is probably low for most people, a small proportion of the population (around 1 in 30,000 people) have Wilson disease, which causes an accumulation of copper within the body, and could potentially be harmed by consuming acidic beverages from a copper container.", "While most people are able to effectively secrete copper, Solioz said, those with Wilson disease struggle to do this, so even the relatively low level of copper leached into a drink could make them sick.", "Solioz told us he was unaware of any research which specifically measured the rate of copper leaching in containers carrying beverages of various acidities, and over various time periods. We were also unable to find such research.", "The closest thing to this that we could find was a short 1957 report published in the American Journal of Public Health. This report described an outbreak of nausea, vomiting and diarrhea among nurses at a military hospital in 1954. The nurses consumed cocktails at a party that had been sitting in copper-contaminated cocktail shakers for more than two hours before many of them became sick.  Dr John Wylie, the report's author, wrote:", "The evidence was suggestive of the original inner plating having become worn off through frequent use and cleaning during several years...", "The cocktail was reconstructed, yielding the equivalent of 179 mg of copper per liter. Wylie concluded:", "These amounts of copper are believed to have given rise to the symptoms of chemical food poisoning precipitated by the ingestion of alcohol on an empty stomach.", "It's very difficult to conclude anything from this about the rate at which cocktails might typically become contaminated in copper containers: this was a short and decades-old case report, not a scientific study (which could have controlled for various possible causal factors); the author does not make it clear whether he himself was present for the incident; and Wylie also suggests that the level of copper leaching in the cocktail was linked to significant damage to the container. Despite these serious shortcomings, the 1957 report formed the basis of the EPA's 1991 decision that the \"maximum contaminant level goal\" for copper in drinking water should be 1.3 mg per liter. This recommendation remains in place in August 2017.", "We also asked Iowa's Department of Inspections and Appeals for statistics on reports of copper poisoning in the state, in order to see whether there had been a spike in symptoms accompanying the increased popularity of the Moscow mule, but we were told that the state's Department of Public Health does not track such reports.", "Iowa's Alcoholic Beverages Division, meanwhile, recommends that if bar and restaurant owners are going to use copper mugs for highly-acidic drinks like the Moscow mule, they should use copper mugs lined on the inside with other metals like nickel or stainless steel.", "Wang, Amy B.  \"Heads up, Moscow Mule Lovers: That Copper Mug Could be Poisoning You.\"\r\n  Washington Post.  8 August 2017.", "CBS News.  \"Copper Cocktail Mugs May Cause Food Poisoning, Food Officials Say.\"\r\n  CBSNews.com.  8 August 2017.", "Alcoholic Beverages Division, State of Iowa.  \"Use of Copper Mugs in the Serving of Alcoholic Beverages.\"\r\n  ABD.Iowa.gov.  28 July 2017.", "Food and Drug Administration.  \"Food Code 2013.\"\r\n  FDA.gov.  2013.", "Committee on Copper in Drinking Water.  \"Copper in Drinking Water.\"\r\n  National Research Council.  2000.", "Pizarro, Fernando; Olivares, Manuel; Uauy, Ricardo; Contreras, Patricia; Rebelo, Adriana; Gidi, Virginia.  \"Acute Gastrointestinal Effects of Graded Levels of Copper in Drinking Water.\"\r\n  Environmental Health Perspectives.  Vol. 107, No. 2, February 1999.", "Wyllie, John.  \"Copper Poisoning at a Cocktail Party.\"\r\n  American Journal of Public Health.  Vol. 47 Page 617, May 1957.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]