["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "This is wrong. Soros has not been arrested.", "The indictment cited in the story was forged to include his name and was created from a real indictment involving Russian hackers.", "George Soros, a billionaire philanthropist and Democratic campaign contributor, has long been cast as a central figure of conspiracy theories and misinformation.", "The latest one: That the 90-year-old has just been arrested in Philadelphia for \"election interference.\"", "One headline, published by a website called YourNewsWire.com, reads: \"George Soros Arrested in Philadelphia For Election Interference – Judge Orders Media Blackout.\"", "The story goes on to claim that Soros \"is currently being held in federal custody in Philadelphia. According to a recently unsealed indictment filed in the Western District of Pennsylvania, Soros has been charged with a number of serious crimes relating to the US election.\"", "This is bogus. Soros has not been indicted or arrested. The indictment depicted in the article was forged to include his name and was created from a real indictment involving Russian hackers.", "The story was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The fake indictment lists charges for conspiracy, conspiracy to commit wire fraud, wire fraud, damage to computers, aggravated identity theft and aiding and abetting.", "A reverse-image search revealed that it was digitally manipulated using a real indictment from Oct. 15 that involved six Russian nationals who were allegedly behind a number of high-profile cyber attacks and accused of being hackers with Russian military intelligence.", "Beyond the manipulated document, there are no sources listed in the story or any evidence of Soros’ arrest. A representative from his Open Society Foundations called the claim \"entirely false.\"", "The article says no other media organizations are reporting the story because a judge in the case ordered a \"publication ban.\"", "But there is no such thing.", "U.S. judges do not have the power to stop journalists from reporting on a case. They can only order individuals involved not to speak with the press.", "President Donald Trump’s legal team has amplified the baseless conspiracy theory that Soros, as well as local and state elections officials, antifa, China, and Venezuelan leader Hugo Chavez (who died in 2013), are involved in rigging the presidential election in favor of Joe Biden.", "Articles circulating on social media claim that George Soros was indicted and arrested in Philadelphia for \"election interference.\"", "This is bogus. The story includes no sources and uses a forged indictment as its sole evidence of the claim.", "This is full-on Pants on Fire!", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here for more.", "YourNewsWire.com, George Soros Arrested in Philadelphia For Election Interference – Judge Orders Media Blackout, Nov. 23, 2020", "ConservativeBeaver, George Soros ARRESTED for election interference, in federal custody, Nov. 23, 2020", "Bellingcat, Russian Vehicle Registration Leak Reveals Additional GRU Hackers, Oct. 22, 2020", "The Independent, Fake conspiracy theory claiming George Soros arrested for election interference spread by far-right, Nov. 23, 2020", "Email interview, Laura Silber chief communication officer for Open Society Foundations, Nov. 23, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]