["About this rating", "Respiratory, skin, or eye irritation from borax is possible, as is skin irritation from components of shaving cream.", "Fear-mongering claims about carcinogenicity, reproductive toxicity, and neurotoxic harm are either irrelevant in the concentrations present in a ‘slime’ recipe or are patently false.", "On 3 March 2017, a blog titled “This Talk Ain’t Cheap” published an account of a family's experience with the DIY craft phenomenon known as “slime,” a goo made from white glue, borax, shaving cream, and water. In the piece, titled “Beware of Homemade Slime,” the author recounted how her daughter had come down with a series of symptoms, including headache and respiratory problems, with no clear cause. But when they removed all the slime and slime-related products from their house, however, her daughter immediately became healthy:", "If you have elementary age kids, you are probably familiar with the current slime obsession. My daughter and her friends became obsessed with it a few months ago and couldn’t get enough of it. So much so that they decided they would start making it themselves at home, a simple endeavor providing you have the right ingredients.", "When my 12 year old got sick, we thought it was the same basic cold. Symptoms were the same: cough, sore throat, stuffy nose. She was also complaining about headaches and general achiness. Weeks later, we were still left wondering what on earth was going on. To the doctor we went. We had her take a throat culture, check her lungs, and ears and sinuses. She found nothing. Other than your basic cold symptoms, there wasn’t anything wrong with her on the surface.", "My husband was actually the one who connected the dots. He told me one night, “Do you think it could have something to do with the slime she’s been making?” From that moment, we banned her from making, holding, touching or even looking at that darn slime.", "The very next day, her headache went away. Her throat didn’t hurt anymore. She still had some congestion, but wasn’t coughing. Two days later, the congestion started going away. She was breathing better and talking better. No more achiness.", "While we cannot speak to the specific mechanism behind the daughter’s ailment, it is not impossible that one or more ingredients of slime may contributed in some way. Everyone reacts differently to certain compounds, and sensitivity to one of the compounds present in slime is a possibility. Furthermore, if the daughter was frequently in contact with dry borax, it is possible that compound could have contributed to respiratory problems (just like any other fine particulate powder) or skin irritation.", "Additionally, as a solution of borax necessarily produces boric acid, improper dilution can also lead to skin irritation and even, as has been reported, serious burns.", "Unfortunately, the post went on to list myriad other possible health risks of slime, borrowing heavily from information presented by the British tabloid Daily Mail and other questionable sources, many of which are either completely false, or generally misleading. These claims include:", "Potential harm from borax", "There is a kernel of truth the claims made about Borax (aka sodium borate). It is indeed toxic if ingested, but an ordinarily healthy person would need to ingest a relatively large amount of it to suffer serious health effects. Some governmental bodies, including the government of Canada, have recommended against Borax's use in children's craft projects, citing concerns about the cumulative effects of long-term exposure from both natural and unnatural sources.", "This move likely reflects an abundance of caution. A comprehensive review of the toxicity of borate-based products in humans concluded that the doses required to create any genotoxic or acute toxic effects are absurdly unrealistic:", "Inorganic borates, including boric acid, Na, ammonium, K, and Zn borates generally display low acute toxicity orally, dermally, and by inhalation. They are either not irritant or mild skin and eye irritants.", "The critical effects in several species [of borates] are male reproductive toxicity and developmental toxicity. The doses that cause these effects are far higher than any levels to which the human population could be exposed. Humans would need to consume daily some 3.3 g of boric acid (or 5.0 g borax) to ingest the same dose level as the lowest animal [no-observed-adverse-effect-level, NOAEL].", "No effects on fertility were seen in a population of workers exposed to borates or to a population exposed to high environmental borate levels. There is remarkable similarity in the toxicological effects of boric acid and borax across different species.", "A separate detailed review of studies on both humans and laboratory animals, concerned specifically with human developmental and reproductive toxicity, similarly concluded that \"The typical human exposures are below the minimum level considered to be adverse to reproduction.\"", "Additionally, the above-cited work all assumes actual consumption of borax, as it does not easily pass through unbroken skin. Considering that a) the goal is not to eat the slime, and b) the recipe calls for about 1g diluted in 20 ml of water, the use of borax in slime does not represent a realistic toxic, genotoxic, or reproductive health risk.", "Potential harm from Elmer’s Glue-All", "In the “This Talk Ain’t Cheap” post, the author linked to fact sheet about household glue poisoning from MedlinePlus (a program of the National Institutes of Health). That post explicitly stated that “most household glues, such as Elmer's Glue-All, are not poisonous.”", "All of the symptoms listed in the Facebook post, sourced from this fact sheet, concern glue that contains volatile organic compounds (Ethanol, Xylene, Light aliphatic naphtha, N-hexane, Toluene) that Elmer’s glue (or other “white glue”) does not contain.", "Potential harm from shaving cream", "To support claims that shaving cream is dangerous, the author cites a “HowStuffWorks” post titled “Are There Harmful Chemicals in Shaving Cream?” That article highlights a number of chemicals it states can cause harm, but it does so inaccurately and with misleading information:", "These ingredients (though not nitrosamines) are all listed as present in the commonly used Barbasol brand of shaving cream, but the statement of their risks as it relates to homemade slime is not accurate or largely misleading.", "The HowStuffWorks post states that “Propolene [sic] glycol is a humectant like glycerin, but unlike glycerin, it's more frequently found in antifreeze and brake fluid.” While using the term \"antifreeze\" is a popular scare tactic for those inclined to chemophobia, Propylene glycol is not toxic to humans in any relevant dose. While Propylene glycol is a mild skin irritant to some people, it is recognized as safe for both food and cosmetic use.", "With regard to Triethanolamine (TEA), that post stated \"It’s also a very controversial ingredient in the cosmetic industry because not only is it a skin irritant, but many formulas containing TEA are found to be contaminated with nitrosamines, which are linked to cancer.\"", "While TEA may also be a skin irritant to some (though clearly not enough to produce a massive epidemic of unshaved men), the jump to nitrosamines — which are unequivocally carcinogenic — is, again, misleading.", "Nitrosamines are not added to cosmetics but are instead formed when amines (a chemical commonly found in proteins) mix with a nitrosating chemical (a chemical that, generally speaking, adds a nitrate group to its chemical structure). Because nitrosamines form through natural physical processes, they occur in nature and in low quantities ubiquitously. In an effort to prevent their formation in cosmetics, governmental regulators such as the FDA and the European Union Scientific Committee on Consumer Safety have placed strict requirements to mitigate their formation and have enacted associated testing and monitoring requirements. Is it possible that there are nitrosamines in shaving cream? Yes. But if nitrosamines even in small quantities were dangerous, then one would also have to avoid, according to a 1990 review, \"Bacon, ham, frankfurters, sausage, cured meat products, poultry, fish, and fish products, cheese, beer, malt, grain, margarine, edible vegetable oils, water, air, and soil.\"", "Finally, the HowStuffWorks post discussed two sulphate compounds:", "Sodium lauryl sulphate (SLS) and sodium laureth sulphate (SLES) are two more controversial skincare ingredients. These make a great lather, but they also have a number of health implications. Lauryl mimics estrogen, which is especially problematic for women, and laureth often hosts a known carcinogen called dioxane.", "Both SLS and SLES can, like any detergent compound that removes oil from your skin, cause irritation. The claim that SLS interacts with estrogen in humans is not found in any of the 3,155 scientific articles listed on the PubChem website for the chemical, nor in any of the 306 articles in the National Institute of Health's curated list of research related to SLS’s adverse effects.", "The argument regarding dioxane is similar to the nitrosamine argument above, as the compound can introduced as an impurity during synthesis of the above sulfate compounds. Its presence in many cosmetics, as well as its carcinogenicity, are not in question. However, at concentrations found even in the most egregiously contaminated shaving creams (further diluted by other slime ingredients), it would not pose a credible health risk.", "While we cannot rank the specific personal circumstances described in the “This Talk Ain’t Cheap” post, we can say that claims of other more terrifying slime-related health concerns are not rooted in reality, so long as one is not actively eating the final product or breathing copious amounts of dry borax during its production.", "This Talk Ain’t Cheap.   \"Beware of Homemade Slime.\"\r\n    3 March 2017.", "Garabrant, D. H. et al.   \"Respiratory Effects of Borax Dust.\"\r\n    British Journal of Industrial Medicine.   December 1985.", "Toxicology Data Network.   \"Borax.\"", "Harwood, Anthony.   \"Pesticides Warning Over School Yard Slime Craze That Could Leave Children at Risk of Serious Eye Injuries and Even Fertility Problems.\"\r\n    Daily Mail.   25 February 2017.", "Hubbard, S.A.   \"Comparative Toxicology of Borates.\"\r\n    Biological Trace Element Research.   December 1998.", "Moore, John A. et al.   \"An Assessment of Boric Acid and Borax Using the IEHR Evaluative Process for Assessing Human Developmental and Reproductive Toxicity of Agents.\"\r\n    Reproductive Toxicology.   January 1997.", "Medline Plus.   \"Household Glue Poisoning.\"", "Sennebogen, Emilie.   \"Are There Harmful Chemicals in Shaving Cream?\"\r\n    HowStuffWorks. Accessed 16 March 2017.", "PubChem.   \"1,2-propanediol.\"", "European Scientific Committee on Consumer Safety .   \"Opinion on Nitrosamines and Secondary Amines in Cosmetic Products.\"\r\n    27 March 2012.", "Scanlan, R.A.   \"Formation and Occurrence of Nitrosamines in Food.\"\r\n    Cancer Research.   May 1983.", "fda.gov.   \"Cosmetics Safety Q&A: Contaminants.\"", "Ikeda, Kane, and Kenneth G. Migliorese.   \"Analysis of Nitrosamines in Cosmetics.\"\r\n    Journal of the Society of Cosmetic Chemistry.   September 1990.", "Agency for Toxic Substances and Disease Registry.   \"Toxic Substances Portal — 1,4-Dioxane.\"\r\n    April 2012.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]