["Multiple Facebook posts, for example this one published on February 18, 2019 and viewed more than 125,000 times, contains a 10 min 31 sec video of tanks, warplanes, missiles and other military hardware in action.", "The post's caption says in Hindi: \"Pakistan will not be able to sleep after seeing this might shown by the courageous Indian Army\".", "Another Facebook post, also published on February 18, 2019, contains the same caption and video, and has also been viewed 125,000 times. Multiple other posts make the same claim, for example here and here.", "A reverse image search found the video consists of several clips showing large-scale Russian military drills which were staged with Chinese troops on September 11-17, 2018.", "The exercises, called \"Vostok-18\", involved 300,000 troops and 1,000 aircraft. Here is an AFP report on the drills.", "Among the videos published on the verified Facebook page of the Russian defence ministry between September 11 and 15, 2018, are 10 different clips that have been edited together back-to-back in the misleading video.", "For example, this entire 27-second clip of a barrage of missile fire published by Russia's defence ministry on September 14, 2018 appears in the misleading video from 4 min 36 sec.", "That Russian post has a caption that says, in part: \"Watch the scenes of large-scale firing of Uragan Multiple launch rocket systems within one of the episodes of the #VOSTOK_2018 maneuvers\".", "Below is a screenshot of the same footage being used in the misleading Facebook post:", "Below is a comparison of screenshots from the misleading video (left) and the original footage released by Russia's defence ministry (right) in a composite image:", "The first 40 seconds of the misleading video, showing soldiers driving trucks and armoured vehicles, is the only section not also found on the Russian defence ministry Facebook page.", "But the same clip appears in multiple reports on the Russian drills by major international news organisations, for example here on the BBC, here on CNN and here in Time magazine, which credits the Russian defence ministry for the footage.", "A comparison of a screenshot from the BBC report and a screenshot from the misleading post can be seen in the composite image below:", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]