["One of the most common hoaxes in Africa involves job scams feeding off the high unemployment rates in some of Africa’s biggest economies.  In Nigeria, for example, there were 20.9 million unemployed people as of December 2018, according to the National Bureau of Statistics (NBS).", "These scams lure people with the promises of work, but their real purpose is to artificially inflate the number of followers on social media pages with the ultimate aim of selling these on for profit.", "In February 2019, one such post claimed that Aliko Dangote, Africa’s richest man, was recruiting 4,000 people to help build one of the world's biggest crude-oil refineries. AFP Fact Check found the job advert to be false.", "In South Africa, a Facebook page styled as a job recruitment platform also claimed to be offering employment opportunities at large, established companies in the country. AFP Fact Check debunked it here and the page has since been removed.", "Numerous Facebook pages claim to give out cash, phones or laptops to people who follow certain sets of instructions. Some of these pages impersonate wealthy public figures to lend an air of credibility.", "We have exposed several of these pages, including this one, which falsely claimed to belong to the Crown Prince of Dubai.", "Posts like this one, which has now been deleted, encourage people to send a direct message in order to win a prize like a mobile phone. Once the message is sent, an automatic response is received promising the gift will be sent provided the post is shared in other Facebook groups. We have fact-checked some of these claims here, here, and here.", "A handler of one such page, who asked not to be named, told AFP Fact Check that these pages are sold after accumulating a certain number of followers.", "The man, who graduated from Nigeria’s Ibadan University, explained that a page with 100,000 followers is worth 200,000 naira (€455). Instagram pages, however, are a third more valuable at three naira per follower, he added.", "“The reach of Facebook pages nowadays is very low. A page of one million followers on Facebook may be reaching barely 10,000 people if not managed well, because of Facebook’s latest algorithms.”", "But, said the 26-year-old, anyone who builds a Facebook or Instagram following of more than a million “will make millions in Nigeria”.", "COVID-19 palliative scams", "Other scams try to cash in on the novel coronavirus outbreak. Some claim to be giving laptops away for “pandemic education”, while others in countries like Uganda, Zambia, Nigeria and Kenya imitate government departments or their officials to promote non-existent partnership grants for businesses.", "In Uganda, a bogus Facebook page impersonated the finance ministry, while in Kenya, pages like this one claim that the government is disbursing 5,000 Kenyan Shillings ($47) to support citizens during COVID-19 lockdown. Similar false claims were uncovered by AFP Fact Check here, here and here.", "How to avoid falling prey", "You don’t need to be a digital verification specialist to spot false or misleading claims. Here are a few pointers:", "If you would like us to check a claim, you can reach out to the AFP WhatsApp line here: +33 6 32 99 52 64", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]