["Florida Gov. Ron DeSantis speaks during a roundtable discussion with Miami-Dade County mayors during the coronavirus pandemic, Tuesday, July 14, 2020, in Miami. (AP)", "The claim is accurate on one measure — the number of COVID-19 deaths per capita for the duration of the outbreak.", "But the claim is that Florida is doing well now, when in fact deaths are on the rise.", "A Facebook post that argues that Florida compares favorably with New Jersey and New York in the rate of COVID-19 deaths has a point.", "But it’s misleading, and there is much more to the story.", "\"This is a time-sensitive and difficult metric,\" Dr. Myron Cohen, an epidemiologist and director of Institute for Global Health and Infectious Diseases at the University of North Carolina, told PolitiFact.", "\"You do not know the true denominator — death rate versus number of people infected — and you cannot see forward. Any discussions such as these lack proper context.\"", "The July 26 post, from a Facebook user with more than 1.4 million followers, says:", "\"Despite all the fake, negative media hype, as of posting this the Covid death count per 1 million population:", "\"NJ: 1,787", "NY: 1,680", "Florida: 273", "\"Florida is doing over 5 TIMES better in deaths, yet media tells the opposite story because they protect Democrats.\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The Facebook user, saying the media highlights that Florida’s COVID-19 cases are surging, cited a table of Worldometer data.", "When we checked the site’s state data on July 29, we found that Florida’s death rate was one-sixth of New Jersey’s and New York’s. The same was true on other databases we checked, including one from Johns Hopkins University.", "But it’s a limited measure, bearing on a state that became a hotspot well after New York and New Jersey.", "Here’s what news reports said about Florida’s record-breaking coronavirus surge in the days before the post:", "Florida had the highest single-day total of new cases by any state, with more than 15,000 new infections.", "There were 872 deaths in one week, the highest weekly total in the Sunshine State during the outbreak.", "Florida was among the 21 states with outbreaks serious enough to place them in the \"red zone,\" according to a federal report.", "For a larger perspective, among the 20 countries currently most affected by COVID-19, the United States has the fourth-highest death rate per 100,000 people, behind the United Kingdom, Peru and Chile, according to Johns Hopkins University.", "Timing is a big reason why the statistic cited in the Facebook post is misleading.", "New Jersey and New York were hit hard early in the pandemic, and Florida was hit later.", "\"One has to wait until all is over to really see how ‘well’ states have been doing,\" Dr. Werner Bischoff, professor of infectious diseases at Wake Forest University, told PolitiFact.", "As of July 30, Florida recorded 988 COVID-19 deaths in the previous seven days, compared with 91 in New Jersey and 114 in New York, according to the New York Times.", "Death counts and rates are lagging indicators, which means they can confirm a trend after the fact, but can’t necessarily predict the course of the outbreak.", "\"While cases started to increase exponentially in Florida in June, deaths only started to increase exponentially in July,\" Boston University global health professor Brooke Nichols told PolitiFact. \"The only way to compare these types of death rates meaningfully would be once we are several months after Florida’s first wave — and compare that to several months after the first wave in New York and New Jersey,\" she said.", "Nichols gave an example. On April 4, when the first wave of cases in New York peaked, the state had 237 deaths per 1 million population. Using July 16 as a peak in cases for Florida, the death rate was 223 deaths per million.", "\"Those two numbers are eerily similar, and a foreshadow of what’s to come in Florida,\" Nichols said.", "The Facebook post said \"Florida is doing over 5 TIMES better in deaths\" than New York and New Jersey. For a statement that contains only an element of truth, our ruling is Mostly False.", "Facebook, post (archived here), July 26, 2020", "Worldometer, Coronavirus data, July 29, 2020", "Worldometer, Coronavirus state data, July 29, 2020", "Centers for Disease Control and Prevention, \"United States COVID-19 Cases and Deaths by State,\" July 29, 2020", "Becker’s Hospital Review, \"US coronavirus death rates by state,\" July 29, 2020", "Email, Dr. Myron Cohen, an epidemiologist and director of Institute for Global Health and Infectious Diseases at the University of North Carolina, July 30, 2020", "Email, Boston University global health professor Brooke Nichols, July 29, 2020", "Statista, \"Death rates from coronavirus (COVID-19) in the United States as of July 29, 2020, by state\"", "Johns Hopkins University, \"Cases, Deaths, and Testing in All 50 States,\" July 29, 2020", "Email, Dr. Werner Bischoff, professor of infectious diseases at Wake Forest University, July 30, 2020", "Lead Stories, \"Fact Check: Florida Is NOT Doing 'Five Times Better In Deaths' Than New York And New Jersey,\" July 30, 2020", "New York Times, \"Coronavirus in the U.S.: Latest Map and Case Count,\" July 30, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]