["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "U.S. Sen. Ron Johnson, R-Wis., speaks during a meeting of the Senate Permanent Subcommittee on Investigations hearing on June 17, 2014. (Bloomberg photo)", "U.S. Sen. Ron Johnson was out and about in June 2014.", "The Wisconsin Republican appeared on CNBC, on CNN and on a nationally syndicated radio talk show. He was quoted in the Huffington Post and in a Wall Street Journal blog, and featured in articles on national political websites such as Real Clear Politics and Salon. His name appeared in 10 articles and letters to the editor in the Milwaukee Journal Sentinel.", "So, Johnson, a political newcomer when he was elected in November 2010, is pretty high-profile, right?", "Not according to the Wisconsin Democratic Party.", "On June 12, 2014, the party posted this on its Facebook page:", "\"He’s been in office nearly four years now, but 40% of Wisconsinites don't know who Ron Johnson is.\"", "Total exaggeration?", "Not totally.", "Marquette poll", "The party cited as evidence a Marquette Law School Poll of registered voters in Wisconsin from March 2014, the most recent one to include such a question about Johnson.", "We took a look at the script used by the poll takers. The seventh question was preceded by this statement:", "\"I’m going to read you a list of people and organizations. Please tell me if you have a favorable or unfavorable opinion of each of them or if you haven't heard enough about (him/her) yet to have an opinion. The first name is Barack Obama.\"", "The interviewer continued with the same question about several Wisconsin politicians, including Johnson and U.S. Sen. Tammy Baldwin (D-Wis.).", "The interviewer would record the answer as Favorable, Unfavorable, Haven’t Heard Enough, Don’t Know or Refused.", "The figures for Johnson, as summarized in the results section of the poll data:", "Favorable", "29 percent", "Unfavorable", "27 percent", "Not Heard Enough", "40 percent", "Don’t Know", "4 percent", "Refused", "0", "So, 40 percent said they didn’t know Johnson well enough to have an opinion of him.", "(The 4 percent represented people who responded by saying don’t know, rather than saying they didn’t know enough to have an opinion.)", "In comparison, 27 percent of those polled said they had not heard enough about Baldwin to have an opinion of her and another 3percent said they didn’t know if they had an opinion. Baldwin was elected to the Senate two years after Johnson, but previously served 14 years in Congress and has gained national attention for being the first openly gay person elected to the Senate.", "It’s worth nothing that another Wisconsin poll also showed a relatively high percentage of residents weren’t sure how they felt about Johnson. But it also did not ask respondents if they knew who Johnson is; rather, the question was about job approval.", "In the latest poll by the St. Norbert College Strategic Research Institute, done in late March and early April of 2014, the interviewer said: \"Now I’d like to ask you about some major political figures and your opinion on how well they are doing their job. For each of the following, please tell me whether you strongly approve, approve, disapprove, or strongly disapprove with the way the person is doing their job.\"", "On Johnson, 31 percent of the respondents said they weren’t sure, compared to 21 percent for Baldwin.", "Perspective", "For his part, Marquette poll director Charles Franklin told us there’s no way to know from his poll what percentage of the respondents \"don’t know who Johnson is.\"", "That question was not asked.", "At the same time, Franklin said, the favorable/unfavorable question used by the Marquette poll is good as a general measure of the public’s awareness of, or familiarity with, a person. And the Democratic Party’s claim about Johnson, he said, \"has a little bit of hyperbole, but it’s not a wildly misleading reading\" of the results.", "We checked with three other experts: David Wegge of the St. Norbert institute, which is based at St. Norbert University near Green Bay; and John Stevenson and Chad Kniss of the University of Wisconsin Survey Center, which does surveys for the UW community and other organizations and formerly did political polling for the Badger Poll. They agreed the Democratic Party's claim is not totally accurate, but not way off, either.", "If you’re surprised that 40 percent of the respondents didn’t feel they had heard enough about a nearly four-year U.S. senator to have an opinion of him, Wegge noted that St. Norbert’s Wisconsin surveys, which date back to 1984, show U.S. senators have less name recognition than governors. Senators are generally in the state less, get less Wisconsin media coverage and, of course, deal more with national than state issues, he said.", "Indeed, even near the end of Democrat Herb Kohl’s 24 years in the U.S. Senate, many Wisconsinites said they didn’t know enough about him to have an opinion, according to an April 2011 St. Norbert poll.", "Marquette’s Franklin added: \"A lot of people are not so intensely engaged in politics that they follow these names day in and day out and form strong opinions about them outside of a campaign.\"", "That was borne out in two polls taken in the weeks before Johnson was elected -- the vast majority of registered voters said they had an opinion when asked by Marist College if they had a favorable or unfavorable impression of Johnson. In late September 2010, only 19 percent said they were unsure of their opinion of Johnson or hadn’t heard of him; by late October 2010, the figure was 18 percent.", "It doesn't stand to reason that nearly four years after Johnson's election, 40 percent of Wisconsinites don't even know who he is.", "Our rating", "The state Democratic Party said: \"He’s been in office nearly four years now, but 40% of Wisconsinites don't know who Ron Johnson is.\"", "In the most recent statewide poll that asked about Johnson, 40 percent of registered voters said they didn’t know him well enough to have an opinion about him and another 4 percent said they didn’t know if they had an opinion of him. But that falls short of evidence that 40 percent don't even know who he is.", "We rate the claim Mostly False.", "To comment on this item, go to the Milwaukee Journal Sentinel website.", "Wisconsin Democratic Party, Facebook page, post about U.S. Sen. Ron Johnson, June 12, 2014", "Email interview, Wisconsin Democratic Party communications director Melissa Baldauff, June 25, 2014", "Marquette Law School Poll, question 11, March 20-23, 2014", "Marquette Law School Poll, methodology statement, March 20-23, 2014", "Marquette Law School Poll, script, March 20-23, 2014", "Marquette Law School Poll, results, March 20-23, 2014", "Interview, Marquette University Law School professor of law and public policy and Marquette Law School Poll director Charles Franklin, June 25, 2014", "Email interview, U.S. Sen. Ron Johnson policy adviser Patrick McIlheran, June 25, 2014", "Interview, St. Norbert College Strategic Research Institute executive director David Wegge, June 26, 2014", "E-mail interview, University of Wisconsin Survey Center associate director John Stevenson, June 26, 2014", "E-mail interview, University of Wisconsin Survey Center associate director John Stevenson, June 26, 2014", "E-mail interview, University of Wisconsin Survey Center senior project director Chad Kniss, June 26, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]