["By Robert Farley", "Posted on May 18, 2016", "An ad from a super PAC attacking Democratic Senate candidate Ted Strickland in Ohio misleads on several counts:", "The ad comes from Fighting for Ohio Fund, which backs Strickland’s Republican opponent, incumbent Sen. Rob Portman. It attacks Strickland on his record as Ohio governor from January 2007 to January 2011.", "“Ted Strickland on his record,” the ad’s narrator begins, and then the ad cuts to a clip of Strickland saying, “My record is mixed and spotty. And I can be criticized for that.”", "The ad’s narrator then states, “350,000 jobs lost while Strickland was governor. Jobs lost to Kentucky, Indiana, even to Michigan. Plus $800 million in tax increases.”", "The ad then replays Strickland saying, “My record is mixed and spotty. And I can be criticized for that” — to which the ad’s narrator quips, “Well, at least he’s got that right.”", "Let’s start with the Strickland quote, which is lifted out of context, and has nothing to do with taxes, jobs or even Strickland’s record more generally — as the ad suggests. Rather, it was narrowly referring to his position on gun control.", "The quote in question comes from an editorial board interview at the Cleveland Plain Dealer on Feb. 25. And the context makes clear Strickland was referring only to his position on gun control.", "“Has my position changed over time? It has,” Strickland said. “Can people criticize me for that? Absolutely. You’re not going to find me out there saying my records with guns is not a legitimate … It’s one of many issues that people will look at and make a decision about me and about this race and so on and so forth.”", "“But my position has changed,” Strickland said. “I do believe that we need comprehensive background checks.”", "Strickland’s stance on guns has changed.", "Strickland, who in 2010 boasted an A+ rating from the NRA, voted against the 1994 crime bill, which included an assault weapons ban. In 1993, he voted against the Brady Bill, which featured a requirement for background checks for gun purchases from licensed dealers. And in 2003, he voted in favor of the Protection of Lawful Commerce in Arms Act of 2005, which provided some protections for licensed manufacturers, dealers, sellers of firearms or ammunition, and trade associations from civil lawsuits resulting from the misuse of firearms or ammunition.", "But Strickland says he changed his stance after the Sandy Hook shooting at an elementary school in 2012.", "His campaign website now says he supports “commonsense and effective ideas to reduce gun violence.” He says, for example, that he would have supported the Toomey-Manchin amendment that would have expanded background checks to private sales by unlicensed individuals at gun shows and over the Internet (with some exceptions) — an amendment that was adamantly opposed by the NRA. Strickland’s website also says he supports legislation that would not allow gun manufacturers and dealers to “hide behind a legal shield that gives them protections from liability enjoyed by virtually no other industry.”", "In his interview with the editorial board at the Cleveland Plain Dealer, Strickland said he gave up his membership in the NRA about five or six years ago.", "“My record is mixed and spotty and I can be criticized for that,” he said.", "That’s the context of the quote used in the attack ad.", "Jen Detwiler of Steiner Public Relations in Columbus, Ohio, which is handling media questions for Fighting for Ohio Fund, told us, “Ted Strickland’s words speak for themselves.”", "Detwiler said, “The spot makes no claim that Strickland’s words refer to jobs or tax increases. He spoke those words, jobs were lost to surrounding states, and taxes increased. Those facts are not disputed.”", "Those facts about the increased taxes are disputed, as we will explain. And while Strickland did, in fact, utter those words, the ad misleadingly makes it seem like Strickland’s “mixed and spotty” comment refers either to his record in general, or to taxes and jobs, the two issues raised in the ad, and bookmarked by Strickland’s quote.", "The ad misfires with its claim about “$800 million in tax increases” under Strickland. That’s based on Strickland postponing for one year the last year of a planned five-year tax decrease in order to balance the state budget. No one paid higher income tax rates during that freeze year; they just didn’t get the scheduled tax cut.", "Here’s the brief history: In 2004, then Gov. Bob Taft signed a multiyear plan to reduce business and individual income taxes. The income tax rate cuts were scheduled to be phased in over five years, with income tax rates ending up 21 percent lower than they were in 2004.", "The fifth and final year of the phased-in plan called for a 4.2 percent cut in the income tax rate. But Strickland, facing an $851 million budget shortfall, decided in late 2009 to postpone that cut for a year.", "Some Strickland opponents — including Republican John Kasich, who went on to defeat Strickland in the 2010 gubernatorial election — said Strickland’s decision amounted to raising taxes. But Ohioans didn’t pay more in 2009 than they did in 2008. In fact, the Toledo Blade noted in an editorial that some paid less.", "Toledo Blade editorial, Oct. 5, 2009: The advantage of putting off the final phase of the tax cut is that it will be hardly noticed. Ohioans won’t pay more for 2009 than 2008 because the indexed personal exemption is due to increase from its current $1,500 to $1,550. In some case, taxpayers might actually owe less.", "The ad cites an October 2010 fact-checking article by PolitiFact Ohio that rated as “Mostly True” Kasich’s claim that Strickland “raised taxes last year to the tune of $840 million.” It’s true that Ohioans got a planned tax cut taken away from them for a year. But that’s not the same as a tax increase. Besides, the PolitiFact analysis was a one-year snapshot. It did not consider the net impact on income taxes under Strickland’s governorship. The article also noted that there were “no guarantees” the freeze would be lifted and that promised tax cuts would be delivered the following year. But that final income tax rate cut did happen, and went into effect in January 2011, just before Strickland left office.", "In all, the 2005 tax plan resulted in a 21 percent income tax rate decrease. But not all of that was during Strickland’s time in office. In the years Strickland was governor, there was a roughly 13 percent reduction in income tax rates for taxpayers at every income level, according to data from the Ohio Department of Taxation. That resulted in a cumulative decrease of nearly $4 billion in individual income taxes paid during Strickland’s time in office.", "Finally, the ad claims there were “350,000 jobs lost while Strickland was governor. Jobs lost to Kentucky, Indiana, even to Michigan.” Ohio lost 367,700 jobs between January 2007 and January 2011, according to the Bureau of Labor Statistics.", "But keep in mind, Strickland’s time in office included the Great Recession, which lasted from December 2007 to June 2009. Most economic experts caution not to place too much blame or praise on governors for state jobs statistics, because those statistics are largely driven by national and regional job trends.", "Nationally, the U.S. lost 4.8 percent of its jobs between January 2007 and January 2011 — Strickland’s time in office, and Ohio fared worse than that, losing about 6.8 percent of its jobs. Manufacturing jobs were hit particularly hard during the recession, and states with high numbers of manufacturing jobs, like Ohio, generally fared worse in the recession.", "As for Ohio’s neighbors mentioned in the ad, Indiana and Kentucky both saw lower rates of job loss than Ohio did during Strickland’s time in office (5.6 percent and 4.6 percent, respectively). But Michigan had a significantly higher rate of job loss, 8.8 percent.", "https://www.sharethefacts.co/share/c1b5cf95-0ef6-493c-84a6-20b6c236e3eb", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]