["On March 24, Prime Minister Narendra Modi announced a 21-day lockdown to address the COVID-19 pandemic. All essential services will continue to be functional. The list of essential services, as per the Ministry of Home Affairs, remains unchanged since the March 22 ‘Janata Curfew’.", "Sadhvi Deva Thakur, Director at Varanasi-based Deva India Foundation shared (archive link) an image of a mother in a transparent protective suit. In the photo, the mother is holding a baby. Thakur wrote, “Do you have any words? That’s why I say “stay at home” … this picture truly makes one cry. (Translated from कोई शब्द है आपके पास ?? इसी लिए कहता हूँ “घर में रहो” बस… सच मे रुला देने वाली तस्वीर है ये.)” This post was shared over 450 times.", "The viral image was shared with the same claim by several users on Twitter and Facebook.", "Alt News performed a reverse image search on Google and found that The Magnum Photos library had a copy of the viral image. The photograph was clicked by Burt Glinn at Fred Hutchinson Cancer Center, Washington in 1985. According to the caption, “Infant inside Laminar Air Flow Room protection from infection. The child has been irradiated prior to marrow transplant”.", "“Total-body irradiation has continued to play a pivotal role in the conditioning regimens for bone marrow transplant, which has become a common modality in the treatment of both acute and chronic leukaemias and myelodysplastic disorders, as well as relapsed Hodgkins and non-Hodgkins lymphomas,” as per a report available on Cancer Network by MJH Life Sciences at New Jersey, USA.", "The College of Medicine, University of Florida explains the logic behind total body irradiation.", "Glinn’s photograph from 1985 shows a baby who has undergone irradiation prior to bone marrow transplant. The woman, probably the mother, is wearing protective gear because the baby’s immune system would be suppressed after the irradiation process and will easily catch the infection.", "Thus the viral image is not related to coronavirus and the social media claim is false.", "Note: The number of positive cases of the novel coronavirus in India has exceeded 600. This has caused the government to impose a complete restriction on movement apart from essential services. Globally, more than 4 lakh confirmed cases and over 19,000 deaths have been reported. There is a growing sense of panic among citizens, causing them to fall for a variety of online misinformation – misleading images and videos rousing fear or medical misinformation promoting pseudoscience and invalid treatments. While your intentions may be pure, misinformation, spread especially during a global pandemic, can take lives. We request our readers to practice caution and not forward unverified messages on WhatsApp and other social media platforms.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]