["By D'Angelo Gore", "Posted on August 5, 2020", "In response to a question about his tweet to “all of the people living their Suburban Lifestyle Dream,” President Donald Trump suggested that an Obama administration fair housing rule required the construction of low-income homes in suburban areas. It doesn’t.", "“So we ended a rule that was a very horrible rule for people in suburbia — in the suburbs,” Trump said in July 31 remarks from the White House South Lawn. “It’s a rule that, basically, you build low-income housing and you build other forms of housing — also having to do with zoning — and destroy people that have lived in communities in suburbia.”", "Experts on regulatory processes and community development told us that the Department of Housing and Urban Development’s 2015 final rule on “Affirmatively Furthering Fair Housing,” implemented under then-President Barack Obama, did not mandate either low-income housing or rezoning.", "In its published rule, HUD said of the regulation: “This rule does not impose any land use decisions or zoning laws on any local government.”", "But on July 29, Trump wrote on Twitter: “I am happy to inform all of the people living their Suburban Lifestyle Dream that you will no longer be bothered or financially hurt by having low income housing built in your neighborhood … Your housing prices will go up based on the market, and crime will go down. I have rescinded the [Barack] Obama-[Joe] Biden AFFH Rule. Enjoy!”", "Two days later, as Trump prepared to board Marine One, the president had this exchange with a reporter who asked about his tweet:", "Reporter, July 31: On the “suburban lifestyle dream,” why would low-income housing in the suburbs destroy the “suburban lifestyle dream”?", "Trump: So we ended a rule that was a very horrible rule for people in suburbia — in the suburbs. And that rule has been a very unfair rule for a long time and it was going to be made a lot worse by [presumptive Democratic presidential nominee Joe] Biden and [Sen.] Cory Booker.", "It’s a rule that, basically, you build low-income housing and you build other forms of housing — also having to do with zoning — and destroy people that have lived in communities in suburbia. For years, they’ve lived there, and they want to destroy their lives and destroy what they have. And it’s been going on for a long time. I ended the rule, so people living in the suburbs will no longer have that problem.", "We asked the White House about the president’s comments, but haven’t received a response.", "Trump appeared to be referring to HUD Secretary Ben Carson’s July 23 announcement that the department “will ultimately terminate the Obama Administration’s Affirmatively Furthering Fair Housing (AFFH) regulation issued in 2015.” Carson said the rule, which he proposed changing in January, was found to be “unworkable” and “ultimately a waste of time.”", "It’s also unclear whether the rule had any impact at all, as Carson had suspended the rule’s requirements in early 2018.", "The 2015 rule was intended to reinforce a clause of the Fair Housing Act that requires HUD and other federal agencies to “affirmatively” further fair housing in “their programs and activities relating to housing and urban development.” The 1968 law prohibits discrimination in housing.", "As the American Bar Association noted in November 2019: “Although this AFFH provision has been part of the Fair Housing Act for 50 years, historically HUD permitted local jurisdictions to largely ignore that duty even as those jurisdictions collected billions of dollars in federal grants annually for housing and community development.”", "Before the 2015 rule, HUD asked jurisdictions to do an “analysis of impediments” to fair housing and encouraged, but didn’t require, jurisdictions to report the findings and subsequent actions taken to government officials, according to a June 2018 report by the nonpartisan Congressional Research Service.", "The Obama-era rule established a more structured reporting process by which all jurisdictions that receive funding from HUD would use HUD-provided data and tools to develop a plan to address fair housing issues in their communities. Those jurisdictions were required to complete a new “Assessment of Fair Housing” that would have to be reviewed and approved by HUD.", "A HUD fact sheet at the time defined “affirmatively furthering fair housing” as “taking meaningful actions, in addition to combating discrimination, that overcome patterns of segregation and foster inclusive communities free from barriers that restrict access to opportunity based on protected characteristics.”", "HUD said the rule was made partly in response to a 2010 report from the nonpartisan Government Accountability Office.", "The GAO found that some jurisdictions getting HUD funding were either not preparing the fair housing reports that were already required, or were not regularly updating their reports according to HUD guidance. The GAO recommended HUD issue a regulation requiring HUD funding recipients to submit — in a special format — detailed analyses of impediments to fair housing, such as restrictive zoning or segregated housing.", "What the rule didn’t do was require those getting HUD money to build low-income housing in the suburbs — or anywhere else — as Trump’s remarks implied.", "“No, it emphatically does not require low-income housing to be built in suburban areas,” Cary Coglianese, a professor at the University of Pennsylvania Carey Law School and director of the Penn Program on Regulation, told us in an email. “It also does not impose federal control over local zoning laws. Rather, it clarified a planning process that local governments already had a statutory obligation to undertake in connection with the receipt of federal HUD funding.”", "Indeed, Obama’s HUD made that clear in the text of its regulation, which states: “While the statutory duty to affirmatively further fair housing requires program participants to take actions to affirmatively further fair housing, this final rule (as was the case in the proposed rule) does not mandate specific outcomes for the planning process. Instead, recognizing the importance of local decision making, the new approach establishes basic parameters to help guide public sector housing and community development planning and investment decisions in being better informed about fair housing concerns and consequently help program participants to be better positioned to fulfill their obligation to affirmatively further fair housing.”", "In response to public comments that claimed the new rule would allow the federal government to dictate zoning, rents and the placement of infrastructure to local governments, HUD also wrote: “This rule does not impose any land use decisions or zoning laws on any local government. Rather, the rule requires HUD program participants to perform an assessment of land use decisions and zoning to evaluate their possible impact on fair housing choice. This assessment must be consistent with fair housing and civil rights requirements, which do apply nondiscrimination requirements to the land use and zoning process. However, this rule does not change those existing requirements under fair housing and civil rights law.”", "It is true that some “jurisdictions might identify” low-income housing or zoning reform “as remedies,” Robert Silverman, a professor in the University at Buffalo’s urban and regional planning department, told us in an email. But there could be many methods used to address fair housing issues, he said.", "“It would depend on the nature of an impediment,” Silverman explained. “For instance, if an impediment involved discrimination in the mortgage process or landlord discrimination, different remedies would be involved, etc.”", "As for Trump’s claim that “it’s been going on for a long time,” it’s not clear what he meant.", "The rule promulgated during the Obama administration went into effect in August 2015. However, in early 2018, the Carson-led HUD suspended the requirement for local governments to submit, and for HUD to review, assessments of fair housing filed under the regulation.", "“Before the process could get fully up and running, the Trump administration suspended the rule,” Silverman said. “This meant that AFH reports were put on hold until 2024 and the assessment tool that would be used to do the reports was removed from HUD’s website. So, for all intents and purposes, the Trump administration blocked the rule from being implemented, impediments to fair housing remain undocumented and detected, and no formal remedies to them are being pursued under the suspended AFFH rule.”", "So, the rule that Trump criticized didn’t mandate low-income housing, and it was essentially ended before it had a chance to have a measurable impact.", "Editor’s Note: FactCheck.org does not accept advertising. We rely on grants and individual donations from people like you. Please consider a donation. Credit card donations may be made through our “Donate” page. If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, 202 S. 36th St., Philadelphia, PA 19104", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]