["By Angelo Fichera", "Posted on April 4, 2019", "A falsehood resurrected on Facebook claims that the late Sen. John McCain received a pardon from President Richard Nixon. He did not.", "When Sen. John McCain died last year, he was widely praised by military officials for his service to the U.S. — notably for his time in the Navy, during which the lieutenant commander was imprisoned in Vietnam for nearly five-and-a-half years.", "Secretary of the Navy Richard V. Spencer, for example, said in a statement that McCain was “renowned as a hero” and that “from the Naval Academy to flight school and throughout his time as a prisoner of war in Vietnam, McCain displayed unfailing honor and duty to country.”", "But attempts to rewrite history about the late Arizona Republican have continued months after his death. A falsehood that recently reappeared on Facebook suggests McCain had committed “treason” during his service.", "“FACT: If not for a pardon from President Richard Nixon, John McCain would have been court martialed for treason,” text in the image reads, referencing the process through which military members are charged and tried for violations of military law.", "The image, which appears to be a screenshot, closely mirrors a more detailed February 2017 post on a Facebook page called Bikers for America, which has tens of thousands of followers.", "The pardon claim is easily disproved: A full list of pardons by Nixon is available on the Department of Justice website and there is no mention of McCain.", "McCain was instead honored for his service: The Navy, for example, awarded him the Silver Star for his “conspicuous gallantry” while he was imprisoned. He also received the Distinguished Flying Cross, three Bronze Stars, two Purple Hearts and the Prisoner-of-War medal.", "The black-and-white image of Nixon and McCain shaking hands in the bogus post matches an Associated Press photo that was taken at White House reception “honoring former Vietnam prisoners of war” in May 1973, according to the Richard Nixon Presidential Library and Museum. The National Archives and Records Administration also has a color photo of the same encounter.", "The falsehood tracks with other efforts to sully McCain’s military record with erroneous accounts: Within days of his death we (again) debunked an erroneous claim that McCain was responsible for a 1967 accident that left more than 100 sailors dead. He wasn’t.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on the social media network.", "Faas, Horst. “AP WAS THERE: John McCain released after 5½ years as a POW.” Associated Press. 27 Aug 2018.", "Jackson, Brooks. “McCain’s Plane Crashes.” FactCheck.org. 5 Sept 2008.", "“John Sidney McCain.” The Hall of Valor Project. Military Times. Accessed 4 Apr 2019.", "“Pardons granted by President Richard Nixon (1969-1974).” Office of the Pardon Attorney, U.S. Department of Justice. 5 Jul 2017.", "“President Richard Nixon’s Daily Diary, May 16-31, 1973.” Richard Nixon Presidential Library and Museum. Accessed 1 Apr 2019.", "“U.S. Navy Statements on Passing of Sen. John McCain.” Press release, U.S. Navy. 25 Aug 2018.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]