["About this rating", "The idea that former U.S. President Donald Trump was somehow compromised by the Russian government is not a new one. His single term was clouded by the fact that U.S. intelligence agencies concluded that the Russian government interfered in the 2016 presidential campaign in an effort to help Trump win.", "These accusations got new legs with the Jan. 26, 2021, publication of the book \"American Kompromat\" by journalist Craig Unger. In the book, Unger cites ex-KGB officer Yuri Shvets in making the case that Trump's relationship with the Russian government started decades before he became president.", "Shvets spoke to The Guardian in an interview published on Jan. 29, 2021, and made a number of allegations stemming from his time working for the KGB, the Russian intelligence agency under what was then the Soviet Union, including that Russian intelligence gained an interest in Trump as far back as 1977, viewing Trump as an exploitable target.", "\"The feeling was that he was extremely vulnerable intellectually, and psychologically, and he was prone to flattery,\" Shvets told the Guardian. Around the first time Trump considered running for president, in 1987, and after visiting Moscow with his first wife Ivana, he purchased full-page ads in The New York Times, The Washington Post, and the Boston Globe, expressing perspectives similar to ones he later espoused while president — namely disparaging key U.S. alliances aimed at holding Russian geopolitical power in check. From the Guardian piece:", "The ad offered some highly unorthodox opinions in Ronald Reagan’s cold war America, accusing ally Japan of exploiting the US and expressing scepticism about US participation in Nato. It took the form of an open letter to the American people “on why America should stop paying to defend countries that can afford to defend themselves”.", "The bizarre intervention was cause for astonishment and jubilation in Russia. A few days later Shvets, who had returned home by now, was at the headquarters of the KGB’s first chief directorate in Yasenevo when he received a cable celebrating the ad as a successful “active measure” executed by a new KGB asset.", "Throughout his presidency and multiple U.S. government-led investigations into the subject, Trump denied allegations of involvement with the Kremlin. \"NO COLLUSION, NO OBSTRUCTION, TOTAL EXONERATION. DEMOCRAT WITCH HUNT!\" he tweeted in July 2019.", "Nevertheless, such accusations continued to circulate, in part due to Trump's own actions in his last days in office, which included downplaying or even contradicting his own administration's revelations that Russia was the likely culprit behind a major hack of U.S. government agency computer systems.", "Also, Trump's comments from the past prompted wide speculation about his relationship with Russia, including boastful comments in which Trump appeared to be laboring under the impression that Russian President Vladimir Putin had taken favorable notice of him. In 2013, before he was president, Trump was asked by an MSNBC journalist while in Moscow for the Miss Universe pageant whether he had a relationship with Putin, Trump stated:", "\"I do have a relationship and I can tell you that he’s very interested in what we’re doing here today. He’s probably very interested in what you and I are saying today, and I’m sure he’s going to be seeing it in some form.”", "When he traveled to Helsinki to personally meet Putin in 2018, Trump sided with the Russian president, who denied Russia had interfered in the 2016 U.S. presidential election, against American intelligence agencies that had concluded the Kremlin had done so in an effort to help Trump win.", "In a book review about \"American Kompromat,\" John Sipher, a retired member of the CIA's clandestine services, concluded that the book doesn't necessarily reveal anything that was previously unknown about Trump, who has long been a public figure and whose activities have been widely covered for years. It \"reminds us that there is still much left to learn,\" Sipher wrote.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]