["About this rating", "In late December 2020, Snopes readers asked about a picture circulating on social media with captions falsely stating that it showed U.S. Supreme Court Chief Justice John Roberts seated snuggly next to Ghislaine Maxwell, a close associate of disgraced financier and convicted sex offender Jeffrey Epstein.", "Here's a version of the photograph circulating on social media:", "But the man on the right with Maxwell isn't Roberts but French modeling agent Jean-Luc Brunel.", "Brunel, like Maxwell, is facing criminal charges related to Epstein's alleged child-trafficking operation, in which young girls were preyed upon by some of the world's most powerful people. French prosecutors charged Brunel with rape of minors and suspect him of arranging \"accommodation of young girls or young women on behalf of Jeffrey Epstein.\" He was arrested on Dec. 19, 2020, at an airport in Paris.", "The picture of Maxwell and Brunel has been published by British tabloid Daily Mail and the blog Fashion Industry Broadcast. The New York Post published a similar photograph of Brunel and Maxwell that shows they had a close relationship.", "Convicted sex offender Epstein died in jail in August 2019 while awaiting trial on more charges related to child sex trafficking. Before his fall, Epstein and Maxwell's circle of associations included celebrities and politicians.", "Roberts has been the target of online disinformation since the U.S. Supreme Court threw out a lawsuit spearheaded by Texas Attorney General Ken Paxton that sought to overturn the results of the November 2020 presidential election, which U.S. President Donald Trump lost.", "Trump and his supporters have waged an aggressive disinformation campaign claiming falsely that the election was beset by widespread fraud.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]