["“Is there anyone here who has not heard the name of Coca-Cola company? Has everyone heard of it? Please tell me who started Coca-Cola? Does anyone know? I will tell you who he was. The person who started the Coca-Cola company was a lemonade seller. He used to sell lemonade in America, he used to mix sugar in water. His experience and talent was recognised. He was funded and the Coca-Cola company came into existence” (translated). This is what Congress President Rahul Gandhi said at the party’s national OBC convention in Delhi on June 11. Attacking the Modi government for failing to provide opportunities to skilled members of the OBC community, Gandhi referred to the Coca-Cola company whose founder, he claimed, was a ‘shikanji’ seller in the USA. ‘Shikanji’ is similar to lemon juice and is typically enjoyed during summer in North India.", "#WATCH Congress President Rahul Gandhi talks about origins of the Coca-Cola & McDonald’s company, says, “Coca-Cola company ko shuru karne wala ek shikanji bechne wala vyakti tha…” #Delhi pic.twitter.com/MATnaR734J", "— ANI (@ANI) June 11, 2018", "The Congress president’s statement expectedly became the butt of jokes on Twitter, with many posting memes and #AccordingToRahulGandhi trending on the social media platform.", "A mere Wikipedia search reveals that the founder of Coca-Cola was a pharmacist named John Stith Pemberton from Atlanta, Georgia. In 1865, Pemberton, also a lieutenant colonel in the American army, suffered a saber wound during the Battle of Columbus and became addicted to morphine after he started using it as a painkiller. He did not invent the famous aerated drink to become a rich businessman, as claimed by Gandhi, but created it to cure his morphine addiction.", "An article in TIME magazine says he formulated a brew – Pemberton’s French Wine Coca that included kola nut and coca wine – to cure his ailment. But as Atlanta introduced an alcohol prohibition law in 1886, he reformulated the brew without alcohol and named it Coca-Cola. Pemberton, who is described as a ‘failed pharmacist’ in a documentary on Coca-Cola’s history available on YouTube, had now begun selling his formula in Georgia’s pharmacies.", "When Coca-Cola was first marketed in 1886, it was pitched as a nerve tonic that relieves exhaustion.", "Rahul Gandhi wished to create an image of a humble lemonade seller who rose to prosperity caused by launching Coca-Cola. But sales figures of the time, published in the history section of the brand’s official website, show that the first servings of Coca‑Cola were sold for 5 cents per glass. In the first year, an average of nine servings of Coca-Cola was sold per day in Atlanta. The company eventually emerged as a global giant and is ranked among the most valuable brands in the world today, with annual servings of 1.9 billion daily according to the firm.", "However, Pemberton did not live to see this transformation. He died two years after creating the sparkling beverage. Prior to his death due to deteriorating health, the business suffered losses and Pemberton was forced to sell his last remaining stake to different parties. Majority of the business was sold to an Atlanta businessman, Asa G Chandler, who was the main person behind Coca-Cola’s popularity beyond the city. In fact, the company’s official archivist Philip Mooney said in Coca-Cola’s history document that although Pemberton created the beverage, the product would not have achieved great success had he remained the man behind it.", "Rahul Gandhi’s claims fall short of his expected intentions. However, the misinformed statement about Coca-Cola wasn’t the only time eyebrows were raised during his speech.", "Gandhi also cited the example of American fast-food chain McDonald’s, saying that it was started by a “dhabawala”. The Congress President though gets the benefit of doubt on this one. The burger chain was started by Patrick McDonald in 1937 as a food stand near Monrovia airport, California. In 1940, his sons (Mac and Dick) moved to San Bernardino, California and renamed it to ‘McDonald’s Bar-B-Que’. The brothers introduced its simple menu of burgers, fries and cold drinks in 1948 before Ray Kroc finalised a franchise agreement with the McDonald brothers and inaugurated the first franchise of the brand in Illinois in 1955. That same year, Kroc launched McDonald’s Corporation, eventually buying out the brothers in 1961.", "As the president of India’s oldest political party, Rahul Gandhi’s misinformed statement has understandably evoked controversy and even ridicule. In his attempt to highlight the paucity of employment opportunities, the Congress President ended up citing an example which was not based on facts.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]