["By Angelo Fichera", "Posted on July 8, 2019", "There’s no evidence President Ronald Reagan predicted Donald Trump would become president, as a meme shared by Trump falsely claims.", "A viral falsehood about President Ronald Reagan that has circulated repeatedly since 2016 reappeared on social media when President Donald Trump shared it on Twitter July 8.", "The meme attributes a made-up quotation to Reagan that claims the 40th president predicted Trump’s future place in the Oval Office.", "“For the life of me, and I’ll never know how to explain it, when I met that young man, I felt like I was the one shaking hands with a president,” the meme, which uses a real photo of Reagan and Trump greeting one another, reads. “Ronald Reagan on meeting Donald Trump.”", "But, as our fellow fact-checkers have found, there’s no support that Reagan ever said that.", "Craig Shirley, a Reagan biographer and historian, told FactCheck.org that there is “no record anywhere in the Reagan Diaries or the Reagan correspondence or the Reagan Library of him saying even something remotely similar” to the statement attributed to him.", "“Not only is there no evidence — it’s something I frankly doubt he ever even thought,” Shirley, the Visiting Reagan Scholar at Eureka College, Reagan’s alma mater, added. “I spent a lifetime studying Ronald Reagan, listening to his speeches, reading his commentary and letters — it just doesn’t sound like something he would say.”", "Likewise, Joanne Drake, chief administrative officer of the Ronald Reagan Presidential Foundation and Institute, told PolitiFact in February: “He did not ever say that about Donald Trump.”", "The photo shown depicts Reagan and Trump meeting at a 1987 reception “for members of the ‘Friends of Art and Preservation in Embassies’ Foundation,” according to the Reagan Presidential Library & Museum. Other photos also capture the two together, including at a 1983 White House event and 1985 state dinner for Saudi Arabia’s King Fahd.", "Whether Trump knew the false nature of the quotation when he shared it isn’t clear. We asked the White House about it, but did not hear back.", "But Trump’s retweet, which simply described the meme as “cute,” earned thousands of shares and likes — and it was followed by more posts of the meme on Facebook.", "The Twitter account whose post Trump shared — @reaganbattaiion — was suspended soon after Trump’s retweet went viral. The verified Twitter account of conservative website Reagan Battalion — @ReaganBattalion — claimed @reaganbattaiion was suspended for “impersonating us.”", "A Twitter spokeswoman declined to comment on the specifics of the suspension but said such decisions are determined based on violations of the platform’s rules.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "“Meeting with V.I.P.s.” Ronald Reagan Presidential Library & Museum, U.S. National Archives and Records Administration. Accessed 8 Jul 2019.", "Shirley, Craig. Ronald Reagan biographer and historian. Phone interview with FactCheck.org. 8 Jul 2019.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]