["By Robert Farley, Eugene Kiely, Lori Robertson and D'Angelo Gore", "Posted on November 20, 2019", "President Donald Trump said he “turned off the television” after Ambassador Gordon Sondland testified that the president told him in a phone call, “I want nothing [from Ukraine]. I want no quid pro quo.” But Sondland had a lot more to say than that.", "Sondland, the U.S. ambassador to the European Union, described how Rudy Giuliani, the president’s personal lawyer, directed U.S. efforts to get Ukrainian President Volodymyr Zelensky to make a public announcement of investigations into a debunked theory about Ukrainian interference in the 2016 election and Burisma, the Ukrainian gas company. Hunter Biden had served on Burisma’s board when his father, Joe Biden, was the vice president.", "“[A]s I testified previously, Mr. Giuliani’s requests were a quid pro quo for arranging a White House visit for President Zelensky,” Sondland told the House intelligence committee. “Mr. Giuliani demanded that Ukraine make a public statement announcing investigations of the 2016 election/DNC server and Burisma. Mr. Giuliani was expressing the desires of the President of the United States, and we knew that these investigations were important to the President.”", "The House opened an impeachment inquiry in late September into whether Trump misused his office to pressure Ukraine to investigate his political enemies in exchange for congressionally appropriated military aid. It began holding public hearings on Nov. 13, and Sondland testified on Nov. 20, the fourth day of public hearings.", "Sondland testified that he “never heard from Trump that aid was conditioned on an announcement” from Ukraine, but the president did direct Sondland and other State Department officials to “talk with Rudy,” meaning Guiliani. And, Sondland said in his prepared opening statement, Giuliani’s agenda was clear. In an early August conversation, Sondland said Giuliani “emphasized that the President wanted a public statement from President Zelensky committing Ukraine to look into corruption issues. Mr. Giuliani specifically mentioned the 2016 election (including the DNC server) and Burisma as two topics of importance to the President.”", "Sondland testified that “yes” there was a “quid pro quo” when it came to granting Zelensky a White House visit.", "Sondland said such a visit was “vital to cementing the U.S.-Ukraine relationship, demonstrating support for Ukraine in the face of Russian aggression, and advancing broader U.S. foreign policy interests.” Sondland said efforts to get Zelensky to make a public statement about the investigations to “satisfy President Trump’s concerns” was openly communicated among numerous officials in the leadership of the State Department and National Security Council as a condition for a White House call and visit.", "Sondland, Nov. 20: I know that members of this Committee have frequently framed these complicated issues in the form of a simple question: Was there a “quid pro quo?” As I testified previously, with regard to the requested White House call and White House meeting, the answer is yes. Mr. Giuliani conveyed to Secretary Perry, Ambassador Volker, and others that President Trump wanted a public statement from President Zelensky committing to investigations of Burisma and the 2016 election. Mr. Giuliani expressed those requests directly to the Ukrainians. Mr. Giuliani also expressed those requests directly to us. We all understood that these pre-requisites for the White House call and White House meeting reflected President Trump’s desires and requirements.", "As evidence that the arrangement was common knowledge among State Department and NSC leadership, Sondland pointed to a July 19 email that he sent to Secretary of State Mike Pompeo, Secretary of Energy Rick Perry, Acting Chief of Staff Mick Mulvaney and others in which Sondland wrote, ““I Talked to Zelensky just now… He is prepared to receive Potus’ call. Will assure him that he intends to run a fully transparent investigation and will ‘turn over every stone’.” Sondland testified that he was referring to the investigations of the 2016 elections and Burisma.", "“Everyone was in the loop,” Sondland said. “It was no secret.”", "Sondland detailed how he and others, including Kurt Volker, the special envoy to Ukraine, helped craft a statement for Zelensky to make.", "The ambassador said he later “came to the conclusion that the aid, like the White House visit, was jeopardized” unless Zelensky made a public statement about the investigations.", "Sondland revealed an Aug. 22 email he sent to Pompeo about an upcoming Sept. 1 meeting between Trump and Zelensky in Warsaw (Vice President Mike Pence ended up attending instead of Trump). Sondland said in that message: “Should we block time in Warsaw for a short pull-aside for Potus to meet Zelensky? I would ask Zelensky to look him in the eye and tell him that once Ukraine’s new justice folks are in place ([in] mid-Sept[ember), that Ze should be able to move forward publicly and with confidence on those issues of importance to Potus and to the US. Hopefully, that will break the logjam.”", "Pompeo replied, “Yes.”", "Sondland testified that the “logjam” he referred to included the security aid. “Nothing was moving” on Ukraine, he said.", "Under questioning by Republicans, Sondland acknowledged that Trump never directly told him about a scheme to withhold aid in exchange for the investigations. Rather, Sonderland said that was “my own presumption.”", "“Which is nothing,” said Rep. Mike Turner, an Ohio Republican. “That’s what I don’t understand. You know what hearsay evidence is, ambassador? Hearsay is when I testify what someone else told me. You know what made-up testimony is? Made-up testimony is when I just presume it.”", "Sondland told the committee that he came to that conclusion “in the absence of any credible explanation for the suspension of aid.”", "Daniel Goldman, director of investigations for the Democratic majority on the House intelligence committee, described it as “a two plus two equals four conclusion,” and Sondland agreed with that assessment. “Is the only logical conclusion to you that given all these factors that the aid was also a part of this quid pro quo?” Goldman asked. “Yep,” Sondland replied.", "Frustrated with the hold on the aid — which Sondland described as “a very bad idea”– and concerned that it was being held up until Ukraine made a public statement about the investigations, Sondland said he confronted the president about it in a brief Sept. 9 phone call.", "Sondland, Nov. 20: I believe I just asked him an open-ended question, Mr. Chairman, “what do you want from Ukraine? I keep hearing all these ideas and theories and this and that. What do you want?” And it was a very short, abrupt conversation. He was not in a good mood. And he just said, “I want nothing. I want nothing. I want no quid pro quo. Tell Zelensky to do the right thing.” Something to that effect.", "Sept. 9 is the same day that the inspector general of the intelligence community notified the House intelligence committee that he received a whistleblower’s complaint relating to an “urgent concern,” and the same day three House committees announced they would investigate whether Trump and Giuliani tried to pressure Ukraine into conducting “politically-motivated investigations under the guise of anti-corruption activity.”", "Trump seized on Sondland’s description of the Sept. 9 phone call in remarks to reporters midway through Sondland’s testimony.", "“I just noticed one thing, and I would say that means it’s all over,” Trump said. The president then recounted Sondland’s testimony about the call, and how Sondland said he asked the president, “What do you want from Ukraine?”", "Trump, Nov. 20: And now, here’s my response, that he gave, just gave. Ready? You have the cameras rolling? “I want nothing. That’s what I want from Ukraine.” That’s what I said. “I want nothing.”… Now, if you weren’t fake news you’d cover it properly. I say to the ambassador in response, “I want nothing. I want nothing. I want no quid pro quo. Tell Zelensky, President Zelensky, to do the right thing.” Then he says, “This is the final word from the president of the United States. I want nothing.” Thanks you folks, have a good time.", "Trump also said that he doesn’t know Sondland very well.", "“I have not spoken to him much,” Trump said. “This is not a man I know well. Seems like a nice guy though. But I don’t know him well. He was with other candidates [in the 2016 presidential primary]. He actually supported other candidates, not me, came in late.”", "Rep. Eric Swalwell asked Sondland about those remarks. Sondland said he talked to Trump at least 20 times and bought a VIP ticket to his inauguration. He gave $1 million to the inaugural committee. Asked if Trump knows him well, Sondland said, “It really depends on what you mean by know well. We are not close friends, no. We have a professional, cordial working relationship.”", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]