["Carolyn Harris helps Nyzer Pendleton, 10, buy a backpack for school Friday at the Super Walmart in Greendale. He chose a backpack for when he starts school in Milwaukee in the fall. (Photo: Rick Wood / Milwaukee Journal Sentinel", "Back-to-school shopping was a smidge more expensive in Wisconsin this year.", "Wisconsin Republicans set up a sales tax holiday in 2018, giving consumers a pass for many categories of clothing, computers and school supplies. There was no such holiday in 2019.", "And since there’s change, there must be blame.", "In posts on Twitter and Facebook, the Wisconsin Assembly GOP pointed the finger at the state’s new Democratic governor.", "\"Last year, Republicans gave part of Wisconsin's budget surplus back to the taxpayers by instituting a sales tax holiday on some back-to-school items,\" the Aug. 27, 2019, posts said. \"You won't see that this year under Governor (Tony) Evers, despite the continued surplus.\"", "A graphic accompanying the text stamped the word \"CANCELED\" across a description of the sales tax holiday categories.", "The Twitter version of the post was retweeted by several Republican legislators, including Assembly Majority Leader Jim Steineke, R-Kaukauna.", "So, did Evers really cancel the sales tax?", "Let’s start with the history.", "Gov. Scott Walker introduced a sales tax holiday in his budget for 2017, but GOP lawmakers voted to kill it.", "In 2018, lawmakers went through various versions of a sales tax holiday early in the year. The Assembly approved a bill in February that would have created a $50 million sales tax holiday on all goods under $100.", "But an amendment introduced in March by Senate Majority Leader Scott Fitzgerald, R-Juneau, limited the sales tax holiday to specific school-related categories. They included clothing and school supplies under $75 per item and computers under $750.", "That version passed both houses and was signed into law by Walker. It reduced the expected consumer savings (and, therefore, lost state revenue) to about $14 million, according to an estimate from the state’s nonpartisan Legislative Fiscal Bureau.", "It made Wisconsin one of 17 states with a sales tax holiday in 2018, according to the Tax Foundation, a pro-business think tank.", "But Republicans were explicitly clear that this was a one-time deal.", "The statutory language included a note that \"This subsection does not apply in 2019 or in any year thereafter.\"", "And Walker’s veto message (which didn’t change the nature of the holiday) also noted the holiday \"will not recur in future years.\"", "This year, Republicans — who still control the state Legislature — never proposed a sales tax holiday, noted Evers spokeswoman Britt Cudaback.", "\"Republicans specifically prevented the 2018 back-to-school holiday from being offered in 2019 and any year thereafter,\" she said in an email. \"If Republicans wanted to extend the 2018 back-to-school sales tax holiday, they would have had to pass legislation this year to do so.\"", "RELATED: Republicans botch claim comparing tuition for immigrants, veterans", "RELATED: GOP blames Evers’ budget for potential property tax hike", "Adam King, director of social media for the Assembly Republican Caucus, pointed to an Evers quote as evidence supporting the post’s claim.", "\"Parents are going to be out there purchasing their kids' supplies whether they have an incentive or not,\" Evers said at a July 29, 2019, press conference. \"I just don’t think the incentive actually worked.\"", "Said King: \"By making this statement, the governor effectively shut the door on any possibility that a tax holiday could be implemented this year.\"", "But that timeline defies logic. If Republicans wanted a sales tax holiday, they would have introduced the measure months before that comment. Certainly before the Legislature passed the final version of the budget in late June.", "As a quick aside, Evers’ comment does appear to misconstrue the intent of the sales tax holiday — Republicans intended it as tax relief in the wake of a General Fund surplus, and his comment treated it as an economic incentive.", "A 2018 study from the Tax Foundation found sales tax holidays don’t promote economic growth, they just shift the timing of purchases. It called the holidays \"political gimmicks\" that \"distract policymakers and taxpayers from genuine, permanent tax relief.\"", "But that doesn’t play into the veracity of this claim.", "Assembly Republicans said Evers \"canceled\" the 2019 sales tax holiday.", "You can’t cancel something that was expressly created as a one-time occurrence.", "Republicans could have introduced a new bill creating another sales tax holiday this year, but they didn’t. And Evers’ comments showing a lack of support for such a measure didn’t come until months after Republicans would have needed to broach the subject.", "We rate this claim False.", "Wisconsin Assembly GOP, tweet, Aug. 27, 2019", "Milwaukee Journal Sentinel, Lawmakers pass Kimberly-Clark aid, $100 child tax credit rebate and sales tax holiday, Feb. 22, 2018", "Wisconsin State Legislature, SENATE SUBSTITUTE AMENDMENT 2, TO SENATE BILL 798, March 20, 2018", "Wisconsin State Legislature, 2017 Wisconsin Act 367, enacted April 17, 2018", "Email exchange with Walker spokeswoman Britt Cudaback, Sept. 3, 2019", "Email exchange with Adam King, social media director, Wisconsin Assembly Republican Caucus, Sept. 3, 2019", "Tax Foundation, Sales Tax Holidays:Politically Expedient but Poor Tax Policy, 2018, July 2018", "Legislative Reference Bureau, Executive Vetoes of Bills Passed by the 2017 Legislature, May 2018", "Fox6 TV, After inaugural event last August, no sales tax holiday for back-to-school shoppers in 2019, July 30, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]