["A Facebook post from Feb. 16 claims that infamous British occultist Aleister Crowley was the father of former first lady Barbara Bush. \"This makes George W. Bush the grandson of the worlds (sic) most famous satanist,\" the user wrote. Crowley (1875-1947) is known for founding a religion called Thelema and popularizing the term \"magick\" to describe supernatural acts of the occult.", "In a comment to USA TODAY, Casey Zevenbergen, who posted the claim on Facebook, said he saw the claim several times, including on the secure-messaging app Telegram.", "More:What is QAnon? What to know about the baseless, far-right conspiracy theory connected to Marjorie Taylor Greene", "\"This post has been circulating for many years, I also have seen it on other sites like Telegram. Not sure of its authenticity but it has raised a lot of conversations,\" Zevenbergen said.", "While the claim is false – official White House archives and the National First Ladies Library show Barbara Bush was the daughter of Marvin Pierce (1893-1969), who worked in publishing – the conspiracy theory has circulated online for nearly 15 years.", "And it all started as an April Fool's joke.", "On April 1, 2006, a blogger who identifies himself as Joseph Cannon of Cannonfire.com posted the first article to espouse this false theory. His article, transparent about its lack of solid evidence and mostly based on \"resemblance\" between Crowley and Bush, suggested that Pauline Pierce, Barbara Bush's mother and Marvin Pierce's wife, had a secret affair with Crowley during a trip to France.", "In an email interview with USA TODAY, Cannon wrote that the article was an April Fool's joke. He says he created the theory as a litmus test for conspiracy theory and \"truth seeking\" groups.", "\"I wanted to test whether anyone would take the first, obvious step of contacting me and asking 'Is this real?'\" he said.", "It seems they did not. His theory has been discussed in online forums, featured at length in a documentary on Crowley called \"In Search of the Great Beast,\" and picked up by Alex Jones of right-wing media outlet InfoWars. In 2017, the text of the article was also translated into Russian and Polish and shared in a Russian Facebook group with 3,900 members. In a blog post from 2009, he listed others who picked up the theory, including several YouTube channels and radio shows.", "\"The Conspiracy Zone\" blog and Facebook page even tied the theory to another long-held conspiracy theory about the Bush family in their most recent post, from 2018.", "Yet Cannon, who keeps his email at the top of his blog page, says none of the people who picked up his theory publicly ever contacted him. \"I think that, in the internet age, people have learned to fear direct communication, perhaps because communication might lead to confrontation,\" he wrote.", "We rate this claim FALSE, based on our research. There is no evidence to support the claim that Aleister Crowley was former first lady Barbara Bush's father. In addition, the writer of the blog post that apparently spawned this conspiracy theory says his original claim, posted on April 1, 2006, was made up."]