["About this rating", "On 27 October 2016, the WhatDoesItMean web site published an article positing that the Clinton Foundation had purchased over $137 million of illegal arms and ammunition, to be delivered to the U.S. just after the upcoming presidential election:", "A stunning Foreign Intelligence Service (SVR) report circulating in the Kremlin today reveals that the Security Council (SC), this morning, authorized the sending to the American Central Intelligence Agency (CIA) of an emergency communiqué requesting an immediate explanation as to why Hillary Clinton’s money laundering organization, known as the Clinton Foundation, this past week, purchased over $137 million of illegal arms and ammunition — and whose destination is to be the United States, with delivery being marked as “mid-November 2016”.", "According to this report, SVR analysts began expressing “urgent concern” earlier this year when the main “elements/factions” of the feared Viktor Bout’s international arms smuggling crime organization began arriving in the Republic of Albania — that is the only Muslim nation in Europe.", "None of this was true.  The article was just another fabrication from the conspiracy-mongering fake news site WhatDoesItMean.com and putative blogger \"Sorcha Faal,\" of whom RationalWiki notes:", "Sorcha Faal is the alleged author of an ongoing series of \"reports\" published at WhatDoesItMean.com, whose work is of such quality that even other conspiracy nutters don't think much of it.", "Each report resembles a news story in its style, but usually includes a sensational headline barely related to reality (e.g. \"American Rebel Forces Attack Gas Pipelines, Explode Trains As US Civil War Nears\") and quotes authoritative high-level Russian sources (such as the Russian Federal Security Service in the same article) to support its most outrageous claims. Except for the stuff attributed to unverifiable sources, the reports don't contain much original material. They are usually based on various news items from the mainstream media and/or whatever the clogosphere is currently hyperventilating about, with each item shoehorned into the conspiracy narrative the report is trying to establish.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]