["About this rating", "In August 2018, a number of social media users came across an image offering a purported newspaper clipping of an article entitled \"Tech Billionaire Parenting\" and wondered if the article, as well as the information contained within it, was genuine:", "This image presents a slightly paraphrased version of an article written by Alice Thomson entitled \"Help Kids to Kick Social Media Addiction\" which was published in The Times of London in March 2018, the original text of which read as follows:", "The philanthropist Melinda Gates told me the same. Her children don’t have smartphones and only use a computer in the kitchen. Her husband Bill, the Microsoft co-founder, spends hours in his office reading books while everyone else is refreshing their homepage. The most sought-after private school in Silicon Valley, the Waldorf School of the Peninsula, bans technical devices for the under-11s and teaches the children of eBay, Apple, Uber and Google staff to make go-karts, knit and cook. Facebook’s Mark Zuckerberg wants his daughters to read Dr Seuss books and play outside rather than use Messenger Kids. Steve Jobs’s children had strict limits on how much technology they used at home.", "It’s astonishing if you think about it: the more money you make out of the tech industry, the more you appear to shield your family from its effects.", "The general theme of this article, that several prominent tech billionaires advocated limiting their children's use of technology, is accurate and supported by various interviews and articles. Our only quibble is with the claim that Bill and Melinda Gates' children don't currently have smartphones. As far as we can tell, the Microsoft moguls didn't allow their children to possess smartphones of their own until they reached the age of 14, but as of this writing Jennifer, Rory, and Phoebe Gates are all now over the age of 14.", "In a June 2018 interview with The Mirror, Bill Gates explained some of his parental rules when it came to technology use by his children:", "“We often set a time after which there is no screen time and in their case that helps them get to sleep at a reasonable hour.", "“You’re always looking at how it can be used in a great way – homework and staying in touch with friends – and also where it has gotten to excess.", "“We don’t have cellphones at the table when we are having a meal, we didn’t give our kids cellphones until they were 14 and they complained other kids got them earlier.”", "Melinda Gates also penned an op-ed for the Washington Post in August 2017 in which she warned about putting a computer in a child's pocket at too early of an age. Gates seemed to acknowledge that her children had cellphones at the time but said that she \"probably would have waited longer\" if she had the chance to do it again:", "Still, as a mother who wants to make sure her children are safe and happy, I worry. And I think back to how I might have done things differently. Parents should decide for themselves what works for their family, but I probably would have waited longer before putting a computer in my children’s pockets. Phones and apps aren’t good or bad by themselves, but for adolescents who don’t yet have the emotional tools to navigate life’s complications and confusions, they can exacerbate the difficulties of growing up: learning how to be kind, coping with feelings of exclusion, taking advantage of freedom while exercising self-control. It’s more important than ever to teach empathy from the very beginning, because our kids are going to need it.", "As for the remainder of the text at the head of this page, it appears wholly accurate. A number of Silicon Valley parents truly do send their children to the Waldorf School of the Peninsula, where an emphasis is placed on pen and paper rather than digital screens. News outlets such as the New York Times and the Guardian have reported on that school's technology policy in relation to the student body's connection to Silicon Valley:", "The chief technology officer of eBay sends his children to a nine-classroom school here. So do employees of Silicon Valley giants like Google, Apple, Yahoo and Hewlett-Packard.", "But the school’s chief teaching tools are anything but high-tech: pens and paper, knitting needles and, occasionally, mud. Not a computer to be found. No screens at all. They are not allowed in the classroom, and the school even frowns on their use at home.", "Schools nationwide have rushed to supply their classrooms with computers, and many policy makers say it is foolish to do otherwise. But the contrarian point of view can be found at the epicenter of the tech economy, where some parents and educators have a message: computers and schools don’t mix. This is the Waldorf School of the Peninsula, one of around 160 Waldorf schools in the country that subscribe to a teaching philosophy focused on physical activity and learning through creative, hands-on tasks. Those who endorse this approach say computers inhibit creative thinking, movement, human interaction and attention spans.", "The web site for the Waldorf School of the Peninsula also includes a page in which they describe their \"Media & Technology Philosophy\":", "Waldorf educators believe it is far more important for students to interact with one another and their teachers, and work with real materials than to interface with electronic media or technology. By exploring the world of ideas, participating in the arts, music, movement and practical activities, children develop healthy, robust bodies, balanced and well-integrated brains, confidence in their real-world practical skills and strong executive-function capabilities.", "In the high school curriculum, Waldorf embraces technology in ways that enhance the learning process, by using it as a tool, rather than replace the role of the teacher. Students quickly master technology, and many Waldorf graduates have gone on to successful careers in the computer industry.", "The claim that \"Steve Jobs’s children had strict limits on how much technology they used at home\" is supported by a 2014 New York Times article which labeled the Apple founder a low-tech parent:", "[N]othing shocked me more than something Mr. Jobs said to me in late 2010 after he had finished chewing me out for something I had written about an iPad shortcoming.", "“So, your kids must love the iPad?” I asked Mr. Jobs, trying to change the subject. The company’s first tablet was just hitting the shelves. “They haven’t used it,” he told me. “We limit how much technology our kids use at home.”", "I’m sure I responded with a gasp and dumbfounded silence. I had imagined the Jobs’s household was like a nerd’s paradise: that the walls were giant touch screens, the dining table was made from tiles of iPads and that iPods were handed out to guests like chocolates on a pillow.", "Nope, Mr. Jobs told me, not even close.", "Facebook founder Mark Zuckerberg's reported desire to have his daughter read Dr. Seuss and play outside comes from an open letter he wrote after the birth of his second daughter in August 2017:", "But rather than write about growing up, we want to talk about childhood. The world can be a serious place. That’s why it’s important to make time to go outside and play.", "You will be busy when you’re older, so I hope you take time to smell all the flowers and put all the leaves you want in your bucket now. I hope you read your favorite Dr. Seuss books so many times you start inventing your own stories about the Vipper of Vipp. I hope you ride the carousel with Max until you’ve tamed every color horse. I hope you run as many laps around our living room and yard as you want. And then I hope you take a lot of naps. I hope you’re a great sleeper. And I hope even in your dreams you can feel how much we love you.", "Gates, Melinda.   \"Melinda Gates: I Spent My Career in Technology. I Wasn’t Prepared for Its Effect on My Kids.\"\r\n    The Washington Post.   24 August 2017.", "Richtel, Matt.   \"A Silicon Valley School That Doesn't Compute.\"\r\n    The New York Times.   22 October 2011.", "Bilton, Nick.   \"Steve Jobs Was a Low-Tech Parent.\"\r\n    The New York Times.   10 September 2014.", "Jenkin, Matthew.   \"Tablets Out, Imagination In: The Schools That Shun Technology.\"\r\n    The Guardian.   2 December 2015.", "Abramson, Alana.   \"'Childhood Is Magical.' Read the Letter Mark Zuckerberg and Priscilla Chan Wrote to Their Baby Daughter.\"\r\n    Fortune.   28 August 2017.", "Stillman, Jessica.   \"Why Steve Jobs and Bill Gates Both Severely Limited Their Kids' Tech Use.\"\r\n    Inc.   29 October 2017.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]