["About this rating", "On Sept. 23, 2009, The Onion posted a short video that appeared to be a segment from a television talk show, including an interview with an 8-year-old boy named Lucas Armitage. The hosts praised him as \"a true American hero\" for purportedly shooting and viciously attacking a would-be burglar in his family's home.", "At the beginning of the video, one of the hosts of \"Today Now\" introduces Armitage, saying, \"Our next guest is a true American hero, and he's 8 years old.\" The other host continues: \"Last week, Lucas Armitage bravely defended his family and his home when he stopped an intruder all by himself, just by using his daddy's gun.\"", "As the interview progresses, Armitage reveals increasingly disturbing details of how he purportedly attacked the would-be thief, telling the show's hosts he shot the man repeatedly in the jaw and skull, adding, \"I liked the way the blood made me feel\":", "This item was not a factual recounting of real-life events. The article originated with a website that describes its output as being humorous or satirical in nature, as follows: \"The First Amendment protects satire as a form of free speech and expression. The Onion uses invented names in all of its stories, except in cases where public figures are being satirized. Any other use of real names is accidental and coincidental.\"", "The video was widely shared in late August and early September 2019, when social media users posted it online without linking to the original Onion video, nor making it clear that the clip had been created 10 years earlier by one of the world's most best-known sources of satirical content. We received multiple inquiries from readers about the authenticity of the video.", "Many Twitter users who shared the footage expressed disbelief and horror at the confessions of the fictional \"Lucas Armitage,\" and several related the interview to the ongoing problem of mass shootings and gun violence in the United States:", "His school isn’t safe, probably going to look for his Dad’s gun the moment he gets home pic.twitter.com/ZWGckJjfiv", "— NB?? (@N1NOBROWN) August 31, 2019", "Bruh when they showed the picture of his shirt? ??? take this kid to JAIL. pic.twitter.com/0wmOl2eXNV", "— Yha (@_yhaleon) August 31, 2019", "put this kid on the FBI watchlist rn pic.twitter.com/IfkYg6YQ7r", "— Gio (@Krazygioo) August 31, 2019", "Please somebody ANYBODY find and lock this child up......lmfao omg what? pic.twitter.com/2Q88ILyoOo", "— stereotypes of a black girl misunderstood (@LondonbreedAnn) August 31, 2019", "The Onion.  \"Little Boy Heroically Shoots, Mutilates Burglar.\"\r\n  23 September 2009.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]