["About this rating", "In a tweet on 16 November, Swalwell responded to a gun rights enthusiast who said the Democrats' proposal to confiscate or buy semi-automatic rifles would result in \"war\" due to resistance from the gun owners, stating \"it would be a short war\" because \"the government has nukes.\"", "Swalwell quickly insisted that his reference to the government's possession of nuclear weapons was intended as no more than a joke and emphasized that he was not warning gun owners about such a response to their (hypothetical) resistance to gun confiscation.", "In May 2018, U.S. Representative Eric Swalwell (representing California's 15th Congressional district) wrote an opinion column for USA Today, calling for a ban on \"military-style semi-automatic assault weapons\" and proposing that the federal government buy such guns from their owners while criminal prosecuting those who refused to hand over their weapons:", "We should ban possession of military-style semiautomatic assault weapons, we should buy back such weapons from all who choose to abide by the law, and we should criminally prosecute any who choose to defy it by keeping their weapons. The ban would not apply to law enforcement agencies or shooting clubs.", "This policy proposal prompted something of a backlash from supporters of gun rights and led to a particularly significant exchange on Twitter more than six months later.", "On 16 November, the conservative television host John Cardillo posted a link to an NBC story about Swalwell's column, adding: \"Democrats want to eradicate the Second Amendment, ban and seize all guns, and have all power rest with the state. These people are dangerously obsessed with power\":", "Make no mistake, Democrats want to eradicate the Second Amendment, ban and seize all guns, and have all power rest with the state.", "These people are dangerously obsessed with power. https://t.co/f1AS6Me0ko", "— John Cardillo (@johncardillo) November 16, 2018", "In response to this tweet, conservative gun rights enthusiast Joe Biggs wrote: \"So basically [Eric Swalwell] wants a war. Because that's what you would get. You're outta your fucking mind if you think I'll give up my rights and give the [government] all the power\":", "So basically @RepSwalwell wants a war. Because that’s what you would get. You’re outta your fucking mind if you think I’ll give up my rights and give the gov all the power. https://t.co/bK1GVyjFej", "— Joe Biggs (@Rambobiggs) November 16, 2018", "Swalwell himself replied to that tweet with one of his own:", "And it would be a short war my friend. The government has nukes. Too many of them. But they’re legit. I’m sure if we talked we could find common ground to protect our families and communities.", "— Rep. Eric Swalwell (@RepSwalwell) November 16, 2018", "Swalwell's reference to a \"short war\" and the U.S. government's possession of nuclear weapons prompted claims that he had called for such weapons to be used on gun owners who refused to sell or hand over their semi-automatic rifles under the proposal he had laid out in his USA Today column.", "Right-wing web site the Daily Wire declared in a headline: \"Democrat Calls for Gun Confiscation, Suggests Nuking Americans Who Fight Back,\" adding:", "Democratic Rep. Eric Swalwell (D-CA) caused a firestorm when he suggested using nuclear weapons against American citizens who oppose his far-left gun control agenda, which includes forcing Americans to give up their semi-automatic weapons. Swalwell made the comment in response to a May news article on his radical plan that was widely recirculated on Twitter in which he called for a $15 billion government program to confiscate millions of guns from Americans.", "The conservative Washington Times proclaimed in their headline that Swalwell had \"warned\" gun owners that the \"government has nukes\":", "Rep. Eric Swalwell, California Democrat, warned gun owners Friday that any fight over firearms would be “a short one,” because the federal government has an extensive cache of nuclear weapons.", "Swalwell's tweet was undoubtedly authentic, but he quickly clarified that he had intended his reference to nuclear weapons to be a joke:", "Read the thread. That guy said he was going to go to war with America if someone banned assault weapons. I joked that he may not win that war. A joke ?Tom, can we not use sarcasm anymore? ***i don’t think the guy was joking about going to war, tho.", "— Rep. Eric Swalwell (@RepSwalwell) November 17, 2018", "Swalwell also responded directly to Joe Biggs, who first invoked the concept of a \"war\" between gun owners and the U.S. government, clarifying that \"No one is nuking anyone or threatening that\" and positing the \"argument that you would go to war with your government\" to be \"ludicrous\":", "Don’t be so dramatic. No one is nuking anyone or threatening that. I’m telling you this is not the 18th Century. The argument that you would go to war with your government if an assault weapons ban was in place is ludicrous and inflames the gun debate. Which is what you want. https://t.co/oX0rY7Nbs1", "— Rep. Eric Swalwell (@RepSwalwell) November 16, 2018", "Despite mentioning several other tweets posted by Swalwell on 16 November as part of the backlash against his \"nukes\" comment, the Daily Wire did not include in their article any of those in which he clarified that he had been joking and that \"no one is nuking anyone or threatening that.\"", "The Washington Times did include in their article Swalwell's clarification that he was not threatening to \"nuke\" gun owners, and yet (as of 19 November) retained the claim that the Congressman had \"warned\" gun owners about the government's possession of nuclear weapons. The Washington Times also did not include Swalwell's tweet which clarified that his original \"government nukes\" remarks were intended as no more than a joke.", "Swalwell, Eric.   \"Ban Assault Weapons, Buy Them Back, Go After Resisters: Ex-Prosecutor in Congress.\"\r\n    USA Today.   3 May 2018.", "Sarlin, Benjy.   \"Dem Congressman: Force Gun Owners to Get Rid of Assault Weapons.\"\r\n    NBC News.   3 May 2018.", "Saavedra, Ryan.   \"Democrat Calls for Gun Confiscation, Suggests Nuking Americans Who Fight Back.\" \r\n     The Daily Wire.   16 November 2018.", "Richardson, Valerie.   \"Democratic Rep. Swalwell Warns Gun Owners That 'Government Has Nukes.'\"\r\n    The Washington Times.   16 November 2018.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]