["A pedestrian wears a mask while walking in front of a mural during the coronavirus pandemic in San Jose, Calif., Dec. 1, 2020. (AP)", "We found no credible reports of people dying because they used masks to stop the spread of the coronavirus.", "Public health experts say it is not true that masks reduce blood oxygen levels.", "The CDC says that people with underlying medical conditions should still wear masks.", "For more than seven minutes, a video on Facebook shows a man in a large brown chair reading calmly from his notes, predicting global food shortages as \"a side effect of the coronavirus hoax,\" and misleading about the use of masks to prevent the spread of the virus.", "About 34 seconds in, the man says: \"The masks will kill quite a few people, it’s well known that they reduce blood oxygen levels and those with respiratory and cardiac disorders will die. It’s true that surgeons wear masks, but they are different masks and different circumstances and not usually worn all day.\"", "As he reads in a matter-of-fact tone, big red capital letters frame the video: \"They want to kill 6 billion of us. Here’s how they will do it.\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The man in the Facebook video was described by The Bangkok Post, a Thailand-based news outlet as a doctor, prolific author, and former newspaper columnist \"who has built a career on being anti-establishment,\" and is now \"peddling played-out COVID-19 conspiracy theories.\"", "This video includes several unfounded and wrong claims, but this fact-check will focus on the claim about masks having a deadly effect.", "Bottom line: Public health experts say masks are effective in reducing the spread of the coronavirus, and while some people may experience some discomfort wearing them, masks are generally safe to use. (The American Lung Association has suggestions on how to get used to wearing a mask.)", "For months, people around the world have been using masks to prevent getting or spreading the coronavirus. We found no credible reports of people dying as a result of wearing a mask. Reuters in October debunked a false claim that three children in Germany died from wearing face masks. PolitiFact has also fact-checked a lot of misinformation about masks.", "No, masks do not shut down or weaken the immune system. No, masks will not reduce blood oxygen levels.", "\"As a pulmonologist — a doctor who specializes in the respiratory system — I can assure you that behind that mask, your breathing is fine. You’re getting all the oxygen you need, and your carbon dioxide levels aren’t rising,\" Jonathan Parsons, a pulmonologist at The Ohio State University Wexner Medical Center and director of the Ohio State Asthma Center, wrote in an August blog post.", "Parsons wrote that people who experience anxiety or claustrophobia when wearing a mask can try to calm themselves by taking long, slow breaths.", "Thomas Tsai, a surgeon and health policy researcher at Harvard’s School of Public Health, told PolitiFact in May that, \"on the margins we could probably find extreme cases where someone, somewhere with some condition has had an issue with a mask, but that's not the average.\"", "Tsai said there was no data suggesting that it was harmful to wear a standard surgical or cloth mask under normal situations.", "N95 masks (ones that create a tight seal) are considered to be the most effective in protecting the wearer from airborne particles, and are commonly used by health care workers. Because of a shortage of those masks, public health officials recommended that the general public instead use other types of masks, like cloth masks, and reserve the N95s for health care workers who are routinely exposed to patients with COVID-19.", "The American Lung Association says that people with chronic lung diseases may be asymptomatic carriers of COVID-19 and should wear cloth face masks in public areas.", "There is some evidence that prolonged use of N-95 masks in patients with preexisting lung disease could cause some build-up of carbon dioxide levels in the body, the association said.", "The Centers for Disease Control and Prevention told Reuters earlier this year that the level of carbon dioxide likely to build up in a mask \"is mostly tolerable to people exposed to it\" and that it is \"unlikely to cause hypercapnia,\" a condition that develops when there is too much carbon dioxide in the bloodstream.", "The CDC also says that most people with underlying medical conditions can and should wear masks. People with respiratory conditions who remain concerned about wearing a mask safely should talk with their healthcare provider, the CDC said.", "The CDC does not recommend masks for children under 2 years old or anyone who has trouble breathing, is unconscious, incapacitated or otherwise unable to remove the mask without assistance.", "A video in a Facebook post claimed, \"Masks will kill quite a few people, it’s well known that they reduce blood oxygen levels and those with respiratory and cardiac disorders will die.\"", "We found no credible reports of people dying because they used masks to stop the spread of the coronavirus. Public health experts say it is not true that masks reduce blood oxygen levels. The CDC says that people with underlying medical conditions should still wear masks.", "The post is not factual. We rate it False.", "RELATED: There’s no evidence that wearing standard masks is harmful to your health", "Facebook post, Nov. 30, 2020", "The Ohio State University Wexner Medical Center, Do masks cause lower oxygen levels?, Aug. 4, 2020", "FDA.gov, N95 Respirators, Surgical Masks, and Face Masks", "Bangkok Post, An 'old man in a chair' pulling rabbits from his bag of 'truths', June 27, 2020", "PolitiFact, There’s no evidence that wearing standard masks is harmful to your health, May 19, 2020; Masks for COVID-19 are effective, as a six-part Facebook takedown fails, June 12, 2020", "CDC, Considerations for Wearing Masks; People with Certain Medical Conditions", "Reuters, Partly false claim: Continually wearing a mask causes hypercapnia, May 5, 2020; Fact check: Three children have not died from wearing masks in Germany, Oct. 6, 2020", "American Lung Association, Lung Health & COVID-19 FAQ; Steps You Can Take to Get Used to Wearing a Mask; From the Frontlines: The Truth About Masks and COVID-19, June 18, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]