["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Mark Schlereth talks on the set of \"Mike and Mike\" on Jan. 27, 2014.", "ESPN's Mark Schlereth, a former offensive lineman for the Washington Redskins and Denver Broncos, says offenses get all the breaks these days in the National Football League.", "That’s one of the reasons Schlereth is picking the Broncos and quarterback Peyton Manning to beat the Seattle Seahawks in the Super Bowl 31-17.", "The offenses-first trend has spread from NFL policies to refereeing to the contracts teams award players, Schlereth said on Mike & Mike.", "\"We use to say defense wins championships? … Are we now at a place, Mark, with the way the game is played where the offense has the edge?\" asked host Mike Greenberg.", "\"Based on the way all the rules have been for the passing game and to protect the quarterback and you can't hit people, yes, certainly,\" Schlereth said. \"The rules are bent that way for the offense to have the advantage, I think, and that's why you see the majority of teams now spending their dollars on the offensive side of the football.\"", "We decided to dig a little deeper into how the NFL’s 32 teams allocate their salaries to see if Schlereth is correct.", "NFL teams this year have a salary cap of about $123 million, which is generally the maximum teams can spend on players. There are plenty of ways for teams to manipulate that figure, and several teams spend way below the salary cap.", "The NFL Players Association publishes a public report showing overall spending toward the salary cap for each team but not a detailed breakdown by offense vs. defense. To find that, we turned to Spotrac.com, which provides a much more detailed position-by-position analysis. Their reporting is used by USA Today, the Guardian and others to report about NFL spending patterns. In the end, it’s something of an estimate, but it’s the best information publicly available and considered reliable.", "So are NFL teams predominantly spending their money building offenses as Schlereth suggested?", "We’ll start with the big numbers and work backward.", "For the 2013-14 year, the NFL’s 32 teams spent a total of $1.7 billion on offensive players compared to $1.6 billion on defensive players. If you measured the money as a percentage, that would translate to 51.5 percent offense, 48.5 percent defense (the margin is actually closer once you consider that NFL teams spend money on a kicker and punter who are not part of either the offense or defense).", "For perspective, that’s closer than the popular vote in the 2008 and 2012 presidential elections.", "Spending by individual teams varies greatly. The Philadelphia Eagles spent nearly $74 million on offensive players, compared to $38.5 million on defensive players. The Cincinnati Bengals, conversely, spent $69 million on defensive players and $45 million on offensive personnel. (Both of those teams made the playoffs.)", "The Seahawks and Broncos both spend more money on offense, by the way. But while the Broncos are considered the \"offensive\" team, the Seahawks actually spend a few extra million dollars on their offensive team.", "Team", "Offensive spending", "Defensive spending", "Seattle", "$69,386,205", "$51,800,008", "Denver", "$66,084,673", "$47,763,533", "Overall, of the NFL’s 32 teams, 11 spent more money on defense than offense, three teams spent just about the same amount on offense and defense and 18 spent more money on offense than defense. To put that in percentages, a little more than 56 percent of teams spend more on offense and about 44 percent do not.", "That gives the offenses the edge, though not decisively so.", "One last note: By saying \"now,\" Schlereth is suggesting that the move toward spending on offenses is a recent development. That’s not necessarily correct. While salary cap data is harder to come by for previous years, we did find a Sports Illustrated list of all NFL players from 2008 and their salaries.", "In 2008, offensive players made $1.7 billion (the same amount they made in 2013) while defensive players made about $1.52 billion. Part of the difference is simple numbers -- NFL teams paid 85 more offensive players in 2008 than they did defensive players.", "Our ruling", "Schlereth said, \"The majority of teams (are) now spending their dollars on the offensive side of the football.\" We reached out to Schlereth through his chili sauce company (yes, really) but did not hear back.", "There’s definitely evidence that NFL teams are spending more money on offensive players than defensive players. It's part of the reality of NFL football, where the most expensive players are typically quarterbacks.", "But the disparity wasn’t that significant in 2013, and it’s actually less than it was in 2008.", "Schlereth's claim is accurate but needs clarification. We rate it Mostly True.", "ESPN, Mike and Mike, Jan. 27, 2014", "Spotrac.com, NFL cap tracker, Jan. 27, 2014", "NFL Players Association, salary cap report, Jan. 27, 2014", "Sports Illustrated, 2008 NFL contracts, Jan. 27, 2014", "USA Today, 2013 salary cap tracker, Jan. 27, 2014", "Guardian, 2013 salary cap tracker, Jan. 27, 2014", "Email interview with Mike Ginnitti, managing editor of Spotrac.com, Jan. 28, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]