["About this rating", "On Aug. 11, 2019, the New York Post ran a story that repeated uncritically a rumor originating from a convicted fraud and former mob informant. The informant claimed he had heard that “US Attorney General William Barr personally made a hush-hush trip to the [the Metropolitan Correctional Center] two weeks ago, about the time [alleged sex-trafficker Jeffrey] Epstein was found in his cell with bruises around his neck.” Several news outlets repeated this claim, and it became entwined with various vague conspiracy theories alleging a nefarious connection between Barr and Epstein:", "It was unclear what Barr was alleged to have done during his purported visit to the detention facility. The Post article, with the headline “Jeffrey Epstein Could Have ‘Paid’ for Help with Suicide: Former Gotti Pal,” relied solely on the speculative musings of a man named Lewis Kasman. Kasman’s expertise on this topic, according to the Post’s reporting, was that he had visited the same facility where Epstein was being kept “several times” in 1992, when Kasman's boss, mobster John Gotti, was held there.", "Kasman, who had been referred to in media reports as Gotti's \"adopted son,\" gained notoriety after he “ratted out much of the Gambino crime family” as a paid FBI informant beginning in 1995. Years later, in 2010, Kasman would avoid jail time for “obstruction of justice, lying to the FBI, fraud and racketeering” thanks to his previous help aiding the FBI. In 2015, he was arrested in Florida for allegedly stealing money from his own lawyer. He has been the source of dubious claims in the past, including the baseless claim that “John Gotti’s brain was taken to Guantanamo for experiments.”", "We reached out to the U.S. Department of Justice (DOJ) to ask if AG Barr had paid any visit to the Metropolitan Correctional Center (MCC) during the window of time indicated by Kasman. In response, DOJ Office of Public Affairs Director Kerri Kupec called the claim “preposterous,” telling us via email that “Attorney General Barr has never visited MCC.” She added that the suggestion of a quiet visit was dubious as well, reminding us “the Attorney General has 24/7 FBI protective detail. So they would have had to be there, too.”", "We also reached out to Brad Hamilton, the author of the Post story, to ask if Kasman provided any corroborating evidence that made him trust Kasman’s speculation as reportable, given the informant’s history of false or absurd statements. We have not yet received a response. All told, however, the claim has its origins in a man with a history of wild claims whose expertise on the topic is limited to his having made “several” visits to the same prison over two decades earlier. As such, we consider the claim without merit.", "Hamilton, Brad.   “Jeffrey Epstein Could Have ‘Paid’ for Help With Suicide: Former Gotti Pal.”\r\n    New York Post.   11 August 2019.", "Edwards, David.   “Bill Barr Allegedly Made Secret Visit to Jail Before Epstein’s Death: ‘Something’s Not Right There’.”\r\n    Raw Story.   11 August 2019.", "Vankin, Jonathon.   “William Barr Secretly Visited Jail Where Jeffrey Epstein Was Held About Two Weeks Ago, Former Mobster Alleges.”\r\n    Inquisitr.   11 August 2019.", "Capeici, Jerry.   “Dapper Don as Dashing Don; Kasman Spins More Tall Tales.”\r\n    Huffington Post.   25 May 2011.", "Destefano, Anthony M.   “Judge Gives Gotti Confidante Probation on Fraud Charges.”\r\n    Newsday.   16 September 2010.", "Marzullo, John and Sasha Goldstein.   “Lewis Kasman, Mob Rat Who Turned on Gotti’s Gambino Family, Busted in Florida for Theft and Fraud Charges .”\r\n    Newsday.   11 February 2015.", "Hisaka, Mizuki.   “John Gotti’s Brain Was Taken to Guantanamo for Experiments, Claims Adopted Son Lewis Kasman Per ‘Radar Online.’”\r\n    Inquisitr.   21 September 2018.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]