["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Tom Ford won't dress Melania Trump but he didn't call her an escort.", "Michelle Obama once wore a dress designed by Tom Ford, but don’t expect to see the current first lady in one of his gowns any time soon.", "\"Tom Ford refuses to dress Melania Trump,\" reads a post published on Facebook on March 18. It goes on to quote the designer.", "\"I have no interest in dressing a glorified escort who steals speeches and has bad taste in men,\" the post says Ford said about Trump. The text appears above photos of both of them.", "It’s true that Ford has said he won’t dress Melania Trump. But this particular insult-laden quote is manufactured.", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "On The View in November 2016, Ford said: \"I was asked to dress her quite a few years ago and I declined.\" When one of the hosts asks why, he says that she’s not necessarily his \"image.\"", "Though he says he’s a Democrat, he explains that he doesn’t think that Hillary Clinton should have worn his clothes if she had won the presidency, because they’re too expensive.", "Several months later, he told Elle that he thinks whoever is the president or the first lady should wear \"clothes at a price point that are accessible to most Americans, and wearing clothes made in America.\"", "However, Ford denied that he ever called Trump a \"glorified escort.\" He talked to WWD on March 19 after he was rated \"the number-two trending topic on Twitter nationwide,\" according to the publication, because the quote had been attributed to him on the social media platform \"but unsubstantiated by source or date.\"", "\"Never! Never, ever, ever, have I said that Melania was an escort,\" Ford told WWD. \"I’ve never said anything derogatory about Melania. I never would say anything derogatory. It’s so weird, isn’t it, in today’s world the way someone out of nowhere can just make up a random quote and start circulating it on the Internet?\"", "We rate this post as False.", "Facebook post, March 18, 2019", "Vogue, \"King of the carpet: 21 of Tom Ford’s best red carpet moments,\" Aug. 27, 2018", "The View, \"Tom Ford talks Melania Trump, Nocturnal Animals, and more,\" Nov. 30, 2016", "Elle, \"Tom Ford sets the record straight about dressing Melania Trump,\" Jan. 9, 2017", "WWD, \"Exclusive: Tom Ford — don’t put words in my mouth,\" March 19, 2019", "The Washington Post, \"Tom Ford never called Melania Trump a ‘glorified escort,’ but a viral tweet fooled the Internet,\" March 20, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]