["The 23-second clip was published on Facebook here on September 17, 2020.", "Text that reads \"Happy Birthday\" can be seen in the bottom left-hand corner of the video.", "The post’s Hindi-language caption translates to English as: “Mr Modi is celebrating his birthday with top industrialists while farmers in our country are committing suicide, soldiers at borders are dying for no reason, COVID-19 pandemic is at its peak in the country, youths have become unemployed, half of the country has been sold.”", "Indian Prime Minister Narendra Modi was born on September 17, 1950.", "More than 10,000 people engaged in the farming sector died by suicide in 2019, according to India’s crime records bureau.", "India has recorded almost six million Covid-19 cases, according to government statistics on September 28, 2020.", "The country, home to 1.3 billion people, has reported some of the highest daily case jumps in the world recently, AFP reported here on September 16, 2020.", "India’s unemployment rate has also risen in August 2020, according to data from the Indian economy watchdog, Centre for Monitoring Indian Economy.", "The video was shared alongside a similar claim on Facebook here and here.", "The claim, however, is false.", "Reverse image and keyword searches on Google found a longer version of the video published here on the YouTube channel India’s Press Information Bureau.", "The 11-minute video, posted on July 7, 2017, shows Modi’s visit to Israel that month. The video’s title reads: “PM Narendra Modi's visit to GAL Mobile Water Filtration Plant at Dor beach in Israel.”", "Below is a screenshot comparison of the video in the misleading post (L) and the PIB’s YouTube video (R):", "A joint statement from the Indian and Israeli governments was also issued about the visit on July 5, 2017.", "Netanyahu posted a similar video here on his official Twitter in July 2017.", "The Hebrew-language tweet translates to English as: “I rode with Prime Minister Modi in a special water desalination vehicle, capable of supplying drinking water to 22,000 people a day. Israel is a world leader in water circulation. We will cooperate with India in this field.”", "נסעתי עם רה״מ מודי ברכב מיוחד להתפלת מים, שמסוגל לספק מי שתייה ל-22,000 איש ביום. ישראל מובילה בעולם במחזור מים. נשתף פעולה עם הודו בתחום זה pic.twitter.com/EJG361FZX4", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]