["This December 3, 2020, post has an Indonesian-language caption that says: “IT’S OFFICIAL! INTERNATIONAL LAW HAS REMOVED CANNABIS FROM THE LIST OF NARCOTICS DRUGS!! To support the need of the medical industry, the UN voted to remove cannabis from the list of illegal drugs.”", "The post has been shared around 250 times.", "The post also included a video report with a logo from Indonesian news portal Viva.co.id.", "A similar claim also appears in this Facebook post, which has been shared more than 200 times.", "The claim, however, is misleading.", "On December 2, 2020, based on recommendations from the World Health Organization, the UN Commission on Narcotics Drugs (CND) voted to remove cannabis from the list of the most dangerous category of drugs, grouped under Schedule IV of the 1961 Single Convention on Narcotics Drugs.", "Cannabis, however, is still retained in the list of internationally controlled narcotics drugs, as stated in this press release from CND on December 2, 2020.", "The press statement partly says: “In January 2019, the World Health Organization (WHO) made a series of recommendations to change the scope of control of cannabis and cannabis-related substances. After intensive considerations (more information below), the Commission took action today on these recommendations.", "“WHO recommendation to delete cannabis and cannabis resin from Schedule IV of the 1961 Convention, but to maintain it in Schedule I of the 1961 Convention: The Commission decided by 27 votes to 25 and with one abstention to follow this recommendation. Cannabis and cannabis resin will accordingly be deleted from Schedule IV of the 1961 Convention. They remain in Schedule I of the 1961 Convention and thus remain subject to all levels of control of the 1961 Convention.”", "The list of narcotics drugs internationally controlled under the 1961 Convention contains over 130 products, grouped in Schedule I to IV, with each of them having different degrees of control and levels of harmfulness.", "The clip shared in the misleading post is a video report posted on the YouTube channel of Viva.co.id here. Translated from Indonesian to English, the title reads: “The UN No Longer Defines Marijuana as Dangerous Drugs”. The video report  matches the UN’s statement.", "The video’s caption reads, in part: “The UN has finally defined cannabis or marijuana as not dangerous compared with other drugs like heroin. The UN drugs commission removes medical marijuana from the list of dangerous narcotics that can cause addiction… Nevertheless, the UN’s decision does not mean marijuana will be legalised.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]