["“1212 pillars meet in one dot. Built by legendary Indian engineers 1740 yrs ago at Rameshvaram temple.” This message has been shared widely on social media along with a photograph showing a hall with pillars, claimed to be a stupendous architectural feat of ancient India.", "pic.twitter.com/wni6mCgl9J", "— Physics & Astronomy Zone (@ZonePhysics) September 16, 2019", "The above tweet is only the most recent instance of this information being circulated online. Alt News found that it has been shared on social media platforms for the past few years. The Facebook post (below), posted in January 2018, has been shared over 2600 times. Alt News found similar posts dating back to 2016.", "Extremely Precise Indian Engineering.", "It is such engineering marvels our Govts should showcase to the world, as the…", "Posted by Guru Prasad on Saturday, January 13, 2018", "The same was posted in January 2018 by S. Gurumurthy, part time director of the RBI.", "Look at this fantastic engineering and architectural marvel at Rameshwaram temple..several hundred years old. pic.twitter.com/LzvDYjqrvr", "— S Gurumurthy (@sgurumurthy) January 22, 2018", "Alt News searched Google with the information available in the info-graphic. Using the key words ‘1212 pillars Rameshwaram temple’, we found that architecture containing exactly 1212 pillars pertains to the Ramanathaswamy temple, at Rameshwaram in Tamil Nadu. The temple has 1212 pillars in the outer corridor, considered to be the longest temple corridor in the world. This information is available on the website of the Ramanathaswamy temple.", "The claim, insofar as it states that there is a hall of 1212 pillars at the Rameshwaram temple, is correct, Interestingly however, the outer corridor (or third corridor), which has 1212 pillars, looks nothing like the picture circulated on social media. A photograph of the corridor at the Ramanathaswamy temple is posted below.", "Since the photograph which has been shared with the claim does not represent the temple at Rameshwaram, Alt News used the reverse-image search tool to establish its origin. In the search result, we found photos of a similar hall with pillars, uploaded on the stock photography website, Getty Images.", "According to Getty Images, the photo is of Hoshang Shah’s tomb in Mandu, Madhya Pradesh.", "The above picture comes closest in resemblance to the viral image. A similar image was uploaded by a Facebook user in August this year, stating it was taken at Hoshang Shah’s tomb.", "It is worthwhile to note that the pillars do not “meet in one dot” as seen in the viral photo. This suggests that the photograph shared so widely on social media, is photoshopped. Alt News could not find the precise image from any credible source. Moreover, a closer look at the viral image reveals that the pillars on the left have been photoshopped, as the damage visible on the pillar in the foreground is replicated in the other pillars.", "The Ramanathaswamy temple at Rameshwaram, as it stands today, was built in the 12th century by the Pandya dynasty, which had its capital at Madurai in Tamil Nadu. The temple is among the finest specimens of Dravidian architecture, of which colonnades are a key feature.", "The tomb of Hoshang Shah, built in the 15th century CE in the then kingdom of Malwa, on the other hand is a classic example of Indo-Islamic architecture, drawing influence and inspiration from Islamic as well as Hindu motifs. It is pertinent to note that the earliest forms of elaborate Dravidian architecture date back to the 7th century CE. In contrast, Indo-Islamic architecture developed from the late 12th century CE, following the capture of Delhi by the Ghurid dynasty.", "A photograph taken at Hoshang Shah’s tomb in Mandu, MP was photoshopped and shared widely across social media platforms with the false claim that it represents an architectural marvel of ancient India. Additionally, the claim that the temple at Rameshwaram was built 1740 years ago, is false. The temple dates back to the 12th century CE, whereas the architecture of Mandu is from the 15th century CE. The same has been fact-checked by SMHoaxSlayer and Factly.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]