["About this rating", "A recurring refrain issuing from President Trump's Twitter account ever since he won the 2016 election by 74 electoral votes in November holds that he was robbed of a victory in the popular vote count (which Hillary Clinton won by 2,865,075 votes) due to at least 3 million illegal ballots cast by non-citizens.", "The documentation offered to support this assertion has ranged from vague to nonexistent. When asked to defend it in a 24 January 2017 press conference, White House Press Secretary Sean Spicer stated that Trump's belief that there was massive voter fraud in 2016 was \"based on studies he's seen.\" Pressed to cite such a study, Spicer said, \"There's one that came out of Pew in 2008 that showed 14 percent of people who voted were non-citizens.\"", "Albeit mistaken about both its origins (it was written by researchers at Old Dominion University using data collected by the Cooperative Congressional Election Study, not Pew) and findings (it did not remotely show that 14 percent of the electorate — amounting to 18 million voters — were non-citizens), Spicer was, at least, alluding to an actual study.", "In fact, the same study was cited for the same purposes two days after the press conference in a Washington Times article stating that Hillary Clinton benefited to the tune of 834,381 non-citizen votes in the 2016 election:", "Hillary Clinton garnered more than 800,000 votes from non-citizens on Nov. 8, an approximation far short of President Trump’s estimate of up to 5 million illegal voters but supportive of his charges of fraud.", "Political scientist Jesse Richman of Old Dominion University in Norfolk, Virginia, has worked with colleagues to produce groundbreaking research on non-citizen voting, and this week he posted a blog in response to Mr. Trump’s assertion.", "Based on national polling by a consortium of universities, a report by Mr. Richman said 6.4 percent of the estimated 20 million adult non-citizens in the U.S. voted in November. He extrapolated that that percentage would have added 834,381 net votes for Mrs. Clinton, who received about 2.8 million more votes than Mr. Trump.", "The study in question was published in the December 2014 issue of the journal Electoral Studies, titled: \"Do Non-Citizens Vote in U.S. Elections?\" Its authors, Jesse T. Richman, Gulshan A. Chattha, and David C. Earnest of Old Dominion University in Norfolk, Virginia, sought to contribute hard data to the ongoing, largely partisan debate over how much voter fraud actually occurs in the United States. Richman and Earnest summarized their research in a 24 October 2014 article in the Washington Post:", "Our data comes from the Cooperative Congressional Election Study (CCES). Its large number of observations (32,800 in 2008 and 55,400 in 2010) provide sufficient samples of the non-immigrant sub-population, with 339 non-citizen respondents in 2008 and 489 in 2010. For the 2008 CCES, we also attempted to match respondents to voter files so that we could verify whether they actually voted.", "How many non-citizens participate in U.S. elections? More than 14 percent of non-citizens in both the 2008 and 2010 samples indicated that they were registered to vote. Furthermore, some of these non-citizens voted. Our best guess, based upon extrapolations from the portion of the sample with a verified vote, is that 6.4 percent of non-citizens voted in 2008 and 2.2 percent of non-citizens voted in 2010.", "Because non-citizens tended to favor Democrats (Obama won more than 80 percent of the votes of non-citizens in the 2008 CCES sample), we find that this participation was large enough to plausibly account for Democratic victories in a few close elections.", "To be clear, when Sean Spicer cited this study to support Trump's assertion that millions voted illegally in the 2016 election, he was referring to a set of extrapolations made in 2014 based on data collected by another research group in 2008 and 2010.  Further, the validity of those extrapolations has been repeatedly challenged by the original pollsters (more about that later). Just as importantly, the lead author of the study advancing those extrapolations, Jesse Richman, has said that even if their conclusions were 100 percent valid — which, again, is in question — they don't confirm Trump's claim that \"millions\" voted illegally:", "Donald Trump recently suggested that his deficit in the popular vote to Clinton might be due entirely to illegal votes cast, for instance by non-citizens.  Is this claim plausible?  The claim Trump is making is not supported by our data.", "Here I run some extrapolations based upon the estimates for other elections from my coauthored 2014 paper on non-citizen voting.  You can access that paper on the journal website here and Judicial Watch has also posted a PDF.  The basic assumptions on which the extrapolation is based are that 6.4 percent of non-citizens voted, and that of the non-citizens who voted, 81.8 percent voted for Clinton and 17.5 percent voted for Trump.  These were numbers from our study for the 2008 campaign.  Obviously to the extent that critics of my study are correct the first number (percentage of non-citizens who voted) may be too high, and the second number (percentage who voted for Clinton) may be too low.", "The count of the popular vote is still in flux as many states have yet to certify official final tallies.  Here I used this unofficial tally linked by Real Clear Politics.  As of this writing Trump is 2,235,663 votes behind Clinton in the popular vote.", "If the assumptions stated above concerning non-citizen turnout are correct, could non-citizen turnout account for Clinton’s popular vote margin? There is no way it could have.  6.4 percent turnout among the roughly 20.3 million non-citizen adults in the US would add only 834,318 votes to Clinton’s popular vote margin.  This is little more than a third of the total margin.", "Is it plausible that non-citizen votes added to Clinton’s margin.  Yes.  Is it plausible that non-citizen votes account for the entire nation-wide popular vote margin held by Clinton?  Not at all.", "Returning to the Washington Times piece defending Trump's assertion about illegal voters (see top of page), the article creates the impression, perhaps intentionally, that Richman conducted fresh research using new data from the 2016 election. However, in a 27 January 2017 open letter to the Times, Richman objected that both his research and his own comments about the research were misrepresented:", "I do not support the Washington Times piece", "Dear Washington Times,", "As a primary author cited in this piece, I need to say that I think the Washington Times article is deceptive. It makes it sound like I have done a study concerning the 2016 election. I have not. What extrapolation I did to the 2016 election was purely and explicitly and exclusively for the purpose of pointing out that my 2014 study of the 2008 election did not provide evidence of voter fraud at the level some Trump administration people were claiming it did. I do not think that one should rely upon that extrapolation for any other purpose. And I do not stand behind that extrapolation if used for ANY other purpose.", "Best Regards,", "Jesse Richman", "Finally, we must address the question of whether the extrapolations Richman et al made in their 2014 study were valid in the first place. Let us turn to one of the pollsters who compiled the original Cooperative Congressional Election Study voter data in 2008 and 2010, Brian Schaffner, who wrote:", "As a member of the team that produces the datasets upon which that study was based and as the co-author of an article published in the same journal that provides a clear “take down” of the study in question, I can say unequivocally that this research is not only wrong, it is irresponsible social science and should never have been published in the first place. There is no evidence that non-citizens have voted in recent U.S. elections.", "Although based on precisely the same data as Richman's, Schaffner's conclusion could not be more starkly different. To simplify his argument (which we encourage all to read in full), the Richman study failed to account for measurement error — specifically, it failed to account for the frequency with which survey respondents may have incorrectly identified themselves as \"non-citizens\":", "Such errors are infrequent, but they happen in any survey. In this case, they were crucial, because Richman and his colleagues saw the very small number of people who answered that they were “immigrant non-citizens,” and extrapolated that (inaccurate) number to the U.S. population as a whole.", "How do we know that some people give an inaccurate response to this question? Well, we actually took 19,000 respondents from one of the surveys that Richman used (the 2010 study) and we interviewed them again in 2012. A total of 121 of the 19,000 respondents (.64 percent) identified themselves as immigrant non-citizens when they first answered the survey in 2010. However, when asked the question again in 2012, 36 of the 121 selected a different response, indicating that they were citizens. Even more telling was this: 20 respondents identified themselves as citizens in 2010 but then in 2012 changed their answers to indicate that they were non-citizens. It is highly unrealistic to go from being a citizen in 2010 to a non-citizen in 2012, which provides even stronger evidence that some people were providing incorrect responses to this question for idiosyncratic reasons.", "Correcting for those errors, says Schaffner, the likely number of non-citizen voters in the 2016 election turns out to be not 5 million, nor 3 million, nor even 800,000, but zero.", "Ansolabehere, Stephen, Luks, Samantha and Schaffner, Brian F.   \"The Perils of Cherry Picking Low Frequency Events in Large Sample Surveys.\"\r\n   CCES.   5 November 2014.", "Chattha, Gulshan A., Earnest, David C. and Richman, Jesse T.   \"Do Non-Citizens Vote in U.S. Elections?\"\r\n   Electoral Studies.   December 2014.", "Richman, Jesse.   \"I Do Not Support the Washington Times Piece.\"\r\n   27 January 2017.", "Richman, Jesse.   \"Is It Plausible that Non-Citzen Votes Account for the Entire Margin of Trump's Popular Vote Loss to Clinton?\"\r\n   28 November 2016.", "Richman, Jesse and Earnest, David.   \"Could Non-Citizens Decide the November Election?\"\r\n   The Washington Post.   24 October 2014.", "Scarborough, Rowan.   \"Trump Argument Bolstered: Clinton Could Have Received 800,000 Votes from Noncitizens.\"\r\n   The Washington Times.   26 January 2017.", "Schaffner, Brian.   \"Trump's Claims About Illegal Votes Are Nonsense. I Debunked the Study He Cites as 'Evidence.'\"\r\n   Politico.com.   29 November 2016.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]