["Texas Gov. Greg Abbott warned at a Washington, D.C. press conference that without fresh restrictions on who enters the U.S., the Islamic State could slip in attackers.", "Compounding \"these dangers,\" Abbott went on, \"the president himself has granted waivers allowing into the United States refugees who provided material support to terrorists.\"", "Barack Obama did that?", "Abbott didn’t respond to requests for backup. Meantime, we learned waivers have been granted to admit terrorist-connected refugees for about a decade though the waivers weren’t any president’s call nor is \"material support\" always as threatening as it might sound.", "A web search initially led us to a September 2015 post by Judicial Watch, a conservative group that litigates on public corruption, stating that according to a federal report, 1,519 \"inadmissible\" foreigners had been approved to enter the U.S. in 2014 by Jeh Johnson, the Homeland Security secretary--and more than half the candidates had provided material support to terrorists. \"After a case-by-case review,\" Judicial Watch said, Johnson \"determined that the recently admitted terrorists only participated in these activities ‘while under duress.’\"", "Federal report to Congress", "The cited September 2015 report to Congress came from U.S. Citizenship and Immigration Services, an agency that’s part of Homeland Security. It states that Johnson, in consultation with the U.S. secretary of state and attorney general, had determined at his \"sole unreviewable discretion\" that restrictions in the Immigration and Nationality Act, the main federal law regulating U.S. immigration procedures, \"shall not apply.\"", "The act’s section 212 (a)(3)(B) bars from entry anyone who \"has engaged in\" or incited \"a terrorist activity\" or is considered likely to do so and anyone who’s a representative or member of a terrorist group or received military training from one. It further blocks a member of a group that endorses or espouses terrorist activity unless the person can demonstrate \"by clear and convincing evidence\" he or she didn’t know, and shouldn’t reasonably have known, that the group was terrorist.", "The law also invokes material support, which \"includes actions such as providing a safe house, transportation, counterfeit documents or funds to a terrorist organization or its members. It also includes any action that can assist a terrorist organization or one of its members in any way, such as providing food, helping to set up tents, distributing literature or making a small monetary contribution,\" USCIS sums up.", "The report states the 1,519 exemptions processed in the 12 months through September 2014 included 627 for an applicant’s provision of material support, \"while under duress,\" to a terrorist organization that has never targeted U.S. interests or persons as well as 189 for giving material support, while under duress, to one of more than 50 foreign terrorist organizations designated by the Secretary of State (including Boko Haram, the Palestinian Liberation Front, Al Qaeda and the Islamic State of Iraq and the Levant) or one of another 50-plus groups placed by the secretary, in accord with the USA Patriot Act of 2001, on the government’s terrorist exclusion list.", "See all the reasons refugees were approved for waivers here.", "Each waiver is handled on a case-by-case basis, the report says, \"after careful review of all factors and all security checks have cleared.\" A Homeland Security spokeswoman, Marsha Catron, responded to our query about Abbott’s statement by stressing the government's general background checks of refugees.", "Waivers rooted in law", "Obama has no statutory role in granting the waivers, legal experts told us, while Congress has gradually widened the discretion of the secretaries of State and Homeland Security to do so. The Patriot Act, enacted shortly after the 9/11 attacks, and the REAL ID Act in 2005 included important provisions, according to a September 2015 article in the Brigham Young University Law Review, and the Consolidated Appropriations Act of 2008 expanded the waiver authority of executive officials, permitting the Secretary of State in consultation with the Secretary of Homeland Security and the attorney general to waive nearly all terrorism-related exclusions built into law.", "Judicial Watch’s post noted a February 2014 \"notice of determination\" issued by the departments of State and Homeland Security stating the terrorist exclusion law \"shall not apply with respect to an alien who provided limited material support\" to such a group such as \"certain routine commercial transactions or certain routine social transactions (i.e., in the satisfaction of certain well-established or verifiable family, social, or cultural obligations), (2) certain humanitarian assistance, or (3) substantial pressure that does not rise to the level of duress, provided, however, that the\" individual is otherwise qualified for admission, has cleared background and security checks and poses no danger to the U.S., among conditions.", "Jennifer Daskal, an American University law professor, said the notice looks in step with existing law. Broadly, Daskal elaborated by email, Congress authorized such waivers to protect groups that could otherwise be barred from entry, such as Montagnards and Hmong, who fought alongside the U.S. during the Vietnam war from being denied visas as \"material supporters of terrorism\" and, Daskal said, to protect rape victims who were forced into servitude by groups like the Lord’s Resistance Army in Uganda from being denied visas on terrorism grounds, among problematic situations. By phone, David A. Martin, former principal deputy general counsel for Homeland Security in the Obama administration, said the waiver power was initially applied by Bush’s secretary of state, Condoleezza Rice.", "The lawyers said Abbott’s mention of \"material support\" could leave the misimpression that refugees admitted by waiver pose dangers. Under the law, Martin said, even someone who provides a bowl of rice at gunpoint to a terrorist could be excluded from entering as a refugee-- absent a waiver. Wadie E. Said, professor of law at the University of South Carolina, called the \"material support\" part of the law \"exceedingly broad,\" leaving no room for nuance.", "Our ruling", "Abbott said \"the president himself has granted waivers allowing into the United States refugees who provided material support to terrorists.\"", "The Homeland Security secretary--not the president--grants case-by-case waivers in accord with federal law enabling people with tenuous connections to terrorist groups to be admitted as refugees.", "This claim ignores the fact that material support under the law doesn’t always mean someone has committed or supported violent acts. Unsaid too: The law permitting the waivers predates Obama’s presidency.", "We rate this statement Mostly False.", "MOSTLY FALSE – The statement contains an element of truth but ignores critical facts that would give a different impression.", "Click here for more on the six PolitiFact ratings and how we select facts to check.", "Web post, \"U.S. Gives 1,519 Engaged in Terrorism 'While Under Duress' Residency, Asylum,\" Judicial Watch, Sept. 29, 2015", "Notice in the Federal Register, \"Exercise of Authority Under Section 212(d)(3)(B)(i) of the Immigration and Nationality Act,\" a notice by the Homeland Security Department and State Department, Feb. 5, 2014", "Web page, \"Terrorism-Related Inadmissibility Grounds (TRIG),\" U.S. Citizenship and Immigration Services, Department of Homeland Security, last updated Oct. 1, 2014 (accessed Dec. 14, 2015)", "Report, \"Report on the Secretary’s Application of the  Discretionary Authority Contained in Section  212(d)(3)(B)(i) of the Immigration and Nationality Act,\" USCIS, Sept. 24, 2015 (fetched from Judicial Watch website)", "Article, \"Requiring a Nexus to National Security: Immigration, 'Terrorist Activities,' and Statutory Reform,\" BYU Law Review, August 2015 (accessed Dec. 14, 2015)", "Report, \"Immigration: Terrorist Grounds for Exclusion  and Removal of Aliens,\" Congressional Research Service, Jan. 12, 2010 (accessed Dec. 14, 2015)", "Document, \"Statement by Homeland Security Secretary Michael Chertoff on the Intention to Use Discretionary Authority for Material Support to Terrorism,\" Department of Homeland Security, Jan. 19, 2007 (accessed on ILW.com website, Dec. 14, 2015)", "Federal law, Section 212 (a)(3)(B) of Immigration and Nationality Act, \"ACT 212 - GENERAL CLASSES OF ALIENS INELIGIBLE TO RECEIVE VISAS AND INELIGIBLE FOR ADMISSION; WAIVERS OF INADMISSIBILLITY,\" U.S. Citizenship and Immigration Services (accessed Dec. 8, 2015)", "Lists, \"Foreign Terrorist Organizations\" as designated by U.S. secretary of state, Bureau of Counterterrorism, U.S. Department of State, undated; \"Terrorist Exclusion List Designees,\"  (accessed Dec. 8, 2015)", "Telephone interviews, David A. Martin, Warner-Booker Distinguished Professor of International Law, University of Virginia, Dec. 14 and 16, 2015", "Web post, \"Material Support to Terrorism — Consequences for Refugees and Asylum Seekers in the United States,\" Migration Policy Institute, Jan. 30, 2008", "Telephone interviews, Wadie E. Said, professor, University of South Carolina School of Law, Dec. 14 and 16, 2015", "Emails, Jennifer Daskal, assistant professor of law, Washington College of Law, American University, Dec. 14-16, 2015", "Email, Marsha Catron, press secretary, U.S. Department of Homeland Security, Dec. 8, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]