["Sen. Shelley Moore Capito, R-W.Va., in 2018. (AP)", "Sen. Shelley Moore Capito, R-W.Va., recently sought to raise awareness about suicide, focusing on its toll in her home state.", "\"On average, one person dies by suicide every 22 hours in West Virginia,\" Capito said in a Facebook post on Sept. 19.", "She went on to note her efforts with two Senate colleagues, Cory Gardner, R-Colo., and Doug Jones, D-Ala., to pass the Suicide Training and Awareness Nationally Delivered for Universal Prevention, or STANDUP, Act, which would expand efforts to educate young people about mental health resources.", "Is Capito correct about the frequency of suicide in West Virginia? Capito’s office did not respond to an inquiry for this article, but we were able to find statistics that backed up her assertion.", "We turned to the Center for Disease Control and Prevention’s WISQARS database, which includes data as recently as 2017. The database shows that there were 393 suicides in West Virginia.", "With 8,760 hours in a year, that comes out to about one suicide every 22.3 hours, making Capito’s statistic correct.", "According to the American Foundation for Suicide Prevention, suicide is the 10th most common cause of death in West Virginia. It ranks even higher for certain age groups, ranking second among those between 15 and 34 and fourth among those between 35 and 54. On a per capita basis, West Virginia has the eighth-highest rate of suicide in the nation.", "We checked with both the American Foundation for Suicide Prevention and University of Denver associate professor of social work Stacey Freedenthal, a specialist in suicide, and both agreed that there are no complications with the data that would undercut Capito’s statement.", "Capito said, \"On average, one person dies by suicide every 22 hours in West Virginia.\" This statistic is backed up by official data from the Centers for Disease Control and Prevention, so we rate her statement True.", "Shelley Moore Capito, Facebook post, September 19, 2019", "Center for Disease Control and Prevention’s WISQARS database, accessed Nov. 5, 2019", "American Foundation for Suicide Prevention, State Facts, accessed Nov. 5, 2019", "Email interview with University of Denver associate professor of social work Stacey Freedenthal, Oct. 23, 2019", "Email interview with AFSP Public Relations Director Alexis O’Brien, Oct. 30, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]