["Florida House Republicans are following President Donald Trump’s lead by supporting legislation that requires jurisdictions to do away with practices that shield undocumented immigrants, which are known as \"sanctuary cities.\"", "Rep. Larry Metz, R-Yalaha, sponsored a proposal (HB 697) that would require county and local law enforcement agencies to comply with and support enforcement of federal immigration law or face stiff penalties.", "The bill has moved along party lines in a couple of House committee hearings. It needs a full vote in the House and approval in the Senate, where it has not been heard at all, before it can reach Gov. Rick Scott’s desk and become law..", "Rep. Carlos Guillermo Smith, D-Orlando, has raised strong objections.", "Smith tried to weaken the bill with six filed amendments in a March 21 hearing.", "After all six of his attempts failed, Smith argued that the bill’s enforcement penalties are uniquely harsh.", "\"It will be the only law of its kind in the nation,\" Smith said.", "This made us wonder: Is Florida considering one-of-a-kind legislation for sanctuary cities?", "It looks like Smith is basically right, if the law didn't undergo any significant changes and was signed by Scott.", "National experts agree that — to the best of their knowledge — while other states have taken up bills on sanctuary cities, no other law or pending bill goes as far in terms of the breadth of the prohibitions and the penalties imposed in HB 697.", "HB 697 offers an orginal mix of penalties", "There is no legal definition for sanctuary policies. The term is used to describe places that limit cooperation with federal immigration authorities.", "The Trump administration has begun calling out cities and counties with these policies, and he promised to cancel all funding of sanctuary cities.", "Cities and counties that choose not to actively assist federal authorities in carrying out immigration enforcement duties argue that such practices negatively impact police-community relations, and that ultimately it's not their responsibility to enforce federal laws.", "Some argue that the tactics used to enforce these policies border on unconstitutional, too.", "The main way agencies refuse to comply is to not honor written requests from U.S. Immigration and Customs Enforcement to detain individuals for up to 48 hours longer than they would have been released.", "Metz’s bill doesn’t call out any specific places in Florida as sanctuary cities, but a staff analysis does mention a 2010 Miami-Dade policy as an example of place that might be affected by this bill. The county’s policy said that ICE detainers would only be honored if the federal government reimbursed the costs incurred.", "Miami-Dade mayor Carlos Giménez reversed the policy in January, putting him in the realm of compliance with Metz’s legislation.", "A major component of Metz’s HB 697 requires state and local entities, as well as law enforcement agencies to comply with the enforcement of federal immigration law 90 days after the law goes into effect.", "If they don’t? Cities and counties with those policies would face penalties that include:", "• a five-year suspension on receiving non-federal grant money from state and local entities that don’t honor immigration enforcement;", "• The threat of automatic suspension and removal from office for elected state officials accused of violating sanctuary prohibition policy;", "• A prohibition of public funds to reimburse or defend a public official who is accused of violating a sanctuary prohibition policy; and", "• civil fines if detainers are not honored starting Oct. 1.", "Smith said his research shows no other law in the United States goes that far.", "Smith found that Alabama, Georgia, Utah and North Carolina have laws that require entities to honor all ICE detainer and information requests, but still don’t go as far as HB 697.", "For example, Alabama law restricts funds, grants, or appropriations until a violation has ceased, but doesn’t have a provision to have a civil cause of action against an official if a person is injured by an undocumented immigrant.", "Georgia law authorizes local officials to cooperate with federal immigration officials, but doesn’t require it.", "Utah restricts sanctuary policies, but does not prescribe penalties.", "And North Carolina prohibits sanctuary cities, but there’s no enforcement mechanism.", "In addition, Indiana has a law that prohibited local governments from refusing to cooperate with federal immigration authorities, but the penalties are lacking.", "It can be hard to say for certain if Smith is right, but national immigration experts agree with Smith’s point.", "\"If passed, that statement is accurate in that no such law is currently on the books, although several state anti-sanctuary bills are pending with some similar provisions,\" said Avideh Moussavian, a policy attorney at the National Immigration Law Center.", "Smith’s research encompassed pending bills in other legislatures. While many states have pending legislation supporting compliance with ICE, he found, once again, that none of the penalties went as far as HB 697.", "Ann Morse, the director of the Immigrant Policy Project for the National Conference of State Legislatures, said her group is looking into 100 bills in more than 30 states related to local law enforcement and immigration.", "Morse said she couldn’t find any pending legislation with quite the penalties listed above.", "We also reached out to Monica Varsanyi, an associate professor at political science at the John Jay College of Criminal Justice, CUNY. Her research explores the explosion of state- and local-level \"immigration\" policy-making and she has authored several reports over the years regarding the topic.", "\"I can say that I haven’t seen anything like this bill,\" Varsanyi said. \"I can’t be 100 percent sure that there aren’t others out there, however.\"", "Three other immigration law experts from around the country gave a similar assessment.", "The only other state considering a bill anywhere close to Florida’s bill is Texas, which is considering a piece of legislation that would prohibit sanctuary city policies and apply some of the same penalties included in HB 697, including withholding grant money and civil fines.", "The penalties in Florida’s bill go further by restricting grant funds for up to five years. Texas’ bill only withholds funds for the following year.", "Metz told PolitiFact Florida he got the idea to withhold grant money from the Texas bill but considered its language too general. Because this is the second year Metz has proposed this type of legislation, he was able to survey bills from the 2016 and 2017 session to see what was out there before finalizing HB 697.", "\"In some of the bills I surveyed, this year, they were looking at making it a criminal violation to have a sanctuary policy,\" Metz said. \"I did not go that route. I felt it should remain in the civil arena, but with significant penalties.\"", "Our ruling", "Smith said that a proposed crackdown on Florida’s \"sanctuary cities\" HB 697 would be the \"only one of its kind in the nation.\"", "Several states have come up with bills targeting so-called sanctuary cities. Among them, HB 697 in its current form is indeed unique in terms of the severity of the prohibitions and penalties against state and local entities that choose not to comply with federal immigration detainer requests. The Texas Legislature appears to have the next-closest version of this legislation.", "We rate this statement Mostly True.", "Email interview, Ann Morse, director, Immigrant Policy Project, National Conference of State Legislatures, March 28", "Email interview, Monica Varsanyi, an associate professor at political science at John Jay College of Criminal Justice, CUNY, March 28", "Email interview, Avideh Moussavian, a policy attorney at the National Immigration Law Center, March 29.", "Email Interview, Bill Hing, professor of law, School of Law, University of San Francisco, March 27", "Email interview, Kevin Johnson, dean and professor of immigration and refugee law, University of California - Davis School of Law, March 27", "Email interview, Gabriel \"Jack\" Chin, immigration law scholar at the University of California-Davis, March 27", "Email interview, Rep. Carlos Guillermo Smith, March 27", "Interview, Ida V. Eskamani, legislative aide to Rep. Smith, March 23", "Interview, Rep. Metz, March 28", "ACLU, immigration detainers", "Texas state legislature online, SB 4", "NCSL, Sanctuary City FAQ", "The Indy Channel, \"In Indiana, no 'sanctuary cities' thanks to 2011 law,\" Jan. 26", "Florida House, HB 697, filed Feb. 7", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]