["About this rating", "In March 2017, an undated story from Meganews360.com made the rounds, detailing an alleged prison break in Fij. The headline reads, \"BREAKING: Twenty Dead After 85 Criminals Escaped From Cells In 'Armed Prison Break' In Fiji.\"", "Yet the story begins with an entirely different description, contradicting itself from the outset:", "Ten people have died after a \"violent prison break\", with 244 criminals escaping from their cells and fleeing the area in what officials have called a \"mutiny\".", "According to Meganews360.com, the Fijian government \"condemned\" the incident via tweet (it has not). A spokesperson for the Fiji Corrections Centre in Suva, where the story was set, confirmed to us that no such escape had taken place. Some aspects of the story, though, appear to be lifted from an October 2016 Reuters report about an actual prison break by 174 inmates (but that was in Haiti, not Fiji).", "Besides publishing the fake \"prison break\" story, Meganews360 (which is not to be confused with the News360 app) has reproduced, without attribution, a Georgia television station's report on a local sheriff's comments regarding Peach County Sheriff's Deputy Daryl Smallwood, who was shot in the line of duty in November 2016. Smallwood died shortly after the original story was published.", "The site also seems to have lifted portions of a Huffington Post report that same month that singer Stevie Wonder, who is blind, quipped that asking him to vote for Donald Trump was like asking him to drive.", "The site has also circulated a different version of another suspicious story, allegedly concerning the execution of Ugandan pastors in Saudi Arabia for \"fornication.\" While the original story said three people had been put to death, Meganews360's version pared that down to two.", "Reuters.   \"Mass Prison Break, 174 Inmates Flee After Killing Guard.\" \r\n    Accessed via The Fiji Times.   24 October 2016.", "Finley, Taryn.   \"Stevie Wonder: Voting for Trump Is Like Asking Me to Drive\"     The Huffington Post.   7 November 2016.", "Lilly, Shannon.   \"Crisp Co. Sheriff Recalls Dep. Smallwood as Positive, Upbeat Man.\" \r\n    WGXA-TV.   7 November 2016.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]