["Good news, opponents of job growth (whoever you are): Tallahassee lawmakers are out to make it harder and costlier to create jobs.", "That’s the thrust of a TV ad airing in Tampa Bay from the business-backed lobbying group Associated Industries of Florida. The group does not want the insurance industry to lose a tax break it has enjoyed for more than three decades. Here’s the transcript:", "\"It's the working tax cut that creates jobs -- over 40,000 new jobs in just the last four years. Major employers are moving to Florida and hiring. That's growth our economy needs. But now some in Tallahassee want to end it and make it harder and more expensive to create jobs. It doesn't make sense. Say no to Senate Bill 1832. Keep the working tax cut. Keep the jobs.\"", "The ad ignores the real keywords of this debate, which are \"insurance companies\" and \"motor vehicle registration fees.\"", "\"Working tax cut\" is a euphemism for \"taxpayer-subsidized premium tax credit.\" Since 1987, insurance companies use a 15 percent premium tax credit for Florida-based employees, excluding insurance agents.", "The Senate’s chief budget-writer, Sen. Joe Negron, R-Stuart, proposed eliminating the tax credit in exchange for rolling back the Legislature’s 2009 hike on motor vehicle registration fees, a move that will save vehicle owners $12 a year.", "We wondered what evidence AIF had to support its claim that this 26-year-old tax cut created 40,000 jobs in the last four years.", "Debunking the jobs number", "AIF’s public relations consultant, Bascom Communications and Consulting, directed us to 2009 and 2011 reports about the state’s insurance industry by the Florida Office of Insurance Regulation (the 2012 report is not out yet). The reports run a year or two behind for job estimates for the industry. The 2011 annual report references 2010 jobs data, and the 2009 report includes 2007 jobs data.", "According to state reports, the insurance industry accounted for 144,184 jobs in Florida in 2007 and grew to 188,290 in 2010. Boom, AIF says, 44,106 new insurance jobs created.", "Not so fast. This picture of dramatic jobs growth is not supported by evidence.", "The state reports cited by AIF say their jobs data is backed up by two sources: the Bureau of Economic Analysis, run by the U.S. Department of Commerce; and the Bureau of Labor Statistics, run by the U.S. Department of Labor.", "State insurance regulators were still collecting information about how it compiles its data by our deadline. It appears, though, that the dramatic jobs growth AIF is crowing about is the result of the state using two very different starting places to calculate job growth.", "Here's what most likely happened:", "The state's count for insurance jobs in 2007 (the 144,184 number) is backed by BEA jobs data for full- and part-time wage and salary employees, excluding proprietors and general partners.", "But the 2010 state number relied on a different calculation, one that includes proprietors and general partners.", "It's a significant difference.", "An apples-to-apples comparison of job growth -- whether or not you include proprietors and general partners -- shows that the state actually lost insurance industry jobs between 2007 and 2010.", "We'll say that again. If the state compared the same set of data -- either one -- they would have found that the state lost insurance industry jobs between 2007 and 2010.", "BLS data does not help, either. From December 2007 to December 2010, the industry gained 100 jobs, according to BLS. Not 40,000.", "Does the credit lead to jobs?", "Tax credits save businesses money.", "But is this one entirely responsible for an uptick in insurance jobs?", "\"Extremely unlikely,\"  said William Seyfried, Rollins College economics professor. \"General economic conditions and other factors would be expected to have a larger impact.\"", "Florida should enact a premium tax break for every industry \"and just watch the jobs pour in,\" joked Sean Snaith, a University of Central Florida economist.", "The business-backed research and advocacy group Florida TaxWatch created a brief report detailing its concerns with ending the tax credit, which the group said was created to encourage \"mobile jobs\" that are administrative or in call centers (our analysis does not get into whether the credit created the kind of jobs it was supposed to, though lobbyists ticked off a few recent examples of call centers opening in Tampa and other Florida cities recently).", "TaxWatch argued this tax cut, while not the primary reason companies come to Florida, may be the tie-breaker, and it offsets the insurance industry’s disproportionate tax burden compared to other industries.", "\"While there has been no research attempting to show a direct correlation between the tax credit and growth of the insurance industry in Florida,\" the report states, \"it is hard to argue that Florida’s business climate is more attractive to insurers with the credit than without it.\"", "AIF's own lobbyist, Brewster Bevis, said at an April 18 committee hearing on SB 1832, \"One of the reasons for the job creation and industry growth in the face of national economic uncertainty has been the attractiveness of Florida as a place to do business due to the premium tax cut that this bill would do away with.\"", "Several insurance lobbyists at the meeting testified SB 1832 would increase the industry’s tax burden on top of what carriers will pay in additional taxes under the new national health care law. Several Republican senators were skeptical, saying the Legislature had historically worked to improve the business climate for the insurance industry and too many years had passed since the tax incentive was reviewed.", "Repealing the insurance tax credit would bring about $230 million to state coffers each year, which would pay for reducing motor vehicle fees, according to a committee analysis.", "\"Not only will this bill rid our state of an antiquated government subsidy for the insurance industry, but, more importantly, it will keep money in the pockets of our hard-working taxpayers,\" said Senate President Don Gaetz, R-Niceville, in a statement.", "Our ruling", "AIF rolled out a big ad campaign to combat SB 1832, saying the insurance industry’s \"working tax cut\" created \"over 40,000 new jobs in just the last four years.\"", "The problem is the number, which is cherry-picked and wrong.", "And even if the jobs number was right -- and again, it's not -- experts say the tax cut would only be one factor in a company's decision to expand operations in Florida.", "We rate AIF's claim Pants on Fire!", "YouTube, \"Keep the working tax credit,\"  April 12, 2013", "Tom Feeney op-ed for Florida Voices, \"Insurance industry still needs its 30-year-old tax break,\" April 7, 2013", "Florida Office of Insurance Regulation, 2011 annual report, 2009 annual report, 2008 annual report", "Interview with Kristen Bridges and Sarah Bascom, Bascom Communications and Consulting, April 15, 2013", "SB 1832 committee analysis", "Hearing of SB 1832, Senate Appropriations Committee, April 18, 2013", "The Miami Herald, \"Senate’s tax break for drivers has insurance lobbyists up in arms,\" March 28, 2013", "Email interview with Sam Miller, Florida Insurance Council executive vice president, April 16, 2013", "Associated Industries of Florida’s KeepFLJobs.com", "Interview with Sean Snaith, UCF economics professor and director of the Institute of Economic Competitiveness, April 17, 2013", "Interview with William Seyfried, Rollins College economics professor, April 17, 2013", "Florida TaxWatch briefing, \"Repeal of incentive for insurers to create jobs in Florida raises concerns,\" April 2013", "Palm Beach Post, \"Negron doesn’t buy insurers ‘apocalypse’ claims, meaning tax break may be doomed,\" March 28, 2013", "U.S. Department of Commerce, Bureau of Economic Analysis of insurance industry jobs with proprietors and without proprietors", "Interview with Thomas Dail, Bureau of Economic Analysis spokesman, April 19, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]