["A Twitter user Girish Bharadwaja, who describes himself as a member of the Vishva Hindu Parishad (VHP) and is followed by Railway Minister Piyush Goyal’s Office, tweeted on October 28, “Acid attack on Bull in Tumakuru, Karnataka by peace lovers. Will Sickulars Condemn this? Peta act on this?”", "“Peace lovers” is a commonly used term by Hindutva handles on social media to refer to the Muslim community.", "Among the over 1,700 people who retweeted Bharadwaja’s tweet was Shefali Vaidya, who is followed by Prime Minister Narendra Modi. Several others who retweeted the claim were those followed by Piyush Goyal’s Office (1, 2, 3).", "Another Twitter handle, Nation First Pinku (@imPK_Lucknowi), followed by Piyush Goyal’s Office, also tweeted that “peace lovers” acid-attacked a bull in “Tumakuru”.", "The identical claim was widespread on Facebook as well; users Prem Kapoor and Chandrakanth Lingayath circulated the same imagery and their posts attracted a combined share count of nearly 500. The photographs were also circulated on a group called ‘We Support Republic’.", "A Facebook page The Sikkim Today tweaked the narrative a little and claimed that the bull was attacked by “illegal Bangladeshis in Tumakuru”. All the posts viral on Facebook and Twitter have the exact text (with the exception of The Sikkim Today), which hints at the probability of the message being circulated on WhatsApp as well.", "The images viral on social media were shared by Facebook user Harish Kumar. His post (now deleted) said that some “miscreants” attacked the bull with acid in Aralepet, Tumkur (now Tumakuru).", "Alt News contacted Kumar who informed that he was unaware of the perpetrators behind the act. The injured bull was roaming on the streets of Tumkur when Kumar and his team spotted him. After taking him to a veterinary hospital, they found that the bull was attacked with acid. The incident took place last week and the bull is in recovery now.", "Alt News also contacted the Tumkur town police station to find if anyone was arrested in connection with the crime, however, the cops were unaware of the incident.", "Twitter user Girish Bharadwaja who gave birth to the rumours on social media is close to the Bharatiya Janata Party (or so suggest his online activities). Not only is Bharadwaja followed by Piyush Goyal’s Office on Twitter, but his Facebook profile is a testament to his popularity among top BJP leaders.", "Furthermore, rummaging through his Twitter activities, Alt News found that he is associated with Seva Bharti as well.", "A case of animal cruelty where the perpetrators are yet to be identified was given a communal colour by an individual close to the ruling party. In the past as well, Alt News has reported several instances where Twitter users followed by BJP leaders, including PM Modi circulated misinformation, oftentimes using abusive language.", "(Update: Tumkur was officially renamed to Tumakuru and the article has been edited to reflect the same.)", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]