["Several social media users have shared an image which shows people scattered and fallen on the road. The accompanying claim suggests this is the repercussion of the Coronavirus outbreak in China.", "#कोरोना_वायरस हमारे भारत में आ चुका है ,। जयपुर में एक patient admit hai", "आपको कोरोना वायरस से बचने का उपाय बताती हूं ,…", "Posted by Ambuj Pratap Singh on Monday, February 3, 2020", "Alt News received several requests to fact-check the images on WhatsApp (+91 76000 11160) and on our official mobile app.", "Alt News performed a reverse image search on Yandex and found that the viral image was published by the Hindustan Times in a 2014 photo essay. According to the report, “People lay down in a pedestrian zone as part of an art project in remembrance of the 528 victims of the “Katzbach” Nazi concentration camp, in Frankfurt.” The image was sourced to Reuters.", "Alt News did another keyword search and found the image published on March 24, 2014, by Reuters. According to the caption, “People lay down in a pedestrian zone as part of an art project in remembrance of the 528 victims of the Katzbach Nazi concentration camp, in Frankfurt, March 24, 2014. The inmates of the Katzbach concentration camp, a part of the former Adler industrial factory, were forced into a death march to the concentration camps of Buchenwald and Dachau on March 24, 1945. Some 528 victims of Katzbach are buried at Frankfurt’s central cemetery.”", "The viral image is six years old and not from China. It represents an art project in Frankfurt, Germany.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]