["A video has been viewed and shared millions of times in multiple posts on Facebook and Twitter alongside a claim that it shows American singer Tina Turner’s daughter “singing her mother’s song“. The claim is false; the video shows Beyoncé singing at a Tina Turner tribute event singing one of Turner’s songs.", "The video was published here on Facebook on July 3, 2018. The caption states: “Tina Turner daughter singing her mother’s song.”", "Tina Turner is an American singer who has won eight Grammy Awards.", "The four minute 22 second-clip, which features a rendition of Turner’s song Proud Mary, has been shared more than 1.4 million times.", "Below is a screenshot of the misleading post:", "The video has been viewed hundreds of thousands of times in multiple posts here and here on Facebook, and here on Twitter alongside the same claim.", "The video has also been viewed almost three million times in this Facebook post with a similar claim in Portuguese.", "The claim is false; the video shows a performance by American singer Beyoncé, who is not biologically related to Tina Turner.", "A reverse image search on Google for a screenshot of the video found this longer version uploaded of the performance in 2013 to the YouTube channel of the Kennedy Center Honors, an annual event that celebrates performers who have had a “profound artistic impact”.", "Tina Turner was recognised by the Honors in 2005.", "A host can be heard making an introduction at the beginning of the video: “Ladies and gentlemen, Beyoncé.\"", "The text at the bottom left of the video states: “Beyoncé. Proud Mary, Tina Turner Tribute, live at the 2005 Kennedy Center Honors”.", "Proud Mary is a song by the band Creedence Clearwater Revival. Tina Turner released a version of it in 1971.", "Below is a screenshot comparison of the video in the misleading post (L) and the one uploaded by the Kennedy Center Honors (R):", "Turner wrote about her four children - all boys - here in her autobiography, Tina Turner: My Love Story.", "Below is a screenshot of a relevant paragraph:", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]