["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Had he won the Democratic nomination, could Bernie Sanders (left) have defeated Donald Trump in the 2016 presidential election? A Wisconsin radio talk show host made that argument while claiming that Sanders is the most popular politician in America.", "Discussing the 2016 presidential race on April 19, 2017, a liberal talk radio show host in Milwaukee argued that Bernie Sanders would have \"won a landslide victory\" over Donald Trump.", "Then Mike Crute, who co-hosts \"The Devil’s Advocates,\" exclaimed that Sanders \"is the most popular politician in America today.\"", "Crute, whose show used to be based in Madison, didn’t say how he knew. So, we thought we’d check out his claim.", "Two recent polls", "Sanders finished as runner-up to Hillary Clinton in the race for the Democratic nomination. So the Vermont senator, an Independent, never faced Trump, the Republican nominee. Trump, of course, defeated Clinton, the former secretary of state, in the general election.", "The latest national survey on this question was the Harvard-Harris Poll, which is done by Harvard University’s Center for American Political Studies and Harris Insights and Analytics.", "Conducted online April 14 to 17, 2017 with registered voters, the poll listed the names of 16 political figures, without the titles of their governmental positions. Respondents were asked whether they had a favorable or unfavorable view of each, or had never heard of them. The 16 included prominent figures, such Sanders, Trump and Clinton, and the Democratic and Republican leaders in Congress, but also lesser-known Trump appointees.", "Pollster.com co-founder Charles Franklin, director of polling at the Marquette University Law School in Milwaukee, said it is common in non-election years for the president, vice president, congressional leaders and perhaps a prominent senator or two to be included in such polls. But including presidential staff members \"is dubious, as they are not known to a lot of voters,\" he told us.", "Sanders had the best showing in the Harvard-Harris survey, with 57 percent saying they had a favorable opinion of him. In fact, he was the only one of the 16 to get a majority favorable rating.", "Here are the ratings for the nine political figures who are not Trump appointees:", "Name", "Favorability rating", "Sen. Bernie Sanders , I-Vt.", "57%", "Vice President Mike Pence", "44%", "President Donald Trump", "44%", "Former presidential candidate Hillary Clinton", "42%", "Sen. Elizabeth Warren, D-Mass.", "38%", "House Speaker Paul Ryan, R-Wis.", "34%", "House Minority Leader Nancy Pelosi, D-Calif.", "31%", "Senate Minority Leader Chuck Schumer, D-N.Y.", "27%", "Senate Majority Leader Mitch McConnell, R-Ky.", "23%", "Sanders also had the best showing among eight elected officials in a Fox News Poll of registered voters conducted by telephone about a month earlier, from March 12 to 14, 2017.", "Sanders got a favorable rating from 61 percent of respondents. Pence was second among the politicians, at 47 percent, and Trump was third, at 44 percent. The others: Warren, 39 percent; Ryan, 37 percent; Pelosi, 33 percent; Schumer, 26 percent; and McConnell, 20 percent.", "Franklin also provided us HuffPost Pollster data on polls done since Jan. 1, 2017.  Former President Barack Obama is included in those polls. Obama’s average favorability rating was highest, at 61 percent, with Sanders coming in second at 56 percent. But like Clinton, Obama is no longer an elected official.", "None of the other politicians in polls tracked by HuffPost Pollster had a favorability rating higher than 46 percent.", "Our rating", "Crute said Sanders \"is the most popular politician in America today.\"", "The polls don’t specifically ask respondents for their favorite politician -- they provide a limited list of political figures and ask respondents whether they have a favorable or unfavorable opinion of each one.", "But based on that measure of popularity, Sanders finished comfortably on top among some major political figures in the latest national poll. And in an averaging of polls on favorability done in 2017, his rating was exceeded only by Obama, who perhaps could still be called a politician, though not an active one.", "For a statement that is accurate but needs clarification, our rating is Mostly True.", "DARNwi.com, \"Devil’s Advocates\" radio show (38:00), April 19, 2017", "Interview, Mike Crute, April 24, 2017", "Fox News Poll, results of poll taken March 12-14, 2017", "Harvard-Harris Poll results of poll taken April 14-17, 2-17", "Email, Harvard University professor of government and Harvard-Harris Poll co-director Stephen Ansolabehere, April 21, 2017", "Interview, Marquette Law School Poll director Charles Franklin, April 24, 2017", "Email, American Enterprise Institute senior fellow and polling expert Karlyn Bowman, April 24, 2017", "Email, Cornell University Roper Center for Public Opinion Research director of data operations and communications Kathleen Weldon, April 24, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]