["A five-minute video of police detaining civilians has gone viral on social media with the claim that it shows Spanish authorities are imposing a lockdown in the country. It is noteworthy that the coronavirus pandemic has led governments across the world to impose a restriction on citizens’ movement. In the video, one can spot a red logo on the top right corner.", "Several Twitter and Facebook users have posted the video with the English text, “This is lockdown in Spain You guys in India are lucky…u just get caned..”", "The viral video has also been shared along with a Hindi text, “If you feel the lockdown in India is harsh just have a look at this American lockdown (translated from अगर आपको INDIA का lockdown ज़्यादा कड़क लगता है तो एक बार American Lockdown भी देखले)”.", "Alt News also received several requests to fact-check the viral video on WhatsApp (+91 76000 11160) and on our official Android application.", "Alt News used InVid, a video verification tool, to identify the red-coloured logo. InVid breaks any video into multiple frames and recognises if the video carries a logo. As it turns out, the logo is of Meydan TV, a Berlin-based Azerbaijani non-profit media organisation.", "We rummaged the YouTube channel of Meydan TV and found the viral video. It was published on October 21, 2019. The first coronavirus case was reported in China in November 2019.", "The video represents the 2019 protest in Azerbaijan’s Baku. According to the description, the video shows an October 19 rally following which authorities and New Azerbaijan Party officials claimed that police did not use violence, however, visual evidence showed otherwise.", "According to an October 19 Reuters report, “Police in Azerbaijan on Saturday detained scores of protesters, including the leader of the main opposition Popular Front, at the start of a planned rally against low salaries, corruption and a lack of democracy in the energy-rich ex-Soviet state. The protesters have a wide range of demands, including higher salaries for state employees and fair and independent elections in a country long accused by human rights groups and Western governments of a lack of transparency.”", "A report by Human Rights Watch stated, “According to the police, they detained 60 of the approximately 220 people who participated in the unsanctioned demonstration on October 19, releasing 42 with a warning, and sending 18 cases to administrative courts. The authorities also detained at least 10 senior opposition party members ahead of the October 19 rally. Among them was a prominent opposition journalist, Seymur Hazi, who was detained on October 17 and sentenced the same day to 15 days of administrative detention.”", "European Union External Action and US Embassy in Azerbaijan released a statement condemning the violence used by police on peaceful protestors during the rally.", "Thus, the video does not depict police excess during coronavirus lockdown in Spain or the US.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "Trigger Warning: Sexual Violence A distressing video of a girl forced to take her clothes…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…"]