["By Saranac Hale Spencer", "Posted on June 25, 2019", "A meme on Facebook falsely claims that Senate Majority Leader Mitch McConnell’s biggest campaign donor is a Russian oligarch.", "A meme is circulating online with this incorrect claim: “It turns out that the biggest donor for Mitch McConnell (R: Moscow) is none other than the Russian oligarch that the GOP just lifted sanctions on.”", "Some versions of the meme are marked with a Twitter handle that posted the same message on Jan. 28 with a link to a story from an anti-Trump super PAC called The Democratic Coalition. That story connected McConnell — the Republican senator from Kentucky who has been the majority leader since 2015 — to billionaire Len Blavatnik, a dual citizen of the U.S. and U.K., who has donated hundreds of thousands of dollars to Republican and Democratic candidates and super PACs.", "Blavatnik began making political contributions in 1996, when he gave $1,000 each to a Republican and a Democratic candidate, and $250 to the National Republican Congressional Committee, according to campaign finance data filed with the Federal Election Commission. His donations increased over the next decade, but stayed relatively balanced between Republican and Democratic candidates and committees. He gave more than $60,000 to Barack Obama and the Democratic National Committee in both 2008 and 2012. He also gave over $130,000 to the Republican National Committee in 2016.", "Blavatnik’s company, Access Industries, gave $5.25 million to various conservative super PACs in the 2016 election cycle — including $1.5 million to the McConnell-affiliated Senate Leadership Fund.", "The Democratic Coalition story doesn’t mention Blavatnik’s contributions to Democratic causes, but it does tie him to Oleg Deripaska — a Russian businessman who had been sanctioned by the Treasury Department. The Treasury Department in January lifted sanctions on three companies connected to Deripaska. U.S. sanctions were lifted after the companies “reduced Oleg Deripaska’s direct and indirect shareholding stake in these companies and severed his control,” the Treasury Department said.", "Deripaska was described as a “Russian oligarch” in special counsel Robert Mueller’s report on Russian interference in the 2016 presidential election. Deripaska allegedly received updates on then-candidate Donald Trump’s campaign through Paul Manafort, who was a top campaign aide for nearly five months in 2016, according to the report.", "Blavatnik co-owns a company that has a 26.5 percent stake in Deripaska’s aluminum company, Rusal, according to reporting from Bloomberg. In April, Rusal announced plans to open a new aluminum plant in McConnell’s home state of Kentucky.", "So, it’s true that a major contributor to a PAC associated with McConnell has business ties to an oligarch whose businesses recently have been released from sanctions. But it’s a stretch to claim that “the biggest donor for Mitch McConnell (R: Moscow) is none other than the Russian oligarch that the GOP just lifted sanctions on.”", "The biggest donor to political committees associated with McConnell appears to be conservative mega-donor Sheldon Adelson, who, along with his wife, gave $85 million to the Senate Leadership Fund in 2016 and 2018, according to FEC records. The couple also gave McConnell’s candidate committee the maximum amount ahead of his last election in 2014, when those contributions were capped at $2,600. Super PACs, such as the Senate Leadership Fund, have no such contribution limits.", "Another super PAC affiliated with McConnell, Kentuckians For Strong Leadership, has raised a total of $11.2 million since it was formed in 2013 and has not received donations from either Blavatnik or Adelson.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "“OFAC Delists En+, Rusal, and EuroSibEnergo.” Press release. U.S. Department of the Treasury. 27 Jan 2019.", "Mueller, Robert. Report On The Investigation Into Russian Interference In The 2016 Presidential Election. U.S. Department of Justice. March 2019.", "“Treasury Designates Russian Oligarchs, Officials, and Entities in Response to Worldwide Malign Activity.” Press release. U.S. Department of the Treasury. 6 Apr 2018.", "Rudnitsky, Jake. “Tangled Rusal Ownership Thwarts Easy End to Sanctions: QuickTake.” Bloomberg. 25 Apr 2018.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]