["By Angelo Fichera", "Posted on April 19, 2019", "A popular meme takes aim at prominent lawmakers by referencing the number of bills they’ve had passed. But it uses an erroneous number — and omits context.", "A post shared by thousands of Facebook users criticizes three well-known members of Congress by citing an incorrect and out-of-context figure to question their legislative effectiveness.", "“67 combined years … 6 bills passed,” the viral meme reads, above photos of House Speaker Nancy Pelosi and Rep. Maxine Waters, who are both Democrats, and Sen. Bernie Sanders, an independent who is running for the 2020 Democratic presidential nomination.", "The meme leaves the impression that the lawmakers, combined, have only had “6 bills passed.” That’s wrong.", "Pelosi, for example, was the primary sponsor of seven pieces of legislation that were enacted, according to GovTrack.us, a website that profiles members of Congress and tracks the status of legislation. That includes major legislation, such as the Economic Stimulus Act of 2008, as well as commemorative resolutions, such as naming of a post office.", "Waters and Sanders sponsored five and seven bills, respectively, that became law. All three were co-sponsors on many more bills that became law, GovTrack’s data show. Pelosi co-sponsored 414 successful bills; Sanders, 216; Waters, 329.", "(We note that GovTrack totals include resolutions as well as measures that were incorporated in other bills that became law.)", "Voters are free to make their own judgments about lawmakers. However, Alan Wiseman, co-director of the Center for Effective Lawmaking, said in an interview that measuring lawmakers’ effectiveness solely on bills being enacted isn’t “an informative argument.”", "That’s in part because the majority of bills introduced do not get signed into law.", "Wiseman, who also chairs the political science department at Vanderbilt University, told FactCheck.org that, between 1973 and 2018, approximately 3.7 percent of all public bills that were introduced in the House became law. For that same time period in the Senate, 4.1 percent of public bills introduced were enacted. (Public bills include only House bills (H.R.) and Senate bills (S.) — not resolutions.)", "The Center for Effective Lawmaking has developed an online tool that uses Library of Congress data to gauge lawmakers’ effectiveness. Each member is assigned an effectiveness “score” in each Congress against a “benchmark” of what is predicted for a member in the same party with similar experience (such as the same number of terms served and committee or subcommittee chair status). Committee leadership positions, and whether a member is in the majority or minority party, can affect a lawmaker’s ultimate effectiveness, Wiseman said, and legislators typically become more effective over time.", "The center’s scores are calculated considering only public bills sponsored by the respective member. The calculation weighs each bill’s significance and not only its introduction and passage, but other milestones in the legislative process, including “action in” and “action beyond” committee. Wiseman said those steps can be meaningful in providing an issue exposure and helping to shape the legislative agenda, even if a bill isn’t passed.", "While the system does not assign aggregate scores to any member, a review of the ratings shows that Pelosi, Waters and Sanders have all fluctuated throughout their terms in Congress — at times below, on par with, or above expectations.", "Pelosi, for example, rated “above expectations” during her service from 1989 through 1996 and then dropped “below expectations” until the mid-2000s. Her performance in 2007 and 2008, while she was House speaker, surpassed expectations and then dropped again in subsequent years, according to the center’s analysis. But Wiseman noted that Pelosi’s inclusion in Democratic leadership — serving as minority whip, minority leader and House speaker — meant her focus was not necessarily on introducing her own bills.", "Pelosi served as House speaker from January 2007 to January 2011, and became speaker again in January.", "“Early in her career, she was extremely successful at moving her legislative agenda through the process,” he said. “In the late ’90s … she started shifting away from advancing her own agenda to more [party leadership] tasks.”", "As for their years in office, Pelosi, Sanders and Waters have been in Congress longer than “67 combined years,” as the meme says. Pelosi has served since 1987, and Sanders and Waters first took office in the House in 1991. (Sanders was a representative before becoming a senator in 2007.) Collectively, the three have 88 years of service in Congress.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on the social media network.", "Enacted legislation sponsored by Sen. Bernie Sanders. GovTrack.us. Accessed 15 Apr 2019.", "Enacted legislation sponsored by Rep. Maxine Waters. GovTrack.us. Accessed 15 Apr 2019.", "Enacted legislation sponsored by Rep. Nancy Pelosi. GovTrack.us. Accessed 15 Apr 2019.", "“Find Legislators.” TheLawmakers.org. Center for Effective Lawmaking. Accessed 16 Apr 2019.", "“Pelosi, Nancy.” Biographical Directory of the United States Congress. Accessed 15 Apr 2019.", "“Sanders, Bernard.” Biographical Directory of the United States Congress. Accessed 15 Apr 2019.", "“Waters, Maxine.” Biographical Directory of the United States Congress. Accessed 15 Apr 2019.", "Wiseman, Alan. Co-director, Center for Effective Lawmaking. Phone interview with FactCheck.org. 16 Apr 2019.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]