["In this April 7, 2020 file photo, voters observe social distancing guidelines as they wait in line to cast ballots in the presidential primary election in Milwaukee. (AP)", "Milwaukee and Green Bay, both led by Democratic mayors, operated just a fraction of their typical polling places in the April 7 election.", "But the decision to do so stemmed largely from coronavirus concerns and a shortage of poll workers.", "The Wisconsin GOP also failed to provide proof that the Democrats would’ve benefited from any chaos on election day.", "As state and local officials gear up for a historic election in November, many haven’t forgotten the tumult surrounding Wisconsin’s spring contest.", "The April 7, 2020 election made national headlines as Republicans and Democrats sparred over whether to hold an in-person election in the middle of the coronavirus pandemic. When the lawsuits ended and election day came, some voters waited in line for hours as municipalities contended with poll worker shortages and a surge in absentee ballots.", "In the end, results were not released until nearly a week later.", "With the Aug. 11, 2020 primary for state offices only about a month away, the April election came up in a Twitter spat between state Democrats and Republicans.", "\"Remember when *Democratic Mayors* in some of Wisconsin's largest cities closed voting locations in April to cause chaos?\" the Wisconsin GOP tweeted July 7, 2020.", "Two of Wisconsin’s Democrat-led cities did drastically reduce the number of polling places open on election day. But was the decision really in order to cause chaos, particularly during a pivotal election for their party?", "Let’s dive in.", "When asked for evidence to support the party’s claim, Wisconsin GOP spokeswoman Alesha Guenther zeroed in on Milwaukee and Green Bay.", "\"The majority of Wisconsin’s local elected leaders worked hard to make sure that Wisconsinites could safely exercise their right to vote in person on April 7,\" Guenther said. \"As a result, election day voting went smoothly in almost all areas of the state, with the exceptions of Green Bay and Milwaukee, where local officials refused to use the resources made available to them and caused chaos.\"", "Both cities are indeed led by Democrats -- Tom Barrett in Milwaukee and Eric Genrich in Green Bay. Barrett is a former congressman, and Genrich represented Wisconsin’s 90th Assembly District for three terms.", "The mayors came out strongly against holding an in-person election, with Barrett calling it \"dangerous,\" and both urged people to vote absentee. Genrich and Green Bay went one step further and unsuccessfully sued state officials, including Democratic Gov. Tony Evers, to push them to make the election an all-mail process.", "Milwaukee and Green Bay also had the worst voting lines in the state, opening them up to criticism from state Republicans and local council members.", "While Guenther emphasized Milwaukee and Green Bay, the party’s original statement cited Democrats in large cities. So, it’s worth noting that the election in Madison, which is also led by a Democratic mayor, went smoothly and wasn’t mired by the same issues.", "The main thrust of the claim, though, is that Democrats -- including Barrett and Genrich -- closed polling locations to \"cause chaos.\"", "Let’s take a walk down memory lane.", "Milwaukee operated just five polling places on April 7, down from 180 sites, which city officials attributed to a lack of poll workers. Only 300 to 400 people confirmed they would work election day in a city that typically requires more than 1,400 to run the polls for a normal election.", "In Green Bay, people waited in line up to four hours to vote at two high schools -- the only polling locations in a city accustomed to 31. Nineteen poll workers staffed the two sites with the help of some volunteers after many declined to work over health concerns.", "Genrich repeatedly said he didn’t feel comfortable asking city employees or volunteers to work the polls mid-pandemic.", "In the email to PolitiFact Wisconsin, Guenther said Milwaukee and Green Bay failed to take advantage of National Guard members made available to municipalities on Election Day. But the story is more complicated than that.", "Milwaukee County Clerk George Christenson said he received a final tally of available guard workers late on the Sunday before the election and contacted municipal clerks that night. The city of Milwaukee ended up with about 200 volunteers from the guard.", "Neil Albrecht, then-executive director of the Milwaukee Election Commission, said receiving that information sooner \"could have influenced the number of voting centers.\" Albrecht also said he contacted the state weeks before the election about National Guard assistance, but was told they wouldn’t be dispatched to help run polling sites.", "Green Bay officials echoed the assertion that National Guard support came too late.", "Brown County Clerk Sandy Juno said after the election that Green Bay declined to use poll workers provided by the National Guard. Genrich told the Green Bay Press-Gazette that he didn’t hear anything concrete about guard workers until speaking to Juno days before the election. By then, the city had consolidated to two polling locations and believed it had enough workers to manage them.", "Now, back to the GOP’s claim.", "Public statements from Barrett and Genrich suggest the move to consolidate polling places was driven by public health fears and a significant decline in poll workers. And election decisions are not made unilaterally by the mayor of any city.", "What’s more, much of the chaos came amid late developing court cases, including one that Republican leaders themselves took to the U.S. Supreme Court. Justices issued their ruling less than 18 hours before polls opened, just hours after Evers attempted to delay the election.", "And the GOP doesn’t offer a suggestion, let alone evidence, as to why Democrats would have benefited from any chaos -- particularly when races on the ballot included the Democratic presidential primary and a statewide Supreme Court race that pitted a liberal candidate against a conservative one.", "In Milwaukee, Barrett himself was on the ballot in his successful bid for a fourth term.", "In a tweet, the Wisconsin GOP said, \"Democratic Mayors in some of Wisconsin's largest cities closed voting locations in April to cause chaos.\"", "There’s no question that Milwaukee and Green Bay had problems unlike anywhere else in the state, and their Democratic leaders weren’t shy about wanting to avoid an in-person election amid a public health crisis.", "But the decision to consolidate polling places ultimately came down to poll worker shortages, and there was plenty of confusion due to legal maneuvering -- including from the GOP -- up until the last moments before election day. There’s no evidence to suggest the cities wanted to deliberately cause chaos, or that Democrats stood to benefit if they did.", "We rate this claim False.", "Email from Alesha Guenther, spokeswoman for the Republican Party of Wisconsin, July 8, 2020.", "Milwaukee Journal Sentinel, Why did Milwaukee have just 5 polling places? Aldermen want answers, April 10, 2020.", "Milwaukee Journal Sentinel, Milwaukee Mayor Tom Barrett says it's dangerous to go to the polls Tuesday in the midst of coronavirus, April 1, 2020.", "Green Bay Press-Gazette, City of Green Bay sues state officials to delay spring election and move it to mail over coronavirus concerns, March 24, 2020.", "Green Bay Press-Gazette, After 'whiplash' in Madison, Green Bay opens East, West high schools to hold election amid a pandemic, April 6, 2020.", "Milwaukee Journal Sentinel, Gov. Tony Evers to use National Guard members to work the polls amid massive shortage of workers, April 1, 2020.", "Green Bay Press-Gazette, Green Bay's long election lines draw criticism, but city says staff worked hard to pull off vote during pandemic, April 8, 2020.", "Milwaukee Journal Sentinel, Wisconsin justices block Tony Evers' order to shut down election, U.S. Supreme Court restricts absentee voting, April 6, 2020.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]