["A screengrab of a broadcast by India TV aired on May 31 has been shared by several social media users. It reads, “प्रधानमंत्री की बड़ी बातें 1 करोड़ कोरोना मरीज़ों का फ्री में इलाज किया (Prime Minister’s big talk. 1 crore corona patients treated free of cost.)” A bottom ticket on the screen also stated the Prime Minister as saying, “Ayushman Bharat has benefitted the poor people of this country.” Based on the graphic, many individuals have mocked the PM stating that India has less than 2 lakh COVID-19 cases. while the total number of cases in the world is 62 lakh. Below is a tweet by lawyer Dushyant (@atti_cus) which garnered 8,600 likes and 3,500 retweets as of this writing.", "The screengrab was also tweeted by Amina (@LuvAminaKausar) who describes herself as an American but Indian by heart.", "Writer Sanjukta Basu tweeted, “So Modi did say 1 crore COVID patients treated free. India has 182k patients and even the whole world doesn’t have 1 crore.”", "The graphic also reached Facebook. Below is a post by the page Dr.Manmohan Singh – Fan Club.", "The graphic was part of India TV’s broadcast aired in the morning of May 31 where PM Modi’s radio show ‘Mann ki Baat’ was played live. However, on June 1, India TV aired a correction. “Yesterday during the broadcast of Mann Ki Baat, it was reported that one crore patients of corona have been treated in India. This was a human mistake. Let us make it clear that the number of corona patients in India is not so high. We are sorry for this mistake.”", "#Correction कल मन की बात के प्रसारण के दौरान ये खबर चली कि भारत में कोरोना के एक करोड़ मरीज़ों का इलाज हुआ। ये मानवीय भूल थी। हम साफ कर दें कि भारत में कोरोना मरीज़ों की संख्या इतनी ज्यादा नहीं है। इस गलती के लिए हमें खेद है। pic.twitter.com/bUk6VvhMwC", "— India TV (@indiatvnews) June 1, 2020", "India TV’s broadcast concerned PM Modi’s ‘Mann ki Baat’ address on May 30 where he spoke about the coronavirus pandemic and the Ayushman Bharat health scheme which he said has helped the poor. He can be heard talking about the same 18 minutes onward in the show. The Prime Minister stated that the beneficiaries of Ayushman Bharat scheme have crossed the figure of 1 crore. This was misreported by India TV as him claiming that 1 crore COVID-19 patients have been treated for free.", "Therefore, an erroneous video report by India TV led many social media users to target PM Modi. However, India TV later clarified that the channel made a mistake.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A claim that Nobel laureate Amartya Sen has passed away went viral on social media…", "Within hours of Prime Minister of Canada Justin Trudeau alleging that “agents of the government…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…", "On the front page of its national edition dated August 22, Hindi daily Dainik Jagran…", "In his reply to the no-confidence motion brought by the Opposition in the Lok Sabha,…"]