["About this rating", "Fear of pending outbreaks of biblical diseases may make for lots of story clicks, but that doesn't mean the underlying claims are credible.", "One such rumor floated online in September 2019, driven by a backlash against homeless people. Amid intense political and media focus on an ongoing housing crisis causing increased homelessness in major cities like Los Angeles, fear started to spread about a biblical disease.", "The rumor stemmed from a September 2019 opinion piece penned by Dr. Marc Siegel, a doctor of internal medicine at New York University's Langone medical center. In the piece published by The Hill, Siegel wrote that he feared immigration and a rising homeless population in Los Angeles could be the epicenter of a new leprosy epidemic.", "That bit of sensationalism proved tantalizing for many media outlets, which ran with the claim despite the lack of supporting evidence. But if the idea of the dreaded New Testament disease making a resurgence in Hollywood sounds like the plot of a bad movie about End Times, that's because the claim is false.", "The only piece of evidence cited by Siegel was a paper about leprosy cases in Los Angeles. But Dr. Maria Teresa Ochoa, an associate professor of clinical dermatology at the University of Southern California's Keck School of Medicine and a co-author of that paper, told us Siegel's piece is inaccurate and also appears to exploit two political wedge issues: immigration and homelessness.", "Ochoa called the furor over a non-existent leprosy outbreak in Los Angeles \"the most ridiculous thing I have ever seen.\" Although Siegel claims that most patients cited by the paper are Latinos \"originating from Mexico,\" and that therefore raises the specter of immigration driving a rise in cases, Ochoa said that's simply baseless.", "\"We don’t talk about immigration or the homeless at all\" in the paper, she told us. \"I don't have one patient [with the disease] who is homeless.\" The reason most of the cases of leprosy cited in the paper were Latino patients was because of demographics: The area of Los Angeles where the clinic is located has a large Latino population.", "Ochoa added that Mexico doesn't have a major public health issue with leprosy. The countries with the biggest infection problems are India, Brazil, and Indonesia.", "Ochoa's paper is a summary of 187 case files from L.A.'s leprosy clinic between 1973 and 2018. It does not warn of a looming epidemic nor posit an increase in cases. Instead, it notes that although the disease is rare in the United States, leprosy (also known as Hansen's Disease) still occurs. Thus, medical professionals must be prepared to treat it.", "Ochoa said the biggest risk factor for contracting Hansen's Disease is prolonged exposure to a patient who is contagious with it. Leprosy is also difficult to catch. In 95 percent of incidents in which people come in contact with leprosy patients, those people do not contract the disease.", "According to the Los Angeles County Department of Public Health, \"no evidence [exists] of local transmission, [and] there is no risk for an outbreak.\" In an email, an L.A. public health official said no cases of the disease have been diagnosed among the homeless. Over the last decade, the county has seen between zero and four cases per year, averaging two cases per year. Health officials further specified that leprosy is \"not highly infectious, but rather requires prolonged and close contact for transmission to occur. Patients under treatment are not at risk for spreading disease to others.\"", "Those with leprosy were a source of fear and scorn in the Bible, but now the disease is treatable with antibiotics. Experts now understand it's caused by a bacteria called Mycobacterium leprae that causes nerve damage if left untreated. \"We keep stigmatizing this diseases with false information,\" Ochoa said.", "Siegel could not be reached for comment by the time of publication.", "Ochoa, Maria Teresa, et al. \"Characterization and Outcomes of Patients With Hansen Disease Treated at the Los Angeles County Hospital.\"\r\n  JAMA. 7 August 2019.", "SIegel, Marc. \"Is a Dark Ages Disease the New American Plague Threat?\"\r\n  The Hill. 8 September 2019.", "American Leprosy Missions. \"Leprosy Frequently Asked Questions.\"", "Braslow, Samuel. \"How the Homeless Ended Up Being Blamed for Typhus.\"\r\n  Los Angeles Magazine. 12 February 2019.", "Pettypiece, Shannon. \"Trump Says Homelessness Hurting Real Estate Prestige, Will Destroy Cities.\"\r\n  NBC News. 17 September 2019.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]