["Gov. Rick Scott greets people as Florida lawmakers, lobbyists, members of the media, and various guests, attend the annual Associated Industries of Florida party, March 2, 2015. (Times / Scott Keeler)", "Florida Gov. Rick Scott rattled off a laundry list of first-term accomplishments during his State of the State speech March 3, 2015. Chief among them were his efforts to cut taxes in the Sunshine State the past four years.", "\"We are home to over 250 languages. We are at a 43-year-low in our crime rate. We are absolutely the best melting pot in the world. Housing prices are up. And taxes are down,\" Scott said. \"We have cut taxes more than 40 times in the last four years. We have no personal income tax and the average person only pays about $1,800 in state taxes — which is the lowest of all 50 states.\"", "As we said in another fact-check, the bit about cutting taxes more than 40 times rates Half True. Here, we decided to look at Scott’s claim that the average person pays $1,800 a year in state taxes, the lowest of all 50 states.", "We crunched the numbers ourselves and compared that to multiple other tax watchdogs that use U.S. Census data to calculate taxes collected per capita.", "According to the Florida Department of Revenue, the state collected about $33.6 billion in taxes in fiscal year 2014. In 2013, Florida’s population, according to the U.S. Census, was about 19.6 million. Do the math, and that’s $1,711 taxes collected per capita.", "Scott’s office pointed us to the Federation of Tax Administrators, a nonpartisan group that serves the principal tax collection agencies in all 50 states. A 2013 analysis based on data from the U.S. Census, which surveys every state government each year to ask how much they collected in taxes, found the taxes Florida collected per capita were $1,769. That number was also cited by the Kaiser Family Foundation, another nonpartisan organization.", "Both those figures are close to the number Scott cited. But there’s a notable difference between taxes collected per capita and how much \"the average person pays,\" as Scott put it.", "To arrive at the per capita figure, you’re including millions of people, namely children, who either pay no taxes or some nominal amount (the sales tax on a toy purchased with allowance money, for example).", "With this caveat in mind, looking at taxes collected per capita is still a useful tool for comparing tax burdens across state lines. It’s not a perfect comparison — some states may have larger proportions of their residents who pay taxes — but it is used by several national tax policy groups.", "The most recent estimates say Florida's state tax burden is among the lowest in the country.", "According to the Kaiser Family Foundation and the Federation of Tax Administrators, at $1,769, Florida’s tax burden in 2013 was the lowest in the country, beating out Georgia ($1,781), New Hampshire ($1,791), South Dakota ($1,815) and South Carolina ($1,827). At $7,325 per person, North Dakota’s state tax burden is the highest.", "Our own calculation, achieved by comparing the U.S. Census 2013 Annual Survey of State Government Tax Collections to 2013 population data, put Florida third, behind New Hampshire and Georgia.", "The Tax Policy Center, a joint venture from the Brookings Institution and Urban Institute, ranked Florida fourth in its most recent analysis from 2012.", "Lastly, if you think per capita is a silly way of comparing tax liabilities, know that Florida has a low tax burden by another measure: percent of total income paid to taxes.", "According to the Federation of Tax Administrators, 4.4 percent of all income earned by Floridians goes to state taxes. That percentage is the third-lowest in the country behind New Hampshire (3.7 percent) and South Dakota (4.1 percent).", "Our ruling", "Scott said, \"The average person only pays about $1,800 in state taxes — which is the lowest of all 50 states.\" That’s not exactly what the average person pays in taxes; it’s actually the state taxes collected per capita, which factors in children and other residents who pay little to nothing in taxes. That’s not necessarily the impression you would get from Scott’s statement.", "Still, according to two credible analyses, that number was the lowest in the country in 2013, the last year of available data. Other breakdowns put Florida among four states with the lowest tax burden per capita.", "We rate Scott’s statement Mostly True.", "Gov. Rick Scott, State of the State address, March 3, 2015", "Jeri Bustamante, spokeswoman for Scott, March 3, 2015", "Federation of Tax Administrator, 2013 State Tax Revenue, accessed March 3, 2015", "Kaiser Family Foundation, State Government Tax Collections per Capita, accessed March 3, 2015", "Tax Policy Center, State and Local General Revenue, Per Capita, 2004-2012, accessed March 3, 2015", "Tax Policy Center, State & Local Finance Data Query System: Create a Table, accessed March 3, 2015", "Email interview with Norton Francis, Senior Research Associate at the Urban Institute State and Local Finance Initiative, March 3, 2015", "Florida Department of Revenue, State and Local Tax Receipts, accessed March 3, 2015", "U.S. Census Bureau, State Government Tax Collections, accessed March 3, 2015", "U.S. Census Bureau, Population Estimates: State Characteristics: Vintage 2013, accessed March 3, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]