["Photograph of CPI(M) leaders Sitaram Yechury and Brinda Karat holding placards which allegedly carry slogans against the Indian army are circulating on social media. The placards read, “Indian Army Down..Down, We Support To China..Zindabad.” The images are being shared in the backdrop of the ongoing border dispute with China where 20 Indian army soldiers were killed. Social media claims attempt to show that the Communist Party of India (Marxist) is offering support to Communist-ruled China.", "The message shared along with the images reads, “चीन और उसकी कम्युनिस्ट पार्टी इन मार्क्सवादी कम्युनिस्ट नेताओं को हर वर्ष लाखों डॉलर देती है इसलिए बेशर्म , बेहया , गद्दार देश की जनता के सामने खुलेआम ये सब कर रहे हैं। भारत में रहते है और भारत से ही गद्दारी सीता राम येचुरी , वृंदा करात,, दोनों वामपंथी नेता है मार्क्सवादी कम्युनिस्ट पार्टी के। जिसने 1962 के भारत – चीन युद्ध में भी चीन का समर्थन किया था।”", "Several Twitter users have also shared the images.", "Alt News has also received fact-check requests on its official mobile application.", "A reverse-image search led us to a June 16, 2020, tweet by CPI(M) where the same images were posted. The photos were shot during a protest against the policies of the PM Modi government.", "All India Protest against Modi govt’s anti-people policies.#PeopleProtestModiGovt pic.twitter.com/oJRUqXHsN5", "— CPI (M) (@cpimspeak) June 16, 2020", "Sitaram Yechury’s placard reads, “IMMEDIATELY PAY RS.7500 PER MONTH FOR THREE MONTHS TO ALL OUTSIDE INCOME TAX BRACKET.” While Brinda Karat is holding a placard that reads, “PROVIDE FREE 10 KG FOODGRAINS PER MONTHS FOR SIX MONTHS TO ALL NEEDY INDIVIDUALS.”", "According to The Hindu, “The CPI(M) held nationwide protests demanding direct cash transfer to all families that do not come under the income tax net. It charges that the Narendra Modi government had failed to protect the livelihoods of millions of people during the [coronavirus] pandemic.”", "In an all-party meet, CPI(M) had expressed condolences at the death of Indian army soldiers in Galwan valley.", ".@SitaramYechury at all party meet: CPIM expresses its deep condolences at the death of our army officers and soldiers in the recent clash that took place along the Indo-China LAC, at the Galwan valley in Ladakh. Read Full Statement at:https://t.co/0tUXfjT8h3", "— CPI (M) (@cpimspeak) June 19, 2020", "Therefore, images of CPI(M) leaders Sitaram Yechury and Brinda Karat holding placards in protest against the policies of the Modi government were photoshopped to falsely project them holding placards with anti-army slogans.", "Donate Now", "Kinjal Parmar holds a Bachelor of Science in Microbiology. However, her keen interest in journalism, drove her to pursue journalism from the Indian Institute of Mass Communication. At Alt News since 2019, she focuses on authentication of information which includes visual verification, media misreports, examining mis/disinformation across social media. She is the lead video producer at Alt News and manages social media accounts for the organization.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]