["About this rating", "Several countries issued travel warnings to their citizens in 2016 due to ongoing events and unrest in the United States.", "Those warnings weren't strictly limited to three countries; the warnings were not issued simultaneously nor regarding any single risk.", "In July 2016, the shooting deaths of Alton Sterling and Philando Castile were broadcast across social media, and five police officers were shot and killed in Dallas.  In the aftermath of the month's bloody beginnings and ensuing protests, rumors began circulating on Facebook that three countries warned their citizens not to visit the United States.", "The claim was often unaccompanied by citations, leaving many to draw their own conclusions about whether it was accurate, or why such a scenario might be the case. Some blamed police shootings for the purported warnings, others the shootings of police officers, and still more speculated that the warnings came out of general unrest.", "In April 2016, we reported that the United Kingdom issued a travel alert for citizens visiting the United States. In that instance, the warning was directed at toward gay, lesbian, and transgender people and cautioned that at least two states (North Carolina and Mississippi) might constitute unfriendly territory. On 11 July 2016, Condé Nast Traveler published an item regarding travel warnings issued by the Bahamas, Bahrain, and the United Arab Emirates about travel to the United States:", "In light of recent violence, multiple nations are urging their citizens to be careful when traveling to the United States.", "Following a mass shooting in Orlando, the deaths of two young black men at the hands of police officers in Louisiana and Minnesota, and the killing of five police officers in Dallas over the past few weeks, several countries have urged their citizens to proceed with caution if they're visiting the United States. First, after a man from the United Arab Emirates who was in Ohio for medical treatment was falsely accused of being a terrorist because he was speaking Arabic on the phone, the U.A.E. cautioned its citizens to avoid traditional dress abroad \"to ensure their safety.\"", "Now, the U.A.E. has been joined by Bahrain and the Bahamas, both of whom issued travel warnings over the weekend. On Twitter, Bahrain's embassy in Washington, D.C. wrote, \"Please be cautious of protests or crowded areas occurring around the US,\" and listed emergency contact numbers for the embassy. The government of the Bahamas issued a statement as well: \"The Ministry of Foreign Affairs and Immigration has taken note of the recent tensions in some American cities over shootings of young black males by police officers. We wish to advise all Bahamians traveling to the US but especially to the affected cities to exercise appropriate caution generally.\"", "That article linked to a tweet sent by the Embassy of the Kingdom of Bahrain:", "Please be cautious of protests or crowded areas occurring around the US. Emergencies call the embassy at 202.342.1111 ext9 or 202.297.0537", "— Bahrain Embassy (@BahrainEmbDC) July 9, 2016", "Following those warnings, an Australian outlet noted that New Zealand had updated its directives regarding visits to the United States as well:", "New Zealand’s advisory was of a similar tone, telling travellers: “We recommend you avoid all protests and demonstrations as on occasion civil disorder can result.”", "The quoted guidelines were issued as early as 3 June 2016, and listed terrorism, crime, and civil unrest in the United States as matters with which New Zealanders should be acquainted before visiting:", "Terrorism\nThe United States remains a likely target for terrorist activity by domestic-based extremists and internationally-trained individuals and groups, and we continue to receive reports that terrorist groups are planning attacks against the United States. Terrorist attacks have occurred in the United States in recent years and a significant number of terror plots have been disrupted ... There is the potential for attacks to be conducted with the intention of targeting the general public.", "Crime\nThere is a higher incidence of violent crime and firearm possession than in New Zealand, however crime rates vary considerably across cities and suburbs and incidents rarely involve tourists.", "Civil Unrest\nWe recommend you avoid all protests and demonstrations as on occasion civil disorder can result.", "Several countries did issue travel warnings for the United States in 2016, though those warnings varied from country to country and didn't have to do with any one issue. The number of countries issuing warnings was also more than three. Depending whether countries in the United Kingdom were counted individually or as a whole (and accounting for unnoticed warnings) anywhere between five and nine countries issued advisories between April and July 2016.", "Marcus, Lilit.   \"Bahamas, Bahrain, And U.A.E. Issue Warnings About Travel To U.S.\"\r\n    Condé Nast Traveler.   11 July 2016.", "O'Neill, Marnie.   \"Several Countries Issue Travel Alerts For United States Amid Growing Racial Tensions.\"\r\n    News.com.au.   11 July 2016.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]