["About this rating", "Graham downplayed the alleged sexual assault by Supreme Court nominee Brett Kavanaugh by claiming, without evidence, that \"there wasn't a crime that was committed,\" and that Kavanaugh had \"respected\" Christine Blasey Ford's objections in breaking off the assault.", "Graham did not literally say that \"attempted rape is not a crime\" or that Kavanaugh \"respected her by not finishing.\"", "The criticism engendered by evangelical conservative Rev. Franklin Graham's appearance on the Christian Broadcasting Network (CBN) on 18 September 2018 reflected the pitfalls in how social media users can (perhaps unknowingly) distort a headline prepared properly.", "During an interview with CBN News, Graham defended the nomination of Brett Kavanaugh to the Supreme Court by saying that it was \"not relevant\" if Kavanaugh had committed sexual assault as a teenager:", "Kavanaugh's accuser, Christine Blasey Ford,  said that in 1982 Kavanaugh and a friend, Mark Judge, cornered her in a bedroom during a house party.", "Ford asserted that both Judge and Kavanaugh were \"stumbling drunk\" when the latter pinned her and tried to pull down her clothing and the bathing suit she was wearing underneath. Kavanaugh responded by saying, \"I categorically and unequivocally deny this allegation. I did not do this back in high school or at any time.\"", "In reference to Kavanaugh, Graham lamented on CBN that \"it's just a shame ... that somebody can bring something up that he did when he was a teenager close to forty years ago ... that's not relevant.\"  When Graham was asked what message it would send to survivors of sexual assault if it were \"not relevant\" whether the attack brought up by Ford actually took place, he responded by saying:", "Well, there wasn't a crime that was committed. These are two teenagers, and it's obvious that she said no and he respected it and walked away -- if that's the case, but he says he didn't do it. He just flat out says that's just not true. Regardless if it was true, these are two teenagers and she said no and he respected that, so I don't know what the issue is. This is just an attempt to smear his name, that's all.", "However, Ford said that she escaped the alleged assault not because Kavanaugh \"walked away,\" but because Judge \"jumped\" on top of her and Kavanaugh, inadvertently providing her with the opportunity to get away from both them and flee to a bathroom across the hall.", "The liberal news web site Daily Kos reported on the interview with a headline reading \"Franklin Graham: Attempted rape not a crime. Kavanaugh 'respected' his victim by not finishing,\" which was a paraphrase of Graham's comments and possibly some social media users mistakenly believed that the headline reflected Graham's remarks verbatim, which was not the case:", "Franklin Graham: Attempted rape not a crime. Kavanaugh \"respected\" his victim by not finishing. https://t.co/dM5Esd3wyS", "— Yvonne Whisenant (@Ywhisenant) September 21, 2018", "Nontheless, Graham did state, falsely, that an attempted assault was \"not a crime\" and claimed, without evidence, that Kavanaugh had \"respected\" Ford's entreaties for him to stop what he was doing to her.", "Sells, Heather.   \"Franklin Graham on Judge Kavanaugh Accusation: 'Not Relevant.'\"\r\n    CBN News.   18 September 2018.", "Brown, Emma.   \"California Professor, Writer of Confidential Brett Kavanaugh Letter, Speaks Out About Her Allegation of Sexual Assault.\"\r\n    The Washington Post.   16 September 2018.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]