["Apollo 8 was the first crewed spacecraft to successfully orbit the moon and return to earth, and one man watched history being made while copping a feel.", "It’s what a photo being shared on Facebook would have you think. \"A couple viewing the Apollo 8 spacecraft launch, 1968,\" reads the Oct. 22 post featuring an image of a man and woman watching a spacecraft take off while he grabs her rear.", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Commenters had jokes — \"his hand made it to the moon\" — but at least one account questioned the photo’s authenticity. \"Fake?\"", "Yes.", "The original photo shows the H-2A rocket taking off in Tanegashima, Japan, in May 2000 — not the Apollo 8 launch. (You can see images of the Apollo 8 launch here.) And this couple is nowhere in the image.", "Snopes fact-checked a similar social media post in June and found a different image with the couple. This image shows the pair standing before Viktor Vasnetsov’s painting \"Ivan Tsarevich Riding the Grey Wolf\" at the Tretyakov Gallery in Russia. The photo appeared online as early as 2016 and several online posts identify Andrey Stroganov as the photographer.", "We rate this Facebook post False.", "Facebook post, Oct. 22, 2019", "NASA, Apollo 8, visited Oct. 22, 2019", "NASA, Part 2: Apollo 8 - in the beginning there was liftoff, Dec. 19, 2018", "AP Images, Japan rocket carrying Venus probe blasts off, May 21, 2010", "Snopes, Is this couple viewing the Apollo 8 spacecraft launch, June 18, 2009", "Kalamazoo College, Crowd-sourced art gallery, visited Oct. 22, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]