["President Donald Trump’s private discussion with Russian President Vladimir Putin at the G20 summit is highly unusual but not completely without precedent, a foreign policy expert said on MSNBC.", "Ian Bremmer, president of the Eurasia Group consulting firm, told Rachel Maddow on July 18, 2017, that Trump’s side meeting with Putin at a dinner with heads of state was definitely unusual.", "Trump met with Putin on July 7 for an official meeting during the summit. But then he sat next to Putin at the dinner later that day with only a Russian translator present and no other American officials. (Trump told the New York Times they \"talked about Russian adoption.\")", "But Richard Nixon was also known to hold meetings with foreign dignitaries without an American interpreter, Bremmer said.", "\"Apparently, President Nixon used to do it because he felt, didn't really trust the State Department, at that point, providing the translators and didn't want information getting out, leaking, that he would want to keep private,\" he said.", "We attempted to contact Bremmer through his Eurasia Group communications director but didn’t get a response.", "But he doesn’t appear to be losing much of anything in translation here. It turns out that on a couple of occasions, Nixon did meet with officials solo, although the circumstances were a bit different than Trump’s meeting with Putin.", "Several presidential historians told us that when American presidents meet with foreign heads of state or other officials, there is usually an aide or administration official attending with him. There also is usually an American interpreter present, so that the president may check how the discussion is being translated.", "\"When a president talks business he wants an aide there from his side to take notes,\" said Nick Cullather, a history professor at Indiana University. \"In diplomacy, if there are no notes, nothing happened.\"", "Nixon did have a strained relationship with the State Department, and noted repeatedly in his memoir RN: The Memories of Richard Nixon that then-National Security Adviser Henry Kissinger, especially, did not get along with then-Secretary of State William Rogers.", "There are anecdotes that Nixon would keep State Department interpreters out of meetings for fear of leaks, but he rarely attended meetings without some other American official present.", "University of Texas history professor Jeremi Suri said the aide present was often Kissinger, as was the case when Nixon met with Chinese Communist Party Chairman Mao Zedong and Premier Zhou Enlai on Feb. 21, 1972, without an American translator. There was a National Security Council notetaker there, and an official transcript was filed.", "\"This violated all diplomatic protocol because it meant Nixon could not check the interpretation of his words,\" Suri said.", "Prussian-born Harry Obst, who interpreted meetings for seven presidents including Nixon, recounted in his own book White House Interpreter that he had been barred from translating some meetings with German-speaking officials. One example Obst gave was at the behest of Kissinger, who was born in Germany and could understand German.", "But the most comparable instances were when Nixon met with Soviet leader Leonid Brezhnev.", "Nixon relied on the Russian translator Viktor Sukhodrev, who worked for the Soviets, during one meeting at a summit between the two leaders in Moscow on May 22, 1972. The meeting was recorded and Sukhodrev took notes, according to State Department footnotes.", "\"There had been concern expressed that I should have a State Department translator present also,\" Nixon wrote in his memoir. \"But I knew that Sukhodrev was a superb linguist who spoke English as well as he did Russian, and I felt that Brezhnev would speak more freely if only one other person was present.\"", "The situation was repeated when Brezhnev visited Washington a year later. Sukhodrev was the only interpreter for an Oval Office discussion between Nixon and Brezhnev on June 18, 1973. State Department footnotes said this meeting also was recorded.", "Both conversations took place during official visits, and administration staff was aware of the meetings. The biggest difference between Nixon’s discussions and Trump’s, however, is that a record of what the leaders talked about exists in State Department records.", "Bremmer had noted the lack of an official account of Trump’s second G20 meeting with Putin during his MSNBC appearance.", "\"They (Trump and Putin) were out of earshot, so, I mean, unless the Russian translator has a tape — and I think there’s a reasonable likelihood that he does — then, you know, nobody else is going to have a readout of this meeting,\" Bremmer said.", "Bremmer said, \"Apparently, President Nixon used to do it (hold meetings with heads of state without an American interpreter) because he felt, didn't really trust the State Department, at that point, providing the translators and didn't want information getting out, leaking, that he would want to keep private.\"", "Presidential historians, historical accounts and Nixon’s own memoir show this was the case. But it’s notable that even in the example most comparable to Trump’s meeting with Putin, when Nixon used only a Soviet translator during two meetings with Brezhnev, official records of the meeting exist.", "We rate Bremmer’s statement True.", "Ian Bremmer, comments on The Rachel Maddow Show, July 18, 2017", "Los Angeles Times, \"Viktor Sukhodrev, translator for Soviet leaders, dies at 81,\" May 18, 2014", "The Atlantic, \"The Strange, High-Pressure Work of Presidential Interpreters,\" July 7, 2017", "The Atlantic, \"The Other Putin-Trump Meeting,\" July 18, 2017", "CNN, \"Trump, Putin met for nearly an hour in second G20 meeting,\" July 18, 2017", "New York Times, \"Excerpts From The Times’s Interview With Trump,\" July 19, 2017", "U.S. State Department Office of the Historian, \"Nixon-Ford Administrations,\" accessed July 19, 2017", "U.S. State Department Office of the Historian, \"Memorandum of Conversation, Beijing, February 21, 1972, 2:50–3:55 p.m.,\"  accessed July 19, 2017", "U.S. State Department Office of the Historian, \"Memorandum of Conversation: Moscow, May 22, 1972, 6:15–8:10 p.m.,\" accessed July 19, 2017", "U.S. State Department Office of the Historian, \"Conversation Between President Nixon and Soviet General Secretary Brezhnevv: Washington, June 18, 1973, 11:31 a.m.–12:30 p.m.,\" accessed July 19, 2017", "White House Interpreter, Harry Obst comments about Richard Nixon, accessed July 19, 2017", "RN: The Memories of Richard Nixon, Nixon comments about William Rogers, Henry Kissinger and Viktor Sukhodrev, accessed July 19, 2017", "Interview with Timothy Naftali, New York University history and public service professor, July 19, 2017", "Interview with Alan Henrikson, Tufts University history professor, July 19, 2017", "Interview with Nick Cullather, Indiana University history professor, July 19, 2017", "Interview with Jeremi Suri, University of Texas history professor, July 19, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]