["About this rating", "On 7 October 2016, the Alabama Observer web site reported that authorities were seeking a suspect believed to be involved in the creation of a \"real life human centipede\":", "Residents in Alabama’s Pullman County have been urged to be on the lookout for a suspect, described as a Caucasian male between the ages of 50-60, who is wanted for questioning over a shocking discovery inside a local warehouse. According to sources familiar with the investigation, the gruesome find was made after authorities responded to an anonymous tip-off from a member of the public.", "Once inside the warehouse, investigators were appalled by the scene that confronted them. “After a career of thirty years, dealing with some of the most heinous crimes you could imagine, this was by far the worst,” said one investigator. “As we entered the building, we saw a group of three women crawling on the floor on their hands and knees in obvious distress. It wasn’t until we approached them that we saw the full extent of their situation.”", "Investigators have made not yet made an official statement to the media regarding the nature of the women’s injuries, but one source who declined to speak on the record has told of how two of the women ‘had their mouths crudely sewn to the anus of another woman in the group’, apparently mirroring the plot of the horror film ‘The Human Centipede’. “The women are currently receiving expert medical care, and are all expected to make full recoveries, although the psychological impact of their ordeal will be severe.”", "It is believed that the male suspect wanted for questioning had lured the women to the property by posting job advertisements online. Once they arrived, he allegedly incapacitated them with a sedative-laced drink, and when they woke up some hours later they found that they’d already been ‘surgically attached’ to the other women. “It is highly likely that the perpetrator of this crime is a current or former surgeon, possibly a doctor who has been fired for breaches of medical ethics.”", "No other news outlets reported on this unquestionably newsworthy incident.  Likely because the Alabama Observer is a fake news site created on the same date the outlandish story was published:", "The \"real life human centipede\" tale, originating with what appeared to be the online arm of a credible newspaper, was just one of several new fake news reports coming from out-of-the-woodwork newspaper impostor sites.", "Around the same time the Alabama Observer popped up to spread fabrications, the Baltimore Gazette and Boston Tribune web sites were set up to spread false clickbait stories by camouflaging themselves as mainstream metro-area news outlets.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]