["About this rating", "In late October 2016 the above-reproduced text began circulating via Facebook and e-mail, claiming that early voters were encountering a glitch that automatically allocated all touchscreen-based votes for Democratic candidate Hillary Clinton to Republican candidate Donald Trump, and warning Democratic voters to \"uncheck Trump and redo your vote for Hillary.\"", "The rumor apparently started on 21 October 2016 in a post phrased as a first-person account and spread like wildfire on Facebook, where it was copied and pasted into public posts which were reshared multiple times:", "The earliest version of the rumor we could find came from a Facebook user with a listed location of Baltimore, where it appears that pens re not part of the voting process:", "The scattered warnings conflicted with one another with respect to the geographic location of the supposed voting pen glitches:", "This was sent to me from a relative that lives in S.C. Another relative in N.C. says there was a bit of a problem. A hard time is being given to those in the South who want to vote.", "The warning to voters lacked any information useful in determining the scope of the purported problem. Voters from New York to Florida and everywhere in between shared it, despite a disparity in voting apparatuses from state to state (and even within states). The circumstances under which the original voter purportedly experienced the glitch were not included, and the manner in which the rumor spread led most sharing it to believe they were all reading or reposting first-person accounts. The appended detail that the information came from \"one of the sisters [sic] page\" added a layer of credibility to every version of the warning.", "Claims that a pen-operated voting machine switched a vote from Clinton to Trump (an error caught and corrected by the purported user) likely originated with one individual, a voter who may have genuinely experienced an isolated voting glitch or reported was simply a case of user error.  That account has been passed along by many social media users (\"just in case\") with the belief the anecdote comes from a friend or sister-of-a-friend, but no information in the account documents that the described circumstance occurred more than once (if at all) or has affected a large number of voters.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]