["A WhatsApp voice note by a man who identifies himself as a former UN volunteer and graduate from Nigeria’s Ibadan University has been shared across numerous groups in Nigeria. An AFP reporter received the voice note more than 20 times on WhatsApp. It was posted multiple times in a single group by different people.", "It has also been shared by hundreds of people on Twitter, including here.", "The speaker in the voice note claims that as a former UN volunteer, he has access to privileged WHO  information.", "He alleges that the global mortality rate linked to COVID-19, the disease caused by the novel coronavirus, was 0.2 percent a month ago.", "Regarding Nigeria, “our estimate is 45 million people are going to die if the virus spreads the way it should, the way it is spreading in Italy,” the man says.", "Data from WHO shows the claims are false. Firstly, the global mortality rate for COVID-19 was 2.93 percent a month ago and not 0.2 percent as claimed.", "Based on the latest WHO situation report, the COVID-19 mortality rate for Italy is 9.3 percent. Going by Italy’s mortality rate, which is the highest globally, if Nigeria’s estimated 200-million population were to contract COVID-19, the number of estimated deaths still falls way below 45 million.", "The Nigeria Centre for Disease Control told AFP the voice note and its claims were “false”.", "The centre has reported 40 cases with only one casualty -- keeping local mortality at 2.5 percent as of March 24, 2020.", "Daniel Meshak, a public health specialist at Jos University Teaching Hospital, also dismissed the possibility of the virus killing 45 million Nigerians.", "\"Mortality is dependent on the kind of supportive care you get from the hospital so there is a need to be cautious\", he told AFP.", "The sender also claims that Nigeria wants to purchase protective gear from China but lacks the financial reserves.", "“Nigeria wants to buy used protective gear… from China... for N32,000 ($85 or €79) and they can’t purchase the new one because we are actually broke, Nigeria doesn’t have anything in their reserves anymore”, the sender claims.", "He alleges President Muhammadu Buhari has spent state funds and “what every state is waiting for is for the World Bank to release money”.", "According to data from the Central Bank of Nigeria (CBN), Nigeria had $35.9 billion in its reserves as of March 19, 2020. Central bank governor Godwin Emefiele said on March 18 that the bank would boost the economy with a N1 trillion stimulus, with an additional N100 billion ($264.5 million) loan to the health sector.", "Nigeria’s foreign reserves have fallen from $38.5 billion at the beginning of 2020 to $35.9 billion, but the reserves were nowhere near empty as of when the voice note started making the rounds.", "NCDC also told AFP there were no plans underway to buy used protective gear from China.", "The sender claims his source was a certain “Dr Alemu”, a female Rwandan national and the WHO’s representative in Nigeria.", "He alleges the NCDC reports to the doctor who then passed on the information.", "However, WHO spokeswoman Charity Warigon told AFP the claims were untrue.", "She said that although Dr Wondimagegnehu Alemu was a real person, he was neither a woman nor from Rwanda. Warigon also confirmed that the NCDC was not reporting to him.", "Dr Alemu is an Ethiopian-American doctor who was appointed the WHO country representative in Nigeria in December 2016. He left Nigeria in 2018 -- more than a year before the outbreak of coronavirus disease.", "Dr Fiona Braka has been named the WHO’s temporary officer-in-charge until a new country representative has been appointed, Warigon said. Braka is a member of the Presidential Task Force on COVID-19 in Nigeria.", "Warigon also rejected the sender’s claim that he was a former UN volunteer.", "“The only UN volunteer we have is here [in our office], and she is the first we have in Nigeria. It is false information, absolutely false,” she said.", "Warigon also warned that the circulation of false claims was hampering the fight against the coronavirus.", "\"Instead of creating fear in people or giving misinformation, it is better to sensitise people on safety measures”, she said.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]