["The photos were published in this Facebook post to a group with more than 230,000 members on November 14, 2019.", "It has been shared more than 176 times.", "The simplified Chinese-language text superimposed on the images translates to English as: \"Starry Lee, one of the people messing up Hong Kong, goes as far as to block the road with obstacles. What a disgrace!\"", "Starry Lee, a pro-Beijing lawmaker, is the chairperson for pro-establishment political party Democratic Alliance for the Betterment and Progress of Hong Kong (DAB).", "The post’s traditional Chinese-language caption translates to English as: “I've been a big supporter of yours, but you unexpectedly went and blocked the road, I really want to get to work\".", "Barricades and bricks have been used to block off roads during the ongoing protests in Hong Kong, as seen in this AFP video report.", "Below is a screenshot of the misleading post:", "The same photos were also shared in Facebook posts here and here with a similar claim.", "The claim is false; the photos show Lee clearing the barricades from a road in Kowloon after a protest.", "Lee posted the same photos to her verified Facebook account here on November 13.", "The traditional Chinese-language caption translates to English as: \"[Urgent appeal; positive energy saves Hong Kong]\n\t \n\t“To save Hong Kong and restore order, we need a positive energy boost! I call on all of you to stand up and dedicate in injecting more positive energy into society, say no to violence, say no to destruction!\n\n\t“#StarryLee #SavingHongKongwithPositiveEnergy #SayNotoViolentDestruction\".", "Below is a screenshot of the post:", "The images were taken on To Kwa Wan Road in Kowloon, as shown on Google Street View here.", "On November 14, Lee met with Hong Kong Chief Executive Carrie Lam, calling for the creation of a \"coordination centre for stopping violence\", as well as a large-scale clean-up operation, according to reports from Hong Kong public broadcaster RTHK and newspaper South China Morning Post published on the day.", "Chinese state-owned newspaper Hong Kong Commercial Daily published this video of Lee and her DAB colleagues clearing bricks from a protest site on November 15.", "Below is a screenshot of the video with Lee circled in red:", "The post’s traditional Chinese-language caption translates to English as: “[Citizens voluntarily clear roadblocks in early morning, unblocking multiple lanes]", "\"Rioters incited four consecutive days of strikes this week, calling for people to ditch work and skip class, and for business owners to close shops. They obstructed traffic by setting up roadblocks in various districts across the city and damaging MTR stations and tracks. As a result, the security of the public transport system and safety of the people were severely compromised, while public dissatisfaction grew.", "“This morning, many people voluntarily took to the streets and removed roadblocks in the districts of Mong Kok, Sai Wan Ho, Tin Shui Wai and Tsuen Wan. They bent down and used their own hands to clean up bricks and road signs that were blocking the roads, trying their best to guard their home and ensure the normal operation of Hong Kong society.", "“#ActTogethertoClearRoadblocks #CitizenVoluntaryAction #StopViolenceCurbChaos #GuardOurHome #StarryLee #DAB #NoVoteforPartiesIndulgingViolence”.", "The DAB also published photos of Lee and other party members clearing away bricks from the streets in this Facebook post on November 15.", "The traditional Chinese-language caption translates to English as: \"[Work together to save Hong Kong]", "“Legislators and DAB members worked to clear roadblocks in various districts with the help of fellow citizens this morning. Their dedication sets an example for the people and demonstrates how one can inject more positive energy into society. Hopefully social order will be restored.", "“Source of some photos: Hong Kong Commercial Daily", "\"#DAB #WorkTogethertoSaveHongKong #RestoreSocialOrder\".", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]