["About this rating", "In July 2019, Land of Lincoln Goodwill organization did briefly end the paid employment of around a dozen disabled workers.", "The decision was reversed within 16 days, back pay was provided, and the CEO behind the plan resigned.", "In the summer of 2019, concerned readers sent Snopes multiple inquiries about the accuracy of reports claiming that a Goodwill organization in Illinois had announced its intention to terminate the paid employment of its disabled employees.", "On July 16, WCIA reported that the Land of Lincoln Goodwill, headquartered in Springfield, Illinois, would be \"pulling the paychecks\" of dozens of thrift store workers with disabilities, in response to financial pressures purportedly caused by the state's recently announced minimum wage increase:", "\"An iconic nonprofit thrift store is crying poor in the face of looming payroll increases, and it is announcing plans to layoff disabled employees in order to take on the extra cost. However, the 501(c)(3) organization pays no taxes, collects state funding, was awarded state contracts, and has special permission from the federal government to pay disabled workers well below the minimum wage floor.", "\"Sharon Durbin, President and Chief Executive Officer at Land of Lincoln Goodwill, told dozens of disabled thrift store workers they would no longer receive a paycheck as a result of the state’s new minimum wage increase, and she warns future job cuts could still be coming to the last 11 remaining disabled employees still on the payroll.\"", "The move attracted criticism from some quarters, as well as national news coverage. Yahoo! News reported that:", "\" ... Durbin ... informed participants of the Vocational Rehabilitation Program that they would not be receiving a paycheck in the future due to the new minimum wage increase, according to RochesterFirst.com. She also warned the last 11 disabled employees on payroll that their jobs were in danger as well. Durbin explained to the outlet that the increase in wages would cost their region more than $2 million each year.", "\"'By making the changes now, we can start offsetting the expense that we're incurring, not only through Voc. Rehab, but the other things that we're doing in the organization,' said Durbin, who runs the Central Illinois nonprofit branch that oversees 15 retail locations and more than 450 total employees.\"", "A viral Facebook post by Ameika Zahra Black contained an earlier tweet by Mark Maxwell, the author of the aforementioned WCIA article, who wrote:", "\"The President and CEO at Goodwill defended her decision to pull paychecks from disabled workers: 'It really was not a job,' she said. 'We gave them through grace out of our budget to pay them so they had a paycheck to go home with.'\"", "Black's Facebook post and the original WCIA story were both largely accurate descriptions of the decision by Land of Lincoln Goodwill's CEO to end the paid employment of some disabled workers. However, as of Aug. 13, those original texts had not been updated to mention the fact that the local Goodwill organization subsequently reversed that decision and provided the workers back pay, and that Durbin subsequently resigned.", "Other news reports, including the one published by Yahoo! News, for example, were updated to include much of this important additional information, and WCIA itself subsequently published separate articles that detailed the reversal of the decision, the provision of back pay, and the resignation, though the original report was not updated.", "Moreover, WCIA's headline (\"Goodwill pulls paychecks from disabled workers\") did not stipulate that it related only to one Goodwill organization in Illinois. This lack of specificity caused some readers, including some who contacted Snopes, to question whether the decision applied to all Goodwill organizations and stores across the nation. It does not. Goodwill Industries International is structured as a network of autonomous local and regional organizations, each of which independently makes policy and staffing decisions.", "A spokesperson for Land of Lincoln Goodwill provided Snopes the following outline of the episode:", "\"Goodwill made the decision to realign our Vocational Rehab program on July 1, 2019. That decision led to 13 service participants who were earning minimum wage or above to transition out of their paid positions into an unpaid skills building vocational program.", "\"Upon review and reflection, Goodwill rescinded that initial decision on Wednesday, July 17, 2019. All affected service participants were returned to their paid positions on Monday, July 22 and all received back pay dating back to July 1. During the week of July 22, we made personal phone calls to the parents and guardians of our service participants, apologizing for the program change. We also offered to set up personal meetings with them to answer questions and address any concerns.\"", "So it's true that the plan did, in effect, involve firing some workers with special needs (ending their paid employment and moving them into unpaid volunteer positions can quite reasonably be understood as \"firing\" them). However, the decision affected 13 individuals, not the \"dozens\" claimed by WCIA. The decision was also reversed within 16 days, and back pay was provided.", "The organization spokesperson also told Snopes that there was never a prospect of a separate contingent of 11 workers mentioned in WCIA's report losing their paid employment.", "On July 17, Durbin announced in a statement posted to Facebook that Land of Lincoln Goodwill was reversing its decision to fire the disabled employees in question. She apologized for the original decision, writing that:", "\"The outpouring of comments regarding our decision to refocus the Vocational Rehab program and its impact on 12 program participants has caused us to take pause. While we must be good stewards of our nonprofit, we must remain sharply focused on our mission.", "\"Our recent decision regarding the Voc Rehab program and the resulting harm it might have caused falls short of living up to our mission and we apologize for this error in judgment. We are reversing the decision to realign our Voc Rehab program and those participants affected will return to their part time skills training program with pay ... As the President & CEO of this organization, I want to apologize to our constituents, our clients and our faithful donors.\"", "Amid continued criticism and backlash, the organization's board of directors announced two days later that it had accepted Durbin's resignation:", "\"On Thursday, July 18, Sharon Durbin, President & CEO of Land of Lincoln Goodwill submitted her resignation to the Board of Directors. The Board accepted her resignation, which is effective immediately ... The Board fully intends to seek out a strong, compassionate leader for our Goodwill organization who can energize our employees, expand our mission and who can provide the mission-driven leadership necessary to positively impact thousands of lives each year in central Illinois.", "\"Goodwill’s Board of Directors thanked Sharon for her 13 years of service to the organization, noting her many accomplishments and the overall growth of the nonprofit and the number of people served during her tenure.\"", "Maxwell, Mark.  \"Goodwill Pulls Paychecks From Disabled Workers.\"\r\n  WCIA.  16 July 2019.", "Petrella, Dan.  \"Gov. J.B. Pritzker Signs Law Raising Illinois' Minimum Wage to $15 an Hour by 2025.\"\r\n  Chicago Tribune.  19 February 2019.", "Schreiber, Hope.  \"Illinois Goodwill Cuts Paychecks for Disabled Employees as State Implements New $15 Minimum Wage.\"\r\n  Yahoo! News.  16 July 2019.", "Land of Lincoln Goodwill.  \"Statement From Goodwill Regarding Our Vocational Rehab Program.\"\r\n  Facebook.  17 July 2019.", "Land of Lincoln Goodwill.  \"Statement From Goodwill Board of Directors.\"\r\n  Facebook.  19 July 2019.", "Updated [7 February 2020]: Added reference and hyperlinks to three July 2019 WCIA articles that detailed Land of Lincoln Goodwill's reversal of the decision to end the paid employment of some disabled workers, the provision of backpay to those workers, and the resignation of CEO Sharon Durbin.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]