["About this rating", "After months of protests against racism and police brutality across the U.S., Portland, Oregon, emerged as the new epicenter of demonstrations in response to the May 25, 2020, death of a Black man, George Floyd, in Minneapolis police custody. With the agitation came rumors and reports across the city of violence from federal agents, protesters being abducted in vans, tear gassing, and more, and the media and our readers continued to pay close attention to events in Portland.", "Among these stories, online video footage showing little children at one particular protest bearing signs that read “Fuck the police” and “Eff Trump goons” captured the internet and media's attention, as it was shared by conservative influencers such as Donald Trump Jr. and Andy Ngô. The video also showed children using curse words to refer to the police.  Snopes readers asked us if this actually took place.", "The video appears to be genuine. We should note that we have obscured the faces of the children for privacy reasons, but have linked to the original video and photographs below.", "We found what appeared to be the original posted footage of toddlers holding these signs in a July 22 Facebook Live video filmed in a park in front of the Mark O. Hatfield Courthouse in downtown Portland. Another sign held in the background by an older person read, “Fuck Ted Wheeler,” referring to Portland Mayor Ted Wheeler, who has been under fire for his response to security forces' violence against protesters. A Snopes staff member who resides in Portland confirmed the location of the gathering seen in the footage. Images showing the children from other angles appeared in Facebook posts as well.", "Filmmaker Rod Webber confirmed to us that he filmed three toddlers holding these signs on Facebook Live while they were accompanied by adults. His footage appeared to be the same as that shared in Ngô's tweet, with Webber's voice addressing the children. He did not determine who the adults seen in the video were. The text on the signs in the video also showed up backwards because the filmmaker was apparently recording in selfie mode, which causes some cameras doing a Facebook livestream -- depending on how old they are -- to produce a \"mirror\" effect. Webber said he edited his livestream footage and posted his encounters with the children to Twitter, where it went viral. Below is a screenshot of his footage:", "The complete footage showed Webber walking around the park outside the courthouse as people gathered, painted protest signs on the ground, grilled food, and played the drums. At two points, around 12 minutes in, and a minute before the end of the livestream, he encountered the children in the park with the signs.", "Before Webber signed off he walked toward the children saying, “These kids are the best.” The children held up the signs, waved to the camera, and two of them repeated, “Fuck the police” after being encouraged by the adults around them. Someone in the background said, “Power to the people,” as one child raised her fist in what some refer to as a Black power salute, a popular gesture during protests against racial injustice. Webber told Snopes that the adults gave permission: \"The adults in the group saw that I was live streaming, made eye contact and we both went toward each other. Judging by nods, facial expressions and [their] guidance of the children, I interpreted this as consent.\"", "Since we confirmed the origins of the footage, the identity of the filmmaker who appeared in the footage himself, saw the children were walking around with adults while holding the signs in a clearly identifiable location, and the incident was reported by the news media, we rate this claim as “True.”", "The Associated Press.   \"Federal Agents Use Tear Gas to Clear Rowdy Portland Protest.\"\r\n   25 July 2020.", "Bailey Jr, Everton.  \"Portland Mayor Ted Wheeler, Commissioner Jo Ann Hardesty Call for ‘Cease Fire’ By Federal Authorities.\"\r\n   The Oregonian/Oregon Live.  27 July 2020.", "CBS News.   \"Federal Agents Tear-Gas Portland Protesters Again Despite Plan for the Agents to Leave Town.\"\r\n    30 July 2020.", "Kates, Graham.   \"The Clashes in Portland, Explained.\"\r\n   CBS News.  28 July 2020.", "Lee, Jessica.   \"Were Portland Protesters ‘Kidnapped’ by Federal Officers in Unmarked Vans?\"\r\n   Snopes.   22 July 2020.", "MacGuill, Dan.   \"Did Photographs Show a Naked Woman Protesting in Portland?\"\r\n   Snopes.   21 July 2020.", "Martin, Jeffery.   \"Young Children in Portland Caught on Video Saying 'F*** the Police'.\"\r\n   Newsweek.  23 July 2020.", "McGreal, Chris.   \"Federal Agents Show Stronger Force at Portland Protests Despite Order to Withdraw.\"\r\n   The Guardian.   30 July 2020.", "Spata, Christopher.  \"What Does a Raised Fist Mean in 2020?\"\r\n   Tampa Bay Times.  25 June 2020.", "Nur Nasreen Ibrahim is a reporter with experience working in television, international news coverage, fact checking, and creative writing.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]