["The 21-second clip was published here on Facebook on July 11, 2020.", "Gandhi can be seen speaking at a lectern. His comments in Hindi translate to English as: “No one is a bigger fool than me in this country. I made Narendra Modi the prime minister of the country, and today, while I am a parliamentarian in this country, I cannot say a word in front of Modi. He doesn’t allow me to speak.”", "The post’s Hindi caption reads: “Rahul Gandhi is great, at least he accepted it honestly that no one is a bigger fool in the country than him.”", "Rahul Gandhi is an Indian politician who served as the president of the Indian National Congress party until July 2019.", "The video was also shared here and here on Facebook and here and here on YouTube, alongside a similar claim.", "The claim, however, is false.", "A combined reverse image and keyword search on Google found a longer version of the video published here on Gandhi’s official YouTube channel on June 11, 2018.", "The video is titled: “Congress President Rahul Gandhi's speech at Talkatora Stadium in New Delhi.”", "In the YouTube video’s 15-minute 10-second mark, Gandhi relays a conversation he had with a fellow Indian politician. He says: “A Member of Parliament met me outside the bathroom in the parliament building. He stopped me. I cannot disclose his name, if I disclose his name, Modi will throw him out. There were four-five of them. So, I asked him jokingly, what’s happening, and one of them held my hand and said: ‘No one is a bigger fool than me in this country. I made Narendra Modi Prime Minister of this country, and today, while I am a parliamentarian of this country, I cannot say a word in front of Modi, he doesn’t allow me to speak. And I am not saying this alone, all the other parliamentarians are scared as well. Nobody listens to us’.\"", "Below is a screenshot comparison between the misleading video (L) and YouTube video (R):", "Gandhi’s full speech was also published here on the Indian National Congress Party’s website in June 2018. This video also shows Gandhi quoting a fellow politician.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]