["About this rating", "At least one copy of the letter with the misspelled word exists.", "The misspelling was reproduced in every copy.", "Whether the error was regional or fabricated.", "The Trump administration is not known for accuracy when it comes to spelling; from the names of contemporary world leaders, to historical figures, to innocuous words like \"education,\" the administration has repeatedly made headlines with embarrassing mistakes. So a 7 June 2017 Facebook post claiming that the Department of Education had misspelled the word \"success\" in a letter to parents seemed plausible.", "Castro Valley, California parent Kendra Galordi Frautnick shared a copy of a letter on Facebook that the Trump Administration purportedly sent to her daughter, congratulating the eighth grader on her receipt of the President's Education Award:", "We spoke to a representative from the Department of Education's President's Education Awards Program, who told us that the letters of congratulations were not intended to be distributed to individual students, but to be read aloud at an awards ceremony by a school administrator. The representative said 2017 was the first year in which the letter was not physically mailed to participating schools, but made available for download on the PEAP web site.", "The official version of this year's letter [PDF], does not contain the purported typographical error spelling \"success\" as \"succuess\":", "Although a separate person claims that a friend received the version with an error on the same date Frautnick shared the photograph, that account was secondhand and might have referenced Frautnick's Facebook post. Aside from that copy, we were unable to find any versions containing the spelling error.", "Frautnick sent us additional photographs to show that she had not doctored the image of the letter that she posted to Facebook. She told us:", "It’s the actual letter my daughter received with the presidential award. I took a picture of it when she pointed out the typo. I posted it and it went viral. She received it from the white house through her school.", "The official published President's Education Award letter for 2017 lacked the \"succuess\" error present in Facebook shares of the document. We rate this \"mostly false\" because a copy of the letter with the spelling error exists but was not reproduced across the country. We have so far unable to determine whether the typographical error was only regionally distributed or simply fabricated.", "Reeves, Chris.   \"So Much Success In The Trump White House, They Can't Even Spell The Word.\"\r\n    Daily Kos.   9 June 2017.", "National Association of Secondary School Principals: Downloads.   \"President's Education Award Letter.\"\r\n    Accessed 12 June 2017.", "Wikipedia.   \"President's Education Awards Program.\"\r\n    Accessed 12 June 2017.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]