["A photograph has been shared on social media with the claim that the man is 1857 freedom fighter Banke Chamar. Twitter user Vinod Sharma wrote, “He is Banke Chamar. The leader from Jaunpur in the 1857 revolution. The British had declared a reward of 50,000/- on him when 2 cows were sold at 6 paisa. The informer got him caught & he was hanged along with 18 other revolutionaries. And some people say that India attained its freedom through a spinning wheel?!” (Archive link)", "ये हैं बांके चमार.. 1857 की क्रांति में जौनपुर क्रांति के मुखिया। अंग्रेजों ने उस समय सबसे बड़ा ₹50000 का इनाम रखा था जब एक आना में 2 गाय मिलती थी। मुखबिर ने पकड़वा दिया और 18 साथियों समेत फांसी पर लटक गए थे।🤔", "और कुछ लोग कहते हैं आज़ादी चरखे से मिली?!🙄 pic.twitter.com/mNJuxJzOC1", "— Vinod Sharma #HTL 🕉️ (@vinodsharma1834) March 3, 2021", "Twitter user Ashish Jaggi also shared the picture stating that it shows Banke Chamar. (Archive link)", "He is Banke Chamar The leader from Jaunpur in 1857 revolution. The British had declared a reward of 50,000/- on him when 2 cows were sold 6 paisa. The informer got him caught & he was hanged alongwith 18 other revolutionaries.", "क्या आज़ादी चरखे से मिली थी ?", "Let’s make him famous pic.twitter.com/ArcCkpCGdp", "— Ashish Jaggi (@AshishJaggi_1) February 24, 2021", "This photo is viral on Twitter and Facebook and has also made its way to WhatsApp with the accompanying claim.", "This slideshow requires JavaScript.", "Some people have also shared the photo in the name of another freedom fighter named Udaiya Chamar. Pradeep Narwal, the National Convenor of the Scheduled Castes Department of the Congress, was among those promoting this claim. He had tweeted the picture on July 20, 2020 (Archive link)", "दलित नायक उदैया चमार, अंग्रेजों के खिलाफ जंग का ऐलान 1804 में ही हो गया था। छतारी के नवाब नाहर खां के योद्धा ऊदैया चमार ने अंग्रेजों की गलत नीतियों से खफा होकर सैकड़ों अंग्रेजों को मौत के घाट उतार दिया। उसकी वीरता के चर्चे आज भी अलीगढ के आस -पास के क्षेत्रो में कहे सुने जाते हैं। pic.twitter.com/PacJSTpwEr", "— Pradeep Narwal (@Narwal_inc) July 20, 2020", "Alt News performed a reverse image search and found that Wikipedia said the image is from the 1860s and the man hails from a Hindu fisherfolk caste in East Bengal. Wikipedia has cited the British Library as the source. A reverse image search of the image on Wikipedia led us to the British Library.", "According to the British Library, this picture shows a member of the Kaibartha, a community of Hindu fisherfolk who settled in East Bengal. The website does not mention where the image was taken or by whom. However, it is dated early 1860. The Kaibartha community was among the first settlers of Bengal.", "Thus the man is neither Banke Chamar nor Udaiya Chamar, but a tribal from a caste in the Eastern India.", "Who were Banke Chamar and Udaiya Chamar?", "An article on Dalit Dastak from August 2016 identifies Banke Chamar as a freedom fighter from Jaunpur (Uttar Pradesh). “Banke Chamar was the most prominent of the 18 revolutionaries who were declared rebels in the Jaunpur revolution of 1857. The British government had put out a reward of 50,000 for anyone who captured him dead or alive. In the end, he was arrested and given the death penalty,” read the report.", "We also found references to Banke Chamar in several books. These described him as a freedom fighter in the 1857 Rebellion. The book ‘Dalits and Memories of 1857‘ states that Banke Chamar lived in Kuarpur village of Jaunpur’s Macchli Shahar. After the revolution failed, Banke and 18 of his associates were hanged by the British government.", "Similarly, Udaiya Chamar was also a freedom fighter. A 2016 article in the Navodaya Times states that in 1804, the loyalist and favourite of the Nawab of Chattari, Udaiya Chamar got wind that the British were up to no good with their policies. He killed many of their men. In 1807, the British captured Udaiya and hanged him. He is also mentioned in many books available on Google Books.", "We were unable to find pictures of Banke Chamar and Udaiya Chamar online. However, the viral image shows a member of a fisherfolk community from Eastern Bengal.", "Donate Now", "Kinjal Parmar holds a Bachelor of Science in Microbiology. However, her keen interest in journalism, drove her to pursue journalism from the Indian Institute of Mass Communication. At Alt News since 2019, she focuses on authentication of information which includes visual verification, media misreports, examining mis/disinformation across social media. She is the lead video producer at Alt News and manages social media accounts for the organization.", "What’s in a name? Apparently, a lot, if social media trends and raging political discourses…", "As Karnataka is set to go to the polls in two months’ time, all parties…", "The Qutub Minar is a UNESCO world heritage site in South Delhi. The name literally…", "On February 21, external affairs minister S Jaishankar gave an interview to ANI journalist Smita…", "An image of an apparently ancient sculpture is viral with the claim that it was…"]