["On April 13, Twitter user Neha Rathore tweeted a two-minute video in which a man is tied a tree and brutally thrashed by a group on men. The video is graphic therefore Alt News hasn’t embedded it in the article. Those who wish to view the video can click here. This tweet has been retweeted over 800 times and the video has been viewed over 14,700 times. (archive link)", "While tweeting, Rathore wrote – “I downloaded this video from Facebook, if I were a man I would burn these dogs alive. Muslims aren’t a threat to the nation. These bastards are the threat to the nation. Therefore I want to stay away from blind devotees. Our government is busy playing the Hindu-Muslim card. (translated from यह वीडियो मैंने फेसबुक से डाउनलोड की है अगर मैं मर्द होती तो इन कुत्तों को मैं जिंदा जला देती है। देश को मुसलमानों से खतरा नहीं है। देश को इन हरामियों से खतरा है। इसलिए मैं अंध भक्तों से दूर रहना चाहती हूं। हमारी सरकार को हिंदू-मुस्लिम करने से फुर्सत नहीं है।)”", "Similarly, several other users shared the viral video on Twitter with the same Hindi text.", "This is not the first time this video has gone viral. In May 2019, Alt News had fact-checked the video when it was shared ahead of West Bengal elections with the false claim that a Hindu man was beaten for hoisting a saffron flag in the state. We found out that the video actually captures a case of flogging in Deoria, Uttar Pradesh from 2018. The police arrested six people for beating an 18-year-old after tying him to a tree.“The victim was assaulted as [he] had reportedly asked one of the accused to return Rs 1,500 he had lent, they [police] said,” reported The Indian Express on March 31, 2018.", "The report identifies the victim as Shamshad. “Shamshad had lent Rs 1,500 to Nasir two months ago, which the latter had not returned. The duo had quarrelled over the issue and Shamshad had also beaten Nasir for not returning the money. Nasir avenged this beating on Wednesday,” a police officer is quoted as saying, “Nisar and his friends had lured Shamshad to a deserted field, where they assaulted him.”", "Thus a 2018 video of assault due to personal enmity was shared on social media with a communal narrative. While there have been several instances of misinformation related to coronavirus targetting the Muslim community, this video was shared with an attempt to show the Hindu community in poor light.", "Donate Now", "Kinjal Parmar holds a Bachelor of Science in Microbiology. However, her keen interest in journalism, drove her to pursue journalism from the Indian Institute of Mass Communication. At Alt News since 2019, she focuses on authentication of information which includes visual verification, media misreports, examining mis/disinformation across social media. She is the lead video producer at Alt News and manages social media accounts for the organization.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]