["About this rating", "After Illinois teen Kyle Rittenhouse was charged with fatally shooting two people and wounding another during a protest in Kenosha, Wisconsin, on Aug. 25, 2020, Snopes received numerous inquiries from readers wondering if a self-described Christian crowdfunding website was hosting a fundraiser to supposedly help pay Rittenhouse's legal defense.", "The killings occurred during a chaotic confrontation between people protesting the Aug. 23 police shooting of a Black man, Jacob Blake, and armed vigilantes who claimed to be patrolling the lakeside city to prevent looting and property destruction. Rittenhouse, 17, was captured in video footage carrying a military-style rifle, marching alongside members of the latter group, and putting his hands up after shots were fired. Authorities arrested him on Aug. 26 in connection with the deaths in Antioch, Illinois, where he was being held without bail and awaiting his next court hearing on Sept. 25.", "The charges against Rittenhouse included first-degree intentional homicide, which carries a life sentence. The Chicago Tribune reported:", "Rittenhouse’s case immediately became a popular cause in conservative circles, where pundits began defending the teenager before he had even been charged. At least two defense funds have been launched in his name in recent days, though it’s unclear if the Rittenhouse family supports either of those efforts.", "That brings us to the question from Snopes readers: Was a website that brands itself as Christian called GiveSendGo hosting an apparent online fundraiser to help Rittenhouse pay court costs?", "First, we searched several crowdfunding sites for online campaigns with a similar stated goal: to raise money to help Rittenhouse or his family fight criminal charges against him. None appeared on GoFundMe, as of this report.", "Several crowdfunding pages, however, were active and allegedly supporting Rittenhouse's case on Fundly (see partial search results below). Additionally, a conservative student group at Arizona State University pledged to donate half of its future fundraising dollars to the cause. \"[Rittenhouse] does not deserve to have his entire life destroyed because of the actions of violent anarchists during a lawless riot,\" the college group tweeted.", "Next, we considered crowdfunding platforms that describe themselves as Christian and researched GiveSendGo at readers' requests. According to the website, which describes itself as the \"#1 Free Christian Crowdfunding Site,\" users can organize and run crowdsourcing campaigns for free by using personalized logins and donate to GiveSendGo directly. The website's \"About Us\" page stated:", "GiveSendGo is meant to give Christians the opportunity to be supported by the body of Christ. A place for the body of Christ to get out from their comfortable pews and support people in God's family that they might not have ever known about. [...] A place for Christians.", "Based on that evidence, it was accurate to claim GiveSendGo describes itself as a website that promotes Christianity.", "Then we looked for proof of pages supporting Rittenhouse on the platform. A keyword search for \"Kyle Rittenhouse\" uncovered several pages, including a fundraiser titled \"Raise Money For Kyle Rittenhouse Legal Defense\" that had raised more than $314,000 as of this report.", "It was the most popular and active GiveSendGo campaign created to supposedly help the teen or his family. The page included the following the description:", "Kyle Rittenhouse just defended himself from a brutal attack by multiple members of the far-leftist group ANTIFA – the experience was undoubtedly a brutal one, as he was forced to take two lives to defend his own.", "Now, Kyle is being unfairly charged with murder 1, by a DA who seems determined only to capitalize on the political angle of the situation. The situation was clearly self-defense, and Kyle and his family will undoubtedly need money to pay for the legal fees.", "Let's give back to someone who bravely tried to defend his community.", "On Aug. 28, 2020, the page's organizers — \"Friends of the Rittenhouse family\" of Atlanta, Georgia — wrote an update to the page in which they claimed they had spoken with Rittenhouse's mother and legal team and that that party was raising money via multiple methods. The organizers of the GiveSendGo campaign pledged: \"All of the money donated ... will go to Kyle's defense, as it is likely to be an expensive and protracted affair.\"", "No specific details on the GiveSendGo page's organizers were known, including how or under what circumstances they started the alleged fundraiser. Anyone can establish a campaign on the site; donors are encouraged to report pages that appear suspicious or fraudulent, and there was no evidence to confirm or deny the organizers of the campaign for Rittenhouse were indeed giving the payments to help his legal defense, aside from the above-described pledge from them. That update also read:", "Kyle is reportedly in good spirits, and I'm told that the incredible support shown by you good people is what's keeping him going.", "... This young man has reinvigorated the faith of many that this country and its founding principles are indeed founded upon the rock, not built upon the sand.", "However, a city upon a hill cannot be hid; Kyle now faces the wrath of those who would see us stripped of our God-given rights and reduced to servitude. He is in dire need of our help.", "The GiveSendGo page collected more than 7,330 donations as of this report, some of which included messages of support for Rittenhouse. \"This young man is a hero. Give him a medal and make him a millionaire. Every patriot can spare him a few bucks\" said an anonymous donor who contributed $10, per the page. Another donor said:", "Based on those findings — yes, a self-described Christian crowdfunding website GiveSendGo was hosting a campaign to supposedly help Rittenhouse — we reached out to the website's administrators to learn under what terms it hosts campaigns on its platform. Jacob Wells, a co-founder of the site, told us via email:", "GiveSendGo allows campaigns from all kinds of different people and political/religious ideologies. Just because we are Christians does not mean every campaign on our site has to be one or that we agree with its campaign premise.", "[...] We will withhold judgement and leave that for the courts and God. Our judicial system works on the principle of innocence until proven guilty. As a veteran owned platform we recognize the freedoms we have in the USA came at a very high price and we will not just trample on them to satisfy political correctness.", "Additionally, he said site administrators were conducting a review of the page involving Rittenhouse to make sure it follows site guidelines, though they \"currently believe the campaign is eligible like any other campaigns because it does not violate our terms of service.\"", "On Aug. 27 the crowdfunding site posted the following statement to Twitter:", "The campaign stoked controversy online among people who believed it wrongfully celebrated the actions of an alleged killer and should be removed from the crowdfunding website. Referring to Blake, who was paralyzed from the waist down after a white police officer shot at his back multiple times on Aug. 23, one Facebook user alleged:", "In response to those critics, Wells told Snopes:", "We recognize that we live in a world of diverse ideas and opinions and that part of our strength is in that diversity. We will respond with grace to those that disagree with us. We will give grace to ourselves to not always get it right as we learn and grown. Finally we will give grace to the campaign owner, those that support the campaign, and Kyle as he walk out [sic] the ramifications of his actions.", "In sum, given how GiveSendGo describes itself — the \"#1 Free Christian Crowdfunding Site\" — as well as evidence of listed donations on a webpage that says it will give all contributions to help fund Rittenhouse's legal defense, we rate this claim \"True.\"", "Republicans United.   \"Welcome.\"\r\n    Accessed 31 August 2020.", "The Associated Press.   \"Arizona Student Fundraiser for Kenosha Shooting Suspect Kyle Rittenhouse Stirs Outrage.\"\r\n   Los Angeles Times.   31 August 2020.", "GiveSendGo.    \"About Us.\"\r\n    Accessed 31 August 2020.", "GiveSendGo.    \"Got Questions?\"\r\n    Accessed 31 August 2020.", "Stone, Michael.   \"Christian Crowdfunding Site Raising Money For Kenosha Killer Kyle Rittenhouse.\"\r\n    Patheos.   28 August 2020.", "Willis, Haley, et. al.   \"Tracking The Suspect In The Fatal Kenosha Shootings.\"\r\n   The New York Times.   27 August 2020.", "Jessica Lee is Snopes' Senior Assignments Editor with expertise in investigative storytelling, media literacy advocacy and digital audience engagement.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]