["A claim circulating on social media alleges that the World Health Organisation (WHO) has taken a ‘U-turn’ and said that asymptomatic COVID-19 patients needn’t be isolated or quarantined as they cannot spread the virus.", "A video of Dr Maria Van Kerkhove, technical lead COVID-19, WHO Health Emergencies Programme, is also making the rounds on YouTube. From the channel ‘JayyU.S TV’, it has gained nearly 50,000 views.", "Alt News has also received verification requests on its official mobile application.", "The viral clip is part of a press briefing held by WHO on June 9. The transcript of the complete briefing can be accessed here.", "At 34 minutes Dr Kerkhove says, “We have a number of reports from countries who are doing very detailed contact tracing. They’re following asymptomatic cases, they’re following contacts and they’re not finding secondary transmission onward. It’s very rare and much of that is not published in the literature. We are constantly looking at this data and we’re trying to get more information from countries to truly answer this question. It still appears to be rare that an asymptomatic individual actually transmits onward.”", "WHO did not say that asymptomatic patients cannot spread coronavirus but that the transmission is “very rare”. This comment was not well-received by the scientific community. Liam Smeeth, a professor of clinical epidemiology at the London School of Hygiene and Tropical Medicine, was quoted by Reuters as saying, “It goes against my impressions from the science so far that suggest asymptomatic people – who never get symptoms – and pre-symptomatic people are an important source of infection to others.” He added that he had not seen the data Kerkhove’s statement was based on.", "The next day, WHO clarified on its statement and said that more research is needed to establish the extent of asymptomatic transmission.", "“Since early February, we have said that asymptomatic people can transmit #COVID19, but that we need more research to establish the extent of asymptomatic transmission. That research is ongoing”-@DrTedros", "— World Health Organization (WHO) (@WHO) June 10, 2020", "It further said, “To some, it came across as if the WHO was suggesting that people without symptoms weren’t driving spread. Some studies, however, have estimated that people without symptoms (whether truly asymptomatic or presymptomatic) could be responsible for up to half of the spread, which is why the virus has been so difficult to contain. Isolating people who are sick, for example, does not prevent the possibility they already passed the virus on to others. Some modeling studies have assumed quite widespread asymptomatic transmission.”", "Viral social media claims also suggest that asymptomatic patients needn’t be quarantined however WHO never made such a statement. It in fact said, “People not showing symptoms can spread the virus, whether they ultimately feel sick or not. That’s why wearing masks and keeping distance are so important to limiting transmission.”", "In a tweet posted yesterday (July 16), WHO wrote that one of the reasons Spain was able to manage COVID-19 transmission is isolation.", "Therefore, the World Health Organisation is in favour of self-isolation and the claim that asymptomatic patients cannot spread the disease is false.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video of a ladder moving on its own, purportedly from Jharkhand, is viral on…", "In a 2-minute video, a man recommends a “technique” to prevent infection from Omicron, the…", "A video of a set of iron nails that appear to melt after being placed…", "Several social media users have shared an image that shows two columns — ‘Cepa/variante’ (Spanish…", "A 90-second video of a man dissecting a banana has been shared on the internet…."]