["About this rating", "On 20 December 2018, four months after Sen. John McCain's death, Katrina Pierson did publish a tweet which contained the words \"John McCain Still Refuses to Answer Questions About His Role in the Dossier.\"", "Those words came from the headline of a November 2017 article which Pierson was sharing and automatically appeared in her tweet when she used a Twitter sharing button on the article's web page. The phrase was not the result of Pierson's ignorance about McCain's August 2018 death or any belief in the supernatural.", "The ongoing saga surrounding the controversial \"Steele dossier\" (or \"Trump–Russia dossier\") saw a new development in December 2018, when a judge's order suggested that a former State Department official and associate of the late Republican U.S. Senator John McCain of Arizona may have been involved in providing parts of the dossier to a reporter from BuzzFeed.", "Aleksej Gubarov, former chairman and CEO of a company called XBT Holdings, is suing Buzzfeed in federal court, alleging defamation after the website published excerpts from an intelligence report compiled by former British intelligence official Christopher Steele. The research detailed alleged Russian efforts to acquire compromising and scandalous information about then-presidential candidate Donald Trump, as well as alleged collusion between Russia and individuals affiliated with the Trump campaign, including the president's former personal lawyer Michael Cohen.", "Both Gubarov and XBT Holdings were named in the report published by Buzzfeed, prompting the lawsuit in the U.S. District Court for the Southern District of Florida.", "The \"Steele dossier\" has long been regarded as controversial, especially since it was reported in October 2017 that the Democratic National Committee and the campaign of Hillary Clinton had partially funded the research that gave rise to the report.", "Before his death in August, McCain publicly disclosed the fact that he had acquired Steele's research in 2016 and personally provided it to then-FBI Director James Comey.", "However on 19 December, U.S. District Judge Ursula Ungaro averred in a court order that the dossier had come into the possession of a reporter from BuzzFeed after a meeting with David Kramer, an associate of McCain and a former Deputy Assistant Secretary of State with responsibility for Russia, Ukraine, Belarus, and Moldova.", "Some supporters of President Trump have targeted McCain for his involvement in promulgating the Steele dossier, and Judge Ungaro's affirmation that the dossier came into the possession of a reporter after a meeting with an associate of Trump's prompted further scrutiny and coverage from right-leaning sources in December 2018.", "Against that background, reports emerged on 20 December that a high-profile advisor and spokesperson for President Trump had publicly called on McCain to \"answer questions\" about his role in the dissemination of the Steele dossier, despite his having died four months earlier. The Huffington Post reported, for example that:", "Donald Trump campaign aide Katrina Pierson appeared to slam the late Sen. John McCain in a tweet oor failing to answer questions on the Christopher Steele dossier concerning Trump and Russia. McCain died Aug. 25.", "Pierson, who describes herself as a “senior adviser” for Trump’s 2020 campaign and who worked on his 2016 campaign, tweeted that McCain “Still Refuses to Answer Questions About His Role” concerning the dossier, which was compiled by the former British spy and included unverified accusations. Trump supporters insist the dossier is the only reason an investigation was launched into Trump’s connections with Russia.", "The headline of the Huffington Post's article read \"Trump Campaign Aide Appears to Scold the Late Senator John McCain for His Silence\" and the article asserted that Pierson's tweet had \"made it sound as if she were attempting to communicate with the dead.\"", "The Raw Story website similarly stated that \"A former Trump campaign spokesperson demanded that recently-deceased Sen. John McCain answer questions about a controversial dossier — and immediately drew ridicule.\" Likewise, Newsweek reported under the headline \"Trump 2020 Adviser Katrina Pierson Calls on John McCain to Answer Dossier Questions ...\" that:", "In a now widely-mocked post that has been circulated more than 1,000 times, Pierson wrote: “Since everyone is just now realizing his staffers role in the #RussiaHoax. We have been asking questions! John McCain Still Refuses to Answer Questions About His Role in the Dossier.”", "The last sentence was the title of a November 2017 blog post on Pierson’s personal website. For an unknown reason, the Trump staffer chose to include it in the December 20 update to her hundreds of thousands of followers. Twitter users, as they tend to do, reacted quickly to the post. “Have you considered hiring a medium to assist with that?” one top comment read. Memes were posted. Jokes made. Retweets mounted. “He’s dead,” read one helpful reply.", "These articles accurately reported the wording in Pierson's tweet, but their suggestions that she had sincerely demanded (or even appeared to demand) that the late Arizona senator answer questions from his critics are off the mark and ignore a perfectly simple explanation for the phrasing in her tweet.", "On 20 December, Pierson did indeed tweet the following words:", "Since everyone is just now realizing his staffers [sic] role in the #RussiaHoax We have been asking questions! John McCain Still Refuses to Answer Questions About His Role in the Dossier", "Since everyone is just now realizing his staffers role in the #RussiaHoax We have been asking questions! John McCain Still Refuses to Answer Questions About His Role in the Dossier https://t.co/acsVdH1GTq", "— Katrina Pierson (@KatrinaPierson) December 21, 2018", "It is therefore true that the body of her tweet contained the words \"John McCain still refuses to answer questions about his role in the dossier.\" However, this was also the headline of an article to which Pierson linked in the same tweet, as clearly indicated by the fact that the initial letters of each of those words were capitalized in the style of a headline:", "That article was published on Pierson's website on 2 November 2017, when McCain was still alive.", "So the explanation for the somewhat awkward phrasing in Pierson's tweet does not lie in her ignorance about the McCain's passing, or in some sort of desire to communicate with the dead, but rather something far more reasonable and mundane.", "If a reader wished to share Pierson's November 2017 article on Twitter, one way of doing that would be to click the \"Tweet\" button at the bottom of that page. This action automatically produces a window containing the draft of a tweet and a link to the article along with the headline of the article: \"John McCain Still Refuses to Answer Questions About His Role in the Dossier\" -- as shown below:", "That's the exact same formulation of words that appeared in Pierson's widely-ridiculed tweet on 20 December, complete with capitalized first letters, in the style of a headline. In front of this headline, Pierson appeared to have simply typed: \"Since everyone is just now realizing his staffers role in the #RussiaHoax We have been asking questions!\"", "So the mistake Pierson made was not forgetting Sen. John McCain had died in August or believing it might still be possible for him to respond to his critics from beyond the grave. Rather, she failed to add punctuation to her tweet which would have more clearly separated the headline of the November 2017 article from her own December 2018 commentary.", "The mistake others made was to spring into action with witty retorts and news articles, apparently before considering that the actual explanation for Pierson's tweet was eminently reasonable rather than the result of any ignorance or supernatural beliefs on her part.", "Re, Gregg.   \"McCain Associate Shared Unverified Steele Dossier with Buzzfeed, Court Filing Says.\"\r\n    Fox News.   20 December 2018.", "Ungaro, Judge Ursula.   \"Order -- Gubarev et al vs. Buzzfeed Inc. et al.\"\r\n U.S. District Court, Southern District of Florida.   19 December 2018.", "Haltiwanger, John.   \"John McCain Addresses Conspiracy Theories About Him and the Salacious Trump-Russia Dossier: 'Anyone Who Doesn't Like It Can Go to Hell.'\"\r\n    Business Insider.   22 May 2018.", "Wyrich, Andrew.   \"Trump Supporters Blast McCain's Decision to Share Steele Dossier with FBI.\"\r\n    The Daily Dot.   10 May 2018.", "Ross, Chuck.   \"John McCain Associate Gave Dossier to BuzzFeed.\"\r\n    The Daily Caller.   19 December 2018.", "Papenfuss, Mary.   \"Trump Campaign Aide Appears to Scold the Late Senator John McCain for His Silence.\"\r\n    The Huffington Post.   20 December 2018.", "Al-Sibai, Noor.   \"Trump Surrogate Katrina Pierson Demands John McCain Answer Her Questions -- And Gets Buried in Ridicule.\"\r\n     Raw Story.   20 December 2018.", "Murdock, Jason.   \"Trump 2020 Advisor Katrina Pierson Calls on John McCain to Answer Dossier Questions, Gets Trolled on Twitter.\"\r\n    Newsweek.   21 December 2018.", "KatrinaPierson.com.   \"John McCain Still Refuses to Answer Questions About His Role in the Dossier.\"\r\n    2 November 2017.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]