["About this rating", "On 5 September 2016, the official Twitter account for the Durex brand of condoms posted a message seemingly announcing the arrival of the new eggplant-flavored product:", "#BreakingNews: We're launching an exciting new savoury #condom range - Eggplant flavour! ? #CondomEmoji pic.twitter.com/idA07EaiXC", "— Durex Global (@durex) September 5, 2016", "Although the tweet really issued from Durex, its content was rather tongue in cheek. The message was intended to garner the attention of customers and enlist them in the push for the creation a new condom emoji to promote safe sex, as Durex soon explained:", "You got us, there’s no Eggplant condom! But why no #CondomEmoji? RT if you agree emoji makers should make one! pic.twitter.com/6H6AU6zkJ6", "— Durex Global (@durex) September 5, 2016", "The \"eggplant\" emoji is occasionally used as a reference to male genitalia. While this substitution may work for some sexting purposes, Durex launched a campaign in November 2015 with the hopes of creating an official safe sex condom emoji:", "Durex®, a leading global sexual well-being brand has launched a worldwide campaign calling for the creation of the world’s first official safe sex condom emojis. Emojis are a crucial part of how young couples connect, and research suggests that the creation of official safe sex emojis are vital to inserting messages around protection into their sexual conversations.", "In light of this research, the Durex brand is asking 1 million people to use and share the hashtag #CondomEmoji to represent their support of the creation of the world’s first official safe sex emojis by the Unicode Consortium.", "Global research commissioned by the Durex* brand further reveals that emojis play a vital role in young people’s conversations around sex. This research also unearthed some concerning data around the rise in apathy towards engaging in safer sexual practices:", "o 80% of 18-25 year olds find it easier to express themselves using emojis and more than half of respondents regularly using emojis when discussing sex", "o 84% of 18-25 year olds said they feel more comfortable talking about sex using emojis", "o More than one-third of 18- to 25-year-olds claim not to care about safe sex, and nearly half think that HIV will never affect them or their friends", "\"In light of this research, the Durex brand is asking 1 million people to use and share the hashtag #CondomEmoji to represent their support of the creation of the world’s first official safe sex emojis by the Unicode Consortium,” says Karen Chisholm, Marketing Director, Durex USA. \"Emojis of this sort will enable young people to overcome embarrassment around the discussion of safe sex, encourage conversation and raise awareness of the importance of using condoms in protecting against sexually transmitted infections (STIs), including HIV and AIDS.\"", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]