["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A fake news website is posting a real image of President-elect Donald Trump and using it to draw a bogus conclusion.", "\"Donald Trump dead from a fatal heart attack!\" screamed a Dec. 19, 2016, headline from a site called TheNewYorkEvening.com. The post came with a startling and real image of Trump sprawled out on the ground. The post and photo were flagged by Facebook users as part of the social media giant’s crackdown on fake news.", "Obviously Trump is not dead. Reading a newspaper, turning on a TV or radio or going anywhere else on the Internet will prove that.", "Bu where is that photo coming from? And is it real?", "It is. It comes from Trump's 2007 appearance at WrestleMania 23.", "Trump, who knows World Wrestling Entertainment kingpin Vince McMahon, had agreed to the Battle of the Billionaires. In that storyline, Trump and McMahon both chose a proxy wrestler to compete in the annual pay-per-view event, with the loser having his head shaved in front of the roaring crowd.", "This screen grab of an image on fake news sites implied that it was taken after Donald Trump's imaginary heart attack, but it's actually Trump suffering from a Stone Cold Stunner during Wrestlemania 23.", "At the match, Trump clotheslined McMahon prior to Trump’s wrestler winning the match. Trump then shaved McMahon’s head in the ring.", "Notably absent from many online clips is what happened next: Guest referee Steve Austin delivered a Stone Cold Stunner to Trump, leaving Trump writhing on the mat. That’s the image being used in the fake news still.", "Trump was involved with the WWE for several years after the match. One storyline in 2009 involved Trump buying the WWE’s Raw from McMahon, then selling it back to him for twice the price. Even though the sale was fake, it still caused WWE stock to drop 7 percent at one point.", "Trump was inducted into the WWE Hall of Fame in 2013. Three years later, the president-elect tapped McMahon’s wife Linda McMahon, who donated $6 million to a Trump super PAC, to head the Small Business Administration.", "TheNewYorkEvening.com seems to mix snippets of real stories, like a recent announcement that Ford Motor Company was abandonding plans to build a new plant in Mexico, with fake ones. The idea is likely to trick viewers.", "This claim rates Pants On Fire!", "TheNewYorkEvening.com, \"Donald Trump dead from a fatal heart attack!,\" Dec. 19, 2016", "FedsAlert.com, \"Donald Trump dead from a fatal heart attack!,\" Dec. 19, 2016", "Deadline Hollywood, \"WHAT A RAW DEAL! Investors And Media Get Punk'd By WWE & USA Network,\" June 18, 2009", "Rolling Stone, \"Donald Trump and WWE: How the Road to the White House Began at 'WrestleMania',\" Feb. 1, 2016", "Metro UK, \"Watching Donald Trump get a Stunner from Stone Cold Steve Austin will brighten up your day,\" Nov. 9, 2016", "CNN, \"Surprise Trump winner: The WWE,\" Nov. 15, 2016", "CNBC, \"Trump picks wrestling magnate Linda McMahon to lead Small Business Administration,\" Dec. 7, 2016", "Associated Press, \"Donald Trump Wins \"Hair Match\" At Wrestlemania Against Vince McMahon,\" accessed Jan. 4, 2017", "WWE, \"Bobby Lashley vs. Umaga - Battle of the Billionaires Match: WrestleMania 23,\" accessed Jan. 4, 2017", "WWE, Donald Trump WWE Hall of Fame profile, accessed Jan. 4, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]