["Recently, a video is being circulated on social media with the claim that the Congress let in Khalistan protesters at their event where the separatists chanted anti-India slogans. Several individual users have shared the clip, including Gaurav Pradhan who has often been found sharing misleading posts from his social media accounts. He circulated the clip where Khalistan supporters can be heard allegedly saying, “Congress Zindabad, Hindustan Murdabad”. Pradhan questions if Rahul Gandhi and Congress are “Pakistanis”.", "That Congress let Khalistan supporters chant anti-India slogans at Rahul Gandhi’s event in London is a piece of misinformation that resurfaces every few months. Alt News has debunked the fake news twice (1, 2) in the past when BJP office bearers also circulated it.", "Sikh separatists didn’t merely “arrive” at Rahul Gandhi’s event but gatecrashed it. The claims on social media misleadingly suggest that the Congress supported the protesters.", "According to Naomi Canton, who reports for Times of India in the UK, the event was interrupted by four protesters who had “managed to evade heavy security to enter Rahul Gandhi’s event…”.", "TOI speaks to the Khalistani intruders who gatecrashed Rahul’s event https://t.co/Eq44dogy6C", "— Naomi Canton (@naomi2009) August 27, 2018", "Speaking to TOI, Shamsher Singh, spokesperson for the National Sikh Youth Federation who had gatecrashed the event with three of his associates said, “We slipped in through a side door to the venue at 5.30pm as the security was lax. Once inside, security asked us a few questions but we confidently walked through and said we are here for the event. We got a table and sat down.”", "Furthermore, television news channels reported that slogans hailing the Congress party were chanted in response to the slogans raised by the Sikh separatists who had gatecrashed the event.", "The clip is viral on both Facebook and Twitter with similar claims.", "From what it seems, it is also being circulated on WhatsApp.", "Whatsapp fwd.. @ndtv plz story this n tell us if this is true or not?", "Khalistan terrorists arrive at Rahul Gandhi’s meeting in London …With the slogans…. Congress party Zindabad and Hindustan Muradabad. pic.twitter.com/Uas0k27OI6", "— Jb (@jayeshkbh) February 18, 2019", "The aftermath of the Pulwama attack has witnessed a surge in misinformation where non-BJP parties have been targeted (1, 2, 3, 4, 5) to show them as sympathizers of terrorism.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]