["Prime Minister Narendra Modi visited Tamil Nadu ahead of assembly elections set to be held in April. PM Modi also unveiled key projects in the state including the inauguration of Phase-1 extension of the Chennai Metro Rail and handing over Arjun Main Battle Tank to the army. But the Prime Minister’s visit sparked the Twitter hashtag #GoBackModi. Soon after, a photograph of ‘Go Back Modi’ painted on the road was also shared with the claim that the graffiti was displayed in Tamil Nadu.", "Tamilians not welcome modi send message #GoBackModi pic.twitter.com/qkUiSgYNbz", "— Manish Ranjan Rtd. IAS (@manishranjanIAS) February 13, 2021", "Several people shared the image.", "Normally the BJP IT Cell gets into a hashtag war with other parties. Today, the hashtag contest is actually between Tamizh & Malayali folks. Nobody can beat #GoBackModi trend on a Tamil (“vere level”) global scale. But Malayalis can hold their fort on #PoMoneModi . Game on folks! pic.twitter.com/3oWifBntP5", "— Suby #ReleaseSanjivBhatt‏‎‎ (@Subytweets) February 14, 2021", "The same image was shared in October 2020 during elections in Bihar.", "Bihar is on fire mode 🔥🔥🔥#GoBackModi pic.twitter.com/73xgVA7iUy", "— sujiprabhu (@Suji_prabhu) October 23, 2020", "Several Twitter users had shared the image.", "Bihar is on fire mode 🔥🔥🔥#GoBackModi pic.twitter.com/sNwBHza2eD", "— Suresh Tak Saini (@SureshTakSaini1) October 23, 2020", "It is also circulating on Facebook with the same caption.", "Kolkata-based journalist Mayukh Ranjan Ghosh replied to one of the viral tweets from October 2020, claiming that the image was shot in Kolkata, right in front of Metro Channel, Hare Street police station.", "He had first tweeted the image on January 11, 2020 during protests against the Citizenship Amendment Act (CAA) in Kolkata. PM Modi was on a two-day visit to the city in January when his arrival was met with protests.", "This is one of the busiest roads in Kolkata. #Esplanade. Lakhs and lakhs of people commute, jam packed traffic r seen. Just look at this place tonight. Roads turned into graffitis, no traffic, all roads blocked, students protesting overnight.", "This is #Kolkata #modiinkolkata pic.twitter.com/jDaf6vufXi", "— Mayukh Ranjan Ghosh (@mayukhrghosh) January 11, 2020", "Photographs of the Metro Channel Control Post, Hare Street Police Station are also available on Google Maps.", "A photograph of the graffiti taken from a different angle was found in a report published by Scroll on January 12, 2020.", "A photo shot during PM Modi’s Kolkata visit in January amid anti-CAA protests has been falsely linked to upcoming Tamil Nadu polls. It was earlier shared ahead of Bihar elections.", "Donate Now", "Aqib is monitoring and researching mis/disinformation at Alt News", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]