["The National Republican Senatorial Committee recently aired an ad in the hotly contested Iowa Senate race between Democratic Rep. Bruce Braley and Republican state Sen. Joni Ernst. It features a woman named Darlene Blake of Des Moines, Iowa, talking about the importance of Medicare.", "\"Bruce Braley voted to cut $700 billion from Medicare to support Obamacare,\" Blake says. \"That’s just not fair. We paid in. We paid for it. That should be there for us.\"", "In a separate fact-check, we looked at the claim that Braley \"voted to cut $700 billion from Medicare to support Obamacare.\" Here, we’ll look at the claim that cuts to Medicare affect people who have already \"paid in. We paid for it.\"", "The ad has a point that Americans 65 and over have \"paid in\" to Medicare through the payroll taxes they’ve paid throughout their working lives. Currently, workers pay a 1.45 percent payroll tax for Medicare, while employers kick in an additional 1.45 percent. Self-employed people pay both parts of the tax. Meanwhile, starting in 2013, households earning $125,000 (or $200,000 or $250,000, depending on the number of people in the household and their tax-filing status) pay an additional 0.9 percent Medicare tax.", "However, it’s not as if those payroll taxes are placed in an account for that beneficiary’s future use alone. Instead, the proceeds of payroll taxes paid by workers of all ages (combined with the proceeds of current beneficiaries’ Medicare premiums) foot the bill for the Medicare costs of today’s beneficiaries.", "And the way the math has worked out over the years, today’s beneficiaries have gotten far more back in Medicare spending than they put into the system through their tax payments. We discussed this topic in 2013, using statistics from the Urban Institute, a nonpartisan research institute in Washington. We’ll recap their findings here, updated with the most recent data.", "Institute researchers figured out what people turning 65 in various years have already \"paid in\" to the system and what they can expect to \"take out\" after they reach age 65. Because marital status and family income can significantly affect both the amount paid in and the amount paid out, the institute offers calculations for various types of family units.", "To make the final amounts comparable to what might have been done with the tax money had it been invested privately, the institute adjusted all dollar figures at 2 percentage points above the rate of inflation. (The authors note that different assumptions for long-term returns on investment would change the results.)", "We looked at the statistics for three \"cohorts\" of seniors -- those who turned 65 in 2000, 2005 and 2010. That means they’re 79, 74 and 69 years old today.", "We found that, for Medicare recipients, the \"worst\" deal for any of these demographic groups is still quite generous. A two-earner couple, with one high earner and one average earner, who both turned 65 in 2010 would have paid $158,000 in Medicare taxes over their lifetimes, but can be expected to be the recipient of $385,000 in Medicare spending. That’s a ratio of $2.40 in benefits for every dollar paid in taxes -- and that’s the least generous ratio we found.", "The highest such ratio we found was for one-earner couples in which the earner turned 65 in 2000 and was paid the average wage. Such a couple would have paid $39,000 in Medicare taxes but can expect to benefit from $306,000 -- a ratio of $7.80 in Medicare spending for every dollar the couple paid in taxes.", "So the ad’s claim -- that cutting Medicare is \"just not fair. We paid in. We paid for it\" -- is greatly exaggerated. For today’s typical Medicare beneficiary, what they paid into the system represents just 13 percent to 41 percent of what they can expect to get out of it. The rest is funded by younger Americans’ payroll taxes.", "The fact that taxes paid by active workers are supporting today’s generation of retirees is a big reason why some policymakers are concerned about the program’s long-term solvency. In 1950, the average American lived for 68 years and retirees were supported by 16 active workers. Now, the average life expectancy is 78 and just three workers support every retiree.", "By the time today’s middle-aged workers reach retirement age, only two workers will be around to support their benefits. Promised benefits will exceed revenues by about 30 percent, and there will be no money in the trust fund to rely on.", "\"The problem with the quote from the ad is that it is numberless,\" said C. Eugene Steuerle, who helped assemble the Urban Institute’s calculations. \" ‘We paid for it’ doesn’t say what we ‘paid’ nor what ‘it’ is, since the program expands constantly over time.\"", "Steuerle added, \"We paid for our parents’ Medicare. There’s very little money sitting in the trust funds. The issue is what we think we should expect from our children, which requires consideration of the cost and the benefits.\"", "Our ruling", "The ad says that cuts to Medicare affect people who have already \"paid in. We paid for it.\"", "While Americans have indeed \"paid in\" to Medicare, the amount that today’s beneficiaries have paid in only covers a fraction of their expected costs. The taxes paid by today’s typical beneficiaries will cover just 13 percent to 41 percent of what those beneficiaries can expect to get from Medicare during their lifetime. The rest of what has been \"paid in\" for their care has come from younger Americans.", "The statement contains some element of truth but ignores critical facts that would give a different impression, so we rate it Mostly False.", "National Republican Senatorial Committee, \"Darlene\" (ad), Sept. 4, 2014", "Urban Institute, \"Social Security and Medicare Taxes and Benefits over a Lifetime, 2013 Update,\" November 2013", "Urban Institute-Brookings Institution Tax Policy Center, payroll tax calculator, accessed Sept. 9, 2013", "PolitiFact, \"Medicare and Social Security: What you paid compared with what you get,\" Feb. 1, 2013", "Email interview with C. Eugene Steuerle, fellow at the Urban Institute, Sept. 9, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]