["A three year-old YouTube video resurfaced on July 25, when the Facebook page “Justin Trudeau Not” posted it alongside the caption: “Trudeau directs 2 billion from Canada Pension Fund to Mumbai.”", "The video was also shared thousands of times via this 2016 article from the Cultural Action Party of Canada. According to data from CrowdTangle, that article was reposted in multiple Canadian Facebook groups in July 2019.", "In the video, a man donning a t-shirt supporting a Conservative member of parliament claims that Trudeau took $2 billion from Canadian citizens’ retirement savings in order to fund housing projects in the Indian city of Mumbai.", "Based on the comments, several Facebook users understood that the Canadian prime minister stole the money from the pension fund in order to give it to India as a form of grant, as comments such as “he should go to jail until he pays it all back,” suggest.", "The claims made in the video are based on a 2016 Reuters article published on the CBC website citing a statement from the chief minister of Mumbai’s state of Maharashtra, Devendra Fadnavis. Fadnavis told reporters, “A week back, the Canadian ambassador … informed me that the Canadian pension fund is ready to invest $2 billion in Mumbai for affordable housing.”", "“Everything about that is totally not true,” Darryl Konenbelt, director of media relations for the CPPIB, told AFP. “That alleged $2 billion in housing is not true.”", "AFP contacted the High Commission of Canada in India to verify if High Commissioner Nadir Patal has spoken with Fandavis, but it had not answered by the time of publication.", "The CPPIB is an independent institution in charge of investing funds from the Canada Pension Plan (CPP), Canada’s federal retirement scheme. The CPPIB manages the retirement savings of 20 million contributors, nearly all working individuals in Canada, outside Quebec, which has its own pension plan.", "CPPIB began to invest in India in 2009. In April 2019, Alain Carrier, CPPIB head of international, said in an interview that the investment board had invested Can$8.2 billion in the subcontinent, representing about 2 percent of the fund’s global exposure. India is one of 52 countries in which the CPP funds are invested, far behind the United States, the main recipient with Can$131.2 billion. The fund also invests Can$60.9 billion in Canada.", "Since the CPPIB manages public funds, most holdings and investments can be consulted online here. The Real Estate portfolio shows only two companies in India: Indospace Industrial and Phoenix Mills Limited. The former creates industrial and warehouse parks throughout India, while the latter builds “retail-led mixed-use” properties in Mumbai, Pune, Bangalore and Chennai, according to their respective websites.", "CPPIB staff did not wish to provide AFP with any further statements on the subject of the board’s investments in India.", "The claim that Trudeau influenced CPPIB investment decisions is false. Although the CPP is the country’s public pension, the Canada Pension Plan Investment Board Act guarantees CPPIB’s autonomy from the government.", "CPPIB’s twelve board directors are approved by the minister of finance. However, “politicians have absolutely no influence on CPPIB’s investment decisions,” Keith Ambachtsheer, director emeritus of the International Centre for Pension Management told AFP in an email. “If any CPPIB board member is contacted by a politician on any investment matter, the Board member MUST report the encounter immediately,” he added.", "The CPPIB’s web page also states that, “the assets of the fund are managed in the best interest of the Canadian contributors and beneficiaries who participate in the Canada Pension Plan. These assets are strictly segregated from government funds.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]