["About this rating", "On 29 January 2016, Facebook announced changes to their Community Standard Regulated Goods Policy, banning the use of the social media network by unlicensed individuals to sell firearms.", "This is not the first time Facebook has explicitly banned sales of a particular item. The regulated goods policy, which can be read here, previously prohibited the unlicensed sale, purchase, or trade of prescription drugs, illegal drugs, and marijuana via Facebook.", "According to the The New York Times, the move comes as the social networking site moves closer to a proprietary e-commerce model:", "In December, the company introduced a project that directs users to local businesses and services that are well-reviewed on Facebook. Facebook can also store users’ credit card information. And in recent months, Facebook made it possible to send peer-to-peer payments through Messenger.", "Facebook’s progression toward on-site payments underscored the need to update the company’s content policy, a Facebook spokeswoman said.", "Monika Bickert, Facebook's Head of Product Policy, added in a statement that the change was made because more and more users were turning to Facebook to facilitate the sale of goods (including firearms):", "Over the last two years, more and more people have been using Facebook to discover products and to buy and sell things to one another. We are continuing to develop, test, and launch new products to make this experience even better for people and are updating our regulated goods policies to reflect this evolution.", "Shortly after Facebook announced their policy change, a rumor began circulating that the company was banning all pro-gun rights groups from using their social media network. This is not the case: the new policy change only applies to private gun sales, which are often transacted without background checks. Firearms enthusiasts and licensed gun dealers can still post about firearms (and firearms sales) on Facebook.", "Advocacy groups Everytown for Gun Safety and Moms Demand Action for Gun Sense in America told NBC News they were pleased with the move.", "\"We're gratified that our continuous conversation with Facebook over the course of the last two years has culminated in the company prohibiting all unlicensed gun sales arranged on its platforms,\" said John Feinblatt, the president of Everytown for Gun Safety.", "\"Our undercover investigations have shown that criminals are active in the online market for guns, where unlicensed sellers can offer guns with no federal background check required.\"", "Facebook's ban on unlicensed peer-to-peer gun sales also applies to Instagram.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]