["The video was shared here on Facebook on February 9, 2020. It has been viewed more than 1700 times.", "The 58-second long video shows a person sitting on a platform under a helicopter, freeing a bird trapped on a power line.", "Below is a screenshot of the misleading Facebook post:", "The post's Hindi-language caption translates to English as: “The Jain community in Surat arranged a helicopter to rescue a bird stuck on a power line. Live and let the others live. Lord Mahavira.\"", "Jain refers to the religious community adherent to Jainism, and Lord Mahavira is a “teacher”, widely regarded as one who shaped the current organisation of the religion.", "Surat is a coastal city in the western Indian state of Gujarat.", "The same video was also shared here, here, here and here on Facebook and here, here, here and here on Twitter and here on YouTube alongside a similar claim.", "The claim is false; the video has circulated in media reports since at least 2013 about a bird rescue operation carried out by a utility company in US state of Virginia in 2013.", "AFP extracted a keyframe from the clip using the video verification tool InVID and found this one-minute 45-second video published on the YouTube channel of local TV channel WAVY TV 10 on September 19, 2013.", "Below is a screenshot of the WAVY TV video:", "Below is a screenshot comparison of the video in the misleading Facebook post (L) and the WAVY TV 10 video (R):", "WAVY TV 10 also published a video report on the rescue on its YouTube channel here on September 18, 2013.", "The report states the bird was left tangled in the power line for more than 24 hours after strong winds caused delays to rescue attempts by local utility company Dominion Energy.", "Bonita Harris, a spokesperson for Dominion Energy, can be heard saying: “What we have to do is send a helicopter with special equipment. It actually has a platform attached to its side and one of our lineman will have to get on the platform and physically reach over to remove the bird from the line.”", "The rescue was also reported by UK newspaper The Daily Telegraph here with the same video.", "A longer version of the video has also circulated on social media in Pakistan in January 2020, alongside a claim that it shows a member of the Pakistani Army rescuing a bird from a power line. AFP debunked the false claim here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]