["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A deer peers through the woods from near a tree on Nov. 26, 2018. (AP/Keith Srakocic)", "In a tweet that preceded West Virginia’s buck firearm season, West Virginia Gov. Jim Justice encouraged West Virginians to purchase a hunting license. In the tweet, he offered an economic rationale -- that hunting is an economic engine for the state.", "In the Nov. 5 tweet, Justice wrote, \"I've said it before and I'll say it again, hunting is really something that can help our economy grow! Hunters contribute more than $500 million to our state each year and help support a lot of jobs. Get a license today at http://wvhunt.com . #WV #WVHunt.\"", "I've said it before and I'll say it again, hunting is really something that can help our economy grow! Hunters contribute more than $500 million to our state each year and help support a lot of jobs. Get a license today at https://t.co/burilhQECG. #WV #WVHunt pic.twitter.com/btBNdz4TR6", "State offices have thrown around the figure more than once. The West Virginia Division of Natural Resources sent a tweet on Nov. 24 that used the same dollar figure, adding that deer hunters in particular \"spend an estimated $230 million in West Virginia, much of it in the rural areas of the state.\"", "We wondered: Do bucks, and other game, really bring the state 500 million bucks?", "When we contacted Justice’s office, Jordan Damron, the governor’s assistant legal counsel and digital director, cited it to the West Virginia Division of Natural Resources. A Nov. 14 press release from the division includes the $500 million figure and said that \"hunting is estimated to be responsible for 5,400 jobs and $35 million in sales taxes on goods and services spent in West Virginia.\"", "The news release said the numbers came from Southwick Associates, a research firm focusing on outdoor markets.", "The Southwick Associates report said that there had been $421,819,113 in retail sales in West Virginia, with a \"multiplier effect\" raising that amount to $552,085,233. The multiplier was used  to estimate \"the total amount of spending that occurs in the economy as a result of hunters’ spending.\"", "The report also said that 5,377 jobs were created through hunting and $35,544,522 in state and local taxes were gathered due to hunting. The amount spent on deer hunting alone was $291,972,745.", "So the numbers cited by Justice exist. But we’ll offer a few caveats.", "First, the report is from 2012 and the data is from 2011. Though Justice offered a specific-sounding figure, the actual figure might have grown or shrunk in the subsequent seven-plus years.", "Second, multiplier effects are estimates and are highly dependent on the assumptions used. Different assumptions will lead to different results. Using the retail sales figure without the multiplier adjustment might have been a more defensible approach.", "Finally, the report says it \"was funded by the National Shooting Sports Foundation (NSSF) and produced in partnership with the Association of Fish and Wildlife Agencies.\" The association represents government officials who oversee hunting, but the National Shooting Sports Foundation bills itself as the \"firearms industry trade association.\" This means that the NSSF is an advocacy group that has a vested interest in promoting hunting. As with any advocacy group, its data should be understood in this context.", "Justice said that \"hunters contribute more than $500 million\" to West Virginia.", "This statistic comes from a comprehensive, 50-state report, but it’s worth noting that the data is more than seven years old, that it uses an estimate of economic impact beyond just retail sales, and that the report was funded by an industry trade group.", "We rate the statement Mostly True.", "Jim Justice, tweet, Nov. 5, 2018", "West Virginia Division of Natural Resources, tweet, Nov. 24, 2018", "West Virginia Division of Natural Resources, Regulation Summary 2018-2019,", "West Virginia Division of Natural Resources, press release, Nov. 14, 2018", "Charleston Gazette-Mail, \"Bucks from bucks: WV hunters create half-billion-dollar impact on state's economy,\" Oct. 25, 2018", "Southwick Associates, \"Hunting in America,\" 2012", "National Shooting Sports Foundation, website, accessed Dec. 7, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]