["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Denzel Washington accepts the award for outstanding actor in a motion picture for \"Fences\" at the 48th annual NAACP Image Awards at the Pasadena Civic Auditorium on Saturday, Feb. 11, 2017, in Pasadena, Calif. (AP)", "A story on Facebook quotes actor Denzel Washington praising President Donald Trump and saying the United States dodged a bullet when Hillary Clinton lost, but the quotes are made up.", "\"Denzel Washington: With Trump we avoided war with Russia and Orwellian police state,\" said a Feb. 24 headline on USA Liberty Press, a conservative website. The same claim appeared on Your News Wire, a frequent purveyor of fake news, Feb. 3.", "Facebook users flagged the post as being potentially fabricated, as part of the social network’s efforts to combat online hoaxes. We found no evidence that Washington made these statements.", "The USA Liberty Press article included this alleged quote by Washington: \"I grew up a Democrat. I get it. I know a lot of people who hate Trump with a real passion. But you’ve got to understand that we dodged a bullet when Clinton lost. More than one bullet. We avoided the creation of an Orwellian Police State.\"", "We searched for that quote in Google and Nexis and found no evidence that Washington made that statement.", "The article doesn’t include any alleged quotes by Washington saying Trump avoided war with Russia.", "USA Liberty Press also repeated a fake quote by Washington praising Trump: \"We need more and more jobs. Unemployment is way up here. He’s hired more employees, more people, than anyone I know in the world.\"", "In November 2016, we fact-checked the claim that Washington said that and found that the story plucked a quote from a March 5 New York Post article where Charles Evers, the brother of late civil rights activist Medgar Evers, discussed his endorsement of Trump. Articles circulating on the Internet have falsely attributed the quote to Washington. We rated that statement Pants on Fire.", "About a month later, when speaking before a screening of his new film Fences in Washington, D.C., in December 2016, Washington was asked whom he supported in the election. He quipped \"Fences\" but later said, \"none of your business.\"", "A headline said that Denzel Washington said, \"With Trump we avoided war with Russia and Orwellian police state.\" There is no evidence that the actor made that statement. We rate this headline Pants on Fire.", "USA Liberty Press, \"Denzel Washington: With Trump we avoided war with Russia and Orwellian Police State,\" Feb. 24, 2018", "Your News Wire, \"Denzel Washington: Trump’s Election Saved Us From ‘Orwellian Police State,’\" Feb. 3, 2018", "BBC, Denzel Washington on fake news and information overload, Feb. 9, 2018", "Denzel Washington, \"None of your business\" interview clip, Dec. 12, 2016", "Denzel Washington, On Trump and Fake News, Dec. 13, 2016", "Snopes, \"Did Denzel Washington Say Trump’s Election Saved Us From an ‘Orwellian Police State’?\" Feb. 5, 2018", "PolitiFact, \"Fake story says Denzel Washington supports Donald Trump,\" Nov. 16, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]