["On November 7, Facebook user “Engr Solomon” posted a picture with the message: “This great Igala Hunter killed the lion yesterday (6th December, 2018) at Ogbonicha.” Ogbonicha is a town in Kogi State. The post has been shared more than 13,500 times.", "Other posts on Facebook and Twitter have also repeated the claims.", "The earliest use of the image found by AFP was from a Twitter user based in Angola, @Paidalindahotm1. On March 11, 2018 he posted the image to Twitter, with the message in Portuguese reading: “Leão angolano foi morto.” (Angolan lion is dead.)", "The post was a reply to an earlier tweet which appeared to be a picture of himself. The two photos appear to show the same man, suggesting he was the person who killed the lion.", "AFP reached out to the twitter account but received no reply.", "This same image was also shared on social media in August in a Facebook group with 12,000 followers called SansTabou-Guinea. In that post it was claimed it came from Guinea.", "According to research experts on conservation in West Africa, only two areas in Nigeria are home to lions: Kainji Lake National Park, in the northwest, where some 30 big cats were thought to be living, and Yankari Game Reserve in Bauchi state, northeast Nigeria, where researchers believe there are less than five lions.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]