["About this rating", "In the summer of 2020, a rumor was circulated on social media claiming that Victoria's Secret was secretly placing tracking devices in their bras in order to track customers.", "One iteration of this claim shared on TikTok racked up nearly 3 million hearts. Another version (shown below) was shared on Facebook in June along with the claim that the creator of Victoria's Secret bought \"people's souls\" and that the store was hiding tracking chips in their bras and lingerie to track their customers and target them for sex trafficking:", "so the person who created and runs victoria secret buys people’s souls and he has something to do with the sex trafficking going on. did you know that if you cut your tag in half, there is a chip/tracker on the inside. if you don’t want to cut your tag to see, just put it up to the light. shocked (also tell me why the trackers are ONLY in bras and lingerie?? not shirts, sweatpants, ONLY lingerie)", "These claims were all false.", "Victoria's Secret does use radio-frequency identification (RFID) chips in some of its products, but this practice isn't particularly unusual or nefarious. RFID chips are used to track inventory in a store. They can also be used for theft prevention, as they can set off an alarm if stolen merchandise passes through a scanner at a store exit. But these chips are not used to track customers or products once they leave the store.", "A spokesperson for Victoria's Secret told Reuters: \"Like many other retailers, this technology helps us deliver a great store experience by ensuring we have the right products available for our customers. We only use this technology in our back room and sales floors to help us manage inventory so that our associates can efficiently support our customers’ needs.\"", "But Justin Patton, director of a RFID lab at Auburn University, told The Associated Press that Victoria's Secret was using a \"passive UHF RFID tag.\" These tags only have a range of a few meters. Furthermore, these tags don't have any sort of battery in them, meaning they are only of use within range of a scanner.", "Patton said: “That is a passive UHF RFID tag. They are commonly used in retail for counting inventory. However, most UHF tags have no use after purchase, and can be removed after purchase.”", "Major retailers such as Walmart, Macy's, and Target have been using similar tags for years. Keri Jones, Target's executive vice president of global supply chain and operations, explained how the store would used RFID tags in a 2015 blog post:", "In fact, developing the kinds of behind-the-scenes technologies that quietly help Target stay ahead of guests’ changing behaviors can be the most exciting. Technologies like Radio Frequency Identification (RFID)—which I’m thrilled to announce Target will roll out later this year.", "We’re now working with key vendors on a fast-tracked timeline to begin inserting a “smart label” on price tags that will help Target improve our inventory accuracy and enhance our ability to keep stores in stock.", "You probably wouldn’t notice these new RFID tags on your own, necessarily, but that’s the point. This unobtrusive but significant technology will increase efficiencies by providing greater visibility into our inventory. That means guests will better be able to find out whether we’ve got the item at their Target store or at others nearby. We also expect RFID to help us better fulfill online orders placed for store pickup, which already account for 15 percent of Target.com purchases.", "Victoria's Secret is not secretly hiding microchips or tracking devices in bras in order to track customers as part of a sex trafficking scheme. These RFID tags are commonly used in the retail industry in order to prevent theft and manage inventory.", "Swenson, Ali.   \"Tags in Victoria’s Secret Bras Are for Inventory, Not Consumer Tracking.\"\r\n    The Associated Press.   29 June 2020.", "Moore, Lauren.   \"Walmart and RFID: The Relationship That Put RFID on the Map.\"\r\n    Atlas RFID Store.   3 December 2019.", "Jones, Keri.   \"RFID: New Tag Technology Will Elevate Target’s Guest Experience.\"\r\n    Target.com.   19 May 2015.", "Reuters.   \"Fact Check: Victoria’s Secret RFID Tags Not Used To Track People.\"\r\n    10 July 2020.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]