["House Speaker Nancy Pelosi recently claimed President Donald Trump isn’t serious about building his promised Southern border wall and that his comments on the topic \"are really an applause line at a rally.\"", "\"The President hasn’t built any new wall in the whole term of office,\" Pelosi added, speaking on \"Face the Nation\" this week.", "Trump’s intentions are difficult to judge, but we can examine his progress, or lack thereof, on the border project.", "Was Pelosi right that no \"new wall\" has been built?", "Our research", "We started by reviewing last week’s White House briefing by acting U.S. Customs and Border Protection Commissioner Mark Morgan. Asked by a reporter about the project, Morgan confirmed that all 78 miles of what he described as \"new\" border wall built so far are replacements for existing barriers. The work includes building steel bollard fencing, which consists of vertical steel posts with a small amount of space between them.", "It is not, however, the solid concrete wall that Trump promised during his campaign and said Mexico would pay for.", "\"The Trump Administration has not completed any new miles of border wall. Replacement wall is not new wall,\" Pelosi’s spokesman Drew Hammill told us in an email.", "Hammill added that the House Appropriations Committee hasn’t funded any new border wall, at least not of the type Trump had promised.", "That is supported by The Washington Post’s September analysis of the project’s funding. \"Trump asked Congress in 2018 for $25 billion to cover the cost, but Congress refused. Lawmakers appropriated $1.57 billion, restricted to \"fencing,\" such as \"currently deployed steel bollard designs,\" the Post reported.", "As PolitiFact National reported back in January, \"Congress has not appropriated money for a wall. Fencing is being built or has been completed at the southwest border. But not a wall.\"", "President Donald Trump reviews border wall prototypes, Tuesday, March 13, 2018, in San Diego. Evan Vucci / AP Photo", "First truly new section", "Pelosi’s statement ignores one key new stretch:", "Construction started in late October on the first new section where no structures stood previously, just south of Donna, Texas, according to a recent New York Times article.", "This eight-mile stretch will take months to complete. So far, it includes two twin see-through panels of 18-foot-tall steel beams, according to the Times.", "A matter of semantics", "Theresa Cardinal Brown, director of immigration and cross-border policy at the Bipartisan Policy Center, said much of the debate over Trump’s progress and whether he’s built any \"new wall\" comes down to semantics.", "\"It depends on your definition of 'new,' Cardinal Brown wrote in an email. \"If 'new' is defined as newly-built, even if it is replacing other barriers in the same location, then you can accurately say new wall has been built. If 'new' is defined as built in new locations along the border where previous barriers did not exist, then it would be correct to say that there hasn’t been any new wall built. It is that semantic difference that the government and Democrats are exploiting in their rhetoric.\"", "Our rating", "House Speaker Nancy Pelosi recently claimed President Trump \"hasn’t built any new wall\" during his time in office.", "That’s supported, in part, by the Trump administration’s Customs and Border Protection acting commissioner. He confirmed at a press briefing last week that all 78 miles of what he described as \"new\" border wall built so far are replacements for existing barriers.", "These replacement barriers, however, aren’t the solid, concrete wall candidate Trump talked about. They are see-through bollard fencing.", "Pelosi’s statement does leave out one piece of key information. Construction is now underway on the first original stretch of border barriers during Trump’s presidency, an eight-mile section of fencing in the Rio Grande Valley in Texas.", "Pelosi’s statement is accurate but needs clarification or additional information.", "We rate it Mostly True.", "MOSTLY TRUE – The statement is accurate but needs clarification or additional information.", "Click here for more on the six PolitiFact ratings and how we select facts to check.", "Speaker Nancy Pelosi, \"Face the Nation,\" Nov. 17, 2019", "Drew Hammill, spokesman for Speaker Pelosi, email exchange Nov. 21, 2019", "Theresa Cardinal Brown, director of immigration and cross-border policy, Bipartisan Policy Center, email exchange Nov. 22, 2019", "Cristobal Ramon, senior policy analyst, Bipartisan Policy Center, email exchange Nov. 22, 2019", "The New York Times, Under Construction in Texas: The First New Section of Border Wall, Nov. 8, 2019", "Real Clear Politics, Trump Admin Confirms All 78 Miles Of \"New\" Border Wall Built So Far Are Replacements For Existing Barriers, Nov. 14, 2019", "The Washington Post, More than two years later, Trump’s wall remains unbuilt, Sept. 6, 2019", "PolitiFact National, Donald Trump stalls on promise to build a wall, have Mexico pay for it, Jan. 14, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]