["Facebook message claims that universities are no longer accepting current matric students due to leak of exam papers, we checked the claims.", "A widely viewed post on social media alleged that due to examination leaks, South African final year-students would have to rewrite their papers.", "But the department of basic education told Africa Check there are no plans to force the entire matric 2020 class to retake all their exams.", "Universities also confirmed they have not rescinded any offers to 2020 matrics.", "“I was watching CNN news today and they said that the matric class of 2020 will rewrite all their exams in January due to the Leaking of papers disorder,” begins a message posted on Facebook on 25 November 2020.", "The message claims that the basic education department found that all matriculants – final-year high school students – will have to rewrite their school-leaving exams in January, after several papers were leaked.", "“Maths papers where leaked, Physics papers where leaked, Business studies papers where leaked, English papers where also leaked,”  the message claims.", "“This is above the department of Education capacity.”", "The message also says that universities are no longer accepting current matric students, because of the leaks. It adds that Wits University, the University of Johannesburg and University of Pretoria have changed the application status for current matriculants from “firm offer” to “not considered”.", "“That's the reason to why Everything is slow and to why...other Varsities not issuing Acceptance letters,” the message says.", "It’s been viewed more than 111,300 times since it was published.", "Some matric exams – for maths, physical science and life sciences – were leaked days apart in late November. The maths paper was leaked in eight out of nine of South Africa’s provinces just hours before the exam was written. So far, one person has been arrested in connection with the leaked maths paper.", "Did the basic education department announce that all 2020 matric exams must be rewritten in January? And have universities stopped accepting current matric students because of the leaks? We checked.", "The post attributes the claim to a report by CNN, the US TV news network. We could find no evidence that such a report exists.", "Africa Check asked the department of basic education about the Facebook post. Spokesperson Elijah Mhlanga said it was “fake news”.", "He added that when the papers were leaked, investigations were conducted and determinations made on a case-by-case basis.", "“In a case of a large-scale situation where a leak has taken place and a lot of people have received it, two things become important,” Mhlanga said.", "“One is to check the source of the leak. Two is to establish the extent of the spread of the paper. Thereafter you make a decision whether you are going to localise the rewriting or you are going to withhold the results of those people there or you are going to say those affected individuals must rewrite again.”", "There are no plans to force the entire matric 2020 class to rewrite all their exams.", "But have the leaks led to universities no longer accepting current matriculants for their 2021 intake and rescinding offers from candidates they have already accepted?", "Africa Check asked Wits University, the University of Pretoria and University of Johannesburg about the message. All three confirmed that the claims were false.", "Wits University head of communications Shirona Patel told Africa Check that it was “absolutely not true” that Wits had rescinded offers for 2020 matrics.", "“Final offers only go out once their final matric results are received,” Patel said.", "Thembi Tlale, deputy director of marketing and communications at the University of Pretoria, told us that matric students were given “conditional offers” before exams were written, and not final offers.", "“We make conditional offers based on grade 11 results for undergraduate studies. So no offer was rescinded based on the leaked NSC exam papers,” Tlale said.", "Current matriculants will not be forced to rewrite all exams in January 2021, as a result of the leak of several exam papers. The leaks have also not caused universities to rescind offers, or stop considering applications.", "Conditional offers based on grade 11 results and firm offers are only given once matric results are released.", "Please complete this form to receive the HTML sharing code.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "For democracy to function, public figures need to be held to account for what they say. The claims they make need to be checked, openly and impartially. Africa Check is an independent, non-partisan organisation which assesses claims made in the public arena using journalistic skills and evidence drawn from the latest online tools, readers, public sources and experts, sorting fact from fiction and publishing the results.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "© 2023 - Africa Check - All rights reserved.", "We will never charge you for verified, reliable information. Help us keep it that way by supporting our work.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "Support independent fact-checking in Africa."]