["The rumor, posted by a user in Revere, Massachusetts and shared more than 8,000 times, says the apparent gift is a new tactic deployed by traffickers. According to the false post, the $100 bill is typically attached to the handle of a parked car door using a red ribbon. Anyone who touches the currency would be incapacitated, leaving them vulnerable to abduction.", "The Facebook posts mention that the information “is shared from a friend,” or a relative of a friend, but AFP found no instances of anyone telling the story from a personal point of view.", "The text specifies that the money trap is used at the Northgate Mall, a common name for shopping centers in North America, and the name of the apparent crime scene in Revere.", "The post has been shared by users in East Lynn and Rehoboth, both in Massachusetts, and in Cincinnati, Ohio, as well as Burnaby, Edmonton and Winnipeg, in Canada.", "But there is no evidence that such abduction tactics are being used in any of those areas.", "“This is not true,” Captain Amy O’Hara, a spokeswoman for the Revere Police Department, told AFP of the rumor.", "Canadian officials also dismissed the claims.", "The National Center for Missing and Exploited Children said that it provided assistance in the cases of 29,000 children reported missing in the US in 2019. Less than one percent were abducted by non-family members, while four percent were taken by relatives. The vast majority -- 91 percent -- were classed as endangered runaways.", "AFP Fact Check has debunked similar claims in Canada, as well as false reports of thwarted abductions at the country's Wonderland theme park, and of a child’s abduction at an Ontario mall.", "The US National Human Trafficking Hotline outlines possible indicators of a true trafficking victim here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]