["Florida Gov. Ron DeSantis puts on his mask as he leaves a news conference at Jackson Memorial Hospital, Monday, July 13, 2020, in Miami. (AP Images)", "• An anonymous official told the Miami Herald that the Biden administration was considering domestic travel restrictions on states where the UK COVID-19 variant is surging, including Florida. However, it’s unclear so far what particular domestic travel regulations the administration is weighing and how they would be implemented.", "• No one has suggested closing Florida’s border. It’s not clear if a president has the authority to shut down a state border.", "• DeSantis previously placed travel restrictions on people flying to Florida from New York. ​", "Florida Gov. Ron DeSantis sent out a fundraising plea attacking the Biden administration for considering domestic travel restrictions in an effort to curb the spread of a highly contagious COVID-19 variant.", "President Joe Biden \"is trying to shut FL’s border,\" DeSantis texted potential donors. In an accompanying email, DeSantis said: \"Joe Biden is considering treating Florida like East Berlin and shutting down our border over ‘coronavirus concerns.’\"", "Is that so?", "We found no indication of anything so dramatic.", "We reached out to DeSantis’s office and asked where they had gotten the information that the Biden administration was planning to shut down the Florida border. Cody McCloud, a DeSantis spokesperson, did not answer our questions directly and instead referred us to a Twitter video posted to the governor’s account. What he says in the video is far less sweeping than what he claimed in the fundraising email.", "DeSantis’ fundraising message followed a front-page article in the Miami Herald on Feb. 10. The story quoted an anonymous government official saying that the Biden administration was considering new domestic travel restrictions for regions affected by the highly contagious U.K. strain of the coronavirus. Data from the Centers for Disease Control and Prevention show that Florida currently has a third of the nation’s cases of the U.K. COVID-19 variant.", "But according to the Herald, the White House has not said that it is considering a Florida travel ban.", "It’s unclear so far what particular domestic travel regulations the administration is weighing and how they would be implemented. The administration has not publicly discussed a border shutdown as an option.", "One possible restriction could be to require travelers to show negative COVID-19 test results before they take domestic flights.", "During a Feb. 7 interview, Transportation Secretary Pete Buttigieg said that the Biden administration was considering this idea. Such a requirement would not apply to Florida in particular, but to the U.S. more broadly.", "Desantis imposed travel restrictions on travelers from some states earlier in the pandemic. On March 23, 2020, he required travelers from coronavirus hot spots like New York, New Jersey, and Connecticut to self-quarantine for 14 days. Later that month, he ordered the Florida Highway Patrol to set up checkpoints on a highway connecting Florida and Louisiana.", "In public appearances, Biden spokespeople and federal officials have stressed that no policy announcements regarding travel restrictions are coming soon.", "\"We are always considering what steps are necessary to keep the American people safe, but we are not currently in the process of… No decisions have been made around additional public health measures that would delay or would change, I should say, domestic travel considerations,\" White House press secretary Jen Psaki said Feb. 11.", "The Miami Herald story quoted two anonymous federal officials who said that \"no policy announcements are imminent,\" and that \"any move to restrict travel or impose new health measures would be taken in partnership with state and local governments.\"", "It’s not clear that the president has the power to close a state border.", "The right of Americans to travel interstate in the United States has never been substantially judicially questioned or limited, according to Meryl Justin Chertoff, the executive director of the Georgetown Project on State and Local Government Policy and Law.", "\"The baseline ... is that freedom of movement within and between states is constitutionally protected,\" Chertoff wrote.", "Desantis said Biden is trying to close Florida’s border.", "A story in the Miami Herald quoted an anonymous source saying that the Biden administration was considering new domestic travel restrictions in response to COVID-19 spread. But there is no indication that banning travel to or from Florida is on the table.", "This claim is False. ​", "Jill Terreri Ramos contributed to this fact-check.", "Miami Herald, White House looks at domestic travel restrictions as COVID mutation surges in Florida, Feb. 10, 2021", "CDC, U.S. COVID-19 cases caused by variants, updated Feb. 11, 2021", "CNN, US considers Covid-19 testing requirement for domestic air travel, Feb. 9, 2021", "Orlando Sentinel, DeSantis removes quarantine of metro New York travelers coming to Florida, Aug. 6, 2020", "The Florida Times-Union, Coronavirus: Florida DOT sets up I-95 checkpoints at Florida-Georgia line, Mar. 29, 2020", "Rev, Press Secretary Jen Psaki White House press conference transcript, Feb. 11, 2021", "Georgetown Law, The right to travel and national quarantines: Coronavirus tests the limits", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]