["By Angelo Fichera", "Posted on May 4, 2018", "Q: Did the two black men arrested in a Philadelphia Starbucks “settle for $2 million” from the city?", "A: No. The city agreed to pay the men $1 each and establish a $200,000 grant program for young entrepreneurs. The men also received an undisclosed amount from Starbucks.", "The two men whose arrest in a Philadelphia Starbucks last month caused a national conversation about race reached an agreement with the city this week to not pursue legal action. In return, the men received $1 each and a pledge from the city to establish a $200,000 grant program for public high school students who want to become entrepreneurs.", "Separately, Rashon Nelson and Donte Robinson agreed to a financial settlement with the coffee-shop giant, the amount of which hasn’t been publicly disclosed.", "But one headline told a different story.", "“Black Men Arrested In Philadelphia Starbucks Settle For $2 Million,” declared the website of comedian Rickey Smiley’s morning radio show. The website regularly posts about current events and entertainment.", "Smiley’s verified Facebook page — dubbed his official fan page and followed by millions — shared a link to the May 2 story in a post that repeated the falsehood, saying the men would “get $1 million each from the city of Philadelphia, Pennsylvania.”", "Some Facebook users flagged the story as potentially false, and many commenters on Facebook pointed out that the headline was wrong. Still, as of May 4, neither the story nor the Facebook post had been corrected.", "Our calls to the morning show went unanswered, and an email inquiry from FactCheck.org did not receive a reply, either.", "For those who read beyond the headline, the body of the story, which cited an NBC News report, offered a more accurate version of events.", "Philadelphia spokesman Mike Dunn confirmed to FactCheck.org the terms of the widely reported settlement between the men and the city.", "“Nelson and Robinson have decided not to pursue a lawsuit against the City. Instead, they approached the City and agreed to release the City and its employees from any and all claims for a payment of $1 (One Dollar) to each of them,” Dunn wrote in an email. “They also asked the City – and the City has agreed — to fund a $200,000.00 (Two Hundred Thousand Dollar) grant to nonprofit for a pilot program for city public high school students with aspirations of becoming entrepreneurs, as envisioned by Mr. Robinson and Mr. Nelson, who will not receive any money from the grant.”", "The arrests were made after a store manager called police on the two 23-year-old men, who were waiting for a friend, because they hadn’t ordered anything and refused to leave. Video of the episode went viral, fueling public outrage.", "In the aftermath, Starbucks announced it would close all of its company-owned U.S. stores May 29 for racial-bias training.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk false stories flagged by readers on the social media network.", "Dunn, Mike. Spokesman, City of Philadelphia. Email sent to FactCheck.org. 3 May 2018.", "“Starbucks Reaches Agreement with Donte Robinson and Rashon Nelson.” Press release. Starbucks. 2 May 2018.", "“Starbucks to Close All Stores Nationwide for Racial-Bias Education on May 29.” Press release. Starbucks. 17 Apr 2018.", "Tornoe, Rob. “Arrest of two black men at Philadelphia Starbucks was ‘reprehensible,’ CEO Kevin Johnson says.” Philly.com. 16 Apr 2018.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]