["On September 26, Narcotics Control Bureau (NCB) interrogated actress Deepika Padukone over her alleged involvement in the drug probe linked to actor Sushant Singh Rajput’s death. In the backdrop of this, an image of Padukone wearing a t-shirt with the slogan ‘I stand with Indian farmers’ is circulating on social media. It is noteworthy that farmer groups have been protesting against the Modi government’s farm bills the last few months. Facebook user Rajiv Tyagi posted the image with the message, “When you report for questioning to the NCB, because you stood in solidarity with JNU…and carry swag on your T-shirt…”", "Twitter user Ranjit Kumar Birsa also posted the same image.", "किसानों को संदेश ! जमीन जल चुकी है आसमान बाकी है, सूखे कुएँ तुम्हारा इम्तहान बाकी है", "वो जो खेतों की मेढ़ों पर उदास बैठे हैं उनकी आखों में अब तक ईमान बाकी है", "बादलों बरस जाना समय पर इस बार, किसी का मकान गिरवी तो किसी का लगान बाकी है@deepikapadukone#I_stand_with_Indian_Farmers pic.twitter.com/3Ee2cK9bhe", "— Ranjit kumar Birsa Ambedkar (@RanjitAmbedkar) September 27, 2020", "Several others on Twitter and Facebook shared the image.", "With a reverse image search on Google, we found that this image was published in a report by The Indian Express published on March 20, 2018. In the original image, there is no text imprinted over Deepika’s t-shirt.", "The comparison below clearly shows that the slogan has been morphed into the original image.", "An edited image of Deepika Padukone was shared on social media with the false claim that the actress displayed her support for the country’s farmers protesting against Modi government’s farm bills.", "Donate Now", "Kinjal Parmar holds a Bachelor of Science in Microbiology. However, her keen interest in journalism, drove her to pursue journalism from the Indian Institute of Mass Communication. At Alt News since 2019, she focuses on authentication of information which includes visual verification, media misreports, examining mis/disinformation across social media. She is the lead video producer at Alt News and manages social media accounts for the organization.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]