["Shameless JNU pro naxals says to @CitiznMukherjee “never trust a Bengali” for rejecting “martyr Afzal Guru mercy petition”! And then says “You can never trust a Bengali”! @MamataOfficial must take legal actions for insulting Bengali people ! #UrbanNaxals tweeted Kailash Wagh, tweeted Kailash Wagh (@KailashWG), who is followed by Prime Minister Narendra Modi and Union Minister Dr Thawarchand Gehlot.", "Shameless JNU pro naxals says to @CitiznMukherjee “never trust a Bengali” for rejecting “martyr Afzal Guru mercy petition”! And then says “You can never trust a Bengali”! @MamataOfficial must take legal actions for insulting Bengali people ! #UrbanNaxals pic.twitter.com/OsFZkfyxbx", "— Kailash Wagh 🇮🇳 (@kailashwg) June 9, 2018", "Former President Pranab Mukherjee’s nod to the RSS to attend an event in Nagpur provided the perfect backdrop for fake news purveyors, ascribing a quote to Rashid that was patently fake.", "The screenshot of the alleged tweet attributed to Shehla reads “Now you know why Pranab @CitiznMukherjee rejected martyr Afzal Guru’s mercy petition? He was an RSS sympathiser from the start. You can never trust a Bengali. Shame on Congress and their double standards.” #PranabatRSS is the hashtag accompanying the tweet, along with an imprint of the Facebook page Unofficial Barkha Dutt, which has more than 16900 followers.", "#PranabAtRSS #ShehlaWithISIS", "Posted by Unofficial: Barkha Dutt on Thursday, 7 June 2018", "Alt News found the post from the page Unofficial Barkha Dutt to be one of the earliest on social media. Moreover, the stamp on the screenshot was invariably seen on each of the images shared on social media.", "Shehla Rashid has rubbished this quote ascribed to her, dismissing it as fake in a tweet.", "There’s a fake screenshot doing the rounds which shows that I’ve said “Bengalis cannot be trusted.” I haven’t tweeted anything to this effect ever.@SMHoaxSlayer @free_thinker Please take note. https://t.co/Y8RFkI5oMA", "— Shehla Rashid (@Shehla_Rashid) June 10, 2018", "Former JNU Students Union leader Kanhaiya Kumar, Umar Khalid and Shehla Rashid have been on the firing line of right wing Twitter handles. On numerous instances, the propagation of fake quotes on social media is unbeatable and clarifications may prove to be ineffectual.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]