["This post published on a Facebook page called “Ministry of finance, planning and economic development, Uganda” on May 29, 2020, claimed to be offering a grant to Ugandan entrepreneurs.", "“GOOD NEWS TO ALL UGANDAN ENTREPRENEURS. The Ministry has partnered with USAID, BACC and other International bodies in giving out GRANTS to all deserving citizens to boost your business during this time. I urge all to grab this chance,\" reads the post shared more than 200 times.", "It also provides a link to an application form, which requires applicants to provide personal details, such as name, phone number, email address and physical location, as well as the estimated cost of the business project they want to undertake.", "Virtually all Facebook users who commented on the post appeared to believe that the grant was genuine, with many thanking the government.", "Uganda’s ministry of finance issues warning", "Shortly after the Facebook post surfaced, the ministry of finance issued a warning on its Facebook page, confirming that the government was not offering such a grant.", "“Do not be conned during this #Covid-19 lockdown period by online fraudsters using this fake Facebook account below. The Ministry of Finance has not partnered with any organisation for purposes of offering grants to Ugandan entrepreneurs,” the post reads.", "The false page bears the same name --  ‘Ministry of finance, planning and economic development, Uganda’ -- as the official Facebook page of the ministry of finance.", "However, the ‘Page transparency’ section of the Facebook page reveals that it is managed from Kenya and was created on February 6, 2019, whereas the finance ministry’s genuine account is managed from Uganda and was created years earlier, on October 12, 2011.", "We can also find a link to the finance ministry’s genuine Facebook page on the homepage of its website.", "Last year, AFP Fact Check debunked similar posts from another imposter Facebook account going by the same name, also managed from Kenya.", "Economy and COVID-19 in Uganda", "Ugandan President Yoweri Museveni has called on local businesses to ramp up local production in the wake of a drop in importations due to the pandemic.", "In March, Museveni announced that his government was deliberating on setting up a fund with the Ugandan Development Bank (UDB), in partnership with the International Monetary Fund (IMF) and the World Bank, to accelerate industrialisation in the East African country.", "Additionally, Uganda’s central bank has announced credit relief measures in a bid to salvage the economy from the effects of COVID-19. The measures include extending loan repayment periods and reducing interest rates on loans.", "However, there is no announcement that the government is offering grants to business amid the global pandemic.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]