["About this rating", "Any U.S. citizen today above 80 years of age can get a birthday greeting card from a sitting U.S. president by making a request through the White House contact form, or through their senator or representative.", "This is not limited to individuals who are turning 100, but anyone above 80 years old. Someone turning 100 years old will not automatically get a greeting card from the president, but have to request it by contacting the White House, their local representative, or senator.", "Reaching centenarian status is something monumental to celebrate. So when readers asked if someone turning 100 years old would get a \"letter of congratulations from the sitting president,\" we looked into it. Turns out, it is entirely possible — if you contact the right people.", "From 2008 to January 2017, when Barack Obama was president, the White House website had its own form to “Request a Presidential Greeting,” which included birthday greetings “available for civilians celebrating their 100th birthday.” Such greetings were possible if the events occurred before the end of Obama’s tenure in January 2017, but one had to submit a specific request in advance.", "Today, the same link for a “presidential greetings request” redirected to a general page on how to contact the president, “How You Can Write or Call the White House.” It is also possible to submit a request for presidential greetings through your representative in Congress or senator. Such greetings are not just reserved for birthdays. They could be for anniversaries, births, weddings, Girl Scout or Eagle Scout awards, and more.", "The Donald Trump administration was receiving such requests as well. On Sen. Lindsey Graham’s website, the information page for presidential greetings states: “My office can assist South Carolinians in obtaining a greeting from the President. Residents of other states should contact their respective senators.” It also says, birthday greetings “will be sent only to individuals 80 years of age and above.” Graham’s office had also not updated their page at the time of writing this, stating that any presidential greetings for the birth of a baby can be fulfilled only if the baby was “born during the Donald J. Trump Administration.”", "A number of legislators also offer to receive greetings requests from their constituents, including Rep. Dwight Evans, Rep. Mark DeSaulnier, Sen. Tom Carper, Rep. Rosa DeLauro, Sen. Rick Scott (though his website redirects us to the White House contact page), Sen. John Cornyn, Rep. Scott DesJarlais, and more. Birthday requests are not limited to people who turn 100 years old, but for anyone above 80 years of age, and if one is a veteran, above 70 years of age.", "Like Graham, other legislators seem to have not updated their presidential greetings pages since the beginning of the Trump administration, including Rep. Jared Huffman, whose page still states, “As of January 2017, White House Presidential Greetings will be determined by the new Presidential administration. While the new Presidential administration establishes their Greetings Office, My Congressional Office will not be able to submit White House greeting requests. As the White House office goes through this transition, my office will retain all requests made and provide them to the new administration to consider once the White House Greetings Office reopens.”", "We have reached out to the White House to get more clarity on the current policy and will update this post when we receive more information. We also called a number of legislator's offices that confirmed they were accepting presidential greetings requests. Carper's office said they were taking presidential greetings requests over the phone. Cornyn's office directed us to their website form.", "During Obama's tenure, many reported receiving such presidential greetings, including a botched one where the White House wished a newborn baby a \"Happy 101st birthday!\"", "As such, we rate this claim as \"Mostly True.\"", "Nur Nasreen Ibrahim is a reporter with experience working in television, international news coverage, fact checking, and creative writing.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]