["One post on Facebook from November 30, 2018 is a link to an article headlined: “Heavy protest as Zimbabwe's Economy collapses, citizens cry for return of white farmers”. This has been shared 2,552 times.", "A few comments on the post prophesy that the same fate will befall South Africans, “Take note South Africans and all that happens here is that the farmers are being slaughtered daily”", "Another comment with 42 likes wrote, “You got what you wanted, didn't you!! Don't cry now!” in response to the headline.", "The official Twitter account for the main opposition party, Movement for Democratic Change (MDC), tweeted notices ahead of the demonstration, detailing the cause and the event -- but with no plea for the return of white farmers.", "This was reiterated in a thread from the account titled: “Why you should Join the Demonstration Tomorrow”. The thread breaks down seven points of promises the party believes Zimbabwe’s President Emmerson Mnangagwa has failed on -- also unrelated to the claim the headline suggests.", "AFP attended the demonstration on November 29, 2018 and reported that much of the marchers' anger was focused on Zimbabwe's renewed economic problems. Below is what some participants told AFP:", "\"We are here to demonstrate against the economic crisis and the election that was stolen,\" said Donald Bango, a 25-year-old security guard.", "\"Prices of basic commodities are going up and we cannot access drugs from pharmacies,\" said Rachel Chakanetsa, a 53-year-old widow who was at the demonstration.", "The marchers delivered a petition to parliament saying Zimbabwe was in \"an unending crisis of legitimacy\".", "Many white farmers had their land seized in the years after 2000 under a government policy introduced by then-president Robert Mugabe that was supposedly meant to address colonial inequalities. But much of the land fell into disuse and the collapse of agriculture production hastened the hyperinflation that wrecked the economy.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]