["The video was published here on Instagram on November 6, 2020.", "The 11-second video shows two CNN anchors, John King and Wolf Blitzer, talking about the 2020 US Presidential election. A notification for Pornhub then appears on a screen behind King, which he appears to swipe away within seconds.", "Text superimposed on the video reads: “CNN had Pornhub open ?”.", "CNN refers to Cable News Network, a US-based 24-hour cable news channel.", "The video was also shared on Facebook here, here and here; on Twitter here; Instagram here; and YouTube here and here.", "The video, however, has been digitally manipulated.", "French journalist Boris Kharlamoff shared the unedited CNN broadcast on Twitter here on November 6, 2020.", "It shows King swiping away a predominantly black rectangle from the screen that does not display the Pornhub logo.", "❌ Non, aucun onglet Pornhub n’est apparu à l’antenne sur @CNN. Vous pouvez reprendre une activité normale. pic.twitter.com/lLQyyxhNfc", "Below is a screenshot of the video from the misleading Instagram post (L) and the actual CNN broadcast (R):", "The manipulation can be seen clearly in this GIF posted by journalist Julian Röpcke on Twitter on November 6, 2020.", "CNN did NOT \"have Pornhub open\".\n\t\tIt's a fake. pic.twitter.com/JdFmo15i4a", "A keyword search also found this response from King published on his official Twitter account on November 6, 2020.", "In response to a Twitter user who asked him whether the incident was real, King replied: “Not. Some clown taking time away from lying about something else apparently because they don’t like math.”", "Not. Some clown taking time away from lying about something else apparently because they don’t like math. https://t.co/IcfHQ3gzDQ", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]