["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "President Donald Trump waded into Alabama’s Senate race to blast Democratic challenger Doug Jones as a tax-happy puppet of the liberal establishment.", "Rather than fully embrace the controversial Republican nominee Roy Moore, who's embroiled in allegations of sexual misconduct with a 14-year-old girl and several other teenagers, Trump has supported Moore by bashing his opponent ahead of the Dec. 12 special election.", "\"The last thing we need in Alabama and the U.S. Senate is a Schumer/Pelosi puppet who is WEAK on Crime, WEAK on the Border, Bad for our Military and our great Vets, Bad for our 2nd Amendment, AND WANTS TO RAISES TAXES TO THE SKY. Jones would be a disaster!\" Trump tweeted Nov. 26.", "The last thing we need in Alabama and the U.S. Senate is a Schumer/Pelosi puppet who is WEAK on Crime, WEAK on the Border, Bad for our Military and our great Vets, Bad for our 2nd Amendment, AND WANTS TO RAISES TAXES TO THE SKY. Jones would be a disaster!", "Trump’s tweet is chock-full of potential claims. Given Republican lawmakers’ urgent push to pass a tax bill, we decided to focus on his claim that Jones wants to raise taxes.", "No, Jones has not campaigned on a platform of raising taxes.", "We did not find examples of Jones calling for tax hikes, and the White House did not respond to our request for supporting evidence.", "Jones has embraced some elements of the Republican tax plan while appearing to oppose it overall.", "Jones told Alabama voters that unlike some Democrats, he favors lowering corporate taxes and believes it would make American business more competitive, according to the Washington Post’s coverage of a Nov. 21 candidate forum in Huntsville.", "\"I generally try to support cutting corporate taxes to try to get reinvestment back into this country,\" Jones told reporters Nov. 16, the day the House passed its version of the tax plan. (We’ve previously reported that around $2.8 trillion in untaxed corporate earnings is parked overseas.)", "Despite his support for a corporate tax cut, Jones has criticized the GOP tax plan as fiscally irresponsible, and skewing too heavily in favor of the rich while either ignoring or hurting the middle class.", "\"What I have said all along is that I am troubled by tax breaks for the wealthy, which seem to be, in this bill, overloaded,\" Jones told reporters Nov. 16. \"I'm troubled by what appears to be, ultimately, tax increases or no tax cuts for the middle class.\"", "Needless to say, Jones’ support for cutting the corporate tax rate, and his concern for giving tax breaks to the middle class — or at least not raising their taxes — is at odds with Trump’s claim.", "At the same time, Jones’ campaign literature, which bemoans tax breaks and loopholes for wealthy Americans, raises the question of whether Jones wants to end these benefits, effectively hiking taxes on the rich.", "\"All Americans should have a place in this economy,\" reads Jones’ campaign website, \"and tax breaks or loopholes for the wealthiest among us hurt our ability to invest in education and other needs for lower to moderate income families.\"", "Jones' website also calls for government spending on education and job training, and defends the legacy of Franklin Roosevelt's New Deal, which was financed through tax hikes.", "Jones’ campaign declined to answer our questions about whether Jones would support raising taxes and how he would pay for the programs he champions.", "Trump said Jones wants to \"raise taxes.\"", "While Jones has criticized tax breaks for the rich, we found no examples of him calling to raise taxes. On the contrary, we found several instances of Jones supporting tax cuts for corporations and the middle class.", "We rate Trump’s claim Mostly False.", "Tweet by Donald Trump, Nov. 26, 2017", "Associated Press, \"Trump straddle: Won't stump for Moore, yet blasts Dem foe,\" Nov. 28, 2017", "Washington Post, \"Roy Moore avoids ‘yappy’ reporters with friendly interview in Alabama,\" Nov. 22, 2017", "New York Times, \"House Passes Tax Bill, as Does Senate Panel,\" Nov. 16, 2017", "NBC News, \"Roy Moore's opponent focused on Alabama issues,\" Nov. 16, 2017", "PolitiFact, \"Are there over $4 trillion of untaxed corporate earnings offshore, as Donald Trump said?\" Aug. 3, 2017", "Doug Jones for Senate website", "Email interview with Sebastian Kitchen, spokesman for Doug Jones campaign, Nov. 27, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]