["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "On Sept. 27, an image of Dwayne \"The Rock\" Johnson appeared on Facebook. He looks relaxed in a chair on a beach, smiling with a book by Sen. Elizabeth Warren in hand. A domed building looms on a hill behind him.", "\"Epstein Island,\" wrote an account that shared the image, referring to the private Carribean island owned by the late financier and sex offender Jeffrey Epstein.", "But the photo in the post is doctored and it was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The original image comes from the season five premiere of \"Ballers,\" the HBO show in which Johnson plays a former athlete turned manager.", "But the building that appears in the image on Facebook — which looks like the blue-striped building on Little St. James, the island owned by Epstein — is not in the original.", "That building also doesn’t appear in similar shots from \"Ballers\" that Warren’s campaign tweeted the night the show premiered. (She’s a big fan of the show.)", "\"You love to see it: @TheRock reading ‘This Fight is Our Fight: The Battle to Save America’s Middle Class’ by @ewarren,\" her campaign’s Twitter account wrote in August 2019.", "Johnson isn’t the first celebrity to be tangled in a social media hoax wrongly connecting some actors to Epstein. This particular allegation came only a few hours after Johnson, a retired professional wrestler who described himself as \"a political independent and centrist for many years,\" publicly endorsed Biden for president.", "But this picture of him on the beach is doctored. We rate this Facebook post Pants on Fire.", "Facebook post, Sept. 27, 2020", "The Rock Facebook post, Sept. 27, 2020", "Boston Magazine, The Rock was spotted reading Elizabeth Warren’s book on Ballers, Aug. 26, 2019", "Vanity Fair, Ballers pays sneaky homage to superfan Elizabeth Warren, Aug. 26, 2019", "Team Warren tweet, Aug. 26, 2019", "NBC News, Jeffrey Epstein’s bizarre blue-striped building on private island raised alarm, Aug. 1, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]