["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Senate Majority Leader Mitch McConnell alleged that the Obama administration did not provide the Trump administration with any information about the threat of a possible pandemic during a May 11 Team Trump Facebook Live video discussion with Lara Trump.", "\"They claim pandemics only happen once every 100 years, but what if that is no longer true? We want to be ready, early, for the next one. Because clearly, the Obama administration did not leave any kind of game plan for something like this,\" said McConnell.", "This claim caught our attention because its definitive nature was directly at odds with the position of some former Obama administration officials, who immediately disputed it and started circulating on social media the link to such a plan.", "We reached out to McConnell’s press team to ask for the basis of his statement. McConnell’s spokesperson David Popp said in an emailed response that \"this is a unique crisis and we are all adapting to the public health and economic challenges.\" In terms of the pandemic’s economic impact, he said there was \"definitely no playbook there\" and instead credited McConnell with his work on the CARES act, a coronavirus relief bill passed by Congress.", "Soon after McConnell made his playbook comment, Ronald Klain, who was the White House Ebola response coordinator from October 2014 to February 2015, tweeted out a link to a document titled \"Playbook for Early Response to High-Consequence Emerging Infectious Disease Threats and Biological Incidents.\"", "The document, originally unearthed in March by Politico, is a 69-page National Security Council guidebook developed in 2016 with the goal of assisting leaders \"in coordinating a complex U.S. Government response to a high-consequence emerging disease threat anywhere in the world.\" It outlined questions to ask, who should be asked to get the answers and what key decisions should be made.", "Nicole Lurie, another Obama administration official, confirmed to us the existence of the NSC pandemic playbook and also said similar documents were created for the Department of Health and Human Services and the Centers for Disease Control and Prevention.", "\"To say there was no playbook was ridiculous,\" said Lurie, who served as the assistant secretary for preparedness and response at HHS during both terms of the Obama administration.", "The playbook lists types of infectious disease threats that could emerge. \"Novel coronaviruses\" were among pathogens flagged as having potential to cause heightened concern.", "Lurie said that there were tabletop exercises, which included planning for a pandemic-like situation, during the transition between the Obama and Trump administrations. (The Trump administration also conducted an exercise — known as \"Crimson Contagion\" — in 2019.)", "Other Obama-era officials offered similar stories in interviews this week with CNN:", "\"They were extensively briefed, to the extent that they paid attention to these things during the transition,\" said Jeremy Konyndyk, who directed USAID’s Office of U.S. Foreign Disaster Assistance.", "\"We absolutely did leave a plan. It was called a playbook,\" said Lisa Monaco, who was a former homeland security adviser to President Obama  The goal, she said, was to share the lessons learned during Ebola and Zika.", "Meanwhile, Peter Loge, who served as a senior adviser within Obama’s Food and Drug Administration, told KHN he remembered a very clear message from the HHS secretary regarding the presidential transition.", "\"Our job was to set up the Trump political staff for success, and we took that mandate very seriously,\" said Loge. He and his colleagues wrote memos to inform the Trump staff about priority issues. \"But nobody called me and asked what I was doing in my job,\" said Loge.", "However, the Trump administration has maintained that the coronavirus sneaked up on the U.S., and Trump himself has even said it was a \"very unforeseen thing.\"", "But, in a May 14 exchange with reporters on the White House lawn, press secretary Kayleigh McEnany acknowledged the existence of the Obama pandemic playbook, even holding it up to show the press. She also dismissed its usefulness.", "\"The Obama-Biden plan that has been referenced was insufficient. It wasn’t going to work. What our administration did under the leadership of President Trump was do an entire 2018 pandemic preparedness report,\" said McEnany. Trump, who was standing nearby, agreed.", "Senate Majority Leader Mitch McConnell said the Obama administration did not leave behind a \"game plan\" for a pandemic.", "That’s wrong.", "Multiple Obama-era officials have said they left a 2016 \"pandemic playbook\" that detailed exact steps to take in the event of an infectious disease outbreak. The White House press secretary even held up the actual document on the White House lawn.", "There has been discussion in recent days as to whether the Obama plan was dated because it dealt with lessons learned from earlier outbreaks that may not apply to the current pandemic. Still, McConnell’s statement focused only on whether any such \"game plan\" existed, and ample evidence suggests it did.", "We rate it Pants on Fire.", "UPDATE, May 15, 2020: In a Fox News interview, McConnell acknowledged that he was incorrect in his assertion that the Obama administration didn’t leave behind any kind of \"game plan\" regarding a pandemic threat. \"I was wrong. They did leave behind a plan so I clearly made a mistake in that regard,\" McConnell said May 14.", "Brookings, \"How instability and high turnover on the Trump staff hindered the response to COVID-19,\" May 7, 2020.", "CNN, \"Fact-check: McConnell claims Obama didn’t leave Trump a pandemic ‘game plan.’ Obama left a 69-page playbook,\" May 12, 2020.", "CNN, \"Ex-homeland security adviser: Our playbook was ‘ignored’,\" May 12, 2020.", "CNN, \"Ex-Obama official: We left Trump detailed pandemic playbook,\" May 12, 2020.", "Congressional Research Service, \"Presidential Transition Act: Provisions and Funding,\" Oct. 5, 2016.", "C-SPAN, \"President Trump White House Departure,\" May 14, 2020.", "Document Cloud, \"Pandemic-Playbook,\" March 2020.", "Email exchange with Eric Schultz, senior adviser to Barack Obama, May 12, 2020.", "Email exchange with Lawrence Gostin, university professor at Georgetown University Law Center, May 12, 2020.", "Email exchange with Lisa Monaco, distinguished senior fellow at the New York University School of Law, May 12, 2020.", "Email statement from the Office of Senate Majority Leader Mitch McConnell, May 14, 2020.", "Executive Office of the President, Office of Management and Budget Memo, \"MEMORANDUM FOR THE HEADS OF EXECUTIVE DEPARTMENTS AND AGENCIES,\" April 27, 2020.", "Huffington Post, \"Trump Administration Failed Dry-Run ‘Crimson Contagion’ Pandemic Exercise,\" March 20, 2020.", "Kaiser Health News, \"Was the Novel Coronavirus Really Sneaky In Its Spread to the U.S.? Experts Say No,\" March 19, 2020.", "Phone interview with Martha Kumar, co-founder and director of the White House Transition Project, May 13, 2020.", "Phone interview with Nicole Lurie, strategic advisor to the CEO at the Coalition for Epidemic Preparedness Initiatives, May 13, 2020.", "Phone interview with Peter Loge, associate professor of media and public affairs at George Washington University, May 13, 2020.", "Politico, \"Before Trump’s inauguration, a warning: ‘The worst influenza pandemic since 1918’,\" March 16, 2020.", "Politico, \"Facilitated Group Discussion Pandemic Response,\" March 2020.", "Politico, \"Trump team failed to follow NSC’s pandemic playbook,\" March 25, 2020.", "S.1172, \"Edward \"Ted\" Kaufman and Michael Leavitt Presidential Transitions Improvement Act of 2015,\" 2015-2016.", "Twitter, Ronald Klain status.", "YouTube, \"Watch Team Trump Online With Lara Trump and Senate Majority Leader Mitch McConnell!\" May 11, 2020.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]