["About this rating", "The statements on this list are all correctly attributed to President Trump.", "However, this is not an exhaustive list of every comment Trump made about the coronavirus, nor does it represent all the actions his administration took during the COVID-19 pandemic.", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "On March 17, 2020, U.S. President Donald Trump told reporters that he had known the new coronavirus would result in a pandemic \"long before it was called a pandemic.\" But this statement rung hollow for some listeners, who noted that Trump had been downplaying the COVID-19 coronavirus disease since it first started spreading widely in China in January.", "The following day the hashtag #Trumpliedpeopledied was the top trending topic on Twitter, and a meme supposedly containing more than a dozen quotes from Trump in which he minimized the impact of the disease started to circulate on social media.", "It's unclear who created this list of \"Trump's Responses to the Coronavirus Outbreak,\" but it seems to align with reporting from The New York Times, NBC News, and The Washington Post.", "Generally speaking, the quotes in this list and the provided dates are all accurate.", "However, it should be noted that this list is not exhaustive and it does not document all the of the actions taken by Trump's administration.", "For the source and context of each quote, keep scrolling:", "Trump made this comment on the CNBC show \"Squawk Box\" during an interview with Joe Kernen at the World Economic Forum in Davos, Switzerland. At the time, there were 500 cases reported in China and the first had just been recorded in the United States.", "Source: CNBC", "Trump made this comment on the Fox News program \"Hannity.\" A few days prior to this interview, the Trump administration suspended entry to the United States of foreign nationals who had recently visited China (excluding Hong Kong and Macau).", "Source: Fox News", "This comment was published on Trump's Twitter account. On the same day, the White House asked Congress for $1.25 billion to help fund the government's response to COVID-19 and stocks plummeted.", "Source: Twitter", "This comment was published on Trump's Twitter account.", "Source: Twitter", "This is a mash-up of two comments Trump made during a trip to New Delhi, India, to meet with business leaders. Here's an excerpt from a White House readout of Trump's remarks at this business round table (emphasis ours):", "China is working very, very hard. I have spoken to President Xi, and they’re working very hard. And if you know anything about him, I think he’ll be in pretty good shape. They’re — they’ve had a rough patch, and I think right now they have it — it looks like they’re getting it under control more and more. They’re getting it more and more under control.", "So I think that’s a problem that’s going to go away. But we lost almost 1,000 points yesterday on the market, and that’s something. You know, things like that happen where — and you have it in your business all the time — it had nothing to do with you; it’s an outside source that nobody would have ever predicted. If you go back six months or three months ago, nobody would have ever predicted.", "The second portion of this quote comes from another statement Trump made during this same trip. New York Post reported:", "Trump said the death rate for Ebola was a “virtual 100 percent,” compared with the “1 or 2 percent” for the coronavirus, or COVID-19.", "“Now they have it, they have studied it, they know very much. In fact, we’re very close to a vaccine,” Trump said.", "The White House later clarified that Trump meant that the United States was close to a vaccine for Ebola, not the coronavirus.", "Source: The White House, New York Post", "Trump made this remark during a press conference in the James S. Brady Press Briefing Room. Trump was asked if schools should be preparing for an outbreak. He responded:", "I would think so, yes. I mean, I haven’t spoken specifically about that with the various doctors, but I would think so, yes.", "I think every aspect of our society should be prepared. I don’t think it’s going to come to that, especially with the fact that we’re going down, not up. We’re going very substantially down, not up.", "Source: The White House", "Trump made this comment to attendees at an African American History Month reception at the White House. At the time, the Centers for Disease Control and Prevention (CDC) was warning that COVID-19 would spread across the United States.", "Source: CNN", "Trump made this comment while talking to reporters on the White House lawn. Vox reporter Aaron Rupar shared a video of Trump's comments:", "Trump asked this question during a meeting with pharmaceutical executives and public health officials. One of the health officials flatly responded: No.", "https://www.c-span.org/video/?c4859631/user-clip-take-solid-flu-vaccine", "Source: Vox", "Trump made this comment during the same meeting mentioned above. This quote appears in a transcript of the meeting provided by the White House (emphasis ours):", "The White House Coronavirus Task Force, led by Vice President Mike Pence, has been meeting daily and coordinating closely with the state and local governments. Mike had a call today with 53 governors, and I heard it was a very good call, and everybody is very well coordinated. And the governors and the states — all of them; I can’t think of an exception — they’ve been really working closely with us. It’s been — it’s been a very good — a very good relationship.", "We will confront this challenge together, and we will continue to do exactly what we’re doing. And we’re going to be very successful. A lot of things are happening. A lot of very exciting things are happening, and they’re happening very rapidly.", "Source: The White House", "Trump made this comment during an interview on Fox News. At the time, the CDC was urging employers to have workers stay home.", "Source: CBS News", "Trump's \"work\" comment caused significant controversy, leading Trump to clarify his remarks on Twitter.", "While Trump truly did say that \"some of them go to work,\" which may have downplayed the seriousness of the situation, he didn't recommend at this time that people should keep going to work despite the pandemic.", "Source: Twitter", "Trump made this remark while touring the CDC facility in Atlanta, Georgia. Here's a larger excerpt of Trump's comment from the White House's record:", "I think we’re doing a really good job in this country at keeping it down. We’ve really been very vigilant, and we’ve done a tremendous job at keeping to down.", "But who would have thought? Look, how long ago is it? Six, seven, eight weeks ago — who would have thought we would even be having the subject? We were going to hit 30,000 on the Dow like it was clockwork. Right? It was all going — it was right up, and then all of a sudden, this came out.", "At the time Trump made this comment, cases of COVID-19 in the United States had jumped to over 300.", "Source: The White House", "This comment also came during Trump's visit to the CDC facility in Atlanta, Georgia. At the time, the United States had only conducted about 2,000 coronavirus tests.", "Source: The White House", "Again, this comment was made during Trump's visit to the CDC in Georgia.", "Source: The White House", "Again, this comment was made as Trump toured the CDC facility in Georgia. At the time, the Grand Princess cruise ship was being held off the coast of San Francisco, California, and carrying passengers sickened with COVID-19. Here's a video of Trump's comment:", "Source: The White House", "This comment was published on Trump's Twitter account.", "Source: Twitter", "This comment also comes from Trump's Twitter account.", "Source: Twitter", "Trump made this comment while speaking with reporters on Capitol Hill after meeting with Republican senators. Trump's full comments can be seen in a transcript from the White House:", "Well, this was unexpected.  This was something that came out of China, and it hit us and many other countries.  You look at the numbers; I see the numbers with just by watching you folks.  I see it — it’s over 100 different countries.  And it hit the world.", "And we’re prepared, and we’re doing a great job with it.  And it will go away.  Just stay calm.  It will go away.", "We want to protect our shipping industry, our cruise industry, cruise ships.  We want to protect our airline industry — very important.  But everybody has to be vigilant and has to be careful.", "Source: The White House", "Trump declared a National Emergency to help the government respond to the COVID-19 pandemic on March 13, 2020.", "Source: The White House", "White House.   \"Remarks by President Trump After Meeting with Republican Senators.\"\r\n    10 March 2020.", "White House.   \"Remarks by President Trump at a Business Roundtable | New Delhi, India.\"\r\n    26 February 2020.", "White House.   \"Remarks by President Trump, Vice President Pence, and Members of the Coronavirus Task Force in Press Conference.\"\r\n    27 February 2020.", "White House.   \"Remarks by President Trump and Members of the Coronavirus Task Force in Meeting with Pharmaceutical Companies.\"\r\n    2 March 2020.", "White House.   \"Remarks by President Trump After Tour of the Centers for Disease Control and Prevention | Atlanta, GA.\"\r\n    7 March 2020.", "White House.   \"Proclamation on Declaring a National Emergency Concerning the Novel Coronavirus Disease (COVID-19) Outbreak.\"\r\n    13 March 2020.", "Phillips, Matt; Horowitz, Jason; Sang-Hun, Choe.   \"U.S. Stocks Plunge as Coronavirus Crisis Spreads.\"\r\n    The New York Times.   24 February 2020.", "Steinbuch, Yaron.   \"Trump Says US Was Right to Bring Back Americans with Coronavirus.\"\r\n    New York Post.   25 February 2020.", "Vazquez, Maegan; Kelly, Caroline.   \"Trump Says Coronavirus Will 'Disappear' Eventually.\"\r\n    CNN.   27 February 2020.", "Rupar, Aaron.   \"Trump’s Ignorance Was on Public Display During Coronavirus Meeting with Pharmaceutical Execs.\"\r\n    Vox.   3 March 2020.", "Garrand, Danielle.   \"President Trump Said People with Coronavirus \"Go to Work\" and Now Critics on Twitter Are Furious.\"\r\n    CBS News.   5 March 2020.", "Puhak, Janine.   \"Coronavirus: President Trump Said US Authorities 'Shut it Down.' Here's What That Means.\"\r\n    Fox News.   3 February 2020.", "Rogers, Katie.   \"Trump Now Claims He Always Knew the Coronavirus Would Be a Pandemic.\"\r\n    The New York Times.   17 March 2020.", "Leonhardt, David.   \"A Complete List of Trump’s Attempts to Play Down Coronavirus.\"\r\n    The New York Times.   15 March 2020.", "Belvedere, Matthew.   \"Trump Says He Trusts China’s Xi on Coronavirus and the US Has it ‘Totally Under Control.'\"\r\n    CNBC.   22 January 2020.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]