["The video was published in this Facebook post on September 6, 2019.", "The clip, which shows a boy kicking an elderly man’s shopping trolley loaded with cardboard boxes, has been viewed almost 160,000 times.", "Below is a screenshot of the misleading post:", "The post’s traditional Chinese-language caption translates to English as: “#Is Taiwan receiving rubbish like Joshua Wong?", "“#Check out Hong Kong-Joshua Wong’s bad behaviours. What kind of man bullies elderly people?", "“He’s essentially a rioter, but has been treated like a hero, a VIP, during his trip to Taiwan. All he does is destroying the moral value of Taiwan. Green governance is guaranteed to collapse!”", "Wong is a pro-democracy activist in Hong Kong.", "“Green governance” refers to Taiwanese President Tsai Ing-wen’s Democratic Progressive Party (DPP), which is dubbed “Green Terror” by the opposition, as reported here by AFP on December 31, 2019.", "The video, as well as still images from it, were also shared hundreds of times here, here and here and here on Facebook and here on YouTube alongside a similar claim.", "The claim is false; the video does not show Wong.", "The section of the footage that shows the attack was filmed by Hong Kong broadcaster i-CABLE during a protest in the city in March 2015.", "The i-CABLE logo can be seen in the top left-hand corner of the video in the misleading post.", "A reverse image and keyword search on Google found this video published on the verified Facebook account of i-CABLE on March 9, 2015.", "The video’s traditional Chinese-language title translates to English as: “[Comment on anti-mainland visitor sentiment] [Pro-establishment camp urges police to investigate and identify instigators behind the scenes]”.", "Its caption translates to English in part as: “An anti-parallel trading protest caused chaos once again in Tuen Mun last Sunday. Some pro-establishment lawmakers said protesters behaved like ‘rioters’ and urged police to investigate, enforce the law, identify the instigator(s) behind the scenes and protect the tourists.\"", "The beginning of the video in the misleading posts, which shows the boy kicking the trolley, corresponds with the i-CABLE footage from the zero to 12-second mark.", "Below is a screenshot of a corresponding scene in the video in the misleading post (L) and the i-CABLE footage (R):", "The i-CABLE video has a voice-over which states in Cantonese that protesters shouted at mainland tourists at a bus stop, and one of them kicked the shopping trolley of a mainland Chinese man, who then appeared shocked.", "From the 17-second mark, the man identified in the clip as mainland Chinese speaks to the camera in Mandarin. He states in part:", "“I think what he did was so wrong. He seemed to be educated but that was very unreasonable.  I’m not afraid. I’m 80 years old, I’m afraid of nothing.", "“We need to be reasonable. If there’s anything wrong, we should be gentle with each other. Hong Kong is  an international city, which should consider the welfare of Hong Kongers, mainlanders, as well as people from other countries.", "“I have four daughters, one of them lives in Hong Kong, one in Shenzhen and two in Harbin. I will continue to come visit… My daughter lives here, so I will always come.”", "The i-CABLE report did not make any reference to Joshua Wong.", "Hong Kong newspaper South China Morning Post and Hong Kong television station Now News reported here and here in March 2015 about a series of rallies in various districts against parallel traders, who buy consumer goods in bulk in Hong Kong for sale across the border on the mainland.", "I-CABLE published this follow-up video report on March 10, 2015, which states that three people, including two 16-year-old male secondary school students and a 21-year-old female university student, were charged following the Tuen Mun protest on March 8.", "All three suspects can be seen in i-CABLE’s video report. Neither of the men pictured in the video are Joshua Wong.", "Below is a screenshot comparison of a photo of Wong from his verified Facebook account  (L) and stills of the two arrested boys taken from the i-CABLE news segment (C & R):", "A custom search between March 8 and 10, 2015, on Twitter also found no mention of a Taiwan trip in Wong’s tweets.", "Joshua Wong has been targeted by disinformation since he emerged as a leader of Hong Kong’s 2014 Umbrella Movement. Here is an AFP fact-check report about the 23-year-old activist.", "The same misleading claim was previously debunked in this report published by Taiwan-based fact-check site Taiwan FactCheck Center on September 17, 2019.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]