["A medical worker uses her phone while wearing a surgical mask outside Mt. Sinai West on March 26, 2020, in New York. (AP)", "President Donald Trump signed a law March 23 that tasks the federal government with securing 5G data networks. It does not explicitly provide for the installation of more cell towers.", "While some experts are concerned about the potential health effects of 5G, there is no evidence to support the symptoms listed in the post.", "Misinformation about the health effects of 5G can be traced to a 2019 propaganda campaign promoted by Russian state television.", "A conspiracy theory with roots in a Russian propaganda campaign is getting new life amid the coronavirus pandemic.", "In a March 28 post, a Facebook user refers to Public Law No. 116-129 and claims the government is taking advantage of the COVID-19 pandemic to distract from the installation of 5G cellular data towers. The technology is the latest upgrade to speed up wireless internet connections.", "\"5G LAW PASSED while everyone was distracted,\" the post reads. \"Signed into law 116-129 on 3-23-2020, that will speed up the installation of 5G and protect profits! Children had to be out of schools for the covert installation. Parents are you seeing what's happening?\"", "The post also lists 20 purported symptoms of 5G exposure, including shortness of breath and fever — symptoms similar to those of COVID-19.", "The posts were flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "(Screenshot from Facebook)", "We’ve fact-checked other conspiracy theories that falsely connect the coronavirus outbreak to the development of 5G, so we wanted to look into this one, too.", "There is no evidence that the new law was deliberately passed during the COVID-19 pandemic. And while some experts have speculated that 5G’s high-frequency radio waves could have some adverse health effects, such as neurological disorders, other reports say the fear is overblown.", "On March 23, President Donald Trump signed a law that requires the president to work with federal agencies to \"secure and protect\" 5G infrastructure in the United States.", "\"The Act requires the President to develop and implement a strategy for the adoption of secure wireless communications technology in the United States and abroad,\" Trump said in a White House statement. \"The strategy will protect the American people from security threats to telecommunications networks and 5G technology.\"", "The Secure 5G and Beyond Act contains a provision to \"protect the competitiveness of United States companies,\" but it says nothing about the \"covert installation\" of 5G towers, as the Facebook post claims. The legislation is not specifically focused on speeding up the implementation of 5G.", "By March 23, the coronavirus crisis was well underway in the U.S. The World Health Organization reported 31,573 confirmed cases across the country, and Trump said during a press briefing that the numbers \"are going to increase with time.\"", "However, there is no evidence that Congress waited to pass the 5G law during the coronavirus outbreak. Sen. John Cornyn, R-Texas, introduced the legislation last spring, and the Senate Commerce Committee finalized it in December. The full Senate passed the bill on March 4.", "The second part of the Facebook post lists a slew of symptoms purportedly associated with exposure to 5G networks. While some experts are concerned about the potential health effects of 5G, there is no evidence to support the flu-like effects listed in the post.", "Joel Moskowitz, director of the Center for Family and Community Health in the School of Public Health at the University of California, Berkeley, supports a moratorium on 5G development. He wrote in Scientific American that there could be health effects and that research needs to be funded.", "\"The latest cellular technology, 5G, will employ millimeter waves for the first time in addition to microwaves that have been in use for older cellular technologies, 2G through 4G,\" he wrote. \"Given limited reach, 5G will require cell antennas every 100 to 200 meters, exposing many people to millimeter wave radiation.\"", "Short-term exposure to millimeter waves can cause physiological effects in the nervous system, immune system and cardiovascular system, while long-term exposure could lead to conditions like melanoma and sterility, according to Moskowitz. However, he also wrote that there is no research to confirm a correlation between 5G exposure and those broad health conditions, much less the very specific symptoms listed in the Facebook post.", "RELATED: No evidence that coronavirus was faked to cover up ‘5G Syndrome’", "And other reports say the fears of 5G exposure are overblown:", "\"The vast majority of evidence says there’s no reason to pause deployments.\" — Rod Waterhouse, an electrical engineer, wireless-communications entrepreneur and editor of a report on 5G, speaking to the Institute of Electrical and Electronics Engineers", "\"There’s little reason to think 5G frequencies are any more harmful than other types of electromagnetic radiation, like visible light.\" — Wired magazine", "\"The 5G Health Hazard That Isn’t — How one scientist and his inaccurate chart led to unwarranted fears of wireless technology.\" — New York Times headline", "False and misleading social media posts about 5G and coronavirus are similar to a Russian propaganda campaign that’s aimed at delegitimizing the technology’s implementation in the U.S.", "In May 2019, the New York Times reported that Russian network RT America was airing unsubstantiated reports linking 5G exposure to brain cancer, infertility and autism.", "\"It’s economic warfare,\" Ryan Fox, chief operating officer of technology firm New Knowledge, told the New York Times. \"Russia doesn’t have a good 5G play, so it tries to undermine and discredit ours.\"", "Hundreds of blogs and websites have republished RT’s dubious claims about 5G, according to the newspaper. And over the past week, we’ve seen dozens of Facebook and Instagram posts build on that misinformation by baselessly linking the coronavirus pandemic to the development of 5G.", "(Screenshot from Instagram)", "The conspiracies are particularly popular among anti-vaccine and alternative-health Facebook groups and Instagram accounts.", "In a March 30 Instagram post, which has more than 146,000 likes, Robert F. Kennedy Jr. promoted a conspiracy theory about 5G and the coronavirus. Kennedy, the nephew of former President John F. Kennedy, is among the biggest sources of anti-vaccine advertisements on Facebook.", "\"The quarantine has facilitated the unobstructed #5G rollout,\" Kennedy said in his post, which echoes the claims made in the March 28 Facebook post.", "According to Google Trends, search queries for \"coronavirus 5G\" have spiked since early March.", "A Facebook post claimed that the government used the coronavirus pandemic to distract from the passage of a 5G law.", "Trump signed a law March 23 that aims to \"secure and protect\" 5G infrastructure in the U.S. The legislation has a provision to protect American companies, but it says nothing about installing more 5G towers.", "While some experts have said there could be adverse health effects associated with 5G, other reports say the fears are overblown. Misinformation about 5G and the coronavirus can be traced to a Russian propaganda campaign that seeks to delegitimize the implementation of 5G.", "The Facebook post contains an element of truth but ignores critical facts that would give a different impression. We rate it Mostly False.", "Ars Technica, \"Robert F. Kennedy Jr. is the single leading source of anti-vax ads on Facebook,\" Nov. 14, 2019", "Centers for Disease Control and Prevention, Coronavirus Disease 2019 (COVID-19): Symptoms of Coronavirus, accessed April 3, 2020", "Congress.gov, S.893 - Secure 5G and Beyond Act of 2020, accessed April 3, 2020", "CrowdTangle, accessed April 3, 2020", "C-SPAN, \"President Trump Holds Coronavirus Task Force Briefing,\" March 23, 2020", "Facebook post, March 29, 2020", "Google Trends, accessed April 3, 2020", "Instagram post from Robert F. Kennedy Jr., March 30, 2020", "The New York Times, \"Russia’s RT: The Network Implicated in U.S. Election Meddling,\" Jan. 7, 2017", "The New York Times, \"Your 5G Phone Won’t Hurt You. But Russia Wants You to Think Otherwise.\" May 12, 2019", "PolitiFact, \"No evidence that coronavirus was faked to cover up ‘5G Syndrome,’\" March 9, 2020", "Scientific American, \"We Have No Reason to Believe 5G Is Safe,\" Oct. 17, 2019", "The White House, \"Statement by the President,\" March 23, 2020", "World Health Organization, \"Coronavirus disease 2019 (COVID-19) Situation Report – 63,\" March 23, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]