["An almost 2-minute long clip has gone viral on social media with users claiming that it features “Congress MLA Anil Upadhyay”. The man in the video can be seen speaking against certain politicians and journalists. It begins with his criticism of the Congress party and ends with him demanding that a total of 100 people be sent to jail.", "*Congress MLA Anil Upadhyay unknowingly spoke out, but spoke the complete truth. Make this VIDEO viral, so that the entire Nation can see it.* 👌🏻👌🏻👇👇 pic.twitter.com/A1zcna9Uc7", "— Sridhar Sadashiva Rao (@sadashiva_ra) November 11, 2020", "The same video was also widespread earlier in August.", "कांग्रेस विधायक #अनिल #उपाधाय अनजाने में कह गया पर सही बोल दिया । इस VIDEO को इतना वायरल करो कि ये पुरा हिदुस्तान देख सके", "Posted by Deepak Oberoi on Tuesday, 18 August 2020", "We found that this video has been viral with the same claim on Twitter since July.", "कांग्रेस विधायक अनिल उपाधाय अनजाने में कह गया पर सही बोल दिया इस VIDEO को इतना वायरल करो कि ये पुरा हिदुस्तान देख सके।👌🏻👌🏻A👆🏽👆🏽 pic.twitter.com/nGYIcnqVNT", "— भीम सिंह सैनी( छोटा मोदी ) (@BHIMSIN25246977) July 24, 2020", "This video cannot possibly show “Congress MLA Anil Upadhyay” because there is no such MLA by this name. This is a fictitious name that goes viral every few months with a new video. Alt News has investigated many such videos with this name.", "1. Fictional BJP MLA ‘Anil Upadhyay’ revived, now with false claim that he was thrashed by women", "2. BJP MLA ‘Anil Upadhyaya’ talking about CAA? No, videos yet again viral with fictitious name", "3. Fictitious politician ‘Anil Upadhyaya’ makes a comeback, now as BJP MLA criticising CAA/NRC", "4. Fact check: Is this Congress MLA Anil Upadhyay praising PM Narendra Modi?", "5. False claim, viral video: Dalit youth beaten by BJP MLA Anil Upadhyay", "In the screenshot below, the search results of the name ‘Anil Upadhyay’ on myneta.info is shown. This website is a database of contesting political candidates. As evident, there is no Congress politician named “Anil Upadhyay”.", "Now, let’s find out who is the person in the video. On the bottom of the clip, the words ‘The Newspaper Exclusive’ can be seen.", "We found a verified channel called ‘The Newspaper’ on YouTube that has more than 5 lakh subscribers. However, its social media accounts on Facebook, Twitter and Instagram are not verified and have a much smaller follower count. The channel uploaded this 11-minute video of a professor on March 4, 2020. The video is entitled, “What did this professor say about Rahul Gandhi that made people lift him up in the air? | Delhi.”", "In this video, the person seen talking for eight minutes is the same one from the video going viral but his name is not mentioned anywhere in the video. We contacted ‘The Newspaper’ and tried to find out who he was. We were told that his name is Vinay Kumar Singh. Singh is from Delhi who had contested elections from the Janashakti Party (Rashtriya).", "When we looked for him on myneta.info, we discovered that he had contested elections from Patparganj on a Janshakti Party (Rashtriya) ticket in the recent Delhi Assembly Elections of 2020. The entry also has a photo of him along with other information and affidavits on the Election Commission of India website.", "Therefore, Delhi-based Janshakti Party (Rashtriya) leader Vinay Kumar Singh is being misidentified in this viral video as fictional Congress leader Anil Upadhyay.", "Donate Now", "Priyanka Jha specialises in monitoring and researching mis/disinformation at Alt News. She also manages the Alt News Hindi portal.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]