["About this rating", "Being one of George Clooney’s best friends can have some huge financial perks.", "Back in 2017, businessman Rande Gerber told MSNBC about the time when the famed director and actor gifted each of his 14 closest friends— including Gerber — $1 million in cash in suitcases. The story was never confirmed or denied by Clooney himself until a November 2020 interview with GQ.", "The gifting took place in September 2013. Gerber described being invited to dinner at Clooney's house, along with 13 other close friends:", "Sitting in front of each of us at the table is a black Tumi bag, you know, luggage [...] George begins to say, 'Listen, I want you guys to know how much you've meant to me, and how much you mean to me in my life. I came to L.A., I slept on your couch. I'm so fortunate in my life to have all of you, and I couldn't be where I am today without all of you. So, it was really important to me that, while we’re still all here together, that I give back.' [...] We open it up, and it's $1 million in $20 bills. Every one of us — 14 of us — got a million dollars. Every single one of us. We were in shock. Like, 'What is this?'", "Clooney's version of the story had the same details. He described it as a moment where he wanted to express his gratitude to his friends for helping him when he was in need:", "But in 2013, he didn't yet have a family, nor any real idea or hope that someday he would. “And I thought, what I do have are these guys who've all, over a period of 35 years, helped me in one way or another. I've slept on their couches when I was broke. They loaned me money when I was broke. They helped me when I needed help over the years. And I've helped them over the years. We're all good friends. And I thought, you know, without them I don't have any of this. And we're all really close, and I just thought basically if I get hit by a bus, they're all in the will. So why the fuck am I waiting to get hit by a bus?”", "Clooney then arranged for the money to be given in cash, and even bought the bags to place the cash in:", "[...] Clooney did some research, and what he found was that in downtown Los Angeles, in an undisclosed location, there is a place you can go, “and they have giant pallets of cash.” So Clooney got an old beat-up van that said “Florist” on it, like he was in a heist movie, and he drove downtown, and he got in an elevator with the florist's van, and he took the van down to the vault and loaded it up with cash. He told no one but his assistant “and a couple of security guys that were shitting themselves. And we brought it up, and I bought 14 Tumi bags, and then I packed in a million bucks, cash, which isn't as much as you think it is, weight-wise, into these Tumi bags.”", "The next day he had all his friends come over. “And I just held up a map and I just pointed to all the places I got to go in the world and all the things I've gotten to see because of them. And I said, ‘How do you repay people like that?’ And I said, ‘Oh, well: How about a million bucks?’", "Since Clooney himself confirmed the story, three years after Gerber first brought it to public attention, we rate this claim as “True.”", "Nur Nasreen Ibrahim is a reporter with experience working in television, international news coverage, fact checking, and creative writing.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]