["The photo was published in this Facebook post on August 28, 2019.", "The Tagalog language caption says: “Give praise to our next president in 2022! Inday Sarah”, referring to Sara Duterte using a popular nickname.", "Below is a screenshot of the misleading post:", "The image shows Donald Trump holding a photo of Duterte which is captioned: “Sara Duterte The Next Philippines President 2022”. Above Duterte’s photo, it states; “no record of corruptions”.", "Sara has been seen as a possible presidential contender for 2022 after midterm elections where majority of the candidates endorsed by her regional political party Hugpong ng Pagbabago won their seats.", "The same photo was also published on Facebook here with a similar claim.", "The claim is false; the photo has been doctored from a 2015 photo of Trump, before he became president.", "The original photo was a Getty Images picture showing Trump pledging his support for the Republican nominee for the White House if he had failed to win the nomination.", "A reverse search on Google led to the original photo published by Getty Images here on September 3, 2015.", "Below is a screenshot of the photo in the Getty Images website:", "The photo’s caption states: “NEW YORK, NY - SEPTEMBER 03: GOP presidential front-runner Donald Trump holds up a pledge at a news conference in Manhattan after he signed the pledge Thursday to support the Republican nominee in the 2016 general election, ruling out a third-party or independent run on September 3, 2015 in New York City. Trump made the announcement following a meeting with Republican National Committee chairman Reince Priebus. Trump stressed repeatedly in the news conference that he is leading in all national polls. (Photo by Spencer Platt/Getty Images)”.", "The Guardian reported on Trump’s pledge in this article published on September 3, 2015.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]