["About this rating", "Kathy Strouse, a lead investigator into the dog fighting ring run by Michael Vick, quoted the former NFL quarterback saying: \"Yeah, fine. I killed the dogs. I hung them. I slammed them. I killed all of them. I lost fucking millions over some fucking dogs.\"", "Strouse is the sole source for this quote, and we have found no corroborating evidence from Vick himself or anyone else that he said exactly those words.", "In November 2019, the NFL announced that former football player Michael Vick would serve as one of the captains for the 2020 Pro Bowl. The news drew some online outrage because some fans were unhappy to see Vick, who was charged with running a dog fighting ring in 2007, being honored in this fashion by the league.", "As the outrage grew, a quote supposedly uttered by Vick started to recirculate on social media: \"Yeah, fine, I killed the dogs. I hung them. I slammed them. I killed all of them. I lost fucking millions all over some fucking dogs.\"", "This quote comes from a 2009 book published by Kathy Strouse, a lead investigator with the Virginia Animal Control Association who helped uncover Vick's dog fighting ring, entitled \"Badd Newz: The Untold Story of the Michael Vick Dog Fighting Case.\"", "Strouse writes that Vick uttered the above-displayed phrase shortly after taking a polygraph examination administered by the FBI. When the investigators informed Vick that he had failed the test, he reportedly said, \"Yeah, fine, I killed the dogs. I hung them. I slammed them. I killed all of them. I lost fucking millions all over some fucking dogs\" before being ushered away by his attorneys.", "The relevant paragraph from Strouse's book is highlighted below:", "Strouse would certainly be a person with firsthand knowledge of the going-ons in Vick's case, and we don't have reason to doubt her credibility. However, it appears that this book is the sole source for this quote and we have thus far been unable to reach Strouse to ask whether she witnessed Vick saying it firsthand or learned of it from a secondary source.", "While we have been unable to find other reports mentioning this specific wording, we did find several articles that discussed Vick's failed polygraph test. Those reports noted that Vick admitted to killing the dogs himself and offered some insight into Vick's mental state during the process.", "The New York Times reported in 2007:", "Vick, at one point, had admitted only to handing dogs over to Phillips and Peace, who then killed them. But prosecutors said Vick, after taking a polygraph test in October, admitted to a more active role. “I carried a dog over to Quanis Phillips, who tied a rope around its neck,” Vick said, according to Gill. “I dropped the dog.”", "Vick also lied about his drug use, Hudson said, after testing positive for marijuana in September, which violated the conditions of his release.", "Billy Martin, Vick’s lead lawyer, asked for leniency in the sentencing.", "Martin said that Vick admitted to an investigator that he killed dogs only as a means to end a frustrating five-hour session of questioning.", "“I did it all. I did everything. If you need me to say more, I’ll say more,” Martin said Vick told an investigator.", "Vick was sentenced to 23 months in prison for his role in a dog fighting operation. U.S. District Court Judge Henry E. Hudson said that Vick received the strict sentence (which exceeded the 12-to-18 months recommended by prosecutors) in part because he had not been forthcoming during the investigation about his role in the dog fighting operation.", "Sports Illustrated reported:", "In Monday's hearing, Assistant U.S. Attorney Michael Gill revealed that even after reaching his plea agreement, Vick \"denied actually having hands-on involvement in the killing of dogs.\" He maintained that stance for weeks, claiming that co-conspirators Quanis Phillips and Purnell Peace hung and drowned the dogs.", "But then Vick was given a polygraph on Oct. 12, administered by the FBI, and he was evasive when asked about his role in the killings. Near the end of the examination, as he was pressed on the issue, Vick reportedly said, \"If you want me to admit it, I did it all. I did everything.\" Finally, he explained his role: \"I carried a dog over to Phillips, who tied a rope around its neck. I dropped the dog.\"", "It was a disturbing admission and, for federal Judge Henry Hudson, it took too long to come. Vick had to fail a lie detector test to finally admit he did more than stand by as his minions killed animals that didn't want to fight for them. Only then was he truly \"forthcoming\" and \"honest\" and \"contrite.\"", "Strouse, Kathy.   \"Badd Newz: The Untold Story of the Michael Vick Dog Fighting Case.\"  \r\n  Dog Fighting Investigation Publications.   November 2009.", "Dohrmann, George.   \"The Cold, Hard Truth.\"\r\n    Sports Illustrated.   10 December 2007.", "Chufo, Veronica. \"Signs Point to Dog Fights at Vick House.\"\r\n    Daily Press.   17 May 2007.", "Macur, Juliet.   \"Vick Receives 23 Months and a Lecture.\"\r\n    The New York Times.   11 December 2007.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]