["“If you've worked during the Covid19 pandemic, FEMA has finally authorized 1 time hazard pay compensation payments up to $4800.00 per person,” claim posts that have been circulating on Facebook since July 16, 2020.", "The claim also circulated in Spanish, here and here.", "The posts claim to offer a direct link to apply for funds, but the webpage is not a FEMA site and clicking on the link brings up a photo of a gorilla making an offensive gesture.", "Warning : Offensive Content", "Show", "Hide", "While some Facebook pages, such as Cop Humor, shared the post as a joke, it was not as clearly shared in jest by other accounts.", "The posts circulated as Congress is debating a second stimulus bill aimed at countering the devastating economic impact of the coronavirus and resulting lockdowns, with both Republicans and Democrats favoring additional individual relief payments amid soaring numbers of cases.", "The Coronavirus Aid, Relief, and Economic Security Act, which was signed into law by President Donald Trump on March 27, 2020, provided individual payments “of up to $1,200 per individual and an additional $500 per child, subject to limits based on adjusted gross income.”", "The more than $2 trillion economic relief package is overseen by the US Department of the Treasury, not FEMA.", "The official FEMA coronavirus webpage does not make any mention of direct relief payments to individuals. Rather, it details assistance for individuals who need to purchase flood insurance and who live in the agency's temporary housing units.", "FEMA also has a “Coronavirus Rumor Control” webpage that warns: “Scammers are using COVID-19 to take advantage of people. Don’t trust anyone who tells you they can get you money now.”", "According to the US Department of Labor, hazard pay is awarded “for performing hazardous duty or work involving physical hardship.”", "Some retailers offered front-line workers a boost in pay to stay on the job during stay-at -home orders, but many of those programs ended after a few months. The state of Pennsylvania also set up a grant program allowing employers to apply for funds to offer salary increases to essential workers.", "However, the Fair Labor Standards Act (FLSA), which establishes minimum wage and overtime pay, among other provisions, does not specifically address the topic of hazard pay, and there was no federal offer of such compensation during the pandemic.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]