["Deaths in fires increased by 20% last year.", "Correct.", "There are 11,000 fewer firefighters in England than there were in 2010.", "This figure seems to refer to the reduction in all staff working for fire and rescue services in England. There are 6,800 fewer firefighters in England than there were in 2010.", "“Under this Government, there are now 11,000 fewer firefighters in England than there were in 2010, and deaths in fires increased by 20% last year.”", "Jeremy Corbyn, 15 November 2017", "The number of firefighters in England has decreased by around 6,800 since 2010, and by 8,600 including those who only work as on-call firefighters when needed. The number of staff working for fire and rescue services has decreased by around 11,500 over the same period.", "The number of fire-related deaths increased by 20% last year to 346, according to the latest statistics. That included an estimated 80 deaths in the Grenfell Tower tragedy in June 2017. Since the statistics were published the Metropolitan Police has revised the death toll in that fire to 71.", "The number of fire-related deaths had generally been decreasing from 2002 until 2014. Since 2015, the number of fire-related deaths in England has increased. The Home Office has said that these figures can fluctuate year-on-year.", "Honesty in public debate matters", "You can help us take action – and get our regular free email", "I’m in", "There were just under 11,500 fewer full-time equivalent staff working for fire and rescue authorities across England in March 2017 compared with March 2010. That’s a fall of 22%.", "Full-time equivalent is the number of staff there would be if you added together all their hours to create only full-time jobs. So for example two people working half a week each would add up to one full-time equivalent job.", "This figure includes all staff working in fire and rescue, not just those who are firefighters.", "Looking at firefighters specifically there are two different groups to count, those working as firefighters as a main job (wholetime) and those working as on-call firefighters when needed. There were 6,800 fewer FTE wholetime firefighters in 2017 compared to 2010. The number of people working as on-call firefighters has also decreased over that time by around 1,800.", "Altogether the number of people working as firefighters in any capacity has decreased by 8,600 FTE since 2010.", "The latest figures from the Home Office show that there were 346 fire-related deaths in England in the 12 months to June 2017. That’s a 20% increase compared to the year before (when there were 289) and the highest it has been since 2009.", "A fire-related death is one that would not have occurred if there hadn’t been a fire. It includes deaths as a direct or indirect result of injuries in a fire.", "These figures include an estimated 80 deaths in the Grenfell Tower fire on 14 June 2017. Since the figures were published, the Metropolitan Police has revised the death toll of the Grenfell Tower fire to 71.", "The number of fire-related deaths was decreasing until 2014. Since then it has seemed to level out or increase. The Home Office says that the data can fluctuate year-on-year because of the relatively low numbers of fire-related fatalities. The trend also varies depending on the point in the year you look at. For example, if you look at the figures for fire-related deaths in the year ending March (rather than June) then there was an increase in 2015/16 compared to the year before, but in 2016/17 the number of fire-related deaths decreased again.", "The Home Office has recently looked at what factors can cause the number of fire-related fatalities to increase or decrease.", "Decreasing numbers of fire-related deaths can be linked to things like decreasing use of chip pans, a fall in smoking and in drug and alcohol consumption, increasing use of smoke alarms and preventative work by fire and rescue services. It also linked increasing numbers of fire-related deaths to an aging population (with older people more likely to die in a fire) and increased overcrowding. The Home Office concludes that “the cumulative impact appears to be that the downward pressures have exerted the most influence, resulting in an overall reduction [in fires and fire-related deaths] over the last decade.”", "The Fire Brigades Union previously pointed to reduced resources and increasing response times as reasons behind the rise in deaths.", "We’ve previously looked at what’s happened to funding for fire authorities in more detail here.", "Full Fact fights for good, reliable information in the media, online, and in politics.", "Bad information ruins lives. It promotes hate, damages people’s health, and hurts democracy. You deserve better.", "Full Fact, 17 Oval Way, London, SE11 5RR", "Full Fact is a registered charity (no. 1158683) and a non-profit company (no. 06975984) limited by guarantee and registered in England and Wales. © Copyright 2010-2023 Full Fact. Thanks to Bytemark for donating our web hosting.\n                        \n                        Privacy, terms and conditions."]