["“Have you noticed gas prices lately? We’ve already returned to the highest gas prices since the Obama administration in many places. Thanks, Biden!” says a February 2 tweet that has been liked more than 38,000 times.", "Screenshots of the tweet were then shared on Facebook here and on Instagram here.", "Although the tweet does not specify which “places” it is referring to, it was posted by country music artist Travis Tritt, who lives in the state of Georgia.", "The US national average on February 2 was 2.42 dollars per gallon and the daily average in Georgia was 2.24 dollars per gallon, according to data provided by AAA (American Automobile Association). The averages from one year before, nationally and statewide, were higher, at 2.47 and 2.31 dollars per gallon respectively.", "A look at historical weekly gas prices per gallon, collected by the US Energy Information Administration, also shows that the national average reached 2.96 dollars per gallon in the last week of May 2018 under Donald Trump’s administration, much higher than the current average under Biden.", "In comparison, for the first two weeks of February 2021, the national weekly averages were 2.41 and 2.46 dollars per gallon respectively, the highest since March 2020 -- when the novel coronavirus was declared a global pandemic.", "The gas price rebound in the early days of February came during a surge in the cost of oil that marked a turnaround for the crude market, which has been in a year-long slump.", "But this year’s fluctuations in gas prices have not been caused by US policy enacted by Biden.", "“It is not true that gas prices are the highest since Obama,” Patrick De Haan, Head of Petroleum Analysis at GasBuddy.com, a website that tracks prices in all 50 states, told AFP via email.", "“Much of Trump’s time in office we saw prices in the $2.25-$2.75 range, but Trump can’t take credit as this was brought on by increases in US oil production which predated him,” he added.", "“The rise in prices is a function of the recovering demand for gasoline as the nation mends from Covid-19 and adapts,” De Haan said.", "Sector analyses by De Haan published on February 1 and February 8, 2021 also placed optimism about the coronavirus situation at the foundation of the steady rise of prices at the pump.", "And according to government data released on February 10, despite gasoline prices rising again in January, they remained well below last year’s level.", "Another Facebook post published on February 16, 2021 -- also shared on Twitter, here -- comparing receipts of diesel prices in the city of Decatur, Texas shows an increase between December 2020 with “Trump in office” and February 2021 with “Biden in office.”", "Although prices at the pump have been up in the southern state, it is an “unfair assumption” to think it is due to the new administration, De Haan explained, adding it is linked to the coronavirus recovery.", "A look at historical prices for diesel in Texas on the date of the receipt -- February 12, 2021 -- shows the price for a gallon of diesel statewide on February 12, 2020, was 2.60 dollars, higher than a year later at 2.42 dollars, according to data provided by AAA.", "On December 3, 2020 -- the date mentioned on the other receipt in the photo -- the price for a gallon of diesel, statewide, was 2.07 dollars. The agency does not provide data specific to counties or cities.", "An additional post, shared more than 4,000 times on Facebook since February 20, 2021, also claimed that gas prices “are at $2.59! Last year this time they were $1.52,” while sarcastically thanking Biden. The person who shared the claim says in his profile that he is based in Shreveport, in the US state of Louisiana.", "Based on that location, the numbers in the post do not add up. According to AAA data, the daily price per gallon of unleaded gas on February 20, 2021 statewide was 2.3 dollars, while that same day a year before, it was at 2.13 dollars per gallon.", "Sara Vakhshouri, president of energy consultancy at SVB Energy International, explained that “because of the pandemic, lower demand, lower oil prices and severe Capex (capital expenditures) cut among the producers, US natural gas production and LNG (liquefied natural gas) exports reduced,” which, in turn, all contributed to higher prices.", "AAA forecasts that gas prices will continue climbing in February.", "“Gas prices are increasing due to expensive crude oil, which accounts for more than 50% of the retail price. Crude is pricing at $56/bbl (barrel), a price point not seen since January 2020,” said AAA spokeswoman Jeanette Casselano McGee.", "She added that prices rose as high as 3.93 dollars per gallon while Obama was in office, while the price on February 11, 2021 was 2.49 dollars per gallon.", "“US oil and gas stocks, by far the worst performers of last year, are standing out as the best in 2021,” energy and security analyst Patricia Schouker said by email. “A booming rally in oil markets has pushed crude prices to their highest levels since near the start of the coronavirus pandemic, powered by production curbs and recovering demand.”", "Schouker added that presidents have “‘very little direct influence” over gas prices.", "As examples, the analyst cited big price movements during the respective tenures of George W. Bush and Obama. “President Bush’s energy policies weren’t responsible for gasoline prices being below $2/gallon in 2009. Nor did President Obama’s energy policies cause gasoline prices to fall in 2015 and 2016.”", "“Because of the massive drop in fuel consumption related to the pandemic that has only partly come back, gasoline demand dropped 5.7 percent comparing President Trump’s first week in office to his last. Again, it comes down to supply and demand,” she said.", "With the economic activity sharply reduced nationally and across the globe throughout 2020, petroleum prices fluctuation heavily impacted the whole energy sector, from the barrel to the prices at the pump for consumers.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]