["Multiple posts, for example this one published to Facebook on June 13, 2019, and shared more than 150 times since, contain two photos of a light-blue building being razed by men wearing skullcaps and holding sledgehammers.", "The Hindi-language caption translates into English as: “In Sri Lanka, Muslims are themselves destroying a mosque and converting to Hindu religion. Muslims say that they have now understood the reality of abomination and hatred in the religion.”", "It was published around two months after multiple suicide bombings in Sri Lanka on April 21, 2019, which left more than 250 people dead. Here is an AFP report about the attacks.", "Below is a screenshot of the misleading Facebook post:", "The same photos and claim have been posted elsewhere on Facebook, for example here, and on Twitter, for example here.", "A reverse image search on Google found the same photos appeared in this article published May 29, 2019, on the website of Sri Lankan newspaper the Daily Mirror.", "The report is headlined “NTJ mosque in Kekirawa demolished by Muslims” and its first paragraph says:", "“A mosque used by the National Thawheed Jama'at (NTJ) at Madatugama in Kekirawa was yesterday demolished by the area Muslims and devotees of the main mosque.”", "Kekirawa is a town in north-central Sri Lanka. National Thowheeth Jama'ath is an extremist group named by Sri Lankan authorities as the perpetrators of the Easter Sunday bombings. Here is an AFP report dated April 27, 2019, which says the NTJ has been banned.", "Below is a screenshot of the Daily Mirror report:", "Other local media reported on the mosque’s demolition, for example here and here, and the Daily Mirror also published this video of the event on its verified YouTube page.", "The media reports do not state that the Muslims involved in destroying the mosque also converted to Hinduism.", "Kekirawa Police Officer-In-Charge Thilak Bandara Ganegoda told AFP: “No religious conversions took place.”", "“The land was previously allocated to construct a children's library and was handed over to its rightful owner”, he added.", "The mosque’s chairman M H M Akbar Khan, who led the movement to tear down the building, also told AFP: “It was not demolished because of any link between that building and the NTJ or because any religious conversion took place.\"", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]