["About this rating", "The Centers for Disease Control and Prevention analyzed American Red Cross blood donations for SARS-CoV-2 antibodies between Dec. 13, 2019, and Jan. 17, 2020, and found evidence of the virus in 1.1% of blood donations. This suggested that coronavirus infections may have been present in the U.S. in December 2019, earlier than scientists previously thought.", "The presence of the novel coronavirus in the U.S. in December does not mean that COVID-19 was spreading widely at the time. Also, the study had limitations of note, including the possibility of false-positive antibody tests.", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "A study published in November 2020 may have shifted the timeline of the U.S. arrival of the novel coronavirus responsible for the COVID-19 pandemic. According to research conducted by the Centers for Disease Control (CDC) and the American Red Cross, SARS-CoV-2 may have been present in American populations as early as December 2019.", "The findings were published on Nov. 30 in the journal Clinical Infectious Diseases, and were subsequently reported on by a number of reputable media publications. Results sparked uncertainty by some social media users who proposed that they had perhaps been infected by the novel coronavirus before U.S. health officials had recognized it was present in U.S. residents.", "While it is true that researchers found SARS-CoV-2 antibodies in U.S. blood supplies as early as Dec. 13, 2019, important caveats should be noted, including that the presence of the virus in the U.S. at the time does not mean it was spreading at the community level. Snopes readers asked our team to dive into the study and its limitations. But first, some background on the pandemic.", "SARS-CoV-2 was first recognized in Wuhan, China, in December 2019, and the World Health Organization (WHO) was first notified of a cluster of pneumonia-like cases on Dec. 31. In the weeks that followed, the virus spread across the planet. Later, it was confirmed that a patient was hospitalized with SARS-CoV-2 in Wuhan on Dec. 1, 2019. COVID-19 infection was first identified in the U.S. on Jan. 19, 2020, when a person returned from China, but tracing indicates there were at least two other cases in the country by Jan. 14.", "Research conducted by the CDC and American Red Cross suggested that the virus had been initiated into the U.S earlier than thought, but the widespread transmission was not likely until February.", "In order to determine more specifically when SARS-CoV-2 first appeared in the U.S., scientists conducted serological testing of 7,398 routine unidentified blood samples collected by the Red Cross between Dec. 13, 2019, and Jan. 17, 2020, taken from donors in nine states. Serologic testing — essentially an antibody test — confirmed the presence of antibodies specific to SARS-CoV-2 in order to estimate when the virus was introduced into a population and estimate how many people had already been infected with the virus.", "“An antibody test looks for the presence of antibodies, which are specific proteins made in response to infections,” wrote the agency. “Antibodies are typically detected in the blood of people who are tested after infection; they show an immune response to the infection. Antibody test results are especially important for detecting previous infections in people who had few or no symptoms.”", "The coronaviruses owe their name to crown-like projections, which are colorized and visible here under a microscope. BSIP/Contributor", "In part, serologic testing may employ immunological memory, which is the ability of the immune system to respond quickly and effectively to pathogens that it had been exposed to previously.", "Antibodies that reacted to the virus were found in about 1.1% of blood samples collected in all nine states — or just 84 individuals. But when it was present varies. Samples indicated that SARS-CoV-2 was present in California, Oregon, and Washington as early as Dec. 13 to 16, 2019 and in Connecticut, Iowa, Massachusetts, Michigan, Rhode Island, and Wisconsin between Dec. 30, 2019, and Jan. 17, 2020. But because the percentage of infected overall blood samples was very low, it is thought that the virus was not widespread at that time.", "“The presence of these serum antibodies indicate that isolated SARS-CoV-2 infections may have occurred in the western portion of the United States earlier than previously recognized or that a small portion of the population may have pre-existing antibodies that bind SARS-CoV-2,\" the study authors wrote.", "While the findings suggested that the virus may have been present in the U.S. much earlier than previously believed, it is not possible to know whether the infection was spread through the community or associated with travel.", "“It is not possible to determine whether the potential SARS-CoV-2 infections suggested by this study may have been community or travel-associated,” said Dr. Susan Stramer, vice president of Scientific Affairs at the American Red Cross, in a news release. “A previous survey of blood donors, conducted to help understand travel practices, determined that less than 3% of respondents reported travel outside of the U.S. within the 28 days prior to donation, and of those reporting travel, only 5% traveled to Asia.", "Though the tests were looking for SARS-CoV-2 antibodies specifically, there are seven known types of other coronaviruses that have some similarities, so it is possible a level of cross-reactivity occurred. According to the Virginia Department of Health, most people become infected with coronaviruses that cause the common cold at some point during their lives. And because the blood samples were anonymous to researchers, none could be considered “true positives” — this can only be determined from a person who had received a positive molecular diagnostic test.", "Furthermore, donations may also not represent all blood donors or donations in these states, so they cannot be used to generalize all blood donors during the dates in the report and cannot make an inference on national or state levels of infection rates during the study period.", "In closing, the study authors said that they will continue to work with federal and non-governmental partners to conduct surveillance using blood donations and test clinical lab samples specific to SARS-CoV-2 to characterize the spread of infection across the U.S.", "“Understanding the dynamics of SARS-CoV-2 pandemic from early introduction throughout further progression will advance understanding of the epidemiology of this novel virus and inform [the] allocation of resources and public health prevention interventions to mitigate morbidity and mortality associated with COVID-19,” concluded the authors.", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]