["About this rating", "On 19 June 2016, Rep. Paul Ryan of Wisconsin, a Republican who currently serves as Speaker of the House and will be chairing the Republican National Convention in Cleveland from July 18–21, appeared on the Meet the Press public affairs program.  During that appearance, Speaker Ryan was questioned at length by interviewer Chuck Todd about the possibility of a \"Dump Trump\" movement among Republicans that would seek to deny the Republican presidential nomination to Donald Trump at the convention despite Trump's having already secured enough delegates to guarantee a first-ballot win.", "Chuck Todd opened the segment of the program featuring Ryan with the following introduction:", "Good Sunday morning and happy Father's Day to all fathers out there. Like a canceled TV show, back for summer reruns, the Dump Trump movement has sprung back to life. Why? Well, just look at what's happened in the past week. Item one, in the wake of Orlando, Donald Trump's self-congratulatory tweeting and suggestion that President Obama may be in league with ISIS were universally criticized.", "Item two, our NBC News|SurveyMonkey poll among other polls is showing a sharp trend towards Hillary Clinton with Clinton now leading Trump by seven points in our poll, 49, 42. Item three, right now, while Trump is raising money and campaigning in states that haven't voted Democratic in at least a generation, Hillary Clinton is up on the air with a $23 million, two-week advertising blitz in eight swing states.", "\"But don't worry,\" Donald Trump says, he hasn't yet started the general election campaign. And item four, Speaker of the House Paul Ryan, whose interview with me you'll see in just a moment — essentially is giving fellow Republicans a permission slip to vote their conscience and run away from Trump if they have to.", "Well, Trump reacted strongly to Ryan, and our follow-up conversation with him is coming up in a few minutes. But first, all of this is inspiring talk among jittery Republicans of yet another last-ditch effort to keep Trump from becoming the official nominee.", "Ryan's response to Todd's questioning might have been somewhat confusing to viewers following the current campaign drama.  Ryan had previously called Donald Trump a \"racist\" and denounced Trump's rhetoric and proposals, yet he endorsed Trump and has so far declined to rescind that endorsement.  But at no time during that June 2016 Meet the Press interview did Ryan state that \"I don't care if Trump destroys the United States and that he is a liar and a fraud as long as we win in November\" (the image shown above reflects someone else's partisan summary of what he said), and Chuck Todd opened the program by declaring that Ryan was \"essentially giving fellow Republicans a permission slip to vote their conscience and run away from Trump if they have to.\"", "But what Ryan repeatedly maintained during that interview was that it was not his place (as Speaker of the House or RNC chairman) to attempt to take the nomination away from a candidate who had secured it under the party's existing rules and procedures; that he would opt (in Todd's words) to \"keep his party united [rather than] reject a presidential candidate whose values he does not share\":", "Well, first of all I feel like I have certain responsibilities, as not just Congressman Paul Ryan from the first district of Wisconsin, but as Speaker of the House. And imagine the Speaker of the House not supporting the duly elected nominee of our party, therefore creating a chasm in our party to split us in half, which basically helps deny us the White House, and strong majorities in Congress.", "The last thing I want to see happen is another Democrat in the White House. I don't want see Hillary Clinton as president. I want to see a strong majority in the House and the Senate. And I think the way to achieve those goals is to have a more unified party, than a disunified party. Now having said that, you know me well, Chuck. If something is done and said that I don't agree with that I think puts a bad label on conservatism, then I'm going to speak out on it as I have, as I will continue to do, and I hope I don't have to keep doing.", "[Trump] won the election. The voters voted for him. That's the point. He's winning. He won the delegates. That's the choice they made. This isn't a top-down party where a handful of people pick our nominee, and the president. the voters picked him. That's the choice they made. We — What can I control? That's not something I can control.", "As Speaker of the House what I can control is, can I help add substance to this conversation? Can I bring ideas to the table? Can I lead the House Republicans to take our conservative principles, and apply them to the problems of the day to give people solutions that improve their lives, and try and inject some substance into this conversation, bring an agenda to the country?", "That's what we're doing.", "So here's what I worry about, Chuck. I don't worry everyday about what Donald Trump says and does. I worry about what I can do to help make this a better country, to help improve things, to help make this campaign one more about substance, and ideas. And that's what we're doing here as House Republicans. Go to \"better-job-dot-GOP,\" look at our Better Way Agenda that we're rolling out. We're trying to add some substance to this conversation, so that people know where we're trying to go to get this country fixed.", "I'm Speaker of the House Paul Ryan. And that's who I am. And that's my responsibility.", "I'm not going to go into the hypotheticals. I have a responsibility. And that is to not try and disunify our party, and disrespect the voters — the Republican Primary Voters of America. And what I can control is can we add ideas. Can we add solutions? Can we bring substance to this conversation? The kind of election that I really want to have, that I wish we had in 2012, and prior years, is give the country a clear choice ...", "My place is because of again this role I have, which I feel has very important responsibilities, is to call balls and strikes, and just play it by the rules. So it is not my job to tell delegates what to do, what not to do, or to weigh in on things like that. They write the rules. They make their decisions.", "All I want to make sure is that [the nomination is] done above board clearly, honestly, and by the rules. So I see my role now given that he's got the plurality, he actually won, is pretty much a ceremonial position. But the last thing I'm going to do is weigh in, and tell delegates what to do — how to do their jobs.", "Some pundits have contended that Ryan will not disavow or roll back his support for Trump (no matter how much he might dislike or disagree with Trump) because he wants to see the Republicans take control of the government, but that's a speculative interpretation of Ryan's state of mind, not something Ryan has openly stated:", "The fact that House Speaker Paul Ryan will not rescind his support for a candidate he has called “racist” clashes badly with the image of Ryan the press has helped create. When Chuck Todd interviewed Ryan on Meet the Press, he sounded exasperated and puzzled in equal measure. Given Ryan’s denunciations of Donald Trump’s racist rhetoric and proposals, Todd pressed him, “How are you comfortable still supporting him?”", "Ryan’s rationale was practically tautological: “Imagine the Speaker of the House not supporting the duly elected nominee of our party, therefore creating a chasm in our party to split us in half, which basically helps deny us the White House and strong majorities in Congress,” he said, despite growing evidence that Trump’s candidacy will make winning the White House and holding onto strong Republican majorities next to impossible even with Ryan in his corner.", "“You just made a case though of party over country,” Todd said. “No, I didn’t,” Ryan replied.", "For a man as close to achieving what no conservative in the history of the movement has achieved, Ryan’s crass expediency isn’t nearly as baffling as it seems. His plan for igniting a conservative revolution has always been fairly straightforward: First, Republicans have to win control of government, and then they can ignite a conservative revolution.", "Interested viewers can watch the entire Meet the Press program in question here:", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]