["The super PAC supporting former Florida Gov. Jeb Bush is trying to counter a perceived challenge for moderate New Hampshire voters from Ohio Gov. John Kasich.", "The PAC, Right to Rise, is airing an ad in New Hampshire that declares Kasich \"wrong on New Hampshire issues.\" It’s run at least 284 times on Boston television since Jan. 21, according to the Internet Archive’s Political Ad Tracker.", "The 30-second ad makes a number of claims, but we decided to focus on one surrounding spending. The ad claims Kasich had \"the worst rating on spending of any governor in the country, Republican or Democrat.\"", "That’s a potentially devastating claim, especially since Kasich is selling the economic turnaround in Ohio as part of his presidential resume. It in large part hinges on Kasich’s decision to expand Medicaid in the state as part of President Barack Obama’s health care law.", "Where the claim comes from", "Right to Rise isn’t pulling its claim out of the air.", "The super PAC is accurately citing a report by the libertarian Cato Institute. Cato’s report, entitled Fiscal Policy Report Card on America’s Governors 2014, attempts to compare 48 of the nation’s governors on a number of fiscal measures. (Virginia and Alaska were excluded.)", "Overall, Kasich earned a score of 44, which Cato translated to a D. Only 12 Democrats, and no Republicans, scored lower.", "But Right to Rise is focusing on one subcategory of the overall scorecard, which measures spending changes. On that score, Kasich indeed finished dead last -- with a total of six. Cato found that Ohio proposed 5.7 percent growth in per capita spending and ended up with 8 percent growth in actual per capita spending.", "In its report, Cato makes clear that the spending measures we just cited -- proposed per capita spending and actual per capita spending -- are only for general fund budgets, which Cato describes as \"the budgets that governors have the most control over.\" Proposed per capita spending is measured through fiscal year 2015, and actual per capita spending is measured through fiscal 2014.", "As wonky as that previous paragraph sounds, that makes all the difference in assessing the validity of Cato’s report, Kasich’s rebuttal, and ultimately Right to Rise’s claim.", "A quick primer on state budgets", "If you’ve followed any state budgeting process, you’ll quickly realize that there are different ways to describe what you call \"the budget.\"", "Cato is honing in on the general fund budget, which is usually the part of the budget that lawmakers and governors have the most power to influence. Generally speaking, this is the money that lawmakers might fight over when it comes to spending on pet projects, or subsidies for sports stadiums, or economic development incentives. Again, generally speaking, general fund spending is the most unencumbered.", "But there are lots of other pots of money that ultimately make up a state budget.", "Road tolls might go into a trust fund where they must be re-invested in road-building projects. A state lottery system might guarantee all its proceeds to education funding. Fees for developers might be dedicated to infrastructure improvements. The federal government might pass millions of dollars to a state for a specific project or need (roads, health care, school lunches).", "That’s all money that the state spends, but lawmakers have fewer levers to pull to try and manage it.", "Kasich’s rebuttal", "Kasich’s campaign offers two rebuttals to the Right to Rise/Cato charge.", "The first deals with how you define the budget. If you expand the budget to include all funds, the spending increases Cato references at 5.7 percent and 8 percent shrink to about 2 percent.", "The second rebuttal involves an accounting change that the Kasich campaign says inflates Cato’s numbers in the first place.", "Kasich officials say Ohio transitioned about $2 billion in spending into the general fund from the overall \"all funds\" budget.", "Analyzing only the general fund budget \"makes this accounting correction erroneously appear to be an increase, when an analysis of all state spending would reveal that total spending didn’t go up as a result of this, and that this move was merely a movement of funds between internal accounting lines,\" the Kasich campaign told PolitiFact.", "State officials told the Columbus Dispatch that the accounting shift came when the state moved a large chunk of Medicaid spending from the all-funds budget to the general revenue fund. The money, tied to Medicaid expansion as part of President Barack Obama’s health care law, originally was placed in the \"all-funds\" budget but was moved to the general revenue budget.", "\"That substantially explains …  why the (general revenue fund) grew,\" Timothy S. Keen, Ohio’s director of the state office of budget and management, told the Dispatch. \"It’s not new spending. It’s an accounting change.\"", "Cato’s rebuttal to Kasich’s rebuttal", "This issue, now appearing in the campaign ad, boiled over in August when Kasich was asked about it on Fox News Sunday.", "CHRIS WALLACE: \"Unemployment down from 9.1 percent to 5.2 percent. And the top income tax rate has been lowered from 6.2 percent to 4.9 percent.", "\"But the Cato Institute, a libertarian think tank, gave you a ‘D’ on its government’s (sic) report card just last year, noting the budget grew 13.6 percent in 2014 and that over your time as governor, government jobs have increased 3 percent. A ‘D,’ sir?\"", "KASICH: \"Well, I don’t know who these folks are, Chris, another Washington group. But, look, we have the lowest number of state employees in 30 years and in addition to that, our budget overall is growing by about 2 percent or 3 percent, and our Medicaid growth has gone from 9 percent when I came in to less than 4 percent and no one has been left behind. We haven’t had to cut benefits or throw anybody off the rolls. So, we pay attention to the mentally ill and the drug addicted and the working poor.\"", "Kasich’s criticism prompted a response from Cato.", "Cato looked at the budget in a few new and different ways, including by removing any federal Medicaid contribution from the general revenue budget. That calculation found that Ohio general fund spending increased 3 percent to 5 percent annually from 2013-16.", "\"By using the all-funds number, Kasich is trying to use federal spending to mask the quick increase in general fund spending,\" wrote Cato economist Nicole Kaeding. (Kaeding has since moved on to the pro-business Tax Foundation.) \"Federal spending — besides Medicaid — is not increasing in Ohio that quickly. Kasich has little control over federal spending, but he is using it to hide how much Ohio’s state spending has grown during his tenure.\"", "We asked Chris Edwards, the director of tax policy studies at Cato, what he makes of the Right to Rise attack and Kasich’s rebuttals.", "Edwards agrees that a large part of the spending increase is tied to Kasich’s decision to expand Medicaid.", "\"I understand Kasich says we unfairly used that in our study,\" Edwards said. \"But it’s spending, and he did it.\"", "Our ruling", "In an ad targeted at New Hampshire voters, a super PAC supporting Bush said Kasich had \"the worst rating on spending of any governor in the country, Republican or Democrat.\"", "Right to Rise is accurately citing a portion of a study by the Cato Institute that looked at one measure of spending for 48 of America’s governors in 2014.", "But Kasich disputes the study itself, and correctly notes that there are other ways to measure state spending, and that a shifting of dollars from one part of the budget to another affected the results.", "What to make of it all?", "This reminds us of some previous attempts to look at the spending records of governors running for president. And like in those cases, the result here might be a tad unsatisfying for people seeking clarity. Cato, in our judgment, did nothing to unfairly target Kasich.", "Yet, there is more to Ohio’s particular budget story that may leave viewers with a different impression.", "We rate the claim Half True.", "Right to Rise ad attacking John Kasich, accessed via Internet Archive, Feb. 2, 2016", "Email interview with Paul Lindsay and Matt Wall, Right to Rise, Feb. 2, 2016", "Email interview with Scott Milburn, Kasich campaign, Feb. 2, 2016", "Email interview with Chris Edwards, Cato Institute, Feb. 2, 2016", "Cato Institute, Fiscal Policy Report Card on America’s Governors 2014, accessed Feb. 2, 2016", "Columbus Dispatch, \"Kasich disputes report that claims he dramatically increased state spending,\" Aug. 2, 2015", "Colmbus Dispatch, \"Kasich, libertarian group tussle on Ohio budget numbers,\" Aug.  5, 2015", "Real Clear Politics, Kasich Responds To \"D\" Rating From Cato Institute: \"I Don't Know Who These Folks Are, Another Washington Group?\" Aug. 2, 2015", "Cato Institute, \"Revisiting Kasich’s Record on Spending,\" Aug. 3, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]