["A picture of an Axis Bank cheque has been causing quite a stir on social media recently. The cheque is of the value Rs 35 crore and has been allegedly issued by Vijay Mallya to the Bharatiya Janata Party. Mallya’s purported signature also appears at the bottom. The cheque is dated November 8, 2016. Several users are claiming that the disgraced business tycoon wrote a cheque of Rs. 35 crore to the BJP before he fled the country. Facebook page ‘AggBani’ posted this image with a Punjabi caption, where it received more than 66,000 shares at the time of writing. (Archive link)", "ਇਹ ਕਲਾ ਧੰਨ ਮੋਦੀ ਨੇ ਲਿਆਦਾ ਵੇਖ ਲਉ ਪਾਰਟੀ ਲਈ ਫੰਡ ਲਏ ਤੇ ਹੁਣ ਅੰਨ ਪੈਦਾ ਕਰਨ ਵਾਲੇ ਤੇ ਤਲਵਾਰ ਧਰੀ ਫਿਰਦਾ", "Posted by AggBani on Wednesday, December 23, 2020", "Another Facebook page called ‘Ramaz Punjab di‘ also shared the photo and accompanying claim.", "The picture is viral on both Twitter and Facebook.", "In this article, we will share a few pointers that prove the cheque is fake.", "The cheque is dated November 8, 2016, but the businessman had fled the country on March 2, 2016.", "Furthermore, there are several issues with the cheque itself.", "1. First of all, the full form of BJP is misspelt as ‘Bhartiya Janta Party’ instead of ‘Bharatiya Janata Party’.", "2. Two slanted lines can be seen in the middle of the cheque. No such lines are normally drawn while writing a cheque.", "3. Vijay Mallya’s signature is also fake. We found his real signature online and the two look nothing alike. The real signature can also be seen in one of Mallya’s tweets from June 2018.", "4. The cheque has been issued on behalf of Glamour Steels Private Limited. The directors of this company are Amit Kumar Saxena and Mukesh Kumar.", "In May 2017, AAP leader Kapil Mishra had displayed to the press similar cheques allegedly issued to the Aam Aadmi Party. One of these was from Axis Bank. A comparison of the one shown by Mishra and the viral image confirms that both are, indeed, the same. The only difference is that the cheque issued to the Aam Aadmi Party is not dated.", "5. Furthermore, ‘Thirty Five Crore only’ and ‘35,00,00,00’ have been written in the same handwriting in both.", "On July 18, 2018, Boomlive had published a fact-check report on the cheque.", "A morphed cheque was circulated on social media with the false claim that Vijay Mallya paid the BJP Rs 35 crore before he fled India. This fake cheque was also used by rebel AAP leader Kapil Mishra back in 2017 to target the Aam Aadmi Party.", "Donate Now", "Kinjal Parmar holds a Bachelor of Science in Microbiology. However, her keen interest in journalism, drove her to pursue journalism from the Indian Institute of Mass Communication. At Alt News since 2019, she focuses on authentication of information which includes visual verification, media misreports, examining mis/disinformation across social media. She is the lead video producer at Alt News and manages social media accounts for the organization.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]