["Vincent \"Buddy\" Cianci, an Independent, and Jorge Elorza, a Democrat, both candidates for mayor of Providence (The Providence Journal / Steve Szydlowski and Kris Craig)", "Political candidates seldom recommend raising taxes or implementing new ones. So it caught our ear when Vincent A. \"Buddy\" Cianci Jr., the independent running for mayor of Providence, said during an interview on WHJJ-AM radio that one of his opponents, Democrat Jorge Elorza, wants to impose a municipal income tax.", "During the interview, host Ron St. Pierre asked Cianci, a former mayor of the city, a popular talk show host and twice-convicted felon, how he would try to get undecided voters to consider him. (St. Pierre previously worked with Cianci on his WPRO-AM talk-show.)", "\"Just run a good campaign and talk about the issues and talk about what the city of Providence can be and it should be a learning experience for the city,\" Cianci said.", "Then he added, \"My opponent, for instance, proposes a municipal income tax. . . . He wants to impose a municipal income tax. I think the last thing the City of Providence needs is another tax. It’s going to be simple in this election. If you vote for Elorza, you want an income tax.\"", "A municipal income tax would be a first for Rhode Island.", "We wanted to see if Elorza really wants to impose such a tax.", "During Elorza's successful primary campaign, one of his fellow Democrats, Brett Smiley, criticized Elorza for the same reason. On Aug. 3, Smiley posted a YouTube video of a July 31 interview, in which Elorza, speaking before a group of progressive Democrats, pledges to advocate for more state aid for Providence.", "Then he says, \"In conversations that we've had before, I've mentioned that I am very much in support of a municipal income tax.\"", "Cianci told us that was the video he was relying on.", "But in the 44-second clip, Elorza also makes it clear that he supports the idea of using a municipal income tax to replace other taxes. He never says he’s proposing it nor wants to impose it.", "\"It's been tried in many, many cities throughout the country and it's functioning effectively and it's much more progressive than what we have right now, where folks are paying so much for car taxes, real estate taxes and so many other taxes,\" he said. \"So I certainly am committed and I certainly support more progressive tax policies.\"", "(A progressive tax is designed to be less of a burden on the people who are least able to pay for it. In contrast, a regressive tax, such as a sales tax, tends to place a greater burden on people who are least able to pay.)", "We asked Cianci about the rest of Elorza's statement.", "Cianci said the video raised many unanswered questions about a municipal income tax, including which taxes it would replace.", "\"There are no facts. He's just saying he's considering it very strongly. The mere fact that he's proposing it is an anathema,\" said Cianci. \"We don't need new taxes. We need to lower the ones we have.\"", "After PolitiFact Rhode Island began inquiring about the video, it was removed.", "Elorza told us his statement in the YouTube video was taken out of context.", "\"It’s absolutely been misconstrued. I have never proposed a municipal income tax. To say I proposed a municipal income tax is flat out wrong.\"", "Elorza said that during the video interview, \"I had just finished saying I am not raising taxes … I was asked a direct question about how I felt about the municipal income tax. I said I’m supportive of the idea, supportive of the concept.\"", "Elorza was unable to provide the full video, but he pointed to a statement he made in a six-item questionnaire from the Greater Providence Chamber of Commerce on Aug. 18 in which he was asked if he would oppose the adoption of a municipal tax.", "It was the one question where he didn't check Yes or No. But he did offer this comment: \"Raising taxes in Providence is not an option, period. I have said this repeatedly throughout the campaign. Some states and municipalities around the country have adopted municipal income taxes as an alternative to raising revenues through property or excise taxes.", "\"I like the concept of a municipal income tax, but whether it makes sense for Providence is a different question. This type of sweeping reform is not a part of my platform, and I will not make it part of my agenda as Mayor.\"", "Our ruling", "Vincent \"Buddy\" Cianci said Jorge Elorza \"wants to impose a municipal income tax.\"", "Elorza has said he favors the tax in the context of using it to replace other taxes that he regards as less fair. But he has also made it clear that raising taxes in the city is not an option and has said it would not be part of his agenda.", "We found no evidence that Elorza wants to impose a municipal income tax.", "We rate Cianci’s claim False.", "(If you have a claim you’d like PolitiFact Rhode Island to check, email us at [email protected]. And follow us on Twitter: @politifactri.)", "920WHJJ.com, \"PODCAST: Buddy Cianci Kicks Off Mayoral Campaign,\" Sept. 10, 2014, accessed Sept. 10, 2014", "ProvidenceChamber.com, Candidate questionnaire - Jorge Elorza, Greater Providence Chamber of Commerce, questionnaire dated Aug. 18, 2014, accessed Sept. 10, 2014", "Interviews, Vincent A. Cianci Jr., candidate for mayor of Providence, and Sam Bell, Rhode Island state coordinator, Progressive Democrats of America, both Sept. 10, 2014, and Jorge Elorza, candidate for mayor of Providence, Sept. 10-11, 2014", "YouTube.com, \"Elorza Supports Municipal Income Tax,\" Smiley for Mayor channel, Aug. 3, 2014, accessed Sept. 10, 2014 and removed Sept. 11, 2014", "WPRI.com, \"Mayoral candidates Smiley, Elorza at odds over municipal income tax,\" Aug. 4, 2014, accessed Sept. 10, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]