["About this rating", "On 9 September 2016, an advisory board to the Bureau of Land Management voted to recommend the destruction of several thousand wild horses, and the outcome of that vote was forwarded to the BLM for review.", "The BLM did not accept the recommendation.", "In September 2016 rumors began circulating on Facebook claiming that the U.S. Bureau of Land Management (BLM) planned to euthanize 44,000 perfectly healthy wild horses, ostensibly to \"make room for beef cattle.\" One popular version of the rumor held that:", "The Bureau of Land Management’s Wild Horse and Burro Advisory Board has just voted in favor of killing all the wild horses currently in short term and long term holding, approximately 44,000 horses. The only NO vote on the Advisory Board was from Ginger Kathrens of the Cloud Foundation.", "Being extremely fond of euphemisms, the BLM uses the term “euthanasia” which is incorrect.", "Definition of Euthanasia: “the act or practice of killing or permitting the death of hopelessly sick or injured individuals (as persons or domestic animals) in a relatively painless way for reasons of mercy.” This is in fact murder, not euthanasia.", "The intent behind this vote was to send a strong message to Washington, DC so that this might happen. Dean Bolstad, Division Chief had been alluding to killing the captive wild horses earlier in the meeting.", "This is BLM’s endgame for our wild horses.", "Another version was issued as a Humane Society press release about the purported mass equine euthanasia necessitated by the overcrowding of holding facilities:", "The Bureau of Land Management’s National Wild Horse and Burro Advisory Board voted to recommend euthanasia of all unadopted wild horses and burros now in government holding facilities throughout the United States. In response, Humane Society of the United States Senior Vice President of Programs & Innovations Holly Hazard, said:", "“The decision of the BLM advisory board to recommend the destruction of the 45,000 wild horses currently in holding facilities is a complete abdication of responsibility for their care. The agency would not be in this situation but for their long-term mis-management. Alternatives to this proposal have been ignored for over 20 years. The HSUS stands ready to implement these alternatives at any time.”", "Over the past 20 years, the BLM has maintained round-up and removal as a primary management strategy for wild horse and burro populations on America’s western rangelands — an effort which has led to a financially unsustainable Wild Horse and Burro Program. By focusing massive efforts on removing horses and burros from the range, without treating those horses remaining on the range with any form of fertility control to limit population growth, holding facilities throughout the United States have become overburdened.", "These accounts were largely accurate, but the left many readers with the mistaken impression that the BLM had voted to euthanize thousands of horses. However, the vote undertaken by an advisory board (not the BLM itself) and was offered to the bureau as a recommendation for potential action (not as a firm decision to implement any particular euthanasia plan).", "We contacted Ginger Kathrens, who was referenced as the sole dissenting voice in the advisory board's vote to slaughter the horses. Kathrens explained that she participated in a 9 September 2016 BLM advisory board meeting in Nevada, clarified that the advisory board comprised many non-BLM employees (her role on the board was that of an advocate for humane treatment of animals), and confirmed that the advisory board came to a near unanimous vote to slaughter unadopted horses being kept in holding facilities due to problems with overpopulation and that she was the sole dissenting voice in that vote. She also cited a 2013 report [PDF] published by the National Academy of Sciences warning about unaddressed conditions \"unsustainable for maintaining healthy horse populations\":", "The Wild Horse and Burro Program has not used scientifically rigorous methods to estimate the population sizes of horses and burros, to model the effects of management actions on the animals, or to assess the availability and use of forage on rangelands. Evidence suggests that horse populations are growing by 15 to 20 percent each year, a level that is unsustainable for maintaining healthy horse populations as well as healthy ecosystems. Promising fertility-control methods are available to help limit this population growth, however. In addition, science-based methods exist for improving population estimates, predicting the effects of management practices in order to maintain genetically diverse, healthy populations, and estimating the productivity of rangelands. Greater transparency in how science-based methods are used to inform management decisions may help increase public confidence in the Wild Horse and Burro Program.", "On 12 September 2016, the BLM issued a statement that they would not be accepting the board's recommendation to euthanize and would be seeking management alternatives:", "The Bureau of Land Management announced it will not accept the recommendation from their National Advisory Board to euthanize the upwards of 46,000 wild horses. The recommendation was followed by a major public outrage, but the BLM says they will continue to seek out other management options.", "Bureau of Land Management spokeswoman Kristen Lenhardt said those alternatives include the BLM’s already established wild horse and burro adoption program, as well as using birth control to reduce overpopulation.", "The BLM also published a notice on their web site stating:", "The National Wild Horse and Burro Advisory Board is an independent panel comprised of members of the public that make recommendations to the Bureau of Land Management regarding its management of wild horses and burros.  The BLM is committed to having healthy horses on healthy rangelands.  We will continue to care for and seek good homes for animals that have been removed from the range.  The BLM does not and will not euthanize healthy animals. The agency continues to seek new and better tools for managing the nation's quickly expanding population of wild horses. There are nearly 70,000 wild horses and burros on public lands in the West — three times the recommended level — and nearly 50,000 additional horses and burros that have been removed from the range and are available for adoption. The cost of caring for each animal that goes unadopted can be nearly $50,000.", "We encourage those who might be interested in adopting one of these incredible animals to call 1-866-4MUSTANGS.", "Robles, Yesenia.   \"BLM Pulls Plans to Sterilize Wild Horses in Oregon.\"\r\n    Denver Post.   9 September 2016.", "Walker, Carol.   \"Breaking News: BLM’s Wild Horse Advisory Board Just Voted to Kill All 44,000 Captive Wild Horses in Holding.\"\r\n    Wild Hoofbeats.   9 September 2016.", "National Academy of Sciences.   \"Using Science to Improve the BLM Wild Horse and Burro Program: A Way Forward.\"\r\n     2013.", "The Humane Society of the United States.   \"BLM Advisory Board Recommends Euthanasia for 45,000 Wild Horses.\"\r\n    9 September 2016.", "U.S. Department of the Interior, Bureau of Land Management.   \"Wild Horses and Burros, Myths and Facts.\"\r\n    19 May 2016.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]