["“Whoever suggested using lint rollers to take ticks off after a walk in the woods...you’re a genius!” reads the caption of a post from April 25, 2020.", "The misleading post resurfaced as Spring weather increased the likelihood of people walking in areas where ticks are prevalent.", "The US Centers for Disease Control (CDC) reported that the number of counties with blacklegged ticks, which can transmit Lyme disease, “has more than doubled over the past twenty years.” The Canadian government also warned that “populations of blacklegged ticks are spreading in eastern and central Canada.”", "Thoroughly checking one’s body and that of a pet after walking in a tick-infested area is the best defense against the pests, but Dr. Katie Chow, a veterinarian and professor at Canada’s University of Guelph, told AFP that the advice to use a lint roller would only work if the tick was still on a person’s clothes and had yet to bite.", "“If the tick has bitten and it’s attached, I would be concerned about using a lint roller,” Chow, who works with the Canadian Lyme Disease Research Network, told AFP by email. “A lint roller on an attached tick could lead to improper removal.”", "The official tick removal advice on the Health Canada website says: \"Using clean tweezers, grasp the head as close to the skin as possible and slowly pull straight out. Try not to twist or crush the tick.\"", "The CDC also recommends using “fine-tipped tweezers to grasp the tick as close to the skin’s surface as possible. Pull upward with steady, even pressure.”", "Dogs are also very susceptible to tick bites, but Clow cautioned against using lint rollers on a pup.", "“I would not recommend a lint roller to be used on an animal though to get the unattached ticks off. That could be painful,” she said.", "Dr. Ian Sandler, a member of the National Issues Committee of the Canadian Veterinary Medical Association, also cautioned against using a lint roller to prevent a pet from catching a tick-borne disease.", "“Even if you could remove a few ticks that haven’t attached, it provides a false sense of security that you got all the ticks,” he said.", "The American Kennel Club recommends using “fine point tweezers” or a tick removal hook.", "During the 2019 tick season, AFP Fact Check reported on another misleading post about tick removal. Health officials cautioned against trying to remove a tick with a soap-soaked cotton ball.", "Similarly, the CDC website says: “Avoid folklore remedies such as ‘painting’ the tick with nail polish or petroleum jelly, or using heat to make the tick detach from the skin. Your goal is to remove the tick as quickly as possible -- do not wait for it to detach.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]