["Democratic presidential candidate former Vice President Joe Biden arrives to speak at a campaign event at the Colonial Early Education Program at the Colwyck Training Center, Tuesday, July 21, 2020, in New Castle, Del. (AP Photo)", "At a voter outreach event aimed at Muslims, Biden said, “I wish we taught more in our schools about the Islamic faith… about all the great confessional faiths.”", "Conservative commentators said Biden was anti-Christian and against prayer in schools, leaving out the context of him talking about theology in general.", "Biden is Roman Catholic and has talked about how faith led him to run for public office. He has said he supports the separation of church and state.", "As presumptive Democratic presidential nominee Joe Biden spoke in support of increasing Muslim American voter turnout at a recent summit, he said he wished American schoolchildren were taught more about Islam.", "Biden thanked advocacy group Emgage Action for endorsing his campaign and having him at their \"Million Muslim Votes\" event July 20. Then he said: \"I wish we taught more in our schools about the Islamic faith.\"", "Biden said more than that, but the backlash on social media didn't catch it. Conservative activists, including Charlie Kirk, tweeted out the comment and went on to say Biden didn’t support prayer or studying the Bible in schools. One former Republican candidate called him anti-Christian. Biden is a lifelong Roman Catholic.", "On Facebook, a text post quoted Biden incorrectly as saying: \"We need to teach our children the ISLAMIC FAITH in our schools!\"", "The misquote left out important context from the rest of Biden’s speech and his campaign as a whole.", "Biden said he wished schools taught not only the Islamic faith but \"all the great confessional faiths.\" He also said that he is interested in theology and \"we all come from the same root here in terms of our fundamental, basic beliefs,\" referencing his own Catholic background.", "His reference to \"confessional religions\" includes different denominations of Christianity, Judaism and Islam, which are religions that each have their own statements of faith, sometimes called a confession.", "Biden has talked extensively about his Catholic faith during his campaign. He discussed how faith influences his policy and how it helped him through the death of his son Beau at a CNN town hall in February 2020.", "Biden wrote an op-ed for the Religion News Service where he referenced how he went to a Catholic elementary school where nuns taught him scripture. He said the lessons he learned from a Catholic community led him to public service.", "Biden said in 2005 that he supports rigidly upholding a separation of church and state.", "Our ruling", "The Facebook post claimed that Biden said, \"We need to teach our children the ISLAMIC FAITH in our schools!\"", "He didn’t say the quote. At the summit, Biden said that Islam should be studied from a theology perspective, not that students should be taught Islamic faith. He also went on to include that all \"great confessional religions'' should be talked about more in schools.", "We rate this False.", "Tweet, July 21, 2020", "Tweet, July 21, 2020", "Rev, Joe Biden Speech at the Million Muslim Votes Summit Transcript, July 20, 2020", "PBS, WATCH: Biden addresses the Million Muslim Votes Summit, July 20, 2020", "Facebook post, July 21, 2020", "Tweet, July 21, 2020", "Merriam-Webster, Definition of Confession, accessed on July 23, 2020", "CNN,  Joe Biden is a man of faith. That could help him win over some White evangelicals., July 18, 2020", "CNN, Husband of Charleston shooting victim shares emotional moment with Joe Biden, Feb 26, 2020", "Religion News Service, Joe Biden on restoring the soul of our nation, Dec 29, 2019", "Pew Research Center, Religion and Politics '08: Joe Biden | Pew Research Center, Nov 4, 2008", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]