["About this rating", "A brightly illustrated book called \"Do You Want to Play With My Balls?\" exists.", "The work was not intended as a children's book.", "In May 2015, a video featuring a woman reading an “actual children’s book” called Do You Want to Play with My Balls? went viral on YouTube. The book in that video resembles a typical children’s book, featuring pages of illustrations superimposed with simple sentences spoken by child characters:", "https://youtu.be/Y3loy0EG4uQ\n\nHowever, all the sentences uttered by those child characters are repetitions of old suggestive jokes involving the duality of the word “ball” as something referring to both a spherical objects used in sports and games and a slang term for a portion of the male genitalia (i.e., the testicles):", "Hey Louie! Do you want to play with my balls?\nSure Chuck! I can hold your ball sack so it won’t drag on the ground.\nWow! Your balls are so big, I can’t even fit them in my mouth!\nMy mom’s always yelling, “Louie! Get those balls out of your mouth before you choke!”\nYou know that mean girl Sally? She squeezed my balls so hard they looked funny.\nYeah, well when I play with Sally ... I always end up with blue balls.\nBilly Johnson made Sally cry last week. Now that kid’s got balls!", "While the video left many viewers in hysterics, others were confused by the nature of the book. Was this a real product? Could you buy it in stores? Was it really meant for children? Some publications even condemned the book, terming it the “most disgusting and evilest children’s book ever created!”", "However, Do You Want to Play with My Balls? (like the popular 2011 book Go the F**k to Sleep) is not a work targeted for young readers, but rather a parody of children’s books intended for a grown-up audience. Do You Want to Play with My Balls? was written by the Cifaldi Brothers and originally had a very small production run of about 100 copies. When the book became a viral hit, Bum Bum Books decided to put the book back into production and started a Kickstarter campaign to fund the effort:", "A few years ago four kind and slightly demented fellows (that’s us!) got together and created a book called Do You Want to Play with My Balls?, a children’s book for adults. Our first attempt at printing the book, however, was only a short run of around 100 copies. We also made our book available digitally in hopes that enough money would be raised to print even more. Fast forward to today … Of the 100 or so books that did get printed, one found it’s way onto the internet in the form a young lady reading it out loud. In a very short time this video had over 5 million views, and our collective jaws hit the ground. So now we are super excited to print Do You Want to Play with My Balls? and get it out to all the people that seem to also love the idea. We have a new printer lined up, a wonderful website, a company name (Bum Bum Books :)) and we’re ready to start shipping. The only problem now is getting the money together to print our next batch of books.", "Interested readers can purchase digital copies of the book from online retailers such as Amazon and iTunes.", "As for the book’s intended audience, Bum Bum Books wrote that Do You Want to Play with My Balls? was the perfect gift for “parents, fun loving adults, friends, and even young children (though it’s probably best that they’re young enough to not understand the meaning of a pun).”", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]