["A pair of photos have been shared thousands of times on Facebook and Twitter alongside a claim that one of the photos shows German police removing their helmets in solidarity with protesters in Berlin. The claim is false; the first photo was taken in the German city of Chemnitz during a far-right demonstration in 2018; the other photo was taken during a protest against EU trade deals in 2016 in Berlin.", "The photos were published on Facebook here August 31, 2020. The post has been shared more than 850 times.", "The post reads: “POLICE IN BERLIN REMOVE RIOT HEAD GEAR AND STAND IN SOLIDARITY WITH THE PEOPLE.\n\tDo you understand why the media won’t share this ???\n\t#australia\n\t#opentheborders\n\t#openforbusiness\n\tVictoria Police NSW Police Force Australian Army CHOOSE YOUR SIDE.”", "The photos were shared days after a major protest against coronavirus restrictions was held in Berlin on August 29, 2020. Around 18,000 people took part in the rally, which was halted by German police because many protesters were not respecting social distancing measures, as AFP reported here.", "The photos were also shared nearly 600 times after appearing with a similar claim on Facebook here, here, here, here and here.", "The photos were retweeted more than 1,700 times after it was shared with a similar claim in French.", "However, the claim is false.", "First photo", "A Google reverse image search of the first photo in the misleading post, which depicts a group of police officers in riot gear with their helmets on their belts, found this photograph on Getty Images, credited to a Deutsche Presse-Agentur (DPA) photographer.", "The photo’s caption reads: “01.09.2018, Saxony, Chemnitz: The participants of the demonstration of AfD and the xenophobic alliance Pegida, to which also the participants of the rally of the right-wing populist citizen movement Pro Chemnitz have joined, move through the city. The Saxon police expect a high number of participants at the demonstrations announced for September 1, 2018.”", "Below is a screenshot of the photo on the Getty Images website:", "The image also appears in this September 2018 article on the demonstration in Chemnitz by German magazine Der Spiegel.", "Around 8,000 people joined German far-right party AfD and Islamophobic PEGIDA movement to rally in Chemnitz on September 1, 2018, to protest the fatal stabbling of a 35-year-old man, allegedly by a Syrian and an Iraqi, AFP reported here.", "AFP published a similar photo that same day showing police officers wearing their helmets on their belts.", "Second photo", "A Google reverse image search of the second photo in the misleading post found this AFP photograph, which was taken in Berlin on September 17, 2016.", "The photo’s caption reads: “Activists rally for a demonstration against the massive transatlantic trade deals CETA and TTIP on September 17, 2016 in Berlin. Organisers of several demonstrations across Germany expect hundreds of thousands of people to take the streets in protest against the planned deals Transatlantic Trade and Investment Partnership (TTIP) between the European Union with the United States and it's smaller version CETA between the European Union and Canada.”", "Here is an AFP report regarding the demonstration against the trans-Atlantic trade deals.", "In response to the misleading posts, a spokesperson for the Saxony police told AFP that it denounced the attempt to “instrumentalise the police forces deployed to secure situations.”", "“However, the officers will act professionally and will not be influenced by this. If pictures are deliberately placed in a different context afterwards, it is important that the police [are] reacting decisively, especially on social networks, in order to counter such false reports, to erase any doubt concerning the neutrality and professionalism of the police,” the spokesperson said.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]