["This Facebook post, published March 28, 2019, and shared more than 9,400 times since, contains an image purporting to show Erdogan making a two-fingered pointing gesture, which in Indonesia is seen as a sign of support for Subianto and Uno.", "Subianto is the sole challenger of incumbent President Joko Widodo in Indonesia’s April 17, 2019 election and Uno is his running mate. Here is the list of candidates on the website of the country’s General Elections Commission.", "Translated to English, the post’s caption says in capital letters: “The world awaits Prabowo and Sandi!”, referring to the opposition candidates’ first names.", "Below is a screenshot of the misleading Facebook post:", "The mostly black-and-white image contains a logo in the top-right-hand corner with the names “Prabowo” and “Sandi” and a red bird – a symbol which also appears on the pair’s campaign website here.", "There is also the word “Erdogan” and writing purporting to be the Turkish president’s signature in the top-left-hand corner of the image.", "This January 17, 2019 report by Indonesian news outlet Bisnis.com is about the two-fingered pointing gesture made by Subianto and Uno during their campaign.", "The image has been doctored; a Google reverse image search and further keyword searches led to this Instagram post published February 2, 2019 by Teuku Riefky Harsya, a member of  the Indonesian house of representatives.", "The post, embedded below, contains a colour photograph of Uno and Harsya sitting next to each other on a plane and both making the two-finger pointing gesture with their right hand.", "Bismillah, menuju Banda Aceh (Sabtu, 2 Feb’19). ???? . #pidiejaya#pidie#acehbesar#bandaaceh#sabang#acehjaya#acehbarat#naganraya#abdya#acehselatan#subulussalam#singkil#acehtenggara#gayolues#gayo#aceh#wisataaceh#agaminongaceh#mahasiswaaceh#modelaceh#remajaaceh#ulamaaceh#santriaceh#sejarahaceh#tarianaceh#kulineraceh#teukuriefky#partaidemokrat#fraksidemokrat", "A post shared by  Teuku Riefky Harsya (@teukuriefky) on Feb 1, 2019 at 9:09pm PST", "In the misleading image shared on Facebook, Erdogan’s face has been pasted on Uno’s body and the whole picture has been made black and white.", "Below is a comparison between screenshots of the doctored Facebook image (top) and Harsya’s Instagram post (below).", "Corresponding features include Uno’s right hand with a white bangle on it, the distinctive light collar of his dark shirt with the number “02” on the shoulder, and the plane’s window.", "“02” refers to Subianto and Uno’s candidate number, also listed on the General Elections Commission site.", "In the bottom-right-hand corner of the misleading image are the words “PhotoGrid”. A Google search reveals that this is a photo-editing app.", "The PhotoGrid app’s description here on Google Play says: “Create fun, one-of-a-kind layouts by remixing your own photos and sharing them on social platform!”", "A Google Images keyword search for “Erdogan” found the original picture of his face used in the misleading Facebook post. It appears in this profile of him published by Forbes magazine.", "The picture of Erdogan has been cropped, rotated and made black-and-white, as can be seen in the image below comparing screenshots of the misleading post (L) and the Forbes article (R):", "Some small tufts of Uno's hair can still be seen poking out behind Erdogan's head in the doctored image.", "Indonesian news organisations have also published their own fact-checks on the misleading post, for example this Tempo report and this Liputan6 report.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]