["On September 9, The Times of India reported that actor Rhea Chakraborty’s father Indrajit Chakraborty was deeply saddened by the news of her arrest. According to the report, her father also issued a tweet which said, “No father can bear injustice on his daughter. I should die.” Its online entertainment platform ETimes also featured these tweets in a video story on the actor’s arrest.", "ABP News also quoted the tweet, writing, “Rhea Chakraborty’s Father Indrajit Chakraborty Says, ‘I Should Die, No Father Can Bear Injustice On His Daughter’”. (archived link to the tweet)", "#RheaChakraborty’s Father #IndrajitChakraborty Says ‘I Should Die, No Father Can Bear Injustice On His Daughter’#SushantSingRajputDeathCase https://t.co/l4VHUooFYg", "— ABP News (@ABPNews) September 9, 2020", "Hindustan Times published the tweet in both its Hindi and English reports. News18 also broadcast the tweet as part of its live updates on the case. Times Now Hindi carried a similar report and so did NYOOOZ TV YouTube channel.", "This slideshow requires JavaScript.", "The Twitter handle that media organisations were claiming belonged to Rhea Chakraborty’s father Indrajit Chakraborty is actually a fake one, which had the username @WeWantRahul only a few days ago. The user running this account posted a tweet following the arrest of the actress in which they wrote, “Please trend for my daughter. #JusticeFor Rhea. Please INDIA, help.” This tweet received thousands of likes and retweets. After this, the user made a slew of tweets related to this matter. These were then picked up by news channels and falsely circulated as the real Indrajit Chakraborty’s social media activity.", "When we looked at some of the older tweets that had been posted by this account, we found that it had changed its Twitter username to @IndrajitChakra and display name (which appears above the username), to ‘Indrajit Chakraborty’ on September 6. Also on this day, the user had posted some tweets with #StandwithRheaChakraborty and #IamWithRhea hashtags. The username @WeWantRahul can actually be seen in another user’s reply to a tweet posted by the account from the same day too.", "A few hours later on September 6, the user changed their username to @IndrajitChakra. We found a tweet from the same day which reads, “Please help a helpless father #JusticeForRhea”. Another tweet dated September 6 says, “My account has been reported 500 times in last one hour (sic). I will not STOP. Its about my family. @Tweet2Rhea is INNOCENT.”", "We looked through the previous iterations of the @WeWantRahul Twitter handle on Wayback Machine. This is a web archive portal that automatically takes snapshots of web pages at different points of time. Upon looking through the archived links of this handle, we found that it used to be a Rahul Gandhi fan account at one point, with a display name that read, ‘Rahul Gandhi as next PM of INDIA’.", "The link to the tweet seen in the screenshot above is https://twitter.com/WeWantRahuI/status/1267501722055786499. If you copy-paste the link, you will find it redirects to the handle created in the name of Indrajit Chakraborty. This is possible only when a Twitter user changes their username. This has been explained in the video below.", "To sum it up, a Twitter user had changed their username to Indrajit Chakraborty, the father of actor Rhea Chakraborty. After changing their username and display name, this account began tweeting in support of Rhea. Various news channels believed that these tweets were actually made by Rhea’s father.", "Interestingly, The Times of India first published an erroneous report and later turned it into a fact-check report without any explanation.", "This slideshow requires JavaScript.", "We should also point out that ABP News has also removed all the tweets while tweaking some information in its English article. Its report has now described this Twitter handle as unverified, but they have not issued any explanation for these edits. At the same time, the Hindi website of the channel has instead presented their old article as a fact-check report. This becomes clear once you look at the URL of the piece. (archived link to the old article by ABP News)", "This slideshow requires JavaScript.", "India TV also reported that the Twitter handle belonged to Chakraborty’s father. It has now amended its article and added ‘CORRECTION’ to the title, while also apologizing for the error. Hindustan Times also issued a clarification on this matter, later withdrawing its report.", "This slideshow requires JavaScript.", "It must be noted that this is not the first time that the media a cited fake social media handle while reporting on the Sushant Singh Rajput case. Previously, Aaj Tak showed tweets claiming to be by the late actor’s father in a report, when in fact, these tweets were fake. It also used tweets from a fake account impersonating Rajput as part of its story on the actor’s final tweets. Recently, Times Now also ran a tweet posted by a fake account posing as Rajput’s sister as ‘breaking news’. Apart from this, a number of media outlets also misidentified Rajput’s choreographer as his niece in their stories on a video of the two dancing together.", "Donate Now", "Priyanka Jha specialises in monitoring and researching mis/disinformation at Alt News. She also manages the Alt News Hindi portal.", "A claim that Nobel laureate Amartya Sen has passed away went viral on social media…", "Within hours of Prime Minister of Canada Justin Trudeau alleging that “agents of the government…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…", "On the front page of its national edition dated August 22, Hindi daily Dainik Jagran…", "In his reply to the no-confidence motion brought by the Opposition in the Lok Sabha,…"]