["Democratic presidential candidate and former Vice President Joe Biden speaks during the final presidential debate Oct. 22, 2020, at Belmont University in Nashville, Tenn. (AP/Semansky)", "The federal prison population shrunk under the Obama administration, but the decline was actually about 12,000 people from the start to the end of Obama’s presidency.", "Biden’s 38,000 figure is cherry-picked. It shows the change in the federal prison population between its peak at the end of 2012 and the end of 2018.", "The 38,000 figure does not reflect the number of federal inmates who were released under or because of the Obama administration.", "Squaring off with President Donald Trump over criminal justice reform during the final debate before Election Day, Democratic presidential nominee Joe Biden wrongly claimed the Obama administration's policies \"released\" 38,000 federal prisoners while he was vice president.", "\"38,000 prisoners were released from federal prison,\" Biden said, responding to Trump’s claim that Biden and President Barack Obama \"got nothing done\" on the matter.", "The federal prison population did shrink under Obama for the first time since President Jimmy Carter was in office — but not by 38,000, and not because 38,000 prisoners were released.", "The first problem with Biden’s claim is with the number he cited.", "The Biden campaign pointed to data from the Justice Department’s Bureau of Justice Statistics showing that the federal prison population dropped from a peak of 217,815 people at the end of 2012 to 179,898 people by the end of 2018, for a decrease of about 38,000.", "The 38,000 figure was cited in a letter civil rights groups sent the Senate leadership in 2018. But the number is misleading, since it compares the high point under Obama with the federal prison count almost two years into Trump’s presidency.", "The same Bureau of Justice Statistics data shows that there were 201,280 prisoners in federal custody on Dec. 31, 2008, nearly one month before Obama’s inauguration. There were 189,192 by the same day in 2016, with less than a month left in Obama’s second term.", "That’s a decline of about 12,000 prisoners, not 38,000.", "The second issue with Biden’s claim is the term \"released.\"", "The Bureau of Justice Statistics data measures the federal prison population and can be used to show population changes from year to year. It doesn’t track prisoners who were released.", "\"Released is not the right word here,\" said Kara Gotsch, director of strategic initiatives at the Sentencing Project. \"What we’re talking about is a decline in the population.\"", "The federal prison population changes all the time, Gotsch said. It drops when prisoners finish their sentences or die, for example, and it rises when new prisoners come in. The population has contracted considerably during the coronavirus pandemic, Gotsch said, as start dates for some prisoners’ sentences are getting deferred for safety reasons.", "Biden framed his point more accurately earlier in the debate. \"The federal prison system was reduced by 38,000 people under our administration,\" he said.", "The Federal Bureau of Prisons does keep tallies of the tens of thousands of federal inmates released each year. But the release data doesn’t say much about the Obama administration’s criminal justice reform efforts, which is the point Biden was trying to make.", "\"People get released every day just because their sentence ends,\" Gotsch said.", "That said, Gotsch told PolitiFact that policies implemented by the Obama administration — along with two changes made during Obama’s tenure by the independent, bipartisan U.S. Sentencing Commission — did help drive a decline in the federal prison population.", "The Fair Sentencing Act of 2010, for example, dramatically reduced a 100-to-1 sentencing disparity between powder and crack cocaine, and the U.S. Sentencing Commission approved the retroactive application of some of the new sentencing guidelines.", "According to a U.S. Sentencing Commission report, 7,748 crack-cocaine offenders received retroactive reductions to their prison sentences under that change.", "The U.S. Sentencing Commission also voted in 2014 to reduce drug sentencing guidelines by two offense levels and apply the change retroactively. That change has resulted in 31,763 drug offenders getting retroactive sentence reductions as of June, according to the commission.", "Former Attorney General Eric Holder also instituted a \"Smart on Crime Initiative\" that Gotsch said led to fewer federal drug prosecutions. A separate Justice Department initiative urged qualified federal inmates to seek sentence commutations. Obama commuted the sentences of 1,696 people through that program, the U.S. Sentencing Commission found.", "Biden said that as part of the Obama administration’s criminal justice reforms, \"38,000 prisoners were released from federal prison.\"", "The 38,000 figure is cherry-picked. It represents the change in the federal prison population from its peak at the end of 2012 to the end of 2018, nearly two years into Trump’s presidency.", "The federal prison population did shrink under Obama for the first time in decades, but the true decline from the start to the end of Obama’s presidency was about 12,000 prisoners.", "The 38,000 figure also describes a reduction in the federal prison population — which can happen for a myriad of reasons — rather than the number of federal inmates who were released under or because of the Obama administration’s policies.", "We rate Biden’s statement Mostly False.", "NBC News on YouTube, \"Final 2020 Presidential Debate Between Donald Trump, Joe Biden | NBC News,\" Oct. 22, 2020", "FactCheck.org, \"FactChecking the Final 2020 Presidential Debate,\" Oct. 23, 2020", "CNN, \"Fact check: Toned-down Trump continues his onslaught of falsehoods,\" Oct. 23, 2020", "Federal Bureau of Prisons, \"Statistics,\" accessed Oct. 23, 2020", "Federal Bureau of Prisons, \"Release Numbers,\" accessed Oct. 23, 2020", "Bureau of Justice Statistics, \"Prisoners in 2018,\" April 2020", "U.S. Sentencing Commission, \"U.S. Sentencing Commission 2014 Drug Guidelines Amendment Retroactivity Data Report,\" March 2020", "Letter from the ACLU and the Leadership Conference to Senate Majority Leader Mitch McConnell and Senate Minority Leader Chuck Schumer, Dec. 17, 2018", "Bureau of Justice Statistics, \"Prisoners in 2016,\" January 2018", "U.S. Sentencing Commission, \"An Analysis of the Implementation of the 2014 Clemency Initiative,\" September 2017", "U.S. Sentencing Commission, \"U.S. Sentencing Commission Final Crack Retroactivity Data Report Fair Sentencing Act,\" December 2014", "PolitiFact, \"Fact-checking Donald Trump, Joe Biden in the final presidential debate,\" Oct. 22, 2020", "PolitiFact, \"Did federal inmate population drop under Obama for first time since Carter?\" May 18, 2017", "Statement from the Biden campaign, Oct. 22, 2020", "Email correspondence with the U.S. Sentencing Commission, Oct. 23, 2020", "Email correspondence with the Federal Bureau of Prisons, Oct. 23, 2020", "Phone interview with Kara Gotsch, director of strategic initiatives at the Sentencing Project, Oct. 23, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]