["About this rating", "A contentious 8 November 2016 election (and its results) led to a cottage industry of preying on hopes that a pre-inauguration upset was going to take place. One instance of this came from Bipartisan Report, which published a 6 December 2016 headline claiming that the swing state of Florida was moving for a \"FULL RECOUNT\" because of purported voting irregularities:", "According to a lawsuit filed Monday in Leon Circuit Court, it was Hillary Clinton who won the state of Florida, not Donald Trump. In an attempt to overturn the election results, Floridians have filed a motion for a recount in their state.", "According to the Detroit Free Press, “hacking, malfunctioning voting machines, and other problems” are sole the reason Hillary Clinton lost that day.", "The voters are asking for a recount of every ballot submitted in the state of Florida. The defendants listed in the lawsuit are “Trump, Gov. Rick Scott and the 29 Republican presidential electors from Florida.” The lawsuit also asks that the defendants pay for the total cost of the recount.", "Clint Curtis is an attorney representing the plaintiffs ... [the] Orlando attorney says that he has received multiple reports of malfunctions on election day, and that it is entirely possible that Donald Trump did not really win Florida.", "The article was primed to move on Facebook and Twitter, but its content did not quite match its headline. Bipartisan Report cited the Detroit Free Press, but that source material did not support the claim that Florida sought a recount. That article reported that three voters filed a suit likely to have no effects on the state's certification process (according to the attorney for the plaintiffs):", "In a lawsuit filed Monday in Leon Circuit Court, they assert that Hillary Clinton, not Donald Trump, actually won Florida. The plaintiffs, who live in Osceola and Volusia counties, say the state’s official election results were off because of hacking, malfunctioning voting machines and other problems.", "They're asking for a hand recount of every paper ballot in Florida, at the expense of defendants including President-elect Trump, Gov. Rick Scott and the 29 Republican presidential electors from Florida.", "But even lawyers for the plaintiffs acknowledge time isn’t on their side. Clint Curtis, an Orlando attorney representing the plaintiffs, said the defendants may not respond by the time the Electoral College meets on Dec. 19.", "\"They can ignore it entirely,” he said.", "The claim that Florida uncovered massive voter fraud or moved to recount any of the ballots in 2016 was false. Additionally, the 12 December 2016 \"safe-harbor deadline\" in Florida came and went with no movement on the part of election officials to either recount ballots or contest the results in that state.", "Burlew, Jeff.   \"Florida Voters Sue For Recount.\"\r\n    Detroit Free Press.   5 December 2016.", "Reaves, Jessica and Frank Pellegrini.   \"The 'Safe Harbor' Statute: Two Perspectives.\"\r\n    TIME.   13 December 2000.", "National Constitution Center.   \"Recount Bid Deadlines Fall On Bush V. Gore Anniversary.\"\r\n    12 December 2016.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]