["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Ask Gov. Rick Scott about practically any topic and he is bound to steer the conversation back to jobs.", "The former CEO of a health care company loves to cite statistics that relate to job growth, such as this one in a March 31 online ad:", "\"Florida’s economy is on a better path. Since December 2010 Florida has created 540,000 new jobs. Let’s keep working.\"", "Scott, who has governed during the national recovery, is expected to face former Gov. Charlie Crist, who governed during the recession, in November. The jobs picture under both governors is a key topic of debate in the race.", "Did Scott correctly cite the number of new jobs in Florida?", "Private vs. public-sector jobs", "Scott started the clock ticking in December 2010, one month before the Republican took office. His campaign used data from the U.S. Bureau of Labor Statistics to arrive at the figure.", "BLS data shows that the number of total nonfarm jobs grew by 517,500 between December 2010 and preliminary data for February 2014, the most recent month available. That’s a little short of the number Scott used.", "Scott gets to his number by ignoring reductions in government jobs. During the same time frame, Florida lost 23,200 government jobs. So if it hadn’t been for the lost government jobs, the number would be 540,000.", "At PolitiFact Florida we are very familiar with Scott’s statements about jobs and have been tracking his 2010 campaign promise to create over 700,000 jobs in seven years. That promise is currently rated In the Works.", "When Scott debuted his jobs promise in July 2010, state economists had released estimates showing that Florida would add 1.05 million jobs between July 1, 2010, and June 30, 2018 -- no matter who served as governor.", "In response, Scott clarified his promise and said that his 700,000 jobs would come in addition to the ones state economists forecasted. Put simpler: his 7-7-7 plan became 7-7-1.7 million.", "Scott’s press office has consistently disagreed with our analysis, saying Scott’s campaign materials never qualified that 700,000 jobs would be on top of normal growth projections.", "To achieve the goal of 700,000 jobs on top of normal growth requires the state to produce more than 20,000 jobs on average per month, every month, for seven years. He has fallen short of that average the majority of the months, though the jobs picture improved in 2013.", "In this particular online ad, Scott doesn’t use words to take credit for the job growth, but he is touting job growth during his watch.", "We have interviewed economists in the past who caution that a governor can’t take much credit for job growth during a national recovery -- or too much blame for job losses during a national recession.", "Kwame Donaldson, an economist at Moody’s who analyzes Florida, said that the creation of 540,000 private-sector jobs in the 38 months since December 2010 is not a particularly exceptional rate of job creation.", "\"The most private-sector jobs created during any 38-month interval is 753,100 (during the 38-month interval that ended in August 2006),\" Donaldson said in an email to PolitiFact Florida. \"The current record is even less remarkable considering Florida’s larger current population.\"", "Our ruling", "Scott said in an online ad, \"Since December 2010 Florida has created 540,000 new jobs.\"", "Looking only at the numbers -- and not whether Scott’s policies should get credit for the growth -- Florida added 517,500 total nonfarm jobs and lost 23,000 government-sector jobs between December 2010 and February 2014.", "It would have been more accurate for Scott to cite private-sector job growth.", "We rate this claim Mostly True.", "Gov. Rick Scott online ad, \"540,000,\" March 31, 2014", "U.S. Bureau of Labor Statistics, State and local employment total nonfarm and government jobs data, December 2010-February 2014", "Tampa Bay Times, \"Rick Scott unveils economic plan,\" July 21, 2010", "PolitiFact, \"7 steps, 7 years, still a lot more jobs to go,\" Dec. 9, 2013", "Interview, Timothy Ewing, U.S. Department of Labor economist, March 31, 2014", "Interview, David Denslow, University of Florida retired economist, April 1, 2014", "Interview, Kwame Donaldson, Moody’s analyst, April 1, 2014", "Interview, Greg Blair, spokesman for Gov. Rick Scott campaign, April 1, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]