["A photo depicting a man crucified and suspended from a road sign in Mexico has been shared tens of thousands of times in various contexts. The man in the photo was a suspect in a rape case in the town in Contepec, Mexico in 2012. He was kidnapped on his way to be interrogated by the police and found dead the next day, his naked body spread across a board and suspended from a road sign.", "Tales around Eladio Martinez Cruz, a man from the Mexican state of Michoacan, are as varied as they are plentiful. Certain publications claim that he was caught while molesting a young child, while others say his death was a warning to local pedophile rings. He was sometimes described as an pedophile priest, and was sometimes named Eduardo Cruz.", "The confusion around Cruz stems from a photo of his dead body, which has been used by media around the world, often without regard for the truth behind the deceased’s story.", "Warning: graphic content", "Show", "Hide", "The photo above dates back to 2012, but its shocking character and brutality has led it to be continuously shared on social media since. Misleading articles are still written about it six years on.", "As a suspect in the rape of a woman in the town of Contepec, 24 year old Eladio Martinez Cruz was arrested by the municipal police on September 6, 2012, in order to be interrogated. On the way to the police station however, two vehicles barred the way of the police car, and several heavily armed individuals threatened the policemen into handing the suspect over to them, the Michoacan state police told media, including AFP, at the time.", "At 7:55 on the morning of September 7, the Contepec police department received an anonymous phone call informing them that a lifeless body was at the Hacienda Cantalagua Tepetongo crossroad, which turned out to be the late Eladio Martinez Cruz, the state police further reported.", "A look at Google Street View shows that the geographic location mentioned in the police statement most likely coincides with the macabre photo that became viral. The signs are not the same, most likely because the Google Street View photos were taken in 2009, three years before Cruz’s was killed, but the background shows the same mountain range.", "A sign was also hung from Cruz’s chest that read, \"This happened to me for committing rape. This is going to happen to you gossips, jokers, finger pointers. Know it this is no game.”", "The Michoacan state police did not arrest anybody in relation to Cruz's murder and the case is now closed.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]