["About this rating", "An urban legend rivaled in tenacity by only the infamous “Cookie Recipe” tale (and even that monster runs a distant second), this appeal from a dying child touches the generosity in all of us and taps into our urge to do something — anything — in the face of unthinkable tragedy. In a perfect world, children wouldn't die of horrible diseases. Our natural impulse upon encountering such cosmic injustice is to look for some way to make up for the tragedy. That such a child would have a final wish — and especially that the wish would be such a simple one — moves us to action. We can do little to alter the harsh reality of young lives snuffed out by incurable disease, but we can collect a few business cards. So we do.", "It's hard to believe that so much good will and fine intentions could wreak havoc, but they have. And they still are.", "There really is a Craig Shergold, and he did have cancer. In 1989 an appeal was made on behalf of this then 9-year-old English boy afflicted with a terminal brain tumor. Young Craig wanted to be in the Guinness Book of World Records for having received the most greeting cards. By 1990, 16 million cards had arrived, and his wish had come true. (According to the 1997 edition of that book, by May 1991 he had collected 33 million.)", "Ah, but that was then, and this is now. Shergold's tumor was successfully removed in March 1991, and this lad (born 24 June 1979) grew into a healthy young man. However, like the implements in the Sorcerer's Apprentice, the cards and letters have proved impossible to stop — they just keep rolling in. Several versions of the Craig Shergold appeal still circulate, and almost every one of them now asks for business cards, not greeting cards. (In yet another form of the same hoax, compliments slips are solicited.)", "The child's name also gets munged on a regular basis. \"Craig Shelford\" and \"Craig Stafford\" and \"Craig Sheppard\" and \"Greg Sherwood\" are common variations, but there's a double handful of similar-sounding names out there too. With some of the names, it's difficult at first to be sure if they're Shergold mungings (\"John Craig\" comes immediately to mind. And yes, it is.) In those cases, a quick look at the address where the cards or slips are to be mailed will settle matters — many Shergold appeals direct mail to an address on Selby, Selsby, or Shelby Road. (The real Craig Shergold did at one time live on Shelby Road in Carshalton, England. The family has since left that address.)", "One of the addresses used in the \"request for cards\" letter is that of the \"81 Perimeter Center East\" in Atlanta, which before the emergence of the hoax was the office of the Children's Wish Foundation International. The foundation had to relocate because of all the unwanted Shergold mail. The U.S. Postal Service in Atlanta holds the hoax mailings (now more than 100 million) for a required length of time and, after they remain unclaimed, releases them to an Atlanta paper recycler. So end all those thousands of business cards everyone was scurrying around to gather up and mail off.", "A related \"dying wish\" request went out in the name of Ryan McGee of Virginia (a name sometimes munged in e-mail as \"Ron McKee\"). Though Ryan was a real person who was indeed battling a form of cancer (to which he succumbed in 2004), the request made in his name was not: He never expressed any wish for cards or to get into the record books, but somewhere along the line someone starred him in a version of the Craig Shergold hoax, transforming him into a dying child with a jones for cards. Because of the volume of mail sent to his home, the family moved and halted mail delivery to their address. To give an idea of how specious appeals like these can impact real people, we note that a woman with the same last name who lived in the same area as Ryan's family was contemplating getting an unlisted phone number because she was getting upwards of 18 messages per day on her answering machine from people looking for information about the boy.", "Though the Make-A-Wish Foundation of America has never been involved with this appeal, it became a permanent fixture in the standard chain letter. Kind-hearted souls are invariably directed to mail business card offerings to it. Make-A-Wish has made repeated requests that \"people please stop sending business cards or greeting cards to Craig Shergold\" but these continue to go unheeded. It has a web page about the many false claims of its being involved in such efforts.", "Having learned its lesson about Pandora's Box and dying child appeals, Guinness World Records retired the category for the most get-well cards, leaving Craig's 1992 record of 33 million unchallenged. Cards continue to flow in, though, and the latest guesstimate has it that over 200 million have been received. Years ago Craig's Shelby Road home was granted the British equivalent of its own postal code.", "Guinness explains its position very clearly in the FAQ on its web site, saying of Shergold record:", "This record attempt has ceased. Many years ago, a boy fighting cancer started a campaign for people to send him get-well messages in order to set a record for the most items received. Not only was that boy successful in getting a mention in the 1991 edition of the Guinness World Records book, he also made a full recovery.However, since then, chain mails have started up with variations on the original story, some requesting business cards or compliments slips rather than get-well messages. Please don't respond to any such requests, and if anyone asks you about it please tell them it's a hoax!", "Make-A-Wish and Guinness World Records weren't the only ones who pleaded for the madness to end: both Craig and his parents granted a number of interviews in an attempt to put an end to the flood, including an appearance on ABC's Good Morning America on 26 October 1997.", "In a similar December 2014 appeal, the family of Addie Fausett, a 6-year-old girl with a terminal brain disorder, asked the public to send Addie a \"lifetime of Christmas cards\":", "Addie Fausett, 6, of Fountain Green, Utah, is likely celebrating her last Christmas this year due to an atrophy of her brain that has left doctors puzzled. And in the face of devastating news, her family has come up with a beautiful idea: They are asking people to send Addie a \"lifetime of Christmas cards.\"Addie was just 3 years old when her mother, Tami, noticed that her girl could no longer hold a crayon or spoon, suddenly had difficulty speaking and her growth came to a standstill. Doctors found that her brain was shrinking and filling with fluid — a condition called diffuse atrophy — but the underlying cause of Addie's atrophy remains undiagnosed, a medical mystery. Even now at 6 years old, Addie has never weighed more than 25 pounds. Last month, doctors delivered heartbreaking news: Addie had roughly a year to live, and her mental state would deteriorate before her physicality — she will forget what and who she knows. If you'd like to contribute a greeting, send it to: Addie Lynn and Sisters, P.O. Box 162, Fountain Green, UT 84632", "Sadly, Addie passed away in July 2016.", "Brunvand, Jan Harold.   Curses! Broiled Again!    New York: W. W. Norton, 1989.   ISBN 0-393-30711-5   (pp. 227-232).", "Brunvand, Jan Harold.   Curses! Broiled Again!    New York: W. W. Norton, 1989.   ISBN 0-393-30711-5   (pp. 227-232).", "de Vos, Gail.   Tales, Rumors and Gossip.    Englewood: Libraries Unlimited, 1996.   ISBN 1-56308-190-3   (pp. 59-60).", "de Vos, Gail.   Tales, Rumors and Gossip.    Englewood: Libraries Unlimited, 1996.   ISBN 1-56308-190-3   (pp. 59-60).", "Hall, Nadia.   \"Craig: No More Cards Please.\"    The Mirror.   14 October 1997   (p. 15).", "Hall, Nadia.   \"Craig: No More Cards Please.\"    The Mirror.   14 October 1997   (p. 15).", "Hayden Snider, Betty.   \"Good Wishes for Sick Boy Still Pouring In.\"    Roanoke Times and World News.   26 December 1997   (p. C1).", "Hayden Snider, Betty.   \"Good Wishes for Sick Boy Still Pouring In.\"    Roanoke Times and World News.   26 December 1997   (p. C1).", "Hayden Snider, Betty.   \"Nothing Generates Mail Like the Rumor Mill.\"    Roanoke Times and World News.   27 November 1997   (p. A1).", "Hayden Snider, Betty.   \"Nothing Generates Mail Like the Rumor Mill.\"    Roanoke Times and World News.   27 November 1997   (p. A1).", "Kaufman, Ben.   \"Internet Appeal for Sick Girl Goes Awry.\"    The Cincinnati Enquirer.   22 December 2001.", "Kaufman, Ben.   \"Internet Appeal for Sick Girl Goes Awry.\"    The Cincinnati Enquirer.   22 December 2001.", "Mulkins, Phil.   \"Craig Shergold Card Hoax As Alive As He Is.\"    Tulsa World.   27 September 1997   (p. A2).", "Mulkins, Phil.   \"Craig Shergold Card Hoax As Alive As He Is.\"    Tulsa World.   27 September 1997   (p. A2).", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]