["About this rating", "A photograph purportedly showing actor James Earl Jones dressed as Darth Vader on the streets of London alongside other Star Wars actors (sans costumes), is frequently shared with the strange claim that Jones had to socialize incognito due to London's \"strict segregation laws\":", "This claim appears to have been made up out of the whole cloth. For starters, there were no \"strict segregation laws\" in London in 1979 -- there were no segregation laws in England at all. The 1965 Race Relations Act prohibited \"discrimination on racial grounds in places of public resort.\"", "Getting back to the photograph in question, however, the man in the Darth Vader suit is not James Earl Jones. Although Jones is well-known as the voice of Darth Vader, he didn't actually physically portray the dark lord on the big screen. As such, it would have been unusual for Jones to wear the costume for a promotional event. Mark Hamill, the actor who played Luke Skywalker, and who appears in the photograph, tweeted:", "WRONG! Never heard of so-called\"ban\"-but that's NOT Mr. Jones in Vader costume-He NEVER did press for #SW & certainly never in #DarthDrag! https://t.co/zcY8ZDgE0h", "— Mark Hamill (@HamillHimself) August 29, 2017", "So what about Dave Prowse, the actor who actually portrayed Vader on the big screen? According to the actor's Twitter account, it's not him either:", "@HamillHimself is right. Total rubbish. No clue who is inside that cheap looking halloween costume. Also not big enough for Vader ? #Fake https://t.co/XHkhzlCpt8", "— DARTH VADER (@isDARTHVADER) August 29, 2017", "The photograph was most likely taken by The Lancashire Evening Post during the opening weekend of Star Wars in the United Kingdom in January 1978. Although we haven't been able to locate this exact image in the newspaper's archive, we did find a photograph featuring Kenny Baker, the actor who played R2D2, with a similar Darth Vader character. The caption for that photograph didn't even mention the Vader character, indicating that it likely wasn't a cast member behind the mask:", "Preston's own Kenny Baker runs into trouble during the UK premiere of the first Star Wars film on January 27 1978.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]