["The Pfizer and Moderna Covid-19 vaccines use lipid nanoparticles to deliver an mRNA load into cells.", "Correct.", "These lipid nanoparticles may have adverse effects on fertility for both men and women.", "Nanoparticles are a broad spectrum of different materials that only have their small size in common. There’s no evidence that the lipid nanoparticles in these vaccines will have any effect on fertility.", "A post on Facebook has claimed the Moderna and Pfizer Covid-19 vaccines “use lipid nanoparticles to deliver an mRNA load into cells” and claims those nanoparticles have adverse effects, like harming both male and female reproductive systems.", "Nanoparticles are a generic term for very small units of size found in nature, but that can also be man-made. They are often used in medicine and they are used in both the Pfizer and Moderna Covid-19 vaccines (which have both been approved for use in the UK).", "These vaccines both work by delivering some genetic code (mRNA) of a specific protein on the virus surface to human cells. The body can then make this protein, so the immune system can recognise it later if infected and launch a successful immune response.", "Both vaccines use lipid nanoparticles to deliver the mRNA to the cells. Lipid nanoparticles are just small structures that have an outer layer made of fat that doesn’t dissolve in water. They protect the RNA from being destroyed before it has a chance to reach the cells. Outside of vaccines, nanoparticles have been used to deliver drugs in the body since the early 1990s.", "The Facebook post points to this paper, titled “Potential adverse effects of nanoparticles on the reproductive system”, as its evidence. This paper offers no proof that lipid nanoparticles specifically have a negative impact on fertility.", "Full Fact asked Dr Stephen Griffin, virologist at Leeds University, whether the claims had any basis. He pointed out that this paper wasn’t about lipid nanoparticles, and instead looks at the potential effects of the accumulation of heavy metal and carbon based nanoparticles in cells. The only thing all these nanoparticles have in common is their size, and the paper does not prove any link between lipid nanoparticles in the vaccine and reproductive health.", "The paper takes a general look at the effects of all types of “nanomaterials”, which it defines as containing 50% or more nanoparticles, regardless of what they’re made of, grouping them all together by size. It looks at evidence of nanomaterials’ effects in cells in vitro (meaning in the lab, not within the body), and in animals like mice and rats. Dr Griffin also told us that in these studies, the test animals were given high doses of the nanoparticles directly into their veins. That’s very different to getting two doses of a vaccine injected into the muscle, where the majority of the vaccine will usually stay.", "The nanomaterials and particles it talks about are made of all sorts of different materials—the thing they have in common is being between 1 and 100 nanometres in size. For example, some of the studies it cites look at what silver nanoparticles do to mice testosterone levels, others look at titanium dioxide nanoparticles in rats. None of the examples in the paper specifically talk about lipid nanoparticles used in vaccines.", "What’s more, even in cases where certain types of nanoparticle may appear to affect fertility, the mechanisms behind these effects are not known, as the study acknowledges. So it’s far from certain that their size has anything to do with any effects, and it could be more to do with their material, if indeed the effects are genuine.", "We’ve seen other claims about Covid-19 vaccines and fertility which aren’t true either.", "This article is part of our work fact checking potentially false pictures, videos and stories on Facebook. You can read more about this—and find out how to report Facebook content—here.\n\n        For the purposes of that scheme, we’ve rated this claim as partly false\n            because there’s no evidence the nanoparticles in Covid-19 vaccines will cause harm.", "Full Fact fights for good, reliable information in the media, online, and in politics.", "Bad information ruins lives. It promotes hate, damages people’s health, and hurts democracy. You deserve better.", "Full Fact, 17 Oval Way, London, SE11 5RR", "Full Fact is a registered charity (no. 1158683) and a non-profit company (no. 06975984) limited by guarantee and registered in England and Wales. © Copyright 2010-2023 Full Fact. Thanks to Bytemark for donating our web hosting.\n                        \n                        Privacy, terms and conditions."]