["This photo was published here on Facebook on October 18, 2019. It has been shared more than 200 times.", "Below is a screenshot of the misleading Facebook post:", "The post’s caption reads: “A tribute to social reformer Sir Syed Ahmad Khan by the UAE Government. This depicts the power of the vision.”", "“Sir Syed Ahmad Khan” was an Indian Muslim reformer who was born on October 17, 1817, and died in 1885. He founded Muhammadan Anglo-Oriental College in 1877 in Aligarh, in northern India. The college became Aligarh Muslim University in 1920.", "The image purports to show Sir Syed's image projected onto the Burj Khalifa, the world’s tallest building in Dubai, UAE.", "The image was also published here and here on Facebook with a similar claim.", "The claim is false; the photo of the Burj Khalifa has been manipulated, superimposing the portrait of Sir Syed onto the image of the skyscraper.", "A reverse image search on Yandex found this photo published on Facebook page Globo Treks on January 30, 2012.", "The same photograph was also published on the Globotreks.com blog site here.", "AFP has marked the identical key features in the misleading photo and Globo Treks’ photo with red rectangles.", "Below is a screenshot comparison of the misleading photo (L) and Globo Treks’ photo (R):", "Norbert Figueroa, the owner of the Globo Treks Facebook and blog site, told AFP he took the photo.", "“I clicked that photograph in January 2012, though I don’t remember the exact date,” he wrote in an email on October 25, 2019.", "The portrait of Sir Syed was published here on the website for Aligarh Muslim University.", "Below is a screenshot of his portrait on the university's website:", "The university's green logo, which  was superimposed on the bottom of the Burj Khalifa, can be seen here.", "The skyscraper frequently puts on light shows to honor world leaders and famous figures in the evening. On October 2, 2019, it lit up with Mahatma Gandhi’s picture to honor his 150th anniversary, its official Twitter account shows here.", "The Twitter account did not post anything on October 17, 2019. This search for Sir Syed on the Burj Khalifa's official Twitter account retrieved no results.", "Below is a screenshot of the search:", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]