["In the span of six hours, New York Times columnist Paul Krugman tweeted then retracted the claim that cholera had been reported on Puerto Rico after Hurricane Maria. Conservative websites came down hard on Krugman for his error, taking it as a case study of mainstream media spreading fake news.", "There’s no question that Krugman was wrong. Here’s how the episode played out.", "At about noon on Sept. 30, Krugman tweeted, \"Cholera. In a US territory. Among US citizens. In the 21st century. Heckuva job, Trumpie.\"", "Cholera is spread by bacteria in dirty water and can bring on severe diarrhea, so severe, it can even be fatal.", "Within minutes, people peppered Krugman with tweets asking for his source and noting that that were no confirmed cases of cholera. A University of New Hampshire journalism professor wrote, \"UPDATE (please share): Cholera outbreak in Puerto Rico is UNCONFIRMED at this time.\"", "About six hours after the initial tweet, Krugman retracted his claim.", "\"OK, cholera not confirmed,\" he wrote. \"Conjunctivitis yes; lack of clean water (situation worsening, not improving) makes it a risk. But not certain.\"", "OK, cholera not confirmed. Conjunctivitis yes; lack of clean water (situation worsening, not improving) makes it a risk. But not certain", "About half an hour before Krugman sent out his correction, the Centers for Disease Control and Prevention tweeted, \"CDC does not anticipate cholera cases in Puerto Rico or the U.S. Virgin Islands b/c of #Maria.\"", "CDC does not anticipate cholera cases in Puerto Rico or the U.S. Virgin Islands b/c of #Maria. #MariaPR https://t.co/dzSnsaj50u", "Krugman’s original tweet was shared over 14,000 times. The correction was retweeted 567 times (as of this writing).", "We were curious about where this rumor came from and asked Krugman.", "He said he saw it in a tweet from Kurt Eichenwald and \"was far too quick to assume it was validated.\"", "Kurt Eichenwald, a liberal commentator and contributing editor to Vanity Fair, tweeted on Sept. 29, \"Cases of cholera now being reported in Puerto Rico. I can’t believe this is America. We're too incompetent or uncaring to get them water?\"", "That tweet was retweeted more than 13,000 times. We found no retraction by Eichenwald on Twitter.", "Warnings for the potential for cholera had been bouncing around the web.", "A couple of days before Krugman’s tweet, the liberal information and political action website Daily KOS included and then retracted reports of the disease.  The corrected headline for a Sept. 28 blog post said \"SOS Puerto Rico: The suffering continues; Update: Cholera cases possible (not confirmed).\" At the end of the post, was this note: \"An earlier version of this diary included a Tweet saying that cases of cholera had been reported. Given the facts of the ground — including, particularly, the lack of clean drinking water — this is definitely a possibility.  Importantly, though, I have been unable to find confirmation of the information in that Tweet. I should not have posted it as fact, and have updated the title.\"", "The Daily Beast had an article that underscored the potential for an eruption of cholera. Under the headline \"Outbreaks begin in Puerto Rico while Trump tweets ‘amazing job’,\" was the warning \"mayors and a top physician tell The Daily Beast the island faces deadly outbreaks of cholera and hepatitis unless the federal government surges help.\"", "The earliest tweet we found that declared that people had cholera in Puerto Rico came on Sept. 27 from a man in Boston who wrote, without any supporting evidence, that \"Reports of cholera already breaking out.\"", "Conservative websites took Krugman to task.", "\"NYT’s Paul Krugman falsely blames ‘Trumpie’ for non-existent cholera outbreak in Puerto Rico,\" read the Daily Caller’s headline. TownHall wrote \"No, Mr. Krugman, There is not a cholera outbreak in Puerto Rico.\" And the Blaze wrote \"NYT columnist slams Trump after cholera reported in Puerto Rico — except there’s just one problem.\"", "Krugman said that cases of cholera had been reported in Puerto Rico. By his own account, that was incorrect. He assumed someone he trusted had verified the facts and the person hadn't.", "Health care professionals raised the concern that massive damage to the water supply system increased the risk of cholera, but that falls well short of an actual outbreak. While references to a cholera outbreak littered the twittersphere, those accounts were being rejected two days before Krugman’s tweet.", "We rate this claim False.", "Paul Krugman, tweet, Sept. 30, 2017", "Paul Krugman, tweet, Sept. 30, 2017", "Daily Beast, Outbreaks Begin in Puerto Rico While Trump Tweets ‘Amazing Job’, Sept. 30, 2017", "Daily Kos, SOS Puerto Rico: The Suffering Continues; Update: Cholera Cases Possible (Not Confirmed), Sept. 28, 2017", "Daniel Schneider, tweet, Sept. 27, 2017", "The Blaze, NYT columnist slams Trump after cholera reported in Puerto Rico — except there’s just one problem, Oct. 1, 2017", "Kurt Eichenwald, tweet, Sept. 29, 2017", "Centers for Disease Control and Prevention, tweet, Sept. 30, 2017", "Daily Caller, NYT’s Paul Krugman Falsely Blames ‘Trumpie’ For Non-Existent Cholera Outbreak In Puerto Rico, Sept. 30, 2017", "TownHall, No, Mr. Krugman, There is Not a Cholera Outbreak in Puerto Rico, Oct. 1, 2017", "Email interview, Paul Krugman, columnist, New York Times, Oct. 2, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]