["Social media users have shared an aerial picture of tents with different captions and linked it to the farmers’ protest. Twitter user Sanghamitra wrote in a now-deleted tweet, “Tents are giving nightmares to this regime. This fear is good.” More than 500 people had retweeted this post before it was taken down.", "Another user @GDnarbhakshi’s tweet was retweeted by over 400 people. (Archive link)", "The image has also been shared on Facebook.", "After a reverse image of this picture, we found an article from a Finland-based travel website kerranelamassa.", "The article carries pictures of the Maha Kumbh Mela, including the viral image described as, “Maha Kumbh Mela 2013.” The end of the article gives information about the Maha Kumbh Mela held in Prayagraj in 2013. The image has been credited to Ville Palonen.", "Palonen is a photographer from Finland and kerranelamassa is his website. “Yes, I took this picture during the Maha Kumbh Mela in Allahabad in 2013,” he told Alt News. He added that apart from kerranelamassa, this picture was also published on issuu.com. Other similar pictures of Maha Kumbh 2013 can also be found on Getty Images and Alamy.", "This slideshow requires JavaScript.", "At least an 8-year-old photo from Kumbh Mela was shared as a huge number of tents installed for protesting farmers. It is, however, noteworthy that agitating farmers have also set up tents in the ongoing protest.", "#India Farmers walk in front of their tents on a blocked highway during a protest against the central government’s recent agricultural reforms in Ghaziabad, along the Delhi-Uttar Pradesh state border, on December 29, 2020.#AFP pic.twitter.com/mtI8uNtelI", "— AFP Photo (@AFPphoto) December 29, 2020", "Donate Now", "A journalist and a dilettante person who always strives to learn new skills and meeting new people. Either sketching or working.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]