["“कश्मीर जहां यजीद का लश्कर दिखाई देता है वहां पर हमको बेहतर दिखाई देता है हमारी लाश किसी को नजर नहीं आती हमारे हाथ का पत्थर दिखाई सबको देता है #Save Kashmir#Save kashmri (In Kashmir, where you could see army of Yazeed, where we could see better. No one sees our dead bodies but everyone sees the stones in our hands -translated)”", "The above message was shared by a Facebook user with an image of a woman who is profusely bleeding from her head. The message suggests that this image depicts a woman from Kashmir injured by the Indian army. A few more individuals on Facebook and Twitter have shared the image with a similar message.", "We were also alerted by a user that the same image is circulating on WhatsApp.", "A Google search of the image revealed that the image is not from India. We found an article published by a Shia News website called JafariyaNews.com in February 2005, according to which these images depict the observation of Ashura, the tenth day of Muharram. The Shia Muslim sect mourns the sacrifice of Imam Hussein, the son of Hazrat Ali and the grandson of Prophet Muhammad on this day. They commonly practice chest-beating (Latyma), self-flagellation and cut their foreheads.", "In the article, this picture was posted under the section titled, “Lebanon”, which suggests that the picture could possibly be from Lebanon.", "It is noteworthy that sharp objects, penetrating people’s skulls, are visible in the image.", "In conclusion, an image taken during the observation of Ashura, where a woman was bleeding from a self-inflicted wound, was shared as a picture portraying atrocities by the Indian army in Kashmir.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]