["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "At the dawn of the new millennium, the United Nations set a goal of eradicating poverty by 2030. With 14 years left to go, we’ve already reduced the proportion of destitute people in world by 50 percent, according to U.S. Agency for International Development administrator Gayle Smith.", "\"I think everyone in the room knows that this is a moment of extraordinary progress. Over the last 30 years, extreme poverty has been cut in half. Boys and girls are enrolling in primary school at nearly equal rates, and there are half as many children out of school today as there were 15 years ago,\" Smith said in a speech on Capitol Hill.", "We looked at the education figures in a separate fact-check, but we also wondered if extreme poverty really has been halved.", "According the World Bank, the reduction is actually greater than what Smith stated.", "The global poverty line", "Extreme poverty typically refers to the minimum consumption level of the world’s poorest people.", "The World Bank first defined this in 1990 as living on $1 a day or less, by converting the national poverty lines of a group of the poorest countries into a common currency based on their purchasing power. Since then, the World Bank has raised the bar every few years to adjust for inflation.", "A spokesperson for USAID referred us to a United Nations report based on the 2008 definition of $1.25 a day or less. According to the report, the proportion of people living in extreme poverty fell from 36 percent in 1990 to 15 percent in 2011 — a 58 percent reduction in 21 years, more than what Smith claimed.", "By the current metric of $1.90 a day, the decline is even greater. According to the World Bank, 1.9 billion people (or 37.1 percent of the global population) lived on less than $1.90 a day in 1990, compared to a projected 702 million (9.6 percent) in 2015. That’s a 74.1 percent decline in 25 years.", "We should stipulate that the World Bank’s definition of extreme is by no means perfect. For 25 years, critics have pointed to methodological issues while others have questioned the very notion of a one-poverty-line-fits-all approach.", "Princeton University economist and Nobel laureate Angus Deaton, for example, pointed out in 2010 that the World Bank’s standard is based on the most destitute places in the world and neglects the issue of regional inequality. So the poverty count would effectively include \"all of the locally poor Indians, and none of the locally poor Americans.\"", "In short, the global poverty line is \"an inaccurately measured and arbitrary cut off,\" said Charles Kenny, a senior fellow at the Center for Global Development. \"I know I’d consider myself extremely poor on multiples of ($1.90 a day). And no one doubts that people on $1.91 are still really, really poor.\"", "Nonetheless, the World Bank’s estimate still gives a good sense of just how many people live in abject poverty, Kenny added, so Smith’s claim of \" ‘halving’ is suitably cautious and about as accurate as you are going to get.\"", "Other approaches", "The World Bank’s global poverty line isn’t the only measure of poverty out there. By many other definitions, the World Bank's count of the desperately poor is low-balled.", "In a 2012 working paper, the World Food Programme’s Ugo Gentilini and the Institute of Development Studies’ Andy Sumner looked at national poverty lines and found that 1.5 billion people are poor, according to their own countries — more than double the number under the World Bank’s definition.", "The Agriculture Department's Thrifty Food Plan, the minimum cost of getting adequate nutrition in the United States, was the basis for an alternative poverty metric by economists Sanjay Reddy of the New School and Rahul ​Lahoti of the University of Göttingen. Reddy and Lahoti applied purchasing power exchange rates for the $5.04 plan and, just to be cautious, half its value.", "According to this analysis, the percent of people who live below the higher poverty line ($5.04) was cut by 18 percent from 1980 to 2012, and the poverty headcount at the lower line ($2.52) was reduced by 37 percent.", "To some, income or consumption alone isn’t enough to define poverty. The University of Oxford’s multidimensional poverty index considers a host of other indicators such as nutrition, child mortality, education, and access to electricity and water.", "By this definition, there are still 1.6 billion people living in poverty.  While Oxford doesn’t have long-term data, it did calculate the change in multidimensional poverty in 34 countries over various periods, spanning from two to eight years. On average, multidimensional poverty decreased 5.6 percent (albeit in much short time frames).", "Then there’s the idea proposed by Harvard University development economist Lant Pritchett that poverty lines shouldn’t just measure destitution, but rather set a global standard for human well-being. Pritchett suggested a high poverty line of $12.50 or even $15 a day. Under this definition, billions more would be considered poor.", "\"There seems to be massive global inequity built into definitions of poverty that do not allow the world’s population to even aspire to the living standards of the now rich industrial world,\" Pritchett wrote in a 2013 blogpost. \"Roughly speaking, about 1 billion people are in extreme poverty, about 1 billion are above a high threshold and 5 billion are in between. Why would we want to build a development agenda that did not measure how the standard of living of those 5 billion people is progressing?\"", "Our ruling", "Smith said, \"Over the last 30 years, extreme poverty has been cut in half.\"", "By World Bank figures, Smith actually understated the reduction. We’ve cut extreme poverty by 58 percent using the 2008 definition of extreme poverty, and 74.1 percent by the 2015 definition.", "While we don’t quibble with Smith using that metric, our research shows that there are other ways of determining poverty, and those different ways show different declines. Moreover, defining poverty is not an exact science, experts say.", "Because of those caveats, we rate Smith’s claim Mostly True.", "Medium, \"#FutureofAid by USAID Administrator Gayle Smith,\" March 9, 2016", "Review of Income and Wealth, \"Quantifying absolute poverty in the developing world,\" December 1991", "World Bank, \"The Millennium Development Goals Report 2015,\" July 2015", "World Bank, \"A Global Count of the Extreme Poor in 2012,\" October 2015", "World Bank, \"Poverty Overview,\" Oct. 7, 2015", "World Bank, \"Growth and Poverty in Developing Countries,\" December 1978", "Brookings Institution, \"The Contradictions in Global Poverty Numbers,\" March 6, 2012", "Center for Global Development, \"The World Bank’s New Global Poverty Line,\" Oct. 7, 2015", "Oxfam, \"Should poverty be defined by a single international poverty line, or country by country? (and what difference does it make?),\" July 24, 2012", "American Economic Review, \"Price Indexes, Inequality, and the Measurement of World Poverty,\" 2010", "Institute of Development Studies, \"What Do National Poverty Lines Tell Us About Global Poverty?,\" 2012", "Sanjay Reddy and Rahul ​Lahoti, \"$1.90 Per Day: What Does it Say?\" Oct. 6, 2015", "Oxford Development Studies, \"Global MPI 2015: Key findings,\" accessed March 21, 2016", "Development Progress, \"Monitoring progress on poverty: the case for a high global poverty line,\" May 16, 2013", "The Economist, \"Not always with us,\" June 1, 2013", "Oxford Development Studies, \"Does it Matter that we do not Agree on the Definition of Poverty? A Comparison of Four Approaches,\" September 2003", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]