["The image was published here on Facebook  on November 22, 2020.", "The text reads: “1 serving of toothpaste contains 0.22mg of Fluoride. OUR POISON CONTROL AUTHORITIES TELL US: Call poison control if swallowed.", "“1 glass of tap water contains 0. 21mg of Fluoride. OUR HEALTH AUTHORITES [sic] TELL US: Drink 8 glasses per day.", "“Both toothpaste and tap water contain fluoride from the waste systems of the phosphate fertilizer industry.", "“These chemicals (90% of which are sodium fluorosilicate and fluorosilicic acid) are classified as hazardous wastes contaminated with varius [sic] impurities and known to cause cancer, infertility, brain degradation, and bone loss”", "However, experts say the claim is false.", "Matt Hopcraft, an associate professor at the Melbourne Dental School, told AFP via email on November 24, 2020, that one would have to consume very high levels of toothpaste and tap water for the fluoride in it to be toxic.", "Hopcraft explained that a toxic dose of fluoride is 5mg per kilogram of body weight, meaning that for a 70kg adult, it would amount to 350mg of fluoride.", "“Tap water in Australia where it is fluoridated is generally around 1 part per million (ppm), so a 250ml glass of water would have 0.25mg fluoride. An adult would need to drink 1400 glasses to reach a toxic dose! An infant would need to drink 200 glasses,” he said.", "In adult toothpaste, Hopcraft added, there is 1000-1500 ppm of fluoride, and kids toothpaste generally has around 400-500 ppm.", "“So adult toothpaste will have ~0.22mg in a pea sized amount to brush teeth, and a child’s about ½ of that,” he said.", "“To reach a toxic dose for a 10kg infant, they would need to eat half a tube of adult toothpaste. The toxicity warning on the label is related to that level of consumption – it’s not saying that the normal amount of toothpaste is toxic.”", "Additionally, the Australian National Health and Medical Research Council stated in a Q&A on water fluoridation that it “found no evidence that community water fluoridation at current Australian levels causes human health problems”.", "“The NHMRC Nutrient Reference Values for Australia and New Zealand identifies 10 milligrams per day as the upper level of fluoride intake for an average-sized adult. To meet or exceed this level of intake means drinking at least 10 litres per day of water with fluoride at current Australian levels,” the document reads.", "“However, regardless of any fluoride content in the water, this is a dangerously high level of water intake and is not recommended because of the risk of water overloading, even for people such as athletes, outdoor workers, military personnel and those living in hot and humid climates, who may approach this level of consumption occasionally.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]