["The claim was shared here on Facebook on March 9, 2021.", "“This is why I drink, although I hate alcohol,” says the Korean-language claim.", "The claim was shared alongside what appears to be a screenshot of a news report.", "The Korean-language text in the screenshot translates to English as:", "“Women who drink live longer and have a stronger heart.", "“Did you know women who drink alcohol have a 35% less chance of suffering from a heart attack? In the past, the British newspaper Daily Mail introduced a novel research result that those with an acute myocardial infarction can reduce the risk of passing away by drinking steadily.”", "An identical text screenshot and similar claims have been shared on Facebook here, here, here and here.", "However, the claim omits important context. The referenced study in fact surveyed only women hospitalised for a heart attack and found drinking alcohol could be beneficial specifically for female survivors of a heart attack.", "Keyword searches found the image is a screenshot taken from this blog post published by South Korean online newspaper Medipana on 25 November, 2011.", "Below is a screenshot between the image in the misleading posts (L) and the report from Medipana (R):", "Medipana’s post was written based on an article by the British newspaper Daily Mail titled “Drinking alcohol ‘improves your chances of surviving a heart attack’” that was published 28 October, 2011.", "In that report, Daily Mail cited a study published by Harvard University Medical School, which surveyed more than 1,200 women who had been hospitalised for a heart attack.", "Among those who already suffered from an acute myocardial infarction (MI), people who drank anything from a few alcoholic drinks a month to more than three a week in the year leading up to a heart attack ended up living longer than women who never drank alcohol, according to the study.", "MI stands for myocardial infarction, which is the medical term for a heart attack.", "“In conclusion, in women who survive MI, moderate drinking is associated with a decreased risk for mortality, with no clear differences on the basis of pattern or beverage type,” reads the study.", "“These results suggest that women who survive MI need not abstain from alcohol, but any derived benefit would appear to occur well below currently recommended limits in alcohol consumption,” it adds.", "Multiple organisations including the World Health Organisation warn about the dangers of excessive alcohol consumption, with some like the US Centers for Disease Control saying it is a particular risk to women's health.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]