["In the backdrop of protests against the death of African-American man George Floyd in the custody of Minneapolis police, a video of protesters supposedly storming the White House in Washington D.C. is doing the rounds on social media. Twitter handle @ZaheerHumanist posted the video with the message, “For the first time in American History, Protestors broke in and down the #WhiteHouse“. The tweet has amassed over 3,100 retweets so far.", "For the first time in American History, Protestors broke in and down the #WhiteHouse … #WhiteHouseProtests #WhiteHouseDown pic.twitter.com/3mqYS3NDUl", "— A Humanist (@ZaheerHumanist) June 1, 2020", "On June 1, Columnist Rajeev Sharma tweeted the video and said, “Protestors sneak inside #WhiteHouse for the first time in #US history. Firing reported near east gate of White House. #DonaldTrump taken to underground bunker for nearly an hour. As many as 40 American cities are under curfew over the death of #GeorgeFloyd in police custody!”. He claimed that for the first time in the history of the United States protesters sneaked inside in the White House.", "Protestors sneak inside #WhiteHouse for the first time in #US history. Firing reported near east gate of White House. #DonaldTrump taken to underground bunker for nearly an hour. As many as 40 American cities are under curfew over the death of #GeorgeFloyd in police custody! pic.twitter.com/uqW7xSRbpC", "— Rajeev Sharma (@kishkindha) June 1, 2020", "A similar post by a Facebook page Products and Services Promotions was viewed more than 16,000 times at the time of writing this article. The video is viral on Twitter and Facebook with the same narrative.", "First time In History- Protestors Broke Into The Capitol Hill For The First Time In American USA History.", "Posted by Products and Services Promotions on Sunday, 31 May 2020", "Alt News broke the video into multiple keyframes using digital verification tool InVid. We then performed a reverse image search on one of the keyframes and found an article published by the website Newsup on May 29, 2020. The article informed that protesters tried to break inside the Ohio Statehouse.", "At the beginning of the video, one can spot name boards – Keybank and Chase – on top of two buildings. With a keyword search on Google Maps, we found several images of Ohio Statehouse where these buildings are visible in the background.", "Moreover, a comparison of the building seen in the viral video with the images of Statehouse in Columbus, Ohio clearly shows that it’s the same building.", "With the help of Google street view, we were able to confirm that the building seen in the video is Statehouse in Columbus.", "According to media reports covering the protest outside the Statehouse, protesters are gathering outside the Statehouse from last few days. Therefore, a video of protesters storming the Statehouse in Ohio was shared as White House in Washington D.C.", "Donate Now", "Kinjal Parmar holds a Bachelor of Science in Microbiology. However, her keen interest in journalism, drove her to pursue journalism from the Indian Institute of Mass Communication. At Alt News since 2019, she focuses on authentication of information which includes visual verification, media misreports, examining mis/disinformation across social media. She is the lead video producer at Alt News and manages social media accounts for the organization.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]