["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Emory University officials are considering closing this Chick-fil-A restaurant.", "Emory University’s newspaper, The Emory Wheel, reported last month that the university will boot Chick-fil-A off campus this summer.", "The move comes after Chick-fil-A President Dan Cathy last year angered supporters of same-sex marriage. David Furhman, the senior director of Emory’s Food Service Administration, told the Wheel that the decision to remove Chick-fil-A was not spurred by the Cathy controversy. It was, he said, based solely on student feedback from surveys and focus groups.", "\"What we learned was that there was no great affinity or love for Chick-fil-A,\" Furhman said in a March 12 article in the Wheel. \"It was more of an affinity or love of the convenience, and what students also told us was that they didn’t really love Chick-fil-A.\"", "PolitiFact Georgia wondered: Was Emory's decision triggered solely by focus-group feedback?", "And we wanted to know what that feedback included.", "The conflict began when Cathy discussed same-sex marriage in a July 2012 interview.", "\"I think we are inviting God's judgment on our nation when we shake our fist at Him and say, 'We know better than you as to what constitutes a marriage,'\" Cathy said.", "Critics called for boycotts. Supporters rallied to Cathy’s defense, organizing a \"Chick-fil-A Appreciation Day\" that packed eateries.", "Chick-fil-A, which began in metro Atlanta and is headquartered here, did not respond to an interview request.", "Emory groups, including gay rights organizations and the Student Government Association, formally requested the removal of Chick-fil-A after the controversy began. Senior Director and Dean of Campus Life Ajay Nair released a statement saying the university wouldn’t remove the eatery based on Cathy’s comments.", "But in February, the university and a student committee called FACE (Food Administration Committee Emory) said they were going to review all campus food venues, including Chick-fil-A.", "Furhman told the Wheel that the examination of the campus food venues where Chick-fil-A is located predated the controversy. But both student co-chairs of FACE contradicted that. They said the review plan began when Furhman joined Emory in January.", "PolitiFact contacted Furhman, who referred all inquiries to Campus Communications. He declined to answer our questions.", "Nair said in the Wheel: \"Through (dialogue over Chick-fil-A), we also learned that a re-visioning of dining at Emory could foster a separate, positive community change, while addressing students’ concerns around their dining experiences.\"", "One student co-chair of the food committee, Karoline Porcello, told the Wheel the restaurant’s values were a contributing, but not deciding factor in its removal. In an email, Porcello clarified that those values referred to \"human development values\" such as physical well-being, not political values.", "After PolitiFact Georgia reached out to Campus Communications, Porcello said: \"We've received strict instructions by Emory to no longer comment on the issue.\"", "Michael Sacks, another co-chair, said the removal was not political.", "\"It’s kind of unfortunate that people very easily jump to the conclusion that Chick-fil-A’s political views were the reason we got rid of them, but that was not our intention at all,\" Sacks told WSB Radio.", "The process reviewed each venue according to six criteria, including consistency with the campus life department’s core values and survey data.", "The committee held open monthly meetings and focus groups with more than 30 volunteer attendees who answered FACE’s questions. In all three of the monthly meeting documents on the FACE website, Chick-fil-A was not mentioned.", "Sacks sent over three of the four focus groups’ minutes. He said that he was told that the last meeting \"did not present much opportunity for note-taking.\"", "The three focus group minutes didn’t conclusively show a distaste for Chick-fil-A. Some attendees said they eat at Chick-fil-A often while others showed distaste for the venue. One document even said \"Keep Chick-fil-A\" in the summary box.", "Porcello said some focus group members wanted to remove Chick-fil-A for health reasons and that some said they only liked the convenience of the venue. The documents provided to PolitiFact Georgia didn’t confirm those claims. Porcello didn’t respond to requests to do so.", "In a March meeting, the food committee put three floor plans up for a vote. None of the plans included Chick-fil-A or Pizza Hut. Sacks said that decision was based on the focus groups.", "Ultimately, the redesign will replace Chick-fil-A with a pizza and pasta venue, expand Mexican food and salad areas and create a grab-and-go station and a coffee and bakery area. The committee chairs said the university will remove Pizza Hut as well.", "Dena Smith, Emory’s senior communication officer, sent PolitiFact a link to a March 12 Campus Life statement indicating that Emory would announce a final Chick-fil-A decision soon. She said Emory would consider FACE’s input, which does not include \"a chicken restaurant.\" This statement was released the same day that the Wheel and WSB Radio published their stories about the venue’s closure.", "PolitiFact contacted 15 Emory political science professors for a comment. None wanted to weigh in on the controversy.", "Kennesaw State University political science professor Kerwin Swint says that it is difficult to believe that the decision wasn’t political. He said that Emory’s role as  \"ground zero\" of the Chick-fil-A debate may have something to do with its defense.", "\"I’m not saying that it isn’t true,\" Swint said, \"But I work on a college campus ... and I can tell you that Chick-fil-A is probably the most popular dining option (on my campus).\"", "Our conclusion:", "An Emory administrator said that a proposal to remove Chick-fil-A from a campus dining hall was not politically motivated but was instead based on focus groups. Campus officials have offered conflicting statements about Chick-fil-A’s future.", "PolitiFact rules require the person making the statement to provide the proof to back it up. Furhman and Emory failed to do so.", "There apparently was an objective process that reviewed all food vendors, but only incomplete documentation was provided. That documentation didn’t confirm any of the sources’ claims. And the final redesign plan doesn’t indicate the committee was concentrating on health concerns. It  wants to remove Chick-fil-A, but plans call for a proposed pizza and pasta joint and expanded Mexican food areas. Not exactly healthy alternatives.", "We rated the claim Half True.", "(Karishma Mehrotra is a journalism major at Emory University who is completing an internship with PolitiFact Georgia. She is also an editor at The Emory Wheel but took no part in the Chick-fil-A news coverage.)", "The Emory Wheel, \"FACE Holds Open Meeting, Discusses Food Venues,\" Feb 8, 2013", "The Emory Wheel, \"Students Protest Emory Chick-fil-A,\" Nov 1, 2012", "The Emory Wheel, \"Committee Calls for Chick-fil-A’s Removal,\" Sept. 7, 2012", "The Emory Wheel, \"Our Opinion: Chick-fil-A Must Go,\" Sept. 7, 2012", "The Emory Wheel, \"Letter from LGBT Alumni Regarding Chick-fil-A,\" Sept. 8, 2012", "The Emory Wheel, \"Letter to the Editor: Kicking Chick-fil-A Off Campus Would Amount to Censorship,\" Sept. 11, 2012", "The Emory Wheel, \"Removing Chick-fil-A is Not Censorship,\" Sept. 13, 2012", "The Emory Wheel, \"An Open Letter to President Wagner and Dean Nair,\" Oct. 25, 2012", "The Emory Wheel, \"Students Protest Emory Chick-fil-A,\" Nov. 1, 2012", "The Emory Wheel, \"Emory to Assess Dining Options,\" Feb. 4, 2013", "The Emory Wheel, \"Emory to Remove Chick-fil-A From Cox Hall,\" March 12, 2013", "The Emory Wheel, \"SGA Passes Resolution Supporting LGBTQ Community,\" Dec. 3, 2012", "The Emory Wheel, \"Emory Statement Regarding Chick-fil-A Controversy,\" Aug. 9, 2012", "Huffington Post, \"Chick-fil-A Scrapped By Northeastern University After Students Object to Company’s ‘Anti-Gay’ Support,\" Feb. 29, 2012", "Huffington Post, \"Dan Cathy, Chick-fil-A President, On Anti-Gay Stance: 'Guilty As Charged,’\" July 17, 2012", "Emory News Center, \"Emory nationally recognized for LGBT support,\" Aug. 23, 2012", "WSB Radio, \" Emory University dumps Chick-fil-A,\" March 12, 2013", "The Emory Wheel, \"Our Opinion: FACE knows student tastes,\" March 21, 2013", "Emory University, \"Campus Dining Cox Hall Redesign,\" March 12, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]