["The video was published on Facebook here on September 24, 2020. It has been viewed more than 900 times.", "A logo for Chinese television channel Hunan TV is superimposed on the top left-hand side of the footage. The words “WORLD’S GOT TALENT” can be seen written in simplified Chinese and English in the bottom right-hand corner. A logo for Chinese video platform Xigua Video can also be seen in the top right-hand corner of the video.", "The post’s simplified Chinese-language caption translates to English as: “The woman has been 74 years old, and the man is her grandson. Life ought to be that wonderful”.", "The same video has circulated on Facebook since at least July 2019 with a similar claim. In 2020, it was also shared here, here and here on Facebook; and here on Twitter with a similar claim.", "The claim is false.", "At the beginning of the video, the names “Wu Zhengdan” and “Wei Baohua” appear in a simplified Chinese chyron.", "Below is a screenshot of the video at the one-second mark with the two names circled in red by AFP:", "A keyword search of the performers’ names found this verified Weibo account for Wu Zhengdan, a female Chinese acrobat.", "The account page states that Wu was born on January 7, 1981.", "Below is a screenshot of Wu’s Weibo page, with her birthday circled in red by AFP:", "Another keyword search found a longer version of the performance published here on another Hunan TV’s Weibo account on April 19, 2019.​", "The footage in the misleading posts can be seen in the Weibo video from the five-minute 47-second mark.", "Below is a screenshot comparison of the video in the misleading posts (L) and the Weibo footage (R):", "At the Weibo video’s three-minute 49-second mark, a judge can be heard introducing Wu Zhengdan and Wei Baohua in Mandarin. “They are husband and wife,” the judge can be heard saying.", "Below are two screenshots of the Weibo footage at the three-minute 49-second mark. AFP has circled the subtitles at the bottom left showing the judge’s words.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]