["The two-minute, 34-second clip was published on Facebook here on October 28, 2019. It has been viewed almost 3,000 times.", "The post's Indonesian-language caption translates to English as: “Governor of Michigan USA. The first Muslim governor in the USA. Welcome to the rise of Islam.”", "Below is the screenshot of the misleading Facebook post:", "Michigan is a state in the American Midwest.", "The video has been shared with a similar claim in Facebook posts since at least 2018, including here, here and here, where it has been shared more than 2,700 times and viewed nearly 80,000 times.", "The same video was also shared in Facebook posts here and here with a similar claim in English.", "The claim is false. The video shows Abdul El-Sayed campaigning as a Michigan Muslim governor candidate in the 2018 gubernatorial election; he lost the Democratic primary.", "A logo for London-based news outlet Middle East Eye can be seen in the top right-hand corner of the video.", "A keyword search on Google found the original clip published on Middle East Eye's official Facebook page here on August 6, 2018, headlined: “Abdul el-Sayed: America’s first Muslim governor?”", "The clip’s caption reads: “Meet the man who could be America’s first Muslim governor, Doctor Abdul el-Sayed.”", "Below is the screenshot comparison of the clip in the misleading post (L) and the original video (R):", "Vox published this report on the 2018 Michigan primary elections on August 8, 2018. It stated that El-Sayed was one of Michigan Democratic gubernatorial candidates but lost the primary to Gretchen Whitmer.", "Whitmer later won 53 per cent of the vote in the gubernatorial election, defeating Republican candidate Bill Schuette, according to this report published on November 6, 2018 by the Detroit Free Press.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]