["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "President Barack Obama’s younger daughter Sasha Obama didn’t go off on her biology teacher in a \"racist anti-white rant.\" She hasn’t been expelled, either.", "The website ConservativeColumns.com made these claims, citing the nonexistent DC Gazette-Intelligencer. A link supposedly to the original report redirects to an article from The Aquila Report titled \"Mother, adult son fight for right to incestuous relationship.\"", "This story was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The Obama sisters are frequent targets of malicious websites. We debunked a similar expulsion story about Malia Obama in April. The headline: \"Malia Obama suspended after racist anti-white attack goes viral.\"", "Neither of these stories are true. Malia is currently attending Harvard University, and Sasha is a senior at Sidwell Friends School in Washington.", "The story was copied from the website America’s Last Line of Defense, which self-identifies as a satire site. Conservative Columns does not include a disclaimer on its home page or on the story.", "In addition to the identical content, the America’s Last Line of Defense article appears under the same headline as conservativecolumns.com, and it’s filed in the site’s category of \"You'll have to wait for the Snopes debunk to tell If it's ‘satire’ or not.\"", "This story was copied from a conservative satire site and then touted as fact. It’s not.", "We rate this claim Pants on Fire!", "ConservativeColumns.com, \"UPDATE: Sasha Obama’s racist anti-white rant just got her expelled,\" Sept. 3, 2018", "America’s Last Line of Defense, \"UPDATE: Sasha Obama’s racist anti-white rant just got her expelled,\" Sept. 2, 2018", "America’s Last Line of Defense, \"About,\" Accessed Sept. 4, 2018", "PolitiFact, \"Fake story says Malia Obama suspended from Harvard,\" April 10, 2018", "Business Insider, \"'First kid' Barron Trump is heading to a $40,000 private school in Maryland — here's where the other first kids went to school,\" July 14, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]