["About this rating", "A police officer in Virginia pulled over Chy-Niece Thacker because her car's brake lights were out and eventually let her go on her way without citing her.", "The officer didn't let Thacker off without citing her because of what he found in the trunk of her car, nor because the woman was recording him.", "Many different clickbait and arbitrage websites have published articles about a seemingly recent incident in which a motorist named Chy-Niece Thacker was pulled over by a police officer and then let go after the officer -- who was being furtively recorded by the driver -- popped her trunk and found something alarming or surprising there:", "The implication of all these misleading and incomplete headlines was that the officer found something so shocking or unusual in the trunk of the woman's car (an explosive device? biohazardous material?) that he let the driver go for his own safety (without even calling for backup), or that the motorist recorded him engaging in some unlawful act (such as stealing something from her trunk) and thus he didn't dare cite her.", "In fact, the underlying incident described in these articles took place back in 2017, and it was not shocking at all but rather mundane (although somewhat heartwarming).", "As the driver in this tale, Chy-Niece Thacker posted on her Facebook page, while on her way to a job interview she was stopped by Officer Jenkins of the Henrico County Police because the brake lights in her car were not functioning. Thacker was upset at this circumstance because, she said, she'd just had the brake lights on that vehicle replaced a month earlier. Jenkins asked Thacker to pop the trunk so he could inspect the brake lights, then instructed her to \"pop the hood to check the relay box\":", "After spending about half an hour tinkering with her car to see if he could get the lights working again, Jenkins had Thacker turn on her vehicle's hazard lights and then escorted her to the closet mechanic to get them repaired. Although he could have done so, Jenkins declined to cite Thacker for non-functioning brake lights, telling her that \"he cared more about her safety than giving her a ticket\":", "\"We've seen so many stories where a traffic stop has turned into the death [of an officer], and it's given people a bad taste in their mouth. I think this one officer helping can set a trend,\" Thacker said.", "Contrary to the implications of clickbait headlines, the police officer in this story didn't let a motorist off because of what he found in the trunk of her car, nor because his interaction with her had been recorded. In fact, the officer in this incident was not recorded in either an audio or a video sense -- the driver merely took some photographs of him as he attempted to repair the brake lights on her vehicle.", "David Mikkelson founded the site now known as snopes.com back in 1994 as a creative outgrowth of his wide-ranging interests in a variety of subjects (particularly folklo ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]