["About this rating", "Margaret Sanger once gave a talk before a women's branch of the Ku Klux Klan.", "A photograph purportedly showing Sanger at a Klan rally is not genuine, and Sanger expressed no affinity for the KKK.", "A controversy in mid-2015 regarding Planned Parenthood and the purported sale of fetal tissue ignited many social media debates about reproductive health, and among the many threads of discussion were numerous claims about Planned Parenthood founder Margaret Sanger.", "A common assertion about Sanger's legacy holds that her efforts to afford women (and families) expanded reproductive agency were racist in nature (as demonstrated by a rumor holding that Sanger once described people of color as \"weeds\" that ought to be \"exterminated\"). The 2015 Planned Parenthood controversy debate was peppered with postings of a photograph alongside myriad claims that it documented Sanger's addressing Ku Klux Klan members (presumably to garner support for her endeavors among violent extremists with whom she shared a vision of white supremacy):", "Unlike other tidbits of lore that have since evolved to paint Sanger as unapologetically racist, the veracity of the photograph depicting her addressing female KKK members was easily determined. An original version of the photograph in question was uploaded to the white supremacist web site Stormfront in February 2008, and it shows that the original image featured a lit cross that was edited out and replaced with an picture of Sanger:", "Viewers confused about the image's veracity could be partially excused, as the blog with which it appeared to have originated (ostensibly fabricated to illustrate a point) was offline by the time the photograph began circulating widely in 2015 (although an archived copy of that blog post can be seen here). The quote that inspired the photograph was itself a falsehood.", "With its original context largely erased from the Internet, the doctored photograph gained traction among Planned Parenthood's detractors. By September 2015, the image had been merged with a backstory that had no connection to the original photograph:", "Although the image was a fabrication, it did include a grain of (distorted) truth in its assertion that Sanger once addressed female KKK members in Silver Lake, New Jersey:", "There is little question that Sanger supported the eugenics movement, but one statement really stuck out. Sanger was \"an active participant in the Ku Klux Klan.\"", "It turns out, Sanger did speak to a group connected to the KKK and wrote about it openly. In Margaret Sanger: An Autobiography, published in 1938, Sanger details her work advocating birth control across the United States and emphasizes her willingness to talk to virtually anyone.", "\"Always to me any aroused group was a good group,\" Sanger writes, \"and therefore I accepted an invitation to talk to the women's branch of the Ku Klux Klan at Silver Lake, New Jersey, one of the weirdest experiences I had in lecturing.\"", "While Sanger did speak to such an audience in 1926, \"she didn't hold the group in the highest esteem,\" and Dr. Martin Luther King, Jr. spoke favorably of her at the height of the U.S. civil rights movement:\n\"Never before had I looked into a sea of faces like these. I was sure that if I uttered one word, such as abortion, outside the usual vocabulary of these women they would go off into hysteria. And so my address that night had to be in the most elementary terms, as though I were trying to make children understand,\" Sanger writes.", "We should also note that in 1966, while she was still alive, Planned Parenthood bestowed the Margaret Sanger award on Martin Luther King Jr. He accepted, and while he was unable to attend the event, his wife Coretta showed up in his place to read his speech. In it, King wrote:", "\"There is a striking kinship between our movement and Margaret Sanger's early efforts. She, like we, saw the horrifying conditions of ghetto life. Like we, she knew that all of society is poisoned by cancerous slums. Like we, she was a direct actionist — a nonviolent resister.\"", "Given the fact that Sanger’s autobiography had been published nearly 30 years before King’s speech, her earlier address was no secret. It should be clear the civil rights leader did not think of Sanger as a racist.", "In short, Sanger once addressed female KKK members in a bid to have her message heard as widely as possible, but she both openly described that meeting and disparaged the group's mission in her writings, and a photograph supposedly depicting that talk (or a similar one) is fabricated.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]