["The claim was published on a website in Burmese here.", "The title of the first misleading post translates to English as: “Big plan in the works for all Myanmar citizens to get free phone internet\".", "Following that title, the article states in part: “Myanmar is going to launch its own satellite using Japan’s technology. The satellite will be built by Myanmar engineers and launched into orbit with the help of the University of Hokkaido and Tohoku University. The satellite will be used for agricultural and environmental monitoring purposes.”", "A similar claim was also published in articles here and here.", "The articles were also published here and here on Facebook on June 13, 2020. The posts were shared hundreds of times.", "The claim is false. In an interview on June 15, Dr. Kyi Thwin, Rector of Myanmar Aerospace Engineering University, told AFP: “The satellite will not give any internet access to people because what we are going to build is a micro satellite that will only give us images. It is not a communications satellite.”", "Dr. Kyi Thwin said the satellite will be used to take satellite images for urban planning, transportation, weather forecasting, and agriculture purposes.", "The misleading articles referenced this article by Japanese news site Nikkei Asian Review, but failed to accurately report the details in the article.", "The Nikkei Asian Review article states Myanmar’s first satellite will be launched in 2021 with the help of Japan's Hokkaido University and Tohoku University. The article does not, however, suggest the satellite will give free internet access to Myanmar citizens.", "The report published by Nikkei Asia Review reads in part: “The satellite will be an earth observation satellite, which will be used to raise productivity in agriculture, as well as to prevent and reduce damage from disasters and monitor environmental pollution, Yukihiro Takahashi, a professor at Hokkaido University and director of the university's Space Mission Center, told Nikkei.”", "The article also says “graduate students from Myanmar Aerospace Engineering University, a national university in Myanmar, will come to Japan” and “develop two satellites over five years and learn to analyse satellite data”.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]