["Democratic Senate hopeful Tim Kaine says a key step in building a workforce trained for the future is to ensure all children are prepared to enter kindergarten. And he offers his record as governor as proof of his commitment to that goal.\n\n\"The research clearly demonstrates high-quality early childhood opportunities help children succeed,\" he wrote in a paper laying out his economic policies. \"That’s why we expanded participation in Virginia in early childhood programs by nearly 40 percent...\"\n\nWe checked whether Virginia’s early childhood programs really did grow by 40 percent during Kaine’s term as governor from 2006 to 2010.\n\nDuring his gubernatorial campaign, Kaine proposed making Virginia’s pre-kindergarten program available to all 4-year-olds -- not just those from families living close to the poverty line. The universal access was estimated to cost $300 million a year.\n\nOnce in office, Kaine scaled back that ambition in the face of a recession that eroded state revenues. But he did seek increases preschool programs every year during his term.\n\nBudget records show he proposed an extra $4.6 million for the 2007-08 fiscal year to add 1,250 children to the program. In his full biennial budget, which covered 2008 through 2010, Kaine sought $56 million in additional funding, according to reports. The request was pared to $40 million, then $22 million, as lawmakers sought to cope with the recession.\n\nOver the course of Kaine’s term, the Virginia Preschool Initiative saw a steady rise to its annual budget from $46.3 to $58.6 million. (That trend has continued into the recently approved budget, which provided $68.2 million for 2013 and $68.5 million for 2014.)\n\nVirginia Preschool Initiative teaches social and learning skills to 4-year-olds who will become eligible for free or reduced lunch programs when they enter public schools. The pre-K program is open to at-risk children who live above the poverty line. Children below that line qualify for the federal Head Start program.\n\nIn the 2005-06 school year, when Kaine took office, 11,343 children were enrolled in Virginia’s preschool initiative. By the time his term ended, in the 2009-10 school year, the program had 15,901 children. The increase is 40.2 percent.\n\nOur ruling\nKaine claimed that he was part of expanding participation in early childhood programs in Virginia by nearly 40 percent. The numbers confirm that.\n\nWe rate Kaine’s statement True.", "Kaine for Virginia, \"A Vision for our Economic Future,\" accessed May 2, 2012.\n\nVirginia Department of Education, VPI PPA History 2004-2011, received May 2, 2012.\n\nVirginia Department of Education, \"Fall Membership Reports, Division Totals by Grade,\" accessed May 2, 2012.\n\nPolitiFact Virginia, \"Sen. George Barker says McDonnell’s budget cuts pre-kindergarten program,\" Feb. 9, 2012.\n\nVirginia Department of Planning and Budget, 2007-08 proposed budget amendments, accessed May 2, 2012.\n\nVirginia Senate Finance Committee, Conference report on budget amendments for 2012-14, April 17, 2012.\n\nEmail from Brandi Hoffine, Kaine spokeswoman, May 4, 2012.\n\nStaunton Daily News Leader, \"11 local early childhood programs participate in state quality rankings,\" Dec. 9, 2009.\n\nRichmond Times-Dispatch, \"Kaine had wins but took some lumps as governor,\" Jan. 3, 2010.\n\nRichmond Times-Dispatch, \"State budget battle looms -- It’s ‘conservative’ to Kaine, a ‘frenzy’ to GOP,\" Dec. 18, 2007.\n\nThe Virginian-Pilot (Norfolk, Va.), \"In search of another R: Revenue,\" Jan. 2, 2008.\n\nThe Virginian-Pilot (Norfolk, Va.), \"Lawmakers break impasse on 2-year, $77B spending plan,\" March 11, 2008.\n\nRichmond Times-Dispatch, \"Tentative budget agreement -- House and Senate negotiators still working out details; bill may be ready Thursday,\" March 11, 2008.\n\nRichmond Times-Dispatch, \"Va. shortfall tops $3.2 billion -- State’s budget picture is ‘clearer and uglier,’ says report to Senate panel,\" Nov. 21, 2008.\n\nRichmond Times-Dispatch, \"Senate Democrats set agenda -- 21-member caucus focuses on election reform, tax breaks,\" Jan. 16, 2009.\n\nThe Virginian-Pilot (Norfolk, Va.), \"Pre-K programs face cuts under House plan,\" March 3, 2010.\n\nRichmond Times-Dispatch, \"Va. preschool initiative lauded -- Large state-funding increase will make program available to 1,500 more 4-year-olds,\" Sept. 16, 2004.\n\nRichmond Times-Dispatch, \"Kaine resolute on pre-kindergarten -- Study says plan is a good investment, but it will cost more than estimated,\" July 11, 2007.\n\nRichmond Times-Dispatch, \"Budget funds could open more pre-K slots -- Richmond-area schools set to add seats, though classroom space limited,\" March 15, 2008.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]