["गुजरात में एक मस्जिद से पकड़े गये हथियार:- आखिरकार ये मुस्लिम करना क्या चाहते हैं?? वैसे देशभर में मस्जिदों  की चेकिंग की जाए तो ऐसे ही हथियार मिलेंगे?", "Translation: Weapons seized from a mosque in Gujarat:- What do these Muslims want after all? If mosques all over the country are checked, will such weapons be recovered?", "The above message has been shared widely on social media platforms along with a set of photographs in which weapons, mostly swords and knives can be seen. It has been claimed that these weapons were recovered from a mosque in Gujarat.", "The above post is from a Facebook group, R.S.S (Rashtriya Swayamsevak Sangh). It has also been posted by several individual users on their timelines.", "The photos with the accompanying narrative have also been shared on Twitter.", "गुजरात में एक मस्जिद से पकड़े गये हथियार:- आखिरकार ये मुस्लिम करना क्या चाहते हैं?? वैसे देशभर में मस्जिदों की चेकिंग की जाए तो ऐसे ही हथियार मिलेंगे?? 🤔🤔🤔 pic.twitter.com/1czzd4R5Wn", "— किरन जैन ( देशप्रेमी ) (@jainkiranjain) July 23, 2019", "Alt News reverse-searched one of the images on Google and came across a news report of March 2016, on a portal Gujarat Headline, according to which these weapons were seized from a store in Rajkot, Gujarat. Using relevant key words and date filter, more articles related to the incident could be accessed.", "According to a Times of India report dated March 6, 2016, the Rajkot crime branch had busted an illegal arms racket being operated from a hotel on the Ahmedabad-Rajkot highway. More than 250 lethal weapons including swords and knives were seized from India Palace hotel. Five persons including the owner of the hotel were arrested in the raid. The same was reported by the Gujarati newspaper Divya Bhaskar.", "The same set of photographs had been circulated on social media earlier as well. Madhu Kishwar who has often posted misinformation via her Twitter account, had falsely insinuated that the weapons had been recovered from a mosque in Rajkot.", "It may be noted that these photographs are not recent- they were clicked in March 2016. Moreover, the weapons were seized from a raid on a highway hotel and not from a mosque, as falsely claimed.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]