["The video was published here on January 10, 2021. It has been viewed more than 400 times.", "The post’s Burmese-language caption translates to English as: “#Indonesia_flight Falling down into the water. The video was filmed from a fishing boat in the sea. ???”", "The Indonesian-language text superimposed on the video reads: “Amateur phone video taken by a fisherman. Verily we belong to Allah, and verily to Him do we return. A plane crash.”", "Here is an AFP report about the Sriwijaya Air flight that crashed with 62 people on board on January 9, 2021.", "The report reads in part: “The Sriwijaya Air Boeing 737-500 plunged into a steep dive about four minutes after it left Soekarno-Hatta international airport in Jakarta on Saturday afternoon. No reasons have yet been given for the crash, with authorities focusing on a frantic search and rescue effort that appeared to offer no hope of finding any survivors.”", "The same video was also shared with a similar claim on Facebook here, here, here, here, here, here, and here.", "The claim is false.", "A reverse Google image search with video keyframes found this video published on a YouTube channel called Naked Science. The report is about the hijacking of Ethiopian Airlines flight 961 in 1996.", "The title of the video reads: “Hijacked Plane Disaster - Water Crash Landing”", "The description of the video also states: “The Boeing 767-200ER was hijacked on 23rd November 1996 en route from Addis Ababa to Nairobi on a Bombay–Addis Ababa–Nairobi–Brazzaville–Lagos–Abidjan service, by three Ethiopians seeking asylum in Australia.  The plane crash-landed in the Indian Ocean near Grande Comore, Comoros Islands, due to fuel exhaustion; 125 of the 175 passengers and crew on board died, along with the hijackers; the rest of the people on board survived with injuries.”", "The video in the misleading posts has been flipped horizontally from original video footage.", "Below are screenshot comparisons of the video in the misleading posts  (L) and Naked Science’s video (R):", "The 1996 crash is detailed here on the Aviation Safety Network website.", "On November 26, 1996, CNN reported on the dramatic video here.", "The reports states in part: “A dramatic videotape was released Tuesday showing Saturday's crash of hijacked Ethiopian Airlines Flight 961 into the Indian Ocean, as investigators debated whether two men in custody were among the hijackers.”", "The report goes on to state that the video of the crash was taken by “a South African couple who witnessed the crash as they sunned themselves on the beach of their honeymoon hotel in the Comoros.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]