["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Republican gubernatorial candidate Eric Greitens claims Democrats spent $1 million against him just before the August primary election.", "On an Aug. 11 Fox & Friends appearance, Greitens said, \"We had the Democratic Governors Association and the Obama political machine come into a Republican primary to try and rig the election by spending $1 million against me in the last couple of days.\"", "That number stood out, so we decided to investigate the claim.", "We reached out to Greitens' campaign staff for more information. Parker Briden, a campaign spokesman, said Greitens was referring to television attack ads aired against Greitens right before the primary.", "Campaign finance records", "Briden referred us to Missouri campaign finance reports filed by the Chris Koster campaign detailing contributions from Jobs and Opportunity, a political action committee. Koster won the Democratic primary for governor and will square off against Greitens in the general election in November.", "Beginning two weeks before the Aug. 8 primary, the PAC made four \"in-kind\" contributions — contributions of goods and services and not cash — to Koster for Missouri, Koster's campaign.", "The in-kind contributions carried a total valuation of over $1 million, according to the reports filed by the Koster with the Missouri Ethics Commission. The largest contribution was reported as $713,082, made on July 29. The same week, two other contributions were made — one valued at $112,560, and another for $150,080. On Aug. 5, three days before the election, the committee made a final contribution valued at $25,710.82.", "After the donations were made, the Greitens campaign issued a press release titled \"Koster Caught in Conspiracy to Hijack Republican Primary.\"", "\"This is an attempt by national Democrats to steal an election in Missouri through meddling in the Republican primary,\" the release read.", "Attack ad", "The reported contributions coincided with a series of television ads attacking Greitens that aired in the five days before the primary. A group called Jobs and Opportunity is credited for paying for the ad. A YouTube video of the ad was posted on July 29, about a week before the primary.", "According to Koster's campaign finance expenditures, his campaign normally pays between $500,000 and $700,000 for media advertising. No other single campaign expenditure comes close to that amount. That puts the PAC's contribution in perspective — it's unlikely a $1 million in-kind contribution would buy anything else.", "The ad lambastes Greitens for accepting a separate $1 million contribution from Michael Goguen, a California-based tech financier. Goguen is the subject of a pending civil lawsuit with a woman who has accused him of sexual abuse.", "\"While others returned his money, Greitens says he's honored to take it,\" the ad's narrator says.", "Greitens is right: the Democratic Governors Association is behind money given to his Democratic opponent. The Washington, D.C. address for Jobs and Opportunity that the Koster campaign reported to the Missouri Ethics Commission is also the address for the Democratic Governors Association. A week before the election, Jobs and Opportunity made a $1 million in-kind contribution to Koster, which coincided with a TV ad attacking Greitens.", "Although the political action committee is unaffiliated with Koster’s campaign, Koster's campaign had some knowledge of the ad before it aired, since the in-kind contribution was listed on Koster's campaign finance report.", "PACs that act independently from a candidate do not have to report contributions to that candidate's campaign, said James Thomas, the campaign treasurer for Catherine Hanaway, who was a Republican gubernatorial candidate in the primary. But when the PAC is in contact with the candidate, related contributions need to be reported.", "For example, the PAC could have discussed when the ad's content or when it would be aired with Koster's campaign, Thomas said.", "Since Missouri has no limits on campaign contributions, it's okay that the PAC talked to Koster's campaign. It would be a different story if this were a federal election, though, Thomas said. Federal PACs can only contribute $5,000 to a candidate, so Jobs and Opportunity’s $1 million in-kind contribution would be illegal.", "On July 31, Greitens released an ad in response to the PAC's ad. In the ad, which has since drawn national attention, Greitens fires rounds of a machine gun into an open field.", "\"Eric Greitens is under attack from Obama's Democrat machine,\" the narrator of the ad says. \"When he fights back, he brings out the big guns.\"", "After the primary, Greitens said no other Democratic groups launched attack ads against any other Republican gubernatorial candidate, according to the Associated Press.", "We also asked Austin Chambers, Greitens' campaign manager, why Greitens repeatedly cited President Barack Obama's involvement in the ad buy.", "And though Koster's donations were big, they were legal, despite Greitens' press release connoting Koster's involvement in illegal activity.", "Koster's campaign directed all questions to the spokesman for the PAC.", "Marvin Overby, an MU political science professor, said large donations like the PAC's are common before an election.", "\"This happens a lot. It's just part of the rough and tumble of politics,\" he said. \"I'm not sure the Greitens' campaign wouldn't have done the same thing.\"", "Our ruling", "Greitens said the Democratic Governors Association and \"the Obama political machine\" spent $1 million against him leading up to the primary election.", "A PAC with the same address as the Democratic Governors Association made four in-kind contributions totaling that amount in the weeks leading up to the election.", "And though both Obama and the PAC hired the same company to work on their ads, there's no evidence to support Greiten's statement that the \"Obama political machine\" colluded with the PAC.", "We rate this claim as Mostly True.", "Twitter, Eric Greitens tweet, Aug. 11, 2016", "Eric Greitens press release, republished from PoliticoPro,Democrats attack Greitens days before Missouri GOP primary, July 28, 2016", "St. Louis Post-Dispatch,Records hint Koster involvement in last-minute ad blitz against Greitens, July 30, 2016", "Missouri Ethics Commission,Chris Koster campaign finance reports", "Democratic Governors’ Association", "Email exchange with Parker Briden", "Interview with Austin Chambers", "Interview with Martin Overby", "Interview with James Thomas", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]