["About this rating", "On 29 January 2018, the YourNewsWire web site published an article reporting that an NFL \"entertainment lawyer\" was found dead hours after telling reporters that the upcoming Super Bowl was “rigged”:", "An NFL entertainment lawyer, who has worked for the corporation for more than 15 years, has been found dead in New York City hours after telling reporters that Super Bowl LII is “rigged.”", "Dan Goodes was found dead in his hometown of New York City in what early reports described as an “gangland-style execution”, hours after blowing the whistle on the “rigged Super Bowl” backstage at a promotional event in Minneapolis.", "Early reports claim the 49-year-old was found shot dead in a 2017 BMW 2 Series, along with one other man, believed to be a close friend.", "Goodes, an entertainment lawyer who worked at the National Football League’s Park Avenue headquarters, had been representing the NFL in Minneapolis, working alongside Eagles and Patriots franchise staff on promoting Sunday’s Super Bowl featuring the two teams.", "However Goodes went “off-script” in Minneapolis and was “physically removed” from the premises by security staff, but not before publicly condemning the NFL as “totally corrupt” and claiming the Super Bowl is “fixed.”", "None of this was true. The NFL employs no \"entertainment lawyer\" named Dan Goodes, nor did anyone by that name recently \"blow the whistle\" on \"rigged\" football games or die in a “gangland-style execution.”", "This report was a fabrication, nothing more than a riff on a recent hoax about NFL games being \"rigged\" that was published by YourNewsWire, a fake news site. The article's accompanying photograph of the alleged crime scene was actually lifted from a July 2017 news report about a New York police officer who was shot in her patrol car.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]