["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A migrant child sleeps on the shoulder of a woman at an intake area after turning themselves in upon crossing the U.S.-Mexico border, March 24, 2021, in Roma, Texas. (AP)", "Trump’s administration did make significant changes to the U.S. immigration system, including the process for migrants arriving at the southern border to seek asylum.", "While those actions may have an impact on migration, they are not wholly responsible for a surge in migration or the Biden administration’s ability to deal with it, experts said.", "President Joe Biden’s top immigration official defended the federal response to the growing numbers of people arriving at the southern border, and claimed that current efforts are complicated by the Trump administration’s drastic changes.", "Alejandro Mayorkas, secretary of the Department of Homeland Security, said the Biden administration has a plan and knows what to do, but it will take time to get things done.", "\"And why does it take time now? Why is it especially challenging and difficult now? Because the entire system under United States law that has been in place throughout administrations of both parties was dismantled in its entirety by the Trump administration,\" Mayorkas told ABC News’ Martha Raddatz on March 21.", "The Biden administration is \"rebuilding the system\" to address the needs of unaccompanied children making their way to the southern border, he said.", "How accurate is Mayorkas’ claim that the Trump administration \"dismantled\" the \"entire system\"?", "There’s some truth to his broad claim, but the challenges the Biden administration faces can’t all be blamed on the prior administration, immigration experts said.", "\"The border surge is just the latest symptom of a broken immigration system,\" said Laura Collins, director of the George W. Bush Institute-SMU Economic Growth Initiative.", "Experts said it’s important to take a step back and note the underlying factors that push people out of their countries and why the U.S. — regardless of who’s president — has trouble handling their arrival.", "Persistent corruption, poverty, lack of opportunity and violence in Central America drive people to leave their families and seek a better life in the United States. Recently, hurricanes in Central America made things worse for many people, ruining their crops and displacing them from their homes. The coronavirus pandemic has also left many people without a job.", "On the U.S. side of the issue, Congress hasn’t passed meaningful legislation to modernize the legal immigration system or to better prepare the federal government for surges at the border. (The last big immigration law was enacted in 1986, when Ronald Reagan was president.)", "It’s also worth noting that there are seasonal trends at play — migration tends to increase in the spring.", "DHS directed PolitiFact to a statement Mayorkas issued March 16 about the Trump administration dismantling the asylum system. Many people who make it to the southern border ask for asylum.", "\"We have had to rebuild the entire system, including the policies and procedures required to administer the asylum laws that Congress passed long ago,\" Mayorkas said.", "Under federal law, immigrants may be granted asylum if they have been persecuted or fear they will be persecuted on account of race, religion, nationality, political opinion or membership in a particular social group. To apply for asylum, people have to be physically present in the U.S. They can apply even if they arrive without legal permission.", "A backlog of cases existed before Trump took office and continued to grow during his tenure, despite his attempts to limit the number of people filing cases.", "The Trump administration revamped the asylum-seeking process in many ways, including by:", "Denying asylum to people who did not ask for protection in another country first;", "Entering into agreements with Central American countries so that they’d take asylum seekers who would have otherwise applied for protection in the United States; and", "Launching the \"Remain in Mexico\" program that sent asylum seekers to Mexico to wait there for a resolution of their case. Previous administrations allowed people into the United States as their case made its way through the complex immigration system. (It can take years for cases to be resolved.)", "Trump’s administration also tried to discourage people from coming to the U.S. to apply for asylum by implementing a policy that ultimately separated parents and children upon arrival at the border. The Biden administration got rid of that policy and launched a task force to help reunify families. Biden’s administration has also begun letting in asylum seekers stranded in Mexico.", "Separately, Trump also weakened another venue for legal migration — the U.S. refugee program. People apply for refugee admission from outside the U.S. (in their home countries or in refugee camps elsewhere). Before leaving office, President Barack Obama said the U.S. should let in as many as 110,000 refugees in fiscal year 2017. When Trump took over, he said that was too much and capped it at 50,000. Trump continued to lower the caps every year he was in office. Biden has pledged to significantly raise the admissions cap.", "Mayorkas’ statement also said that Trump \"tore down\" the Central American Minors program — created in 2014 by the Obama administration to address a surge of children fleeing gang violence and arriving alone at the border. The program sought to deter Central American children from making the dangerous trip north.", "The program allowed certain parents lawfully present in the United States to petition for their children in Guatemala, El Salvador and Honduras to come in as refugees. Children ineligible for refugee admission but at risk of violence were eligible for immigration parole (allowed into the U.S. temporarily, but not formally admitted under the U.S. immigration system).", "The Trump administration in 2017 decided to end the program. Mayorkas and Democratic lawmakers argue that its absence contributes to the current surge.", "But Democrats are overstating the program’s impact, experts said. Plenty of kids were left out of it, due to eligibility requirements and its lengthy application process, said Jessica Bolter, an associate policy analyst at the Migration Policy Institute.", "The program \"had not yet developed into a fully effective alternative to illegal immigration for a broad population,\" Bolter said.", "Also, it ended years ago, so \"it doesn’t make sense that the effects would suddenly appear this year,\" she said.", "Biden’s administration is restarting the program.", "Mayorkas also claimed that Trump cut \"foreign aid funding\" and that \"no longer did we resource efforts in El Salvador, Guatemala, and Honduras to tackle the root causes of people fleeing their homes.\"", "He’s right about cuts in foreign aid, and that may have exacerbated some conditions that potential migrants were facing, experts said. But they also emphasized that other factors likely carried more weight in people’s decision to migrate.", "Obama’s administration in 2014 decided that improving living conditions in Central America would be beneficial to the U.S. and approved a new strategy to increase annual foreign aid to the region. Trump’s administration did the opposite, proposing cuts instead.", "Annual funding for the Central America strategy declined from $750 million in fiscal year 2017 to $505.9 million in fiscal year 2021, a Congressional Research Service analysis found. And amid an immigration surge in 2019, the Trump administration suspended that support while it negotiated asylum agreements with El Salvador, Honduras and Guatemala.", "That pause \"was a colossal waste,\" said Susan Martin, a professor emerita at Georgetown University and director of the U.S. Commission on Immigration Reform from 1992 to 1997. None of the three countries are safe or capable of processing asylum applications, she said.", "Aid targeted toward the problems in Honduras, Guatemala and El Salvador \"would have been much more effective in reducing emigration pressures over time,\" Martin said.", "It’s hard to tell at this point how much impact those aid cuts have had on migration.", "\"A lot of foreign assistance is about investing in long-term change rather than short-term results,\" Collins said. \"Lots of foreign assistance won’t fix migration on its own, but it is an important piece of a comprehensive approach.\"", "Biden has pledged to invest $4 billion in Guatemala, Honduras, and El Salvador to improve conditions there and lessen the desire to migrate to the U.S.", "Mayorkas said the border surge is \"challenging\" because the immigration system that had been in place for decades \"was dismantled in its entirety by the Trump administration.\"", "Trump’s administration did make significant changes to the U.S. immigration system, including the asylum-seeking process for migrants arriving at the southern border.", "While those actions may have an impact on migration, they are not wholly responsible for a surge in migration or the Biden administration’s ability to deal with it, experts said.", "Mayorkas’ statement is partly accurate. We rate it Half True.", "ABC News, 'This Week' Transcript 3-21-21: Homeland Security Secretary Alejandro Mayorkas, Gov. Doug Ducey, Rep. Michael McCaul, Rep. Judy Chu", "Email interview, DHS press office, March 23, 2021", "DHS.gov, Statement by Homeland Security Secretary Alejandro N. Mayorkas Regarding the Situation at the Southwest Border, March 16, 2021", "U.S. Commission on Immigration Reform, 1997 report to Congress", "Joe Biden’s 2020 campaign website, The Biden Plan for Securing Our Values as a Nation of Immigrants", "U.S. Customs and Border Protection, Southwest Land Border Encounters", "Email interview, Jessica Bolter, an associate policy analyst at the Migration Policy Institute, March 22, 2021", "Email interview, Susan Martin, a professor emerita at Georgetown University, March 22, 2021", "Email interview,  Laura Collins, director of the George W. Bush Institute-SMU Economic Growth Initiative, March 22, 2021", "State Department, Restarting the Central American Minors Program, March 10, 2021", "Congressional Research Service, U.S. Strategy for Engagement in Central America: An Overview, Feb. 16, 2021", "Congressional Research Service, Immigration Parole, Oct. 15, 2020", "U.S. Global Leadership Coalition, U.S. Assistance to Central America promotes security, economic development, and rule of law, March 2021", "USCIS.gov, In-Country Refugee/Parole Processing for Minors in Honduras, El Salvador and Guatemala (Central American Minors – CAM)", "State Department archived content, Central American Minors (CAM) Program", "The Washington Post, There’s no migrant ‘surge’ at the U.S. southern border. Here’s the data., March 23, 2021", "PolitiFact, Donald Trump’s immigration promises: failures and achievements, July 27, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]