["About this rating", "A photograph appears to show Louise Rosealma holding a glass bottle during the Patriot's Day Rally at Berkeley in April 2017.", "There's no evidence that the glass bottle was a makeshift explosive, and Rosealma was not arrested or charged with using an explosive during the riot.", "On 15 April 2017, President Trump's supporters and detractors clashed on the streets of Berkeley, California. That day, the group We Are Change posted a video of the chaotic scene. The video quickly went viral, in large part due to an incident at the 30-second mark which showed Nathan Damigo, the founder of a white supremacist group, punching Louise Rosealma, a protestor:", "While many media outlets painted a sympathetic picture of Rosealma and claimed that she had been \"sucker punched\" during the riot, others claimed that she was actually an instigator to the violence. A photograph purportedly showing Rosealma holding a glass bottle was circulated along with the claim that she had filled the bottle with explosives and was preparing to launch it into the crowd when Damigo stopped her:", "The web site DrRichSweir.com provided this version of events:", "There’s been media coverage of a woman Louise Rosealma being wrestled to the ground by a man. Rosealma was part of the Antifa group in Berkeley, California that attacked pro-Trump marchers.", "Nathan Damigo, a Marine veteran who was there saw that Rosealma was putting M80 explosive devices inside glass bottles and throwing them at the pro-Trump rally marchers.", "So Louise Rosealma was literally making IED’s. This makes her no better than the Boston Marathon bombers.", "Although the post portrays Damigo as a veteran heroically intervening to prevent violence, his past is more complicated than that. He is the founder of a white supremacist group called Identity Evropa (which he was promoting at the event) and has served jail time for armed robbery.", "Still, we found no record of Damigo claiming that he saw Rosealma putting an M80 explosive inside a glass bottle and throwing at it protesters. No quotations from Damigo were provided, nor any evidence that the bottle was actually filled with explosives. In fact, the photographic evidence does more to disprove this claim than to support it.", "The photograph of Rosealma holding a glass bottle was taken by Stephen Lam of Reuters and has not been altered (other than the red circle). However, a close-up of the bottle appears to show that it's empty:", "In addition to this photograph, the claim that Rosealma was using an explosive device made out of a glass bottle may originate in a video featuring an interview with the anti-fascist protester that shows at least one explosion during the rally, but it's unclear what exactly it was or who set it off. During a hiatus in the chaos, the interviewer asked Rosealma if she condemned the use of M80s. Without addressing the ethics of using explosives, she responded:", "The revolution isn't fuckin' easy. I mean I got kneed in the face, pepper-sprayed in the eye, and some guy tried hitting my head against a rock and he was wearing a fucking Make America Great Again hat.", "The interview appears at the 3:30 mark:", "Reporter Tim Pool, who took this video, said in the interview that M80s were being thrown into the crowd — but not that they were being stuffed inside glass bottles, which would create a far more dangerous weapon.", "The Washington Post reported that there were small explosions (most likely firecrackers) during the riot, but explosives were absent from a list of weapons that were confiscated by police compiled by Mercury News:", "In its Saturday statement, police said officers tried to protect people and their free speech rights — despite organizers’ lack of a permit — by prohibiting potential weapons, limiting park entry and exit, and sharing citation and arrest risks for rule violations. They put up a plastic barricade in an attempt to keep the opposing sides apart and collected anything that could be used as a weapon. Police had banned metal pipes, baseball or softball bats, lumber or wood of any size, poles, bricks, rocks, glass bottles, pepper spray and other objects.", "Despite their efforts, police said officers confiscated pepper and bear spray, knives and mace, an ax handle and a concrete-filled can at Saturday’s protest, and that city staff cleaning the park before the rally found a replica gun.", "Rosealma was not arrested over the incident, but the Washington Post noted that more arrests were expected as investigators review videos of the event.\n \nAlthough the Reuters photo shows Rosealma holding the bottle, images of Damigo punching Rosealma clearly show that her hands were empty at the time of the incident. Here is a clear shot of her empty hands moments before she gets hit:", "So when was Rosealma holding the bottle? The photograph that shows Rosealma with empty hands is actually the second time that Damigo hit Rosealma. The first incident can also be briefly glimpsed in the viral video, but it is easy to miss. If you slow down this footage and watch the left side of the screen you can see Rosealma holding a bottle, and Damigo punching her a first time, at the 22-second mark:", "This series of screenshots shows that Damigo actually punched Rosealma twice. Once when she was holding the bottle (around the 22-second mark) and a second time when she was not holding anything (around the 30-second mark).", "When we reached her for comment, Rosealma said that she never threw an explosive, and that this rumor was invented by the alt-right to justify Damigo's actions. Rosealma also told us that the only time she held a bottle during the event was when she was cleaning up trash, and that the images of her with a bottle (both the Reuters photograph and the stills from the video) had been doctored:", "I was not holding a bottle in the video, especially after the smoke bomb went off. I held one when I helped clear the trash burning, but left it on the street. Please watch the video, there is no bottle, and if you notice my \"arm\" that is holding the bottle, has no shadowing like the rest of my arm, and the \"hand\" that is holding it is not really a whole looking hand, as well as the coloring, the shadowing, and the highlights on the bottle are the exact same in the other picture I sent you, which is indeed doctored, and so is that screenshot. That man in the red sweater, with the blonde hair, is actually the guy who not only assaulted my boyfriend, but was the one who kneed me in the head multiple times, I'm quite sure.", "Although Reuters has taken criticism for doctoring photos in the past, it is highly unlikely that the photograph of Rosealma was manipulated. We compared the Reuters image and stills from the video and found that they were taken at the same time and place (a man in a skeleton mask can be viewed in the background of both images), making it highly unlikely that they were faked.", "It's possible that Rosealma was simply cleaning up trash when a fight broke out. It's also possible that the bottle was being used as a weapon (either in defense or aggression). However, the claim that this bottle was filled with explosives is completely unfounded.", "CBS SF Bay Area.   \"Berkeley Police Release Names of People Arrested at Trump Protests.\"\r\n    17 April 2017.", "Selk, Avi.   \"The Berkeley Rally Aftermath: Mass Arrests, A Stabbing and Weaponized Pepsi.\"\r\n    The Washington Post.   16 April 2017.", "Associated Press.   \"Berkeley Protester Recounts Being Sucker-Punched: ‘I Was Just Terrified.’\"\r\n    17 April 2017.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]