["The photo was published here on Facebook on January 13, 2021.", "The photo shows several men holding a Burmese-language sign that translated to English as: “[We] totally denounce Facebook for interfering in Myanmar’s political affairs without showing appropriate concern”.", "The post’s caption translates in part as: “First, they targeted the teachers who served as polling station heads … Now, they are talking about Facebook. Finally, they will head a rally against the people who voted for the NLD. Their disease is getting worse.”", "The post circulated two months after Myanmar’s National League for Democracy (NLD) won a general election held on November 8, 2020. Following the vote, Myanmar's opposition parties rejected the result and demanded a new election, as AFP reported here and here.", "The image was also shared alongside a similar claim here, here, here, here, here, here, here, here, here, and here.", "The claim, however, is false.", "A reverse image search on Google found the photo was published by The Voice, a Myanmar media outlet, here on October 5, 2018.", "The report’s Burmese-language headline reads: “Protest against Facebook in Kale”.", "Kale is a town located in Myanmar’s Sagaing region.", "The report in part reads: “Members of Myanmar War Veterans Organisation in Kale district, Sagaing region and other cities such as Kalewa and Minkin took part in a rally to show their support of the military and denounce foreign interference.", "“The rally took place at 8:30am on October 5 in front of Kale town hall for about an hour.", "“215 war veterans from three townships showed up at the rally. They carried banners and chanted slogans: We strongly support Tatmadaw [the military]; may the people’s beloved Tatmadaw who loves the people be successful; we totally denounce Facebook for interfering ni Myanmar’s political affairs without showing appropriate concern; we will never accept the bias of the UN's fact-finding commission and its unfair, one-sided report.”", "Below is a screenshot comparison of the photo in the misleading post (L) and the photo in The Voice report (R):", "AFP found another Facebook post with similar photos of the same protest published here on October 5, 2018. The banners in the photos show the same slogan as the banner seen in the misleading posts.", "The post's caption translates to English as: \"Rally supporting Tatmadaw [Myanmar military] today in Kale, Sagaing Region. Credit. #KyawKoKoTin\".", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]