["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "West Virginia Gov. Jim Justice holds a press conference to oppose an effort backed by Michael Bloomberg to curb carbon emissions.", "When former New York City Mayor Michael Bloomberg announced that he would spend $500 million on a Beyond Carbon initiative, West Virginia Gov. Jim Justice joined energy industry representatives at a press conference to denounce the effort.", "The project Justice criticized aspires to retire all coal use by 2030 while securing an economic future for fossil fuel-producing communities.", "In an op-ed announcing the effort, Bloomberg — who has since entered the Democratic presidential primary race — touted an existing partnership between Bloomberg Philanthropies and the Sierra Club that has \"shut down 289 coal-fired power plants since 2011.\"", "The new initiative would build on this effort and also \"work to stop the construction of new gas plants,\" Bloomberg wrote. \"By the time they are built, they will be out of date because renewable energy will be cheaper.\"", "Justice, a Republican whose state is a leading producer of coal and other carbon-based energy, said the effort could be \"catastrophic\" to West Virginia. (Justice himself also inherited a coal mining business and continues to own several mines.)", "At one point in the press conference, Justice was asked about the environmental impacts of fossil fuels. He responded by questioning the value of the United States cutting back if China is using carbon-based fuels on full blast.", "\"How does it make sense that in China, they’re burning seven to eight times the amount of coal that we’re burning in the United States?\" Justice asked.", "Is his comparison accurate? Justice’s ratio is not far from the reported data, though it’s worth noting that the reason for the discrepancy has a lot to do with the fact that China has a much larger population. (His office did not respond to inquiries for this article.)", "There’s little doubt that, as a whole, coal consumption by China is several times larger than it is in the United States.", "According to the 2019 BP Statistical Review of World Energy, China’s coal consumption was 1.91 billion tons of oil equivalent in 2018. In the same year, the United States consumed 317 million tons. That means China consumed about six times as much coal as the United States did.", "Another data source, the Global Energy Statistical Yearbook 2019 published by Enerdata, an energy intelligence and consulting firm, found a nearly identical difference — China was about six times larger than the U.S. in consumption of coal and lignite (a low-efficiency type of coal).", "Justice didn’t mention it, but another country, India, also consumes more coal than the United States does — 452 million tons of oil equivalent, according to the BP review.", "We’ll note that the difference in coal consumption between China and the United States is partially explained by the two countries’ difference in population — China has about 4.3 times higher in population than the United States.", "However, adjusting for population is less significant in this case than it often is, given Justice’s point.", "Justice is arguing that greenhouse gases do not stay within national borders; they spread everywhere in the atmosphere. So any decreases in carbon emissions made in the United States will be a relatively small factor compared to China in the global context — regardless of which country has a bigger population.", "Indeed, according to the BP data, China accounted for just over half of the world’s coal consumption in 2018. In addition, the same data shows that China’s coal consumption increased by 1.8% between 2007 and 2017, whereas U.S. coal consumption declined by 4.9%.", "Unlike the United States, which has a lot of economically competitive natural gas under development, China doesn’t, said Anna Mikulska, a nonresident fellow in energy studies at the Center for Energy Studies at Rice University's Baker Institute for Public Policy.", "\"China has to go against the economic calculus to retire at least some of the coal if it wants to lower emission levels,\" she said. \"This is why we see China still consuming so much.\" Mikulska added that the current trade friction with China \"does not help, as China turns more to domestic or regional resources due to energy security concerns. One of them is coal.\"", "That said, the Paris-based International Energy Agency, has projected that China’s coal consumption will indeed decline over the next two decades. \"This new direction will have consequences that are no less significant for China and the world than its earlier period of energy-intensive development.\"", "Justice said that China today is \"burning seven to eight times the amount of coal that we’re burning in the United States.\"", "The actual number is a little bit less than that — China consumes roughly six times the amount of coal as the United States does. But that’s pretty close. We rate the statement Mostly True.", "Governor Jim Justice, WV Energy Industry Joint Press Conference, June 10, 2019", "Bloomberg Philanthropies, Beyond Carbon project, accessed Nov. 27, 2019", "Michael Bloomberg, \"Moonshot: Saving Earth’s Climate,\" June 7, 2019", "BP Statistical Review of World Energy 2019", "Enerdata Global Energy Statistical Yearbook 2019", "World Bank, world population statistics, accessed Nov. 27, 2019", "International Energy Agency, \"World Energy Outlook 2017: China,\" accessed Nov. 26, 2019", "Forbes, Jim Justice net worth, accessed Nov. 27, 2019", "Email interview with Anna Mikulska, nonresident fellow in energy studies at the Center for Energy Studies at Rice University's Baker Institute for Public Policy, Dec. 2, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]