["By Angelo Fichera", "Posted on October 18, 2018", "Q: Did Supreme Court Justice Ruth Bader Ginsburg say she would “resign” if Judge Brett Kavanaugh was confirmed to the Supreme Court?", "A: No. There is no evidence to support that claim made in a viral meme.", "Speaking at a New York City event in August, Supreme Court Justice Ruth Bader Ginsburg suggested that she would like to stay on the bench until 2023.", "“I’m now 85,” she said. “My senior colleague, Justice John Paul Stevens, he stepped down when he was 90, so think I have about at least five more years.”", "Yet a claim being floated on social media alleges Ginsburg “said she would resign if [Brett] Kavanuagh was confirmed.” We could find no evidence Ginsburg ever made that comment, which has been shared as a popular meme on Facebook.", "Kavanaugh was nominated by President Donald Trump in July, weeks before Ginsburg said she envisioned staying in her current role for years to come.", "And, last month, amid the deeply contentious battle over Kavanaugh’s confirmation, Ginsburg lamented the Senate proceedings as a “highly partisan show.”", "“The way it was, was right. The way it is, is wrong,” she said, comparing the current process to her experience in 1993, when she was confirmed in a 96-3 vote. “I wish I could wave a magic wand and have it go back to the way it was.”", "If Ginsburg, who was nominated by then-President Bill Clinton, were to step down, her vacancy would present Trump with an opportunity to nominate another justice to the highest court — further deepening the conservative majority achieved through Kavanaugh’s addition.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on the social media network.", "Berman, Dan. “Ginsburg suggests she has at least five more years on the Supreme Court.” CNN. 21 Aug 2018.", "Interview of Ruth Bader Ginsburg. George Washington University. Facebook. 12 Sep 2018.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]