["About this rating", "On June 30, 2018, Huzlers.com published an article positing that the state of Alabama had \"blessed\" incestual relationships and that brothers and sisters, as well as uncles and nieces, could now be officially married:", "Alabama Blesses ‘Incest’ Marriage Between Brothers And Sisters, Uncles And Nieces Are Now Legal", "The states highest court has toppled a cultural taboo — legalizing a degree of incest, between brothers and sister and uncles and nieces — in a unanimous ruling.", "Judge James Hamilton of the Court of Appeals wrote, “Such unions were lawful in Alabama until 1890.”", "This item was not a factual recounting of real-life events. The article originated with a website that describes its output as being humorous or satirical in nature, as follows:", "Huzlers is a Chicago based satirical news blog that focuses on celebrities, hip hop and urban entertainment.", "A Twitter user brought more attention to this post when he shared a message on Twitter in August 2019 stating that Alabama had \"just legalized sibling incest marriage.\" The tweet, which was reshared more than 18,000 times, did not include a link to the satire piece it was based on:", "Alabama just legalized sibling incest marriage but banned abortion, some say gross and despicable, I say I’m going to start a company that sells three armed shirts and three legged pants for all the hills have eyes f*cks that start popping up there", "— Derek (@hancockderek) August 26, 2019", "@hancockderek clarified that his tweet was posted in jest and that it was based on a piece of satire. As of this writing, the message explaining that his original tweet was based on a piece of fiction had only four retweets:", "Before anyone moves states prematurely just know this is a joke about a satire article that was knocking on Alabama for their backwards political stances", "— Derek (@hancockderek) August 28, 2019", "Notes", "Why We Include Humor and Satire in Snopes.com", "Huzlers.com.   \"Alabama Blesses ‘Incest’ Marriage Between Brothers And Sisters, Uncles And Nieces Are Now Legal.\"\r\n    30 June 2018.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]