["The claim was posted here on a public Facebook group called Africa for Africans on September 12, 2020. According to the post, “Rwanda removed French as official language & replaced it with Swahili”.", "The same post was shared here and here in recent weeks.", "Similar rumours also surfaced online in 2019, as we reported at the time.", "Rwanda has four official languages: Kinyarwanda, English, French and Swahili.", "According to the Constitution of Rwanda of 2003, revised in 2015, the national language is Kinyarwanda -- spoken primarily or exclusively by the vast majority of Rwandans -- and the official languages are Kinyarwanda, English, and French.", "In 2017, Swahili was added as an official language as part of commitments with the East African Community, an organisation whose three founders -- Kenya, Uganda and Tanzania -- use Swahili as their official language, alongside English.", "Government denial", "Contacted by AFP Fact Check on October 6, 2020, Rwanda’s government spokesperson said French was still an official language, along with Kinyarwanda, English and Swahili.", "We also found no reports in reliable news media that the country had dropped French.", "French, the language of former colonial power Belgium, has been declining in use in Rwanda since the 1994 genocide, when a new political elite, dominated by anglophone Tutsi refugees, took charge.", "President Paul Kagame, himself Ugandan-educated, introduced English in 2003 as the third official language listed in the constitution, alongside Kinyarwanda and French.", "The country switched from French to English as a language of instruction in schools in 2008.", "But, two years ago Rwanda’s top diplomat told AFP that rejecting French was never the plan.", "“This is a misinterpretation, it was necessary for Rwanda to try to be part of this club of English-speaking countries,” former foreign minister Louise Mushikiwabo said in an interview in 2018.", "“The interpretation that suggests that Rwanda turned to English against French may have been the result of relations between France and Rwanda,” she said. “I think there was confusion between the relations of Rwanda and France, and the relations of Rwanda with the Francophonie.”", "In 2015, Rwanda counted some 700,000 French-speakers -- about six percent of the population -- according to the International Organisation of La Francophonie (OIF).", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]