["About this rating", "In June 2016, rumors began circulating on social media reporting that the state of Texas had declared that children whose parents believe the Rapture is imminent are not subject to laws pertaining to compulsory education. One version of the rumor was published by the web site Winning Democrats:", "The Texas Supreme Court has cleared the way for religious ignorance to be passed on to Lone Star State children by doing ... absolutely nothing. A lower court ruling allowed for Texas homeschoolers to legally teach their children absolutely zilch if they believe their family is waiting to be raptured.", "Yes, you heard that right. Your children don’t need to learn if the Lord is returning to take you to heaven. It makes sense if you’re a lunatic, but to those of us who have watched with giddy delight as people stood on their lawns on the day the rapture was supposed to happen only to have their dreams shattered, you realize that at some point that kind of idiocy should be forbidden to be passed down to their children.", "The article was heavy on editorial content and light on facts, omitting the basic \"who, what, when,\" and \"where\" aspects of the story. However, an Associated Press article provided a far more detailed and nuanced account of the court ruling in question, which actually dealt with the issue of state laws requiring that home-schoolers meet basic educational goals without any imposing any requirement for testing to demonstrate those goals are being met:", "The Texas Supreme Court sided with a family accused of not teaching its children anything while waiting to be \"raptured,\" but failed to answer larger constitutional questions about whether home-schooled students must be properly educated.", "The 6-3 decision by the all-Republican court on technical grounds means nothing was decided regarding a showdown between religious liberties and educational requirements in America's largest conservative state, though it will live on in lower Texas courts.", "Texas doesn't require parents who home-school their children to register with state authorities. While families must meet \"basic educational goals\" in reading, spelling, grammar, mathematics and citizenship, they don't have to give standardized testing or otherwise prove student progress is made.", "The article identified the parents in question as Laura and Michael McIntyre, owners of a motorcycle dealership. The McIntyres have nine children, the article stated, and a family member reported them to the local school district because \"he never saw the children do much of anything educational\" and \"he also overheard one of the children tell a cousin 'they did not need to do schoolwork because they were going to be raptured.'\" In essence, the legal debate was not about the family's religious convictions, but rather about a relative's complaint that their children were being insufficiently educated (and the reason why they were being insufficiently educated was not relevant from a legal standpoint).", "According to the Associated Press, in response to the relative's report, a school attendance officer attempted to determine whether the family was making sufficient effort to educate their children. In turn, the McIntyres filed suit, citing their 14th Amendment rights (unrelated to religion), and alleging that the \"school district was anti-Christian.\" The family denied claims involving their belief in an impending Rapture, asserting that a relative had fabricated the Rapture element due to an unrelated business dispute:", "Attempting to investigate accusations of non-learning, school district attendance officer Michael Mendoza sought proof the children were being properly educated. That prompted the McIntyres to sue, arguing that their equal protection rights under the 14th Amendment had been violated and that the school district was anti-Christian.", "The family said it used a religious curriculum similar to one offered in El Paso's Christian schools, and noted the uncle invented claims of waiting for the rapture because he was embroiled in a dispute over ownership of the since-defunct motorcycle dealership.", "The high court found that 14th Amendment claims were not a question for Texas' educational code.", "\"Whether their constitutional rights were violated remains to be decided, but it is a question the courts — not the commissioner — must decide,\" Justice John Devine wrote, referring to the state's education commissioner, Mike Morath. [The] ruling wasn't a total win for the McIntyres, however. The Texas Supreme Court also agreed with a lower court in that Mendoza didn't violate federal 14th Amendment protections when he investigated the McIntyres.", "The Home School Legal Defense Association (HSLDA) maintains a state-by-state list of regulations for homeschooling parents. Summarized in a map, the list indicates that Texas requires little to no regulation of homeschooling parents, irrespective of their religion (or lack thereof). An in-depth assessment [PDF] of the state's laws from the perspective of that homeschooling advocacy group asserted that the sole requirements established in a 1987 court case were that \"[h]omeschools must be conducted in a bona fide manner, using a written curriculum consisting of reading, spelling, grammar, math and a course in good citizenship; no other requirements apply[.]\" Standardized testing requirements do not apply to homeschooled students in Texas.", "The Texas Education Agency's \"Home Schooling\" page reiterates the state's relaxed stance on homeschooling:", "Home schooling has been a legal alternative to public schooling since 1994. In the case of Leeper et al. v. Arlington ISD et al., the Texas Supreme Court upheld a lower court's decision that children being taught at home are exempt from the compulsory attendance requirement to the same extent as students enrolled in private schools. Parents who choose to home school are required to follow a course of study that includes good citizenship. A public school district may ask parents to provide assurances in writing that they intend to home school their child.", "Although a copy of the ruling isn't publicly available, news reports indicate that the court didn't intervene to compel the McIntyre children to attend school or subject the family to additional scrutiny. But more to the point, the parents involved expressly did not argue that their belief in an imminent Rapture exempted them from following state homeschooling laws. The parents instead refuted a relative's claim regarding that religious belief, asserting that a complaint had been lodged against them in retaliation for a familial business dispute. Irrespective of the family's religious beliefs, Texas homeschool regulations are among the least restrictive in the country and require little in the way of enforced curriculum or testing.", "Topher, Charles.   \"Texas Supreme Court: Christian Kids Don't Need an Education If They're Going yo Be Raptured.\"\r\n    Winning Democrats.   25 June 2016.", "Weissert, Will.   \"Texas Supreme Court Sidesteps Key Home Schooling Issue.\"\r\n    Associated Press.   24 June 2016.", "HSLDA.   \"Home Schooling in the United States: A Legal Analysis [Texas].\"\r\n    2015-2016.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]