["By Saranac Hale Spencer", "Posted on July 10, 2019 | Updated on June 18, 2020", "A photo circulating online has been manipulated to show Jeffrey Epstein with Donald and Ivanka Trump in 1993.", "Two photos taken 12 years apart have been combined to show Jeffrey Epstein, a wealthy money manager charged with sex trafficking, smiling as he stands in front of Donald Trump kissing a young girl on the side of the head. The girl in the photo with Trump is his then 11-year-old daughter Ivanka, and Epstein’s image was added later.", "It’s true that the president knows Epstein. Trump said in a 2002 interview with New York magazine, “I’ve known Jeff for fifteen years. Terrific guy. He’s a lot of fun to be with. It is even said that he likes beautiful women as much as I do, and many of them are on the younger side. No doubt about it – Jeffrey enjoys his social life.”", "But, more recently, the president has distanced himself from Epstein. Answering a question on July 9 about his 2002 statement, Trump said, “Well, I knew him like everybody in Palm Beach knew him. I mean, people in Palm Beach knew him.  He was a fixture in Palm Beach. I had a falling out with him a long time ago. I don’t think I’ve spoken to him for 15 years. I wasn’t a fan.”", "Epstein is accused of sexually exploiting dozens of underage girls for years at his Manhattan and Palm Beach homes.", "He faced similar charges in Florida more than a decade ago, but accepted a plea bargain under which he wouldn’t be prosecuted on the federal charges if he pleaded guilty to a state charge of soliciting prostitution.", "That deal was made while Alexander Acosta, the current U.S. secretary of labor, was the U.S. Attorney for the Southern District of Florida.", "A federal judge in February found that the plea agreement violated the Crime Victims’ Rights Act, since Acosta and his prosecutors kept the deal secret from the more than 30 alleged victims in the case.", "The manipulated picture that is now circulating online shows Trump grasping a girl by the waist and kissing her head, with Epstein in the foreground. One version of it is accompanied by this text: “Is there another word besides repulsive that can describe this photo?” Another says: “Donald doesn’t want you to see this.”", "But the girl in the photo with Trump is his daughter Ivanka. They are pictured at the 1993 opening of a Harley Davidson Café in New York City when she was 11 years old.", "Epstein doesn’t actually appear in that photo. Rather, his image from a 2005 magazine launch party was added to the picture of the Trumps.", "Update, June 18: A reader brought to our attention a newly released photo showing Epstein with Trump and his daughter Ivanka at this 1993 event. The photo is unrelated to the bogus picture we addressed here. It was taken by Dafydd Jones, a British photographer who chronicled high society in the 1980s and 1990s. Jones told us by email that he recently came across photos from this 1993 event, and posted the picture of Trump and Epstein on his website in April.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "United States v. Epstein. No. 1:19-cr-00490. United States District Court for the Southern District of New York. Indictment. 2 Jul 2019.", "Thomas, Landon Jr. “Jeffrey Epstein: International Moneyman of Mystery.” 28 Oct 2002.", "Trump, Donald. Remarks by President Trump and Amir Al Thani of the State of Qatar Before Bilateral Meeting. 9 Jul 2019.", "Conway, Kellyanne. White House counselor. Speaking with reporters. C-SPAN. 9 Jul 2019.", "Brown, Julie. “How a future Trump Cabinet member gave a serial sex abuser the deal of a lifetime.” Miami Herald. 28 Nov 2018.", "Galella, Ron. “Grand Opening of The Harley Davidson Cafe.” Getty Images. 19 Oct 1993.", "McMullan, Patrick. “Patrick McMullan Archives.” Getty Images. 19 May 2005.", "Jane Doe 1 and Jane Doe 2 v. U.S. No. 9:08-cv-80736. United States District Court for the Southern District of Florida. 21 Feb 2019.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]