["The 49-second video was published on Facebook here on August 25, 2020. It has been viewed 2.1 million times and shared 13,000 times.", "The post’s Urdu-language caption translates to English as: “Karachi, Surjani Town ! The poors’ Charna Island.”", "Surjani Town is a neighbourhood in Karachi, a major port city in Pakistan. Charna Island is a small uninhabited island just north off the coast of Karachi and is a popular swimming and diving destination.", "The same footage was also shared alongside a similar claim on Facebook here and here; on Twitter here and here; and on YouTube here and here.", "The claim, however, is false.", "A commenter on the misleading YouTube post suggested the video was actually recorded in Indore, a city in the Indian state of Madhya Pradesh.", "A keyword search found the video was also published in several posts on Twitter that identified the location as Indore. One of the tweets, for instance, reads: “Rains in Indore broke a 100 year record yesterday. Chacha (uncle) wasted no time.”", "Further online searches found a man claiming to be the diver in the video.", "The man, who identified himself as Indore resident Zafar Ahmed Khan, addressed the false claim in a video published on Facebook here on September 1, 2020.", "The man states in the video: “My name is Zafar Ahmed Khan … Due to flooding we were busy rescuing the people. After that I dived [into the water] and the video became viral. After it became viral it was broadcast as a video from Karachi, Pakistan … That is fake news. I am in fact a resident of Indore, Madhya Pradesh.”", "The Facebook post’s Hindi-language caption translates to English as: “This guy who lives in Indore is Zafar aka Bhura Bhai, a few days back he was seen jumping from his terrace in a pool of rainwater. His video got viral. That video was shared by Indian Media News18 with a claim that it is from Karachi, Pakistan. Listen to what Bhura Bhai has to say.”", "Below is a screenshot comparison of the Facebook video (L) and the footage shared in the misleading posts (R):", "Heavy rainfall and widespread flooding in Indore in late August 2020 was widely reported by Indian news outlets; for example by India's National Herald newspaper here and by English-language daily newspaper The Times of India here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]