["About this rating", "In January 2017, an image macro was circulated on social media featuring a photograph of actor Harrison Ford along with a statement ostensibly uttered by him, one in which he compared President-elect Donald Trump to \"patriots\" such as Indiana Jones, Jack Ryan, and Han Solo (all of whom are fictional characters):", "For me, Donald Trump is Han Solo, Indiana Jones and Jack Ryan all rolled up into one person. He's a swashbuckling patriot who puts his ass on the line to help his team. He's going to be an amazing president.", "This image macro was posted by Twitter user @TheDefense13, whose Twitter bio as of 14 January 2017 read: \"The truth. So you can defend yourself.\" Although that posting claimed that Ford made this \"emphatic statement supporting #DonaldTrump just in time for the #Inauguration2017. #MAGA,\" these words were not spoken by Harrison Ford.", "We found no record of Ford's uttering the above-quoted phrase. As the President-elect reportedly struggled to attract A-list celebrities in the days leading up to his inauguration on 20 January 2017, these words would have been major news if they had truly issued from the mouth of a prominent entertainer.", "This isn't the first time that Harrison Ford has been falsely painted as an outspoken supporter of Donald Trump: A doctored image showing Ford holding a \"Trump for President\" sign was circulated in March 2016, shortly after which a representative for the actor declared that Ford \"was not endorsing (Trump) for president.\"", "When Ford ventured an opinion about Donald Trump during an interview with Jorge Ramos in December 2015, the actor said he felt Trump was dealing in \"divisiveness\":", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]