["About this rating", "In an interview at Politico's \"Women Rule\" summit, U.S. House Speaker Nancy Pelosi stated that activities related to the impeachment of President Donald Trump had been going on for 2 1/2 years.", "However, the U.S. House-led impeachment inquiry did not start until November 2019 and concluded roughly one month later. Pelosi appeared to include in her answer the start of the U.S. Department of Justice (DOJ)-led Special Counsel probe into Russian interference in the 2016 election, which began in May 2017; House Democrats had initially considered including Mueller's findings in the articles of impeachment but ultimately did not.", "In mid-December 2019, U.S. President Donald Trump claimed on Twitter that House Speaker Nancy Pelosi has been \"working on\" impeaching him for 2 1/2 years.", "Trump was referring to comments made by Pelosi at Politico's “Women Rule” summit on Dec. 10, 2019. Pelosi was asked about the \"speed\" with which the U.S. House, led by Democrats, were undertaking impeachment.", "Pelosi headed an impeachment inquiry in the U.S. House of Representatives against Trump, on accusations that Trump used the office of the president to attempt to extort Ukraine into producing damaging information on a potential political rival. Trump has regularly lashed out at the inquiry as unfair and has sometimes complained that Democratic lawmakers have had it in for him since before the inquiry officially started.", "Ultimately, the House Democratic majority voted to impeach Trump, which means that the proceedings will move to a Senate trial.", "In answering a question at the summit from Politico journalist Anna Palmer, Speaker Pelosi appeared to include the start of the investigation into Russian interference in the 2016 presidential election, led by Special Counsel Robert Mueller, in the impeachment timeline.", "Here is the text of the exchange:", "PALMER: One of the biggest criticisms of the process has been the speed at which the House Democrats are moving.", "PELOSI: Speed?", "PALMER: If this is ... but seriously though, seriously.", "PELOSI: It's been going on for 22 months, okay. Or two-and-a-half years, actually.", "PALMER: There has been some criticism though, I will say, about whether or not you should move forward before the end of the year or wait for the courts. Why do you think now is the time to move.", "PELOSI: I think we're not moving with speed. This, was it two-and-a-half-years ago that they initiated the Mueller investigation. It is not about speed, it's about urgency. One of the charges against the President of the United States is that he was violating his oath of office by asking a foreign government to intervene in our election, undermining the integrity of our elections. If we did not hold him accountable, he would continue to undermine our election. Nothing less is at stake than the central point of our democracy a free and fair election, not disrupted by foreign powers, and our founders were very concerned about that, and in their wisdom, they gave Congress, the House of Representatives, the path, the opportunity, not the opportunity cause I don't see it that way, but the path to correcting that as impeachment. It is not with any speed, this has been going on for a very long time. But there is a sense of urgency. Once you see, we saw the facts, the facts presented in the hearing with the foreign service officers, the facts made known to the public. Some of us have seen them before. The facts made known, the Constitution -- as presented by the constitutional experts. And the facts and the Constitution, there it is. And so again, we do this with great sadness, prayerfully, somberly, it's about the Constitution of the United States. And if we allow one president, any president, no matter who she or he may be, to go down this path, we are saying goodbye to the republic and hello to a president-king. That is what is at stake in this election and this impeachment as well.", "Official impeachment proceedings against Trump began in the House on Nov. 13, 2019. Although Pelosi didn't state this explicitly, Democrats in the House had initially considered including evidence from the Mueller probe in the articles of impeachment, but ultimately decided against doing so. Mueller was appointed on May 17, 2017, to lead the Russia probe, meaning that from May 2017 to when Pelosi made the comments in December 2019, just over 2 1/2 years had lapsed.", "However, Pelosi did not initiate the Mueller investigation — the U.S. Department of Justice did. Mueller was selected to lead the probe by then-Deputy Attorney General Rod Rosenstein, whom Trump nominated for that position. Although Trump and his supporters have typically cast the impeachment proceedings as a Democratic conspiracy, multiple probes have been undertaken into foreign interference in elections related to Trump, including probes by both the House and Republican-led Senate.", "Therefore, although Pelosi apparently lumped the Mueller probe into her answer about the impeachment-inquiry timeline, she didn't thereby \"admit\" she was behind the launch of the Mueller probe, and in fact she was not. The probe was conducted by the Justice Department, which at that time was led by Jeff Sessions and Rosenstein, both of whom Trump selected to lead the agency.", "Investigations have found that the Russian government actively sought to influence the 2016 election in an effort to help Trump defeat his rival Hillary Clinton, although none has found conclusively evidence that Trump himself worked with the Russians in so doing. However, the current impeachment inquiry deals with Trump personally making a phone call to Ukrainian President Volodymyr Zelensky and soliciting a corruption probe into the family of 2020 Democratic presidential candidate Joe Biden in exchange for crucial U.S. military aid to Ukraine. Trump claims his request was solely for the purpose of rooting out corruption in Ukraine and not for personal political gain.", "Politico. \"A Live Conversation with Nancy Pelosi at POLITICO's 'Women Rule' Summit.\"\r\n  YouTube. 10 December 2019.", "Barrett, Devlin, et al. \"Deputy Attorney General Appoints Special Counsel to Oversee Probe of Russian Interference in Election.\"\r\n  The Washington Post. 18 May 2017.", "Laughland, Oliver. \"Impeachment Inquiry: Nadler May Add Mueller Counts Against Trump.\"\r\n  The Guardian. 8 December 2019.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]