["The image was shared in this Facebook post and was published on February 23, 2021.", "The image circulated online weeks after Trump supporters stormed the US Capitol on January 6, 2021 as lawmakers met to certify Joe Biden's victory in the November presidential election.", "More than 150 people have been charged with federal crimes, including assaulting police officers and disrupting a federal proceeding, following the rampage, AFP reported here on January 27, 2021.", "The image was shared in this YouTube video and in this tweet alongside a similar claim.", "The image, however, has been shared in a misleading context.", "A reverse image search on Google found this article about a protest against human rights abuses at the Guantanamo Bay detention camp on a website for Amnesty International.", "The image’s French-language caption translates to English as: “Amnesty International USA activists demonstrate on the 10th anniversary of the Guantanamo Bay Detention Center, Washington DC, USA, January 11, 2012 // Credit: Scott Langley”.", "The demonstration was held to mark the 10th anniversary of the establishment of the Guantanamo Bay detention camp on January 11, 2012, as noted in this Amnesty International press release.", "This BBC News report published on January 12, 2012 about the same demonstration includes footage of the demonstrators wearing orange prisoner overalls as they walk along Constitution Avenue.", "The location can be seen here on Google Maps.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]