["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A theme is emerging in New Jersey’s U.S. Senate race: opponents blaming one another for bloating government debt.\n\nRepublican challenger state Sen. Joe Kyrillos has tied U.S. Sen. Robert Menendez to growth in the national debt and deficits. In an interview on NJTV’s \"On the Record\" that aired June 8, Menendez, a Democrat, responded to those charges.\n\n\"Well first of all, evidently my Republican opponent has selective memory,\" Menendez said, first citing growth in state debt under Kyrillos’ watch.\n\nThen, Menendez said: \"Here's someone who raided the state's -- voted to raid the state's pension funds by $2.8 billion that is costing New Jersey taxpayers still today to the tune of nearly $15 billion dollars to repay that money.\"\n\nKyrillos helped pushed through a controversial plan in 1997 from then-Gov. Christie Whitman to sell nearly $2.8 billion in bonds in a bid to cover unfunded liabilities in the state’s pension system.\n\nTo be clear, we are not ruling on whether the pension bonds were sound fiscal policy. We are also not ruling on Whitman’s overall impact on the pension system. We’re looking at two, specific claims: whether voting for the bonds constituted a $2.8 billion raid on the pension system and whether they are costing taxpayers $15 billion to pay off.\n\nBoth statements veer from the truth, PolitiFact New Jersey found.\n\nThe bond legislation -- approved on June 5, 1997, with Kyrillos voting in favor of it -- authorized the state’s Economic Development Authority to sell $2.75 billion in bonds, the proceeds of which were deposited in state retirement funds for public workers.\n\nA separate, companion bill changed accounting rules for the pension system and allowed the state and local employers to reduce their normal contributions by the amount of surplus in the funds.\n\nThe move allowed Whitman to avoid making nearly $600 million in payments into the pension system that year, which helped balance her budget.\n\nMelissa Castro, a spokeswoman for the Menendez campaign, said \"skipping scheduled payments into the pension system is a raid of pension funds, because by definition, it is reducing the total funds available to pay the funds' obligations.\"\n\nWhitman skipped payments that year -- as she did in others -- but she put nearly $2.8 billion of borrowed money in the funds. That does not fit the definition of a raid.\n\nNow, what’s the final price tag for those pension bonds, which mature in 2029?\n\nMenendez put the tab at nearly $15 billion. According to the state Treasury Department, the bonds -- which the state is paying more than 7 percent interest on -- will cost $10.1 billion to pay off. The general fund shoulders the burden of the bond payments, not the pension system.\n\nTreasury Department spokesman Andy Pratt said it’s unfair to look at the expense of the bonds without also considering the investment interest the money is earning. The average rate of return has been 6.36 percent a year, Pratt said.\n\nUltimately, the state’s general fund is still on the hook for $10.1 billion. In the upcoming budget, debt service on the bonds will cost nearly $300 million.\n\nCastro said whether it was $15 billion or $10 billion, Menendez is still correct on his fundamental point. \"Nevertheless this is still bad fiscal policy,\" she said.\n\nOur ruling\n\nMenendez said Kyrillos \"voted to raid the state's pension funds by $2.8 billion that is costing New Jersey taxpayers still today to the tune of nearly $15 billion dollars to repay that money.\"\n\nKyrillos voted in favor of borrowing $2.75 billion to put into the state’s pension funds. The move allowed Whitman to avoid nearly $600 million in pension payments that year, but overall, money went into the system, not out of it. To call it a vote to raid pension funds by $2.8 billion is inaccurate.\n\nAlso, the bonds will cost taxpayers, in total, about $10.1 billion, not $15 billion.\n\nWe rate this claim False.\n\nTo comment on this ruling, go to NJ.com.", "NJTV, On the Record with U.S. Sen. Robert Menendez, June 8, 2012\n\nPhone and e-mail interview with Melissa Castro, spokeswoman for U.S. Sen. Robert Menendez’s campaign, June 12, 2012\n\nInterview with Andrew Pratt, spokesman for New Jersey Treasury Department, June 13, 2012\n\nNew Jersey Department of Treasury, State of New Jersey: Debt Report, Fiscal Year 2011, published November 2007, accessed June 11, 2012\n\nNew Jersey Department of Treasury, State of New Jersey: Debt Report, Fiscal Year 2007, published Dec. 2, 2011, accessed June 11, 2012\n\nNew Jersey Legislature, Fiscal Note: Senate No. 1905, June 26, 1997, accessed June 11, 2012\n\nNew Jersey Legislature, Senate No. 1905, March 20, 1997, accessed June 11, 2012\n\nThe Star-Ledger, Investors devour $2.76 billion in disputed bonds: Demand produces a savings for state, June 26, 1997, accessed via Nexis on June 11, 2012\n\nThe Star-Ledger, Public skeptical of Whitman's bond proposal: Legislators consider passage certain anyway, March 10, 1997, accessed via Nexis on June 11, 2012\n\nThe Star-Ledger, Rescue of bond sale is pursued GOP puts off hearing in bid to salvage plan, April 16, 1997, accessed via Nexis on June 11, 2012\n\nThe Star-Ledger, Blame game begins on stalled bond sale: Mud hits Whitman, staff and legislators, April 24, 1997, accessed via Nexis on June 11, 2012\n\nThe Star-Ledger, 10 men on a fence test Whitman's skills, April 27, 1997, accessed via Nexis on June 11, 2012\n\nThe Star-Ledger, Bond plan muscles past last obstacles: Whitman inks bill after Senate OK, June 6, 1997, accessed via Nexis on June 11, 2012\n\nThe Record, New Senate candidate dons a new identity, Feb. 2, 2012\n\nNew Jersey State Library, Pension Bond Financing Act of 1997, accessed June 11, 2012\n\nNew Jersey State Library, Fax of pg. 211 from the Senate Journal, June 5, 1997, sent on June 11, 2012\n\nThe Record, Whitman’s praise invites scrutiny of her tax-cut legacy, Jan. 19, 2012\n\nJames B. Burnham, University of Duquesne, professor of finance, \"Evaluating the Use of Pension Obligation Bonds,\" June 2003\n\nBoston College: Center for Retirement Research, Pension Obligation Bonds: Financial Crisis Exposes Risks, January 2010\n\nRutgers University Eagleton Institute of Politics, Governor Christine Todd Whitman Biography, accessed June 12, 2012\n\nThe New York TImes, Pension Deal Proves Costly, July 7, 1997\n\nThe New York Times, Whitman's Borrowing Plan: Criticism May Not Go Away, June 7, 1997", "New Jersey Department of the Treasury, The Governor’s FY 2013 Budget Summary, Feb. 21, 2012", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]