["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "President Donald Trump has drawn bipartisan condemnation after withdrawing American forces from the Turkish-Syrian border, a move that allowed Turkish forces to invade a Kurdish-held territory.", "Turkey launched a ground and air assault on Oct. 9, according to the New York Times, causing terrified civilians to flee south in \"trucks piled high with possessions and children.\"", "But the children pictured in an Oct. 15 Facebook post are not Kurdish, as the post claims, and the photographs employed in this post were all taken years ago.", "\"Tell these Kurdish kids it’s fake news,\" reads the text below photographs of three young children wailing, two amid rubble and one bloody. \"Tell them trump is god. Tell them you’re ‘pro-life.’ What else would you tell them?\"", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The top image in the Facebook post actually shows a Palestinian child in 2016. The AFP photo was shot by Hazem Bader and the caption says: \"A Palestinian child cries as Palestinians salvage items from their homes after it was demolished by Israeli bulldozers in the area of Musafir Jenbah, which includes several villages, in a disputed military zone south of the West Bank of Hebron on Feburary 2, 2016.\"", "The bottom left photo shows a Palestinian boy photographed by Reuters photographer Ibraheem Abu Mustafa in 2008. The caption says: \"A Palestinian boy cries outside his house in the Gaza Strip.\"", "The bottom right image shows a Sipa Press photo of a Syrian boy photographed by Sebastiano Tomada in 2012. The caption says: \"As Bahar Al Aassad’s army steps up its military campaign to regain control of Aleppo, a severely wounded baby is medically treated by the small staff of doctors in one of the city’s last standing hospitals.\"", "We rate this Facebook post False.", "Facebook post, Oct. 15, 2019", "New York Times, In bipartisan rebuke, House majority condemns Trump for Syria withdrawal, Oct. 16, 2019", "New York Times, Turkey agrees to pause fighting, but not to withdraw forces from Northern Syria, Oct. 17, 2019", "New York Times, Turkey launches offensive against a U.S.-backed Syrian militia, Oct. 9, 2019", "Getty Images, Israel-Palestinian-conflict-demolitions, Feb. 2, 2016", "Reuters, A Palestinian boy cries outside his house in the Gaza Strip, Jan. 20, 2008", "Sipa Press, Syria: children wounded in battle for Aleppo, Oct. 3, 2012", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]