["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "House Speaker Nancy Pelosi of Calif. speaks during a news conference on Capitol Hill in Washington, Thursday, Aug. 6, 2020. (AP)", "Pelosi does not have the power to “demand” mail-in voting for November; that is being decided by each state governor", "The HEROES Act includes election funding for states to conduct safe elections in any form during COVID-19", "House Speaker Nancy Pelosi is trying to \"blackmail\" Congress, according to a post on Facebook with heavy use of all-caps:", "\"PELOSI BLACKMAILS CONGRESS! She DEMANDS MAIL IN VOTING or NO 2nd STIMULUS for you and your family.\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "This claim is inaccurate for a lot of reasons, but first some background.", "Under a stimulus package signed into law in March, millions of out-of-work Americans were receiving an additional $600 per week to help them better manage the financial blow dealt by the coronavirus pandemic. Those checks expired at the end of July, and Washington lawmakers are embroiled in negotiations over what should be included in a new stimulus package.", "The Health and Economic Recovery Omnibus Emergency Solutions Act, also known as the HEROES Act, passed the Democrat-led House of Representatives more than two months ago. The Health, Economic Assistance, Liability Protection, and Schools Act, also called the HEALS Act, was introduced by Senate Republicans at the end of July but hasn’t passed the Senate yet.", "There is a $2 trillion price difference between the two bills, but both offer the extension of stimulus checks from the CARES Act, with the HEROES Act upping the payment amount for dependents and extending the checks to immigrants with taxpayer identification numbers.", "Now, back to the claim that Pelosi  \"demands\" mail-in voting and is \"blackmailing\" Congress.", "Pelosi said in April that the House’s second stimulus package would \"be supporting vote by mail in a very important way.\" The stimulus proposal passed by the House doesn’t include any legislation specific to mail-in voting, but it does fund elections generally. The bill includes up to $3.6 billion in funding for the \"planning, preparation, and resilience of elections,\" that would be distributed to states.", "So far, state governors are the ones deciding how to conduct voting and if they will only have mail-in voting in November.", "Congress already allocated $400 million in election funding for states in the CARES Act, and there is bipartisan support for more funding for states considering mail-in or early voting. The Republican-backed Senate bill does not include any extra funding for election safety during COVID-19.", "Federal law describes blackmail as a criminal offense punishable by fine, up to a year in prison or both. It amounts to someone demanding money or something of value from another \"under threat of informing or consideration for not informing against a violation of any law of the United States.\"", "Pelosi has shown support for mail-in voting. But there is no evidence or credible suggestion she has blackmailed anyone.", "Frances Hill, law professor at the University of Miami, describes Pelosi’s negotiations with Republicans as \"playing hardball,\" which is \"routinely played by House Speakers\" and not considered \"blackmail.\"", "\"Voting is the foundation of our democracy and Congress has a duty to ensure that appropriate funding is available,\" she said.", "Our ruling", "A Facebook post claimed that Pelosi is \"blackmailing\" Congress by not allowing a second stimulus bill to pass unless everyone votes by mail.", "Not only are state governors the only ones deciding how each state will vote, but the HEROES Act Pelosi is negotiating includes state funding for safe voting without any reference to mail-in voting.", "We rate this claim False.", "Facebook post, August 4, 2020", "Forbes, HEROES Act Passes House; Omits $2,000 Recurring Stimulus Checks And Other Notable Items, May 16, 2020", "Senate RPC, Update on the Coronavirus Response: HEALS Act, July 28, 2020", "CNBC, How the HEALS Act compares to the HEROES Act, July 30, 2020", "CNN, Massachusetts governor signs bill allowing all voters to vote by mail, July 7, 2020", "The Washington Post, Maryland's Hogan defends Election Day plan against push for all mail-in voting, July 20, 2020", "AXIOS, Nevada governor signs bill on universal mail-in voting after Trump threatens lawsuit, August 4, 2020", "House of Representatives, HEROES Act, May 12, 2020", "U.S. Election Assistance Commission, 2020 CARES Act Grants, accessed on August 6, 2020", "The Hill, Bipartisan support grows for inclusion of election funding in Senate stimulus package, July 22, 2020", "CNN, Pelosi on the coronavirus stimulus price tag she's willing to settle for: '$3.4 trillion', August 4, 2020", "Email exchange with Frances R. Hill, law professor at University of Miami School of Law, August 6, 2020", "U.S. Code, 18 USC 873: Blackmail, accessed on August 7, 2020", "The National Law Review, Federal Blackmail Extortion Statutes and The Travel Act Defined, May 11, 2020", "The Hill, Pelosi, Democrats press case for mail-in voting amid Trump attacks, May 21, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]