["The photo was published on Facebook here on March 25, 2020. Next to the image of Rajapaksa, the lorries in the photo also feature the logo of Sathosa, a state owned retailer.", "Below is a screenshot of the misleading Facebook post:", "The post’s Sinhala-language caption translates to English as: \"Before feeding people and saving lives, one must spend well on branding… Don’t talk about politics in this time\".", "The post was published the same day that the government announced Sathos would join other supermarket chains to deliver groceries during the nationwide curfew implemented to contain the spread of the novel coronavirus.", "The same image was shared on Facebook  here, here and here and on Twitter here with a similar claim.", "The claim is misleading.", "The photo actually shows lorries that were used in 2014 in a distribution campaign organized by Rajapaksa, who was then serving as president. Other photos of the same fleet were published here on December 4, 2014 by Sri Lanka's Daily Mirror newspaper, in an article headlined “Sathosa lorries carry MR image”.", "The lorries in the misleading post’s photo and the Daily Mirror’s photos both show identical branding and bear the logo of Mahinda Chinthana, Rajapaksa’s former election manifesto. The manifesto’s multi-coloured ribbon and lotus blossom logo was discontinued from use following Rajapaksa’s failed presidential bid in 2015.", "Below is a comparison of the images with the specific branding marked by AFP:", "Rajapaksa’s media secretary, Wijayananda Herath, denied the claim that branded Sathosa vehicles were being used to deliver goods during the coronavirus curfew.", "“These false claims were brought before the attention of the PM yesterday. PM’s lawyers lodged a complaint with the Colombo Crimes Division so that legal action can be pursued against those who attempt to disrupt the programs devised by the government during the coronavirus crisis using false information,” Herath told AFP by phone on March 26, 2020.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]