["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Director of the National Institute of Allergy and Infectious Diseases Dr. Anthony Fauci testifies before a House Committee on Energy and Commerce on the Trump administration's response to the COVID-19 pandemic on Tuesday, June 23, 2020. (AP)", "Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases, has become a favorite target of social media misinformation.", "With the recent arrest of Ghislaine Maxwell, who was charged in connection with the sexual abuse case against the late, disgraced financier Jeffrey Epstein, we find another unsubstantiated attack against Fauci.", "\"Fauci is married to Ghislaine Maxwell’s sister,\" reads the description of a photo of Fauci and his wife, Christine Grady, that is being shared on Facebook.", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The photo is from 2016, when Fauci and Grady attended a state dinner at the White House. But while Maxwell is a British socialite who was born in France, Grady is a New Jersey native.", "Grady’s father, the former mayor of Livingston, N.J., was John H. Grady. His wife of 63 years at the time of his death in 2013 was Barbara, a former assistant dean at Seton Hall Law School.", "Maxwell’s parents were Robert Maxwell, a British publishing giant, and Elisabeth Maxwell, who was born in France and established a scholarly journal called Holocaust and Genocide Studies.", "Elisabeth Maxwell was born Elisabeth Jenny Jeanne Meynard. Robert Maxwell changed his name multiple times during his life, but he never went by the name John H. Grady.", "We rate this claim post Pants on Fire.", "Facebook post, July 6, 2020", "NPR, Ghislaine Maxwell arrested, charged in connection to Jeffrey Epstein abuse case, July 2, 2020", "NJ.com, Another reason to love Dr. Fauci: His wife is from New Jersey, April 3, 2020", "Insider, What to know about British socialite Ghislaine Maxwell, Jeffrey Epstein’s alleged madam who was just arrested by the FBI, July 3, 2020", "The Star Ledger, John H. Grady Jr. obituary, visited June 2, 2013", "The Washington Post, Elisabeth Maxwell, widow of British media tycoon, dies at 92, Aug. 10, 2013", "Vanity Fair, \"Ghislaine, is that you?\": Inside Ghislaine Maxwell’s life on the lam, July 3, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]