["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "U.S. Rep. Sean Casten. | Rich Hein/Sun-Times", "The day before the U.S. House of Representatives passed a bill to lower prescription drug prices, Illinois Democratic Rep. Sean Casten countered critics who argue the plan limits funding for research and development of new life-saving medications.", "PolitiFact has already evaluated a version of that critique made by a drug manufacturers’ group, rating it Mostly False. During a recent Facebook livestream, Casten of Downers Grove struck back at the plan’s critics with an entirely different claim on the subject that also caught our attention.", "\"From 2000 to 2016, every major drug that was introduced came out of NIH funding,\" Casten said. \"That is your taxpayer dollars. And so what we’ve done with the savings from this bill, which are huge, is to funnel a significant chunk of that back to NIH.\"", "Casten was referring to the National Institutes of Health, which is part of the U.S. Department of Health and Human Services and serves as the nation’s medical research agency.", "A peer-reviewed study found that NIH funding contributed to scientific findings underpinning every one of the more than 200 new drugs approved by the Food and Drug Administration over the timeframe it covered. But the study only dated back to 2010 — not 2000, as Casten claimed.", "In response to our inquiry, Casten’s office updated his Facebook video post with a correction.", "\"At minute 4:17, Congressman Casten stated from ‘2000 to 2016, every major drug that was introduced came out of NIH funding.’ The correct date range is 2010-2016,’\" the post now reads.", "Still, we wanted to set the record straight for those who haven’t seen the update, and provide some additional context about the overall issue.", "Casten raised the public funding for new drug research issue while advocating for Democratic House Speaker Nancy Pelosi’s plan to rein in prescription drug prices.", "The plan would direct Medicare to negotiate the cost of a limited number of drugs, cap what Medicare patients pay out-of-pocket at $2,000 per year and require companies that raise prices beyond inflation to give rebates back to the government.", "The bill — House Resolution 3 — passed the House on Dec. 12 with a mostly party-line vote. While not expected to gain approval in the Republican-run U.S. Senate, it is the latest foray by Democrats in a political battle over prescription drugs that has existed for years. It also represents a framework for how Democrats propose tackling the perennial issue of rising prescription drug prices.", "In 2017, researchers analyzed the contribution NIH funding has made to research associated with all 210 new drugs approved by the FDA between 2010 and 2016. Collectively, they found, the grant funding for this research totaled more than $100 billion.", "Because 95% of those funds went toward the kind of foundational biomedical research that can contribute to the creation of multiple drugs rather than a specific drug product, the report concludes, NIH \"complements industry research and development, which focuses predominantly on applied research.\"", "The study’s lead author, data analyst Ekaterina Cleary of Bentley University in Massachusetts, told us she wasn’t aware of any similar studies dating further back. She said Casten’s broader take that every new drug introduced within her study’s time frame \"came out of NIH funding\" checks out.", "\"I would say that’s true,\" she said. \"Government funding contributes to basic science that enables successful development. Obviously, without that basic research, you can’t develop the drug.\"", "However, Cleary added, the costly clinical trials that manufacturers conduct are also crucial to creating new medications.", "\"I know our study is frequently interpreted as, ‘the public sector developed these drugs,’ but they didn’t do it single-handedly,\" she said. \"So it’s an important distinction to make to acknowledge pharmaceutical companies’ role in the trials that they develop.\"", "Casten said that \"from 2000 to 2016, every major drug that was introduced came out of NIH funding.\"", "A 2018 study found NIH funding contributed to the science that underlies every one of the 210 new drugs approved by the FDA between 2010 and 2016 — not 2000 to 2016, as Casten claimed.", "Following our inquiry, his office posted a correction on Facebook.", "Casten misstated the time period covered by the report, but his overall point tracks with its findings. So we rate his claim Half True.", "HALF TRUE – The statement is partially accurate but leaves out important details or takes things out of context.", "Click here for more on the six PolitiFact ratings and how we select facts to check.", "\"The House Passed Its Prescription Drug Plan — Here's What's In It,\" NPR, Dec. 12, 2019", "\"Pharma’s take on the Pelosi drug-pricing bill: Fair warning or fearmongering?\" PolitiFact Health Check, Dec. 5, 2019", "Video, Congressman Sean Casten’s Facebook page, Dec. 11, 2019", "Report: Contribution of NIH funding to new drug approvals from 2010-2016, Proceedings of the National Academy of Sciences of the United States of America, Feb. 12, 2018", "Phone interview and email, Ekaterina Cleary, lead data analyst at Bentley University’s Center for Integration of Science and Industry, Dec. 17 - 18, 2019", "Email, Casten spokesperson Maddie Carlos, Dec. 18, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]