["“I found these photos of 1918 flu pandemic (sic),” reads this Facebook post in South Africa from June 11, 2020. “So relatable …”", "Shared more than 250 times, it includes a collection of old black-and-white photographs. The people in them are wearing various forms of face coverings.", "Similar posts with the same claim have appeared in Bangladesh, Pakistan and the United States. Apart from two or three exceptions, the photographs are the same throughout.", "The 1918 influenza pandemic -- sometimes referred to as the Spanish Flu or Spanish Lady -- was one of the deadliest in history. Lasting until 1920, it infected an estimated 500 million people (roughly a third of the global population at the time) and is thought to have claimed up to 50 million lives.", "AFP Fact Check ran reverse image searches using Google, Yandex and TinEye to trace the origins of each photograph used in the posts. We found six images unrelated to the 1918 flu pandemic.", "An image of two women walking down a street adorned with what appear to be face masks was taken five years before the great influenza outbreak. A recent debunk by AFP Fact Check’s Thailand bureau quoted a spokesman for German photo agency Süddeutsche Zeitung Photo saying it showed “nose veil” fashion in 1913.", "Another picture of two women, this time sporting pointed plastic cones, comes from 1939 in Montreal, Canada, according to the Dutch national archive website and the Spaarnestad Collection, which owns the image rights. The caption on the order form says the cone-like coverings were used for protection against snow.", "It was also bad weather that had another pair of women taking cover in 1953, this time beneath what appear to be large transparent bags.", "“War surplus gas capes are used by Meriel Bush, left, and Ruth Neuer, in an attempt to dodge the eye-stinging effects of a low-hanging smog and smoke which enveloped Philadelphia for the second straight day, Nov. 20, 1953,” reads the caption by AP Images. “Freak weather conditions throughout the east have been blamed for the haze.”", "More conventional use of wartime supplies can be seen in a photo showing a mother, among others, during a drill. “Gas Test, 9th June 1941: A gas masked young mother attends to her child's pram gas mask during a surprise gas test in Kingston,” reads the caption on the Getty Images website.", "A telephone advert from 1910 is another purporting to show life during the pandemic. It appeared in the St. Louis Post-Dispatch on November 17 and although the Bell Telephone was marketed as a way for people to keep in touch “when in quarantine”, it came years before the flu pandemic but at a time when other disease outbreaks were common and authorities imposed isolation measures to contain them.", "From a different century altogether and a poster more synonymous with COVID-19, “Stay at home” was designed as a “call to action” against the novel coronavirus by French illustrator Mathieu Persan, according to an interview here.", "AFP Fact Check established that the remaining images included in the posts were correctly associated with the 1918 flu pandemic, according to information from the various collections and archives they belong to.", "These hosted by Getty Images show a converted quarantine centre, a woman using a breathing apparatus, Seattle policemen wearing masks, a Red Cross nurse, a flu ward at Walter Reed Hospital and two women with face masks.", "Captions by Alamy stock photo agency on two public service adverts here and here confirm they, too, are from 1918. They offer advice on how to prevent infections, including tips on making a mask.", "Another image traced back to the beginning of the outbreak was published recently by The New York Times as part of a story about the pandemic’s deadly impact on Philadelphia. The photograph of a sign on a tram saying “Spit spreads death” was credited to the Historical Medical Library of The College of Physicians of Philadelphia and dated October 1918.", "One of the internet’s more popular images that resurfaced during COVID-19 depicts a family guarding against infections with cloth masks, including one fashioned for their pet cat.", "Two Californian online archives here and here don’t name the family, but this article by a local museum about the town of Pleasanton, California, responding to the pandemic identifies them as the Del Perugias.", "Finally, AFP Fact Check traced the photograph of a boy standing in front of a shuttered theatre to Toronto, Canada. The shot appears in this video narrated by a local historian and was published in April in a news story with the caption: “A newsie hawks papers in front of Toronto's Loew's Downtown, now the Elgin, during the 1918 Spanish-flu pandemic. MIRVISH ARCHIVES”.", "Google Maps confirms he stood in front of the Elgin Theatre in Toronto; note the ticket box with its distinctive angular shape and the glass entrance doors to the right, features that match the original photograph.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]