["The 25-second video was published here on Facebook on February 11, 2020.", "It shows a murder of crows flying at night over a street.", "The post’s caption states: “A truly disturbing number of crows have descended into Wuhan, China... what could be attracting so many? Hundreds of people die all the time. Their city is bigger than New York... No what’s happening here is much bigger and much darker.”", "Below is a screenshot of the misleading post:", "The novel coronavirus has killed more than 1,300 people and infected almost 60,000 others in China after it was discovered in Wuhan in late 2019, AFP reported here on February 13, 2020.", "The same video has been viewed tens of thousands of times here and here on Twitter, as well as here and here on Facebook alongside a similar claim.", "A shorter version of the clip was also shared here on YouTube and here on Instagram with a similar claim.", "The claim is misleading; the video was filmed more than 1,000 miles northwest of Wuhan in the Chinese city of Xining in Qinghai province.", "A keyword search found the same video in an earlier post published here by Twitter user @nerd_hawk on February 11.", "The caption states: “Crows crowded on the Wusi Road, Chengxi District, Xining City, Qinghai Province. Crows love dead animals, like carrion. It looks like the movie Resident Evil. #coronavirus.”", "Below is a screenshot comparison of the video in the misleading posts (L) and the video posted by Twitter user @nerd_hawk (R):", "A search on Baidu Maps found the location in the video directly corresponds with this junction in the Chinese city of Xining.", "Below is a screenshot comparison of the video in the misleading posts (L) and the street view imagery on Baidu Maps (R) with some corresponding elements circled in red by AFP:", "A keyword search also found parts of the video in the misleading posts published here on Weibo by Chinese media outlet Pear Video on February 11.", "The video’s simplified Chinese-language caption translates to English as: \"#CrowsswarmedXiningstreets#, residents: a familiar, terrifying yet beautiful winter scene] February 9, 2020. Xining, Qinghai. A man named Hua Yi posted a video showing a group of crows flying over Wencheng Road and caught netizens’ attention. He said the sighting had been common since he moved to the area in September last year, at the beginning of winter. It is a little scary yet wonderful to see dark objects moving above the street in the evening, about 7 pm.\"", "Below is a screenshot of the Pear Video report:", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]