["About this rating", "Popular doughnut chain Krispy Kreme is giving a free doughnut to any customer who talks like a pirate on International Pirate Day, 19 September 2016. This year, the parody holiday falls on a Monday.", "According to the chain's web site, Krispy Kreme outlets will hand out a free glazed doughnuts to any customer who utters a piratical phrase such as \"arrr, matey.\" But those who go the extra mile and dress like sea marauders will get a full box of glazed doughnuts:", "Saturday, September 19, any buccaneer to enter a participating Krispy Kreme and talk like a pirate gets one FREE Original Glazed® doughnut. To the landlubber who dares to wear full pirate attire goes a bounty of one FREE dozen Original Glazed doughnuts. Offer good on International Talk Like a Pirate Day, September 19th, only. At participating Australia, US and Canadian locations.", "Krispy Kreme cautions that customers are not allowed to bring weapons into their stores, but they do encourage suggested costume items such eye patches; pirate hats, pirate flags, bandannas, peg legs and pirate shirts.", "On the chain's Facebook page, they confirmed the giveaway would continue this year, with this update to the rules:", "Dress as a pirate (have to have three items to be considered being pirate or what's new is to use our Snapchat geofilter available near all of our 300+ locations to count as dressing like a pirate).", "The Talk Like a Pirate Day free doughnut giveaway has become a yearly tradition at Krispy Kreme. Be sure to avoid disappointment by checking their web site for participating stores before setting out in buccaneer garb.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]