["A screenshot of the purported tweet was posted in this Facebook post on June 15, 2020. It has been shared more than 300 times.", "The purported tweet from the @RahulGandhi Twitter account states: “I am sorry to hear about the passing of #SushantSinghRajput. A young & talented Cricketer gone too soon. My condolences to his family, friends & fans across the world.”", "Sushant Singh Rajput, a 34-year old bollywood actor, was found dead at his residence on June 14, AFP reported here on the same day. Rajput played Mahendra Singh Dhoni, former captain of the Indian cricket team, in a 2016 biopic.", "The purported tweet appears to be from the verified Twitter account of former opposition leader Rahul Gandhi. The caption of the misleading Facebook post, which reads: “Movie Star became Cricketer”, appears to mock Gandhi for confusing Rajput with a cricketer.", "The image was also shared here, here, here and here on Facebook, and here, here, here and here on Twitter alongside a similar claim in English and Hindi.", "The claim, however, is false.", "A keyword search on Twitter found this post published on Gandhi’s Twitter account on June 14, 2020. The tweet has the same time and date stamps as the one in the misleading posts. The tweet includes the word “actor” instead of “cricketer”.", "Below is a screenshot comparison of the doctored tweet (L) and the original tweet from Gandhi (R) with the time and date stamps, as well as the key difference marked in red by AFP:", "“This is not the original tweet but a doctored one,” Randeep Singh Surjewala, chairperson of the communication department of Indian National Congress (INC), India’s main opposition party, told AFP in a text reply on June 20. Gandhi was the president of the INC between 2017 and 2019.", "AFP has previously debunked misleading claims related to doctored visuals of Gandhi here, here and here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]