["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "President Donald Trump stands in the Oval Office on Oct. 24, 2019. (AP)", "President Donald Trump argues that his July 25 phone call with Ukraine President Volodymyr Zelensky was \"perfect,\" and that Democrats have distorted it to build their case for impeachment.", "In an interview with conservative show host Dan Bongino, Trump said a false rendition of that call by House Intelligence chairman Adam Schiff, D-Calif., forced him to release the readout of that call.", "\"They never thought, Dan, that I was going to release that call, and I really had no choice because Adam Schiff made up a call,\" Trump said Nov. 15. \"He said the president said this, and then he made up a call.\"", "The problem with Trump’s statement is that Schiff spoke after the White House released the memo of the phone call, not before.", "Sept. 9, 2019: Michael Atkinson, inspector general of the intelligence community, notifies Rep. Adam Schiff, chairman of the House Intelligence Committee, that there was a whistleblower complaint of \"urgent concern.\"", "Sept. 19, 2019: Atkinson briefs the House Intelligence Committee in a closed-door session.", "Sept. 24, 2019: House Democrats launch a formal impeachment inquiry.", "Sept. 25, 2019: The White House releases a declassified summary of the July 25 telephone call between Trump and Zelensky.", "Sept. 26, 2019: Schiff makes opening remarks at a hearing with Joseph Maguire, the acting director of national intelligence. Maguire was questioned because he had not forwarded the inspector general’s findings to conference.", "At that Sept. 26 hearing, Schiff offered a dramatized synopsis of Trump’s call with Zelensky. He described rhetorically the nature of Trump’s message to Ukraine.", "Trump later latched on to Schiff’s words, saying he was lying to the public.", "\"Rep. Adam Schiff illegally made up a FAKE & terrible statement, pretended it to be mine,\" Trump tweeted Sept. 30.", "Rep. Adam Schiff illegally made up a FAKE & terrible statement, pretended it to be mine as the most important part of my call to the Ukrainian President, and read it aloud to Congress and the American people. It bore NO relationship to what I said on the call. Arrest for Treason?", "We can find no other version of Schiff describing the call before the summary emerged.", "We reached out to the White House and did not hear back.", "Trump said that the White House released a summary of his call with Zelensky after Schiff gave a false rendition of the call.", "The summary came out before Schiff described the nature of the call at a hearing.", "We rate this claim False.", "Dan Bongino Show, Interview with Donald Trump, Nov. 15, 2019", "PolitiFact, Adam Schiff's retelling of Donald Trump's Ukraine phone call isn't treason, Oct. 1, 2019", "Donald Trump, tweet, Sept. 30, 2019", "PolitiFact, In context: Adam Schiff’s dramatized version of the Trump-Zelensky call, Sept. 30, 2019", "PBS Newshour on YouTube, \"WATCH: Rep. Adam Schiff's full opening statement on whistleblower complaint | DNI hearing,\" Sept. 26, 2019", "PolitiFact, Timeline: The Trump impeachment inquiry, Nov. 13, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]