["ID2020 is a digital identification program that is supported by Microsoft and an organization funded by the Bill and Melinda Gates Foundation.", "There is no evidence the president has taken any steps to stop ID2020.", "Has President Donald Trump \"canceled\" a global effort aimed at providing individuals access to personal identification?", "That’s what a Facebook post that references a digital identification program called ID2020 claimed:", "\"BREAKING NEWS!! US PRESIDENT CANCELLED BILL GATES PROJECT KNOWN AS ID2020.\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "We found no evidence to back the claim.", "ID2020 is a New York City-based nonprofit formed in 2016 that has drawn international partners interested in promoting access to digital forms of identification. \"For the one in seven people globally who lacks a means to prove their identity, digital ID offers access to vital social services and enables them to exercise their rights as citizens and voters and participate in the modern economy,\" the organization says.", "Among the founding partners are Microsoft, the company Bill Gates co-founded; and Gavi, which helps provide vaccines to developing countries and gets funding from the Bill and Melinda Gates Foundation.", "ID2020 is partnering with GAVI and the government of Bangladesh to provide children in Bangladesh with a biometrically-linked (using a fingerprint or iris scan, for example) digital health ID at the time of birth or first immunization.", "ID2020 deid not comment on the claim. Our June 8 searches of Google and Nexis turned up no mention of Trump taking any action against ID2020 or even making mention of it. And we found no mention of ID2020 in June 8 searches of TrumpTwitterArchive.com and the Factba.se database of Trump tweets, speeches and other remarks.", "Our fact-checking colleagues at Africa Check and FactCheck.org also found that Trump had not canceled the program.", "We rate the statement False.", "Facebook, post (archived here), June 3, 2020", "Africa Check, \"No, US president Trump has not cancelled ID2020 – and digital identity project not run by Bill Gates,\" June 5, 2020", "Email, ID2020 media affairs, June 8, 2020", "FactCheck.org, \"Facebook Posts Distort Facts on Trump Actions,\" May 22, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]