["“If you have not been to kisii town this is what you are missing,” reads a Facebook post shared more than 1,000 times since September 5, 2020.", "Kisii is a town located in south-western Kenya.", "The video is 38 seconds long and shows a busy street scene from overhead, with dozens of motorcycles and cars appearing to drive chaotically across a large intersection.", "Using the video verification tool InVID WeVerify, AFP Fact Check ran a reverse image search on multiple frames of the video and located the clip in YouTube videos here, here and here, which are described  as showing traffic in Vietnam’s Ho Chi Minh city. These videos show traffic moving at a normal speed, as opposed to the sped-up Facebook clip.", "A search with the keywords “motorcycle traffic in Vietnam” on Google turned up a similar video which is much clearer and also filmed from the same elevated angle. Visual cues like a petrol station, buildings and an electrical post are evident in both versions of the video.", "One of the standout features in both videos is a petrol station in the top right with blue and yellow corporate colours. A search of petrol stations in Vietnam revealed that Petrolimex, Vietnam’s liquefied petroleum gas state company, has the exact features.", "On Google Maps, we examined the different locations of Petrolimex in Vietnam and spotted this one which resembles the petrol station in the videos and is found on Trần Hưng Đạo street.", "Meanwhile, another video shows the same junction where Trần Hưng Đạo street crosses Nguyễn Văn Cừ street. Evident is a branch of Sacombank, a bank in Vietnam with blue and white branding and below it a restaurant called Jollibee. Both are situated opposite the petrol station and can be seen on Google Maps.", "Google Street View also reveals that the junction is controlled by traffic lights, meaning the traffic flow is controlled, contrary to the disorderly scene the video on Facebook appears to show because it has been manipulated to increase the speed. This video also shows the same.", "In contrast, we surveyed different junctions in Kisii town using Google Maps street views and there is no resemblance to the junction seen in the videos.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]