["About this rating", "On July 2, 2020, British socialite Ghislaine Maxwell was arrested by the FBI on charges of conspiring with convicted pedophile Jeffrey Epstein to sexually abuse children. Epstein, a financier, was awaiting trial in the fall of 2019 when authorities say he committed suicide in a jail cell.", "Fox News reported:", "Jeffrey Epstein’s confidant Ghislaine Maxwell was arrested in New Hampshire on Thursday morning on multiple sex abuse charges including conspiracy to entice minors to engage in sexual acts.", "Epstein’s former girlfriend and accused madam was taken into custody at 8:30 a.m. in Bradford, N.H., the FBI confirmed to Fox News. She had purportedly been hiding out in Paris, France before her arrest.", "Maxwell, the daughter of late British media magnate Robert Maxwell, has been accused in civil court filings of facilitating a sex-trafficking operation that brought girls -- some as young as 14 -- to Epstein's Manhattan home, though until Thursday she had not been formally charged with any criminal wrongdoing.", "Shortly after the news broke, social media platforms were flooded with videos and photographs that supposedly showed U.S. President Donald Trump and Maxwell together. One of the most popular videos showed Trump and Epstein talking at a party while  a woman resembling Maxwell stood in the background:", "https://www.youtube.com/watch?v=KLcfpU2cubo&feature=emb_logo", "This is a genuine video of Trump and Epstein at a party at Trump's private Florida club, Mar-a-Lago, in 1992. The woman in the background arrived at the party with Epstein, as seen in this clip from MSNBC. Furthermore, Maxwell was photographed on at least three other occasiions at Mar-a-Lago.", "Before we delve into the other media showing Trump together with Maxwell, it should be noted that simply being photographed with a person is not a crime. Maxwell is often referred to as a \"socialite,\" and has been photographed with numerous politicians and celebrities, including Elon Musk, Calvin Klein, Roger Waters, and former New York City Mayor Michael Bloomberg. Epstein, too, had a number of a high profile acquaintances, including both Trump and former President Bill Clinton.", "It should also be noted that all of the following photographs were taken prior to Maxwell's arrest in July 2020, and before authorities first started investigating Epstein for sexual crimes against minors in 2005.", "All of these images of Maxwell with Trump are real.", "The image on the top left is still from NBC's archival footage shown above. This footage was originally shot by NBC for Faith Daniels’ talk show, “A Closer Look,” as part of a profile on Trump's post-divorce life.", "The image on the top right was taken by Arnaldo Magnani in 1997, and shows the duo out on the town. The original image can be seen on Getty Images.", "The image in the center left shows Maxwell, model Naomi Campbell, Trump, and Melania at the opening of Dolce & Gabbana in 2002 in New York City. The image is available via Getty Images.", "The center right image shows Trump, Melania Trump -- then Melania Knauss -- Epstein, and Maxwell at Mar-a-Lago in 2000.  It is available via Getty Images here.", "The bottom left image was reportedly taken at a party in NYC in 1997. It is a cropped version of an image that also originally included socialite Ann Jones. This photograph was taken by Alpha Press, and is available via The Sun.", "The image on the bottom right shows Trump and Maxwell in 2000 at the Anand Jon Fashion Show in New York City. It is available via Getty Images.", "While all of these photographs were taken before authorities first opened up an investigation into Epstein for sexual abuse crimes against minors, prosecutors allege that Maxwell was aiding him in his criminal activities back in the 1990s. The indictment against Maxwell reads:", "\"In particular, from at least in or about 1994, up to an including at least in or about 1997, Maxwell assisted, facilitated, and contributed to Jeffrey Epstein's abuse of minor girls by, among other things, helping Epstein to recruit, groom, and ultimately abuse victims known to Maxwell and Epstein to be under the age of 18.", "Chakraborty, Barnini.   \"Jeffrey Epstein’s Confidant Ghislaine Maxwell Arrested on Sexual Abuse Charges.\"\r\n    Fox News.   2 July 2020.", "Scannel, Kara.   \"Ghislaine Maxwell, Jeffrey Epstein's Longtime Associate, Has Been Charged with Enticement of Minors.\"  \r\n  CNN.   2 July 2020.", "BBC.   \"Jeffrey Epstein: Questions Raised Over Disgraced Financier's Death.\"\r\n    11 August 2019.", "Twohey, Megan; Bernstein, Jacob.   \"The ‘Lady of the House’ Who Was Long Entangled With Jeffrey Epstein.\"\r\n    The New York Times.   15 July 2019.", "Parry, Emma.   \"DADDY’S GIRL Epstein 'Madam’ Ghislaine Maxwell ‘Milked Billionaire Dad and Threw Lavish Parties with Beautiful Women.’\"\r\n    The Sun.   13 November 2019.", "Voytko, Lisette.   \"NBC Video Surfaces Of President Trump Partying With Jeffrey Epstein In 1992.\"\r\n   NBC News.   7 July 2019.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]