["About this rating", "In 1992, Abrams took part in a protest in which she and other black student activists set fire to the then-current Georgia state flag, which incorporated the Confederate battle flag.", "Abrams did not burn what is now the Georgia state flag. The flag she and others burned in 1992 was later replaced amid concerns that its incorporation of the Confederate battle flag and the circumstances surrounding its adoption in 1956 meant it was a symbol of white supremacy and racial segregation.", "One of the most high-profile and controversial elections campaigns in the autumn of 2018 was that for the governorship of Georgia, which pitted Republican Secretary of State Brian Kemp against former Democratic State Representative Stacey Abrams -- the latter of whom, if elected, would make history as the first black woman in U.S. history to become a state governor.", "The Abrams campaign accused Kemp of orchestrating voter suppression, a claim we previously investigated, while Kemp's campaign accused Abrams of manufacturing outrage, and President Donald Trump -- of whom Kemp is a staunch supporter -- weighed into the race by calling the Democratic candidate \"totally unqualified.\"", "In the final days of the campaign, the two candidates were virtually inseparable in the polls, according to the web site FiveThirtyEight.", "On 22 October, the night before a crucial televised debate between the rivals, reports emerged about a protest staged 26 years earlier in which Abrams, then a college student, took part in a public burning of the then-current Georgia state flag, an event of which the New York Times wrote:", "At a protest on the steps of the Georgia Capitol in 1992, Stacey Abrams, now the Democratic candidate for governor, joined in the burning of the state flag, which at the time incorporated the Confederate battle flag design and was viewed by many as a lingering symbol of white supremacy.", "Ms. Abrams’s role in the protest, which took place around the end of her freshman year at Spelman College in Atlanta, has begun to emerge on social media on the eve of her first debate Tuesday with her Republican opponent, Secretary of State Brian Kemp. Mr. Kemp and his allies have sought to portray her as “too extreme for Georgia.”", "One post, written by the conservative Georgia blogger and broadcaster Erick Erickson, created the potential for confusion by stating in its headline that Abrams had burned \"the flag,\" only specifying in the body of the article itself that the flag was the \"Georgia state flag\" and not that of the United States.", "In particular, social media users, especially conservative opponents of Abrams, began sharing a photograph which appeared to show Abrams (third from the left) taking part in the flag-burning:", "Georgia Democratic Candidate for Governor Stacey Abrams shown here on the front steps of the Georgia Capitol burning the Georgia State Flag. pic.twitter.com/eYaDKtJRLT", "— LDB (@GDAWG1958) October 22, 2018", "The photograph is authentic. Abrams did indeed take part in a flag-burning protest in Atlanta in June 1992, a fact her campaign acknowledged and defended in October 2018.", "The widely-shared photograph was published in the Atlanta Constitution on 15 June 1992 alongside an article which reported that Abrams and several other members of the group Students for African-American Empowerment had burned the then Georgia state flag during a peaceful protest on the steps of the State Capitol, because the flag incorporated the Confederate battle symbol: \"When the Confederate flag flew in the Civil War, it stood for white dominance and slavery,\" said 21-year-old SAAE member Kevin Donaldson. \"As a state flag, it still flies for white dominance and slavery.\"", "In a later Atlanta Constitution article, Abrams' father Robert said his 18-year-old daughter, a freshman at Spelman College in Atlanta, had received abusive phone calls at home in the aftermath of the protest:", "\"Stacey is not going to stop what she's doing because of other people,\" Mr. Abrams said, just days after his daughter received abusive phone calls because she helped lead the rally where Georgia's flag was burned. \"It's been unsettling,\" Stacey Abrams said. \"I got a call from one woman who said her family died in the Civil War, and the flag was a symbol of Southern heritage. She said if black people didn't like the flag, get the hell out. It's really strange to have someone call your house, ask for you by name, and call you a nigger.\"", "Students for African-American Empowerment was formed in May 1992 by members of the Atlanta University Center (an association of black students of four historically black colleges in Atlanta), after the acquittal of four Los Angeles police officers charged in the brutal, video-taped beating of Rodney King, an event which sparked protests and rioting in Los Angeles and other cities throughout the United States, including Atlanta.", "The 1956 Georgia state flag", "The flag that Abrams and her fellow activists burned was introduced in Georgia in 1956 and incorporated the Confederate battle flag, which is widely perceived by African Americans as a symbol of white supremacy and racism.", "The 1956 flag was designed by John Sammons Bell, an attorney, World War II veteran, former chairman of the Georgia Democratic party, and a fervent critic of federally-enforced racial integration (including the landmark 1954 Supreme Court ruling in Brown vs. the Board of Education).", "According to an analysis commissioned by the Georgia State Senate in 2000, Bell was regarded in 1956 as \"one of the nation’s staunchest pro-segregationist public officials.\"", "The analysis concluded that, despite arguments to the contrary by those who supported changing the state flag, the incorporation of the Confederate battle flag into the new flag in 1956 was part of a backlash against the federal government's imposition of racial integration in public life during that decade:", "The 1956 General Assembly changed the state flag, in an atmosphere of preserving segregation and resentment toward the United States government, as a symbolic gesture to show Washington that Georgia’s leaders intended to uphold what they “stood for, will stand for, and will fight for.\"", "The 1956 flag was replaced in 2001, but its successor proved unpopular, and the current Georgia state flag -- which completely removed the Confederate battle flag -- was definitively adopted after voters endorsed it in a March 2004 referendum.", "The Abrams campaign did not respond to our request for comment but gave a statement to the New York Times, acknowledging and defending the gubernatorial candidate's participation in the flag-burning protest:", "Ms. Abrams’s campaign, in a statement Monday, said her actions in 1992 were part of a “permitted, peaceful protest against the Confederate emblem in the flag” and part of a movement that was ultimately successful in changing the flag.", "“During Stacey Abrams’ college years, Georgia was at a crossroads, struggling with how to overcome racially divisive issues, including symbols of the Confederacy, the sharpest of which was the inclusion of the Confederate emblem in the Georgia state flag,” the statement read. “This conversation was sweeping across Georgia as numerous organizations, prominent leaders, and students engaged in the ultimately successful effort to change the flag.”", "Fausset, Richard.   \"Stacey Abrams's Burning of Georgia Flag with Confederate Symbol Surfaces on Eve of Debate.\"\r\n     The New York Times.   22 October 2018.", "Erickson, Erick.   \"Georgia's Democrat Candidate for Governor Burned the Flag.\"\r\n    TheMaven.net.   22 October 2018.", "Blake, John.   \"AUC Students Burn State Flag in Protest at Capitol.\"\r\n    The Atlanta Constitution.   15 June 1992.", "Blake, John.   \"Never Again the Same -- AUC Protesters Find Lives Taking New Directions Since King Verdict.\"\r\n    The Atlanta Constitution.  27 June 1992.", "Azarian, Alexander J. and Eden Fesshazion.   \"The State Flag of Georgia: The 1956 Change In Its Historical Context.\"\r\n    Georgia State Senate Research Office.   August 2000.", "The Atlanta Journal-Constitution.   \"A History of Georgia's State Flag: Things to Know.\"\r\n    23 October 2018.", "Hart, Ariel.   \"The 2004 Campaign: Flag Dispute; Georgians Vote to Keep New Flag.\"\r\n     The New York Times.   3 March 2004.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]