["“Myanmar’s Nov election: Used Dominion & Smartmatic Millions of voting irregularities found Election Commission refused to look at evidence or cross-check voter rolls Military sees its role as stopping gov from breaking laws Arrests winner New election to be held Hello? America?” says a February 2, 2021 tweet.", "These lines were echoed in social media circles skeptical of the legitimacy of Joe Biden’s victory against Trump, such as this Republican-leaning Instagram account. They were also shared on Facebook here, eliciting approving comments such as “Exactly what needs to happen here!” or “Time for our military to do the same!!”", "Other social media posts also peddled the claim that Myanmar used Dominion and Smartmatic machines, also making parallels with the United States.", "“Is Dominion going to sue the Burmese military for defamation too or are we going to take a serious look at what really happened on Nov. 4,” one wrote, alluding to vote counting after US election day. Another said: “Biden admin panicking after military in Myanmar arrests political leaders for election fraud in their November 8 elections.”", "But Dominion and Smartmatic -- which have filed defamation suits over false claims that they enabled fraud in the US -- were not involved in the November 8, 2020 election in Myanmar.", "Samira Saba, spokeswoman for Smartmatic, told AFP by email: “Smartmatic had no involvement in Myanmar’s 2020 elections.”", "She added: “In fact, Smartmatic has never provided any election technology or services to authorities in that country. Any claim to the contrary is simply false.”", "Dominion did not respond to repeated requests from AFP for comment.", "But a spokesperson for the company told fact-checking organization PolitiFact: “This is a completely false claim. Dominion systems have never been used in Myanmar at any time.”", "In Myanmar’s recent election, the party of the country’s de facto leader, Nobel Peace Prize winner Aung San Suu Kyi, won a landslide victory over the military’s favored party.", "Paper ballots were counted by hand after voters filled them out with stamps, as can be seen in this photo and the below video, which were shot by AFP on election day.", "A General Fact Sheet published by STEP Democracy, a European Union-funded program that supports democracy in Myanmar, lists in detail all the equipment allowed inside polling stations.", "It says voters use “ballot paper” and does not mention Smartmatic or Dominion equipment.", "“Sensitive materials” that “must always be secured and accounted for by an election official” included ballots and counterfoil, ballot boxes, ballot box seals, voting stamps, and voter lists, it says. Other materials included tamper-proof bags, baskets to count ballots, and envelopes for advance voting", "Social media users who sought to compare the situation in Myanmar to that in the United States were relying on debunked claims that equipment used during the November 2020 US presidential election granted Biden fraudulent votes that allowed the Democrat to win.", "Dominion is seeking damages of $1.3 billion from Trump’s lawyer Rudy Giuliani in a defamation suit over his claims that the company’s machines were part of a “massive fraud.”", "Smartmatic is meanwhile suing Fox Corporation, the owner of Fox News, for defamation and is seeking more than $2.7 billion in compensation for a “disinformation campaign” against it. Giuliani and pro-Trump lawyer Sidney Powell are among those named in the complaint.", "AFP debunked numerous other false claims about Dominion and the integrity of the 2020 US elections. The full list of 2020 election fact checks in English is available here.", "Myanmar’s military had quashed dissent and left the country impoverished during decades of misrule until 2011, when the country began moving toward a more democratic government until a February 1 coup. The military justified its intervention by alleging fraud in the November vote.", "Despite claims on social media that widespread voting irregularities were found in Myanmar, election monitors praised the integrity of the election, and the international community has denounced the military’s actions.", "The Carter Center, a US democracy watchdog, had observers on the ground during the elections and stated in a preliminary report that it “found that voters were able to freely express their will at the polls and choose their elected representatives.”", "However, it deplored “deficiencies in the legal framework, including the reserved seats for military appointees.” The country’s constitution reserves a quarter of assembly seats for military delegates, and grants it control of three key ministries.", "Other monitors, from the Asian Network for Free Elections (ANFREL), reported that “while ANFREL observers reported some inconsistencies in the implementation of polling procedures, the integrity of the vote was not affected.”", "Immediately after the vote, observers had expressed concern about cancellation of polls across many ethnic-minority areas -- ostensibly for security reasons -- which left 1.5 million voters disenfranchised and sparked allegations that the playing field had been tilted in favor of Suu Kyi’s National League for Democracy (NLD).", "Even if some results were overturned, however, “the NLD landslide is so large that they wouldn't alter the overall outcome,” Richard Horsey of the International Crisis Group said.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]