["About this rating", "In mid-November, a lengthy bit of viral and repeatedly copied-and-pasted-text spread across various social media platforms and fringe conspiracy websites. The post, whatever platform it finds itself on, is typically titled \"Covid vaccine should be avoided at all cost,\" and is often erroneously described as a message from anti-vaccine crusader Robert F. Kennedy Jr. Following initial publication of this piece, Kennedy provided Snopes with a statement officially disavowing authorship:", "I never made those underlying assertions [in the viral post] and I don’t believe them to be factually accurate. … The article in which they appear pretends to be written by me. The giveaway was me supposedly identifying myself as a physician. Many forums have reposted it and we have been playing whack-a-mole trying to get them to remove it. I am grateful for the chance to officially disavow it here.", "The most viral, and also most dangerous, aspect of this prolific bit of copypasta is the scientifically baseless assertion that mRNA vaccines such as the COVID-19 vaccines produced by Pfizer and Moderna can \"alter\" human DNA:", "COVID Vaccine Should Be Avoided At All Cost", "For the first time in the history of vaccination, the so-called last generation mRNA vaccines intervene directly in the genetic material of the patient and therefore alter the individual genetic material, which represents the genetic manipulation, something that was already forbidden and until then considered criminal.", "This intervention can be compared to genetically manipulated food, which is also highly controversial. Even if the media and politicians currently trivialize the problem and even stupidly call for a new type of vaccine to return to normality, this vaccination is problematic in terms of health, morality and ethics, and also in terms of genetic damage that, unlike the damage caused by previous vaccines, will be irreversible and irreparable. [...]", "The scientific word for this alleged alteration is insertional mutagenesis. Since well before it became famous as a potential COVID-19 vaccine, one of the most frequently touted benefits of this form of vaccine has been its inability to perform such an alteration.", "In this post, we first provide a scientific explanation for why the mRNA vaccines in development (or currently in limited use) are incapable of insertional mutagenesis, and as such do not alter human DNA or damage it in any way. After this, we provide an overview of other claims in the viral post and address myriad red flags it should raise for anyone seriously interested in factual, accurate information.", "The Pfizer vaccine, whose use was endorsed by an FDA expert panel on Dec. 10, 2020, and the Moderna vaccine, which is a leading contender in the race as well, are both known as mRNA vaccines. This pandemic will initiate this class of drugs' first widespread human use. The \"avoided at all cost\" post makes the false assertion that \"mRNA vaccines intervene directly in the genetic material of the patient and therefore alter the individual genetic material, which represents the genetic manipulation.\" This is not how the vaccine works, but to understand why, we first need to review the basics of how cells and the genetic material they contain work.", "A cell contains a nucleus, which is separated from the rest of the cell by a membrane known as the nuclear envelope and several organelles (cellular substructures) floating around in the non-nucleus part of the cell, a region known as the cytoplasm. An organism's primary genetic material is a series of DNA molecules known as chromosomes that are found in the nucleus. The code contained in these chromosomes is what is passed onto new cells when it makes a copy of itself. Because an alteration to nuclear DNA would be passed down as the cell replicates, it is this specific genetic material that would need to be altered for something to constitute a genetic manipulation of human DNA.", "DNA, among other things, gives instructions to the rest of the cell on what proteins to build. To make a long story short, these instructions are sent from the nucleus of the cell in the form of messenger RNA (mRNA), which travels through the cell's cytoplasm into an organelle called the ribosome. You can think of the ribosome as a protein-creating factory, the mRNA as the work order sent to the factory, and the nuclear DNA as a complete catalog of potential things that can be created at the ribosome protein factory.", "The way mRNA vaccines work, to follow this analogy even further, is by sending a mRNA \"work order\" to a cell's ribosome that did not originate from that cell's nucleus but, instead, comes from engineered mRNA that makes its way into a cell's cytoplasm via injection into body tissue. In the case of the two COVID-19 vaccines, the work order being sent to these cells is for the creation of proteins that form the spikes of the SARS-CoV-2 virus. Once cells in the body produce these proteins, their presence trains the immune system to recognize and attack them. As these spikes provide the primary method of entry for SARS-CoV-2 into human cells, training one's body to attack them is the proposed mechanism of immunity imparted by these vaccines.", "But sending mRNA into the cytoplasm of a cell is no minor task, as so-called \"naked\" nucleic acids (both DNA and RNA) rapidly degrade in the human body when not in the safe harbor of a cell. Both Pfizer and Moderna have solved this problem by wrapping their mRNA in a series of lipids that provide two benefits: cell-like protection for its journey and an ability to exchange mRNA across the outer wall of a cell once it reaches its destination. While this delivery method is capable of transferring mRNA into the outer cytoplasm portion of a cell, it is chemically and physically impossible for it to deliver mRNA across the nuclear envelope into the nucleus of a cell.", "In other words, mRNA vaccines bypass entirely the part of the cell apparatus that would need to be modified for anything to be considered human genetic modification. Further, the mRNA injected into the body is incapable of replication — it's a one-time work order, not a contract, to take the metaphor (probably) too far. Because these lipid-protected mRNA molecules are incapable of entering a cell's nucleus, they are incapable of altering human DNA. It's as simple as that.", "Robert F. Kennedy Jr. has been a vocal opponent of vaccination for over a decade, and he has aggressively pushed the discredited link between vaccination and autism. His analysis is frequently flawed and his claims have been debunked on this website several times. But there are clear indications —  including, as Kennedy mentioned in his statement, the assertion that it was written by a physician — that this \"avoided at all cost\" post is a forgery. We are unaware, for example, of any time Kennedy has endorsed the use of bleaching agent chlorine dioxide as a cure for COVID-19 — a dangerous assertion that seems too extreme even for Kennedy, but is prominently mentioned in the post. The assertion that SARS-CoV-2 was created in a lab (it was not) so that it could be used as an “excuse to restrict freedoms, to change the current economic system to a more oppressive / enslaving, scary, blind flock obedience” does not sound like Kennedy writing either.", "Kennedy may well have inspired aspects of the viral copypasta, however. Kennedy, for example, has stated (falsely, as we already showed), that mRNA vaccines \"function by altering DNA expression.\" A paragraph in the viral post that suggests that \"three of the 15 human guinea pigs\" had a severe adverse reaction in a trial of the Moderna vaccine appears to be lifted from a May 2020 post Kennedy authored on the website of his organization Children's Health Defense. That article reported on the results of Moderna's phase I clinical trial. Information sourced from a phase three trial released in November 2020, which included data from over 30,000 participants, tells a more complete picture:", "The safety profile of the Phase 3 study of mRNA-1273 was previously described on November 16. A continuous review of safety data is ongoing and no new serious safety concerns have been identified by the Company. Based on prior analysis, the most common solicited adverse reactions included injection site pain, fatigue, myalgia, arthralgia, headache, and erythema/redness at the injection site. Solicited adverse reactions increased in frequency and severity in the mRNA-1273 group after the second dose.", "Another glaring red flag in the viral post is the invocation of a doctor named Wolfgang Wodarg, an \"experienced doctor\" who is reported to have said that the vaccine (unclear which one) \"should be FORBIDDEN, because it is genetic manipulation.\" Wolfgang Wodarg does have a medical background, but he is more well-known as a German politician. More importantly, he has a dismal track record when it comes to being right about anything that has to do with COVID-19. Back in March 2020, he was one of the leading COVID-19 pandemic denialists, literally arguing that the pandemic did not exist and was just a data classification artifact. Now he makes faulty claims about genetic manipulation stemming from vaccination. He certainly wasn't right in March and he is not right now, either.", "Regardless of who authored this hodgepodge of misinformation, though, it is representative of some of the dangerous and scientifically unbacked talking points being pushed by the anti-vaccine movement presently. Most importantly, its central claim that irreversible genetic manipulation of human DNA is a plausible risk from mRNA vaccines is categorically false. The claim suffers from a profound lack of understanding regarding the actual mechanics of the treatment.", "UPDATE [12 DECEMBER 2020]: Updated to include a statement from Kennedy and to clarify his disavowal of the viral post. As originally published, this article expressed doubt about Robert F. Kennedy Jr.'s authorship, but stated that our request for comment from Kennedy had not been returned.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]