["About this rating", "An anonymous whistleblower complaint has sparked an ongoing impeachment inquiry into U.S. President Donald Trump — along with efforts to unmask that person, the latter prompting condemnation from government-accountability watchdogs.", "The whistleblower complaint alleged that Trump attempted to extort the Ukrainian president by withholding crucial military aid in exchange for the Ukrainians providing dirt on a political opponent. Defenders of the president have attempted to out that person, even though the whistleblower's attorneys released a statement saying those efforts put their client in harm's way and could deter future whistleblowers from coming forward.", "On Nov. 14, 2019, U.S. Rep. Steve King, an Iowa Republican, tweeted a picture of a person who he claimed was the whistleblower. It was not. The tweet was deleted, but not before many people captured screenshots of it, including Joan Donovan, an expert on media manipulation and disinformation campaigns who teaches at Harvard.", "Steve king is tweeting pictures of Alexander Soros. In my class last night we discussed the disinfo tactic of “muddying the waters,” where groups spread lots of lies so that true information is difficult to find. pic.twitter.com/VThQ9K5FYO", "— Joan Donovan, PhD (@BostonJoan) November 14, 2019", "As Donovan's tweet accurately states, the person pictured isn't the whistleblower. It is Alexander Soros, the son of billionaire philanthropist George Soros and who also serves as deputy chairman of Soros' charity Open Society Foundations.", "In a scathing statement, Laura Silber, director of communications at the Foundations, condemned King's actions and also confirmed that the person pictured in his tweet was not the whistleblower:", "Rep. King is circulating false information. The person in the picture is Alex Soros, deputy chairman of the Open Society Foundations. He is not the whistleblower, and any attempt to identify the whistleblower is a violation of protections put in place to help people in government root out waste, fraud and abuse. Rep. King should know better, but as a member of Congress with a long established history of white nationalism, anti-Semitism and Islamophobia—whose behavior is so abhorrent House Republican leaders stripped him of his committee assignments--our expectations of his suddenly showing principles are low.”", "Roughly one year prior to King's tweet, in October 2018, a bomb was placed inside the mailbox at George Soros' home in New York. No one was harmed in the incident, but it followed on a sustained campaign by a number of right-wing figures to smear him with anti-Semitic and racist conspiracy theories. Days later, and inspired by the same conspiracy theories, a gunman massacred 11 people at a Pittsburgh synagogue.", "This is hardly King's first brush with commentary that inspired condemnation. In January 2019, King was stripped of his committee assignments in Congress after, in an interview with the New York Times, he asked, \"White nationalist, white supremacist, Western civilization — how did that language become offensive?\" In August 2019, he was rebuked again for questioning whether there would be any population left if not for rape and incest.", "After his initial tweet containing the picture of Alex Soros was deleted, King posted a second tweet with the image of a different man, which he also claimed was the whistleblower. We are not providing a screenshot or link to that tweet to avoid revealing the person's identity and possibly endangering them.", "Our attempts to reach King's office by phone were unsuccessful.", "Hendrickson, Dan.  \"Congressman Steve King Shares Disputed Images Allegedly Identifying Ukraine Call Whistleblower on Twitter.\"\r\n  WHO TV. 14 November 2019.", "Rashbaum, William K. \"At George Soros’s Home, Pipe Bomb Was Likely Hand-Delivered, Officials Say.\"\r\n  The New York Times. 14 August 2019.", "Wolfe, Jan. \"Explainer: Is It Illegal for Trump or Congress to Name the Impeachment Whistleblower?\"\r\n  Reuters. 7 November 2019.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]