["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Vice President Mike Pence waves after he spoke at a \"Cops for Trump\" campaign event at the police station, Thursday, July 30, 2020, in Greensburg, Pa. (AP Photo/Keith Srakocic)", "The day before he toured a chemical company in southwestern Pennsylvania, Vice President Mike Pence touted the jobs growth that had taken place across the state since President Donald Trump took office.", "As a candidate, Trump vowed to revive manufacturing, and a July 29 email from the Office of the Vice President says:", "\"The Trump administration’s pro-growth policies added over 209,000 jobs, including 16,000 new manufacturing jobs, to Pennsylvania the last three years.\"", "We wondered whether the Trump administration had created as many jobs as it claimed.", "Data from the U.S. Bureau of Labor Statistics shows slow, steady growth in jobs across Pennsylvania since January 2017 when Trump took office. But the growth hasn’t been as robust as Pence made it seem.", "A spokesperson for Pence confirmed his office was talking referring to BLS data in its email.", "There were 6,105,806 jobs in Pennsylvania the month Trump was inaugurated, the data show, compared to 6,249,391 jobs in February of 2020 — just before the coronavirus pandemic sent the economy into a tailspin. That’s an increase of roughly 145,000  jobs, or just over 2%.", "But those gains have evaporated — and then some.", "The number of jobs recorded in June — the most recent month for when data was available when Pence’s office made the statement — shows a net loss of almost 600,000 since Trump took office.", "Pre-pandemic, jobs within Pennsylvania’s manufacturing sector grew at a similar rate, climbing from 561,000 positions in January 2017 to roughly 577,000 by February, an increase of 16,000 jobs — just like Pence said.", "But 20,000 of those manufacturing jobs have disappeared since the virus started to spread. That means overall, manufacturing jobs in Pennsylvania are down almost 4% since Trump took office.", "The pandemic has stifled the economy so thoroughly that it’s no surprise that Pence wants to focus on Trump’s record before the crisis began.", "Earlier this year, when The Inquirer analyzed the health of Pennsylvania’s manufacturing sector, that record looked far weaker than it does today. BLS data at the time showed that after an early surge under Trump, Pennsylvania shed 7,400 manufacturing jobs from October 2018 through the end of 2019.", "How could the data tell such a different story then compared to now?", "It’s because the BLS routinely updates its jobs data as companies report new information on their work forces, and one type of annual update, known as \"benchmarking,\" can cause significant shifts in data at the state and job sector level.", "In this case, the latest data shows that Pennsylvania only lost 1,000 manufacturing jobs between October 2018 and December 2019. The BLS did not respond to questions about what specifically caused the swing.", "Pence said the Trump administration \"added over 209,000 jobs, including 16,000 new manufacturing jobs\" in Pennsylvania.", "It’s true that the number of jobs in Pennsylvania grew between Trump’s inauguration and February of this year. We can’t say who deserves credit for that growth. Regardless, Pence is talking about jobs figures prior to the pandemic. He doesn’t just get to stop the clock in February because it provides a more favorable picture. Using the most recent data, Pennsylvania has 600,000 fewer jobs than when Trump took office; manufacturing jobs are down as well.", "Pence could have clarified his timeframe to provide a more realistic assessment. But he didn’t.", "We rate his claim False.", "U.S. Bureau of Labor Statistics, Pennsylvania labor force seasonally adjusted, accessed Aug. 13, 2020", "U.S. Bureau of Labor Statistics, Pennsylvania manufacturing jobs seasonally adjusted, accessed Aug. 13, 2020", "The Philadelphia Inquirer, \"Trump promised to bring back manufacturing in Pennsylvania. He didn’t. Will it cost him?,\" March 10, 2020", "U.S. Bureau of Labor Statistics, \"Revisions in State Establishment-based Employment Estimates Effective January 2020,\" January 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]