["The 45-second video was published here on Facebook on February 24, 2020.", "It shows two men on a fire truck spraying water on the white marble structure.", "Below is a screenshot of the misleading post:", "The post’s Hindi-language caption translates to English as: “When Taj Mahal was washed for Trump. Taj Mahal and Mahatma Gandhi are similar, they get abused by Modi and also loved by Modi for his own greed.”", "US President Donald Trump visited the Taj Mahal with First Lady Melania during his two-day visit to India on February 23, 2020. The 17th century monument in Agra houses the tombs of emperor Shah Jahan and his wife Mumtaz Mahal of the Mughal dynasty and is listed as one of the New Seven Wonders of the World. Here is an AFP report on the state visit.", "Trump also visited Sabarmati Ashram, the house of Indian independence leader Mahatma Gandhi as part of his visit.", "The same video was also shared here and here on Facebook, and here and here on Twitter with a similar claim.", "The claim is false; the video actually shows a replica of the Taj Mahal at People’s World amusement park in Bhopal, a city in the central Indian state of Madhya Pradesh.", "The fire truck that appears in the first 30-seconds of the video bears the letters SJPN on its body. This is an acronym for Sarvajanik Jankalyan Parmarthik Nyas, a charitable organisation and non-profit public trust in India.", "IH Siddiqui, spokesperson for SJPN and a project director at the amusement park, told AFP by phone on February 28, 2020 that the video in the misleading posts showed the park.", "He said: “The fire brigade vehicle belongs to our organisation and the amusement park is also owned by the same body.”", "Further examination of the video also showed structural designs distinctive only to the replica and not the real Taj Mahal.", "Unlike the original, the water canal of the replica at the amusement park is lined with statues of dolphins.", "Below is a screenshot of the dolphins seen at the 33-second mark of the video:", "Below is a screenshot comparison of a photo of the replica Taj Mahal, uploaded on the official Facebook page of the amusement park (L) and an AFP photo of the Taj Mahal (R):", "The replica in the Bhopal amusement park is also missing the red sandstone wall that surrounds the original monument.", "Below is a screenshot comparison of the replica in the video of the misleading post (L) and the original Taj Mahal in Agra (R) :", "Ahead of US President Trump’s first official visit to India, the tombs at the Taj Mahal were given a “mud-pack treatment”. Here is an AFP report on India’s clean-up operation.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]