["About this rating", "Nestlé sought permission from the state of Michigan to double the amount of groundwater they pump at a plant in Evart.", "The proposal bore no obvious link to Flint.", "Whether the state of Michigan will approve Nestlé's proposal.", "In November 2016, petition site SumofUs.org published a document claiming that the state of Michigan was planning to sell 100 million gallons of water to Nestlé for just $200 a year:", "Residents are furious -- as is anybody who values water as a shared resource. How can Michigan -- which is still dealing with the fallout of its own mismanagement of its watershed -- consider giving even more water to a foreign corporation with an annual profit in the billions?", "The answer from Michigan’s government is 20 jobs. Yes, that’s right -- 20 jobs in return for over 100 million gallons a year of nearly free groundwater.", "The petition cited two articles: A Michigan Live piece published on 3 November 2016 and an article by the Guardian from 5 November 2016, which reported:", "Michigan regulators were deluged with angry comments this week, after reports that the state had drafted a permit approval for Nestlé to nearly double the amount of groundwater it pumps from a plant in Evart, Michigan to 210m gallons a year.", "The pumping increase is only expected to cost the Swiss food giant $200 a year, and possibly the price of a permit fee, because its bottling plant in Evart is considered a private well under state law, regulators said.", "In a statement, Nestlé touted the move as a boon to the state because it is created “some 20 new jobs”. The company is valued at $219bn.", "That article mentioned Flint as a problem that paralleled Evart's, not one that was directly related. Regardless of what happened in Evart, Flint residents still remained without clean and safe drinking water, a circumstance that is close by, but unrelated to the Evart plant's activities:", "The Nestlé plant at Evart is just 120 miles from Flint, where a recent move by public officials to save money by switching water sources caused lead to contaminate the city’s water.", "Flint’s water is still not safe to drink without a filter and health have officials said bacterial illnesses are on the rise because residents fear bathing. Flint’s mayor is still lobbying Congress for cash to fix the city’s pipes ... The lawyer who represented plaintiffs in that case, Jim Olson, criticized regulators for not giving the public more notice of the new proposal.", "“We’ve seen an erosion of public notices and more internal official decisions,” Olson said. “That’s at the heart of the Flint water crisis, and now we have the same kind of institutionalized expediency here.”", "As of 22 November 2016, no decision had formally been reached:", "Michigan Citizens for Water Conservation sued Nestlé in 2001 over the potential damage to lakes, rivers and streams that its bottled water plant's groundwater withdrawals would cause. After years of court battles, the two sides reached a settlement agreement in 2009, reducing Nestlé's siphoning to 218 gallons per minute from 400, with additional restrictions on spring and summer withdrawals. The litigation cost the nonprofit more than $1 million, which was covered by supporters.", "Now, the proposed permit from the DEQ would take the bottled-water plant's groundwater withdrawals back up to the level that prompted the lawsuit, though the suit involved four other, Nestlé-owned wells nearby in Mecosta County, where water withdrawals remain at 218 gallons per minute on average.", "SumofUs's petition implied that Nestlé's proposed increase was a done deal, when in actuality the public comment period remained open well after the petition appeared. The inclusion of Flint's ongoing water crisis was also misleading, as the problems in Flint cannot be resolved by approving or denying plans to expand the Evart plant.", "Previous efforts by SumofUs included petitions claiming developers planned to put a mall in the Grand Canyon and that Starbucks colluded with Monsanto to sue Vermont over labeling of genetically modified organisms.", "Ellison, Garrett.   \"DEQ Extends Comment Window, Plans Hearing on Nestle Groundwater Plan.\"\r\n    Michigan Live.   3 November 2016.", "Glenza, Jessica.   \"Michigan Residents Deplore Plan to Let Nestlé Pump Water for Next to Nothing.\"\r\n    The Guardian.   5 November 2016.", "Kennedy, Merrit.   \"Lead-Laced Water in Flint: A Step-By-Step Look at the Makings of a Crisis.\"\r\n    NPR.   20 April 2016.", "Matheny, Keith and Paul Egan.   \"Nestlé Bottled-Water Company Seeks to Take More Michigan Water.\"\r\n    Detroit Free Press.   22 November 2016.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]