["The 30-second video was published here on Facebook on November 30, 2019. It has been viewed more than 180,000 times.", "The video’s Hindi-language caption translates to English as: “This is the first step of the Shiv Sena government in Maharashtra as the police congratulated Muslims by handing prayer beads after Friday prayers. This video is getting viral very quickly.”", "Shiv Sena is a prominent political party in Maharashtra. The party won a majority in the state’s legislature in October and Shiv Sena’s leader, Uddhav Thackeray, was sworn in as Maharashtra chief minister on November 28. AFP documented the ceremony here.", "Below is a screenshot of the video in the misleading post:", "The video was also published with a similar claim here on Facebook where it has also been viewed more than 180,000 times.", "The video was also shared on Facebook here and here, and on YouTube here and here with a similar claim.", "The claim is misleading; a senior police officer told AFP the police in the video were not following any directive from the new state government and that the event was held for National Integration Week -- also known as Qaumi Ekta Week -- which is organised annually by the central government.", "“The event took place outside Kausa mosque in Mumbra was part of the central government’s programme ‘Qaumi Ekta Week’ and it was not done on orders of the state government. This is totally false,” GM Mujawar, a senior officer at the Mumbra police station, told AFP by phone on December 9.", "Mumbra is a neighborhood in Thane, a city just north of Mumbai. The Kausa mosque is situated here on Google Maps.", "Mujawar also said the event took place on November 29, the first Friday after Thackeray took office.", "AFP also spoke to Officer Vinayak Karade, one of the policemen distributing prayer beads, by phone on December 9.", "“Our police station did that as part of Qaumi Ekta Week,” Karade confirmed. “Last Friday (November 22, 2019), we distributed roses and on November 29, 2019, we distributed prayer beads. This promotes integrity and harmony.”", "Karade added that it is unfortunate that the video was shared with the misleading claim.", "National Integration Week is organised every year and is intended to “foster and reinforce the spirit of communal harmony,” the central government’s official press release stated here. Official announcements on the celebratory week over the past decade can be seen here: 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018.", "National Integration Week was also celebrated by other police departments in Maharashtra. Thane police’s verified Twitter account shared images from another celebratory event here on November 25.", "The video in the misleading posts was published here on a Hindi news Facebook page on November 29, one day before the misleading claim was made.", "The video’s caption reads: “Mumbra Police distributing Tazbih at Kausa Masjid after Namaz-e-Jumma.” It makes no mention of the new Maharashtra government.", "Tazbih, or Tasbih, are Islamic prayer beads and Namaz-e-Jumma refers to Friday prayers offered by Muslims.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]