["The one-minute and eight-second video was shared on Facebook here on August 24, 2020.", "A post’s caption reads: “Ganpati Bappa in Galwan Valley Ladakh. Indian soldier celebrating Ganapati ji festival in Ladakh.", "Ganesh Chaturthi is a 10-day festival that marks the birth of Ganpati, a Hindu deity also known as Ganesha.", "The Galwan Valley is an area in the Indian-administered Ladakh region, which borders China and experienced deadly clashes in July 2020 between troops from the two countries, as AFP reported here.", "The video was also shared alongside the same claim on Facebook here, here, here and here; and on Twitter here, here, here and here.", "The claim is misleading.", "An analysis of the footage revealed that “Shingo River Valley” is written on a structure seen in the background of the beginning of the video. Below is screenshot with the text highlighted in red:", "The Shingo River Valley is situated at least 230 kilometers west of the Galwan Valley, as seen here on Google Maps. The area is situated along disputed regions of India's de-facto border with Pakistan and is also heavily fortified with Indian troops.", "A longer version of the video was also published on YouTube here on September 17, 2019. The post’s caption reads: “Ganesh pooja procession of INDIAN ARMY at SHINGO RIVER VALLEY”.", "On September 18, 2019, a clip from the video was also shared on Facebook here and here in posts that identify the location as the Shingo River Valley.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]