["Rahul Gandhi and China: Addiction, obsession or something else? This is the title of a video that has been posted by the official Twitter account of the Bharatiya Janata Party (BJP) on August 31, 2018.", "The video mocks Rahul Gandhi and begins with what appear to be the words of a news anchor who is heard saying, “Rahul Gandhi along with Robert Vadra and Priyanka Vadra met the Chinese envoy, they called it a meeting during a Chinese food festival. And now, six months after that, Rahul Gandhi has met a delegation of the Communist party of China. Again, pictures on your screens, BJP has questioned Rahul’s meeting with the Chinese delegation. They are asking did Rahul Gandhi keep the Ministry of External Affairs in the loop? Anand Sharma can also be seen in the pictues over there…”", "Rahul Gandhi and China : Addiction, obsession or something else? pic.twitter.com/tXDe2i8Ch2", "— BJP (@BJP4India) August 31, 2018", "The first image that has been used in the video shows the Congress president along with Robert Vadra and Priyanka Vadra posing for a photograph with the Chinese ambassador to India. The photograph has been posted below.", "In the past, the same photograph had been used to insinuate that Rahul Gandhi had secretly met the Chinese envoy at a time when Indian and Chinese troops were locked in a tense stand-off at Doklam in 2017.", "Alt News had earlier reported that in July 2017, Republic TV and Times Now had used the same image to target the Congress president, claiming that the photograph was ‘undated’ and ‘unverified’.", "It only took a reverse image search to establish the veracity of the photograph. The image tweeted by the two channels was neither unverified nor undated and has been available on Internet since April 21st, 2017 on the Chinese Embassy website.", "Rahul Gandhi, Priyanka Vadra and Robert Vadra had attended a Chinese food festival. The same food festival was attended by Union Minister Suresh Prabhu, Sitaram Yechuri from CPIM, KC Tyagi from JDU and other leaders from BJP such as Tarun Vijay and Udit Raj.", "Source: Website of Embassy of PRC in India", "Now, a photograph of the same public event featuring Rahul Gandhi has been used by the BJP to accuse the Congress president of pursuing a clandestine relationship with China, at a time when Gandhi has embarked on a yatra to Kailash Mansarovar. It is not a surprising development as political campaigns on social media have the propensity to relay misinformation despite the fact that it may already have been debunked.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]