["About this rating", "In January 2018, Infowars editor-at-large Paul Joseph Watson — who in the past, has pushed numerous (and often racially-flavored and already debunked) conspiracy theories about false flags, purported cover-ups, and \"snowflakes\" — apparently had his sensibilities offended by a \"feminist\" web site, tweeting:", "Masturbation is “telepathic rape”.", "Feminism in 2018.", "The post was accompanied by a picture showing a separate article with one sentence highlighted:", "When a man masturbates to a woman he know [sic] in real life without her consent, that is telepathic rape.", "While the excerpt is real, it is not part of a legitimate publication. It was actually published by a \"satirical\" web site called Medusa Magazine in June 2017:", "Without porn to look at, more men will just masturbate to fantasies they create in their mind of women they know in real life. This is even worse than just jacking it to porn. Sex workers are aware that their image will be sexualized and accept that but when a man masturbates to a woman he know in real life without her consent, that is telepathic rape. It’s sick. It even affects the victim although she may be unaware but it lowers her energy.", "Medusa, which bills itself as a spoof of the \"Feminist left,\" announced in November 2017 that it would stop producing new articles. A person identifying as the site's owner claims that their satire was too effective among the right wing, as various sites had picked up Medusa articles and run them while apparently under the impression that the site actually was written by \"social justice warriors\" (and demonstrably not bothering to do the barest of legwork to find out for themselves more about the articles or their purported authors):", "Since starting the blog, our articles have been featured on several media publications like Info-wars, The Federalist, The Gateway Pundit, and several other websites that fell for our prank, including one Russian website that covered our article calling for “White abortions“, as proof of how politically correct the west has become.", "They also argued that Medusa was always intended to be satirical, citing a May 2017 Facebook post on their other site, Age of Shitlords. The post is no longer publicly available but can be accessed via online archives:", "One of these days, I'm going to start a Feminist website. I'll get a couple of Shitlords together, and we'll write tons of satirical articles, but from a Feminist perspective, to make the site look more believable. It will be the ultimate Social Experiment.", "Harding, Kate. \"I'm a Feminist. I Study Rape Culture. And I Don't Want Al Franken to Resign.\"\r\nWashington Post. 17 November 2017.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]