["About this rating", "In March 2014, the now-defunct Newshound web site published an article positing that a woman named Gemma Sheridan, who was lost in a storm in 2007 and had spent seven years on a deserted island, was finally rescued when the SOS sign she made on a beach was picked up by and spotted in images captured by Google Earth:", "My hope was that perhaps a plane might fly over and see [my SOS sign], but in all my time on the island, I had not seen 1 single plane fly over. I didn't give up though. Fast forward a couple more years:", "I woke up 1 morning to the sound of a plane flying over me which was unusually low, I could not believe it, I thought it was a dream. I ran to the beach screaming and waving my arms like a lunatic, the plane flew over 2 or 3 more times and then dropped a small package.", "Inside was a radio, fresh water, food and a small medical kit. I switched on the radio and heard the first human voice for years. We talked for what seemed like an eternity, then I asked the voice on the other end \"How did you find me\" to which they replied \"Some kid from Minnesota found your SOS sign on Google Earth\" I didnt even know what Google Earth was, but I'm eternally in their debt now.", "The story was easily spotted as nothing more than fake news, however, for a variety of reasons:\n\n The NewsHound web site was not a news site at all, and in place of news it reproduced a number of other hoaxes and spoofs as if they were in fact real news, such as long-debunked stories about a Chinese man suing his wife over giving birth to an ugly baby, Apple paying Microsoft [sic] a $1 billion debt all in nickels, and a planetary alignment causing gravity on Earth to be negated for five minutes.", "The Newshound article's photograph of the SOS message supposedly created on a beach  by the stranded woman was actually a cropped and enlarged version of a picture published by Amnesty International back in 2010 to accompany an article about destructive violence in southern Kyrgyzstan and was clearly (in its original context) not snapped on a deserted island:", "Additionally, portions of text from the Newshound story were lifted directly from a 2013 Daily Mail article about Ed Stafford, an Amazon explorer who survived by himself for 60 days on a remote island in the Pacific after volunteering to do so for a television documentary.", "Compare the following two passages, the first from the 2013 Daily Mail article and the second from the 2014 Newshound article:", "It was something I was thinking about as I nibbled away at the bark of a tree with a giant clam shell for 11 days just to build a shelter. It might have been bomb-proof and waterproof in the end and it's probably still standing but if I'd had a machete, just that one tool, I would have been able to build it in a few hours.", "It was two weeks before I managed to light a fire — you'll be able to tell how happy that made me when you see the show.", "There were eight feral goats on the island, four adults and four kids. I saw them on day one and they seemed to taunt me by coming so close I could almost touch them. I made a bow and arrow.", "In films, the arrow leaves the bow at high velocity and brings down an animal in full flight but this just went twang and fell on the floor. And my spear wasn't sharp enough.", "For the first 2 weeks I stayed in a mock shelter i made from debris that washed ashore. I needed to find real shelter, I found a large tree that looked perfect. I nibbled away at the bark of a tree with a giant clam shell for 11 days just to build a shelter. It might have been bomb-proof and waterproof in the end and it's probably still standing but if I'd had a machete, just that one tool, I would have been able to build it in a few hours.", "It was four weeks before I managed to light a fire — you have no idea how happy that made me.", "There were eight feral goats on the island, four adults and four kids. I saw them on day one and they seemed to taunt me by coming so close I could almost touch them.", "I made a bow and arrow, but this just went twang and fell on the floor. And my spear wasn't sharp enough.", "In August 2015 Linkbeef republished this story, simply changing a few of the details, such as switching the gender of the rescued castaway from female (Gemma Sheridan) to male (Adam Jones) and altering the length of the strandedness from seven to nine years.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]