["About this rating", "A world record of any sort normally gains substantial traditional news coverage. But since 2016, fringe health sites have exploited the stereotype of \"mainstream media\" exclusion in spreading a story about a purportedly remarkable medical achievement.", "At some point in 2016, a photograph of a woman identified as \"Ava Roberts\" surfaced online, along with text celebrating her allegedly having become \"the youngest female African-American doctor\":", "Healthy Living Life Facts\" republished the Ava Roberts article in its entirety in December 2017, and that account was spread widely on social media platforms such as Facebook and Twitter.", "A number of websites that originally published this claim, as \"Healthy Living Life Facts\" did in June 2016, cited a French site called \"Pelea\" as its source:", "While word of this accomplishment has regrettably been minimal, French site Pelea reports that “after a gifted childhood, Roberts quickly excelled through medical school and became a force to be reckoned with as the youngest African-American female doctor.” Such an amazing young age, considering how long doctors go to school?! Must have been a child prodigy! You go girl! Such a great role model to young women everywhere! for being the youngest African-American female doctor. Youngest female african american doctor.", "None of those sites actually linked to the referenced \"Pelea\" website, or to any other external source that documented or provided additional information about the claim.  Nor did any of those sites provide any details of Ava Roberts' life and supposed achievements, such as when and where she was born, when and where she attended medical school, what area of medicine she entered into, or where she currently practices.", "Moreover, the original claim was quite ambiguous to begin with: Was Ava Roberts supposedly \"the youngest female African-American doctor\" in the world, in a particular country, or in some smaller jurisdiction?   What standard was applied to use of the title \"doctor\"?  What organization certified or verified this accomplishment?", "Using various search tools we were able to locate only one doctor by the name of Ava Roberts who is currently practicing in the United States. She is an orthopedic surgeon in Colorado, but a spokesperson for the UCHealth system, which manages several hospitals in the state as well as parts of Wyoming and Nebraska, told us that she is not the unidentified person whose photograph has accompanied this story.", "We do note that it is not impossible for someone under the age of 25 to be a certified medical professional. In 2013, the medical news site The DO profiled several doctors in that age range, and the current Guinness Book of World Records holder for becoming a doctor at the youngest age ever is held by Balamurali Ambati, who graduated from Mount Sinai School of Medicine in 1995 at the age of 17.", "Healthy Living Life Facts.   \"At Only 23, Ava Roberts Becomes Youngest African-American Female Doctor!\"\r\n    26 June 2016.", "Healthy Living Life Facts.   \"Dr Ava Roberts: Youngest African-American Female Doctor in the World.\"\r\n    18 December 2017.", "Raymond, Rose.   \"Young Blood: What's It Like to Become a Physician at Age 22?\"\r\n    The DO.   7 June 2013.", "Reuters.   \"Crowd Says 'Ahh!' As 17-Year-Old Gets M.D. Diploma.\"\r\n    Accessed via latimes.com on 22 January 2019.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]