["By Saranac Hale Spencer", "Posted on April 26, 2019", "A Facebook meme incorrectly blames the measles outbreak in the U.S. on immigrants from South America. The virus, however, was eliminated there in 2016. The recent uptick in measles cases is due to travelers returning from countries with outbreaks.", "The outbreak of measles in the U.S. and around the world is due largely to inadequate vaccination rates in some communities, not illegal immigration, as one popular meme on Facebook claims.", "The meme shows a picture of a baby who appears to be infected with measles and says: “Thanks to a highly effective vaccination program the Measles virus was eliminated from the U.S. in 2000. Thanks to the immigrants who illegally cross the U.S. Mexican border, and the Democrats who refuse to stop them, the Measles virus has been declared a public health emergency in 2019.”", "The first part of that claim is correct. Measles was eliminated in the United States in 2000 and it was eliminated across both North and South America in 2016.", "Elimination means cases can still occur, but the disease isn’t being continuously spread for a year or more in a specific area.", "The second part of the claim, however, is incorrect.", "The virus has been brought into the U.S. by people who have traveled to places where there is an outbreak or where the disease is still common, such as parts of Europe, Africa, Asia, and the Pacific, according to the Centers for Disease Control and Prevention. From those travelers, the disease can then spread in U.S. communities that have unvaccinated people, according to the CDC.", "For example, the New York City health department declared a public health emergency on April 9. That measles outbreak, which started in 2018 and spread in the Orthodox Jewish community, was brought on by travelers who had been in Israel, where a large outbreak is occurring, according to the Pan American Health Organization.", "This year marks the largest number of measles cases since the disease was eliminated in the U.S., according to the CDC, which issued a statement in April identifying misinformation about vaccines as a “significant factor” contributing to the outbreak. Similarly, the executive director of UNICEF and the director general of the World Health Organization issued a joint statement calling measles “the canary in the coalmine of vaccine preventable illnesses.” They, too, cited online misinformation about vaccine safety as a contributing factor in the rising number of measles cases in high and middle income countries.", "Over the years we’ve written several stories about various false and misleading claims made about vaccines — claims that were either made by public figures or spread over the internet.", "Some major social platforms have recently taken steps to curb the spread of misinformation about vaccines. Facebook announced in March that it would reduce the visibility of vaccine misinformation and YouTube said in February that it would prevent users who promote vaccine misinformation from running ads.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on the social media network. Our previous stories can be found here.", "United Nations. “‘A global measles crisis’ is well underway, UN agency chiefs warn.” 15 Apr 2019.", "“Over 20 million children worldwide missed out on measles vaccine annually in past 8 years, creating a pathway to current global outbreaks – UNICEF.” Press release. UNICEF. 24 Apr 2019.", "“Region of the Americas is declared free of measles.” Press release. Pan American Health Organization. 27 Sep 2016.", "“De Blasio Administration’s Health Department Declares Public Health Emergency Due to Measles Crisis.” Press release. City of New York. 9 Apr 2019.", "Epidemiological Update Measles. Pan American Health Organization. 18 Apr 2019.", "CDC Media Statement: Measles cases in the U.S. are highest since measles was eliminated in 2000. Centers for Disease Control and Prevention. 24 Apr 2019.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]