["By Saranac Hale Spencer", "Posted on July 30, 2019", "A photo circulating on social media claims to show “Europeans trying to get to North Africa during World War II,” but it actually shows Albanian refugees arriving in Italy in 1991.", "A photo of a boat teeming with refugees has been doctored and mislabeled on Facebook to make it appear it was taken during World War II.", "The caption with the picture says: “These aren’t Syrians. They’re Europeans trying to get to North Africa during World War II. So next time you think of closing the borders you might want to check with your grandparents.”", "It’s true that the picture doesn’t show Syrians, but the rest of the claim is false.", "The picture is from Aug. 8, 1991, when 10,000 Albanians forced their way into the Italian port of Bari. They were among the hundreds of thousands who fled Albania starting in 1990, when the fall of communism left poor economic conditions in the country. Most of those who were on the boat in the picture were later sent back to Albania, according to a 1992 report from the Parliamentary Assembly of the Council of Europe.", "Original photos taken at the port of Bari were in color, but the photo used on Facebook was changed to black and white.", "The false claim attached to the picture has been circulating since at least 2015, but it has had renewed interest in recent weeks as funding for President Donald Trump’s promised border wall has been in the news.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "Anticoli/Micozzi. Photo. Getty Images. 8 Aug 1991.", "Turi, Luca. Photo. AP Images. 8 Aug 1991.", "Böhm, Wilfred. Report — Exodus of Albanian nationals. Parliamentary Assembly Council of Europe. 27 Jan 1992.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]