["Congress has not approved any tax bills under Biden for him to sign, and Biden has not taken any executive action.", "As a candidate, Biden proposed raising capital gains tax rates for people with higher incomes and changing the estate tax to raise rates and broaden its reach.", "The 117th Congress has been focused on the second impeachment of former President Donald Trump and a COVID-19 relief package. It hasn’t yet approved any tax bills for President Joe Biden to sign.", "Yet a post widely shared on Facebook stated: \"Biden signs 45% Capital gains tax. Kiss your inheritance goodbye.\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The claim raises issues related to two different taxes that Biden has proposed changing: the capital gains tax, which is applied to the profits from sales of assets such as stocks; and the estate tax, which is applied to assets after their owner dies and can reduce the size of an inheritance.", "But the proposed changes haven’t been enacted.", "\"These are just campaign proposals. Nothing's been passed, nothing’s been signed,\" said Robert McClelland, a senior fellow with the Tax Policy Center.", "A capital gain is the difference between what someone paid for an asset, also known as the \"basis,\" and what they sold it for. The tax rates for capital gains vary based on income and how long the asset was owned. Rates are more favorable for assets that are held for more than a year, and some gains on home sales are exempt from taxes.", "In the presidential campaign, Biden proposed raising the top long-term capital gains rate to 39.6% from 20%.", "This increase would apply only to people earning more than $1 million per year.", "When it comes to inheritances, the vast majority of estates do not pay the estate tax; it kicks in only for larger estates.", "The current 40% estate tax rate applies only to individual estates larger than $11.58 million, and only to the assets above that amount (the threshold is $23.16 million for married couples). That is, the first $11.58 million of an estate is exempt from federal estate taxes.", "The exemption is that high largely because the 2017 Tax Cuts and Jobs Act doubled the exemption in 2018 and indexed it to inflation after 2018. However, that provision is set to expire in 2025. After that, the exemption would revert to $5 million, unless the law is changed.", "Candidate Biden proposed raising the rate to 45% and reducing the exemption to $3.5 million. So, the change would affect more estates and subject them to higher taxes.", "Based on the estimated 2.81 million people who will die in 2022, about 2,600 estates, or 0.09%, would be taxable under current law, the Tax Policy Center estimates. If the exemption were reduced to $3.5 million, about 16,600 estates, or 0.59%, would be taxable.", "Biden also proposed another change that’s related to both capital gains and inheritances. It involves a current tax policy called \"stepped-up basis.\"", "Stepped-up basis provides a big benefit to those who inherit certain assets, including real estate, that has appreciated in value over time. It resets the cost basis for an asset to its fair-market value when the owner died.", "So under stepped-up basis, a person who inherits an asset and then sells it for a profit has to pay a capital gains tax on its gains in value only from the date of the estate owner’s death, rather than from the time it was originally purchased.", "Biden proposed eliminating stepped-up basis, so that the tax would apply on the asset’s full gain in value since purchase. It’s possible any proposal might apply only to those making $400,000, in keeping with his pledge not to raise taxes on people making less than that.", "A widely shared Facebook post stated: \"Biden signs 45% capital gains tax. Kiss your inheritance goodbye.\"", "Biden has proposed changes that would increase capital gains and estate tax rates, and expand the reach of both taxes.", "But Congress has not passed any of those changes, and thus no such bill has been signed by Biden.", "We rate the statement False.", "Facebook post, Feb. 1, 2021", "PolitiFact, \"Biden’s tax plan would not impose 40% capital gains tax on most home sales,\" Oct. 16, 2020", "PolitiFact, \"Yes, Biden seeks to eliminate policy that reduces inheritance taxes,\" Oct. 29, 2020", "Reuters, \"Fact check: Biden will only tax capital gains at 40% for those earning over $1 million annually,\" Oct. 14, 2020", "Kiplinger, \"Estate Tax Exemption Amount Goes Up for 2021,\" Oct. 27, 2020", "Internal Revenue Service, \"Estate and Gift Tax FAQs,\" June 5, 2020", "The Balance, \"How the Federal Estate Tax Exemption Changed From 1997 to Today,\" Nov. 2, 2020", "Associated Press, \"False claims about Biden’s tax plan spread online,\" Oct. 13, 2020", "Tax Foundation, \"Joe Biden’s 67 Percent Tax on Wealth,\" Oct. 28, 2020", "Tax Foundation, \"Unpacking Biden’s Tax Plan for Capital Gains,\" July 31, 2019", "Email, Erica York, economist with Tax Foundation’s Center for Federal Tax Policy, Feb. 16, 2021", "Snopes, \"Did Biden Vow To Eliminate the ‘Stepped-Up’ Basis for Capital Gains Tax?\", Feb. 3, 2021", "AFP Fact Check, \"Biden’s 40% tax rate on home sales only applies to $1 million annual earners,\" Oct. 21, 2020", "Interview, Tax Policy Center senior fellow Robert McClelland, Feb. 15, 2021", "Tax Policy Center, \"An Updated Analysis of Former Vice President Biden's Tax Proposals,\" Nov. 20, 2020", "Tax Policy Center, \"T20-0258 - Estate Tax Returns and Liability Under Current Law and Certain Other Laws, 2021-2030,\" Dec. 9, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]