["A March 15 Facebook post questions federal travel requirements between Mexico and the United States.", "\"If Mexico requires a passport for entry from the US, why doesn't the US require a passport entry from Mexico?\" the meme states. The post has been shared over 600 times.", "The poster did not respond to a request for comment from USA TODAY.", "Federal agencies in each country categorize entry requirements according to eligibility. Regardless, a valid passport is mandated for the majority of travelers.", "A passport is required for travel across the U.S.-Mexico order \"in most cases,\" according to the U.S. Embassy & Consulates in Mexico.", "Mexican nationals must present a valid passport and visa to enter the United States by land or sea, per U.S. Customs and Border Protection.", "\"You still need something to prove your citizenship,\" Rhonda Lawson, public affairs specialist for the CBP, told USA TODAY. \"A person who goes to Mexico for whatever reason can travel on their passport or an enhanced ID card or if they're part of a Trusted Traveler program, they can use their NEXUS card or SENTRI card.\" Other acceptable forms of documentation are listed on the CBPs website, Lawson said.", "NEXUS and SENTRI cards may be used for land or sea travel; a valid passport or NEXUS card is required for air travel between the U.S. and Mexico, according to the State Department.", "The NEXUS card is available only to U.S. and Canadian citizens and permanent residents and Mexican nationals who meet certain conditions, per the CBP.", "Secure Electronic Network for Travelers Rapid Inspection, or SENTRI, is a program feature of the Trusted Traveler program for low risk U.S. citizens, permanent residents and foreign nationals entering the U.S. on land, according to the CBP and the Department of Homeland Security.", "U.S. citizens traveling on maritime business may present a Merchant Mariner Document.", "Travelers entering Mexico by land with intent to travel outside the immediate border must have an entry permit, which requires a valid passport, according to the State Department.", "Border community residents who frequently travel between the U.S. and Mexico by car may also access a special passport card. A Border Crossing Card is similar to an entry permit for Mexican nationals. The card allows travelers to go 55 miles inland from the border and — combined with a valid passport — grants Mexican citizens access to the U.S. from land, air and sea, according to the CBP.", "The Enhanced Driver's License is another alternative for U.S. citizens to traveling by land or sea to Mexico, Canada or the Caribbean, according to DHS. These licenses are issued through a secure process.", "We rate this claim PARTLY FALSE, based on our research. A Facebook post that claims the U.S. does not require a passport for entry from Mexico is inaccurate. A valid passport is required to enter either country in most cases. It is true there are special allowances for U.S. citizens living along the southern border, people traveling on maritime business and residents of either country who meet certain eligibility requirements to travel without a passport. But proof of citizenship is required.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook."]