["Income inequality is the core issue of Bernie Sanders’ presidential campaign, and he said it may also be why he’s behind Hillary Clinton in the Democratic primary.", "Meet the Press host Chuck Todd asked Sanders why he thought 16 of 17 states with large wealth gaps were won by Clinton.", "\"Well, because poor people don’t vote. I mean, that’s just a fact,\" Sanders said. \"That’s a sad reality of American society. And that’s why we have to transform one, as you know, one of the lowest voter turnouts of any major society of Earth. We have done a good job of bringing young people. But in America today, the last election in 2014, 80 percent of poor people did not vote.\"", "Is turnout among the poor really that low? The data shows that we’ve done slightly better at getting out the vote among low-income people than what Sanders suggests, but not by much.", "Sanders’ policy director Warren Gunnels pointed us to a report by the left-leaning policy and advocacy group Demos, which used data from the Census Bureau.", "\"According to Demos, only one in four of those earning less than $10,000 voted in 2014,\" Gunnels said. \"Even worse, the turnout was just 12 percent among 18- to 24-year-olds earning less than $30,000.\"", "In other words, roughly 75 percent of people in the lowest income bracket didn’t vote in the last midterm elections.", "However, there’s one catch to this figure. While an annual income of less than $10,000 is undoubtedly \"poor,\" the poverty threshold in 2014 also includes family incomes above $10,000.", "Sean McElwee, a policy analyst with Demos who authored the report, told us to look at annual incomes under $30,000 instead. The turnout rate for that group was 31.5 percent, which means 68.5 percent of poor people didn’t vote in 2014, about 10 percentage points less than what Sanders said.", "\"Sanders is indeed correct to highlight low turnout among the poor as an important factor that biases policy in favor of the wealthy,\" McElwee said.", "As PolitiFact has reported, census data may overstate the turnout rates, as it’s based on self-reporting. So it’s possible that Sanders’ 80 percent figure is closer to actual rates than what the survey shows, but this is speculative.", "Sanders is more on target if we look at a definition of \"poor\" that is not based on income.", "A 2015 Pew Center survey looked at the politics of financial security, which analysts defined as having a credit card, a savings or checking account, and a retirement or investment plan; not needing to borrow money; not falling behind on bills, rent or mortgage payments; and not receiving food assistance or Medicaid benefits.", "The survey found that just 20 percent of the least financially secure were \"likely voters\" in 2014 compared to 69 percent of the most financially secure.", "Turnout always drops in midterm elections, when the White House isn’t at stake, and overall turnout in 2014 was the worst it had been in 72 years. Nonetheless, census data shows turnout is consistently lower among the poor than other income groups:", "So why are the poor less likely to vote? The reasons are interconnected, if not unsurprising.", "For one, the political process sets hurdles for the poor. Registration barriers are key, said McElwee of Demos, pointing to census data that shows that low-income people are far less likely to be registered voters.", "Voter ID laws, for example, impose costs that people struggling to make ends meet can’t really afford. The Government Accountability Office reported in 2014 that a driver’s license can cost between $5 to $58.50 in states with voter ID laws. And nearly 500,000 eligible voters don’t have convenient access to an ID-issuing office, according to a 2012 study by New York University.", "The poor also make up 55 percent of people who can’t vote (which include felons and immigrants as well as residents of Washington D.C., and U.S. territories), according to a 2013 Harvard University working paper.", "\"This means that they can't vote but also they won't be mobilized by parties, who base their mobilization off of voter files,\" McElwee said.", "Being poor also means you cannot afford to devote time to the political process.", "The Pew study found that just 26 percent of the least financially secure knew which party controlled Congress compared to 62 percent of the most affluent. Similarly, compared to affluent non-voters, low-income non-voters were more likely to list disinterest, forgetting to vote, health and issues of access as reasons why they didn’t vote, according to census data.", "\"They often have inflexible jobs, have limited transportation options to get to the polls, and/or insufficient knowledge about democracy and the choices they face,\" said Zoltan Hajnal, a political science professor at the University of California, San Diego. \"The poor also often lack efficacy and don’t feel like their votes count as much.\"", "Our ruling", "Sanders said, \"In 2014, 80 percent of poor people did not vote.\"", "The figure is a bit high if we look at turnout by income. In 2014, about 75 percent of people who made under $10,000 and about 69 percent of those who made under $30,000 didn’t vote. If we look at financial insecurity, however, Sanders is right on the money.", "We rate his claim Mostly True.", "NBC, Meet the Press, April 24, 2016", "PolitiFact California, \"Mostly True: Bernie Sanders' claim about America's 'lowest on earth' voter turnout,\" March 23, 2016", "Email interview with Warren Gunnels, policy director for Bernie Sanders, April 24, 2016", "Demos, \"Why Voting Matters: Large Disparities Benefit the Donor Class,\" Sept. 16, 2015", "Census Bureau, Tables 7 and 10 of Voting and Registration in the Election of 2014, July 16, 2015", "Census Bureau, Tables 7 and 10 of Voting and Registration in the Election of 2014, July 16, 2015", "Email interview with Sean McElwee, policy analyst at Demos, April 24, 2016", "PolitiFact, \"Checking Bernie Sanders on Americans' low voter-turnout rates,\" April 2, 2015", "Pew Research Center, \"The Politics of Financial Insecurity,\" Jan. 8, 2015", "Government Accountability Office, \"Issues Related to State Voter Identification Laws,\" September 2014", "Brennan Center for Justice at New York University, \"The Challenge for Obtaining Voter Identification,\" July 29, 2012", "Harvard University, \"Democracy in Poverty: A View from Below,\" May 16, 2013", "Email interview with Zoltan Hajnal, political science professor at University of California, San Diego, April 24, 2016", "The Guardian, \"Poor Americans are less likely to vote and more likely to distrust government, study shows,\" Jan. 9, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]