["About this rating", "On 16 November 2016, social media status updates claimed that police had discovered child victims of organ trafficking in Thailand, complete with a disturbing photograph:", "Thailand police found this in a container vehicle. Dead bodies of children. Their organs where found removed. They are all kidnapped and brought to Thailand from different countries, police says.", "Take care of your children and share this message to your contacts.", "The Facebook post was one example of like-farming, urging social media users to spread messages to their contacts. Although the image is real, the explanation attached to it is false and exploitative: Once again, genuine images of children killed in chemical attacks in Ghouta, Syria were repurposed on social media with a false back story to drive engagement and sharing or advance a narrative.", "This particular photograph shows the widely-documented August 2013 gas attack in Syria. It had no connection to Thailand, organ harvesting, child trafficking, or any tragedy other than that particular incident.", "Brainard, Cecilia Manguerra.   \"Assad Used Chemical Warfare In Syria - 1,300 Dead In Ghouta.\"\r\n    Travels (And More) With Cecilia Brainard.   22 August 2013.", "Groves, Jason et. al.   \"U.S. Marches Closer To Strikes On Syria: John Kerry Delivers Damning Statement Demanding 'Accountability' For 'Undeniable' Chemical Gas Attack.\"\r\n    Daily Mail.   27 August 2013.", "Phillips, Rhodri.   \"Million Kids Flee Hell In Syria As 7,000 Die.\"\r\n    The Irish Sun.   22 August 2013.", "New York Post.   \"Syrian Rebels Claim More Than 500, Including Dozens Of Kids, Dead In Chemical Weapons Attack; Obama Calls For UN Probe.\"\r\n    21 August 2016.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]