["The video can be seen in this March 26, 2019 Facebook post by Pakistani online news channel 72 News, which has more than 320,000 Facebook followers.", "The 28-second video appears to show a woman eating a person’s head, with the sound of screaming heard in the background.", "The post’s Urdu-language caption translates to English as: “It is being said that this thing you can see is neither human nor animal. It exists in Peshawar and eats people at night. Don't leave your house unless you have to.”", "The same video has been shared in multiple Urdu-language Facebook posts, for example here and here, where it has been viewed tens of thousands of time.", "The Urdu-language caption on these posts says: \"Have you ever seen a witch that eats humans? If not then watch this video and share it\".", "Using keyframes from the misleading video, AFP conducted multiple reverse images searches on Google and found that the footage was actually from the 2014 American horror film “The Taking of Deborah Logan”.", "Here is the film’s description on film site IMDb.", "AFP compared images from the film, which can be seen here on IMDb, with sections of the video in the misleading Facebook posts.", "Below are two pairs of comparison screenshots of the video in the misleading Facebook posts (l) with images on IMDb (r):", "Below is the film’s official trailer on the YouTube channel for Movieclips Trailers, a US based channel which regularly posts content from international films.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]