["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Migrants making their way north to the U.S-Mexico border have neither dragged nor brutalized police officers. They also haven’t haven’t burned the American flag or defaced it with a swastika.", "New allegations that migrants are standing and peeing on the flag before dumping it are also false.", "\"Report: Migrants in Guatemalan Caravan stand on, and then urinate on, U.S. flag before throwing it in the trash can,\" reads the text stamped above a photo of someone standing on a flag spread on the ground. The image was posted to a Bill O’Reilly Fans Facebook group on Nov. 2.", "This story was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The picture isn’t fake, but it’s not current. It’s a still from a news clip of a protest at the University of Wisconsin-Milwaukee on April 3, 2016. Activists were protesting Donald Trump, then a presidential candidate participating in a town hall organized by Fox News.", "And while there has been news coverage of people urinating on the flag stateside—a suspected Boston man in September and an American activist in 2017—we could find no reports of the migrants taking such action.", "We rate this claim Pants on Fire!", "Facebook post on Nov. 2, 2018", "Fox 6, \"‘Makes me sick:’ Protesters seen stomping on American flag outside Trump town hall at UWM,\" APril 3, 2016", "BBC, \"Emily Lance threatened after urinating on US flag on 4 July,\" July 6, 2017", "NBC 10 \"Police: Charges filed against man for urinating on flags at Somerville Veterans Cemetery,\" Sept. 20, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]