["About this rating", "On March 16, 2021, Robert Aaron Long, a 21-year-old white man from Woodstock, Georgia, was arrested in the fatal shootings of eight people at three spas in or around Atlanta. The shootings, which resulted in the deaths of six Asian women, took place amid a rise in violence against Asian Americans around the U.S. during the coronavirus pandemic. As a result, many online speculated about the suspect’s social and political affiliations, and whether this was a hate crime.", "One meme with a number of claims was widely shared on social media. The meme said:", "This is Robert Aaron Long. He was just arrested for shooting and killing 8 Asian women at three different spas in the Atlanta area. He’s not in ISIS. He’s not an immigrant. He’s not BLM or Antifa. He’s just another homegrown terrorist, inspired by Trump’s racism to commit a deadly hate crime.", "The meme contains several claims, which we break down below. Due to the ongoing nature of the police investigation and the fact that so much was still unknown, many of the claims are either inaccurate or unproven.", "The image above does indeed show Long. The same photograph of Long was shared in a news clip on Fox5, and appears to be the same man in photos released by law enforcement. Long was arrested by police on suspicion of shooting and killing eight people at three different massage spas in the Atlanta area and in Cherokee County. Six of those eight people were Asian women. Long faces murder and assault charges in Cherokee County and additional murder charges in Atlanta.", "Long’s possible affiliations and motivations are largely unknown. Officials say the suspect may have frequented those spas and appeared to have sexual-addiction issues. \"It's a temptation for him that he wanted to eliminate,\" said Capt. Jay Baker of the Cherokee County Sheriff's Department at a news conference. Cherokee County Sheriff Frank Reynolds said, “During his interview, he gave no indicators that this was racially motivated. We asked him that specifically, and the answer was 'no.'”", "Reports of the suspect denying he was racially motivated to commit the crimes does not necessarily rule that motivation out. Crimes against Asian Americans have risen dramatically since the start of the COVID-19 pandemic. Stop AAPI Hate, a group that tracks incidents of violence and harassment against Asian Americans and Pacific Islanders, reported around 3,800 instances of discrimination in the past year. Georgia’s state Rep. Bee Nguyen said the shootings appeared to be at the “intersection of gender-based violence, misogyny and xenophobia.” The Atlanta police chief said on March 17, 2021, that it was too early to determine whether this was a hate crime.", "We reached out to the Crisp County Sheriff’s office to learn more about Long, and a spokesperson said the agency had been involved in the suspect's apprehension, but had turned the investigation over to the Cherokee County sheriff. We asked the Cherokee County office whether it was investigating this incident as a hate crime, but have yet to hear back. We will update this post if more information becomes available.", "Little is known about whether Long was influenced by former President Donald Trump, who had frequently referred to COVID-19 in the past as the “China virus,” and he defended its use even as bigotry against Asian Americans continued and experts deemed the term “stigmatizing.”", "We reached out to Georgia’s Secretary of State’s office to get information on Long’s voter record, and a spokesperson said Georgia doesn’t register voters by political party. Long registered to vote in 2017, the year he turned 18, but only voted in the 2020 general election, which offers no insight into which party he preferred. We should note no evidence currently exists that any political affiliations motivated him.", "Long, who is from Woodstock in Cherokee County, Georgia — which is almost an hour's drive from Atlanta — does not appear to be an immigrant. Any other affiliations, including whether he had ties to the Islamic State (also referred to as ISIS), the Black Lives Matter (BLM) movement, or the antifascism (antifa) movement, are also unknown.", "Given that the key claim in the meme argues that the suspect was motivated by “Trump’s racism to commit a deadly hate crime,” but that little is known about Long's affiliations with anything or anyone, we rate this claim as “Unproven.” We will update this article and rating when more information becomes available.", "March 16, 2021: Replaced Reuters article with Facebook live stream of Atlanta Police Department, added suspect \"may\" have frequented spas.", "Nur Nasreen Ibrahim is a reporter with experience working in television, international news coverage, fact checking, and creative writing.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]