["About this rating", "In mid-June 2017, tabloids and similar sources published articles about a couple that purports to survive by eating little to no food. Akahi Ricardo and Camila Castello, the articles said, call themselves \"breatharians,\" and say they survive on \"the universe's energy,\" along with pieces of fruit and vegetable broth eaten 2-3 times per week.", "This is not the first time that people have made this claim. A Wikipedia page for the practice perhaps best sums it up in noting that \"[t]hough it is common knowledge that biological entities require sustenance to survive, breatharianism continues.\" Notably, The Sun and many regurgitators of the piece repeated claims purportedly made by Ricardo and Castello without checking them against very basic science understood across humanity:", "Camila and Akahi – who have a five-year-old son and two-year-old daughter together – have survived on little else besides a piece of fruit or vegetable broth just 3 times per week since 2008.", "And Camila even practised a Breatharian PREGNANCY – not eating anything during the entire nine months that she carried her first child.", "The married couple-of-nine-years claim that their “food-free lifestyle” has improved their health and emotional well-being as well as meaning they can spend money on travelling rather than the weekly shop ... Camila explained: “I was completely open to changing my food-free lifestyle when I first became pregnant because my child came first. But I just never felt hungry so I ended up practicing a fully Breatharian pregnancy.", "“I didn’t feel the need or desire to eat solid food during the entire nine months and so I only ate 5 times, all of which were in social situations.", "Throughout the profile (which was republished across the web with no additional fact checking), the couple alternately claimed to eat occasionally and to describe themselves as \"food free.\" Whether the couple claimed to eat very little or nothing at all, no apparent verification of their claims was made before pushing the dangerous suggestion one could live without food or water out to large audiences.", "Predictably, the practice has indeed proved fatal. Victims in Scotland, Australia, and Switzerland were among individuals who died in an attempt to survive without food or water. A 1999 Guardian article about the deaths quoted an expert on survival medicine:", "Experts differ as to the absolute maximum length of time that human life can continue without water, but the broad consensus rests at somewhere between seven and 10 days - though severe dehydration and confusion (due to the build-up of sodium and potassium in the brain) would set in sooner. In the desert, of course, lack of water can kill in a matter of hours.", "\"It depends on the climate, and how much exercise you're taking, but if you're lying in bed you would probably be just about all right for a week,\" says Dr Charles Clarke, who specialises in high-altitude survival medicine and has accompanied the climber Chris Bonington on expeditions to Mount Everest. \"But towards the end of the first week, you'd become pretty gravely ill. Your blood would become thicker, your kidneys can't cope; multiple organ failure follows, you get hypothermic and eventually you die.\"", "Moreover, the couple profiled by The Sun weren't the first \"breatharians\" to admit to or be caught eating food while claiming not to eat or drink. Jasmuheen, an ex-business woman and founder of the movement has never proved she doesn't eat, demonstrates signs of eating, and nutritional experts believe the claim may be a delusion shared among individuals who underestimate their \"occasional\" eating:", "Jasmuheen freely admits to drinking orange juice regularly and occasionally nibbling chocolate biscuits for a \"taste sensation\". In the past she has described her diet as including tea with honey and soya milk, chocolate, crisps, soup and the odd piece of fruit. Thoeretically, a diet consisting of those foods in small amounts could represent a calorific intake to which the body could adjust without significant weight loss.", "Reporters visiting Jasmuheen's Brisbane home have been bewildered to find her fridge well-stocked with vegetarian food which, she says, belongs to her partner Jeff Ferguson, a convicted fraudster. And a British journalist accompanying Jasmuheen to her check-in desk at Heathrow last December was astonished when the BA clerk asked her to confirm that she'd ordered an in-flight vegetarian meal. \"No, no,\" she replied. \"Well, yes, OK, I did. But I won't be eating it.\"", "Although claims of \"breatharians\" surviving and thriving pop up every few years, we were unable to find any evidence contradicting the body of science demonstrating humans require water and food to stay alive. It's possible the couple profiled by The Sun in June 2017 both genuinely made and believed their own claims, but we found no proof the impossible assertion was actually true. When tested, purported breatharians such as Jasmuheen failed to last more than a few days without food and water.", "Gabbatt, Adam.   \"Living on Light: Woman Attempts to Prove Humans Can Live Without Food.\"\r\n    The Guardian.   14 June 2013.", "Gabbatt, Adam.   \"Seattle Woman Naveena Shine Drops Attempt to Live on Light.\"\r\n    The Guardian.   18 June 2013.", "Windle, Lauren.   \"‘We Live on Air’ ‘Breatharian’ Couple Have Barely Eaten for Nine Years and Think They Only Need ‘The Universe’s Energy’ to Live ... And She Even Ditched Food for Her Entire Pregnancy.\"\r\n    The Sun.   15 June 2017.", "[New York] Daily News.   \"Swiss Woman Dies After Attempting to Live on Sunlight; Woman Gave Up Food and Water on Spiritual Journey.\"\r\n    25 April 2012.", "The Guardian.   \"Let Them Eat Air ...\"\r\n    28 September 1999.", "The Australian.   \"Quest for Inner Peace Led Lani to a Cruel Death.\"\r\n    20 November 1999.", "BBC News.   \"Scotland Woman 'Starved Herself to Death' .\"\r\n    21 September 1999.", "RationalWiki.   \"Breatharianism.\"\r\n    Accessed 16 June 2017.", "Wikipedia.   \"Inedia.\"\r\n    Accessed 16 June 2017.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]