["About this rating", "When a product takes on more than one name and has an elusive backstory, it raises some questions. And we faced a big question mark surrounding the identity of Nathan Gilroy, a personality who had been widely touted on Facebook as an \"inventor,\" but had no real credentials available to back him up, nor much of an online presence to begin with.", "Ads for the so-called \"Powersave\" device had been circulating on Facebook in late 2020, describing how a young \"genius\" named Nathan Gilroy had invented an energy-saving device that would reduce electricity costs in homes by 50%.", "A video shows a young teen, purportedly an 18-year-old Gilroy, who allegedly grew up in \"the poorest neighborhood of St. Louis.\" The video claims his device is helping poor families across America who are struggling with electricity bills. Elsewhere, a number of websites shared \"facts\" about him, claiming that Gilroy graduated from the Massachusetts Institute of Technology (MIT) at a young age.", "There were a number of red flags in the meager information available about Gilroy. Firstly, throughout the video, the young teen does not speak. All the information is conveyed through text overlaid on video, and what appear to be spliced together images and clips that could have been pulled from a range of sources. Even the people offering testimonials about the product are simply talking, voiceless heads on the screen with overlaid text purportedly quoting them.", "But to determine whether Gilroy the inventor was a real person behind this device, we reached out to MIT. A representative from its media relations team pointed out that university officials \"typically don't definitively confirm that a person did not attend MIT, as there can be situations where someone enrolled under a different name or participated in a special program.\" They did, however, check with the MIT Registrar's Office in this case, and found there was no record of an individual with the name Nathan Gilroy having been an enrolled MIT student.", "There is very little else about him available online. Given that key parts of Gilroy's identity and credentials are impossible to confirm, his educational background is outright falsified, and the promotional material around him appears deliberately deceptive, we have concluded that such a person does not exist.", "In August 2023, a number of Facebook videos emerged, promoting the device again, but this time the so-called inventor was a man named \"Noah Watson\" and his device was called \"BoldHero.\" The videos had repurposed the same old clips showed the young man speaking and appearing to give an interview, but we still cannot hear him. This time, his backstory claimed he grew up poor in Jacksonville, Florida, and was raised by a single mother before he went to Harvard. Ultimately the videos seek to promote the same device under a different story and name.", "But is the device just a scam? Described as a \"smart device plugged into socket,\" and a \"voltage stabilizer,\" it apparently conserves electricity, but no details are offered about the device's mechanisms that allow it to do this. It also goes by different names online. One website called it ElectroPro  while others called  it \"Power saver.\" Amazon shared a version of the device labelled \"Powersave.\" Facebook videos from August 2023 called it \"BoldHero\" and the device was also available on Amazon under that name, as of this writing. Most Amazon reviews say the device is useless, or a \"total scam.\" Scamadvisor, a popular YouTube channel, called it a \"complete waste of money\" and said the product they ordered looked completely different from how it was advertised.", "But the only way to test if the device really works and will save money on electricity bills is to order it oneself. Given that the purported inventor of this device does not appear to exist, we don't recommend that our readers try. We therefore rate this claim as \"False.\"", "Aug. 10, 2023: We updated the story with new Facebook videos that repurposed old footage and promoted the same device under a new inventor's name.", "Nur Nasreen Ibrahim is a reporter with experience working in television, international news coverage, fact checking, and creative writing.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]