["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "President Donald Trump listens to a question during a news conference in the East Room of the White House on Nov. 7, 2018. (AP/Evan Vucci)", "In recent midterm elections when presidents faced a backlash from voters, the president accepted their brushback. In 2006, George W. Bush acknowledged a \"thumping\" by Democrats. In 2010, Barack Obama said he’d been delivered a \"shellacking\" by Republicans.", "By contrast, when President Donald Trump addressed the results of the 2018 midterms -- when his party lost at least 31 seats and control of the House -- he focused primarily on Republicans’ ability to flip at least three seats in the Senate.", "\"It was a big day yesterday,\" he said. \"Incredible day. And last night the Republican Party defied history to expand our Senate majority while significantly beating expectations in the House.\" (Officially, Republicans currently have the same number of seats in the Senate -- 51 -- with three races still undecided in Mississippi, Florida and Arizona. You can read more about that in a separate fact-check.)", "Later in the day-after press conference, Trump said, \"In the House, Republicans dramatically outperformed historical precedents and overcame a historic number of retirements. The most House Republican retirements in 88 years -- 43 House Republicans retired.\"", "The Republicans did have to cope with many retirements, which in 2018 reached a high for Republicans going back at least as far as 1930. But Trump is wrong that the Republicans outperformed historical precedents. The losses were fairly average or worse than average.", "Here is the data for midterm losses for the president’s party going back to the Civil War. The 2018 figure is in green. We have set it for 31 net-seats-gained that were confirmed by Nov. 8. This number could grow a bit as about a dozen races are yet to be called, and a Democrat is leading in five of those uncalled races.", "If we ignore the small number of years in which the president’s party gained seats in the House, the average loss going back to 1862 is 38 seats and the median loss is 30 seats.", "That may make the loss of at least 31 seats in 2018 seem pretty average -- though even there it would be wrong to say, as Trump did, that 2018 represented a dramatic overperformance. It would even be worse if Democrats end up winning the five uncalled contests where they are currently ahead.", "More problematic is that the swings in recent years have been much smaller.", "Going back to 1970, the average midterm loss for the president’s party has been 23 seats, and the median loss has been 14 seats. By this standard, a loss of 31 seats (or more) looks pretty substantial.", "Indeed, if you look just at losses suffered under Republican presidents, the total for 2018 exceeds all but two midterms going back to the Great Depression. The 2018 total even edged out the losses under George W. Bush in 2006, which was the last time the Democrats re-took the House in a midterm election.", "\"This one was clearly pretty bad,\" said Alan Abramowitz, an Emory University political scientist.", "And while the Republican outlook in the House was indeed harmed by retirements, as Trump said, the GOP conversely benefited from district lines that were drawn largely by Republicans following the 2010 Census.", "\"Republican gerrymanders likely minimized the damage, preventing even more GOP losses,\" said Costas Panagopoulos, a political scientist at Northeastern University.", "The White House did not respond to an inquiry for this article.", "Trump said, \"In the House, Republicans dramatically outperformed historical precedents.\"", "That’s not what the numbers currently show, and the GOP’s position in the House is likely to end up worse as the outstanding races are called.", "If you look all the way back to the Civil War era, the expected GOP losses are in line with the long-term historical average -- not a dramatic overperformance. And if you look at the patterns typical over the last 50 years, the projected losses for 2018 are one-third higher than the average losses and more than double the median losses during that period.", "We rate the statement False.", "Donald Trump, press conference, Nov. 7, 2018", "Brookings Institution, Vital Statistics on Congress, accessed Nov. 8, 2018", "Vital Statistics on Congress, \"House and Senate Retirements by Party, 1930 - 2016,\" accessed Nov. 8, 2018", "Vital Statistics on Congress, \"Losses by the President's Party in Midterm Elections, 1862 - 2014,\" accessed Nov. 8, 2018", "New York Times, \"Tracking Republican House Retirements,\" accessed Nov. 8, 2018", "Politico, election results, accessed Nov. 9, 2018", "FiveThirtyEight.com, \"Here Are All The Republicans Retiring From Congress In 2018,\" July. 26, 2018", "Email interview with Alan Abramowitz, Emory University political scientist, Nov. 8, 2018", "Email interview with Costas Panagopoulos, political scientist at Northeastern University, Nov. 8, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]