["About this rating", "On 3 July 2017, World Politicus reported that United States President Donald Trump had sent a plane to be used by the parents of terminally ill 11-month-old boy Charlie Gard, who are seeking experimental treatment for him available in the United States.", "Courts in the United Kingdom and in continental Europe had previously ordered that Great Ormond Street Hospital in London must end life support for Charlie, who has an extremely rare mitochondrial disease, suffers from brain damage, is deaf and blind, and cannot move.", "However, new evidence relating to a possible experimental treatment led the hospital to bring the case back to the High Court of England and Wales for adjudication on 10 July 2017. Charlie's parents, Connie Yates and Chris Gard, have already raised $1.8 million (£1.3 million) to pay the costs of transporting their son for experimental treatment outside the UK.", "Earlier in the month, both Pope Francis and Donald Trump intervened in the case, offering their assistance to the couple — but there's no evidence that Trump had specifically sent or offered the use of a plane for Yates and Gard, and World Politicus offered no explanation or support for the claim made in their headline.", "Further, at the time the article was written, Charlie Gard's parents were legally barred from moving their son outside the hospital, making it even more improbable that Trump would have sent a plane to the UK at that time.", "On 6 July 2017, three days after the dubious article, the Daily Telegraph reported that Charlie Gard's parents had been in contact with the White House in response to the President's offer of assistance. However, a family spokesperson did not say Trump had sent, or offered to send, a plane. It is plausible that Trump may eventually make such a gesture if the High Court rules that Charlie Gard can be given experimental treatment outside the UK, but there is no evidence that the President had done so at the time the site had published its story.", "We asked the White House whether the President had sent or offered to send a plane to the family, but did not receive a response.", "World Politicus has a history of publishing hoaxes or dubious stories.", "Vatican Radio.    \"Pope Francis Expresses Closeness to Charlie Gard's Parents.\"\r\n  RadioVaticana.va.    3 July 2017.", "Henderson, Barney.    \"Charlie Gard's Parents in Touch With the White House as Donald Trump to Raise Issue With Theresa May at G20.\"\r\n    Daily Telegraph.    6 July 2017.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]