["About this rating", "The final weeks of every year see the \"War on Christmas\" return to television panel debates and newspaper columns in the United States, bringing (dubious) claims that modern American society has progressively marginalized and turned against public expressions of Christianity.", "In December 2018, one widely-shared internet meme turned this annual trope on its head, claiming that Christmas only came to be accepted relatively late on in the history of the United States, after a long period of Puritan disdain for what was once perceived as a \"pagan holiday.\"", "The Facebook page \"For Truth Not Religion\" posted a meme featuring blurred images of \"publick notices\" describing Christmas traditions as \"Satanical practices,\" along with the claim that \"Christmas was illegal in the U.S. until 1836 as it was considered an ancient Pagan holiday\":", "At one time, in both American and English history, Christmas was indeed regarded as a pagan holiday, but it's not true to say that the festival was banned in the United States until 1836.", "Neither the meme itself nor \"For Truth Not Religion\" cited any sources, but the two archaic notices shown in the meme provided some clue as to the origins of the claim.", "The first was a law passed by the General Court in the Massachusetts Bay Colony in 1659, which read as follows:", "Publick Notice", "For the preventing of disorders, arising in several places within this jurisdiction by reason of some still observing such festivals as were superstitiously kept in other communities, to the great dishonour of God and offense of others. It is therefore ordered by this court and the authority thereof that whosoever shall be found observing any such day as Christmas or the like -- either by forbearing labour, feasting or any other way, upon any such account as aforesaid, every such person so offending shall pay for every such offense five shilling as a fine to the county. Massachusetts Bay Colony, 1659.", "The second notice read as follows:", "Publick Notice", "The observation of Christmas having been deemed a sacrilege, the exchanging of Gifts and Greetings, dressing in Fine Clothing, Feasting and similar Satanical Practices are hereby FORBIDDEN with the Offender liable to a Fine of Five Shillings.", "The first notice came from a statute passed in the Massachusetts Bay Colony in 1659, which can be viewed here.   The provenance of the second notice is unclear: the earliest instance of it we could find was a 1963 newspaper article that referred to the Atlantic Monthly magazine's having republished it as part of a subscription renewal advertisement, describing the notice as a 1660 Massachusetts law. Despite this citation, it is not included in various online collections of Massachusetts colonial records, which, by contrast, do contain the first notice.", "It's possible that the second notice did originate in Massachusetts in 1660 but was a public advertisement that summarized and reiterated the 1659 law, rather than being a discrete statute of its own.", "In any event, it is true that the celebration of Christmas was indeed banned in colonial Massachusetts in 1659. That ban was motivated largely by the austere Puritan religious beliefs of authorities in the colony, who objected to the December 25th celebration for two main reasons: because it was originally a pagan winter festival co-opted by Christians and lacking in any Biblical basis, and because it was typically accompanied by merriment and indulgence and therefore was anathema to the Puritan principles of sobriety and hard work.", "In his book The Battle for Christmas the historian Stephen Nissenbaum referenced the suppression of Christmas celebrations in early New England:", "In New England, for the first two centuries of white settlement most people did not celebrate Christmas. In fact, the holiday was systematically suppressed by Puritans during the colonial period and largely ignored by their descendants ... Only in the middle of the nineteenth century did Christmas gain legal recognition as an official public holiday in New England.", "Nissenbaum noted that the Puritans often pointed out the lack of explicit Biblical support for December 25 as Jesus' birthday (an issue we have separately examined in greater depth) and emphasized its pagan origins as well as decrying the excess that often came with it:", "It involved behavior that most of us would find offensive and even shocking today -- rowdy public displays of eating and drinking, the mockery of established authority, aggressive begging ... and even the invasion of wealthy homes ... Excess took many forms. Reveling could easily become rowdiness; lubricated by alcohol, making merry could edge into making trouble. Christmas was a season of \"misrule,\" a time when ordinary behavioral restraints could be violated with impunity.", "The Puritan crackdown on Christmas in Massachusetts had a recent precedent in English history. During the 1640s and 1650s, under the influence of Oliver Cromwell, England's short-lived republican parliament passed laws restricting and prohibiting the celebration of Christmas.", "First in 1644, lawmakers passed an ordinance which called for December 25 to be a day of \"solemn humiliation\" rather than the \"carnal and sensual delights\" which had characterized the celebration of Christmas:", "This day in particular is to be kept with the more solemne humiliation, because it may call to remembrance our sinnes, and the sinnes of our forefathers, who have turned this Feast, pretending the memory of Christ into an extreame forgetfulnesse of him, by giving liberty to carnall and sensuall delights, being contrary to the life which Christ himselfe led here upon earth.", "In 1647, the English parliament banned the celebration of Christmas altogether, along with Easter and Whit Sunday, replacing them with a monthly day of rest:", "Forasmuch as the Feasts of the Nativity of Christ, Easter and Whitsuntide, and other Festivals commonly called Holy-Dayes, have been heretofore superstitiously used and observed Be it Ordained, by the Lords and Commons in Parliament assembled, That the said Feast of the Nativity of Christ, Easter and Whitsuntide, and all other Festival dayes, commonly called Holy-dayes, be no longer observed as Festivals or Holy-dayes within this Kingdome of England and Dominion of Wales ...", "However, these crackdowns did not last long. When the English monarchy resumed under Charles II in 1660 (ushering in a period known as the Restoration), laws passed during the preceding 18 years were struck down, and Christmas has been legally and enthusiastically celebrated there ever since.", "Similarly, the Massachusetts Bay prohibition on Christmas was repealed in 1681, some 22 years after it was introduced. We were unable to find any record of a similar ban on the celebration of Christmas after that date, either in the north-eastern colonies of the 17th and 18th centuries, or anywhere throughout the United States after 1776.", "Indeed, the emphasis on religious liberty in the 1791 Bill of Rights, whose First Amendment famously bars states from creating any law \"prohibiting the free exercise\" of religion, means any attempt to outlaw the celebration of Christmas would have been given short shrift.", "The significance of 1836 appears to be as the year in which, it is widely held, Alabama became the first U.S. state to formally recognize Christmas Day as a public holiday. However, some dispute exists over this date. The earliest record we could find placing Alabama's legal recognition of Christmas at 1836 was James Harwood Barnett's 1954 book The American Christmas.", "However, despite searching news archives and Alabama legislative records, we were unable to verify that the state passed any statute or resolution in 1836 rendering Christmas Day a public holiday. In any event, the claim in the meme that Christmas was \"illegal in the U.S. until 1836\" is wrong in several ways.", "First, Christmas was only ever illegal from 1659 until 1681, and not thereafter. Secondly, that ban was limited to the Massachusetts Bay colony and never took hold throughout the United States, which was not even formed until almost a century after the Massachusetts ban had ended. Finally, 1836 was the year in which, according to some sources, the first U.S. state recognized Christmas Day as a public holiday. However, there is reason to doubt the accuracy of that date, and in any case, the series of laws passed throughout the United States in the 19th century had the effect of making December 25 a day off for laborers, not overturning a ban on Christmas Day.", "For these reasons, the claim contained in the \"For Truth Not Religion\" meme is false.", "Emery, David.   \"A History of the War on Christmas.\"\r\n    Snopes.com.   29 November 2017.", "The Freeport Journal-Standard.   \"We Read This.\"\r\n     2 November 1963.", "Nissenbaum, Stephen.   The Battle for Christmas.\r\n    New York: Vintage Books, 1997.   ISBN 0-679-74038-4.", "Acts and Ordinances of the Interregnum, 1642-1660.   \"Public Notice to be Given for Observation of Monthly Fast ...\"\r\n    19 December 1644", "Acts and Ordinances of the Interregnum, 1642-1660.  \"An Ordinance for the Abolishing of Festivals.\"\r\n    8 June 1647.", "Gore, Leada.   \"Bet You Didn't Know: Alabama Was the First State to ...\"\r\n    AL.com.   6 December 2016.", "Palmer, Alex.   \"When Americans Outlawed Christmas.\"\r\n     Mental Floss.   12 December 2016.", "Kazek, Kelly.   Christmas Tales of Alabama.\r\n    Arcadia Publishing, 2011.   ISBN 9781540205490.", "Barnett, James Harwood.   The American Christmas: A Study in National Culture.\r\n    Arno Press, 1954.   ISBN 0405076711.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]