["By Saranac Hale Spencer", "Posted on April 22, 2020", "A picture of a reporter in protective medical gear has fueled claims on social media accounts dedicated to American politics that the media “hypes” the COVID-19 pandemic. The photo actually shows a team in Lebanon reporting on a local factory that makes protective suits.", "A picture of a television reporter wearing a disposable, protective jumpsuit and face mask, while her cameraman is in regular street clothes, has been circulating on social media, prompting condemnation of the media for supposedly sensationalizing coverage of the COVID-19 pandemic.", "None of those posts explain that the picture is from Lebanon or that the reporter for the Al Arabiya television channel was working on a story about a factory that had just begun making the protective suits.", "Instead, Facebook pages dedicated to American political issues have been posting a version of the picture paired with text that says: “Reporter in full bio gear, Camera man in street Cloths. think the media hypes this thing a little?”", "A page called Hawaii Republican Action shared it with this caption: “The leftist government-media hype machine is in full overdrive.” And a page called America 1776 shared it with this: “You still believe this isn’t political??”", "But the picture actually came from a video taken while a reporter was filming on a street in Beirut. Another journalist posted the eight-second video clip to Twitter in March with his own commentary on the decision to wear protective gear. That video, which was posted March 18, has been viewed nearly 2 million times.", "Ghinwa Yatim, the reporter featured in the clip, responded to criticism on Twitter on March 20. She explained that she had been filming a story about a local factory that had recently begun making protective equipment and she said that during her report: “i mentioned that there is no need to panic for the time being in Beirut, and that i was only trying this locally produced suit.”", "So, while the picture does show a reporter who is covering the pandemic, many of the Facebook pages sharing it have taken it out of context.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "Downey, Michael (@mgdowney). “Earlier in #Beirut: example of bad media coverage that contributes to panic and sets wrong example. 1. If your photographer doesn’t need that, then you definitely don’t. 2. Save masks and protective gear for medical workers who actually need it. #COVID19.” Twitter. 18 Mar 2020.", "Yatim, Ghinwa (@GhinwaYatim). Thread. Twitter. 20 Mar 2020.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]