["Photographs of a man with Prime Minister Narendra Modi, Defence Minister Rajnath Singh, and Uttar Pradesh Chief Minister Yogi Adityanath are being circulated on Twitter and Facebook with the claim that he is the father of one of the accused in the alleged gang-rape case in Hathras.", "A 19-year-old Dalit woman from Uttar Pradesh’s Hathras was allegedly tortured and gang-raped by four upper-caste men on September 14. According to reports, the four accused in the case are Ramu, Lavkush, Ravi and Sandeep. Additional Director General of Police Prashant Kumar however, said that the woman’s postmortem report showed that she died of neck injuries.", "“The perpetrator of Hathras victim **** Sandeep’s father’s memorable images make everything evident,” reads the viral message. (archived link)", "The same has been posted on Facebook (archived link).", "The man in the viral images is Prayagraj-based Bharatiya Janata Party (BJP) leader Dr Shyam Prakash Dwivedi. On September 16, two days after the Hathras incident, DNA reported that Prayagraj police registered a case against BJP leader Shyam Prakash Dwivedi and Dr Anil Dwivedi for allegedly raping a BA student. As per the report, Dwivedi has denied the charges.", "Alt News rummaged through Dwivedi’s Facebook profile and found two of the viral images in a collage from 2014. The image of Dwivedi with Adityanatah was found in a 2017 post.", "This slideshow requires JavaScript.", "Alt News performed a keyword search on YouTube and found a report by channel News24 UP and Uttrakhand where the family of the accused in the Hathras case are being interviewed. At 8:33 mark, the reporter asked, “You are Sandip’s father. Sandip the one whose name was first taken…” This establishes that Sandip’s father and the man in the viral images, BJP leader Dr Shyam Prakash Dwivedi, are not the same person.", "Thus pictures of BJP leader Dr Shyam Prakash Dwivedi who is being investigated in an alleged rape case in Prayagraj are being linked to the death of a Dalit woman in Hathras. He is not the father of Sandeep, one of the accused in the Hathras case.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]