["About this rating", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "Despite overwhelming evidence that mask use slows the spread of COVID-19, there has been continuous pushback on social media from those who oppose wearing these potentially life-saving face coverings. In July 2020, we came across a strange, new argument in this ongoing debate, as seen in the meme above: There's no point in wearing a mask because the fumes of a fart can penetrate through underwear and pants, including denim jeans.", "The meme is ambiguous but appears to be arguing at a minimum that 1.) since the odor of a fart can pass through denim, a deadly virus can penetrate through a cloth mask and/or 2.) that COVID-19 may be transmissible via a fart. We tease apart these assertions below.", "For starters, people breathe far more often than they fart. On average, a person takes about 20,000 breaths per day. Conversely, the average person farts between 5 and 15 times per day. If these were equally viable methods of COVID-19 transmission (which they are not, but we'll address that later), it's clear why health officials would focus more on getting the public to wear masks instead of pants. Clothing, of course, is already widely used (and, in fact, legally required) in public spaces.", "It should also be noted that masks, like pants, prevent droplet transmission. As we noted in a previous article, a number of simple demonstrations have been conducted by doctors, researchers, and even children's televisions programs to show how using a face mask prevents droplet transmission. Here's a look at a petri dish that was coughed on by a person wearing a mask (left) and a person not wearing a mask (right):", "Twitter/Katie Corley", "Believe it or not, a similar demonstration was conducted in 2001 in relation to farts.", "Dr. Karl Kruszelnicki, who has been dubbed by some as the Bill Nye of Australia, measured the winds of passing gas by having a lucky colleague fart onto two petri dishes, once while wearing pants, and again in the light of a full moon.", "Dr. Kruszelnicki then described the method by which he had established whether human flatus was germ-laden, or merely malodorous. \"I contacted Luke Tennent, a microbiologist in Canberra, and together we devised an experiment. He asked a colleague to break wind directly onto two Petri dishes from a distance of 5 centimetres, first fully clothed, then with his trousers down. Then he observed what happened. Overnight, the second Petri dish sprouted visible lumps of two types of bacteria that are usually found only in the gut and on the skin. But the flatus which had passed through clothing caused no bacteria to sprout, which suggests that clothing acts as a filter.", "In other words, wearing pants, like wearing a mask, can lessen droplet transmission.", "The claim that COVID-19 can spread via flatulence is largely based on a few academic studies that found the virus was present in the fecal matter of some infected persons. However, there have been no confirmed reports of COVID-19 being transmitted via fecal matter.", "In April 2020, the British tabloid The Daily Star lent credence to the idea that COVID-19 was spreading via farts when they published an article that was misleadingly entitled \"Coronavirus 'could be spreading across the globe through farts' claim doctors.\" This headline, however, did not reflect reality. The Star's sub-heading, for instance, clarified that \"infected people\" could \"wear pants\" to prevent this theoretically plausible form of transmission from occurring. Furthermore, The Star later updated the headline of this article to note that this form of transmission was \"unlikely.\"", "The Centers for Disease Control and Prevention (CDC) writes in an FAQ about COVID-19 that while the virus has truly been found in the fecal matter of infected persons, there have  been no confirmed reports about the disease spreading via fecal matter:", "The virus that causes COVID-19 has been found in the feces of some patients diagnosed with COVID-19. However, it is unclear whether the virus found in feces may be capable of causing COVID-19. There has not been any confirmed report of the virus spreading from feces to a person. Scientists also do not know how much risk there is that the virus could be spread from the feces of an infected person to another person. However, they think this risk is low based on data from previous outbreaks of diseases caused by related coronaviruses, such as severe acute respiratory syndrome (SARS) and Middle East respiratory syndrome (MERS).", "The above-displayed meme does not convey some sort of logical flaw that negates the purpose of wearing a mask to stop the spread of COVID-19. In fact, if you take the time to think about the claims in this meme, it may prove precisely the opposite. Would you rather be farted on by a fully clothed individual? Or by a naked person? In the same manner, a mask can prevent droplet transmission, slow the spread of COVID-19, and, like pants, at the very least it can lessen the overall grossness factor.", "Canberra Times.   \"Hot Air?\"     17 July 2001.", "Richardson, Ian.   \"Fact Check: We Know About Coughs and Sneezes. But Can Coronavirus Spread Through Farts?\"     USA Today.   23 April 2020.", "CDC.   \"Frequently Asked Questions.\"     15 July 2020.", "Van Beusekom, Mary.   \"Scientists Isolate Live COVID-19 Virus From Feces, Detect RNA on Surfaces.\"     CIDRAP.   19 May 2020.", "Dickinson, Isobel and Nicholas Bieber.   \"Coronavirus 'Could Be Spreading Across the Globe Through Farts' Claim Doctors.\"     The Star.   11 April 2020.", "Lee, Bruce.   \"Can Farts Transmit COVID-19 Coronavirus? Here Is What Is Being Said.\"     Forbes.   27 April 2020.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]