["About this rating", "On 20 February 2016, the Nevada Democratic caucuses ended in a victory for Hillary Clinton.  Not long after that, actress America Ferrera tweeted that  that supporters of Bernie Sanders shouted \"English only!\" at longtime civil rights activist Dolores Huerta (who had apparently offered to translate from English to Spanish at an event at Harrah's casino on the Las Vegas strip), objecting to a translation of remarks from English to Spanish:", "Harrah's casino site- Bernie supporters chant \"English-only\" to stop civil rights leader @DoloresHuerta from providing Spanish translation.", "— America Ferrera (@AmericaFerrera) February 20, 2016", "Shortly thereafter, Huerta tweeted:", "I offered to translate & Bernie supporters chanted English only! We fought too long & hard to be silenced Si Se Puede! #ImwithHer #NVcaucus — Dolores Huerta (@DoloresHuerta) February 20, 2016", "Huerta initially didn't specify how she identified the chanters as Sanders supporters. We spoke to Erin Cruz, who was present at the rally with a nurses' union to support Sanders:", "@AmericaFerrera @DoloresHuerta The moderator said English only not anyone from the Bernie camp @SusanSarandon @rebeccab311 — Erin Cruz (@neuroticnurse75) February 20, 2016", "Cruz told us she was accompanied by  ten other nurses and actors Susan Sarandon and Gaby Hoffman. Cruz said she was unaware of any recording during the disputed chanting:", "@KimLaCapria @brooklynmarie I don't know that anyone was recording, but I would gladly give a statement along with all the other nurses. — Erin Cruz (@neuroticnurse75) February 20, 2016", "A video of Huerta speaking surfaced not long afterward:", "A tweet from America Ferrera said that Bernie Sanders supporters \"chant 'English-only' to stop civil rights leader Dolores Huerta from providing Spanish. A video was posted on Facebook around 5pmET and it has been deleted but I was able to access the deleted video. This is the video off my phone. I do not hear \"English-only\" on the video. Does anyone else?FYI, both Ferrera and Huerta are public supporters of Clinton.", "Posted by Julio Ricardo Varela on Saturday, February 20, 2016", "Huerta has been extremely outspoken in her support for Hillary Clinton in recent weeks, and in fact was at the Nevada event to stump for her.", "Later on 20 February 2016, Huerta told ThinkProgress that she was able to identify Sanders' supporters as the \"room was divided with the Hillary people on one side and the Bernie people on the other.\" Huerta then nullified the \"English only\" claim entirely, herself stating that objections were raised not about translation but due to her affiliation with the Clinton campaign. Huerta further confirmed that the \"English only\" statement was made by the temporary precinct chair and not those objecting:", "“The fellow that was running the caucus said that the first person to come up to the stage could translate, so I went up. Nobody else did,” she said. “Then the Bernie people started yelling no, no, no. One of their people came up, and I suggested we both translate. But the moderator decided we would have no translation. So the Bernie people preferred we would have no translation just because I was going to do the translating. It’s ridiculous, because if I had said something that wasn’t accurate, I’m sure somebody would have corrected me.”", "A subsequent tweet from Susan Sarandon (who was present at that caucus) provided an account of the dispute in question along with a longer video clip:", "Link to the entire vid. The translation ask starts at 53:30 & mod says English Only at 55:18. NO CHANTING. https://t.co/3bxIs9eKJy", "— Susan Sarandon (@SusanSarandon) February 21, 2016", "Also present was actor Gaby Hoffman, who tweeted:", "@cin_d25 @SusanSarandon @AmericaFerrera I was also there. No one shouted English only except the moderator. I was very tuned into this. — Gaby Hoffmann (@gabymhoffmann) February 21, 2016", "@AmericaFerrera @DoloresHuerta I was there & NO ONE from Bernie camp shouted this - moderator did when neutral translator wasn't found!!", "— Gaby Hoffmann (@gabymhoffmann) February 21, 2016", "@AmericaFerrera @DoloresHuerta Also, & I noted this while there, the hill side was the one that applauded when he says english only. — Gaby Hoffmann (@gabymhoffmann) February 21, 2016", "@AmericaFerrera @DoloresHuerta Misinformation like this is is very dangerous and divisive.", "— Gaby Hoffmann (@gabymhoffmann) February 21, 2016", "As Sarandon correctly stated, the segment in dispute started around the 53:30 mark, when parties called for a Spanish-language translator. As she indicated, at 55:18 the caucus moderator (not Sanders' supporters) simply stated that the inability to locate a neutral translator meant the caucus would continue in \"English only.\" At no point did any Sanders supporters appear to have refused a translator based on the fact that translation was objectionable to them; nor was \"English only\" used in a pejorative fashion. The term was invoked a single time, during the moderator's assertion that no suitable translator was located to provide Spanish-language translations:", "A number of readers pointed us toward a 20 February 2016 BuzzFeed item titled \"Sources: Bernie Supporters Did Chant “English Only” At Latina Labor Activist,\" which held:", "On Saturday, Bernie Sanders supporters chanted “English only!” at a longtime labor and Latina activist, two neutral sources unaffiliated with either campaign told BuzzFeed News.", "On 22 February 2016, we contacted BuzzFeed reporter Evan McMorris-Santoro to ask whether we could obtain more information on the \"two anonymous sources\" cited in the piece. McMorris-Santoro apologized and stated he was unwilling to discuss the claim, adding that his reporting \"speaks for itself\" in that respect.", "Significant edits to that item might be the reporting to which McMorris-Santoro referred. On 21 February 2016, the item was updated to include the following passage:", "BuzzFeed News asked Huerta about the specific wording of Ferrara’s tweet: “Harrah’s casino site- Bernie supporters chant “English-only” to stop civil rights leader @DoloresHuerta from providing Spanish translation.”", "... asked to detail what happened, she described a scene different from the image of a legion of Sanders faithful engaged in a racist chant that some read into the Ferrara tweet. When videos of the Harrah’s site posted online didn’t show a scene of mass chants, some dismissed the Huerta story entirely.", "“What happened was this,” Huerta began. “We were there as observers, Bernie supporters and Hillary supporters in the back of the room. Somebody said, ‘we need translation’ and the gentleman running the caucus said we can have translation and the first person on stage can be the translator. I started walking toward the stage. Bernie supporters chanted, ‘no, no, no.’ A Bernie supporter said he wanted to translate. The gentleman running the caucus said we’re not going to do that. It got very loud, and I stepped off the stage.”", "An individual or individuals yelled “English only” Huerta said, part of general yelling and chanting by Sanders supporters at the Harrah’s site aimed at her.", "“They’re whole attitude is, I call it crash and burn, which is if we can’t do it we’d rather not have anyone do it,” she said of the translation scene.", "We examined Nevada State Democratic Party caucus guidelines with respect to general procedure, and were unable to locate any specific procedural policy about translators. If such a provision was codified, it wasn't available in caucus-related instructional material.", "However, caucus policy documents published by the Nevada State Democratic Party in 2008 [PDF] and 2016 [PDF] appeared to favor the objections to Huerta's participation after the caucus was called to order, because of her clear identification as a campaign operative, advocate, volunteer, or surrogate. (Below, Huerta speaking outside the caucus on 20 February 2015, wearing a Clinton campaign t-shirt and hat):", "Guidelines from 2008 stated that campaign operatives were prohibited from communicating in any fashion with caucus participants once the caucus was called to order:", "Only eligible, registered caucus participants may participate on caucus matters or elections ... Campaign Staff and campaign volunteers that are observers will not be allowed to communicate, signal, or instruct the eligible caucus participants once the caucus is called to order by the Temporary Chair ... Anyone may attend the caucus as an observer but may only observe and may not participate or attempt to influence the caucus in [any way] if they are not eligible to caucus.", "Under the heading \"Campaigning and Other Activities\" in Nevada Democrats' 2016 At-Large Precinct Caucus Guidelines, that procedure was reiterated:", "Persons appearing on behalf of candidates or issues not specifically mentioned in the agenda will not be offered an opportunity to speak during the caucus. However, they may speak individually with attendees, pass out literature or collect signatures prior to the caucus being called to order at 11:30 a.m. on Saturday, February 20 ... No campaigning activity by presidential campaigns is permitted inside the registration area of the At-Large Precinct site ...", "... Only eligible, registered caucus participants may participate on caucus matters or elections ... Campaign staff and campaign volunteers who are observers will not be allowed to communicate, signal, or instruct the eligible caucus participants once the caucus is called to order by the Temporary Chair.", "We tried several times to contact Huerta on 20 February 2016, but have not yet received a reply.", "On 22 February 2016 we contacted Raymond Buckley, Chairman of the New Hampshire Democratic Party and Temporary Precinct Chair (TPC) of the 20 February 2016 Harrah's Caucus. Presumably, Buckley was the individual referenced as TPC in media reports and made the call to proceed without translation under the circumstances:", "A representative for Chairman Buckley responded to our initial query, but we have not yet made direct contact with the Harrah's TPC, nor have we confirmed he was one of the two neutral parties with whom BuzzFeed purportedly discussed Huerta's claims.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]