["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Below a photo of a young girl being shared online are these words: \"I was decapitated in front of my parents at the park by a Somalian migrant. The media covered up my MURDER. My name was Emily Jones.\"", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The photo is of Emily Jones, a 7-year-old girl who was randomly attacked by a woman with a knife on March 22 at Queens Park in Bolton, England, according to the BBC. She was with her parents when the attack happened.", "The news outlet’s March 25 story says the girl was \"stabbed to death by a stranger.\" A 30-year-old woman was arrested at the park on suspicion of murder and was \"detained at a secure facility under the Mental Health Act.\"", "The Manchester Evening News reported that Jones died \"as a result of an incised wound of the neck.\"", "A witness chased after the alleged attacker and detained her until police arrived, according to Sky News.", "On April 1, the Bolton Coroner’s Court opened an inquest into Jones’ death. Police coroner’s officer Rebecca Gardner told the court that Jones was playing on a scooter and rode past a wooden bench when she was stabbed by the woman sitting on it, the Bolton News reported. The inquest was adjourned until July 3 while police investigate the killing.", "The account of what happened to Jones has evolved on social media, though. An April 4 tweet, which was \"liked\" more than 33,000 times, calls the girl \"Emily Jones Bolton\" and says the \"media buried her story because her killer is a 30 year old Somali immigrant.\" Another tweet, from April 3, claims \"the media refuses to cover the story in order to protect the savage killer who is a Somali immigrant.\"", "We read nearly two dozen news articles about the killing and none mentioned the suspect’s name, nationality or immigration status.", "We contacted the local police department about the Facebook post. Jonathan Bell, a spokesman for the Greater Manchester Police, told PolitiFact that authorities don’t disclose the identity of people arrested until they have been charged.", "\"This means we would not confirm name, nationality or immigration status, as this would risk identifying her,\" he said.", "In 2013, the College of Policing in the United Kingdom advised that police in England and Wales generally shouldn’t name arrested people until they’re charged. At the time, the BBC reported that some newspapers claimed the policy amounted to secret justice.", "\"They have argued that naming a suspect who has been arrested can lead to more victims coming forward and that allowing suspects to remain anonymous was making it harder for reporters to find out what police are doing in the public’s name,\" the BBC story says.", "Our ruling", "The Facebook post says a Somali migrant decapitated Emily Jones in front of her parents at a park, and that the media covered up the murder.", "Credible news sources have reported that Jones was fatally stabbed, not decapitated, in front of her parents at a park.", "News reports say the woman arrested at the scene is 30 years old, but police have not released further identifying information pending an investigation, and we didn’t find any news stories reporting on her name, nationality or immigration status. Many news outlets have covered the case in the weeks since the killing and have reported the information that has been made public.", "We rate this Facebook post Mostly False.", "Facebook post, May 12, 2020", "BBC, Emily Jones: Stabbed Bolton girl was ‘light our life’, parents say, March 25, 2020", "Manchester Evening News, Inquest opens into tragic Emily Jones, 7, who was stabbed to death in park, April 2, 2020", "The Guardian, Parents pay tribute to ‘social butterfly’ aged seven stabbed to death, March 25, 2020", "The Sun, ‘We are all heartbroken’: popular schoolgirl, 7, stabbed to death by stranger in park on Mother’s Day was ‘ray of sunshine,’ March 26, 2020", "Evening Standard, School ‘heartbroken’ after Emily Jones was stabbed to death in park on Mother’s Day, April 2, 2020", "Metro, First picture of girl, 7, stabbed to death in park in front of family, March 25, 2020", "Sky News, ‘Our little social butterfly’: Parents’ tribute to girl, 7, stabbed to death in Bolton park, March 25, 2020", "Mirror, Devastated parents’ tribute to girl, 7, stabbed to death in front of them in Bolton park, March 26, 2020", "The Times, Emily Jones, 7, stabbed ‘was light of our lives,’ March 26, 2020", "The Bolton News, Tragic Emily was killed as she played on scooter, inquest hears, April 1, 2020", "Wales Online, Inquest opens into death of girl, 7, stabbed in random Mother’s Day attack at park, April 2, 2020", "Daily Record, ‘Our only child and light of our lives’: Parents’ torment after girl, 7, stabbed to death by stranger, March 25, 2020", "The Scottish Sun, School of seven-year-old girl knifed to death in front of parents raise 12,000 in five days for memorial garden, April 10, 2020", "Daily Star, Girl, 7, stabbed to death in Bolton park was ‘full of joy, love and laughter,’ March 25, 2020", "Tweet, April 4, 2020", "Tweet, April 3, 2020", "BBC, Arrested suspects should retain anonymity, police told, May 20, 2013", "Email interview with Jonathan Bell, press officer, Greater Manchester Police, May 14, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]