["Hillary Clinton is continuing to make an issue of the fact that Donald Trump has refused to release his tax returns, and at the first presidential debate, she suggested that one reason for his reluctance may be that Trump doesn't pay federal taxes.", "\"Maybe he doesn't want the American people, all of you watching tonight, to know that he's paid nothing in federal taxes, because the only years that anybody's ever seen were a couple of years when he had to turn them over to state authorities when he was trying to get a casino license, and they showed he didn't pay any federal income tax,\" she said.", "Trump retorted that not paying taxes \"makes me smart.\"", "In reality, neither Clinton nor Trump have their talking points correct.", "We looked at a nearly identical claim by Clinton previously and found it to be Mostly False.", "The truth is none of the tax returns she is talking about have ever been released, and she's ignoring other returns examined by New Jersey gambling regulators showing that Trump did pay taxes.", "The evidence is in a 1981 report that analyzed Trump's finances as part of his efforts to get a casino license for a proposed casino-hotel complex.", "The report, on Page 33, details Trump's income and federal tax payments for 1975 through 1979.", "The report states that Trump paid federal taxes for three of those five years to the tune of $71,932 on reported income of $219,334. (In current dollars, that would be a $296,121 paid in taxes on $910,319 in reported income.)", "In the final two years he did not pay federal income taxes because, according to tax rules, he lost money each year — more than $3.8 million then, or about $12.8 million today.", "New Jersey's Division of Gaming Enforcement verified his income, losses and deductions. The division said Trump's losses came from the operation of his various properties. But the report offers no specifics.", "We asked both the Clinton and Trump campaigns if they had any additional information since our original check. We didn't hear back.", "Our ruling", "Clinton said, \"The only years that anybody's ever seen\" of Trump’s tax returns \"showed he didn't pay any federal income tax.\"", "Those records, covering five years of returns, report that in three of the five years Trump did pay federal income taxes. In two years he did not. The tax returns themselves remain secret.", "Clinton’s statement contains an element of truth but ignores critical facts that would give a different impression. We rate it Mostly False.", "https://www.sharethefacts.co/share/6adfa4d3-c309-41e1-940d-dd06448c5548", "PolitiFact, \"Hillary Clinton claim about Donald Trump paying no federal taxes ignores the years when he did,\" May 24, 2016", "The Washington Post, \"Trump’s false claim that ‘there’s nothing to learn’ from his tax returns,\" May 12, 2016 and \"Trump once revealed his income tax returns. They showed he didn’t pay a cent,\" May 21, 2016.", "ScribD, \"Report on Donald Trump to Casino Control Commission,\" Oct. 16, 1981", "BLS.gov, \"CPI Inflation Calculator,\" U.S. Bureau of Labor Statistics, accessed Feb. 19, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]