["About this rating", "Hurricane Michael made landfall at Mexico Beach, Florida, on 10 October 2018, slamming the Gulf Coast with winds of up to 155 miles per hour and causing widespread property destruction and power outages, as well as two deaths in Florida and Georgia.", "As Michael weakened into a tropical storm, internet users and reporters shared extraordinary images of the devastation it caused:", "﻿", "Among those images was one viral photograph which purported to show airplanes almost covered in flood waters at Northwest Florida Beaches International Airport:", "The photograph is a fake. It does not show Northwest Florida Beaches International Airport; rather, it was taken from a larger, digitally-edited image created by the artist Nickolay Lamm and used to illustrate the effect that unchecked climate change could have on coastal parts of the United States.", "The simulated photograph was used by the website Climate Central in 2013 with the caption: \"What LaGuardia [New York] could look like at high tide with 25 feet of sea level rise, an amount that would require a worst-case scenario involving melting of large parts of Greenland and Antarctica\":", "The same simulation was shared during Hurricane Harvey in August 2017, with social media users falsely reporting that it showed an airport in Houston, Texas:", "Houston airport is now the new Houston port! pic.twitter.com/JdOr4coqIb", "— isi (@GutierrezIsi) August 28, 2017", "On 11 October 2018, officials at Northwest Florida Beaches International Airport announced that commercial flights had been suspended in and out of the airport but that it was \"operational,\" offering further proof that the viral \"flooded runway\" photograph did not, in fact, show the Panama City airport in the aftermath of Hurricane Michael:", "Reeves, Jay and Brendan Farrington.   \"Hurricane Michael Left Path of Destruction, Isn't Done Yet.\"\r\n    The Associated Press.   11 October 2018.", "Freedman, Andrew.   \"U.S. Airports Face Increasing Threat from Rising Seas.\"\r\n    Climate Central.   17 June 2013.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]