["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "It didn’t take long after the U.S. Supreme Court ruling on the health care reform law for U.S. Sen. Robert Menendez to revive a questionable talking point about the potential savings from the legislation.\n\nIn the hours following the court decision, the Democratic senator claimed health care reform policies will lower the federal deficit by more than $1 trillion over the next 20 years.\n\n\"So the reality is the Congressional Budget Office says we save $250 million over the first 10 years. Over the next 10 years, we save $1.2 trillion in savings in terms of health care,\" Menendez said in a June 28 interview on the Regional News Network’s Richard French Live.\n\nMenendez is correct in his overall point that budget office projections indicate health care reform policies will likely lower federal deficits. But the senator made a couple of mistakes in citing those specific figures, PolitiFact New Jersey found.", "Our PolitiFact colleagues debunked similar claims by other Democrats in 2010, including one from President Barack Obama.\n\nFirst, let’s discuss the projected deficit reduction in the first decade.\n\nThe Affordable Care Act and related legislation contain various provisions that affect federal spending in three ways: some policies increase costs; some policies reduce spending; and others generate additional revenues.\n\nFor the 2012-2021 period, the budget office has projected that there will be more new revenue than new spending, resulting in a net decrease in federal deficits of $210 billion, according to a February 2011 estimate. As of March of this year, that estimate had not been updated.\n\nSo, the senator is clearly wrong to cite projected savings of \"$250 million over the first 10 years.\"\n\nBut Menendez made a larger mistake by suggesting the budget office has projected \"$1.2 trillion in savings\" over the second 10 years.\n\nThe budget office has not projected any specific dollar figures for that period. The uncertainties are too substantial to create such detailed projections, according to the budget office.\n\nThe \"$1.2 trillion\" cited by Menendez is based on the budget office’s estimate that health care reform policies would reduce deficits in that second decade by \"an amount in a broad range around one-half percent of gross domestic product (GDP).\" GDP is a measure of the nation's economy.\n\nHowever, in multiple reports over the last few years, the budget office has cautioned that this long-term estimate carries a \"greater degree of uncertainty.\" That's why a specific dollar figure has not been projected.\n\nIn a December 2009 report, the budget office said: \"A detailed year-by-year projection for years beyond 2019, like those that CBO prepares for the 10-year budget window, would not be meaningful because the uncertainties involved are simply too great.\"\n\nAs the budget office noted in a February 2011 report, calculations for the second decade are based on the assumption that existing provisions remain unchanged, but a number of policies may not be sustainable over a long period of time.\n\n\"Over a longer time span, a wide range of changes could occur—in people’s health, in the sources and extent of their insurance coverage, and in the delivery of medical care—that are very difficult to predict but that could have a significant effect on federal health care spending,\" according to that report.\n\nSo, Menendez’s \"$1.2 trillion in savings\" is not based on an exact dollar figure projected by the budget office, but instead on a percentage of GDP, a rough estimate with a \"greater degree of uncertainty\" attached to it.\n\nIn response to our findings, Menendez spokeswoman Tricia Enright said in an e-mail:\n\n\"CBO was asked by members of Congress to provide the out-year estimates for the health care law and that’s what they did. They said their best estimate was .5% of GDP. If you take that estimate and plug in the numbers so that it’s actually easier to understand, you get approximately $1 trillion. That’s the estimate the Senator has used and it’s the same estimate used by the President’s economic team. It’s the estimate he will continue to use.\"\n\nOur ruling\n\nIn a TV interview, Menendez claimed that, as a result of the national health care reform, \"the Congressional Budget Office says we save $250 million over the first 10 years. Over the next 10 years, we save $1.2 trillion in savings in terms of health care.\"\n\nThe senator’s claims contain an element of truth, which is that the budget office has projected health care reform policies will likely lower federal deficits. But Menendez fumbled by citing those specific figures.\n\nOver the first 10 years, the budget office is projecting a reduction of $210 billion, not the \"$250 million\" cited by Menendez.\n\nAs for whether there will be \"$1.2 trillion in savings\" in the second 10 years, the budget office has not projected any specific dollar figure for that period. Instead, Menendez’s claim is based on a percentage of GDP that's considered by the budget office to be a rough estimate with a \"greater degree of uncertainty.\"\n\nWe rate the statement Mostly False.", "To comment on this ruling, go to NJ.com.", "President Obama's Health Care Act: Full Interview with Senator Robert Menendz, a video posted on YouTube on June 29, 2012\n\nPolitiFact, Health care reform estimates for deficit reduction are not that exact, Feb. 1, 2010\n\nPolitiFact, Pelosi: CBO says health reform bill would cut deficits by $1.2 trillion in second decade, March 18, 2010\n\nPolitiFact Virginia, Bobby Scott says health care reform may cut deficit by $1.2 trillion over 20 years, Nov. 23, 2010\n\nCongressional Budget Office, CBO’s Analysis of the Major Health Care Legislation Enacted in March 2010, March 30, 2011\n\nCongressional Budget Office, Cost Estimate for H.R. 2, Repealing the Job-Killing Health Care Law Act, Feb. 18, 2011\n\nCongressional Budget Office, The Budget and Economic Outlook: Fiscal Years 2012 to 2022, January 2012\n\nCongressional Budget Office, Letter to House Speaker Nancy Pelosi, March 20, 2010\n\nCongressional Budget Office, Patient Protection and Affordable Care Act, Incorporating the Manager's Amendment, Dec. 19, 2009\n\nCongressional Budget Office, Letter to House Speaker Nancy Pelosi, March 18, 2010\n\nWashington Post’s The Fact Checker, ‘Obamacare:’ Twice as much as estimated?, March 27, 2012\n\nOfficial website of U.S. Sen. Robert Menendez, Health Insurance Reform, accessed July 5, 2012\n\nCongressional Budget Office, Updated Estimates for the Insurance Coverage Provisions of the Affordable Care Act, March 2012\n\nFactCheck.org, Health Care Costs Didn’t Double, March 19, 2012\n\nE-mail interview with Tricia Enright, spokeswoman for U.S. Sen. Robert Menendez, July 5-10, 2012\n\nCongressional Budget Office, Letter to Senate Majority Leader Harry Reid, Dec. 19, 2009", "Congressional Budget Office, Uncertainty in Estimates for Health Care Legislation, March 19, 2010", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]