["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "In August, we debunked a claim that Olive Garden employees were banned from wearing face coverings depicting the American flag while Black Lives Matter masks were OK.", "A recent Facebook post makes a similar claim about Kroger grocery stores.", "\"Kroger Corporate says employees can not wear flag masks but they can wear BLM masks!\" the Sept. 5 post says. \"Good bye Kroger! Boycott. Boycott boycott.", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "In a statement, Kroger told us that the Facebook post isn’t true.", "Rather, employees are prohibited from wearing uniforms or masks with any visible pictures, logos, words or abbreviations, according to the company.", "\"Our uniform policies have not changed,\" Kroger said in the statement, but the company has produced wristbands that were distributed to employees in July to represent \"our commitment to Standing Together with our Black associates, customers and communities against racism in all forms.\" Another wristband represents the company’s values: integrity, honesty, diversity, inclusion, safety and respect.", "\"Many associates have expressed a desire to stand together with their communities and show their support through their clothing, facial coverings and accessories,\" the company said. \"While we are not adjusting our existing dress code, rules or policies, we acknowledge our associates’ feedback and want all to feel supported and heard.\"", "On Aug. 31, some Kroger employees at a store in Michigan said they were told to cover up their Black Lives Matter shirts and prohibited from wearing Black Lives Matter masks, a Fox TV affiliate reported.", "\"Management came up and told me they support the cause but I need to put an apron on top of that shirt,\" the station quoted an employee as saying.", "We rate this Facebook post False.", "Facebook posts, Sept. 5, 2020", "PolitiFact, Olive Garden hasn’t banned American flag masks, Sept. 10, 2020", "Fox 2 Detroit, Bloomfield Kroger employees say they were not allowed to wear Black Lives Matter shirts, masks, Aug. 31, 2020", "Chang.org, Let us wear BLM masks at work! visited Sept. 14, 2020", "Statement from Kroger, Sept. 14, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]