["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "During a wide-ranging interview at Austin's KLRU last month, Texas Tribune editor Evan Smith talked health care with Howard Dean, a physician and the former chairman of the Democratic National Committee.", "\"Barack Obama's health care bill is nothing new,\" Dean said during the Nov. 12 interview. \"Mitt Romney signed one just like it four years before.\"", "That's a view Dean, the former governor of Vermont, shares with Texas Gov. Rick Perry, though their opinions of said plans diverge. Speaking at the Heritage Foundation Nov. 8, Perry said: \"The health care plan out of Massachusetts, I would suggest to you, is too much like the health care plan passed out of Washington.\"", "We wondered whether Dean correctly compared the 2010 federal overhaul to Massachusetts' 2006 health care law.", "Karen Finney, a Dean spokeswoman, shared two news articles to support his statement.", "According to an April 1 story posted on Talking Points Memo, during an appearance at Emory University in March, \"Romney acknowledged that there are 'a number of similarities'\" between the Massachusetts health care plan and the legislation Obama signed into law March 23. \"If you lose a job or change a job, you won't lose your insurance,\" the Atlanta Journal-Constitution quoted Romney saying. \"Everybody is able to keep insurance throughout their life. It's not taken away from them... you can't be canceled if you have a pre-existing condition or if you become ill once you're insured. So in that respect, it's very similar.\"", "According to a March 31 Christian Science-Monitor news story, Jonathan Gruber, a Massachusetts Institute of Technology economist who advised Obama and Romney on health-insurance programs, told the Boston Globe that Romney \"is in many ways the intellectual father of national reform.\"", "The plan Romney signed included an expansion of the state's Medicaid program to children in households whose incomes are less than or equal to 300 percent of the federal poverty level. The plan also subsidized coverage for eligible residents and created an exchange system, a state-overseen marketplace enabling individuals and small businesses to purchase health coverage. Also, the plan requires most adults to have coverage at the risk of facing penalties for not complying.", "The 2010 federal law has similar features. It likewise expands Medicaid (to all individuals whose incomes are less than or equal to 133 percent of the federal poverty level), and makes government subsidies available to low-income individuals and families to help them pay health insurance premiums. The federal law also creates voluntary exchanges that individuals and small businesses can use to purchase health insurance. And it requires most folks to purchase coverage, though the plans' penalty structures differ.", "In February, PolitiFact National rated Mostly True economist Paul Krugman's charge that the health care bill that passed the Senate \"is identical to the Massachusetts health care plan — the same thing.\"", "Except for some modifications made by the House (such as implementation dates and how the plan is funded), the legislation that Obama signed into law was basically the bill that passed the Senate. Other similarities between the federal law and the Massachusetts plan:", "-In Massachusetts, companies with more than 10 employees must offer health insurance or pay a penalty. The federal approach imposes the requirement on companies with 50 employees or more.", "-Both plans restructure the insurance market. In Massachusetts, the reform law merged the individual and small-group markets (that is, the market serving individuals not covered by their employer's plan and the market serving smaller employers). The federal law placed new regulations on those two markets but kept them separate.", "-In Massachusetts, dependents up to age 25 can be covered on their parents' plan. The federal law allows dependent coverage up to age 26. And young adults in Massachusetts from age 19 to 26 can purchase a special lower-cost, lower-benefit plan through the exchange; the federal law creates a similar type of plan in the exchange for those up to age 30 who cannot find affordable coverage.", "-Both plans put limits on the ratio between the highest and lowest premiums, but in different ways. For the most part in Massachusetts, the highest premiums can only cost twice as much as the lowest premiums. The federal plan allows premiums in the individual and small-group market and on the exchanges to vary based on age, geographic area, family composition and tobacco use.", "And the differences?", "Financing and cost containment. The Massachusetts plan has been criticized for its lack of cost-containment provisions, while the federal law makes changes to Medicare, health insurance that the government offers to senior citizens, that are intended to lower program costs. (Being that Medicare is a federal program, the Massachusetts plan does not address it.)", "Both plans are financed in part by revenue generated from the individual and employer mandates. But the Massachusetts plan's financing is heavily dependent on leveraging federal matching funds, while the federal plan taps cost savings from levying new taxes on, for example, high-cost health care plans.", "Upshot: the federal law is similar to the Massachusetts law, but not an exact copy. We rate Dean's statement as Mostly True.", "Overheard with Evan Smith, Howard Dean interview, Nov. 12, 2010", "Talking Points Memo, Romney: There are 'a number of similarities between my health care plan and Obama's, April 1, 2010", "The Christian Science Monitor, Who is the father of health care reform: Obama or Mitt Romney?, March 31, 2010", "Boston Globe, Editorial: Stand by your plan, Nov. 29, 2010", "Politico, Rick Perry knocks George W. Bush, Mitt Romney for 'big government' policies, Nov. 8, 2010", "The National Review, A campaign begins today, March 22, 2010", "PolitiFact National, Krugman calls Senate health care bill similar to law in Massachusetts, Feb. 4, 2010", "PolitiFact National, Obama says Heritage Foundation is source of health exchange idea, April 1, 2010", "PolitiFact National, Perry says uninsured number in Bay State \"about the same\" since health care reform, April 5, 2010", "The Kaiser Family Foundation, Side-by-side comparison of major health reform proposals, accessed Dec. 1, 2010", "The Washington Post, What's in the bill, accessed Dec. 1, 2010", "E-mail interview with Karen Finney, spokeswoman for Gov. Howard Dean, Nov. 29, 2010", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]