["Only a few bottles of hand sanitizers remain on the shelves at a Walgreen Pharmacy on Feb. 28, 2020, in Miami Shores, Fla. (AP)", "Health officials recommend the use of hand sanitizer to kill the coronavirus.", "Although it is not effective against all viruses, hand sanitizers with high alcohol content have proven effective against human coronaviruses.", "Health officials say one of the best ways Americans can prevent the spread of the 2019 coronavirus is to clean their hands. But should they use hand sanitizer?", "One popular image on Facebook says no.", "\"Hand sanitizer is anti-bacterial. The coronavirus is a virus,\" reads the post, which is a screenshot of a March 1 tweet. \"A bacteria and a virus is not (sic) the same. Wash your hands. Sanitizer will do nothing for the coronavirus.\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "(Screenshot from Facebook)", "The post is wrong — health officials recommend the use of hand sanitizer to kill the coronavirus, known officially as COVID-19. The original Twitter user clarified that in a follow-up tweet, but the context was lost on Facebook.", "On its list of ways to prevent coronavirus infection, the Centers for Disease Control and Prevention says to \"wash your hands often with soap and water for at least 20 seconds, especially after going to the bathroom; before eating; and after blowing your nose, coughing, or sneezing.\" If soap and water are not accessible, the CDC recommends using hand sanitizer with at least 60% alcohol.", "Although hand sanitizers are not effective against all viruses, the ones with high alcohol content have proven effective against some. Several studies indicate that alcohol-based sanitizers are effective against \"enveloped viruses,\" which include human coronaviruses.", "Since its outbreak in Wuhan, China, in December, the 2019 coronavirus has infected more than 88,000 people in 64 countries. In the United States, there have been 43 confirmed cases and six deaths, as of March 2, not including those repatriated to the country.", "So continue washing your hands, and using hand sanitizer with a high alcohol content when you aren’t near soap and water. The post telling you hand sanitizer will \"do nothing\" to stop the coronavirus is wrong. We rate it False.", "Centers for Disease Control and Prevention, Coronavirus Disease 2019 (COVID-19): Prevention & Treatment, accessed March 2, 2020", "Centers for Disease Control and Prevention, Show Me the Science – When & How to Use Hand Sanitizer in Community Settings, accessed March 2, 2020", "Facebook post, March 2, 2020", "NBC News, \"Main focus for preventing coronavirus spread should be hand hygiene, not face masks,\" Feb. 28, 2020", "The Journal of Infectious Diseases, \"Virucidal Activity of World Health Organization–Recommended Formulations Against Enveloped Viruses, Including Zika, Ebola, and Emerging Coronaviruses,\" Feb. 1, 2017", "The New York Times, \"F.D.A. Warns Purell to Stop Claiming It Can Prevent Ebola or Flu,\" Jan. 28, 2020", "Tweet, March 1, 2020", "Tweet, March 1, 2020", "The Washington Post, \"Live updates: Washington state announces 4 more coronavirus deaths, bringing virus death toll in U.S. to 6, officials say,\" March 2, 2020", "World Health Organization, Coronavirus disease 2019 (COVID-19) Situation Report – 42, March 2, 2020", "World Health Organization, \"WHO Guidelines on Hand Hygiene in Health Care,\" 2009", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]