["About this rating", "On May 11, 2020, Bustatroll.org published an article positing that U.S. House Speaker Nancy Pelosi's daughters had been arrested after breaking into a liquor store for quarantine supplies during the COVID-19 pandemic:", "Pelosi’s Daughters Arrested Breaking Into Liquor Store For ‘Quarantine Supplies’", "The apples don’t fall far from the tree, they say, and nowhere is it more obvious than in the case of Nancy Pelosi‘s daughters. Often in trouble, they have lately shown that they share the trait most commonly associated with their mother…..a hopeless addiction to alcohol.", "Both Melissa, 21, and Daphne, 19, were arrested this past weekend in San Francisco, California for breaking and entering. Officers were alerted to their crime by a silent alarm at “This Is The Way To Liquor,” a liquor store close to their home that had recently decided to temporarily close due to slow sales during the state’s lockdown.", "This item was not a factual recounting of real-life events. The article originated with a website that describes its output as being humorous or satirical in nature, as follows:", "Everything on this website is fiction. It is not a lie and it is not fake news because it is not real. If you believe that it is real, you should have your head examined. Any similarities between this site’s pure fantasy and actual people, places, and events are purely coincidental and all images should be considered altered and satirical. See above if you’re still having an issue with that satire thing.", "It should be noted that Nancy Pelosi has one son and four daughters, but none of Pelosi's children's names are Melissa or Daphne, as stated by Bustatroll.org. The image included in this article actually shows two entirely different women whose names are Michaella McCollum and Melissa Reid. The duo became known as the \"Peru Two\" after they were arrested for drug smuggling in 2013:", "For background, here is why we sometimes write about satire/humor.", "Bustatroll.org.   \"Pelosi’s Daughters Arrested Breaking Into Liquor Store For ‘Quarantine Supplies.’\"\r\n    11 May 2020.", "Hanlon, Martina.   \"Peru Two Get Six Years and Eight Months for Drug Smuggling.\"\r\n    Irish Times.   17 December 2013.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]