["About this rating", "The hole shown in the poster could plausibly represent the diameter of the highly destructive temporary cavity left in a person's body by a high-velocity AR-15 round.", "The hole shown in the poster is too big to represent an AR-15 entrance wound; even an exit wound is unlikely to be as large as the shape shown on the poster.", "Gun violence and gun control have been the subject of renewed debate since the February 2018 shooting at Marjory Stoneman Douglas High School in Parkland, Florida.", "In particular, those in favor of enhanced regulation of gun ownership have focused on the AR-15 semi-automatic rifle, which has been used in a number of high-profile mass shootings in recent years, including the massacre in Parkland. In June 2018, a dispute arose online over the physical impact and damage that can be caused by a bullet fired from an AR-15.", "]Facebook user M.A. Rothman posted two photographs side by side: One featured a poster which claimed to show \"the size of a hole used by an AR-15,\" and the other showed what Rothman said was the true (smaller) dimensions of marks left by an AR-15 rifle after target practice:", "The one on the right is my son after target practice with an AR-15. The one on the left is a lying moron who doesn’t know the first thing about guns or our rights as citizens.", "It's not clear what are the precise origins of the photograph on the left, or where it was taken. The poster has become the subject of ridicule and anger among some gun rights advocates online, prompting parodies and responses such as this one, which was shared more than 50,000 times on Facebook.", "In brief, both sides in this dispute are right in some ways and wrong in others, and each photograph offers an incomplete examination of the kind of damage and impact that can be caused by gun shots.", "At the heart of the issue is the question of what is meant by the \"hole made by an AR-15.\" There are basically three possibilities: the entrance wound, the exit wound, and the cavity caused by a bullet as travels through a person's body. There are no graphic images in this article, but we do at times get into descriptions of the damage caused by gun shots that some readers might find upsetting.", "The entrance wound", "The \"black hole\" shown in the poster is vastly too large to represent an AR-15 entrance wound. Jay Wachtel, a retired police sergeant and special agent in the Bureau of Alcohol, Tobacco, and Firearms, and a former criminal justice lecturer at California State University, summed it up in an e-mail: \"The entrance wound for any firearm projectile is essentially the bullet diameter.\"", "Typically, AR-15 rifles are loaded with .223 Remington cartridges, which are housed in bullets with a diameter of 5.7 millimetres. So a round fired correctly from a functioning AR-15 should create an entrance wound (or target practice marking) just under a quarter-inch in diameter.", "This can be seen in many AR-15 target practice videos and photographs available online, and is accurately reflected in the photograph posted by Rothman on Facebook.", "The internal cavity", "A bullet causes its most significant damage inside a person's body, destroying the blood vessels, tissue and bone in its immediate path (\"permanent cavitation\"), but also creating a kind of shockwave outwards into the tissue that surrounds this path. This is known as \"temporary cavitation,\" and when a bullet travels at higher velocity, the damage caused by this type of cavitation becomes exponentially greater, because the surrounding tissue struggles to absorb the kinetic energy given off by a bullet traveling at a higher velocity.", "The design of bullets also has a bearing on temporary cavitation (for example, hollow point rounds), but high velocity is a major reason why rifles such as the AR-15 can wreak such catastrophic damage to internal organs, and cause fatal bleeding. This mechanism is explained by the ammunition manufacturer Hornady:", "In essence, a bullet going through soft tissue has the same effect as dropping a stone into a pail of water - if the stone (bullet) enters the water slowly, the water (tissue) displacement is so gradual that is has little effect on the surrounding molecules. If the stone (bullet) enters the water (tissue) with a lot of momentum, however, the surrounding molecules have to act a lot more quickly and violently, resulting in a splash (temporary cavity). Temporary cavitation is important because it can be a tremendous wounding mechanism.", "Heather Sher, a Fort Lauderdale-based radiologist who examined CT scans from some of the victims of the February 2018 Parkland school shooting, wrote about the effects of AR-15 rounds for the Atlantic:", "Routine handgun injuries leave entry and exit wounds and linear tracks through the victim’s body that are roughly the size of the bullet. If the bullet does not directly hit something crucial like the heart or the aorta, and the victim does not bleed to death before being transported to our care at the trauma center, chances are that we can save him.", "The bullets fired by an AR-15 are different: They travel at a higher velocity and are far more lethal than routine bullets fired from a handgun. The damage they cause is a function of the energy they impart as they pass through the body. A typical AR-15 bullet leaves the barrel traveling almost three times faster than—and imparting more than three times the energy of—a typical 9mm bullet from a handgun.", "...The high-velocity bullet causes a swath of tissue damage that extends several inches from its path. It does not have to actually hit an artery to damage it and cause catastrophic bleeding.", "This video illustrates temporary cavitation in a ballistic gelatin test, using the 5.56x45mm cartridge frequently loaded in AR-15 rifles.", "﻿", "The \"hole\" illustrated in the poster could plausibly represent the diameter of the temporary cavitation left behind by an AR-15 rifle round traveling through the human body. That is to say, the tract of potentially catastrophic damage done to blood vessels and tissue could be as tall and wide as the \"hole\" shown in the poster.", "The exit wound", "The black hole illustrated on the poster is unlikely to be representative of the size of an AR-15 exit wound — but it is possible. While entrance wounds typically have the same dimensions as the bullet that causes them, the size and shape of exit wounds can vary more.", "Dr. Sydney Vail is a trauma surgeon with the Maricopa Integrated Health System in Phoenix, Arizona, and is an expert in treating gunshot trauma. He explained to us some of the factors that determine the dimensions of exit wounds:", "If the .223 round from an AR-15 strikes the human body and only hits skin and muscle over a short distance, there is a chance the exit will look the same as the entrance or slightly larger. If the bullet yaws [turns left or right] there is a larger surface area to exit the skin and a slightly larger hole.", "...The reason large holes or large exit wounds occur is usually the bullet hits bone, which then causes more damage and a greater surface area trying to exit the body. If the bullet is in the body a longer period of time -- meaning [it travels] through more mass -- then the body is absorbing a more maximal amount of kinetic energy, and the damage will definitely be more severe internally... To make big ugly holes as exit wounds means more mass has to exit the body than just the bullet.", "Dr. Judy Melinek, a forensic pathologist from San Francisco, California, explained to us the circumstances in which an AR-15 might leave behind an unusually large exit wound. By email, she told us:", "An AR-15 round fired from contact range against the tightly stretched skin over the skull is more likely to cause a larger entrance wound because of gas entering in along with the bullet. The wound would be star shaped from splitting of the skin by the gas, not round as in the poster. An exceptionally large exit wound could also occur if fragmented bone and tissue exited along with the bullet. An AR-15 round fired through a person’s head, for example, could take fragmented skull and damaged brain matter with it, and this might be expected to be expelled through a larger exit wound.", "In her assessment, an exit wound the size of the “black hole” shown in the poster could potentially be caused by an AR-15 round, but it is not likely, and certainly not typical. Melinek told us that in her experience, AR-15 rounds can completely fragment in the body and may not exit at all.", "Michael Knox is a Florida-based forensic consultant who conducts ballistics testing and crime scene reconstructions, and is regularly called upon to give expert testimony in criminal trials. His assessment of the \"black hole\" on the poster was blunt. By e-mail, he told us: \"The exit hole from an AR-15 round would not be that big.\"", "Conclusion", "The photographs shown in the viral Facebook post are a useful conversation-starter, but comparing them doesn't serve readers well as an explanation of the physical impact of gun shots in general, or high-velocity AR-15 rounds in particular.", "Based on the assessments shared with us by the experts we consulted — a forensic pathologist, a trauma surgeon, a former federal agent and criminal justice lecturer, and a forensic consultant and ballistics expert — we can say that the entrance wound from an AR-15 round could not be anywhere near that large; however, the tract of catastrophic damage torn through a person's internal blood vessels, tissue, and bone by a high-velocity AR-15 round could plausibly have around the same diameter as the \"black hole\" in the poster.", "Finally, it is unlikely that an AR-15 exit wound would have the same dimensions as the \"black hole\" shown in the poster, but it is possible. The bullet would have to travel through the body in such a way that it fragmented bone and tissue to the extent that all that matter was forced out of the body along with the bullet itself, creating an exceptionally large exit wound.", "Yablon, Alex.  \"The Simple Physics That Makes Some Bullets Deadlier Than Others.\"\r\n  The Trace.  21 June 2017.", "Sher, Heather.  \"What I Saw Treating the Victims From Parkland Should Change the Debate on Guns.\"\r\n  The Atlantic.  22 February 2018.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]