["About this rating", "Was Sen. Chuck Schumer, D-N.Y., once a client of the notorious \"Hollywood Madam,\" Heidi Fleiss, who ran a prostitution ring in Los Angeles catering to the rich and powerful during the early 1990s?", "Readers started posing that question to Snopes in January 2019, in the midst of a resurgence of the then-year-old rumor on social media. Judging from the Facebook and Twitter posts we were alerted to, one might easily suppose the answer was settled fact.", "For example, this Facebook message was posted on Jan. 5:", "This meme was tweeted on Jan. 22:", "And here's a tweet from Jan. 23:", "Heidi Fleiss's \"black book\" of clients (actually a set of Gucci day planners with red bindings) was said to contain the names and phone numbers of some of the biggest celebrities in Hollywood, not to mention prominent businessmen and politicians. But Fleiss was fiercely protective of her client list and to this day, according to press reports, had refused to make its contents public. Someone claiming to have possession of it (possibly having stolen it from an FBI evidence room) put it up for auction on eBay in 2015, but the offering was mysteriously withdrawn a few days later.", "In 1995, a prostitute who worked for Fleiss named two of her clients, actor Charlie Sheen (which Sheen himself confirmed) and former Denver Nuggets owner Sidney Shlenker (who also admitted in court to being a client of Fleiss). Various other famous names have come up in supposed \"scoops\" published by less-than-reliable sources, but to date the roster of confirmed Fleiss clients remains minuscule.", "Notably, the name of Sen. Chuck Schumer has appeared in none of those stories. We searched media archives going back to 1990 and were unable to locate a single instance of Schumer's and Fleiss's names coming up in the same article. In point of fact, their names weren't publicly linked in any context until December 2017, when posts similar to the ones reproduced above first began appearing on social media.", "The earliest such post we've found was a tweet dated Dec. 9, 2017:", "The tweeter didn't say where that information came from.", "The next time we found Schumer and Fleiss's names in such close proximity was 10 days later in online discussions following a so-called \"Q drop\" -- a post on the internet troll message board 8chan by the enigmatic \"Q,\" an entity believed by his (or her, or their) followers to be a highly-placed member of the Trump administration who purports to share earth-shattering insights into the president's battle against \"deep state\" corruption.", "Also described as \"bread crumbs,\" the posts are intentionally cryptic and understood by Q's fanatical fan base (collectively known as \"QAnon\") to be hints for further \"research\" as well as inspiration for pro-Trump propaganda to be disseminated on social media. Taken as a whole, the voluminous output of Q and QAnon is best described as a chaotic assemblage of disinformation and conspiracy theories touching on topics ranging from alleged acts of deep-state treason by Trump's enemies in the government and media, to the exposure of alleged sex trafficking and pedophile rings operated by and for the so-called \"Washington elite\" (basically, everyone in D.C. other than President Trump and his loyalists). Q's predictions and pronouncements have proved to be off the mark and flat out false more times than anyone can count, but in every case QAnon followers have either ignored these outcomes or found ways to rationalize them away and moved on.", "The Q drop in question doesn't even mention Chuck Schumer by name, interestingly enough. Instead, the initials \"CS\" are repeated three times in a list pairing the initials with the names Soros (George, presumably), Playboy (the magazine, no doubt), and Heidi Fleiss (the one and only Hollywood Madam):", "We note that in the discussion that immediately followed among 8chan members, several articles about Heidi Fleiss and her prostitution ring were posted, none of which corroborated any link between Fleiss and Chuck Schumer. Nevertheless, the respondents to Q's post dutifully filled in the blanks, interpreting \"CS\" to mean \"Chuck Schumer\" and \"blackmail\" to mean that Fleiss (or someone) must have compromising information about the senator. The content of anti-Schumer memes to come was thus spelled out and concretized in real time.", "\"Chuck Schumer was set up by playboy/heidi fleiss in service of the clowns,\" wrote one follower. \"Is now being blackmailed by them. Wow.\"", "\"So meme-o-licious,\" wrote another.", "Less than 10 minutes later, the first Facebook-ready meme had already been uploaded to 8chan:", "This and similar memes meme appeared amidst a flurry of posts on both Facebook and Twitter around that time, echoing the 8chan users' assertion of a direct link between Fleiss and Schumer. This specimen with #QAnon and #MAGA hashtags was tweeted on Dec. 19, 2017, the same day as the Q drop:", "As usual, some people who shared the rumor couldn't resist amplifying the details. In the following tweet, for example, the user alleged that Schumer and Fleiss were somehow involved in the trafficking and ritual abuse of children:", "And the March 2018 tweet below explicitly linked Schumer and Fleiss to the hashtag \"#PizzaGate,\" which referred to a discredited hoax/conspiracy theory alleging that the Clintons and other Democratic Party luminaries operated a pedophile ring out of a family pizza parlor in Washington, D.C. (The shameless promotion of that hoax on social media and conspiracist websites ultimately led to shots being fired inside the restaurant.):", "Since then, the rumor has continued to circulate on social media at infrequent intervals, often in meme form. As we noted at the top of this article, the frequency of those posts picked up again in January 2019, perhaps as part of a general propaganda effort against Democratic congressional leaders as the appropriations battle over funding for Trump's border wall heated up in the midst of the longest U.S. government shutdown ever.", "Our research into this topic spanned 30 years of published materials, yet we found zero evidence to support the assertion that Sen. Chuck Schumer ever patronized Fleiss's Hollywood prostitution ring, or was connected to her in any significant way. Indeed, we found no evidence that Schumer was even accused of such a thing prior to the rumor's online debut in December 2017.", "Abramovitch, Seth.   \"Heidi Fleiss Reflects on 25th Anniversary of Her Arrest, Ex Tom Sizemore and What Charlie Sheen Really Spent on Girls.\"\r\n    The Hollywood Reporter.   7 June 2018.", "Bonisteel, Sara.   \"'Hollywood Madam' Heidi Fleiss: Client 9 Is an Arrogant Jerk.\"\r\n    Fox News.   11 March 2008.", "Friend, David.   \"The Rise and Fall of Heidi Fleiss, Hollywood's Most Notorious Madam.\"\r\n    Vice.   29 December 2017.", "Helling, Steve.   \"How 'Hollywood Madam' Heidi Fleiss 'Lost Interest in the Sex Business.'\"\r\n    People.   27 October 2017.", "Hirschberg, Lynn.   \"Heidi Does Hollywood.\"\r\n    Vanity Fair.   February 1994.", "Hubler, Shawn and James Baters.   \"Heidi's Arrest Is the Talk of Tinseltown: Vice: Celebrities Are Rushing to Help or Distance Themselves from Alleged Madam to the Stars.\"\r\n    Los Angeles Times.   1 August 1993.", "Jagannathan, Meera.   \"Former 'Hollywood Madam' Heidi Fleiss' Infamous Black Book of Celebrities for Sale on eBay: Report.\"\r\n    [New York] Daily News.   19 September 2015.", "May, Ashley.   \"QAnon: The Conspiracy Theory Explained, After Q Posters Spotted at Trump's Florida Rally.\"\r\n    USA Today.   1 August 2018.", "Associated Press.   \"Prostitute Names Celebrity Clients.\"\r\n    13 July 1995.", "Newsweek.   \"The Heidi Chronicles.\"\r\n    15 August 1993.", "Radar Online.   \"Revealed for the First Time Ever: The A-List Stars in Notorious Madam's Black Book.\"\r\n    1 June 2016.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]