["The video was published here on Facebook on August 16, 2020. It has been viewed more than 3,700 times.", "The three-minute, 29-second footage shows police in riot gear at a standoff with armed men on a street.", "The post’s Hindi caption translates to English as: “The Hindus are sleeping and [Muslims] are doing their jobs in Bangalore. Look at these police officers, imagine what could happen to you. We should unite so that we can answer bricks with stones.”", "The posts circulated online after days of deadly violence between Hindus and Muslims in Bangalore, capital of Karnataka state, in southern India, in August 2020, sparked by a “derogatory” Facebook post about the Prophet Mohammed. Here is an AFP report on the clashes.", "The video has been viewed more than 87,000 times after it was shared here, here and here on Facebook, alongside a similar claim.", "However, the claim is false.", "A combined Google reverse image and keyword search found a shorter version of the video in the misleading post published here on Twitter by Indian news agency ANI on July 19, 2020.", "#WATCH West Bengal: Clash breaks out between security personnel and locals, during the protest against an alleged gang-rape & murder of a girl in Kalagachh in Uttar Dinajpur. Security forces use tear gas shells to disperse the protestors. pic.twitter.com/aGe3CAo6P9", "The tweet reads: “#WATCH West Bengal: Clash breaks out between security personnel and locals, during the protest against an alleged gang-rape & murder of a girl in Kalagachh in Uttar Dinajpur. Security forces use tear gas shells to disperse the protestors.”", "West Bengal is a state in eastern India.", "Below is a screenshot comparison of the video in the misleading post (L) and the ANI video (R):", "Protests in West Bengal were also reported on by other local media in July 2020, including the News18 here, Hindustan Times here and NDTV here.", "Bengal police also published a series of tweets about the protest here on July 19, 2020.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]