["While Missouri’s stay-at-home order has expired, cases have been closely monitored to see whether the state is flattening the curve. Some cities, like Columbia and St. Louis, have extended their stay-at-home regulations.", "In a reflection of how the state has been responding to the pandemic, state House Rep. Louis Riggs, R-Hannibal, said on April 21: \"Thankfully, we have seen success to date, as nearly half of our counties have not reported positive cases.\"", "Riggs’ estimate was more than a little off.", "Data from the Missouri Department of Health and Senior Services on that day show 20 counties without any positive cases, or 18% of 114 counties. The state passed the halfway mark three weeks earlier, on March 30.", "Riggs admitted that his error resulted from a quick glance over the department’s map showing the breakdown of cases by county. If a county has between one and six cases it has a light tan color, easy to confuse with the white color of the counties without any cases.", "Riggs said what he should have said was, \"nearly 20% with zero cases and half with less than 10,\" which would be accurate.", "As of May 11, 15 counties have not reported any cases of COVID-19.", "Riggs said on April 21, \"nearly half of our counties have not reported positive cases.\" Half would be a sharp rounding up from 18%.", "Because Riggs’ estimate included counties that did not fall into the correct category we rate his claim False.", "The Missouri Times, \"Opinion: Pandemics and Freedom — finding a balance,\" April 21, 2020", "Missouri Department of Health and Senior Services, \"COVID-19 Outbreak,\" March 30, 2020", "Missouri Department of Health and Senior Services, \"COVID-19 Outbreak,\" March 31, 2020", "Missouri Department of Health and Senior Services, \"COVID-19 Outbreak,\" Accessed May 5, 2020", "Missouri Governor, \"Governor Parson Announces First Phase of \"Show Me Strong Recovery\" Plan to Begin May 4,\" April, 27", "Email exchange with Louis Riggs, May 4-5, 2020", "Email exchange with Lisa Cox for the Department of Health and Senior Services, May 4", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]