["About this rating", "In January 2016, a Facebook trend most commonly referenced as \"Be Like Bill\" swept the social network. During that time, users initially posted comics wherein a character named \"Bill\" served as a reinforcer of social media etiquette, before \"Be Like Bill\" generators enabled users to create personalized versions of the meme:", "As is often the case with items like \"Be Like Bill\" that appear seemingly from the ether and go Facebook-wide, it wasn't long before folks became suspicious of this Bill character and his purpose on their News Feeds. Soon after Bill became the meme of the day, a backlash against the meme was started: one that first simply decried the \"scolding\" nature of the trend, then followed up with rumors that the ubiquitous comic was a vector for malware, information theft, or other undesirable outcomes:", "Bill proved so popular and omnipresent that multiple local news outlets carried reports about the potential dangers of creating a \"Be Like Bill\" meme. Missouri TV station KFVS, Kansas City station KCTV (clip below), and Washington, D.C., station WTTG ran some concern-generating coverage about the specific comic, typically lumping it into the general category of \"clickbait\" and associating it with the risk of all unvetted apps:", "It's known as 'clickbait', and if you haven't read the terms and conditions on the creator's website, the details may shock you.", "The company originally said in its terms of privacy, \"You will allow us to use, edit your content with our service permanently, no limit and no recover.\"", "KFVS-TV also says, in some cases, content can contain viruses that can damage your computer, use your Facebook profile in ways you might not know, or even attempt to steal your credit card or bank account numbers.", "KCTV5", "As the above-quoted material stated, Facebook has indeed presented a handy way for bad actors to engage in all sorts of unpleasant activities using compelling content. However, the \"in some cases\" outcomes described apply to malicious apps in general and not specifically to any known vulnerabilities linked to the \"Be Like Bill\" meme.", "Many articles cited extant Better Business Bureau warnings about rogue apps that antedated \"Be Like Bill\" and referenced \"clickbait,\" but the term was applied exceptionally broadly and not specifically to malware. In short, whether an item is clickbait itself has no bearing on its potential to cause harm to computers or accounts, and plenty of clickbait exists just to drive traffic to various web sites.", "Of additional interest (in bold) was a widely-reproduced excerpt from the Terms of Service of publisher Blobla's (who offered a mechanism for customizing \"Be Like Bob\" memes) that purportedly stated end users agreed to \"allow [Blobla] to use, edit your content with our service permanently, no limit and no recover.\" We were unable to verify such language ever appeared in the agreement in question, and no such wording was in the their agreement as of 27 January 2016.", "On 27 January 2016, Chicago station WMAQ published an article which reported that the Better Business Bureau (BBB) didn't suggest \"Be Like Bill\" posed any specific threat at all to social media users and added that the President and CEO of the Better Business Bureau of Chicago and Northern Illinois Steve Bernas had confirmed only that the BBB was looking into the meme (and keeping an eye out for impostors).", "According to the outlet, Blobla clarified that the generator didn't require Facebook authorizations of the sort generally associated with malware or rogue apps:", "However, the Better Business Bureau has not yet definitely ruled whether the generated memes pose a risk to you or your computer.", "The sensation's creator, Bloba, on the other hand says they don't collect any data from users and their terms are the same as any others you see on Facebook.", "\"First, our game Be Like Bill doesn't require users to authorize a Facebook app,\" a spokesperson for Bloba wrote in response. \"Of course if users want to share the results to Facebook, they must be logged in Facebook. However we use Facebook share dialog for users to share their results. It's a very common ... This doesn't allow us to collect any data from user's Facebook account.\"", "Blobla's creators also explained that the now-elided, widely-cited verbiage (\"permanently, no limit and no recover\") was poorly composed and pertained to unrelated functions which might have ended up on their web site:", "\"Second, we do not store any information of users on our servers, as stated in our ToS,\" Bloba continued. \"Third, the Terms about our right to users' content is about posts on our website (a post may be a game like Be Like Bill, or a quiz, a video...). Because our website has a function for normal users to create a post in other languages. We have removed that term to avoid misunderstanding.\"", "On 29 January 2016, BBB communications director Katherine Hutt clarified the bureau's stance on \"Be Like Bill,\" due to the multiple news reports conflating their earlier \"clickbait\" warnings with that particular meme and generator:", "We don't issue warnings about a specific company without investigating first.", "Finally, outlets devoted to more detailed reporting on online security (such as Sophos' Naked Security blog) haven't issued any warnings about \"Be Like Bill\" or the popular comic generator. No widespread reports of adverse outcomes have substantiated news affiliate speculation, and the bulk of \"Be Like Bill\"-themed reports focused on the general ability for malware to spread through apps, not any reports definitively (or anecdotally) related to that meme specifically. While users might tire of seeing Bill across their feeds, he doesn't pose a threat to anything more than annoyance-free browsing.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]