["A conservative group continues to use a two-year-old debunked claim that Democratic Colorado state Senate candidate Rachel Zenzinger once voted to use taxpayer money to take a trip China.", "PolitiFact Colorado in July rated a similar mailer claim, by the group Colorado Citizens for Accountable Government, Pants On Fire.", "On Oct. 19, Zenzinger said, \"Enough!\" She filed a complaint with the Jefferson County District Attorney’s Office accusing the group of violating Colorado election laws by circulating a mailer containing a \"false statement designed to affect the vote\" in the election for state Senate District 19, which includes Denver suburbs Arvada and Westminster. A conviction of the misdemeanor offense carries a potential county jail sentence as well as a fine.", "Zenzinger’s complaint focuses on a flier mailed to voters on Oct. 14 by the group. The mailer states: \"When Rachel Zenzinger was on the Arvada City Council, she voted to spend taxpayer funds for a junket to China. She wanted taxpayers to pay the bill for her airfare, lodging, transportation and food.\"", "The mailer clearly gives the impression that not only did Zenzinger vote to take a taxpayer-funded trip, but she went on the trip to China, too. In a mailer photograph, the group inserted a traditional Vietnamese bamboo hat on Zenzinger’s head with a Chinese rooftop in the background.", "\"This is a lie that has been debunked repeatedly,\" Zenzinger told Denver7 and PolitiFact. \"The reason I'm filing the complaint is that I believe that they actually have crossed the line to where this is criminal. It's not even a stretching of the truth. It's just not the truth, and it's being used to influence voters.\"", "\"That needs to stop,\" she added.", "We reached out to Colorado Citizens for Accountable Government but hadn’t received a reply.", "On July 5, PolitiFact and its partner Denver7 checked the facts of an earlier mailer from Colorado Citizens for Accountable Government that said, \"While serving in the city council, Rachel Zenzinger voted to use tax dollars to take a taxpayer funded junket to China.\"", "PolitiFact rated the mailer Pants on Fire, its worst rating reserved for ridiculous statements.", "There are key problems with these attacks.", "While on the Arvada City Council in 2013, Zenzinger made -- and then voted for -- a successful motion explicitly prohibiting use of taxpayer funds for a proposed sister-city delegation to China.", "No city officials ever went on the trip. But you wouldn’t know that from this mailer, or a 2014 TV ad called \"China Girl\" that targeted Zenzinger, who was running to hang onto her Senate seat.", "In April 2013, Zenzinger was a newly appointed Arvada City Councilwoman who took part in a motion regarding a sister city agreement with the Chinese city of Jinzhou.", "The council members were discussing an invitation from the mayor of Jinzhou to send an official delegation from Arvada to the 2013 World Landscape Art Exposition.", "A nonprofit group, Arvada Sister Cities International, recommended that the invitation be accepted and that an official delegation -- including Arvada city officials, members of the local Chinese Chamber of Commerce and Arvada Sister Cities -- attend the Jinzhou expo.", "Councilman Bob Dyer made a motion to accept the group’s recommendation and send a delegation to Jinzhou, according to the meeting minutes. The motion made no mention of funding for the trip, according to the minutes.", "Mayor Marc Williams said he was uncomfortable using public funds on the trip.", "The mayor said \"since he understands the motion includes sending delegation members from the city at city expense, he cannot support it,\" according to the minutes. However, he said he would back sending Zenzinger as the elected representative if her travel was privately funded.", "Zenzinger voted for the Dyer motion to send a delegation, but it failed, 4-3.", "Zenzinger then made her own motion, saying if a city delegation was sent, no taxpayer money would be used. \"Mayor Pro Tem Zenzinger clarified ... that if Sister Cities is unable to fund them, then we would come back and decline the invitation,\" according to the minutes.", "Her motion passed 5-2.", "Ultimately, no city officials or employees went to China because no private funding was found.", "Our ruling", "In a political mailer, Colorado Citizens for Accountable Government stated, \"When Rachel Zenzinger was on the Arvada City Council, she voted to spend taxpayer funds for a junket to China.\"", "As of a council member, Zenzinger did vote on a failed motion to send an official delegation to a sister-city event in China. But not only did Zenzinger initiate a successful motion explicitly prohibiting use of taxpayer funds for the delegation to China, but she never even went to China.", "The attack is a brazen, repeated distortion of the facts. We rate the claim Pants on Fire!", "https://www.sharethefacts.co/share/72c929ba-4d50-4912-a782-a9091a34404b", "Arvada City Council meeting minutes, April 1, 2013", "Interview with Rachel Zenzinger on October 19, 2016", "Colorado Independent, \"‘China Girl’ ad levels blatant false charge in key state Senate race,\" October 10,2014", "Sunlight Foundation, \"A glossary of campaign finance in the U.S.,\" February 17, 2016", "Arvada City Council meeting minutes, April 1, 2013", "Interview with Colorado Citizens for Accountable Government via email on June 30, 2016", "Interview with Rachel Zenzinger on June 27, 2016", "Interview with Mark McGoff on June 29, 2016", "Interview with Marc Williams on June 30, 2016", "Interview with Edna Gordon June 30, 2016.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]