["About this rating", "On 3 May 2016, the military satire site Duffel Blog published an article reporting that Medal of Honor recipient Kyle Carpenter had been stripped of the award for valor after he failed to complete an online training course during active duty:", "Marine veteran and Medal of Honor recipient Kyle Carpenter was recently informed that his award, the highest for valor in the armed services, will be rescinded because he failed to complete a mandatory annual training course while on active duty. A recent Headquarters Marine Corps (HQMC) review of his records shows that he did not complete the online “Driving in Icy Conditions” course in 2010 while he was deployed to the violent city of Marjah, Afghanistan.", "Many Marines are calling for the award to be reinstated, but Sgt. Maj. of the Marine Corps Ronald L. Green says there’s no place for “tough guys” like Carpenter being honored in today’s Corps, whose main mission is to fight things like social injustice and hurt feelings.", "“Any motivator can block a grenade blast with his face and selflessly save a teammate’s life under a hail of withering enemy gunfire,” said Green, from his air-conditioned office in Virginia. “But it takes a true Marine to listen to that creepy guy in S-2 give a three-hour PowerPoint on STDs, and that’s the message Marines need to hear.”", "Kyle Carpenter is a real person, but the circumstances described by Duffel Blog are fictional. The former Marine medically retired from the service in July 2013 due to injuries sustained in Afghanistan, and was awarded the Medal of Honor on 19 June 2014.", "Carpenter was charged with misdemeanor hit-and-run in late 2015 when he struck a pedestrian while making a left turn on a street in Columbia, South Carolina (the victim suffered minor injuries; Carpenter turned himself in).  However, his medal was not stripped then, nor was it taken away while he was on active duty.", "Duffel Blog's \"About\" page mirrored the tongue-in-cheek style of its content, hinting its content wasn't meant to be taken seriously. However (unlike most self-labeled \"satire\" sites) Duffel Blog aimed to amuse (not confuse) a relatively small audience: military people:", "Since 1797, Duffel Blog has been serving the men and women of the American military with insightful commentary and hard-hitting journalism. While other agencies have sometimes run from possibly scandalous stories, Duffel Blog has been known to be edgy and ahead of its time, almost as if they could see into the future. After reporting on President John Adams’ $200 per week cocaine habit in March 1799, Duffel Blog was named The American Military’s Most-Trusted News Source by the Columbia Journalism Review and the nickname stuck.", "Duffel Blog is sometimes referred to as “The military version of The Onion,” but this is a popular misconception. The misnomer was cleared up in May 2012 when DB staff successfully conducted an airborne assault on the offices of The Onion News Network so that others would know “The Onion was actually the civilian version of Duffel Blog.”", "Readers familiar with Duffel Blog immediately recognized its satirical intent. However, the brand of humor employed is very specific. Because of this, occasionally Duffel Blog articles can cause confusion on social media. Previous instances in which Duffel Blog material was misidentified as factual include articles reporting that West Point posthumously revoked diplomas of confederate soldiers, the Army adopted a \"mandatory divorce\" policy to \"improve readiness,\" Ariana Grande joined ISIS, the USS Gabrielle Giffords would be the Navy's first \"gun-free\" warship, and that the Pentagon spent massive amounts of money on Powerball tickets to fund the F-35 Joint Strike Fighter program.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]