["About this rating", "Longtime readers of this site are no doubt familiar with the wide breadth of spurious claims made by David “Avocado” Wolfe, a self-styled health guru who gained prominence as a pitchman for the NutriBullet blender. From his claim that putting cut onions in your socks at night would “detox” your body, to his belief that the oceans contain salt so as to prevent the water from levitating away into space, we would be hard-pressed to find an absurd statement attributed to him that would shock us.", "The corollary to this reputation is that anyone can ascribe any crazy claim to such a person and it will sound plausible that the target made such a statement. It is for this reason we were asked to check on the authenticity a meme commonly attributed to Wolfe on Facebook, and which he himself  tweeted on 9 May 2016:", "This was not Wolfe's first foray into heliophysics. He has long held that “chocolate lines up planetarily with the sun” and that chocolate is, in fact, “an octave of sun energy.”", "Wolfe apparently later walked backed the solar energy-draining claim, asserting it “never even crossed my mind that folks would take the #SolarPower post LITERALLY” before bemoaning what he described as an uproar of the “Scientism clergy.”", "In point of fact, the sun is constantly “draining” and would be doing so with or without the advent of solar power, humans, or even life itself. Every second, the sun converts 600 million tons of matter into neutrinos, solar radiation, and energy, and it has been doing so for the past 4.5 billion years. The sun has enough matter to continue operating in this fashion for the next 4.5 billion or so years as well, though it will gradually get hotter. On human timescales, this fits squarely within the definition of an inexhaustible source of energy.", "If evolutionary history is any guide, humans will have become extinct long before the sun is exhausted, and our brief existence in this solar system will have had no discernible effect on the sun. If physics is any guide, the planet will be completely uninhabitable well before that event, as described at Universe Today:", "In 3.5 billion years from now, the Sun will be 40% brighter than it is right now. This increase will cause the oceans to boil, the ice caps to permanently melt, and all water vapor in the atmosphere to be lost to space. Under these conditions, life as we know it will be unable to survive anywhere on the surface. In short, planet Earth will come to be another hot, dry Venus.", "d’Entremont, Yvette.   \"David Avocado Wolfe Is the Biggest Asshole in the Multiverse.”\r\n    The Outline.   7 August 2017.", "Williams, Matt.   \"What Is the Life Cycle of the Sun?”\r\n    Universe Today.   22 December 2015.", "Switek, Brian.   \"The Top 10 Greatest Survivors of Evolution”\r\n    Smithsonian.   9 November 2012.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]