["By Rose Nagele", "Posted on August 15, 2017", "Q: Did President Trump cancel funding to build Barack Obama’s presidential library?", "A: No. That story originated on a satirical news site. All presidential libraries have been constructed using private or non-federal funds.", "On Aug. 4, lahrennews.com posted a story claiming that President Donald Trump blocked Barack Obama from using taxpayer money to build his presidential library.", "“Donald Trump continues to buck the establishment’s system by doing things the way he wants them done,” the story says. “After learning that President Obama ordered the Department of Education’s library division to divert more than $8 million in funds to a fund to build the next Presidential Library, Trump wrote the order rescinding it and putting the money into improving the education of privately held charter schools instead.”", "Actually, there is no “library division” of the Department of Education, and Obama did not try to reroute any federal money for the construction of his presidential center.", "In fact, in an email to FactCheck.org, James Pritchett, the director of public and media communications at the National Archives and Records Administration, confirmed that the Obama Presidential Center will be a “private entity” and “will not receive any funding from the National Archives.” NARA operates the other presidential libraries, but it will not operate the Obama library.", "The story — which was flagged by Facebook users as potentially fake news — is a shorter version of one published by thelastlineofdefense.org in December 2016. That satirical website has a disclaimer that says it presents “fiction as fact” and is not “telling the truth.”", "The edited version of the story on lahrennews.com omitted several lines from the original that were demonstrably false. For example, thelastlineofdefense.org story said that “the library division has been using taxpayer funds to build Presidential Libraries since John Adams had his erected in Bridgeport, Connecticut in 1806.”", "Not including Obama’s library, there are currently 13 government-run libraries and museums that house the records and artifacts of Presidents Herbert Hoover through George W. Bush. President Franklin D. Roosevelt’s library was the first to open in 1941, and it was not built with federal money.", "Anyone who read to the very end of the story posted on thelastlineofdefense.org would have seen the following: “Our researchers have told us that we should update this story to include a couple of misstated facts: Presidential libraries aren’t taxpayer funded, there’s no such thing as the department of libraries and there are only a handful of Presidential libraries, all built fairly recently.” That part was also left out of the version on lahrennews.com.", "The National Archives and Records Administration, on a frequently asked questions page, explains that presidential libraries always have been constructed with private donations, but operated by NARA using funding appropriated by Congress.", "NARA, FAQ page: How did the Presidential Library System begin?", "It all began with President Franklin D. Roosevelt in the late 1930s.", "A dramatic increase in the amount of Presidential papers led Roosevelt to seek the advice of prominent historians and public figures on how and where to keep not only his White House files, but also his earlier papers, book collection, and memorabilia.", "Roosevelt announced plans for a new type of facility, a Presidential Library, on December 10, 1938. An organization was chartered to raise private funds for the construction of the building on Roosevelt’s Hyde Park estate.", "On July 18, 1939, Congress passed a joint resolution accepting the new facility and agreeing to operate it as part of the National Archives. The Roosevelt Library was turned over to the Federal government on July 4, 1940, and dedicated on June 30, 1941.", "The Roosevelt Library became the model for subsequent Presidential Libraries. Succeeding Libraries have been constructed with private and other non-Federal funds. A private, non-profit organization is formed to coordinate these efforts and provide support for Library and museum programs.", "Once a Library is constructed, NARA assumes responsibility for its operation and maintenance in accordance with the Presidential Libraries Acts of 1955 and 1986.", "The Obama Presidential Center, to be built on the South Side of Chicago, will be different. The facility, once completed in 2021, will not be maintained and managed by NARA as part of its presidential library system.", "“At the request of the Obama Foundation, and with the agreement of NARA, the Obama Foundation will build, own and operate the museum portion of the Obama Presidential Center as a private museum,” the Obama Foundation announced in May.", "The foundation said that all of Obama’s unclassified paper records will be digitized and made available for viewing online, while the original documents, and other artifacts, will be housed at an existing NARA facility — not on site at the presidential center.", "“In this new model, NARA will administer neither a museum nor a traditional ‘Presidential Library,’ and will instead focus its resources and personnel on preserving and making accessible the Presidential records of the 44th President of the United States in digital format to the greatest extent possible,” a NARA press release said.", "That means the agency will not have to spend potentially millions of dollars annually maintaining a presidential library for Obama, as it does for 13 other presidents. NARA’s fiscal 2018 budget request contains $65.3 million for the “Presidential Libraries system,” which includes $28.6 million “for the operations and maintenance of facilities.”", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to help identify and label viral fake news stories flagged by readers on the social media network.", "“BREAKING: Trump Cancels Funding For Obama’s Free House And Library-Michelle FURIOUS.” Thelastlineofdefense.org. 29 Dec 2016.", "“Do You Support Trump In Canceling Funding For Obama’s Free House And Library?” Lahrennews.com. 4 Aug 2017.", "Pritchett, James, director of public and media communications. National Archives and Records Administration. Email sent to FactCheck.org. 15 Aug 2017.", "National Archives and Records Administration. Presidential Libraries: Frequently Asked Questions. Accessed 9 Aug 2017.", "National Archives and Records Administration. Presidential Library History. Accessed 14 Aug 2017.", "Ginsberg, Wendy, et al. “The Presidential Libraries Act and the Establishment of Presidential Libraries.” Congressional Research Service. 6 Feb 2015.", "Obama Foundation. “The Obama Foundation and NARA Announce New Details on Obama Presidential Center Structure and Operations.” 3 May 2017.", "National Archive and Records Administration. “National Archives Announces a New Model for the Preservation and Accessibility of Presidential Records.” Press release. 3 May 2017.", "National Archive and Records Administration. “FY 2018 Congressional Justification.” Budget request. 23 May 2017.", "Caputo, Angela. “Obamas unveil design of presidential center in Chicago.” Chicago Tribune. 4 May 2017.", "Kamin, Blair, et al. “Obama Presidential Center breaks from National Archives model.” Chicago Tribune. 11 May 2017.", "Schaedel, Sydney. “Websites that Post Fake and Satirical News.” FactCheck.org. 6 Jul 2017.", "FactCheck.org Rating:", "Read More", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]