["Florida's ethanol mandate has been in place less than a year, and a Panhandle Republican plans to push for its repeal.\n\nRep. Matt Gaetz, who lives in the coastal community of Fort Walton Beach, argues corn-based fuel takes more energy to make than it generates.\n\n\"A Cornell University research study concludes that ethanol generates a 29 percent energy loss, meaning it takes more than a gallon of gasoline to produce a gallon of ethanol,\" he wrote in a recent Pensacola News Journal op-ed.\n\nA PolitiFact Florida reader sent a link our way. We were curious: Has an Ivy League researcher found ethanol to be an energy loser?\n\nWe were especially curious because the U.S. Department of Energy says the majority of such studies about ethanol's \"net energy balance,\" especially more recent ones, show the opposite. So, of course, does the renewable fuels industry. \n\nFirst, a little background. The Florida law, passed in 2008, has required since Dec. 31, 2010, that most gasoline include 9 percent to 10 percent \"agriculturally derived\" fuel. Lawmakers said they wanted to boost renewable energy that would cut greenhouse gas emissions and reduce reliance on foreign oil. \n\nBut boaters in Gaetz's district were ready to \"get out the pitchforks,\" he said. The law doesn't apply to gas sold for small engines or boats. Still, some boaters who used the mix, known as E10, found it would rot out fuel lines and gunk up carburetors. Gaetz, propelled by angry constituents, did some research — and now has a file in his Tallahassee office to support legislation to turn back the mandate. He sent us a news release from Cornell News Service, \"Cornell ecologist's study finds that producing ethanol and biodiesel from corn and other crops is not worth the energy.\"\n\nThat appears to give Gaetz's claim strong roots.\n\nSo does the study itself, which said \"to produce a liter of (corn) ethanol requires 29 percent more fossil energy than is produced as ethanol.\" Researchers included all kinds of \"energy inputs\" required to produce fuel from corn — more than a dozen just to grow the corn in the first place, from production of pesticides and nitrogen fertilizer to construction of farm equipment to food for farmworkers. (The authors argue that government and industry studies don't take enough \"energy inputs\" into account, which is why they get a different result.) All the fossil energy, from natural gas to liquid fuel to coal, got totaled up and explained as \"gasoline equivalents.\"\n\nThat's a little more nuanced than Gaetz's claim that a study said it takes \"gasoline\" to produce ethanol. But it's close.\n\nStill, the study was from 2005. Did Gaetz quote an outdated statistic to make his point?\n\nWe chatted with one of the researchers, David Pimentel, an emeritus professor in agriculture and life sciences at Cornell. We read him Gaetz's claim.", "\"Yeah, that's correct,\" Pimentel said. \"We have more up-to-date data, though. ...\n\n\"It would be 1.5 gallons of gasoline equivalents to produce 1 gallon of ethanol. So this is even worse.\"\n\nIn other words, Gaetz cited an old number. But more recent work from the same researchers would have even better demonstrated his point. That's scarcely statistical malfeasance.\n\nWhat about the fact that Pimentel's research flies in the face of government and industry studies? We would have preferred Gaetz note that in his op-ed, but Pimentel's a widely cited biofuel skeptic whose work is addressed by USDA researchers and weighed by other Ivy League energy experts. That makes Pimentel's work the subject of legitimate discussion.", "This fact-check doesn't attempt to evaluate the science itself, but whether Gaetz accurately characterized a scientific study when he wrote, \"a Cornell University research study concludes that ethanol generates a 29 percent energy loss, meaning it takes more than a gallon of gasoline to produce a gallon of ethanol.\"\n\nWe found the study and talked with the Cornell researcher, who said Gaetz accurately cited him. Still, we're concerned readers might think it literally takes gasoline — rather than gasoline \"equivalents\" — to produce ethanol. Meanwhile, with the Ivy League appeal of Gaetz's statistic, it might appear to represent settled scientific consensus. In fact, researchers battle from paper to paper — and Pimentel's in the minority. So, the op-ed claim was accurate, but needs some clarification. That's our definition of Mostly True.", "Pensacola News Journal, \"Viewpoint: End Florida's ethanol mandate,\" Sept. 29, 2011\n\nInterviews with Rep. Matt Gaetz, Oct. 7-10, 2011\n\nU.S. Department of Energy, \"Ethanol: The complete energy lifecycle picture,\" May 16, 2008\n\nU.S. Department of Energy, \"Current State of the U.S. Ethanol Industry,\" Nov. 30, 2010 \n\nU.S. Department of Agriculture, \"The 2001 Net Energy Balance of Corn-Ethanol,\" May 16, 2008\n\nU.S. Government Accountability Office, \"Biofuels: Potential Effects and Challenges of Required Increases in Production and Use,\" Aug. 25, 2009\n\nRenewable Fuels Association, \"Ethanol Industry Update,\" Jan. 19. 2011\n\nFlorida Renewable Fuel Standard Act, Florida Statutes 526.201-526.207, accessed Oct. 10, 2011\n\nSt. Petersburg Times, \"Ethanol fuel mix has Pinellas boat owners sputtering,\" Feb. 8, 2009\n\nCornell News Service, \"Cornell ecologist's study finds that producing ethanol and biodiesel from corn and other crops is not worth the energy,\" July 5, 2005\n\nNatural Resources Research, \"Ethanol Production Using Corn, Switchgrass, and Wood; Biodiesel Production Using Soybean and Sunflower,\" by \nDavid Pimentel and Tad W. Patzek, March 2005\n\nInterview with David Pimentel, agriculture and life sciences emeritus professor at Cornell University, Oct. 10, 2011\n\n\"Chapter 15: Ethanol production using corn, switchgrass, and wood; biodiesel production using soybeans,\" of \"Biofuels, solar and wind as renewable energy systems,\" edited by David Pimentel, 2008", "Grist, \"BIOFUEL SKEPTIC EXTRAORDINAIRE: An interview with David Pimentel,\" Dec. 8, 2006\n\n\"Ethanol from biomass: can it substitute for gasoline?,\" draft chapter from Energy: Perspectives, Problems, and Prospects (Oxford University Press, Nov. 30, 2009), by Michael McElroy, accessed Oct. 14, 2011", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]