["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Marijuana grows in Gardena, Calif. (AP)", "Agard is right that data from a JAMA analysis found an average decrease in the likelihood of youth marijuana use after some states had passed recreational marijuana laws.", "But an examination of individual state data shows results are mixed.", "Wisconsin’s Republican lawmakers may have made clear that Gov. Tony Evers’ plan to legalize marijuana in the next state budget will go up in smoke, but state Sen. Melissa Agard, D-Madison, isn’t backing down.", "Agard has pushed the state for years to legalize the drug for both medicinal and recreational purposes, a proposal that garnered little traction under former Gov. Scott Walker and the Republican-controlled Legislature.", "Today, though, the dynamic is different. Legalization could generate $166 million in revenue that could help fund rural schools and programs for communities that have been disproportionately affected by past marijuana laws, Evers said when he announced the plan.", "Wisconsin is one of just 14 states that has not legalized marijuana in some form. Fifteen states have legalized recreational marijuana over the past few years, including neighboring Illinois and Michigan, and Minnesota lawmakers have introduced a bill that would do the same.", "Public support of the idea is also growing in Wisconsin. A 2019 Marquette University Law School poll found 59% of Wisconsin voters backed legalization for recreational purposes, and 83% backed it for medicinal purposes.", "Still, Republican leaders of the Legislature’s budget committee wasted little time in shooting down the proposal. Though Sen. Howard Marklein, R-Spring Green, said he believed it was \"too big\" to be inserted into the state budget, Sen Chris Kapenga, R-Delafield, worried about health effects of the drug on kids who choose to use it.", "We rated Kapenga's claim linking youth marijuana use and psychological disorders True. But Agard jumped in to make another point:", "\"Youth usage of marijuana has actually gone down in states that have fully legalized,\" she tweeted back.", "It’s an important claim, because those opposed to legalization often claim that the move will cause a dramatic uptick in teens smoking pot. But is it correct?", "Let’s take a look.", "Along with her statement, Agard tweeted a link to an analysis on marijuana laws and teen use of the drug from JAMA Pediatrics, a peer-reviewed journal published by the American Medical Association.", "The analysis, published July 8, 2019, pooled data from each state’s Youth Risk Behavior Survey from 1993 to 2017 to examine the association between legalization and teen marijuana use.", "Averaging the survey data from seven states that passed recreational marijuana laws from 2012 to 2017 — Alaska, California, Colorado, Maine, Massachusetts, Nevada and Washington — researchers found an 8% decrease in the likelihood of youth marijuana use and a 9% decrease in the likelihood of frequent marijuana use among youth after such laws were passed.", "\"We interpreted our results as consistent with the argument that it is more difficult for teens to obtain marijuana as drug dealers are replaced by licensed dispensaries that require proof of age,\" study author D. Mark Anderson, an associate professor of economics at Montana State University, told PolitiFact Wisconsin in an email.", "In some states, recreational sales did not begin until a few years after legalization, so the researchers repeated their analysis based on those dates and got similar results, Anderson said.", "A caveat of the analysis is that it uses an average — and when looking at states’ raw data from the survey, results are more mixed.", "For example, in Colorado, there have been no significant changes in current marijuana use among high school students since 2005, according to its Healthy Kids Colorado Survey data. In 2013, a year after the state legalized the drug, 19.7% of high school students had used marijuana in the past 30 days; in 2019, 20.6% had.", "Alaska’s state survey also reported no significant changes in current youth marijuana use since the drug was legalized in 2015 and sales began in 2016.", "And in Oregon, which legalized in 2014, current marjiuana use fell among 8th graders after recreational sales began, but rose among 11th graders, data from the state’s 2017 youth survey found. In the 2019 survey, current marijuana use had risen among 8th graders but fallen among 11th graders.", "It’s also important to note that the Youth Risk Behavior Survey is just one type of study. Though one set of Washington state data, from the Washington Healthy Youth Survey, found that marijuana use in that state did decrease among the state’s 8th and 10th graders after legalization for recreational purposes in 2012, other studies cited in the JAMA analysis did not reach the same conclusion.", "For instance, a study using data from the Monitoring the Future survey, which assesses drug and alcohol use among youth across the U.S., found a statistically significant increase in marijuana use among 10th graders in Washington after legalization for recreational use.", "Some say the Monitoring the Future data has too much year-to-year volatility to encapsulate marijuana policy changes — but it’s clear that more review will be needed to fully understand the effects of recreational marijuana laws on youth use.", "The full effects of marijuana legalization won’t be seen until a generation after national legalization, which still has not happened yet, Jonathan Caulkins, a public policy professor at Carnegie Mellon University and former co-director of RAND’s Drug Policy Research Center, told PolitiFact Illinois about a similar claim from an Illinois state representative.", "Agard said youth marijuana use has declined in states that have fully legalized the drug for both medicinal and recreational purposes.", "The JAMA analysis she cited did bear that out, although it has its caveats — when looking at individual states’ data, some that legalized the drug years ago have not seen any meaningful change in youth use.", "Meanwhile, at least one study found the reverse — an increase in use. Experts say it will be many years before what Agard claimed can be said with certainty.", "We rate her claim Half True.", "Email exchange, Sen. Melissa Agard’s office", "Email exchange, D. Mark Anderson, associate professor at Montana State University", "Milwaukee Journal Sentinel, \"Democratic legislator to introduce bill legalizing pot,\" April 13, 2015", "Milwaukee Journal Sentinel, \"Gov. Tony Evers will propose legalizing recreational and medical marijuana as part of the next state budget,\" Feb. 7, 2021", "Minneapolis Star Tribune, \"Recreational marijuana bill is back at Minnesota Capitol,\" Feb. 2, 2021", "JAMA Pediatrics, Association of Marijuana Laws With Teen Marijuana Use: New Estimates from the Youth Risk Behavior Surveys, July 8, 2019", "JAMA Pediatrics, Prevalence of Cannabis Use in Youths after Legalization in Washington State, Dec. 19, 2018", "JAMA Pediatrics, Association of State Recreational Marijuana Laws With Adolescent Marijuana Use, February 2017", "National Institute on Drug Abuse, Monitoring the Future, accessed Feb. 24, 2021", "Prevention Science, Has Cannabis Use Among Youth Increased After Changes in Its Legal Status? A Commentary on Use of Monitoring the Future for Analyses of Changes in State Cannabis Laws, Dec. 2, 2019", "Healthy Kids Colorado Survey, Prevalence of past 30 day substance use among high school students, Colorado 2005 to 2019, accessed Feb. 24, 2021", "Alaska Youth Risk Behavior Survey, 2017 and 2019 highlights, accessed Feb. 24, 2021", "2017 and 2019 Oregon Healthy Teens Survey, accessed Feb. 24, 2021\nPolitifact Illinois, \"Cassidy puffs up what stats say about teen marijuana use,\" May 12, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]