["The photo was shared in this Facebook post on July 21, 2020.", "Gerald Anderson, an ABS-CBN actor, can be seen in the photo flanked by a crowd carrying posters that call for the renewal of the network's franchise.", "The post’s caption reads: \"A SIGN FOR IGNORANCE / This is very irresponsible. Without a mask, ABS-CBN network supporters take for granted Covid-19 and do not even wear masks. Social distancing and wearing a mask are disregarded upon seeing celebrities.\"", "The photo circulated days after ABS-CBN celebrities and employees staged a protest against the refusal by Philippine legislators in early July 2020 to approve the broadcaster’s operating licence application.", "The photo was also shared alongside a similar claim on Facebook here, here, here, here, here and here.", "The claim is false.", "A reverse image search on Google found the photo was featured in this report published by Philippine news organisation Rappler on February 28, 2020, weeks before the government imposed COVID-19 restrictions.", "The February rally, Rappler reported, featured TV stars and network employees \"who gathered for another prayer rally calling for the renewal of ABS-CBN’s franchise.”", "Below is a screenshot comparison of the photo in the misleading posts (L) and the Rappler photo (R):", "Rappler’s photo and its account of the February 28 event also correspond to this video report aired by ABS-CBN on the same day. Anderson can be seen at the video’s two-minute 49-second mark.", "It was not until March 17, 2020, that the Philippine government imposed stringent COVID-19 quarantine and social distancing measures on the country’s main island, according to this official statement.", "On April 2, 2020, the government adopted a policy of mandatory wearing of masks and face covers for those in areas under quarantine, according to this official announcement.", "The false claim about the protest photo was also debunked by Rappler here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]