["About this rating", "Ariana Pekary left her job as a producer at MSNBC on July 24, 2020, citing in an open letter her moral misgivings with the commercial news model.", "Right-leaning media framed Pekary's letter as an attack, specifically, on the liberal MSNBC, rather than a critique of the entire commercial news model.", "In early August 2020, Snopes readers asked about a story posted to The Political Insider website with the headline, \"MSNBC Producer Quits, Says Her Channel Is A 'Cancer' That 'Stokes National Division.'\"", "It's true that on Aug. 3, 2020, Ariana Pekary announced that she had resigned from her job as a producer for cable news station MSNBC, doing so with an open letter that detailed her moral misgivings with the commercial model the cable station follows.", "But it's misleading to state that Pekary's letter was directed solely at the liberal MSNBC, because Pekary's critique was aimed at the entirety of the commercial news industry, which she said offers viewers ideological bias-confirming sensationalism over informative and nuanced reporting.", "Pekary was forced to follow her original open letter with a clarification, noting that in reporting on her resignation, Fox News had inadvertently proved her point by misleadingly telling its audience that Pekary's letter was directed solely at MSNBC.", "\"MSNBC producer resigns from network with scathing letter: They block 'diversity of thought' and 'amplify fringe voices,'\" the Fox News headline reported.", "However, Pekary had said in her original statement that in her observation, important information, stories, and nuance were often left out of broadcasts in favor of booking guests and discussion topics that would drive ratings and revenue, and that the problem far goes beyond MSNBC. Pekary wrote:", "You may not watch MSNBC but just know that this problem still affects you, too. All the commercial networks function the same – and no doubt that content seeps into your social media feed, one way or the other.", "It’s possible that I’m more sensitive to the editorial process due to my background in public radio, where no decision I ever witnessed was predicated on how a topic or guest would “rate.” The longer I was at MSNBC, the more I saw such choices — it’s practically baked in to the editorial process – and those decisions affect news content every day. Likewise, it’s taboo to discuss how the ratings scheme distorts content, or it’s simply taken for granted, because everyone in the commercial broadcast news industry is doing the exact same thing.", "But behind closed doors, industry leaders will admit the damage that’s being done.", "“We are a cancer and there is no cure,” a successful and insightful TV veteran said to me. “But if you could find a cure, it would change the world.”", "We reached out to Pekary via her website for further comment, but didn't hear back in time for publication. But in her follow-up statement, posted Aug. 4, 2020, Pekary stated:", "As it turns out, Fox News inadvertently proved me right. My concern, clearly stated in the post, is with the entire industry because each outlet uses the same funding model. That includes Fox News, of course, but they couldn’t help but to turn my statement into a divisive piece of clickbait. The headline skewed the intention of my piece and they removed almost all of the context in which I explain the systemic nature of the problem. That is unfortunate, but not surprising.", "I regret if my piece was presented as an attack on a single network, but that only gives me motivation to continue on this new path. It’s just another example of the division I’m trying to alleviate. My purpose isn’t to drive people away from the industry, but to raise awareness (as a first step). We all deserve better and we can do better.", "On Twitter, Pekary credited the New York Daily News for accurately capturing her sentiments with a headline that read, \"Ex-MSNBC producer pens back-to-back posts saying MSNBC and Fox News let ratings stoke 'division.'\"", "It's true that Pekary resigned from her position with MSNBC and accompanied her decision with an open latter criticizing the network. But stories reporting that her criticism was directed solely at MSNBC were misleading, because she expressed opposition to the commercial model that drives journalists at such outlets to prioritize sensationalism and ideological bias for the sake of viewership over important, nuanced, but less splashy topics, stories and experts. We therefore rate this claim \"Mixture.\"", "Pekary, Ariana. \"Personal News: Why I’m Now Leaving MSNBC.\"\r\n  ArianaPekary.net. 3 August 2020.", "Pekary, Ariana. \"Follow Up + a Note About Ideology.\"\r\n  ArianaPekary.net. 4 August 2020.", "Wulfsohn, Joseph A. \"MSNBC Producer Resigns from Network with Scathing Letter: They Block 'Diversity of Thought' and 'Amplify Fringe Voices.'\"\r\n  Fox News. 4 August 2020.", "Dillon, Nancy. \"Ex-MSNBC Producer Pens Back-to-Back Posts Saying MSNBC and Fox News Let Ratings Stoke 'Division.'\"\r\n  New York Daily News. 4 August 2020.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]