["About this rating", "At least one representative gave a tour of the Capitol complex on Jan. 5, 2021, video evidence showed. According to the House Select Committee investigating the Jan. 6 Capitol attack, “some individuals” on that tour attended the rally hosted by former U.S. President Donald Trump, near the White House, the following morning. That rally preceded the attack on the Capitol.", "However, there is no evidence to confirm or disprove that the tour was given for reconnaissance purposes.", "Update [June 20, 2022]: This fact check was originally published on Jan. 13, 2021, and addressed claims as they arose in the immediate aftermath of the Jan. 6 attack on the U.S. Capitol. In June 2022, Snopes updated this post with information released by the House Select Committee that investigated the attack over the course of months. That committee released its findings publicly via a series of televised hearings in June 2022.", "On June 15, 2022, the committee revealed that it had obtained security camera footage showing U.S. Rep. Barry Loudermilk, a Republican from Georgia, providing a tour to “approximately 10 individuals” on Jan. 5, 2021. Those individuals photographed and recorded “areas of the complex not typically of interest to tourists, including hallways, staircases, and security checkpoints,” according to the committee’s chair. The committee reported that “some individuals” on the tour attended the rally hosted by former U.S. President Donald Trump, near the White House, the following morning. That rally preceded the attack on the Capitol.", "A representative for Loudermilk pointed Snopes to a U.S. Capitol Police letter to the Select Committee that stated, in part, that \"there is no evidence that Representative Loudermilk entered the U.S. Capitol with this group on January 5, 2021.\" The select committee's allegation was not that the tour entered the Capitol itself, however, but that it toured \"parts of the Capitol complex\" — a series of office buildings connected to the U.S. Capitol building by tunnels. The Capitol police, in the same letter, confirm that Loudermilk's group toured the Rayburn Building and the Cannon House Office Building, which are part of this complex.", "Based on this evidence, Snopes changed the original rating on this fact check from “Unproven” to “Mixture.” While evidence proved that a Capitol complex tour took place on Jan. 5, 2021, and that some members of that tour reportedly participated in at least one event hosted by Trump the following day, the assertion that the purpose of the Jan. 5 tour was “reconnaissance” remains unproven. The original article appears below:", "Ever since a mob of pro-Trump rioters overwhelmed law enforcement and breached the U.S. Capitol building on Jan. 6, 2021, in protest of the 2020 election results, questions swirled about the culpability of U.S. President Donald Trump's congressional allies in fomenting — or even planning — the riot.", "On Jan. 12, during a Facebook live broadcast, Rep. Mikie Sherrill, D-N.J., made the most pointed allegation yet — that on Jan. 5, 2021, some members of Congress gave tours designed to provide reconnaissance to people who participated in the riot:", "I ... intend to see that those members of Congress who abetted him [President Trump], those members of Congress who had groups coming through the Capitol that I saw on January 5th as a reconnaissance for the next day, those members of Congress that incited this violent crowd, those members of Congress that attempted to help our president undermine our democracy, I'm going to see that they're held accountable and if necessary ensure that they don't serve in Congress.", "Sherrill did not name specific lawmakers, but told Politico that, \"We're requesting an investigation right now with certain agencies.\" For now the claim remains unproven.", "But in terms of the broader notion that members of Congress were involved with people who claim to have helped plan the events of Jan. 6, documentary evidence exists to support those allegations. In a since deleted video, \"Stop the [Election] Steal\" organizer Ali Alexander claimed he worked with Rep. Paul Gosar, R-Arizona, Rep. Mo Brooks, R-Alabama, and Rep. Andy Biggs, R-Arizona, on plans to disrupt the Electoral College certification in Congress:", "I was the person who came up with the January 6th idea with Congressman Gosar, Congressman Mo Brooks, and then Congressman Andy Biggs. We four schemed up putting maximum pressure on Congress while they were voting so that ... we could change the hearts and the minds of Republicans who were in that body, hearing our loud war from outside.", "All three have had some connection, whether direct or indirect, to Alexander, as several media outlets later reported.", "Gosar, one of the most vocal promoters of president Trump's false claims about the 2020 election, described Alexander as a \"true patriot\" on Twitter, and linked to Alexander's account at least 23 times between Nov. 30, 2020, and Alexander's suspension from Twitter, according to The Washington Post. The two both spoke at a \"Stop the Steal Rally\" on Dec. 19 in Phoenix, Arizona. Alexander has referred to Gosar as \"his great friend.\" Gosar has yet to comment on the allegations.", "Biggs has denied any involvement with Alexander. However, at the same Phoenix Rally, Alexander played a video of Biggs that had been pre-recorded for the crowd, as reported in the Arizona Republic:", "At that rally, Alexander said, \"Congressman Andy Biggs sent us a video\" message for those in attendance. From his cellphone, Alexander played the 80-second message from Biggs.", "“Andy Biggs here, I wish I could be with you. I’m in the D.C. swamp fighting on behalf of Arizona’s residents and freedom fighters all over the country,\" Biggs is heard saying.", "He goes on to say, \"I wish I could be with you today\" and \"We are going to keep fighting, and I implore you to keep fighting, too. God bless you for being here today. And God bless this great country.\"", "When it ended, Alexander leads the crowd in chanting \"Biggs, Biggs, Biggs.\"", "Biggs spokesperson Daniel Stefanski released a statement explaining that Biggs made the video for Gosar, who did not tell him about Alexander's involvement.", "In that same video, Biggs mentioned Brooks as his ally in the fight over the 2020 election, according to The Intercept. In a statement to that outlet, Brooks stated that he \"has no recollection of ever communicating in any way with whoever Ali Alexander is,\" arguing he spoke at the Jan. 6 \"Save America\" rally at the invitation of the White House alone.", "It is unclear, however, if these same congressmen are the ones Sherrill was referring to with respect to the \"reconnaissance tours.\"", "Even so, at least one other lawmaker has backed up Sherrill's claims. According to Politico, Rep. Tim Ryan, D-Ohio, said he is aware of \"a couple\" of colleagues who are being eyed as potentially giving tours.", "\"I'm going to wait to make sure we get verification,\" Ryan told reporters on Jan. 13.", "Like Ryan, we are also waiting for that verification.", "Update [June 21, 2022]: Updated in light of new evidence; rating changed from \"Unproven\" to \"Mixture.\"", "Update [June 21, 2022]: Added information regarding a USCP letter stating that Rep. Loudermilk's group never entered the U.S. Capitol building.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]