["The photo was published here on Facebook on 19 December 2015.", "It has been shared more than 40,000 times.", "The Urdu-language caption translates to English as: “These stones were tied by prophet Mohammed Peace be Upon Him 1400 years ago, till today they are still standing the same, if your heart allows then share by saying Glory to God.”", "Below is a screenshot of the misleading post:", "The photo has also been shared here and here with a similar claim.", "The claim is false; the photo shows a sculpture created by an Egyptian artist for Cairo International airport in 2008.", "This photo taken by photo agency Alamy shows the installation at Cairo International airport in Egypt.", "The French language caption translates to English as: “Optical illusion sculpture, Sha'ban Abbas, 2008, at Terminal 3, Cairo Airport, Egypt”.", "Below is a screenshot of the photo:", "Sha’ban Mohamed Abbas is an award winning contemporary sculptor who died at the age of 41 on November 17, 2010.", "Here is a report about his death published by Eygptian newspaper Al-Ahram on November 18, 2010.", "According to this page on the Egyptian government’s official website for fine art, Abbas’ artwork can be found in various museums in Egypt, including Museum of Modern Egyptian Art  in Cairo, New Cairo International Airport and the Garden Museum at Gezira Art Center - Cairo.", "A similar photo of the installation was published in this online magazine in March 2017.", "Below is a screenshot of the photo:", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]