["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "David Perdue's June 23 Twitter post", "Earmarks are the money lawmakers yank from the federal budget to benefit their jurisdictions. Critics of the system tend to use the pejorative term \"pork\" for the same taxpayer-funded projects.", "A pivot to that first definition helped U.S. Sen. Thad Cochran of Mississippi beat a tough tea party-backed challenger in the GOP runoff last week. Cochran focused on the money he brought to the Magnolia State.", "A recent attack in Georgia’s tight Republican runoff for the U.S. Senate focused more on the second understanding of the term, with a tweet for all the Internet to see.", "\"Jack Kingston requested more earmarks than any other GA Congressman and all GA GOP members combined.\" David Perdue wrote over pictures of pigs feeding at the trough, lest anyone miss his contempt.", "That’s a pretty specific claim. And if there’s anything PolitiFact Georgia loves to check, it’s the specifics, especially with the July 22 runoff between Perdue and Kingston  looming.", "Perdue said he based his claim on databases created by the Center for Responsive Politics of OpenSecrets.org.", "Perdue, a former Dollar General CEO, is running as an outsider who sees earmarks as a type of overspending from longtime Washington representatives such as Kingston.", "\"Before my congressman brings money back to Georgia, I want to know what debt I am going to be responsible for,\" Perdue said. \"The earmark provision drives up the debt and is a free pass on the budget responsibility we want from our congressmen and senators.\"", "That kind of criticism prompted Congress to abstain from pork in 2010.", "Kingston told The Atlanta Journal-Constitution in 2008 that he had cut back on his requests for earmarks over those complaints. But he also noted his concern that other states would get more money if he and other Georgia lawmakers quit the practice.", "Open Secrets allows searches to see how much money members of Congress steered to their district for fiscal years 2008 through 2010. Fiscal years run from Oct. 1 to Sept. 30.", "Our review of those databases shows Kingston made 145 requests in those three years, pulling in about $211 million. His next closest colleague had 213 earmarks, totaling about $202 million. But that’s from U.S. Rep. Sanford Bishop, a Democrat from Albany.", "Next on the list from the GOP was U.S. Rep. Phil Gingrey of Marietta, who lost to Perdue and Kingston in the May primary. He had 58 earmarks that totaled about $94 million.", "Together, Georgia’s GOP delegation had about $327 million in earmarks for the three years. Kingston’s total was larger than the other six Republican lawmakers combined.", "Rep", "Party/District", "2010", "2009", "2008", "Total", "Jack Kingston", "R-1", "$66,787,000", "$44,295,625", "$100,273,800", "$211,356,425", "Sanford Bishop", "D-2", "$60,565,000", "$66,440,894", "$75,141,000", "$202,146,894", "Lynn Westmoreland", "R-3", "$0", "$0", "$4,976,000", "$4,976,000", "Hank Johnson", "D-4", "$26,688,000", "$24,785,750", "$14,763,000", "$66,236,750", "John Lewis", "D-5", "$24,529,000", "$18,009,500", "$15,135,500", "$57,674,000", "Tom Price", "R-6", "$0", "$0", "$2,705,000", "$2,705,000", "John Linder", "R-7", "$1,000,000", "$0", "$2,255,000", "$3,255,000", "Jim Marshall", "D-8", "$40,781,000", "$31,510,000", "$50,070,500", "$122,361,500", "Nathan Deal", "R-9", "$2,092,000", "$0", "$8,552,000", "$10,644,000", "Paul Broun", "R-10", "$0", "$0", "$0", "$0", "Phil Gingrey", "R-11", "$15,800,000", "$48,537,750", "$29,696,500", "$94,034,250", "John Barrow", "D-12", "$5,350,000", "$15,046,000", "$21,280,000", "$41,676,000", "David Scott", "D-13", "$38,828,000", "$27,940,500", "$13,432,500", "$80,201,000", "Tom Graves", "R-14", "n/a", "n/a", "n/a", "n/a", "Source: Open Secrets website", "To double-check our numbers, we reached out to Taxpayers for Common Sense, who provides the raw data for the searchable Open Secrets site. The nonprofit, with staffers who have worked for both Democrats and Republicans, shows slightly different tallies for those years – but comes to the same broad conclusion.", "It counts 146 earmarks from Kingston, totaling about $213 million. That compares with $116 million in earmarks from the other six GOP congressmen.", "Kingston, who represents five of Georgia’s eight military installations, noted that much of the funding was for defense or military spending such as an IED simulator at Fort Stewart and hospital renovations at installations statewide.", "Kingston contrasted that record with Perdue’s, whose business record includes a brief leadership of Pillowtex, a troubled North Carolina textile firm that went under shortly after he left.", "\"The majority of what we did was for the military,\" Kingston said. \"I don’t know that we need lectures on fiscal responsibility from somebody with his abysmal track record.\"", "In isolation, those costs don’t appear to be a problem, said Steve Ellis, the vice president of Taxpayers For Common Sense. But money spent there is money not available for other projects that may be more critical.", "But without the procurement process that follows other federal spending, there’s no way to judge the merit of the projects being funded, he said.", "\"If a congressman is saying they know their district better than a pointed-headed bureaucrat, that’s absolutely true,\" Ellis said. \"But with earmarks, they’re saying they know what’s best for all 435 congressional districts. And that’s not true at all.\"", "Perdue said Kingston had more earmarks than any other congressman in the state and more than Georgia’s other GOP congressmen combined.", "Two separate databases back him up. It’s up to voters to decide whether that’s a good thing or a bad thing.", "There is one caveat to Perdue’s claim. It covers three years, and Kingston has been in office for two decades. It’s that bit of context that moves it down just a notch on the Truth-O-Meter.", "We rate Perdue’s statement Mostly True.", "David Perdue Twitter account", "Interview with David Perdue, June 26, 2014", "Interview with Jack Kingston June 27, 2014", "Center for Responsive Politics earmarks database", "Taxpayers for Common Sense earmarks database", "The Atlanta Journal-Constitution, \"State delegation split over 'no-pork' pledge,\" July 25, 2008", "Interview with Taxpayers for Common Sense Vice President Steve Ellis, June 26, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]