["About this rating", "Can ostriches ski? The question may seem a bit ridiculous on its face, but it is one that has been repeatedly asked of us ever since a series of videos purportedly showing the large flightless birds effortlessly skiing down a snowy mountain emerged in the early 2000s:", "The rumor has repeatedly recurred since. In May 2018, for example, the Facebook page posted several images and a video of these skiing ostriches under the caption \"amazing.\" The video racked up millions of views shares within a few days of its initial posting and many commented, perhaps mostly in jest, that the footage showed an elite team of skiing ostriches.", "This footage does not feature a group of ostriches that were trained to ski, but instead comes from an advertising campaign promoting tourism in Japan which used digital editing, professional skiers, and ostrich costumes to make it look as if these flightless birds were skiing down the mountain.", "The commercials were created by Tokyo-based ad agency Tugboat in the early 2000s to promote tourism, skiiing, and train travel in Japan. The first ad was produced by the East Japan Railway Company, while subsequent skiing ostrich videos involved other Japanese companies such as All Nippon Airways.", "As far as we can tell, this ad campaign — which developed a cult-like status in Japan — consists of four different videos. The first showed the ostriches hatching and then racing across the desert in search of snow. The second and third showed the ostriches skiing. And the fourth showed the ostriches skiing through a city street before making it back to the mountain:", "A record of all four of these videos is available via YouTube user JetCrow:", "Kan Taniguchi, Tugboat's marketing director, said that an ostrich was chosen for two reasons: The bird's speed could be associated with Japan's bullet train, and that the sight of a skiing ostrich would be strange, but memorable:", "The campaign started last year, with a single ostrich, and was ranked the fourth-most-remembered among 4,700 spots in monthly awareness tests by a local research company. This year, there are three ostriches because Japan Air Lines and All Nippon joined Japan Railway's campaign, he said. (Although the skiers look amazingly ostrich-like, they are humans inside ostrich costumes.) There are also posters at every train station in Japan, and Japan Railway's Web site features an animated ski scene, with the ostriches and a variety of other creatures like a fuchsia camel lining up for the ski lift.", "The \"skiing ostriches\" were created by mixing video of professional skiers in ostrich costumes and general footage of ostriches at a studio.", "Depth-of-Field.jp.   \"The True Story of Ostrich Who Appeared on CM.\"\r\n    25 February 2005.", "Wentz, Laurel.   \"Spotlight.\"\r\n    Adage.   7 March 2005.", "Payne, Joanne.   \"Japanese Agency Tugboat Sets Up London Office.\"\r\n    Campaign Live.   9 March 2007.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]