["About this rating", "Some states still have laws against oral sex on their books.", "These types of laws are unenforceable due to a 2003 Supreme Court ruling.", "In late 2017, a picture appeared and quickly spread on social media, listing states where oral sex is purportedly still illegal and punishable in some cases by prison time:", "The graphic is accurate in that some states still have laws against oral sex on the books, an artifact of anti-sodomy laws that some states rewrote to specifically target LGBTQ residents. However, this graphic neglects to point out that these types of laws are unenforceable because of the Supreme Court's 2003 ruling in Lawrence v. Texas, which declared that Texas's anti-sodomy law was unconstitutional.", "The high court ruled in a 6-3 decision that two gay men, John Geddes Lawrence Jr. and Tyron Garner, should not have been arrested for what police called \"deviate sexual conduct.\" In the majority opinion, Justice Anthony Kennedy said:", "The present case does not involve minors. It does not involve persons who might be injured or coerced or who are situated in relationships where consent might not easily be refused. It does not involve public conduct or prostitution. It does not involve whether the government must give formal recognition to any relationship that homosexual persons seek to enter. The case does involve two adults who, with full and mutual consent from each other, engaged in sexual practices common to a homosexual lifestyle. The petitioners are entitled to respect for their private lives. The State cannot demean their existence or control their destiny by making their private sexual conduct a crime.", "The Lawrence ruling also struck down anti-sodomy laws around the United States, which included laws prohibiting oral sex. However, according to Camilla Taylor, acting legal director for civil rights group Lambda Legal, the states with such statutes do not have to remove them from legislative records: \"Some of those were enacted by constitutional amendment. Some of them were passed by statute. Those state legislatures have never rescinded them. But they're unconstitutional nonetheless, and they cannot be enforced.\"", "It's true that the laws exist and are on the books. However, as of 2003, they now only exist as a legal -- and unconstitutional -- curiosity.", "FindLaw.   \"Lawrence v. Texas.\"\r\n    Accessed 28 December 2017.", "American Civil Liberties Union.   \"Why Sodomy Laws Matter.\"\r\n    Accessed 28 December 2017.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]