["The United States Secretary of Defence General (Retd.) Lloyd J. Austin met Prime Minister Narendra Modi during his three-day visit to India. This was the first outreach by the US administration since Joe Biden was elected President less than two months ago. NDTV’s report that the US Defence Secretary said that he discussed human rights issue with Indian ministers is receiving substantial backlash on social media. One Avinash Srivastava juxtaposed NDTV’s report with an ANI tweet where ‘sources’ in India state the opposite.", "#NDTV means “Lies”, “Fake News”, & “Propaganda”. #ShutDownNDTV pic.twitter.com/WUEVGX91IG", "— Avinash Srivastava (@go4avinash) March 21, 2021", "Another user Atul Ahuja termed NDTV ‘Pakistan media house’ while claiming that the outlet falsely reported that Austin had a discussion on human rights issue with Indian ministers when ANI says that he did not. Both Ahuja and Srivastava are followed by BJP leaders on Twitter.", "Nothing just one more propaganda from alleged Pakistani Media house. pic.twitter.com/FseVicqDHg", "— Atul Ahuja (@atulahuja_) March 21, 2021", "There are several other posts where NDTV has been accused of spreading false news.", "NDTV was not the only media outlet that reported the news. Initial reports said that human rights were discussed in a meeting with the US Secretary of Defence. In fact, while social media users shared a tweet by ANI that cites ‘high-level sources’ claiming no discussions took place, ANI had earlier quoted ‘reliable’ sources in a report stating, “In an hour-long meeting between External Affairs Minister S Jaishankar and US Defence Secretary Lloyd Austin, apart from geostrategic affairs, the issue of Human Rights also figured.”", "ANI had also tweeted about the discussion.", "Defence Secretary said that as the two largest democracies in the world, human rights and values are important to us and we will lead with these values: Sources on meeting between EAM Dr S Jaishankar & US Defence Secretary Lloyd J. Austin III.", "— ANI (@ANI) March 20, 2021", "Two days after the above report, ANI claimed ‘high-level Indian sources’ confirm that there was no discussion on human rights in India with US Defence Secretary Lloyd J Austin.", "High-level Indian sources confirm that there was no discussion of human rights in India with US Defence Secretary Lloyd J Austin III. In fact, human rights & values were mentioned as shared attributes. The only mention of minorities was by the EAM in the context of Afghanistan.", "— ANI (@ANI) March 20, 2021", "The US Department of Defence has uploaded the full transcript of the conference held in New Delhi attended by Lloyd J Austin. The US Secretary of Defence was asked whether he raised the topic of violations of human rights in India, especially against Muslim minorities, during his interaction with PM Modi.", "Austin answered that he did not have an opportunity to discuss the issue with the Prime Minister but he did have a conversation with other members of the cabinet.", "A video of his reply can also be watched below.", "ANI has cited ‘sources’ to claim that human rights issue wasn’t brought up in the conference. India’s denial is not on the record. The US, on the other hand, has placed Austin’s statement on the record.", "Several journalists have also pointed out that the Indian government has to deny on the record.", "Interesting that “government sources” are saying that there was no conversation on human rights in India. Austin said it on the record, government must deny it on the record. https://t.co/pUkb2wnZEx pic.twitter.com/BV62qC2QFu", "— Suhasini Haidar (@suhasinih) March 21, 2021", "As has been said by others, if a visiting dignitary gives an on record answer to a specific question about human rights in India, the government rebuttal has to be on the record as well to have any meaning or weight. Unless it is meant for WhatsApp groups and the likes! https://t.co/58wwCkaPR9", "— Sushant Singh (@SushantSin) March 22, 2021", "Not only was NDTV unfairly targetted for a report carried by multiple news outlets, but NDTV’s story was also not incorrect. Defence Secretary Lloyd J Austin’s statement that human rights in India were discussed with Indian cabinet ministers is on the record. While ‘sources in India’ say no discussion took place, it has not yet been denied by the government on the record. ANI first quoted ‘reliable sources’ and claimed that the issue of human rights was brought up, and later quoted ‘high-level sources’ to claim that it wasn’t.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]