["By Lori Robertson, D'Angelo Gore, Eugene Kiely and Rem Rieder", "Posted on September 18, 2020", "Democratic presidential nominee Joe Biden answered questions from the public in a CNN town hall, but he got some facts wrong and misled on others:", "The Sept. 17 town hall was held near Biden’s hometown of Scranton, Pennsylvania, at a drive-in theater to maximize social distancing.", "Biden claimed Trump could have prevented “all” of the deaths in the U.S. from COVID-19 if he “had done his job,” citing unspecified “data.” We know of no such data or any research that would support that notion.", "Biden: And if president had done his job — had done his job from the beginning — all the people would still be alive. All the people — I’m not making this up, just look at the data. Look at the data.", "The Biden campaign hasn’t responded to our request for the “data” Biden said supports his claim. But it’s far-fetched to say any leader could have done something to prevent every single one of the more than 197,000 deaths from COVID-19 in the United States.", "We don’t know what actions Biden believes the president could have taken to stop all deaths. But even if the U.S. had implemented incredibly strict travel limitations very early on, the body of research shows that could have delayed the spread of the virus but not contained it. We reviewed that research when Trump claimed that the travel restrictions he instituted on China had saved “hundreds of thousands” of lives. There’s no support for that figure.", "And there’s no support for the idea that a severe travel policy would have saved all lives, either.", "Saad B. Omer, director of the Yale Institute for Global Health, told us in April that previous studies of viruses with a reproduction number of 1.9 or higher, meaning the average number of other people one person infects, have shown the travel limitations have to be very strict to have an effect. Travel restrictions “can have an impact if you shut down 90% of all travel,” Omer said. But, “even then, it delays it a little bit but it doesn’t stop it.”", "Even countries with much smaller outbreaks than the U.S. have had some deaths from COVID-19. Biden mentioned Canada in his town hall, saying, “Last Friday, we had a thousand deaths, all of Canada had zero deaths.” That’s correct, according to figures from Worldometer. But Canada still has had deaths from COVID-19 — more than 9,000 deaths.", "Even the tiny European country of Liechtenstein — population 39,000 — has had one death among its 112 cases, according to Johns Hopkins University & Medicine’s Coronavirus Resource Center.", "Dr. Lee Riley, professor and chair of the Division of Infectious Disease and Vaccinology at the University of California, Berkeley School of Public Health, told us in an email: “There is no data to make the claim that ‘all the people would be alive.'”.", "Riley said the president could have better mitigated the spread of the coronavirus. “The epidemic would have been under better control by now and many deaths could have been prevented had the President allowed organizations like the CDC do their work without his interference,” Riley said. “It can be clearly said the President’s actions not only prevented control of the epidemic but even fueled the epidemic. That’s what Biden should have said.”", "Biden claimed the director of the Centers for Disease Control and Prevention, Dr. Robert Redfield, said wearing masks would save 100,000 lives from now until the beginning of next year. He didn’t.", "“His own CDC director contradicted him recently,” Biden said referring to Redfield, whom Trump appointed to lead the CDC in 2018. “He said, if in fact, you just wore this mask, nothing else, but this mask, you would save between now and January, another hundred thousand lives.”", "That’s a projection from the University of Washington’s Institute for Health Metrics and Evaluation — not Redfield.", "On Sept. 3, IHME said its updated model projected there would be 410,000 U.S. deaths from COVID-19 at the end of 2020. IHME also said that 122,000 of those deaths could be prevented with increased mask use.", "In congressional testimony on Sept. 16, Redfield did tell senators that face masks “are the most important, powerful public health tool we have” against COVID-19.", "“I will continue to appeal for all Americans, all individuals in our country, to embrace these face coverings,” he said. “I have said it, if we did it for six, eight, 10, 12 weeks we would bring this pandemic under control. … We have clear scientific evidence they work and they are our best defense. I might even go so far as to say that this facemask is more guaranteed to protect me against COVID than when I take a COVID vaccine.”", "But Redfield didn’t say “100,000 lives” could be saved by wearing masks.", "Biden misleadingly claimed Trump “said that no longer would we in fact provide masks for schools … because it was not a national emergency.” The Federal Emergency Management Agency said it would stop this month reimbursing states for the costs of masks for schools, but the Department of Health and Human Services said it would provide up to 125 million cloth masks for schools.", "Biden: The president of the United States said that no longer would we in fact provide masks for schools — for schools — pay them to have the masks in school, because it was not a national emergency. What is he talking about? It’s totally irrational.", "NPR reported on Sept. 1 that Keith Turi, FEMA assistant administrator for recovery, told state and tribal emergency managers that FEMA would stop on Sept. 15 reimbursing states for cloth masks and other personal protective equipment for places that are deemed nonemergency locations — including schools.", "“The changes narrow what constitutes an ’emergency protective measure’ and is thus eligible for FEMA’s Public Assistance Program,” NPR, which obtained a recording of the call, said.", "But that doesn’t mean the federal government isn’t providing any masks to schools. The same NPR story noted the HHS would provide up to 125 million masks to schools.", "HHS’ Public Health Emergency webpage says: “The U.S. Department of Health and Human Services will be providing up to 125 million cloth masks to states for distribution to schools. The Administration intends for these masks to support students, teachers, and staff in public and private schools reopening, with an emphasis on students who are low-income or otherwise with high needs and schools providing in-person instruction.”", "NPR also said states may stock up on such protective equipment before the FEMA policy went into effect. “The FEMA policy is not retroactive, so it could lead to a swift stockpiling during the next two weeks as states rush to get purchases in under the wire,” NPR reported.", "Biden appears to have exaggerated when he said, “The idea that you’re going — to not tell people what you’ve been told, that this virus is incredibly contagious, seven times more contagious than the flu.”", "Biden may have been referring to the revelation that Trump, while downplaying the seriousness of COVID-19 to the public, had told journalist Bob Woodward in interviews that Trump knew the novel coronavirus was highly contagious and deadly.", "“Bob, it’s so easily transmissible, you wouldn’t even believe it,” Trump told Woodward on April 13, according to an audio recording Woodward recently released.", "In an earlier conversation, on Feb. 7, Trump told Woodward the virus was more fatal than “even your strenuous flus.” Trump said “this is deadly stuff,” adding that it might be five times more lethal than the flu.", "But there’s no indication that Trump said the virus was “seven times more contagious than the flu.”", "As we wrote in late January, an early estimate from the World Health Organization suggested that every infected person would spread SARS-CoV-2, the virus that causes COVID-19, to 1.4 to 2.5 people, on average. A team at Imperial College London pegged the basic reproductive number — the number of secondary infections generated from one infected individual — at 2.6. A group at the University of Bern in Switzerland estimated the reproductive number, or R0, to be around 2.2, and Harvard University researchers estimated a figure between 2 and 3.1.", "The WHO later said in mid-March that the reproductive number, which reflects potential transmission, “is understood to be between 2 and 2.5 for COVID-19 virus, higher than for influenza.”", "Seasonal influenza has an R0 value ranging from around 1 to 2. That would mean SARS-CoV-2 is about two to three times more contagious.", "In response to a question about whether he supports “the continuation of fracking safely and with proper guidelines,” Biden pivoted to discuss the creation of so-called green jobs.", "In doing so, he appeared to exaggerate the number of jobs that can be created by capping orphan oil and gas wells. Orphan wells are gas and oil operations that have been abandoned and there is no responsible party to pay for closing up the wells.", "Biden: We can provide for right now as you know, for thousands of uncapped wells because a lot of companies gone out of business, whether they’re gas or oil facilities, we can put to work right away 250,000 people from iron workers and other disciplines, making union wages.", "We don’t know where Biden got his figure of 250,000. He used the same number in a climate change speech three days earlier.", "A recent report by the Center on Global Energy Policy at Columbia University estimated that a “significant federal program” could potentially create “as many as 120,000” jobs — about half of what Biden said. That assumes plugging 500,000 wells at a cost of between $12 billion and $24 billion.", "The number of orphaned wells is significant, but not known. The Columbia report said there are “56,600 documented unplugged orphaned wells as of 2018,” citing a report by the Interstate Oil and Gas Compact Commission, a multistate government entity. “Addressing 500,000 wells would require state, tribal, and federal agencies to identify and prioritize hundreds of thousands of additional wells,” the Columbia report said.", "Update, Sept. 19: Biden’s energy plan on his campaign website also cites the 250,000 figure but includes “reclaiming abandoned coal, hardrock, and uranium mines,” as well as “plugging abandoned oil and natural gas wells” for that amount of job creation.", "Biden wrongly claimed that “we now have a larger trade deficit … than we’ve ever had with China.” He would have been right two years ago, but that is no longer true.", "In fact, the trade deficit with China is less than it was in the last year of the Obama administration.", "It’s true that the U.S. trade deficit with China in goods and services was a record $380 billion in nominal dollars in 2018, according to the Bureau of Economic Analysis. The previous high was $337.3 billion in 2017 — roughly the same as it was in 2015 when Barack Obama was president and Biden was vice president.", "But the trade deficit fell last year to $308 billion — which is slightly below the $310 billion trade deficit in Obama’s last year in office in 2016.", "And it continues to fall. The most recent 12 months on record (ending in June) shows a deficit of $273.3 billion – which is $37 billion, or 12%, less than what it was in 2016.", "Dan Ikenson, director of Cato’s Herbert A. Stiefel Center for Trade Policy Studies, attributed the declining trade deficits in large part to Trump’s trade war with China, which began in 2018 and resulted in both countries imposing escalating trade tariffs on certain imports.", "Ikenson told us in an email that trade deficits, in general, are the result of “macroeconomic phenomena,” not trade policy. But “tariffs imposed on a particular country” — such as China — can affect trade deficits with that country. The impact of the tariffs on the U.S. trade deficit with China “was profound in 2019,” he said, and the U.S. trade imbalance with China has continued to fall in 2020 due to “the tariffs and the global economic contraction.”", "Biden falsely claimed that Trump has never condemned the far right and white supremacists. He did, in the aftermath of the violence in Charlottesville, Virginia, in 2017.", "It is true, however, that Trump has done so rarely, and has far more frequently condemned violence on the left. The president declined to criticize Kyle Rittenhouse, a 17-year-old Trump supporter charged with killing two protesters in Kenosha, Wisconsin, with an assault-style weapon.", "Biden: I’ve condemned every form of violence, no matter what the source is. No matter what the source is. The president is yet to condemn, as you’ve probably noticed, the far-right and the white supremacist, and those guys walking around with the AK-47s and not doing a damn thing about them. … But folks, I’m waiting for the day when he says I condemn all those white supremacy, I condemn those militia guys as much as I do every other organizational structure.", "As we have written, after a violent white nationalist rally in Charlottesville on Aug. 12, 2017, in which one person was killed and others were injured, Trump said, “We condemn in the strongest possible terms this egregious display of hatred, bigotry and violence, on many sides. On many sides.”", "But much of the press coverage focused on another remark Trump made, that there had been “very fine people on both sides” in Charlottesville.", "So two days later, Trump issued a statement from the White House in which he specifically condemned the Ku Klux Klan, neo-Nazis and white supremacists.", "Trump, Aug. 14, 2017: As I said on Saturday, we condemn in the strongest possible terms this egregious display of hatred, bigotry, and violence. It has no place in America.", "And as I have said many times before: No matter the color of our skin, we all live under the same laws, we all salute the same great flag, and we are all made by the same almighty God. We must love each other, show affection for each other, and unite together in condemnation of hatred, bigotry, and violence. We must rediscover the bonds of love and loyalty that bring us together as Americans.", "Racism is evil. And those who cause violence in its name are criminals and thugs, including the KKK, neo-Nazis, white supremacists, and other hate groups that are repugnant to everything we hold dear as Americans.", "According to the journalist Bob Woodward in his book “Fear,” Trump later told Rob Porter, a White House aide at the time who had urged him to make the second statement, “That was the biggest fucking mistake I’ve made. You never make those concessions. You never apologize. I didn’t do anything wrong in the first place. Why look weak?”", "When given an opportunity to condemn the actions of the pro-Trump teenager who allegedly killed two protesters in Kenosha, Trump demurred.", "Reporter, Aug. 31: Are you going to condemn the actions of vigilantes like Kyle Rittenhouse?", "Trump: We’re looking at all of it. And that was an interesting situation. You saw the same tape as I saw. And he was trying to get away from them, I guess; it looks like. And he fell, and then they very violently attacked him. And it was something that we’re looking at right now and it’s under investigation. But I guess he was in very big trouble. He would have been — I — he probably would have been killed.", "Editor’s Note: Please consider a donation to FactCheck.org. We do not accept advertising. We rely on grants and individual donations from people like you. Credit card donations may be made through our “Donate” page. If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, 202 S. 36th St., Philadelphia, PA 19104.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here for more.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]