["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Biden campaign staff members individually made donations to the Minnesota Freedom Fund, a nonprofit that pays bail for low-income individuals.", "The fund said it raised around $30 million, in total, following George Floyd’s death.", "Former vice president Joe Biden has spoken out against violence incited during demonstrations following the death of George Floyd, and his official policy platform calls for doing away with cash bail. But there is no evidence that his presidential campaign donated $20 million to bail out protesters.", "A post on Facebook that is critical of both the demonstrators and Democrats claims otherwise:", "\"Joe Biden campaign has donated 20 million dollars to bail out rioters what the hell does that tell you about the democrats.\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "It’s not accurate. First, not everyone who has been arrested during protests could fairly be described as \"rioters.\" Those arrested have included curfew violators, working press and others.", "Next, several campaign staff members did donate their own money to a Minnesota nonprofit that pays the bail for low-income individuals. But the campaign itself did not donate the money and there is no evidence for the $20 million figure.", "President Donald Trump said that Biden campaign staff members donating money for protesters’ bail are \"working to get the Anarchists out of jail.\"", "When we posed the question to the Biden campaign, a campaign official cited the candidate’s public anti-violence statements and his official platform that calls for eliminating cash bail.", "But there is no evidence the campaign itself donated $20 million.", "\"Several of our staff members exercised their First Amendment right to donate to the Minnesota Freedom Fund, on an individual basis,\" a Biden campaign official told us. \"Vice President Biden supports the elimination of cash bail.\"", "About 13 Biden campaign staff members posted on Twitter that they made donations to the fund, Reuters reported, with one posting an image of a $50 receipt.", "The Minnesota Freedom Fund is a nonprofit that opposes the practice of cash bail and uses donations to pay bail \"for low-income individuals who cannot otherwise afford it,\" the organization says on its website. \"People of color and immigrants face higher rates of arrest, harsher sentencing, and disparities in the setting of bail compared to white citizens. We pay bail as a way to reduce harm to individuals in the immediate term. But we never lose sight of our mission to abolish cash bail and have the burden of proof for pretrial risk fall on prosecutors, not the accused.\"", "In an effort to find out where the $20 million figure might have originated, we found a May 30 Forbes report that said the Minnesota Freedom Fund raised about $20 million — in total from all donors — over four days following George Floyd’s death in police custody.", "The Minnesota Freedom Fund told PolitiFact that no one donor has contributed $20 million.", "\"We have had over $30 million in donations since the police murder of George Floyd, from over 900,000 donors, with an average donation of about $30,\" a spokesperson wrote in a June 3 email. \"No one donor nor one small group of donors donated $20 million.\"", "The fund is no longer soliciting donations and is encouraging people to donate to Floyd’s family and other local organizations run by black community members.", "A Facebook post says that Biden’s campaign donated $20 million to bail \"rioters\" out of jail.", "The campaign says individual staff members, not the campaign, donated money to the Minnesota Freedom Fund. There is no evidence that totaled to $20 million, however. That’s the total amount the organization said it raised from all donors in the first few days following Floyd’s death.", "The post assumes that every person the nonprofit assists is violent and ignores the individuals who may have been detained during peaceful protests.", "We rate this False.", "Facebook post, May 31, 2020", "Minnesota Freedom Fund, Accessed June 3, 2020", "The Hill, Trump slams Biden staff for donating bail money to protesters, June 1, 2020", "Reuters, Biden staff donate to group that pays bail in riot-torn Minneapolis, May 30, 2020", "Forbes, Minnesota Freedom Fund Raises $20 Million In 4 Days Amid George Floyd Protests, May 30, 2020", "Email interview, Joe Biden campaign communications, June 2, 2020", "Email interview, Minnesota Freedom Fund spokesperson, June 3, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]