["Since state Rep. Duane Hall won his first election in 2012, his name has been accompanied by the letter \"D\" for Democrat.", "But this year, it appears that he’s misusing the party label.", "Hall, a Raleigh attorney, is serving his third term representing state House District 11 and is seeking a fourth. But to earn it, he’ll first have to beat challenger Allison Dahle in the May 8 Democratic primary.", "Now, perhaps to reinforce his status as the strongest Democrat in the race, Hall is circulating mailers that suggest he’s endorsed by the Democratic Party.", "One mailer boasts that Hall is \"making education priority one.\" And at the bottom, the words \"endorsed by\" accompany a blue \"D\" with a circle around it. The logo is almost identical to the one used by the Democratic National Committee.", "Hall indeed received the support of Democrats in previous elections. The Wake County Democratic Party included Hall’s name on voter guides at the polls in the 2014 and 2016 general election, said Virginia Reed, the group’s executive director.", "\"He has been listed on our Democratic candidate slate cards in the past which could be considered an implied endorsement,\" Reed said.", "And the North Carolina Democratic Party promoted Hall in a similar manner, party spokesman Robert Howard said.", "No primary endorsements", "However, PolitiFact North Carolina found that neither the Wake County Democratic Party, the NC Democratic Party nor the DNC have endorsed Hall in his primary race against Dahle.", "On Wednesday, each party organization told PolitiFact that they don’t endorse any candidates in primary races.", "\"We have not endorsed any 2018 candidates and will not until after May 8th,\" Reed said on behalf of the county party.", "\"The state party supports Democratic candidates in the general election but does not typically endorse legislative candidates in the traditional sense, leaving that to local and county parties,\" Howard said.", "In fact, the state party has been the opposite of supportive of Hall this year. On Feb. 28, party chairman Wayne Goodwin called on Hall to resign from the legislature because he faced allegations of sexual misconduct.", "Calls to resign", "\"Sexual harassment is never acceptable – no matter the party or politics. These are serious allegations and Representative Hall should step down,\" Goodwin said in a statement. \"The North Carolina Democratic Party has no tolerance for sexual harassment and we continue to encourage women to speak out against inappropriate behavior of any kind.\"", "Gov. Roy Cooper, a Democrat, also called Hall to resign.", "Hall, for his part, denied that he has harassed anyone.", "Nonetheless, on Thursday, the DNC joined the state party in calling for Hall to resign.", "\"The DNC does not endorse candidates running in contested primaries and we have not endorsed Duane Hall in North Carolina. We were not informed, nor did we approve the use of our logo in his mailer,\" Francisco Pelayo, DNC director of Hispanic media and regional press secretary, wrote in an email.", "\"We take sexual harassment very seriously and we are very concerned by the allegations against Hall. We stand with Governor Cooper’s and NCDP’s calls for him to step down,\" Pelayo wrote. He added that he’s not aware of any time that the DNC has previously endorsed Hall.", "It’s unclear why Hall is using the \"D\" logo. He didn’t respond to an email or voicemails left by a reporter.", "What is clear is that the national, state and county parties haven’t endorsed him this year.", "Our ruling", "Hall’s mailer suggests that he’s endorsed by the Democratic Party. The local and state parties have promoted him in the past. But the Wake County Democratic Party, NC Democratic Party and Democratic National Committee all denied making any primary endorsements at all. Not only are the parties not endorsing him, the NCDP and DNC have called on him to step down. We rate this claim False.", "Mailers distributed by the Friends of Duane Hall campaign committee and provided to PolitiFact.", "Phone and email correspondence with Francisco Pelayo, spokesman for the Democratic National Committee.", "Email correspondence with Robert Howard, spokesman for the North Carolina Democratic Party.", "Electronic correspondence with Virginia Reed, executive director of the Wake County Democratic Party.", "Feb. 28 N.C. Democratic Party press release, which included a statement from party chairman Wayne Goodwin.", "Stories by The News & Observer, \"NC Democratic leaders call on Raleigh Democrat to resign over sexual harassment allegations,\" published Feb. 28, 2018; \"Amid calls to resign, Duane Hall acknowledges kiss but denies harassment,\" published March 2, 2018.", "Story by N.C. Policy Watch, \"Top Democrats call on Rep. Duane Hall to resign amid sexual misconduct allegations,\" published Feb. 28, 2018.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]