["“F ING TRUMPER,” says a December 27, 2020 Facebook post that includes the photo of a man wearing a pro-President Donald Trump hat, accompanied by the text: “Tennessee Christmas bomber Anthony Quinn Warner 63.”", "“How many Trump supporters will do this, thinking they’re doing Trump’s wishes,” said another post sharing the same photo, before it was removed.", "Similar claims can be found on Facebook here, here and here,  on Twitter here and on Instagram here.", "An explosion ripped through downtown Nashville, Tennessee on Christmas morning, killing the man suspected of setting off the bomb, according to federal prosecutor Don Cochran.", "But the photo of the man in the pro-Trump hat in the social media posts does not match the image of the alleged bomber released by the FBI.", "On December 25, authorities released a photo of Warner, the owner of the recreational vehicle that exploded in Nashville after a warning message was played. Two days later, the identity of the suspect was confirmed after the analysis of human remains found at the scene.", "Warner, a 63-year-old resident of Antioch, Tennessee, is believed to be solely responsible for the explosion that damaged dozens of businesses. There were no other deaths, but at least three people were wounded by the blast.", "As of December 28, authorities have yet to determine Warner’s motives and have so far not linked the bombing to any political party or ideologies.", "A series of reverse image searches did not yield the identity of the person wearing the Trump hat.", "AFP Fact Check also debunked false claims linking the explosion to a “forensic audit” of voting machines used during the 2020 presidential election.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]