["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A voter turns in a mail-in ballot, Nov. 6, 2018. Andrew Nixon / Capital Public Radio", "California’s independent voters had to re-register with the GOP to vote for Republican presidential candidates in the state’s March primary.", "A Facebook post that circulated ahead of the primary was reposted in June suggesting independents must do this again for the November general election.", "That’s wrong. Voters can select the candidate of their choice, no matter their party affiliation in the general election.", "The Facebook post also falsely claimed that California made the rules requiring a change of registration. In reality, political parties decide whether independent voters can participate in their presidential primary elections every four years.", "A Facebook post that gained traction ahead of California’s presidential primary in March has new life, but spouts some of the same misleading information.", "The post — reposted to Facebook June 6 — claims California’s registered independents must re-register with the GOP \"to vote republican come 2020.\" It also alleges, without evidence, that the state came up with this requirement \"hoping no one figures it out in time.\"", "It was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about PolitiFact California’s partnership with Facebook).", "We fact-checked similar misinformation ahead of the primary. But with this post re-circulating, we decided to set the record straight, again.", "Differences Between California’s Primary and General Elections", "According to the California Secretary of State’s Office, political parties — not state officials  — decide whether and how the state’s independent voters, also known as No Party Preference voters, can participate in each party’s presidential primary election.", "The restrictions make it more difficult but not impossible to vote for your favorite candidate. For example, the Democratic party required California’s more than 5 million registered independents to request a \"crossover ballot\" in March to vote for a Democratic presidential candidate. But it did not force them to re-register.", "By contrast, the Republican party required independent voters to register with the GOP to participate in its primary. So, the warning in the first part of the Facebook post was correct — for the March primary.", "These requirements, however, do not apply to California’s November general election.", "\"The assertion in that Facebook post is absolutely not true,\" Sam Mahood, spokesperson for the California Secretary of State’s Office, wrote in an email this week. \"In a General Election you can vote for any candidate, regardless of the voter’s party.\"", "Mahood cited California Elections Code section 13206.5, which covers statewide general elections and states:", "\"All voters, regardless of the party preference they disclosed upon registration, or refusal to disclose a party preference, may vote for any candidate for a voter-nominated or nonpartisan office.\"", "Our ruling", "A resurfaced Facebook post claims California’s registered independents must re-register as Republicans to vote for GOP candidates \"come 2020.\" It also alleges that California came up with this rule \"hoping no one figures it out in time.\"", "The first part was correct for the March primary. But it doesn’t apply to California’s November general election, when voters can select the candidate of their choice, no matter their party affiliation.", "The second part is false. The political parties, not the state, set the rules for participating in presidential primaries.", "This post was partially-wrong the first time. Now, the whole thing is wrong.", "We rated it False.", "FALSE – The statement is not accurate.", "Facebook post, June 11, 2020", "Sam Mahood, spokesperson, California Secretary of State’s Office, email exchange June 16, 2020", "PolitiFact California, There’s A Lot Of Misinformation About California’s March Primary Election. Here Are The Facts., Feb. 11, 2020", "CapRadio, California Election Officials Address Confusion Over No Party Preference Voting In State’s Presidential Primary, Jan. 6, 2020", "California Elections Code, section 13206.5.", "Associated Press, Independents in California can vote Republican in 2020 presidential election, June 16, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]