["This image was posted on Facebook here on March 22, 2021.", "The Thai caption reads: “Poor MK as an anti-monarchy MP announced the ban, the restaurant is now packed. Grab drivers scrambling over orders, barely any seats available.”", "MK is a popular restaurant chain in Thailand, specialising in Chinese Suki cuisine.", "The restaurant chain was hit by a boycott in March 2021, fuelled by anti-government Twitter users who accused the popular restaurant chain of sponsoring a pro-government news outlet, according to a report on local news website Thai Enquirer.", "Thai opposition MP Amarat Chokepamitkul from the Move Forward Party said in a Facebook post on March 22, 2021 that she would “stop eating at MK... until sponsorship for Top News channel ends”.", "MK has not spoken publicly to confirm or deny the sponsorship.", "The same image has been shared alongside similar claims in March 2021 on Facebook here, here and here.", "However, the claim is false. The photo was in fact taken in March 2020.", "A Google reverse image search found the same image published here in an article on 28 March, 2020 by Thai economics magazine Sentangsedtee.", "The article’s headline reads: “Strong demand for MK's Buy 1 get 1 free Duck promotion as couriers packed in front of restaurant”.", "“After MK announced a buy 1 get 1 free offer on duck with the hope of helping Thais prevail through the Covid-19 crisis, Sentangsedtee reporter has reported that Grab food couriers are lining up to receive orders at MK Restaurants at Big C supermarket in Saphan Kwai, crowding outside at the branch,” the article reads.", "Below is a screenshot comparison between the photo in the misleading Facebook post (left) and the photo from Sentangsedtee’s article (right):", "The same image also appeared in another report here by local newspaper Manager Online on March 31, 2020. The article’s headline reads: “MK Suki explains viral clip couriers packed in front of restaurant”.", "A different angle of the congestion in front of the restaurant can be seen in this YouTube video by Rueng Lao Chao Nee, a news programme on Thai TV station Channel 3.", "The video’s Thai language title reads in English: “Famous restaurant organises food couriers after viral clip shows heavy congestion for the buy-1-get-1 free promotion”.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]