["The photo was published here on Facebook by an Australia-based user on August 2, 2020. The post has been shared more than 400 times.", "The text superimposed on the photo reads: “Protests in Berlin today against the CV Lockdown and tyranny. MSM says 20-25K protestors with most headlines saying ‘thousands of people’... According to police: 800,000 to 1,300,000”.", "The post’s caption reads: “And meanwhile in Australia the majority are happy to wear a muzzle and sit in front of the tv waiting to be told what to do next. The problem is not those that implement tyranny but those who comply with it.”", "On August 2, 2020, thousands gathered in the German capital to protest against COVID-19 restrictions. Here is an AFP report about the demonstration.", "The image has also been shared on Facebook here, here, here, here, here, here and here and on Twitter here alongside a similar claim.", "The claim, however, is false.", "A reverse image search on Google found an identical photo published on the website for Switzerland’s Street Parade, in its 2018 photo gallery.", "Below is a screenshot comparison of the photo in the misleading post (L) and the image on the Street Parade website:", "AFP located the bridge where the photo was taken here on Google Street View.", "Street Parade is an annual music festival held in Switzerland’s largest city Zurich. The 2020 Street Parade, due to take place on August 8, 2020, was cancelled due to the COVID-19 pandemic.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]