["“Breaking: In Surat Public Started Protests Against #EVM Without Any Politician Or Political Support & The Bootlicker Media Isn’t Showing This On Any News Channels The Public Is On Streets Seems This Will Be The Start Against Weakening Of Indian Democracy& #EVMHacking #RT Spread”", "The above message is circulated on social media with a set of images where people can be seen holding placards in opposition to the use of Electronic Voting Machines (EVMs). According to the message, people in Surat are protesting against the use of EVMs without the backing of any political party. It also attempts to create a narrative that media organization won’t cover the event that how independent citizens are raising their concern over the alleged EVM hacking.", "Breaking : In Surat Public Started Protests Against #EVM Without Any Politician Or Political Support & The Bootlicker Media Isn’t Showing This On Any News Channels The Public Is On Streets Seems This Will Be The Start Against Weakening Of Indian Democracy& #EVMHacking #RT Spread pic.twitter.com/u1VHXQyeZ4", "— 💞Sohail Khan Bobby💞 (@SohailBobby) May 27, 2019", "Few more individuals on Facebook have shared these images with the identical narrative.", "It was found that the images circulating on social media as of a recent protest against the use of EVMs are old and unrelated to the 2019 Lok Sabha elections. Upon the reverse image searching the images on Google and Yandex, Alt News was able to establish that the images existed on the internet before the commencement of the Lok Sabha polls.", "An article published by Outlook on May 13, 2017, carried the below image. This photo is related to a protest held by a group of Aam Aadmi supporters, outside the Election Commission India office, with a demand that VVPAT-equipped electronic voting machines be used in all the future elections.", "This image was uploaded on a blog published on January 20, 2018. By Google searching the name board, seen in the background of protesters, which reads “Mahatma Gandhi Nagar Gruh”, we found that the protest took place in Vadodara.", "We also found a corresponding video of the protest uploaded on YouTube on December 20, 2017.", "As stated in the caption of the image posted below, it belongs to a demonstration held by a group of protesters, who demanded an inquiry into the EVM machines used during the UP assembly election, in March, 2016.", "Old images of protests raising questions against the use of EVM machines were circulated on social media in an attempt to build a narrative that recent protests were held in the country after the recently concluded Lok Sabha polls.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]