["By Isabella Fertel", "Posted on March 5, 2020", "An article circulating on social media claims without evidence that Pope Francis and two of his aides have tested positive for the novel coronavirus. The Vatican has said the pope has a cold, “with no symptoms related to other pathologies.”", "An article circulating on Facebook falsely claims that Pope Francis and two of his Vatican aides have tested positive for the novel coronavirus, COVID-19. The article, which originally appeared on the website MCM News, also includes photos of Francis looking visibly ill, blowing his nose and coughing during a Mass in Rome on Ash Wednesday.", "The Italian newspaper Il Messaggero reported on March 3 that the pope has been tested for the coronavirus and that his results were negative. Il Messaggero does not list a source for the information about test results, but multiple news outlets have since repeated the claim, citing the Il Messaggero article.", "The Vatican has not verified any of these claims, nor has it disclosed whether or not the pope was tested for the coronavirus.", "Vatican spokesman Matteo Bruni issued a statement on March 3 saying, “The cold the Holy Father was diagnosed with recently is running its course, with no symptoms related to other pathologies.”", "“In the meantime, Pope Francis celebrates Mass daily and is following the spiritual exercises taking place at the Divine Master House in Ariccia,” Bruni said, referring to the Lenten retreat.", "Speculation regarding the pope’s health began after he cancelled his participation in the weeklong retreat in the Roman countryside. During the traditional Sunday blessing on March 1 in St. Peter’s Square, the pope told the crowd that “unfortunately a cold prevents me from participating this year.”", "It is the first time in his papacy that the 83-year-old pontiff has had to miss the event. Francis also canceled two planned official audiences earlier in the week due to what Bruni called “a slight indisposition.”", "The rumors regarding the pope’s health come as Italy faces the largest outbreak of the coronavirus in Europe. In a media briefing earlier this week, World Health Organization Director-General Tedros Adhanom Ghebreyesus said Italy is one of four countries (including South Korea, Iran and Japan) that is of “greatest concern” to the WHO as the coronavirus continues to spread.", "Italy has had more than 3,000 confirmed cases within its borders, resulting in more than 100 deaths. The Italian government recently mandated the temporary closure of all schools and universities in order to further prevent the spread of the illness.", "The Centers for Disease Control and Prevention states that “[o]lder people and people with certain underlying health conditions like heart disease, lung disease and diabetes, for example, seem to be at greater risk of serious illness” as a result of contracting the coronavirus. Due to the pontiff’s age and diminished lung capacity — the pope reportedly had a lung removed as a teenager — Francis is among those most at risk.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "Bordoni, Linda. “Pope to follow Spiritual Exercises from the Vatican.” Vatican News. 1 Mar 2020.", "“Coronavirus, tampone negativo per Papa Francesco: e il Vaticano si blinda.” Il Messaggero. 3 Mar 2020.", "“Coughing pope cancels participating in Lenten retreat.” Associated Press News. 1 Mar 2020.", "“COVID-19 in Italy.” Centers for Disease Control and Prevention. 5 Mar 2020.", "Glatz, Carol. “Pope has been diagnosed with cold; symptoms unrelated to other illness.” Catholic News Service. 4 Mar 2020.", "Kottasová, Ivana. “Italy shuts all schools over coronavirus outbreak.” CNN. 4 Mar 2020.", "“Novel Coronavirus (COVID-19) Situation.” World Health Organization. Accessed 5 Mar 2020.", "Padilla, Brandon. “The #pope and his aides have been #quarantined and receiving #medical attention near #SantaMarta, the #Vatican hotel where he lives.” Facebook. 29 Feb 2020.", "“Pope has been diagnosed with cold; symptoms unrelated to other illnesses.” Catholic News Service. 4 Mar 2020.", "“Pope postpones official audiences but continues meetings at Santa Marta.” Vatican News. 28 Feb 2020.", "“Pope tests negative for coronavirus, Italy report says.” Reuters. 3 Mar 2020.", "“South Korea, Iran, Italy and Japan are greatest virus concern.” Reuters. 2 Mar 2020.", "“Vatican confirms Pope Francis and two aides test positive for Coronavirus.” MCM News. 29 Feb 2020.", "World Health Organization. “Live daily media briefing on #COVID19 with @DrTedros #coronavirus.” Twitter. 2 Mar 2020.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]