["In the aftermath of the Congress party’s victory in the recently held assembly elections, a clipped video falsely suggesting that Rahul Gandhi took an about-turn on the farm loan waiver was massively circulated on social media. Now, one more video of Rahul Gandhi has gone viral.", "In the 10-second clip, Gandhi can be heard saying, “की किसान का कर्ज़ा माफ़ नहीं करना चाहिए क्योंकि अगर किसान का कर्ज़ा माफ़ किया तो किसान की आदत ख़राब हो जाएगी (Farmers’ loans shouldn’t be waived-off because if they are, farmers will get used to loan waivers- translation)”.", "On December 19, one Sunil Nehra had posted this clip on a Facebook group with a message, “थोड़ा वायरल कर दोगे तो 4 दिन बाद माफी मांगते हुए नजर आएगा (Make it go viral and you will see him apologizing after four days)”. At the time of writing this article, it had been shared close to 21,000 times.", "Several other individuals on Facebook and Twitter have shared this same video with the identical narrative.", "A Twitter user @Lala_The_Don had tweeted the clip on June 18, 2018 claiming, “this is what Rahul baba thinks about farmer and farmers loan waiver”. It was one of the earliest instances that Alt News could trace. The same clip, shared at around the same time by Rag Darbari, a Facebook page has been shared more than 22,000 times and viewed over 500,000 times. BJP leader Atmaram Patel also shared this clip from Rag Darbari suggesting that Rahul Gandhi made such a statement.", "Boom Live had earlier fact-checked the same claim. We found that this video was clipped from a speech delivered by Rahul Gandhi at a public rally in Bilaspur, Chhattisgarh.", "At 27:52 in the above video, Rahul Gandhi can be heard saying, “Last year, the Indian government had waived off Rs 2.5 lakh crore debt of India’s top 15 industrialists but the same government which can forgive Rs 2.5 lakhs crore for these fifteen people, cannot write off the debt of crores of farmers. Their leaders say that farmers’ loans shouldn’t be waived-off because if they are, farmers will get used to getting remittances. It’s a strange world, where the richest people in India won’t get used to their loan getting waived off.” Gandhi was actually taking a jibe at BJP leaders for saying that farmers will get habituated to loan waivers.", "This video was maliciously clipped to suggest that Rahul Gandhi made a statement against farm loan waivers, when the opposite was promised by him in his election campaign.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]