["The image was published here on Facebook on September 24, 2020.", "It shows the building of the Jayawijaya government office in Papua engulfed in flames.", "The Indonesian-language post translates to English as: “JAYAWIJAYA REGENCY OFFICE IN WAMENA BURNED DOWN BY THE PEOPLE REJECTING SPECIAL AUTONOMY PART II 23/09/2020. FREE PAPUA”.", "Wamena is the capital of Jayawijaya regency in Indonesia’s Papua province.", "Special autonomy is a special authority given by the government of Indonesia to Papua and West Papua provinces since 2001 to manage the interests of the local community based on the aspirations and basic rights of Papuans. Many Papuans, however, opposed the continuation of the special autonomy as it was deemed ineffective to develop the region, English-language daily The Jakarta Post reported.", "Papuan students in different parts of Papua province staged protests in late September 2020 rejecting special autonomy, as reported by The Jakarta Post and state-owned news agency Antara.", "The same image has been shared more than 250 times on Facebook here, here, here and here, alongside a similar claim.", "The claim, however, is false.", "A reverse image and keyword searches on Google found this AFP photo, which shows the charred remains of the Jayawijaya regency office, dated September 24, 2019.", "The caption reads: “A burnt out government office is pictured in Wamena on September 24, 2019, where hundreds had demonstrated and burned down the office along with other buildings the day before. More than two dozen people have died in riots in Indonesia's restive Papua region, authorities said on September 24, as thousands fled to shelters following violence that saw civilians burned alive in buildings set ablaze by protesters.”", "Below is a screenshot comparison of the image in the misleading post (L) and the AFP photo (R):", "Indonesian news outlet Tribunnews.com published footage of the unrest here on its YouTube channel on September 23, 2019. Translated from Indonesian language to English, the video’s title reads: “Protesters Enter Wamena Regent Office Complex and Burn Building.”", "The deadly protest and the arson attack on the Jayawijaya government office were also reported by AFP here and The Jakarta Post here on September 23, 2019.", "Jayawijaya regent Jhon Richard Banua told AFP by phone on October 2, 2020 that the incident happened on September 23, 2019.", "“The burned down building was demolished around two months later,” he said. “Apart from that, there has been no protest in Wamena recently.”", "Only a dome building was left standing, as seen in the photos published by Antara here and PapuaInside.com here.", "The contract to reconstruct the building was signed on September 14, 2020, according to the page of the Jayawijaya Regency’s website here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]