["The photo was published here in a Facebook post on March, 2, 2020. It has been shared more than 250 times.", "Below is a screenshot of the misleading Facebook post:", "GRAPHIC", "Show", "Hide", "The photo’s Hindi caption translates to English as: “The country will not forget this pain. The rioters did not even spare this kid, who was returning from school. Till now, we have news of the killing of one child. This is the horrifying picture of Delhi riots on social media. What was the fault of this kid? The country will not forget this pain.”", "Consecutive months of protests against Prime Minister Narendra Modi's 2019 citizenship law escalated dramatically between February 24 and February 26, 2020. At least 42 people have been killed in the sectarian violence, as reported here by AFP.", "The photo has also been shared here, here, here and here on Facebook, and here, here and here on Twitter, alongside a similar claim.", "This claim is false; this is a 2018 photo taken in Syria. It shows a boy awaiting treatment at a makeshift hospital on the outskirts of the Syrian capital, Damascus, after being injured during government bombardments on February 21, 2018.", "A reverse image search on Google found a larger version of the same photo published here on Getty Images website, with a February 21, 2018 dateline.", "Below is a screenshot of the Getty Images photo:", "GRAPHIC", "Show", "Hide", "The website credits AFP photographer Amer Almohibany as a contributor.", "A further keyword search found the photo also published here on the AFP Forum website on the same date.", "Below is a screenshot of the photo on the AFP website:", "GRAPHIC", "Show", "Hide", "The photo caption reads: \"A wounded Syrian boy covered in blood waits to receive treatment at a make-shift hospital in Kaur Banta in the besieged Eastern Gout region on the outskirts of the capital Damascus following Syrian government bombardments on February 21, 2018. Syrian jets carried out more deadly raids on Eastern Gout as Western powers and aid agencies voiced alarm over the mounting death toll and spiralling humanitarian catastrophe.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]