["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "NARAL Pro-Choice Virginia says abortions may be more common than you think.", "\"One in three American women will have had an abortion by the time she reaches the age of 45,\" the group says on its website.", "Alena Yarmosky, a spokeswoman for the group, said the figure comes from a 2011 study by the Guttmacher Institute, a research and advocacy organization that supports women’s access to birth control and abortions. Guttmacher’s research often is cited by people on both sides of the abortion issue.", "The goal of Guttmacher’s study was to update its 1992 estimate that 43 percent of U.S. women would have at least one abortion by the time they turn 45. Abortion rates had declined since 1992, and researchers wondered whether that meant that the percentage of women who would have an abortion at some point in their lives also had dropped.", "We should note that the lifetime incidence estimate is different from the overall abortion rate in the U.S., which measures how many women underwent the procedure during a given year. A woman who has had two abortions, for example, would be counted in the abortion rate twice. But she would be counted only once in computing the lifetime incidence of abortions.", "Guttmacher updated its estimate through a complicated process. It surveyed nearly 9,500 women in 2008 using formulas that took into account their ages and whether they had undergone a first abortion to come up with its lifetime incidence estimate.", "Guttmacher concluded \"the cumulative first-abortion rate increases with age, and women aged 40 and older had a rate of 300.9 per 1,000 women.\"", "\"Put differently, an estimated 30.1% of women aged 15–44 in 2008 will have an abortion by age 45 if exposed to prevailing abortion rates throughout their reproductive lives,\" the report said.", "That’s close to the one-in-three incidence, or 33 percent, NARAL cites.", "But there’s a caveat. Guttmacher said its estimate stands as long as \"prevailing abortion rates\" continue. The abortion rate, however, has not held steady. According to Guttmacher, it fell from 19.4 per 1,000 women in 2008 - when the lifetime incidence estimate was made - to 16.9 abortions per 1,000 women in 2011, the latest figures available.", "This raises the question - as our fellow fact checkers at PolitiFact Texas and The Washington Post have noted - of whether Guttmacher’s estimate based on 2008 data remains relevant. The answer is, no one knows.", "Rachel Jones, co-author of the Guttmacher report, told us in an email that it’s possible - but far from certain - that the percentage of women expected to have an abortion before age 45 would go down with the abortion rate.", "Jones said Guttmacher plans to take a another look at the lifetime incidence of abortions. \"We will not have an updated estimate for several years,\" she said.", "Our ruling", "NARAL Pro-Choice Virginia says \"one in three American women will have had an abortion by the time she reaches the age of 45.\"", "That’s roughly the estimate the Guttmacher Institute made five years ago based on 2008 data. Guttmacher said its estimate would stay solid as long the nation’s abortion rate in 2008 remained constant. The abortion rate has dropped, however, and that draws into question whether the percentage of women who will undergo the procedure at least once also has gone down. The answer is unknown; research has not been updated.", "Although there’s a basis for NARAL’s claim, the statistic it cites as fact actually is an estimate that might be outdated. So we rate NARAL’s statement Half True.", "NARAL Pro-Choice Virginia website, accessed May 16, 2016.", "Guttmacher Institute, \"Induced abortion in the United States,\" May 2016.", "Emails from Rachel Jones, principal research scientist at the Guttmacher Institute, May 18-19, 2016.", "PolitiFact Texas, \"A flawed Wendy Davis claim: 1 in 3 women has an abortion in her lifetime,\" Jan. 19, 2016.", "The Washington Post Fact checker, \"The stale claim that ‘one in three’ women will have an abortion by age 45,\" Sept. 30, 2015.", "Obstetrics and Gynecology, \"Changes in abortion rates between 2000 and 2008 and lifetime incidence abortion,\" June 2011.", "Perspectives on Sexual and Reproductive Health, \"Abortion incidence and service availability in the United States, 2011,\" March 2014.", "Family Planning Perspectives, \"Unintended pregnancy in the United States,\" January/February 1998.", "Guttmacher, \"Characteristics of U.S. abortion patients, 2008,\" May 2010.", "Email, Mallory Quigley, communications director, Susan B. Anthony List, to PolitiFact Texas, Jan. 15, 2016.", "Chuck Donovan, president of the Charlotte Lozier Institute op-ed in the New York Times \"Openness would reveal the shocking number of abortions,\" June 30, 2013.", "National Right to Life, \"Claim that ‘one in three women will have an abortion by age 45 receives ‘two Pinocchios’ from the Washington Post,\" Oct. 1, 2015.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]