["As he faces re-election next year, Republican Gov. Rick Scott says he wants to put money back in taxpayers’ pockets. He touts a property tax cut he got in 2011 (in reality, a smidgen), a pay hike for teachers in 2013 and now his proposal to cut $500 million in taxes or fees.", "Scott hasn’t released specifics on his next tax cuts, but his overall message is clear: He wants voters to see him as the guy in their corner saving them money.", "Former Democratic state Sen. Nan Rich who is running against Scott, calls his idea a re-election gimmick in light of Florida’s pressing needs -- including education.", "\"We need to be taking a long hard look at funding the critical needs of the state,\" she said Sept. 11. \"We’re 48th in K-12 funding and 50th in higher education.\" Rich said more funding for education would be a better way to help the middle class.", "Florida has often gotten a bad rap for education spending -- but just how bottom of the barrel are we?", "PolitiFact Florida examined the state’s K-12 education funding ranking in 2010, but we wanted to see if the numbers had changed and if Rich had done her homework.", "K-12 funding", "There are lots of different ways to compare funding for K-12 or higher education. How Florida ranks depends on many factors such as whether the cost-of-living in various states is taken into account. Some analyses focus on state money while others also factor in local dollars.", "Not surprisingly, depending on the methodology, we found different numbers for Florida’s ranking. But most were in the bottom of the pack.", "Rich directed us to the U.S. Census Bureau which shows Florida ranked 42nd in per-pupil funding at $10,031, taking into account federal, state and local sources, or 48th for state funding alone at $3,440 in 2011. Rich had cited that 48th figure.", "We found many other entities that provide state comparisons on education funding in a variety of ways including the National Education Association, Education Week and the National Center for Education Statistics (NCES) which is part of the U.S. Department of Education.", "NCES, for example, shows that Florida spent $9,030 per pupil in 2011, ahead of 13 other states. (This chart combines funding so it’s not a measurement of only state spending.)", "Why the different ranking between the NCES report and the census report that Rich referenced? NCES includes charter schools, while the census generally doesn’t, said Mark Dixon, project manager for the annual survey of school system finances for the census.", "Higher education funding", "Rich didn’t direct us to a source of data for her claim about Florida ranking 50th in higher education. But much like K-12 funding comparisons, we found that different methodologies produced different rankings for Florida.", "The NEA ranked Florida 50th on per capita state and local government expenditures for higher education for the 2009-10 school year. The amount spent per capita was $485 -- just one buck lower than Nevada and ahead of the District of Columbia.", "We found more recent data through Grapevine, a longstanding annual report by Illinois State University. About half the states fund higher education in part through local funds, but the Grapevine report only shows state money. That report doesn’t provide rankings but compares the states per capita, which refers to the state’s overall population. That analysis shows Florida at $172.98 per capita. By our count, that placed Florida ahead of eight states in 2013.", "\"I try to avoid rankings,\" said Jim Palmer, a professor and editor of Grapevine. \"You’ve got 50 different state systems ... you have to wonder what the rankings really mean. If one state ranks lower than another does that mean the higher education system is not as good? I can’t make that judgment.\"", "We were surprised to find Florida gave more money per capita than Massachusetts and asked Palmer to elaborate.", "\"The history of education in Massachusetts is not as reliant on the public sector as it has been in Florida. The private sector looms large in Massachusetts going back to Harvard. ... Florida devoted itself to developing a strong community college system -- stronger than New England.\"", "Palmer directed us to the State Higher Education Executive Officers, a group that publishes a report using Grapevine's state data along with other sources of funds, including local dollars and stimulus money. It also takes into account factors such as cost-of-living.", "That report showed Florida at $5,130 -- ahead of about 20 states.", "Our ruling", "Rich said, \"We’re 48th in K-12 funding and 50th in higher education.\"", "There are lots of different valid ways to measure education funding. One way is to compare how much money a state provides for education per pupil, and by that measure Florida ranked 48th according to the Census. That’s a valid way to look at the numbers because it was in the context of Rich criticizing the governor who signs the state budget. However, it’s one of several ways to measure school spending.", "For higher education spending, the National Education Association ranked Florida 50th for state and local expenditures in 2009-10. But other more recent analysis we reviewed showed Florida higher than 50th. One measure showed Florida ahead of about 20 states.", "We rate this claim Half True.", "Tampa Tribune, \"Rich questions Scott tax cut idea; Crist, Sink silent,\" Sept. 11, 2013", "PolitiFact, \"Rick Scott claims 24 tax cuts for Florida since 2011,\" June 3, 2013", "PolitiFact, \"Rick Scott says ‘every teacher gets a pay raise with new budget,\" May 1, 2013", "PolitiFact, \"Chiles needs schooling on education rankings,\" July 7, 2010", "Miami Herald, \"Florida puts little investment into it's universities,\" Aug. 22, 2010", "Miami Herald, \"You get what you pay for: higher education,\" March 6, 2011", "Miami Herald, \"Gov. Rick Scott’s tax cut tour stop: Tampa,\" Sept. 13, 2013", "U.S. Census, Public education finances 2011, May 2013", "National Center for Education Statistics, Student membership and current expenditures per pupil for public elementary and secondary education, by function, subfunction, and state or jurisdiction: Fiscal year 2011", "National Education Association, Rankings and estimates, December 2012", "Education Week, Quality Counts 2013 per pupil spending adjusted for regional cost differences 2009-10", "State Higher Education Executive Officers, State Higher Education Finance, Fiscal year 2012,", "Grapevine, Report, Fiscal year 2012-13", "Fund Education Now! website, Accessed Sept. 17, 2013", "Interview, former state Sen. Nan Rich, Sept. 16, 2013", "Interview, James Palmer, Grapevine editor and professor of higher education at Illinois State University, Sept. 16, 2013", "Interview, Hans P. L'Orange, Vice President for Research and Information Resources", "State Higher Education Executive Officers, Sept. 16, 2013", "Interview, Celeste Fernandez Busser, spokeswoman National Education Association, Sept. 16, 2013", "Interview, Mark A Dixon, project manager for the annual survey of school system finances for the U.S. Census, Sept. 17, 2013", "Interview, Jim Bradshaw, spokesman for the U.S. Department of Education, Sept. 16, 2013", "Interview, David Thomas, spokesman for the U.S. Department of Education, Sept. 16, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]