["About this rating", "Rival ketchup manufacturer Osem lobbied the Israeli government to mandate that Heinz be restricted from labeling its iconic product as \"ketchup.\"", "The sale of Heinz brand ketchup has been \"banned\" in Israel, and the product's use of GMO-derived ingredients was part of the reason behind that ban.", "On 12 February 2016, the web site Health and Home Remedies published an article reporting that the country of Israel had declared Heinz brand ketchup unsafe due to its inclusion of genetically modified ingredients and banned it from sale in that country:", "Israel has recently banned Heinz Ketchup from the country and they say it's because it doesn't have high enough amount of tomatoes in it. But there are a couple of more reasons why it was banned ... Heinz is loaded with high fructose corn syrup which is extremely unhealthy. The corn syrup is made of GMO corn and this is what makes it so dangerous. It can cause a rapid increase in your blood sugar levels and damage your liver.", "The article was nearly identical to a 22 January 2016 post published by the blog Stay on the Health Path:", "Recently in Israel the Heinz Ketchup has been forbidden. The explanation was — it didn't contain enough tomatoes. But that's not the only reason, there are a few more ... The major reason why you should avoid Heinz ketchup is that it contains corn syrup which is high in fructose. As a matter of fact, it is loaded with it.", "This syrup is made from corn which is genetically modified to a great extent. This is what makes it dangerous and toxic. This syrup can incite quick spike in your blood sugar levels and cause liver damage once it's metabolized.", "Both posts cited the presence of genetically modified ingredients (GMOs) as a factor in Israel's purported ban of Heinz brand ketchup. However, Heinz Europe notes in their FAQ that the product contains no such ingredients:", "Heinz remains committed to taking every possible step to ensure that Heinz varieties remain free from ingredients derived from genetically modified crops.", "Where there is the potential for GM material to be present or where ingredients are derived from soya or maize, we source non-GM, identity preserved ingredients through carefully audited suppliers. In addition, independent testing is carried out.", "More to the point, the claim that Israel \"banned\" Heinz ketchup in early 2016 was false: the articles quoted above actually referenced a mid-2015 controversy about ketchup labeling in Israel which did not involve a \"ban\" of any type. According to an  article from the Israeli news agency Haaretz, the country's health ministry had imposed a labeling restriction on Heinz that required the company's flagship product to be labeled as \"tomato seasoning\" rather than \"ketchup.\"  That ruling stemmed from a January 2015 controversy in which rival ketchup producer Osem argued that the composition of Heinz's product shouldn't legally be allowed to bear the label \"ketchup\" because it didn't contain the required minimum amount of tomatoes. In response, Heinz accused Osem of attempting to maintain a monopoly on ketchup sales in Israel:", "In a warning letter to the country’s supermarkets, Osem claimed that a lab test it conducted showed that the Heinz ketchup distributed in Israel contains only about 20% tomato concentrate, much less than the 61% minimum required by Israeli regulations.\nThat's not all. Osem claimed that Heinz’s 907-gram (32-ounce) bottles are labeled as containing 39% tomato concentrate but were found in lab tests to contain just 17% ... [Osem claimed this] meets standards in the U.S. and Europe but not in Israel, which requires ketchup to contain at least 10% tomato solids. Osem says tomato concentrate must make up at least 35% of the product to reach that level.", "Diplomat Group, which distributes Heinz ketchup in Israel and also received the warning letter, claimed that the lab tests must have produced erroneous results. But even if they were correct, Diplomat contended, the regulation Osem is citing is not binding on Heinz ketchup sold in Israel.", "\"Heinz ketchup is sold as ketchup in 130 countries, but according to Osem, in Israel it's not legal,\" the company said. \"It's clear that monopolistic Osem would be happy if only its product could be sold in Israel, but Osem's claims are without substance. It is relying on a standard that is not official and is not mandatory. This determination is backed by a legal opinion.\"", "And Diplomat said that Osem — which is controlled by the Swiss foods giant Nestle — has not provided the laboratory results on which it is basing its claim ... The testing, Diplomat claimed, produced an estimate rather than data from measurement equipment.", "A statement from a Heinz Europe spokesperson in response to the controversy asserted that their ketchup product was already labeled correctly:", "Commenting on its product for sale in Israel, a Heinz Europe spokesman said: \"The word ketchup is indicated in English on the front of the bottle while recognising that the Israeli standard for ketchup has yet to be brought in line with US and European accepted international standards, the back label of our ketchup sold in Israel reflects current local requirements for ingredient labelling and the Hebrew name for the product.\"", "They added: \"The original, quality recipe for Heinz Tomato Ketchup sold in Israel and the standard for ketchup around the world remains unchanged.\"", "As of April 2016, Heinz ketchup (labeled as such) was still readily available on store shelves in Israel, so the product clearly has not either been banned or renamed:", "Heinz ketchup has not been banned in Israel, for its alleged inclusion of GMO-derived ingredients or any other reason.  All that happened was that a rival brand claimed Heinz shouldn't be allowed to label their product as \"ketchup\" because of differing standards over required tomato content.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]