["The 30-second video, which seems to be taken from a moving vehicle, shows a massive ash cloud spewing into the sky.", "The October 3 post says: “Mount Soputan in North Sulawesi erupted at 8.47 am local time. Let’s pray for the safety of our brothers and sisters there.”", "The Facebook post was shared more than 2,500 times.", "The same video footage can be seen in this Al Jazeera article dated June 4, 2018 and this YouTube video from Univision Noticias on the same date, the day after Fuego volcano erupted in Guatemala.", "Mount Soputan, situated around 1,000 kilometres (600 miles) from the tsunami-ravaged town of Palu, did erupt on October 3, spewing volcanic ash 4,000 metres into the air, as seen in this AFP-sourced photo.", "Indonesia’s disaster mitigation agency spokesman Sutopo Purwo Nugroho said in an October 3 tweet that the video in question did not show the Soputan eruption.", "\"This video does not show Mount Soputan erupting. This is a volcano eruption in South America. If any reports say this video is of Mount Soputan, that must be a hoax. Please ignore and don't spread it on social media,\" he said.", "Video ini bukan erupsi Gunung Soputan. Ini erupsi gunung di Amerika Selatan. Jika dikatakan erupsi Gunung Soputan, itu HOQX. Abaikan dan jangan ikut menyebarkan di sosial media. pic.twitter.com/7a1l4LQEht", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]