["The collage was published here on August 2, 2020. It has been shared more than 600 times.", "The post’s caption reads: “I was sent this from many friends today. People in Berlin protested against Germany’s coronavirus restrictions on Saturday, insisting ‘the end of the pandemic’ has arrived.", "“Protesters held up signs with slogans like ‘Corona, false alarm,’ ‘We are being forced to wear a muzzle,’ ‘Natural defense instead of vaccination’ and ‘We are the second wave.’ @COVID19Up. Remember the people have the power.”", "Some 20,000 people gathered in Berlin on August 1, 2020 to protest against coronavirus restrictions implemented by the government. Berlin Police have launched legal proceedings against the protest's organisers over allegations that many protesters failed to wear masks or respect the 1.5 metre social distancing requirement, according to this AFP report.", "The same photo collage was also shared here on Facebook with a similar claim.", "The claim is false; the photos have circulated in reports about Black Lives Matter protests held in Germany in early June.", "First photo", "A reverse image search found a photo identical to the first photo in the misleading posts published here on the Twitter account of the Hamburg faction of Die Linke, a German political party, on June 6, 2020.", "#Jungfernstieg wegen Überfüllung geschlossen#Hamburg #solidarity #GeorgeFloyd #blacklivesmatter #hh0606 pic.twitter.com/7LkGqqTFMz", "The tweet states that the photo was taken at Jungfernstieg, a promenade in the German city of Hamburg, during a Black Lives Matter protest.", "Below is a screenshot comparison of the first photo in the misleading post (L) and the photo in the tweet by Die Linke (R):", "The same street in Jungfernstieg can be seen here on Google Street View.", "Second photo", "A combined keyword and reverse image search on Google found a larger version of the second photo published on June 6, 2020 in this tweet by DPolG Berlin, a branch of the German police trade union (Deutsche Polizeigewerkschaft).", "Aktuell auf dem #Alexanderplatz: „Sind die Abstandsregeln heute ausgesetzt Herr Innensenator? Das bekommen sie mit schwachen Coronaregeln und ohne Unterstützung von Bund und Ländern dauerhaft nicht in den Griff!“ (Hauptsache wir tragen beim Friseur alle eine Maske) B.Pfalzgraf pic.twitter.com/qXZlBORrLp", "Part of the German tweet translates to English as: “Currently at Alexanderplatz: Are the distancing requirements suspended today, Mister Senator? You won’t get this under control permanently with weak corona rules and without support from the federal government and states!”", "A subsequent keyword search found this June 6 report by German newspaper Berliner Morgenpost about a gathering of 15,000 people in Alexanderplatz plaza in Berlin, Germany for an anti-racism protest on the same day.", "Headlined \"15,000 people on Alex; 93 arrested, 28 injured”; the article reads, in part: “15,000 people came to demonstrate against racism after George Floyd's death. Protesters criticize police operations...On Saturday afternoon, a sea of ​​mostly black-clad protesters with respiratory masks stretches from the television tower to the train station and the Alexa shopping centre.”", "Below is a screenshot comparison of the second photo in the misleading post (L) and the DPolG Berlin photo (R):", "Other photos of the same protest can also be viewed here and here on Getty Images.", "Third photo", "The third photo in the misleading post corresponds with an image in this June 6, 2020 report by the German news portal T-Online, headlined “Thousands of anti-racism demonstrations all over Germany”.", "Part of the German-language report translates to English as: “After the death of the African American George Floyd, numerous people gathered on Saturday at Alexanderplatz in Berlin for a \"silent\" demonstration against racism and police violence.”", "Below is a screenshot comparison of the third photo in the misleading post (L) and the photo in the T-Online report (R):", "Other photos taken at a similar angle to the third photo can also be viewed here and here on Getty Images.", "Fourth photo", "The fourth photo in the misleading posts was published in this June 6, 2020 tweet by Germany-based YouTuber iBlali.", "#BlackLivesMatter - Demo in Köln ? pic.twitter.com/42HIyrXyM1", "The tweet states the image was taken in the German city of Cologne during a Black Lives Matter protest.", "Below is a screenshot comparison of the third photo in the misleading post (L) and iBlali’s photo (R):", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]