["By Robert Farley", "Posted on February 5, 2021", "In the debate over competing rescue plans, those in both political parties have miscited a recent report by the Congressional Budget Office to make their case.", "Marc Goldwein, senior vice president and senior policy director at the Committee for a Responsible Federal Budget, said that while the statements by Cassidy and Psaki are “both technically wrong, I think it’s pretty clear they are both trying to say something accurate.”", "Republicans and the White House have proposed very different COVID-19 relief bills, with the Republican plan calling for about $618 billion in stimulus, while the plan proposed by President Joe Biden calls for $1.9 trillion in federal spending. Biden met with a group of 10 Senate Republicans on Feb. 1, and both sides presented arguments for their respective packages.", "In an interview after the meeting, Cassidy said the two sides had a “bit of common ground” in that “we’re talking from data. What does the data show that we need. And the president’s going to have his staff get back to us, and we’ll kind of compare our data points. That’s good news.”", "In making their cases through data, both sides cited a recently released report from the CBO on the 10-year economic outlook. But as we said, they didn’t always do so accurately.", "One of the differences between the two relief plans is the amount and duration of unemployment insurance supplements. Biden’s American Rescue Plan would provide a $400 per week unemployment insurance supplement through the end of September. The GOP proposes that the current $300 per week supplement be extended through the end of June.", "Biden “wants $400; we gave $300. And we phase out in June. Why? Because the Congressional Budget Office says they expect employment to be back to pre-COVID levels by June,” Cassidy said in a Feb. 2 interview.", "In another interview the same day on CNBC, Cassidy said, “CBO is estimating a GDP growth of 3.8% this coming year. CBO is saying that by June, employment will be back to pre-COVID levels, attributing that to these COVID packages we’ve already had.”", "That’s not accurate. According to the CBO report, without any new relief package at all, “the unemployment rate gradually declines through 2026, and the number of people employed returns to its prepandemic level in 2024.”", "Cassidy’s office said the Louisiana senator in both cases was referencing GDP, not employment.", "That would be accurate. The CBO wrote, “In its new economic forecast, which covers the period from 2021 to 2031, the Congressional Budget Office therefore projects that the economic expansion that began in mid-2020 will continue. … Specifically, real (inflation-adjusted) gross domestic product (GDP) is projected to return to its prepandemic level in mid-2021 and to surpass its potential (that is, its maximum sustainable) level in early 2025.”", "In a press briefing on Feb. 3, Psaki said, “The president’s plan would give Americans who are out of work, through no fault of their own, a $400 weekly supplement and the certainty that it would last through the worst of the pandemic. Their plan would give unemployed Americans less money and, therefore, less certainty.”", "We’re not going to weigh in on the politics over the appropriate amount or duration of unemployment insurance supplements. But even if Cassidy had cited the GDP returning to pre-pandemic levels later this year to justify the GOP’s smaller and shorter unemployment insurance proposal, we would have been writing now to clarify that CBO anticipates unemployment recovery to be slower than GDP recovery by several years.", "The same thing happened after the Great Recession when unemployment recovery lagged behind GDP growth.", "Psaki has also cited the CBO report, to justify the size of the $1.9 trillion package proposed by Biden. She argues that without it, the economy will not recover as quickly.", "In her press briefing on Feb. 4, Psaki said: “A CBO report found that without any additional stimulus, our economy wouldn’t reach pre-pandemic levels until 2025. And it would take just as long to get back to full employment.”", "She said something similar on Feb. 2. Psaki said the CBO analysis showed that “without action, our economy won’t reach pre-pandemic levels until 2025. That’s too long. So our goal with moving this package forward is making it faster.”", "As we wrote above, the CBO projects that GDP will “return to its prepandemic level in mid-2021.” Psaki is referring to something else, what the CBO refers to as the economy’s “potential level” — which CBO describes as its “maximum sustainable” level. CBO says GDP won’t surpass that level until 2025.", "“’Potential GDP’ is a measure of how much the economy could produce if we were maximizing our use of labor and capital,” Goldwein, of the Committee for a Responsible Federal Budget, explained.", "“Prior to the pandemic, the economy was at its potential – actually somewhat above potential based on CBO’s estimates,” Goldwein said. “In the second quarter of 2020, the economy fell to about 10% below its potential according to CBO. In other words, thanks to the pandemic we were producing and buying 10% less than we could have been.”", "“Potential GDP almost always grows over time,” Goldwein said, but since the second quarter of last year, “actual GDP has been growing faster and so catching up.”", "“CBO estimates the gap shrank from 10.1% at its worst to 3% at the end of last year and will further shrink to 1.3% by the end of this year, 0.8% by the end of 2022, 0.4% by the end of 2023, and 0.015% by the end of 2025,” Goldwein said.", "Although the economy would not reach its potential until the first quarter of 2025, according to CBO, Goldwein noted that it would be “mostly back to normal (within 0.5% of potential) by 2023.”", "In an analysis of Biden’s plan, CRFB calculated that the $1.9 trillion proposal would “likely be enough to close the output gap” between actual and potential GDP “two to three times over.” That “overshoot could be beneficial” the report states, but the authors also warned it could “pose risks to the economy and the fiscal outlook.”", "“While the economy can operate above its long-term potential for periods of time, it cannot do so indefinitely or sustainably,” the authors wrote. “One possibility is that the excess funds are economically ineffective, adding to the debt without improving the economy.” The excess stimulus could also lead to higher inflation, the report states, and could lead to “an economic cliff or crash as the stimulus fades.”", "Editor’s note: FactCheck.org does not accept advertising. We rely on grants and individual donations from people like you. Please consider a donation. Credit card donations may be made through our “Donate” page. If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, 202 S. 36th St., Philadelphia, PA 19104.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]