["Rumors about the unprecedented events of Jan. 6 are still circulating on social media months after a mob of supporters of then-President Donald Trump attacked the U.S. Capitol building in an effort to stop the confirmation of the 2020 presidential election results.", "Amid hundreds of arrests and calls for accountability from lawmakers — and despite many participants crediting Trump for their actions —  some internet pundits have implicated antifa, Black Lives Matter and others in the violent breach that left five people dead, according to USA TODAY.", "A March 8 Facebook post claims journalists working for TV network and news outlet CNN took part in the insurrection.", "\"Just a reminder that CNN employees took part in the Capitol Hill riot,\" the meme claims. \"They entered the capitol building with John Sulluvan (sic), filmed it, interviewed him, then blamed the whole thing on Donald Trump. And the sheep gobbled it up like it was gospel.\"", "The poster did not respond to a request for comment from USA TODAY.", "John Sullivan filmed the fatal shooting of Ashli Babbitt by a U.S. Capitol police officer after infiltrating the building, USA TODAY reported. Sullivan was later arrested in Utah and charged in federal court for unlawful entry, disorderly conduct and interfering with the duties of law enforcement, according to a Jan. 14 press release by the Justice Department.", "Sullivan was accompanied by photographer Jade Sacker. But there is no evidence Sacker was employed by CNN during the events of Jan. 6.", "Fact check:No, House Speaker Nancy Pelosi isn't worth $196 million", "Sacker is a Los Angeles-based freelance journalist, according to her website. She has taken photographs for an assortment of news outlets, including NBC, NPR and BuzzFeed News. CNN is not listed among Sacker's credits.", "Sullivan is a subject of a documentary project filmed by Sacker, according to a Jan. 13 tweet thread by journalist Max Blumenthal, the editor of investigative news website The Grayzone.", "Blumenthal referenced Sullivan's Jan. 6 interview with CNN anchor Anderson Cooper in a series of tweets about Sullivan. Sacker joined Sullivan during the interview.", "\"Seated w/Sullivan on CNN is Jade Sacker, a photojournalist who followed him into the Capitol to film his exploits as part of a documentary project,\" Blumenthal wrote. \"Here she's heard congratulating him - 'We did it!' - and he says, 'Is this not gonna be the best film you've ever made in yr life?'\" he tweeted, referencing an attached video clip of the pair inside the Capitol.", "Sacker made no reference to CNN on the clip and Cooper introduced her as a documentary filmmaker during the interview. The full segment was uploaded to video hosting site Air.TV on Jan. 14.", "Matt Dornic, head of strategic communications at CNN, denied a relationship between Sacker and the company in a response to a request for comment from USA TODAY.", "\"Jade Sacker was not at the Capitol on our behalf. She does not work for CNN in any capacity and has never been employed by our organization,\" Dornic wrote in an email.", "The March 8 Facebook post is not the only claim targeting Sacker.", "A Jan. 14 article in far-right wing news and opinion outlet The Gateway Pundit cites a link between Sacker and CNN in its headline and story and includes several embedded tweets from Twitter user @amuse that suggested the freelancer was \"working on a CNN project, but she’s done a lot of work for NBC and NPR.\" Twitter suspended the account.", "Sacker has no present relationship with NPR, according to Ben Fishel, a senior publicist.", "\"NPR retained Jade Sacker in October of 2020 for a freelance photography assignment. She has not performed any services for NPR since. She was not at the Capitol at our request or on our behalf. If we determine that her actions in any way contributed to the incident at the Capitol, Ms. Sacker will not be engaged by NPR again,\" Fishel wrote in an email.", "USA TODAY also reached out to NBC and The Gateway Pundit for comment.", "We rate this claim FALSE, based on our research. A Facebook post claiming CNN employees took part in the Jan. 6 insurgency at the U.S. Capitol relies on unfounded information. A freelance journalist infiltrated the Capitol with John Sullivan to capture footage for a documentary project. CNN confirmed the journalist has never been employed by nor done work for the cable news outlet.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook."]