["An image of a bus with a poster of Independent India’s first law minister Dr BR Ambedkar and his wife Savita Ambedkar is doing the rounds on social media. Facebook user Mahendra Singh Khandelwal shared the image with the claim it’s from Colombia, South America, and the bus is a tribute to Dr Ambedkar. At the time of writing this article, the post was shared more than 9,300 times.", "कोलंबिया (अमेरिका🇺🇸) की सड़कों पर दौड़ती सिटी बस पर बाबासाहब का चित्र यह असली सम्मान है, अमेरिका आज भी बाबा साहब को अपना…", "Posted by Mahendra Singh Khandelwal on Saturday, 19 September 2020", "Facebook user Rakesh Nagar shared the image with the same claim. The post has been shared over 1,000 times so far.", "This image is viral on Facebook and Twitter with the claim that it shows a city bus in Colombia. Alt News also received several requests on its official application to fact-check this image.", "With a reverse image search on Google, we found a visually similar image which was posted on Wikimedia. According to Wikimedia, this image is of a tourist bus in England’s biggest city Bath. The image was shot on July 28, 2008, by photographer Adrian Pingstone. The image viral on social media is the same but includes morphed poster of Ambekar and his wife. Posted below is the comparison of the two images.", "Furtheremore, the destination virtually displayed on the bus—’Bathe City Sighting’—has been blurred in the morphed picture.", "The photograph superimposed on the original image was found in Outlook’s photo gallery.", "Therefore, an image of a tourist bus operating in England’s Bath city was edited by superimposing an image of Babasaheb Ambedkar on the bus. It was falsely claimed that this is a bus in Colombia, South America, tributed to Babasaheb Ambedkar.", "Donate Now", "Kinjal Parmar holds a Bachelor of Science in Microbiology. However, her keen interest in journalism, drove her to pursue journalism from the Indian Institute of Mass Communication. At Alt News since 2019, she focuses on authentication of information which includes visual verification, media misreports, examining mis/disinformation across social media. She is the lead video producer at Alt News and manages social media accounts for the organization.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "Trigger Warning: Sexual Violence A distressing video of a girl forced to take her clothes…", "A clip featuring Pakistan men’s Cricket team captain Babar Azam is viral on social media…", "A 13-second clip featuring Bollywood actor Shah Rukh Khan is being shared on social media…", "Union minister of information and broadcasting Anurag Thakur on September 26 announced Waheeda Rehman as…"]