["President Joe Biden’s inauguration was historically unique with a large military presence and millions of Americans watching from home. As the federal government swore in the 46th president on the U.S. Capitol steps on Jan. 20, roughly 25,000 National Guard members stood alert throughout Washington, a reminder of the deadly insurrection carried out on those steps just weeks before.", "Of the many security precautions taken for the event, disarming Americans troops was not one of them, as claimed on social media.", "“Biden’s transition team has revealed there is a very real fear that members of the national guard who support President Trump might kill Biden during the inauguration so they’ve asked commanders to confiscate all ammo and magazines from the soldiers,” claims a viral meme shared many times before Jan. 20.", "More:Fact check: Photo captures House Speaker Nancy Pelosi thanking National Guard", "A soldier standing masked outside the Capitol is pictured under the false claim.", "Twitter user @amuse shared the claim and photo on Twitter on Jan. 17, where it received more than 4,400 quote tweets, 6,100 retweets and 10,200 likes.", "In a Twitter thread, @amuse added to the falsehoods, claiming Biden’s team had requested soldiers' voting records and demoting Secret Service agents with Trump loyalties.", "USA TODAY contacted @amuse and several Facebook users that posted the meme. None of them responded.", "Officials announced they would conduct background checks to vet National Guard troops deployed to Washington for the inauguration.", "In a Jan. 18 statement, Acting Secretary of Defense Christopher Miller said the Department of Defense would vet National Guardsmen.", "“While we have no intelligence indicating an insider threat, we are leaving no stone unturned in securing the capital,” he wrote. “This type of vetting often takes place by law enforcement for significant security events.\"", "Miller explained the soldiers were being trained to report anything inappropriate they see or hear up the chain of the command. The FBI assisted the DOD in this wide-scale vetting process.", "Miller stressed that this intensive vetting was “normal for military support to large security events.\"", "The military routinely screens its members for extremist connections, however, the FBI’s scrutiny is an additional measure used for similar events.", "“If there’s any indication that any of our soldiers or airmen are expressing things that are extremist views, it’s either handed over to law enforcement or dealt with the chain of command immediately,” said the chief of National Guard Bureau, Gen. Daniel R. Hokanson.", "Several servicemen and veterans were identified among the crowd responsible for the Jan. 6 Capitol riot, heightening concerns ahead of Inauguration Day.", "More:Fact check: What's true about the Capitol riot, from antifa to BLM to Chuck Norris", "The screenings prompted officials to remove 12 National Guard members from the inauguration security detail by Jan. 19 for exhibiting questionable behavior in the past.", "Pentagon spokesman Jonathan Hoffman said two of those members were removed for making inappropriate comments about the inauguration. Not all of the 12 have ties to far-right extremist groups.", "The FBI identified 10 of those 12 service members as security risks. Military leadership and an anonymous source identified the other two, according to USA TODAY. Authorities found no evidence that these service members were involved in a plot to threaten the security of the inauguration.", "USA TODAY could find no credible reports that the Biden-Harris Presidential Transition team asked the military to disarm its soldiers. The team has not made this request publicly through either a press release on its website or its Twitter account, which changed to White House official accounts immediately after the inauguration.", "The Department of Homeland Security called roughly 25,000 National Guard service members to the capital in the days before the inauguration as part of a massive security operation.", "Disarming those soldiers would have compromised their ability to carry out that operation.", "More:Fact check: Chatham County, Georgia, stopped counting votes when staff ran out of ballots", "Biden's team did not respond to USA TODAY's request for comment.", "Social media posts claiming the Biden-Harris Presidential Transition team requested military leaders confiscate National Guard members ammo and magazines ahead of the inauguration to thwart a potential assassination are FALSE based on our research. Officials removed 12 service members from the inaugural security detail, but found no evidence any National Guard members we involved in a planned attack on the president. Disarming those troops would compromise the security operation the National Guard was in D.C. to conduct.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook."]