["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Hillary Clinton and Bernie Sanders have found common ground criticizing Donald Trump’s policy agenda, with Sanders formally endorsing Clinton as the Democratic nominee for president at a rally in New Hampshire.", "\"Compare what Sen. Sanders and I intend to do with Donald Trump's plan,\" Clinton said. \"His tax plan would make our current system even worse. Independent analysts say he would add $30 trillion to the national debt in order to give a massive gift to the wealthiest Americans, Wall Street money managers and our largest corporations. But after all, what else should we expect from someone who calls himself ‘The King of Debt?’ \"", "We wondered whether Clinton was right that \"independent analysts say (Donald Trump) would add $30 trillion to the national debt.\"", "As we have previously noted, the figure originated in a report from the Urban Institute-Brookings Institution Tax Policy Center, a nonpartisan group that, among other things, regularly analyzes the broader economic effects of presidential candidates’ tax proposals.", "In its report, the center found that \"including interest costs, the proposal would add $11.2 trillion to the national debt by 2026 and $34.1 trillion by 2036.\" This estimate assumes no major spending cuts would be made, which tracks with the historical pattern, the authors said. The Clinton campaign also noted that Trump has never specified any cuts to offset his plan.", "So Clinton has a point that the $30 trillion-plus figure has been used by an independent organization. Still, it’s worth noting a couple caveats.", "• That analysis uses a 20-year time frame. When groups like the Tax Policy Center analyze the budgetary impact of policy proposals, they typically use a fixed \"window\" of time to measure the effects. Usually, it’s a 10-year window. In this case, the center offered both a 10-year window and a somewhat more unconventional 20-year window.", "Over 10 years, the center projected, Trump’s policies would increase the debt by $11.2 trillion. Over 20 years, they would increase the debt by $34.1 trillion.", "So Clinton cherry-picked the bigger one for her talking point -- a figure that was three times as big, and which used an unconventional window of time.", "Regardless of the time frame she used, failing to indicate a time period for the figure is somewhat misleading, said Roberton Williams, a Tax Policy Center fellow.", "• Clinton overlooked a study with a smaller projected debt increase. Another study of Trump’s policies, by the economic forecasting firm Moody’s, offered three scenarios, depending on whether one takes Trump’s policy proposals at face value, whether he enacts them with some compromises, or whether he ends up unable to enact much of his agenda. All the scenarios look at the impact of the resulting policies over 10 years.", "The first scenario produces additional debt of $9.7 trillion above current policies. The second produces a debt increase of $6.9 trillion above current policies. And the last produces a debt increase of less than $1 trillion above current policies. That final scenario is about 3 percent of the amount Clinton cited in the speech.", "Our ruling", "Clinton said that \"independent analysts say (Donald Trump) would add $30 trillion to the national debt.\"", "The number does come from an independent, nonpartisan report. But Clinton didn’t cite the 20-year time frame for her statement, an important omission. And, she ignored smaller (though still substantial) projected increases from independent analysts. The statement is partially accurate but leaves out important details, so we rate the statement Half True.", "https://www.sharethefacts.co/share/8a31cb99-354b-40e1-a2c7-4eae5158d98b", "Hillary Clinton, remarks in a joint appearance with Bernie Sanders in Portsmouth, N.H., July 12, 2016", "Urban Institute-Brookings Institution Tax Policy Center, \"An Analysis of Donald Trump's Tax Plan,\" Dec. 22, 2015", "Moody's Analytics, \"The Macroeconomic Consequences of Mr. Trump’s Economic Policies,\" June 2016", "PolitiFact, \"Fact-checking Hillary Clinton's economic speech about Donald Trump,\" June 21, 2016", "Email interview with Roberton Williams, fellow at the Urban Institute-Brookings Institution Tax Policy Center, July 12, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]