["About this rating", "Christmas fans can listen to a series of classic Christmas stories and poems by calling a holiday hotline.", "This hotline is not Grinch specific. While you can hear various short Christmas poems, \"The Grinch Who Stole Christmas\" does not appear to be included.", "With the holiday season in full swing during December 2020, some social media users started sharing a message that supposedly contained the phone number of the Grinch, the cuddly-as-a-cactus, charming-as-an-eel, titular character of Dr. Seuss's classic children's book, \"How The Grinch Stole Christmas\":", "Calling the number 712-832-8555 might bring you some Christmas cheer, but it isn't a direct line to Whoville.", "This number is for the Christmas Story Hotline from FreeConference.com. When you call this number, you'll hear an audio recording of various Christmas stories and poems. When we called, we heard several short Christmas poems, such as \"'Twas the Night Before Christmas,\" \"A Chubby Snowman,\" \"A Toast to Santa Claus,\" \"Wintertime,\" and \"The Funniest Face.\" We did not, however, hear \"How the Grinch Stole Christmas.\"", "ABC Action News reported in 2019 that people could call the Christmas Story Hotline to hear the classic tale of the Grinch, but that no longer appears to be the case. We reached out to FreeConrerence.com for more information and will update this article accordingly.", "FreeConference.com notes that Christmas fans in Canada should use the number 867-292-5957, and people in the United Kingdom can call 0333-113-0054.", "Here's a brief video about the Christmas Story Hotline:", "https://www.youtube.com/watch?v=cR-aa9wBmCM&feature=emb_title", "This social media rumor does not contain the Grinch's phone number. However, there are other ways to hear the story about the vile, termites-in-his-smile, tender-as-a-crocodile Mr. Grinch.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]