["About this rating", "Though it received comparatively little coverage in U.S. media outlets, a Mexican scientist's medical breakthrough in February 2019 was legitimate.", "Mexico's National Polytecnic Institute (IPN) announced on 3 February 2019 that a team led by Eva Ramón Gallegos had developed a non-invasive treatment that eliminated the human papillomavirus in 29 women in Mexico City as well as in 420 women in the states of Oaxaca and Veracruz in past experiments.", "According to the Centers for Disease Control (CDC), the human papillomavirus, known as HPV for short, is the most common sexually transmitted infection in the U.S., with about 79 million Americans currently infected with some form of the virus. Around 14 variants of HPV can lead to a patient's developing cervical cancer, and the CDC reported that almost 12,000 women in the U.S. are diagnosed with cervical cancer every year.", "Ramón Gallegos' work, which she has carried out for 20 years, involves the use of photodynamic therapy, in which a drug (referred to as a \"photosensitizer\") is injected into the HPV patient's bloodstream. The patient is later exposed to light through the use of a laser, or fiber-optic cables.", "For example, as the National Cancer Institute reported:", "Approximately 24 to 72 hours after injection, when most of the agent has left normal cells but remains in cancer cells, the tumor is exposed to light. The photosensitizer in the tumor absorbs the light and produces an active form of oxygen that destroys nearby cancer cells ...", "The photosensitizer can damage blood vessels in the tumor, thereby preventing the cancer from receiving necessary nutrients. [The therapy] also may activate the immune system to attack the tumor cells.", "In her work, Ramón Gallegos and her team employed a substance called 5-Aminolevulinic acid, which over the course of four hours becomes the fluorescent compound Protoporphyrin IX. After the compound accumulates within infected cells, IPN reported, those cells were susceptible to being affected by her team's laser.", "IPN reported that the treatment also helped patients dealing with what are referred to as premalignant lesions associated with the early states of cervical cancer, and some 64.3 percent of patients suffering from HPV and lesions had the virus eradicated through Ramón Gallegos' work.", "We contacted IPN seeking comment on what the next stage will be for Ramón Gallegos after her latest findings but did not hear back prior to publication.", "Instituto Politécnico Nacional.   \"Elimina IPN Cien por Ciento Virus del Papiloma Humano.\"\r\n    3 February 2019.", "National Cancer Institute.   \"Photodynamic Therapy for Cancer.\"\r\n    Accessed 11 February 2019.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]