["About this rating", "On 9 October 2017, the \"satirical\" web site Freedum Junkshun published a story claiming that professional hockey player J.T. Brown was fired from the Tampa Bay Lighting after engaging in a silent demonstration against extrajudicial killings by police. The story was quickly recycled verbatim by similarly disreputable sites that try to pass themselves off as legitimate.", "As the national anthem played prior to the Lightning's game against the Florida Panthers on 7 October 2017, Brown raised his fist, evoking the protest carried out by Tommie Smith and John Carlos during the 1968 Summer Olympics.", "Freedum Junkshun fabricated a quote from the team's \"owner,\" Burt Lancaster:", "We wish Mr. Brown the best, but we feel that he does not embody the values of the Tampa Bay Lightning. We support our country, we support our troops, we support our police, and we support our President.", "The Lightning's actual owner is Jeff Vinik, who bought the team in 2010. The actor Burt Lancaster died on 20 October 1994.", "In reality, the Lightning released a statement supporting Brown:", "The Tampa Bay Lightning celebrate the moment before every game when we can unite as a community, paying homage to a flag that is representative of our nation and those who have sacrificed. At the same time, we respect our players and individual choices they may make on social and political issues.", "The fake quote is in line with Freedom Junkshun's \"satirical\" motus operandi. The site also contains a disclaimer:", "We believe that there is nothing more precious than the mind of an aging conservative. Here we gather a boatload of bullhonkey, works of pure satirical fiction, to give the fist-shakers of the world a reason to hate. Reality is often in the eye of the beholder. You won't find any of it here.", "Join the fun in the comments on our Facebook page where you too can watch David Hasselhoff running over someone's poodle magically transformed into a crime against humanity by Barack Obama or yet another murder the Clintons got away with.", "However, the story was republished by at least three other sites -- Conservative7, Defense Patriot, and American News -- that do not carry similar disclaimers.", "Brown first made the gesture prior to a pre-season game on 28 September 2017. After the Panthers game, he explained in a statement that his protest was not about showing disrespect toward the U.S. flag or its military forces:", "It is about police brutality, racial injustice, and inequality in this country. It is something that I as well as many others feel needs to be addressed. I love my country, but that doesn't mean I cannot acknowledge that it is not perfect. In my life, I have been through more than my fair share of racism both on and off the ice.\nThere comes a time when you cannot remain silent, hoping and wishing for a change. It takes much more.", "Brown also said that he had been hit with \"racist remarks and death threats\" on his Twitter account because of the protest.", "He has not repeated the protest since the Panthers game, and instead says he is working with the Tampa Police Department and community organizations that aim to foster better relationships between police and communities. Brown also took part in a simulation with the Tampa Police Department's Citizens Police Academy in which he played the role of an officer. Interim Police Chief Brian Dugan said after meeting with Brown:", "It's a credit to J.T. He could have just raised his fist and spewed some stuff in the paper and not really acted on it. He's probably going to do a ride-along with us in the streets when he can.", "Brown, DeNeen L. \"They didn't #TakeTheKnee: The Black Power protest salute that shook the world in 1968.\"\r\nWashington Post. 24 September 2017.", "Reuters. \"Lightning's Brown Raises Fist During National Anthem.\"\r\n7 October 2017.", "ESPN. \"Lightning's J.T. Brown Gets Death Threats After Protest.\"\r\n9 October 2017.", "Gross, Lila. \"VIDEO: Lightning’s J.T. Brown Trains With Tampa PD After Anthem Protest.\"\r\nWFLA-TV. 16 October 2017.", "Smith, Joe. \"Lightning's J.T. Brown Spent Day with Tampa Police. Here's What hHappened.\"\r\nTampa Bay Times. 15 October 2017.", "ESPN. \"Lightning's J.T. Brown Getting Involved After Anthem Protest.\"\r\n18 October 2017.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]