["Soon after it was confirmed that Sen. Kamala Harris would become vice president-elect, misinformation surrounding one of her previously proposed bills in the Senate surfaced on social media.", "Viral posts online claim that Harris recently suggested extending school hours.", "\"Kamala Harris Proposes Keeping Schools Open Until 6pm\" reads a screenshot of an article posted to Instagram on Nov. 9 with over 55,000 likes.", "Another Instagram user wrote, \"Kamala said y’all need more school time, Democratic presidential candidate and U.S. Senator Kamala Harris introduced legislation Thursday that would align school hours with work hours to support working families.\"", "USA TODAY reached out to the users for comment.", "Fact check:There was strong Navajo support for Biden, but numbers cited in claim have changed", "Originally published in November 2019, the headline in the screenshot is from an article by Hollywood Unlocked on Harris' proposed five-year pilot program aimed at helping low-income families avoid extra after-school care costs.", "The Family Friendly School Act, introduced that same month, would extend hours for 500 selected schools from at least 8 a.m. to 6 p.m. to alter the traditional school days to align with parents' work schedules, USA TODAY previously reported.", "If enacted, the legislation would also award schools serving low-income families with five-year grants of up to $5 million for “academic, athletic or enrichment opportunities” with “community partners,\" according to a 2019 news release from Harris' office.", "The proposal would also require the Department of Education to publish and disseminate a report on lessons learned at the end of the five-year grant period. The bill would not require teachers to work additional hours; however. If a teacher chose to work additional hours, they would be \"compensated fairly.\"", "There has been no advancements on the bill since it was introduced in 2019, and the Biden-Harris education plan makes no mention of extending school hours.", "Fact check: Political news website never called Pennsylvania for Joe Biden", "President-elect Joe Biden's education plan aims to triple the amount of money low-income schools receive from the federal government, provide teachers with a raise and calls for more mental health care in schools, according to Vox.", "Biden's education agenda also includes reopening schools safely, a broad expansion of K-12 to include 3- and 4-year-olds in the form of \"high-quality universal\" prekindergarten, as well as naming an education secretary, NPR reported.", "Biden's caregiving proposal aims to expand access to child care by offering bonus payments to providers who operate during nontraditional hours. There is no mention of extending school days.", "As Edsource notes,\"it's unclear what impact Vice President-Elect Kamala Harris will have, if any, on a Biden administration’s education agenda.\"", "The claim that Harris proposes keeping schools open until 6 p.m. is rated MISSING CONTEXT because the claim is based off of a bill Harris introduced in 2019 that has not been enacted. The Biden-Harris education plan does not include extending school hours to align with traditional workdays.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]