["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Opponents of Proposition 56, California’s proposed tobacco tax increase, have raised more than $66 million to defeat the November ballot measure. Nearly all of that money has come from the tobacco industry and much of it has been spent on television ads criticizing the initiative.", "Supporters have raised nearly $30 million for it.", "Prop 56 would impose a $2 per pack tax increase on cigarettes statewide and fund health programs.", "A recent No on 56 TV ad features a retired doctor who makes a provocative claim about how the measure’s revenue would be spent:", "\"Prop 56 diverts 82 percent of the new taxes to line the pockets of wealthy special interests like insurance companies who don't have to help even one more patient,\" says Amador County Dr. Arnold Zeiderman, who appears in the ad wearing a white coat and stethoscope.", "Would the measure really distribute the bulk of the revenue to \"wealthy special interests\" with no mandate to serve more patients? We decided to check the facts.", "Our research", "The nonpartisan Legislative Analyst’s Office expects Prop 56 could generate up to $1.4 billion in tax revenue in its first year.", "A chunk of that would go to replacing losses to state tobacco funds that would likely see a dip if cigarette sales decline due to the tax increase. Five percent would be spent to administer the tax. And about $120 million would go to various state programs, from law enforcement to physician training to dental disease prevention.", "The LAO report says 82 percent of the remaining revenue -- anywhere from $700 million to $1 billion -- would be spent to \"increase the level of payment for healthcare, services and treatment provided to Medi-Cal beneficiaries.\"", "Medi-Cal provides health care for the state’s poorest residents. Health advocates have long argued the program’s reimbursement rates are too low to retain and attract doctors.", "Charles Rex Arbogast /AP file photo", "Expanding patient access?", "Supporters of Prop 56 say boosting reimbursement rates will lead to more doctors serving more Medi-Cal patients -- which runs against the implication in the ad that the measure won’t help \"even one more patient.\"", "Scott Graves of the California Budget and Policy Center examined Prop 56 and concluded on the center’s website: \"Increasing Medi-Cal reimbursement rates would help to boost providers’ participation in the program and help ensure timely access to care — and possibly improved health outcomes — for the more than 13 million low-income Californians who rely on Medi-Cal to meet their health care needs.\" The policy center is a nonprofit that advocates for programs aimed at low-income families.", "A spokeswoman for the No on 56 campaign acknowledged that 82 percent of the measure’s revenue would be set aside for increasing reimbursement rates. But the No campaign also said the measure does nothing to require more Medi-Cal patients are served.", "Supporters say that point is technically correct but distorts the point of the measure.", "\"We made a determination that it would be better to dedicate money to Medi-Cal broadly rather than setting an arbitrary formula,\" said Anthony Wright, executive director of Health Access California, the consumer advocacy group that helped draft Prop 56. \"The idea that this would help not even one new patient is sort of absurd. ... They're playing a little bit of a word game there.\"", "‘Misleading’ ad", "Manoj Viswanathan, a UC Hastings law professor who focuses on tax policy and has studied Proposition 56, described the No campaign’s advertisement as \"misleading.\"", "The professor, who is not affiliated with either side, said the No campaign appears to rest the second portion of the claim by the retired doctor -- the idea that Medi-Cal providers \"don't have to help even one more patient\" -- on an \"unlikely\" scenario.", "\"Is there a universe where doctors see the exact same patients that they would have seen anyway, but are just getting paid more? Sure. I think that is a mathematical possibility. It just seems unlikely,\" Viswanathan said.", "According to the LAO, the California State Auditor would conduct audits of agencies receiving funds from the new taxes at least every other year.", "The Sacramento Bee examined claims by No on 56, and found questionable its description of Medi-Cal providers as \"wealthy special interests.\" It notes those providers are \"doctors, clinics, hospitals, managed care plans and any other health-related group that get Medi-Cal payments because they provide services to eligible patients.\"", "Our ruling", "A recent No on 56 campaign ad claims: \"Prop 56 diverts 82 percent of the new taxes to line the pockets of wealthy special interests like insurance companies who don't have to help even one more patient.\"", "The Legislative Analyst’s Office reported that 82 percent of revenue generated by the measure, after some is directed to other funds, would be spent to \"increase the level of payment for healthcare, services and treatment provided to Medi-Cal beneficiaries.\"", "Experts who have examined Prop 56 say there’s a strong chance that higher reimbursement rates will attract more doctors and expand health care access for patients.", "There’s the smallest sliver of truth to the No on 56 campaign’s claim that providers \"don’t have to help even one more patient\" because the measure does not dictate how many new patients will be served.", "But the claim also asks one to suspend reality by believing no new doctors would be attracted by the higher rates and that current doctors would not add more patients.", "Even the addition of handful of new doctors would expand healthcare access, shooting down the campaign’s misleading statement.", "We rated its claim Mostly False.", "MOSTLY FALSE – The statement contains some element of truth but ignores critical facts that would give a different impression.", "Click here for more on the six PolitiFact ratings and how we select facts to check.", "https://www.sharethefacts.co/share/5fa724f2-27fc-42b4-ae1d-fa849712cb0f", "Dr. Arnold Zeiderman, No on 56 campaign TV ad, Oct. 7, 2016", "Legislative Analyst’s Office, Proposition 56 analysis, accessed October 2016", "California Budget & Policy Center, Proposition 56: Should California Voters Increase the State Excise Tax on Cigarettes and Other Tobacco Products?, accessed October 2016", "PolitiFact California, Big Tobacco blowing smoke in claim about California's Prop 56, Aug. 26, 2016", "Sacramento Bee, Tobacco companies mislead voters in Prop. 56 ads on school funding, Sept. 21, 2016", "Interview, Mike Roth, spokesman, Yes on 56 campaign, Oct. 17, 2016", "Interview, Beth Miller, spokeswoman, No on 56 campaign,  Oct. 17, 2016", "Interview, Manoj Viswanathan, associate law professor, UC Hastings Business Tax Practicum for Social Enterprises, Oct. 18, 2016", "Interview, Anthony Wright, executive director, Health Access California, Oct. 21, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]