["Rep. Matt Gaetz, R-Fla., speaks during a House Judiciary Committee hearing on gun violence, at Capitol Hill in Washington, Wednesday, Feb. 6, 2019. (AP)", "In an emotional congressional hearing on gun violence, U.S. Rep. Matt Gaetz, R-Fla., sparked controversy when he brought up deaths by immigrants in the country illegally, drawing shouts from fathers whose children were shot to death in Parkland.", "Gaetz said Feb. 6 that a proposed gun background check bill would not have stopped violent crimes committed by undocumented immigrants. However, he said that a \"wall, a barrier on the southern border may have.\"", "The next day, CNN host Chris Cuomo asked Gaetz why he brought up immigrant-linked deaths during the gun violence hearing in an interview the next night. Gaetz offered a fiery rebuttal, misleadingly saying that the \"new left\" wants to be \"borderless with no ICE.\" ( In 2018, congressional Democratic leaders called for a restructuring of Immigration and Customs Enforcement — which handles removals from inside the country — but not an end to immigration enforcement. A few Democrats seem to want the agency shuttered, but many others talk of changing or limiting the agency.)", "At one point, Gaetz argued that the Democrats used to call for cracking down on illegal immigration, too.", "\"In 1992, the Democratic Party had in their platform provisions that said that illegal aliens were coming in this country, committing felonies, sent back and then they were right back across the border to do the same thing,\" said Gaetz, of Fort Walton Beach.", "Gaetz’s claim about the party’s platform was new to our ears, so we decided to fact-check it. We found that Gaetz had a point, but was off by one presidential cycle. The 1996 Democratic Party platform was unusually tough in raising alarm about illegal immigrants committing crimes, being deported and returning to the United States.", "The political parties write platforms in presidential election years to outline their positions on major political issues. They offer a collective vision to which the candidates are somewhat bound.", "\"Convention delegates, interest groups, party activists, and party officials fight very intensely over planks in the platform because they believe those words are important and define just what the party stands for,\" said University of Denver political science professor Seth Masket. \"They're not just to tell candidates what to run on; they're to tell party members just what kind of candidates they want to nominate in the first place.", "The 1992 party platform said very little about immigration. The brief mention shows the Democrats using welcoming terms:", "\"Our nation of immigrants has been invigorated repeatedly as new people, ideas and ways of life have become part of the American tapestry. Democrats support immigration policies that promote fairness, non-discrimination and family reunification, and that reflect our constitutional freedoms of speech, association and travel.\"", "Gaetz’s spokeswoman told us that he was referring to the 1996 party platform, which indeed offered a sharp turn. That platform took a hard-line stance against illegal immigration and praised efforts on border security by President Bill Clinton, who was running for his second term.", "Part of the platform read:", "\"Today's Democratic Party also believes we must remain a nation of laws. We cannot tolerate illegal immigration and we must stop it. For years before Bill Clinton became president, Washington talked tough but failed to act. In 1992, our borders might as well not have existed. The border was under-patrolled, and what patrols there were, were under-equipped. Drugs flowed freely. Illegal immigration was rampant. Criminal immigrants, deported after committing crimes in America, returned the very next day to commit crimes again. … Just since January of 1995, we have arrested more than 1,700 criminal aliens and prosecuted them on federal felony charges because they returned to America after having been deported.\"", "That language is similar to what Gaetz cited: the Democrats talked about immigrants in the country illegally committing crimes, being sent back to their home countries, and then returning to the United States.", "Gaetz didn’t mention this, but the platform also contained a pro-immigration message. It said, for example, \"we deplore those who blame immigrants for economic and social problems\" and \"deplore those who use the need to stop illegal immigration as a pretext for discrimination.\"", "At the time, the Republican Party platform was more aggressive. It asserted that undocumented immigrants increase crime, that children of illegal immigrants should be blocked from gaining citizenship, and English should be the official U.S. language. It had a brief nod about the United States as a nation of immigrants: \"We welcome those who follow our laws and come to our land to seek a better life. New Americans strengthen our economy, enrich our culture, and defend the nation in war and in peace.\"", "The Democratic platform in 1996 was influenced by the changing immigration politics of the early to mid 1990s.", "The number of unauthorized immigrants was rapidly rising, from 4.2 million in 1992 to 5.6 million in 1996 (a 33 percent increase). Public opinion polls indicated that two-thirds of Americans believed that immigration levels should be decreased.", "Major constituencies of the Democratic Party, including unions and environmentalists, also advocated for reductions in immigration, said Rey Koslowski, a University at Albany political science professor.", "The U.S. Commission on Immigration Reform chaired by Democrat Barbara Jordan recommended increasing Border Patrol officers, restricting the ability of undocumented immigrants to get public services and reducing legal immigration.", "The more conservative approach was part of Clinton’s broader effort to move the Democratic Party to the center. The \"New Democrat\" agenda included his 1996 overhaul of welfare (half of which was initially paid for by cutting all benefits to permanent resident aliens) as well as revisions to immigration law.", "The Democratic Party, having spent a long time being battered as being soft on crime, made a strategic decision to embrace the illegal immigration control pieces of the legislation, said William Stock, former president of the American Immigration Lawyers Association.", "Clinton signed the Illegal Immigration Reform and Immigrant Responsibility Act into law on Sept. 30, 1996 — just in time for the November presidential election. The 1996 law called for deporting immigrants who were once legally in the United States but now subject to deportation because of a criminal conviction.", "These efforts in 1996 helped Clinton attract a large swath of voters, including industrial workers in the midwest (so-called Reagan Democrats), independents, environmentalists and Southern Democratic voters. \"And it worked,\" Koslowski said.", "Before the election, the Republicans thought they would parlay their 1994 midterm sweep into a presidential victory, choosing San Diego, Calif., as the site of their national convention. Two years before, California voters passed a measure that prohibited illegal immigrants from using health care, public education and other services. (Courts later deemed Proposition 187 unconstitutional.)", "Clinton won re-election and received 72 percent of the Latino vote.", "Over time, the Democratic Party’s platform shifted to helping undocumented immigrants as immigration became more of a civil rights issue.", "The 2016 platform made a passing nod to border security, calling for a pathway to citizenship and stating that enforcement should focus on safety threats.", "\"President Trump and his aggressive immigration enforcement, unlike that seen in any modern president, has further polarized the issue and led many Democrats to resist the enforcement initiatives,\" said Kevin Johnson, dean of the University of California Davis, School of Law.", "Gaetz said, \"In 1992 the Democratic Party had in their platform provisions that said that illegal aliens were coming in this country, committing felonies, sent back and then they were right back across the border to do the same thing.\"", "He got the year wrong; he was was actually referring to the 1996 platform. That document touted Clinton’s efforts on stopping illegal immigration. Using similar words as what Gaetz described, it said that in 1992, \"Drugs flowed freely. Illegal immigration was rampant. Criminal immigrants, deported after committing crimes in America, returned the very next day to commit crimes again.\"", "Gaetz accurately captured the party’s sentiment in the mid 1990s. More recent platforms have favored a pathway to citizenship for undocumented immigrants.", "We rate this statement Mostly True.", "CNN Chris Cuomo, Interview with U.S. Rep. Matt Gaetz, Feb. 7, 2019", "Washington Post, Rep. Matt Gaetz calls for Parkland fathers to be removed from House hearing on gun violence, Feb. 6, 2019", "American Presidency Project, Party platforms, 1992-2016", "Gallup, Immigration polls, Through 2018", "Office of Policy and Planning U.S. Immigration and Naturalization Service, Estimates of the Unauthorized Immigrant Population Residing in the United States: 1990 to 2000", "Sun Sentinel, Florida congressman Matt Gaetz clashes with Parkland dad at hearing on gun violence, Feb. 6, 2019", "New York Times, THE 1994 ELECTIONS: THE NATION CALIFORNIA; Gov. Wilson's Comeback Ends in Re-election Victory, Nov. 9, 1994", "San Diego Union Tribune, No more ‘scapegoat politics,' say Latino leaders, Aug. 14, 1996", "Reason, When the entire Democratic Party was like Donald Trump, Aug. 26, 2015", "Washington Post, What Republicans and Democrats have disagreed on, from 1856 to today, July 15, 2016", "Bloomberg, Democrats Used to Worry About Immigration Too. What Happened? Nov. 7, 2006", "Des Moines Register, Activists, candidates bid to get Latinos to polls, Sept. 12, 2007", "Miami Herald, Immigration protest to help Hispanics, but not yet, May 4, 2006", "The Hill, Cuomo challenges GOP lawmaker on gun violence: 'You guys have never done a damn thing,’ Feb. 8, 2019", "University of Texas at Austin, U.S. Commission on Immigration Reform", "House Judiciary Committee, Chairman Nadler Opening Statement for Hearing on Preventing Gun Violence in America, Feb. 6, 2019", "Pew, Latino Voters in the 2012 Election, Nov. 7, 2012", "Fort Worth Star-Telegram, Angry Hispanics voice displeasure with both parties, Aug. 30, 1996", "PolitiFact, Matt Gaetz file", "PolitiFact, No, Bill Clinton did not pass a law separating families, June 21, 2018", "PolitiFact, Abolish ICE movement is growing. Is the agency's disbanding likely? July 3, 2018", "PolitiFact, Gaetz misleads in claim about immigrants, crime, Aug. 30, 2017", "Interview, Jillian Lane Wyant, Rep. Matt Gaetz chief of staff, Feb. 11, 2019", "Interview, Kevin Johnson, Dean of the University of California Davis, School of Law,  Feb. 12, 2019", "Interview, Alan Bersin, policy consultant at Covington and former Assistant Secretary in the Office of Policy at the U.S. Department of Homeland Security (DHS) and former U.S. Attorney Southern District of California, Feb. 11, 2019", "Interview, Rey Koslowski, University at Albany political science professor, Feb. 11, 2019", "Interview, William Stock, National President, American Immigration Lawyers Association, 2016-17 and Klasko Immigration Law Partners, LLP, Feb. 12, 2019", "Interview, Seth Masket, University of Denver political science professor, Feb. 12, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]