["The photo was published on Facebook here on August 3, 2020.", "The text superimposed on the image states: \"Government dignitaries paying their respects to people working behind the scene to keep Japan safe from Covid19.\"", "The post’s caption states in part: “That’s Japan.”", "As of August 12, 2020, more than 20 million confirmed COVID-19 cases and some 740,000 deaths have been reported, according to data from Johns Hopkins University.", "The same photo was also shared here, here, here, here, here, here and here on Facebook alongside a similar claim.", "The claim, however, is false.", "A combined reverse image and keyword searches on Google found an identical photo published here in a photo gallery on Chinese-language site news.163.com on January 5, 2011.", "The simplified Chinese-language caption of the photo translates to English as: \"On January 3, the first working day of the new year, mid- and high-level leaders at ORANS bow to welcome employees at the gate in Luqiao district, Taizhou city, Zhejiang province.\"", "ORANS is a company that manufactures bathroom products, according to its website.", "Below is a screenshot comparison of the photo in the misleading posts (L) and the 2011 photo published by news.163.com (R):", "The photo in the news.163.com report shows a gate similar to the one seen in this photo geotagged on Baidu Maps to the ORANS facility in Taizhou city.", "Below is a screenshot comparison of the news.163.com photo (L) and the Baidu Maps photo (R) with the corresponding feature circled in red by AFP:", "The accompanying images in the news.163.com photo gallery also contradict the claim that the photo in the misleading posts was taken in Japan during the COVID-19 pandemic.", "The first photo appeared in this January 11, 2011, report by the Chinese state-owned provincial newspaper Zhejiang Daily, with a description similar to the news.163.com article stating it was taken in Taizhou\n\tCity.", "The sixth photo shows employees in a uniform that bears the logo of ORANS.", "Below is a screenshot of the photo published by Zhejiang Daily with the logo circled by AFP:", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]