["On the same day as he announced a halt on entries from Syria and six other predominantly Muslim countries, President Donald Trump claimed the United States was discriminating against Christians in its refugee admission policy.", "Trump’s executive order declaring the ban includes an exemption for persecuted religious minorities.", "In an interview with the Christian Broadcast Network, Trump explained: \"If you were a Christian in Syria it was impossible, at least very, very tough to get into the United States. If you were a Muslim, you could come in, if you were a Christian, it was impossible.\"", "This is a claim we heard from Trump during the 2016 election, and it’s inaccurate. Christians make up a very small fraction of Syrians admitted under the refugee program, but they have been able to enter the United States. There is no evidence that this is an outcome of discriminatory policy. Refugee admissions skew in favor of Christians in other countries.", "Admissions numbers", "From Jan. 1, 2012 (the year the first Syrian refugees began arriving) to Jan. 29, 2017, the United States admitted 19,324 refugees from Syria.", "According to federal data, this included 19,025 Muslims and 199 Christians. (Another 86 belonged to other religions or no religion at all.)", "So, right off the bat, Trump is wrong that it was \"impossible\" to enter the United States as a Christian.", "Christians do make up a small fraction of refugee admissions compared with their makeup in the overall population of Syria. (We’ll explain why that may be later.) But they did come in; it was not \"impossible,\" as Trump said.", "Muslims made up about 98 percent of Syrian refugees, compared with about 87 percent of Syria’s population, as of Jan. 12, 2017, according to the CIA World Factbook. Christians, meanwhile, were 10 percent of the population but just 1 percent of refugees. (The Pew Research Center meanwhile says about 5 percent of Syrians are Christians.)", "This pattern, however, doesn’t exist for the other countries targeted by Trump’s ban. In some cases, the reverse is true: The proportion of Christian refugee admissions are greater than the proportion of Christians living the country.", "Here’s a breakdown of refugee admissions by country and religion in the time frame (Jan. 1, 2012 to Jan. 29, 2017):", "Christian refugees", "Christian population", "Muslim refugees", "Muslim population", "Syria", "1%", "10%", "98%", "87%", "Iran", "49%", "0.9%*", "9%", "99%*", "Iraq", "26%", "0.8%", "71%", "99%", "Sudan", "13%", "5%*", "79%", "91%*", "Somalia", "0.2%", "0.2%*", "99.8%", "99.8%*", "Libya", "0%**", "2.7%", "100%**", "97%", "Yemen", "27%", "0.2%*", "60%", "99.1%*", "Experts say no evidence of religious discrimination", "When we looked into Trump’s claim in July 2015, all the experts we spoke with said Trump’s accusation is off base. A year and half later, there’s still no evidence that Christians have a higher bar to clear for entry.", "David Martin, an immigration law expert at the University of Virginia who previously held posts at the Departments of State, Justice and Homeland Security, acknowledged that Christian Syrians make up a smaller number of admissions than they do the overall population.", "But he said, \"there are many possible explanations and this certainly doesn’t reflect a general hostility to Christians.\"", "One possible explanation for the few number of Christian Syrians admitted, the Washington Post’s Fact-Checker reported, is an initial religious disparity at the United Nations’ refugee programs. (The long vetting process for refugees seeking entry to the United States begins with the United Nations High Commissioner for Refugee.)", "The UNHCR reports that 1.5 percent of the nearly 5 million Syrian refugees it has registered are Christian. Agency spokespeople have warned against speculation but suggested this may be because Syrian Christians have the means to move without seeking assistance from the United Nations.", "In October 2015, then-U.N. High Commissioner for Refugees and current U.N. Secretary General António Guterres offered a few other theories.", "Christians in Syria \"have been less systematically victimized than they were in Iraq,\" he said. \"Most of the Syrian Christians have moved to Lebanon. And in Lebanon, the first thing that happened to me when I met with the Lebanese president ... when I asked him to start a resettlement program from Lebanon, (he said), don’t resettle Christians because they are vital for us.\"", "Ann Richard, then-assistant secretary of state for population refugees and migration, suggested in a congressional hearing in December 2015 that Christian Syrians aren’t looking to move out of the country.", "\"A disproportionate number of Syrians staying in the country are Christian. Now why is this? It’s because a higher percentage of them support Assad and feel safer with him there,\" she said (around 2:23:50 mark).", "Regardless of the disparity in Syria, experts did not agree with Trump’s suggestion that Christians face additional hurdles.", "\"The U.S. government does not discriminate on the basis of religion in refugee admission or resettlement, and if you look at refugee admissions by religion over the past 10 years, rather than just at the Syrian refugees in the past few years, there are likely more Christians than Muslims,\" Karen Jacobsen, a professor at Tufts University’s Fletcher School of Law & Diplomacy, told us previously.", "Martin pointed out that since 2004, Christians have made up about 46 percent of refugee admissions from Iraq. That’s disportionate to the country’s total Christian population by a factor of about 58.", "Geoffrey Mock, a Middle East specialist for Amnesty International USA, said Amnesty has documented a myriad of human rights violations in the refugee resettlement process, but not religious discrimination \"because we haven’t see any of it from the U.S. side.\"", "Our ruling", "Trump said, \"If you were a Muslim, you could come in, if you were a Christian, it was impossible.\"", "Hundreds of Syrian Christians have entered the United States through the refugee admissions program. Thousands more Christians from other countries targeted by Trump’s ban have also entered.", "During former President Barack Obama's tenure, there was no formal policy that discriminated against Christians. People who watch the refugee process closely said there was no actual discrimination against Christians, either.", "With nothing to support this claim, we rate it False.", "https://www.sharethefacts.co/share/e1da0489-11fc-4450-bf0d-6d8317cfd7a4", "PolitiFact, \"Donald Trump says if you're from Syria and a Christian, you can't come to the U.S. as a refugee,\" July 20, 2015", "PolitiFact, \"Wrong: Donald Trump says there's 'no system to vet' refugees,\" June 13, 2016", "Washington Post Fact-Checker, \"Trump’s claim that it is ‘very tough’ for Christian Syrians to get to the United States,\" Jan. 28, 2017", "United Nations High Commissioner for Refugees, Syria, accessed Jan. 29, 2017", "Refugee Processing Center interactive reporting tool, queries for Syria, Iran, Iraq, Somalia, Sudan, Libya, and Yemen, accessed Jan. 29, 2017", "Central Intelligence Agency, World Factbook, Jan. 12, 2017", "Pew Research Center, The Future of World Religions, April 2, 2015", "Youtube, \"A Global Response to the Syrian Refugee Crisis\", Oct. 28, 2015", "C-SPAN, \"Foreign Travelers and National Security Hearing,\" Dec. 17, 2015", "Email interview with David Martin, law professor at the University of Virginia, Jan. 29, 2017", "Email interview with Geoffrey Mock, Middle East specialist at Amnesty International USA, Jan. 29, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]