["About this rating", "Biden has never had direct ownership of a stock or a bond, but he has paid money into retirement funds that are themselves invested in the stock market.", "Biden, both on his own and as a household unit with his wife, has possessed savings accounts.", "On multiple occasions, presumptive 2020 Democratic presidential nominee Joe Biden has asserted that he has never owned stocks or bonds. On at least one occasion, he also made the statement that he has never had a savings account, either.", "Elected to Congress in 1972 at age 29, Biden has served nearly all of his professional life as a public servant, and he has often invoked his working-class roots and comparatively modest means relative to others who entered politics after making money in the private sector.", "In a 2014 speech at the North American International Auto Show, Biden told the crowd that he made a commitment in 1972 — the year of his first run for U.S. Senate — that he would \"never own any stocks or bonds\" as a public servant, and that he had kept that promise:", "Later that year, in a speech at the White House Working Families Summit, Biden repeated the stock and bond claim, and further stated that he did not have a savings account.", "\"Don't hold it against me that I don't own a single stock or bond,\" Biden said in his remarks. \"I have no savings account, but I got a great pension, and I got a good salary.\"", "To address these claims, Snopes looked at reporting of Biden's finances following his selection as Barack Obama's running mate in 2008, financial-disclosure forms filed in 2009, 2010, 2011, 2012, 2013, 2014, and 2015 during his time as vice president, and from financial disclosure forms and tax documents published on his campaign website for the years 2019 and 2020.", "In terms of stocks or bonds, Biden does not appear to have ever had a direct ownership of either. Following the Obama campaign's 2008 release of a decade's worth of Biden's tax returns, The New York Times reported that Biden, at that time, had \"virtually no outside or investment income, and pays a substantial amount in interest on his home mortgage.\" Similarly, we found no direct ownership of any stock or bond in any publicly available financial-disclosure document from 2009-2020.", "But it is not true that the Biden household's finances are entirely independent of the stock market, or of interest-generating investments. For example, Biden is invested in retirement funds that are ultimately invested in the stock market. Jill Biden, Joe Biden's wife, is invested in the stock market through a type of retirement fund known as a tax-sheltered annuity, among others. Via this investment, Jill Biden — who is indicated as the owner by an \"S\" for spouse on 2009-2015 era financial disclosure forms — is indirectly invested in several stocks via multiple mutual funds.", "Speaking to Politifact in 2014, George Pennacchi, a finance professor at the University of Illinois Urbana-Champaign, argued that, \"Even if the investments aren't in the vice president's name, they are part of his household wealth, and he stands to benefit from their success.\"", "It is generally true that Biden does not make much, if any, interest on money held in savings accounts, but it is technically incorrect to state he has never had a savings account or that his household currently is without one. In all documents we viewed from 2009-2015, Biden (either as an individual in 2009, or jointly with his wife until at least 2015) listed a United States Senate Credit Union savings account with between zero and $15,000 in assets. In each filing, this account generated between zero and $201 in interest payments. Jill Biden has also held several savings accounts in her own name during this time period, some of which generate interest payments.", "Because Biden — at least going back to the late 1990s — has never had direct ownership of a stock or bond, but because he and his household have held savings accounts and are indirectly invested in the stock market through retirement funds, we rank this claim a \"Mixture.\"", "The New York Times.   “Biden Takes Oath Friday.\"\r\n    3 January 1973.", "Camp, David.   \"Joe Biden on Having Few Assets, and Why He Wishes He’d Had a Republican Child.”\r\n    Vanity Fair.   8 November 2017.", "The Obama White House (YouTube).   “Vice President Biden Addresses the North American International Auto Show..\"\r\n    16 January 2014.", "Kaplan, Rebecca.   \"Joe Biden Doesn't Have a Savings Account?”\r\n    CBS News.   23 June 2014.", "Broder, John M.   \"Biden Releases Tax Returns, in Part to Pressure Rivals.”\r\n    The New York Times.   13 September 2008.", "U.S. Office of Government Ethics.   “OGE Form 278 - Joseph, R., Jr., Biden\"\r\n    2009, 2010, 2011, 2012, 2013, 2014, 2015, 2019, 2020.", "Nuveen.   “TIAA-CREF Lifecycle 2010 Fund, Description\"\r\n    Accessed 13 August 2020.", "Carro, Lauren and Molly O'Connor.   \"Biden Releases Tax Returns, in Part to Pressure Rivals.”\r\n    Politifact.   13 September 2008.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]