["In the wake of increased media coverage of people going missing, South Africa’s newly appointed police minister, took to social media to offer advice.“Assist us in finding you if the worst happens,” Minister Fikile Mbalula tweeted. “Your IMEI number can be of great use”.The minister had attached an image which encouraged the public to find out what their IMEI numbers are, as these could help trace the last or current location of the phone user “even if the sim card had been removed from ur phone [sic]” the image’s text read.“Give ur IMEI NUMBER to family and friends so that when u disappear without an explanation and ur phone is off or rings unanswered, they can make the case easy for the police by providing them with this number which can then be used to track ur movements,” it further said.Two readers asked us to check if this really works.", "Assist us in finding you if the worst happens.", "Please complete this form to receive the HTML sharing code.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "For democracy to function, public figures need to be held to account for what they say. The claims they make need to be checked, openly and impartially. Africa Check is an independent, non-partisan organisation which assesses claims made in the public arena using journalistic skills and evidence drawn from the latest online tools, readers, public sources and experts, sorting fact from fiction and publishing the results.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "© 2023 - Africa Check - All rights reserved.", "We will never charge you for verified, reliable information. Help us keep it that way by supporting our work.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "Support independent fact-checking in Africa."]