["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Del. Jason Miyares, R-Virginia Beach, has offered a compromise red-flag bill that would take firearms away from people deemed dangerous to themselves or others.", "While the gun-control debate has largely focused on stopping mass shootings, Miyares says the biggest value of his bill could be that it would stop some people from shooting themselves.", "\"On average, 65% of all gun deaths in America are from suicides,\" he said during an August 14 interview on The John Frederick Show, a conservative radio broadcast. \"...This is one step we could do, in my opinion, to prevent people from harming themselves. \"It’s not just about some of the mass carnage.\"", "We fact-checked his claim that suicides account for 65 percent of gun deaths in the U.S. The latest information comes from an annual report issued in June 2019 by the Centers for Disease Control and Prevention. The study is called, \"Deaths, Final Data for 2017.\"", "According to the data, there were 38,882 deaths by firearms in 2017, and 23,854 were suicides. That comes to 61.4% - a little lower than Miyares’ figure.", "In addition to suicides, the statistics showed 14,542 of the gun deaths (37.4%)  were murders, and 486 were accidental (1.2%).", "Because Miyares began his statement saying \"on average,\" we computed 10 years of statistics - from 2008 through 2017. There were 335,746 gun deaths, and 208,287 were suicides. That’s a 62% average - again, a little lower than Miyares figure.", "Over 10 years, the CDC reported 335,746 gun deaths, and 208,287 were suicides. That’s 62%.", "We asked Miyares for the source of his 65% claim, and he sent us a magazine article that ran in The Atlantic on Dec. 21, 2018. The article, referring to CDC data, said, \"suicides account for 60 percent of the country’s gun deaths.\"", "During the span from 2008 to 2017, slightly more than half of suicides were committed with firearms, according to CDC data. The number of yearly suicides increased by 36 percent - from 18,223 to 23,8545. Annual suicides by guns increased 30 percent, from 18,223 to 23,854.", "Red-flag laws", "A number of Virginia legislators - most of them Democrats - have called for a red-flag law, predicting it would reduce gun violence. At least 15 states have enacted such measures.", "In Virginia, Democrats offered a bill this winter that would have allowed law-enforcement officials to ask a judge to declare a person a \"substantial risk\" to himself or others and order police to seize his guns for up 14 days. Sometime within that period, the person would have been entitled to a hearing to refute charges. If the judge found the charges credible, he could have ordered the guns held for renewable 180-day periods.", "Republicans controlling a House subcommittee defeated the bill on a 4-2 vote. Gun enthusiasts complained the measure allowed guns to be taken without due process.", "Miyares says his bill addresses that concern. It would require a person to be evaluated by a mental health expert and appear before a judge, with a chance to defend himself, before his firearms could be taken away for renewable 14-day periods. The General Assembly is expected to consider the measure in November.", "Our ruling", "Miyares, in promoting his red-flag bill, said, \"On average, 65% of gun deaths in America are from suicides.\"", "His figure slightly overstates a sad situation. CDC data shows that 62% of gun deaths from 2008 to 2017 were suicides. We rate his statement Mostly True.", "Jason Miyares, radio interview on The John Fredericks Show (8:58 mark), Aug. 13, 2019.", "Miyares, phone interview and email, Aug. 20, 2019.", "Centers for Disease Control and Prevention, \"Deaths, Final Data for 2017,\" Table 6; 2016, 2015, 2014, 2013, 2012, 2011, 2010, 2009, 2008.", "Giffords Law Center, \"Extreme Risk Protection Orders,\" accessed Aug. 19, 2019.", "Legislative Information Service, HB 4031, HB 1753.", "The Atlantic, \"The disturbing trend behind America’s soaring gun deaths,\" Dec. 21, 2018.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]