["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The flier landing in mailboxes across the 10th Senate District -- courtesy of Democrat Dan Gecker -- has a photo of a girl sitting at a school desk, staring pensively.", "\"Glen Sturtevant Has the Wrong Priorities For Our Schools,\" the mailer says. Underneath, a red box with white capital letters provides the kicker: \"AGAINST SMALLER CLASS SIZES.\"", "We investigated whether Sturtevant, a Republican, has opposed lowering class sizes since he was elected to the Richmond School Board in 2012. It’s a claim that Gecker, a Chesterfield County supervisor, repeatedly has made against Sturtevant in their race for the state Senate. They’re vying for a seat long held by Republican John Watkins, who’s not seeking re-election.", "During the past two weeks, we’ve come across two other Gecker mailers that make the same charge but with a little more detail. One says Sturtevant is \"the only school board member to vote against reducing class sizes.\" The other says he was the only member to \"vote against a budget that reduces class sizes.\"", "Footnotes on all the mailers refer to a May 28, 2015, article in the Richmond Times-Dispatch about the Richmond School Board’s 8-1 vote for a $271.5 million budget for the fiscal year that started July 1.", "The article cited several initiatives in the budget, including these two:", "$1.3 million for \"reducing class sizes for kindergarten through third grade.\" This referred to a budget item providing money to hire an additional 17 permanent K-3 teachers.", "About $2.5 million to expand the teacher work year from 191 days to 194. The three extra days are professional development days -- time for teachers to attend seminars and workshops designed to help them improve their craft. Part of the expense is to pay the teachers for the three extra days they need to work.", "The article noted that Sturtevant was \"the lone vote of dissent on the budget\" and explained his rationale. It reported that Sturtevant favored giving teachers an outright 2 percent raise and opposed adding the professional development days to their year, because he thought Richmond’s professional development programs were subpar and first needed to be improved.", "Sturtevant, it was reported, said the unconditional 2 percent raise would help Richmond compete for teachers with surrounding suburban school systems.", "There was no mention in the article about Sturtevant’s view on lowering K-3 class sizes or of any debate on the topic.", "A video of the three-hour School Board meeting on May 26 confirms The Times-Dispatch’s account. Sturtevant didn’t mention class sizes in his critique of the budget.", "Sturtevant told us he supports lower K-3 class sizes in Richmond, noting that his wife is a first-grade teacher - in Chesterfield - and they have a son in kindergarten at Mary Munford Elementary School in Richmond.", "It turns out that all 17 of the new K-3 teachers hired for permanent status this school year were long-term substitute instructors who worked in Richmond last school year, according to an email we received from Ralph Westbay, the city’s assistant superintendent for financial services. A long-term substitute is someone who fills in for a teacher who is absent for an extended time and assumes more duties and must have more instructional training than short-term substitutes.", "Westbay said the school system has not yet computed the effect the 17 teachers have had on K-3 class sizes but said he does not expect student-to-teacher ratios to be \"appreciably changed.\"", "Our ruling", "Gecker says that Sturtevant, his opponent in the 10th District Senate race, \"is against smaller class sizes.\"  He bases the claim - almost a charge of apostasy against a School Board member -  on Sturtevant’s vote against the $271.5 million Richmond school budget for 2015-16. It contained $1.3 million to hire 17 new K-3 teachers.", "But a Times-Dispatch article Gecker cites to prove his claim provides no evidence Sturtevant opposes smaller classes, nor does a video of the meeting at which Sturtevant cast his vote.", "What they show is that Sturtevant opposed the budget because it did not contain a 2 percent raise for teachers. Sturtevant did not mention class sizes in laying out his objection to the spending plan. He tells us he supports smaller class sizes.", "The Richmond school budget is a 262-page document. Sturtevant’s vote against the budget does not entitle Gecker to determine which of its countless line items Sturtevant opposed. There’s a burden on Gecker to prove that Sturtevant \"is against smaller class sizes,\" and he comes up empty.", "We rate Gecker’s statement False.", "Dan Gecker for Senate, Campaign mailer, Sept. 25, 2015.", "Email from Mollie Binotto, spokeswoman for Gecker for Senate, Sept. 30, 2015.", "Interview with Glen Sturtevant, Richmond School Board and state Senate candidate, Oct. 1, 2015.", "Emails from Matthew Brown, campaign manager for Sturtevant for Senate, Sept. 30, 2015.", "Richmond Times-Dispatch, \"Richmond School Board OKs $271.5M budget plan,\" May 28, 2015.", "Richmond Public Schools, \"2015-16 Adopted School Board Budget,\" accessed Sept. 29, 2015.", "Richmond School Board, Video of special budget work session, May 26, 2015 (Sturtevant’s comments begin at 1:57:08 mark).", "Email from Ralph Westbay, assistant superintendent for financial services for Richmond Public Schools, Sept. 30, 2015.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]