["By Saranac Hale Spencer", "Posted on December 10, 2018", "Former President Barack Obama was sworn into office in 2013 with his hand on two Bibles. He did not use a Quran, as a meme circulating online falsely claims.", "Former President Barack Obama used two Bibles when he was sworn into office for his second term.", "One had belonged to Dr. Martin Luther King Jr. and the other had been used by Abraham Lincoln at his swearing-in ceremony in 1861. Obama also had used the Lincoln Bible for his first inauguration in 2009.", "But a meme is circulating online with a picture of Obama taking the oath of office in 2013 with this text: “For those who don’t believe Obama is a Muslim, the red book is the Quran.”", "That’s wrong. It’s not a Quran. The book bound with a red velvet cover is the Lincoln Bible. That’s the same one President Donald Trump used for his 2017 inauguration, along with a Bible that his mother had given him.", "Obama has been falsely identified as a Muslim for more than a decade. We wrote about a similar claim in 2008 when he was seeking his first term as president. At that time, a chain email going around claimed that Obama took his oath of office for the U.S. Senate using a Quran. That wasn’t true, either.", "There is no requirement that presidents use a Bible when they take the oath of office. The only thing that the Constitution requires is the oath itself. George Washington started the tradition of using a Bible to take the oath at his first inauguration in 1789, but not all presidents have used one. John Quincy Adams, for example, took the oath on a book of law in 1825.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on the social media network.", "Barack Obama Presidential Library. Presidential Inauguration. 21 Jan 2013.", "“Bible Used in Lincoln and Obama Inaugurations on Display Jan. 23 to Feb. 18.” Press release. Library of Congress. 17 Jan 2013.", "Joint Congressional Committee on Inaugural Ceremonies. The 58th Presidential Inauguration — Donald J. Trump. 20 Jan 2017.", "Henig, Jess. “Sliming Obama.” FactCheck.org. 11 Jan 2008.", "Joint Congressional Committee on Inaugural Ceremonies. The President’s Swearing-In Ceremony. Accessed 7 Dec 2018.", "Library of Congress. Exhibition: “I Do Solemnly Swear…” Inaugural Materials from the Collections of the Library of Congress. Accessed 6 Dec 2018.", "Joint Congressional Committee on Inaugural Ceremonies. Bibles Used in Inaugural Ceremonies. Accessed 7 Dec 2018.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]