["About this rating", "On July 4, 2020, Florida congressional candidate KW Miller took to Twitter with a mind-blowing (if true) revelation: Famous music artist Beyoncé is \"not even African American.\" Rather, Miller wrote, she was an Italian woman named Ann Marie Lastrassi:", "This wasn't the first ridiculous rumor Miller promoted. A self-described conservative, Miller appears to use Twitter trolling and promoting conspiracy theories as a tactic to attract attention to his congressional campaign.", "Before we look at the origins of this bizarre theory, let's take a glance at Beyoncé's family tree.", "Beyoncé was born to Black parents, Tina and Mathew Knowles, in September 1981. Beyond that, her ancestry can be traced back to her great-great-great-grandmother, Rosalie Jean Louis, a slave who was born in Louisiana in 1800, and Joseph Lacey, a wealthy white merchant and Louis' reported slave owner.", "In 2018, Beyoncé revealed to Vogue that she was the descendant of a slave and a slave owner (emphasis ours):", "I come from a lineage of broken male-female relationships, abuse of power, and mistrust. Only when I saw that clearly was I able to resolve those conflicts in my own relationship. Connecting to the past and knowing our history makes us both bruised and beautiful.", "I researched my ancestry recently and learned that I come from a slave owner who fell in love with and married a slave. I had to process that revelation over time. I questioned what it meant and tried to put it into perspective. I now believe it’s why God blessed me with my twins. Male and female energy was able to coexist and grow in my blood for the first time. I pray that I am able to break the generational curses in my family and that my children will have less complicated lives.", "Beyoncé's true ancestry aside, Miller's claim doesn't make sense from a logical standpoint.", "Beyoncé has been in the public eye for more than two decades. So what's more believable? That philanthropist George Soros found an Italian singer, changed her name, brought her to America, found two Black people to pretend to be her parents, found her a spot in the musical group Destiny's Child, waited for her to become a successful solo artist, and then, after more than 20 years of deceitful patience, got her to insert subliminal messaging into her songs about a New World Order? Or, that Beyoncé is a successful Black woman with a voice all her own?", "Regardless, the idea that Beyoncé is actually an Italian woman named Ann Marie Lastrassi is not supported by any evidence.", "In fact, this rumor was popularized by a tongue-in-cheek Twitter thread mocking a single comment in an Instagram post. In June 2020, the Instagram account Lawlessbey posted two photographs of Beyoncé along with a compliment about how the singer still looked youthful. An Instagram user then commented on this post that Beyoncé was actually an Italian woman:", "This single comment (since deleted) appears to be the basis of this rumor. This comment was not accompanied by any evidence to support this claim, and this news has not been reported or corroborated by any credible source. In fact, we weren't able to find any sources (credible or otherwise) making this claim prior to JJwwebb's post.", "On June 22, the @Barcarvs Twitter account popularized this theory in a joke thread mocking the conspiracy theory:", "It should be noted that the hashtags at the bottom of Miller's tweet relate to the \"QAnon\" or \"Q\" movement, built on an unwieldy, nonsensical, ever-evolving collection of unfounded rumors that, more or less, claim that a \"deep state\" cabal of Satan-worshiping, cannibalistic pedophiles is working to undermine U.S. President Donald Trump. This movement came to prominence in part thanks to the debunked \"Pizzagate\" conspiracy theory and has spawned dozens of offshoot theories. For instance, some proponents of Q believe COVID-19 coronavirus disease is spreading via 5G towers (false). Although these conspiracy theories are outlandish at best, QAnon references have started to pop up in the feeds of some opportunistic politicians.", "One of the apparent problems with QAnon is that it revolves around rumors of uncertain origin that often touch on barely believable topics. This makes it difficult (as seen above) to tell the difference between jokes that mock Q-like conspiracy theories and posts that actually attempt to further these ideas in earnest.", "Vogue.   \"Beyoncé in Her Own Words: Her Life, Her Body, Her Heritage.\"\r\n    6 August 2018.", "Bennet, Jessica.   \"EXCLUSIVE: Mathew Knowles Says Internalized Colorism Led Him to Tina Knowles Lawson.\"\r\n    Ebony.   2 February 2018.", "Placido, Dani Di.   \"The Bizarre Beyoncé Conspiracy Theory Explained.\"\r\n    Forbes.   6 July 2020.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]