["About this rating", "Vermont state Sen. John Rodgers sponsored a bill that would make it illegal to own a cellphone if you're under age 21.", "However, the bill is almost certain not to pass, with even Rodgers stating he \"probably\" wouldn't vote for it, explaining he was trying to make a point about gun ownership.", "A Vermont state Senate bill would ban anyone under age 21 from owning cellphones, but it's not expected to pass, not even by the bill's author. Instead, the proposed law was intended to make a point about guns.", "The bill, S.212, would render possession of a cellphone by a person under the age of 21 a misdemeanor that could lead to a $1,000 fine and up to one year imprisonment. The bill was introduced on Jan. 7, 2020, by state Sen. John Rodgers, a Democrat who is also a Second Amendment advocate. The bill's language reads:", "Cell phones have often been used by mass shooters of younger ages for research on previous shootings. In light of the dangerous and life-threatening consequences of cell phone use by young people, it is clear that persons under 21 years of age are not developmentally mature enough to safely possess them, just as the General Assembly has concluded that persons under 21 years of age are not mature enough to possess firearms, smoke cigarettes, or consume alcohol.", "Rodgers told the local newspaper, the Times Argus, that he doesn't believe the bill will pass, and that he \"would probably vote no on it myself.\" Instead, he said, the bill is meant to make a point about legislation limiting access to guns. In June 2019, the Vermont Legislature passed a bill that would have mandated a 24-hour waiting period to buy a gun, but Gov. Phil Scott vetoed it. Democrats in the Legislature stated they would push for gun regulations in the coming year.", "The Times Argus quoted Michelle Fay, executive director of the children's advocacy group Voices for Vermont’s Children, who criticized the dead-in-water bill, saying \"There are so many critical issues impacting the lives of working families in Vermont today, from increasing minimum wage to implementing equitable family and medical leave insurance programs to establishing an office of child advocate. We urge the Legislature to focus on the important work at hand instead of getting tied up in hollow diversions.\"", "Because S.212 has not become law, was put forward with the stated intent of raising a point about gun legislation and not actual cellphone use, and because it is almost certainly destined not to pass, we are rating this claim \"Mixture.\"", "Blaisdell, Eric. \"Bill Would Ban Cellphone Use for Those Under 21.\"\r\n  The Barre Montpelier Times Argus. 5 January 2020.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]