["About this rating", "Two Boeing E-6B Mercury planes — sometimes referred to as \"doomsday planes\" — took flight around the same time that news broke that Trump tested positive for COVID-19.", "However, the E-6B Mercury airborne command post is routinely flown over the United States. A U.S. Strategic Command spokesman said that these flights were scheduled before Trump's diagnosis and that this was \"purely coincidental.\"", "Voting in the 2020 U.S. Election may be over, but the misinformation keeps on ticking. Never stop fact-checking. Follow our post-election coverage here.", "Late in the evening of Oct. 1, 2020, news broke that U.S. President Donald Trump had tested positive for COVID-19, a highly contagious disease responsible for the deaths of more than 200,000 Americans. Shortly afterward, social media users noted that two \"doomsday planes\" had been mobilized and speculated that the launch of these planes was a show of strength to deter an attack from adversaries in the aftermath of Trump's diagnosis.", "One person wrote on Facebook:", "Continuity protocols were activated not long before Trump came out as positive for covid-19. These planes are mobile command centers sent up on the west and east coasts. They can control the nuclear arsenal and activated as a message to any adversaries to not try any funny business in a time of potential weakness. Even if D.C. were gone, these planes can talk to our missile subs underwater etc.", "The Boeing E-6B Mercury is an airborne command post capable of launching nuclear weapons and is sometimes referred to as a \"doomsday plane.\"", "While it's true that two of these \"doomsday planes\" were launched around the time that news broke about Trump testing positive for COVID-19, there's no evidence that these two events are related. In fact, a U.S. Strategic Command spokesman told Fox News that this was \"purely coincidental\" and that these flights were planned before Trump's diagnosis:", "Two Boeing E-6B Mercury planes were detected flying along both coasts of the U.S. mainland early Friday, around the time President Trump announced he and first lady Melania Trump were diagnosed with coronavirus -- but the flights were “pre-planned” and the timing was “purely coincidental,” a U.S. Strategic Command spokesman told Fox News.", "A senior defense official also told Fox News there has been “no change to the posture of the U.S. military,” adding, “The president remains the commander-in-chief.”", "National security reporter Marc Ambinder noted that these planes routinely fly over the United States.  Chistiaan Triebert, a reporter for The New York Times, elaborated, saying the two \"doomsday planes\" that had been spotted after Trump's diagnosis had made multiple flights over the last few weeks:", "The Boeing E-6B Mercury plays a vital part in the United States' defense strategy. The Navy has 16 of these airborne command posts and at least one of these planes is flown on a nearly daily basis. In other words, the fact that two \"doomsday planes\" were spotted over the United States on the same day that Trump tested positive for COVID-19 appears to be little more than a coincidence.", "O'Reilly, Andrew.   \"Flight of Boeing E-6B Mercurys Amid Trump's Coronavirus Announcement 'Purely Coincidental': Strategic Command.\"\r\n    Fox News.   2 October 2020.", "Liptak, Kevin.   \"Trump's Positive Covid-19 Test Throws Country Into Fresh Upheaval.\"\r\n    CNN.   2 October 2020.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]