["A video of a huge crowd chanting slogans is viral on social media. It is being claimed that the video is from Gujarat’s Ahmedabad city where people are out on the streets with demands for ration and are chanting, “राशन दो या गोली दो (either give ration or give a bullet -translated)”. A post, by Facebook page ‘news24ncr‘, carrying the video, has garnered more than 1,500 shares so far.", "अहमदाबाद (गुजरात) में सड़को पर निकले लोग.? राशन दो या गोली दो.?", "Posted by news24ncr.com on Friday, 8 May 2020", "Delhi University professor and social activist Dr Suraj Yadav Mandal tweeted the video with the same claim.", "अहमदाबाद (गुजरात)में सड़को पर निकले लोग… *राशन दो या गोली दो… ये कैसा गुजरात मॉडल है भाई?#अडाणी_अम्बानी_मोदी_संघ_सरकार #ModiGovtFailsIndia pic.twitter.com/ffyYEG1pgh", "— Dr Suraj Yadav Mandal डॉ सूरज मंडल ڈاکٹر سورج منڈل (@suraj_yadav2005) May 8, 2020", "Several other people on Facebook and Twitter posted the video with the message, “अहमदाबाद (गुजरात) में सड़को पर निकले लोग.? राशन दो या गोली दो.?”.", "At the beginning of the video, we can spot a policeman wearing a jacket with “Hyderabad City Police” written on it.", "With a relevant keyword search based on this clue, Alt News found the same video tweeted by The Hindu on May 3. According to the tweet, migrant workers in Hyderbad marched towards Golconda, the western part of the city, urging the government to send them back to their respective states. The protest included migrants from Banjara Hills, Golconda, Asif Nagar, Humayun Nagar.", "#COVID19 #TELANGANA Migrant workers living in Banjara Hills Golconda Asifnagar Humayunnagar march towards Tolichowki in Golconda in western part of Hyderabad urging government to send them back to their respective States @MARRIRAMU @TelanganaCMO @TelanganaDGP pic.twitter.com/ASHGbEukAk", "— The Hindu-Hyderabad (@THHyderabad) May 3, 2020", "According to a May 3 Time of India report, over 1,000 migrant labourers had gathered at Tolichowki area in Hyderabad following rumours that the government would operate special trains for them. After the police assured them that arrangments for food would be made, they left. “We collected their names and told them that as and when arrangments for trains and buses are made, we will inform them,” said DCP (West Zone) A R Srinivas.", "Hyderabad-based Urdu newspaper The Siasat Dialy also posted a video of the incident.", "In conclusion, a video of migrant labourers gathered at Tolichowki area of Hyderbad was shared as Ahmedabad, Gujarat. Migrant workers at the Tolichowki demanded the government to arrange for their travel to go to their native states. Moreover, there is no mention of the slogan – “either you give ration or give a bullet” – in the video as well as the media reports related to the incident. Thus, the claim about these slogans being raised by the crowd also seems to be false.", "Donate Now", "Kinjal Parmar holds a Bachelor of Science in Microbiology. However, her keen interest in journalism, drove her to pursue journalism from the Indian Institute of Mass Communication. At Alt News since 2019, she focuses on authentication of information which includes visual verification, media misreports, examining mis/disinformation across social media. She is the lead video producer at Alt News and manages social media accounts for the organization.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]