["About this rating", "On 13 December 2015, a Facebook user published a purported letter recounting the last words conveyed by a condemned man to his mother, variously shared under the title \"The Last Wish\" or \"letter from a death row inmate,\" that read as follows:", "<!-", "A death row inmate awaiting execution, asked as a last wish a pencil and paper. After writing for several minutes, the convict called the prison guard and asked that this letter be handed over to his biological mother.", "The letter said ...", "Mother, if there were more justice in this world, we would be both executed and not just me. You're as guilty as I am for the life I led.", "Remind yourself when I stole and bring home the bicycle of a boy like me? You helped me to hide the bicycle for my father did not see it.", "Do you remember the time I stole money from the neighbor's wallet? You went with me to the mall to spend it.", "Do you remember when I argued with my father and he's gone? He just wanted to correct me because I stole the final result of the competition and for that I had been expelled.", "Mom, I was just a child, shortly after I became a troubled teenager and now I'm a pretty malformed man.", "Mom, I was just a child in need of correction, and not an approval. But I forgive you!", "I just want this letter to reach the greatest number of parents in the world, so they can know what makes all people, good or bad ... is education. Thank you mother for giving me life and also helping me to lose it.", "Your child offender.", "The letter was widely shared online as indictment of poor parenting, particularly a mother's failure to enforce discipline and instill honesty in her child.", "The purported missive from death row included no information about the identity of its writer, his location, when he wrote it, or the crimes he was charged with.  Moreover, it was accompanied by a completely unrelated photograph of \"hot convict\" Jeremy Meeks, who became internationally notorious when his exceptionally flattering mugshot went viral in 2013.  Meeks was sentenced on weapons charges, but he was not involved with a capital case (and therefore was neither sentenced to death nor executed).", "We found no evidence that the letter was truly written by a death row inmate, and its style and nature are atypical of other final letters left behind by condemned criminals.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]