["In just two days, thousands of online users shared reports that Nenshi, the mayor of Calgary, the largest city of the Canadian province of Alberta, told a local radio show that “Syrian refugees are more intelligent and educated than the rural Albertans.”", "Various versions of the claim were shared by several Facebook users, using the same wording and identical punctuation.", "However, the quotes attributed to Nenshi are wrong and out of context.", "“The mayor was not on 770 News yesterday,” Adam Johnson-Noble, communications strategist for Nenshi, told AFP on December 19.", "770 News, the local radio station also known as CHQR, confirmed to AFP that they had not aired any interviews with the Muslim mayor this week.", "John Vos, director of talk and talent at CHQR, told AFP that the quote is a distorted version of an interview the mayor gave to now-retired CHQR journalist Angela Kokott on December 17, 2015, the year Canada pledged to welcome 25,000 Syrian refugees.", "At the time, Nenshi would go on air once a month and take calls from listeners. It was during one of those segments that a citizen asked why Canada could help Syrian refugees settle yet failed to assist homeless Canadians. (15:25 on the recording below)", "“As a Canadian country, we’ve taken in 10,000 refugees, we have plans for 25, maybe even 50 if Mr. McCallum sees fit. It’s a wonderful thing and everything’s come together both publicly and privately. What are we doing wrong with the homeless if this can happen in three or four months and we’ve been trying for 20 years to help the homeless?” the caller named Don asked.", "Nenshi answered that refugees tended to be urban and educated, and that providing them with accommodation was often enough to help them start a new life, whereas the various issues affecting homeless people, including substance addiction or mental health problems, made helping them more complicated.", "To illustrate this argument, Nenshi said on air, “Syria for example is a middle income country, not a poor country, wasn’t a poor country, and the folks who are coming in are not. They don’t tend to be rural people or less educated people. I don’t mean rural people are less educated, but they tend to be engineers and IT workers and nurses who came home one day to find their houses bombed out.”", "It is likely that this four year old quote is the basis for the current misleading posts. “It seems that someone has really misunderstood what was said,” Johnson-Noble told AFP in reference to the 2015 interview.", "CHQR host Rob Breakenridge aired the full interaction on December 20, 2019 to contextualize the misleading claim for listeners. That segment can be found in CHQR’s audio vault by selecting December 20, 12PM, and skipping to 35:34.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]