["About this rating", "On 14 August 2016, BuzzFeed published a long-form article about Arkansas resident Juanita Broaddrick, who briefly came under scrutiny in the 1990s over a leaked assertion that in 1978 Bill Clinton (who was then serving as the state's attorney general) had raped her.  Broaddrick didn’t speak up until many years later, and Clinton denied sexually assaulting her, so no criminal charges were ever brought. Broaddrick was mostly a footnote to Clinton's Monica Lewinsky scandal and was content to recede from  public attention.", "Juanita Broaddrick has been placed in the public eye once again, however, in part because on 14 September 2015 Hillary Clinton posted a tweet stating that every survivor of sexual assault had the \"right to be heard\" and \"the right to be believed\":", "\"To every survivor of sexual assault...You have the right to be heard. You have the right to be believed. We're with you.\" —Hillary", "— Hillary Clinton (@HillaryClinton) September 14, 2015", "The tweet eventually came to Broaddrick's attention, and on 6 January 2016 she sent what would become a widely circulated response to Clinton's statement:", "I was 35 years old when Bill Clinton, Ark. Attorney General raped me and Hillary tried to silence me. I am now 73....it never goes away. — Juanita Broaddrick (@atensnut) January 6, 2016", "In a tense election cycle, the tweet slowly gained traction. On 9 August 2016, Broaddrick participated in a Reddit AMA {Ask Me Anything] session about the controversy, and shortly afterwards BuzzFeed's profile of her explained that Broaddrick's plight had attracted some unlikely supporters:", "In theory, partisan politics shouldn’t play a role in determining whether an alleged rape victim deserves to be heard. But lately, right-wing news outlets and conservative politicians with awful track records on women’s issues have treated Broaddrick’s story with the sensitivity of a Feministing blogger.", "Ann Coulter, who once said rape isn’t actually rape unless the victim has been “hit on the head with a brick,” tweeted in May: “BREAKING NEWS: BILL COSBY ORDERED TO STAND TRIAL FOR RAPE. Courage, Juanita, justice is coming.” Breitbart, which often criticizes other outlets for credulously reporting on public rape accusations, has written more than 30 favorable stories about Broaddrick this year alone. The National Review, which has run pieces about how rape accusations ruin lives and why believing the pop star Kesha’s rape claims is akin to “Stalinist finger-pointing,” published a piece calling Broaddrick’s allegations “credible” and “serious” despite a lack of formal charges or physical evidence.", "“The unwillingness of rape victims to admit their assault is a well-known phenomenon,” the author wrote.", "Their argument is that Broaddrick’s story is so solid that, as conservative New York Times columnist Ross Douthat wrote, one “need not be a ‘believe all rape allegations’ absolutist to find her claim persuasive.”", "In 2016 the retired Arkansas woman's name remained unknown to many voters too young to recall the tumultuous politics of the 1990s, and BuzzFeed provided what might have been the first comprehensive accounting of Broaddrick's experiences.  They also prompted renewed interest into Hillary Clinton's original 2015 statement about rape, and the subsequent discovery of an apparent change that was quietly made to a page about campus sexual assault hosted on the candidate's web site.", "Cached versions of Hillary Clinton's campaign site from 29 January 2016 display the following quote:", "But by 4 February 2016 that page had been revised, and in the process the quote attributed to Clinton was altered, retaining \"you have the right to be heard\" portion but eliding \"you have the right to be believed, and we’re with you\" tag:", "We accessed the same page on 16 August 2016 and found that the page has been updated some, but the \"you have the right to be believed\" portion of her original statement remains missing — at least in written form:", "However, the expression of that concept hasn't been completely scrubbed from Clinton's web site, as an embedded, 17-second-long video clip (originally uploaded to YouTube on 15 September 2015) has since been added to the page, in which Clinton states that survivors of sexual assault have a right to be both \"heard\" and \"believed\" (and both those words are replicated in text on the screen alongside her):", "Baker, Katie J.M.   \"Juanita Broaddrick Wants to Be Believed.\"\r\n    BuzzFeed.   14 August 2016.", "CNN.   \"A Chronology: Key Moments in the Clinton-Lewinsky Saga.\"\r\n    8 September 1998.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]