["A video was viral on Twitter in June this year claiming that it shows a lynching that took place in India. In the video, a young man is being brutally murdered by three people. The video was shared via a tweet made by Payal Rohatgi Fanclub but was later deleted. The clip was shared with the message – “modi tere raj me to konon ka koi kam nh hai” (Modi in your rule there is no need of law and order). In the same thread, the video was quote-tweeted by the handle John lewis the best, a screenshot of which is given below. An archived version of the tweet can be found here.", "Other individual users also tweeted the same video with a similar claim. Alt News is refraining from attaching the clip in this article because of disturbing imagery.", "Alt News used InVid to break down the video into multiple frames and performed a reverse image search of one of the frames on Yandex. We found various articles which claimed that the incident shown in the video is that of a murder that happened at Praia do Futuro in Fortaleza, Ceara in Brazil on December 30, 2018.", "Most of the articles were published on local online news portals such as Jornal de Brasilia, R7, Esqueria Diario, and Monolitos Posts.", "The article published in Monolitos Posts gives a detailed account of the incident. According to the outlet, the victim’s name was Wesley Tiago de Sausa Carvalho and that the suspects involved were all identified by the Civil Police of the State of Ceara, two of whom have been arrested. The police report mentions that the teen was killed by axes, hoes (gardening equipment) and stones. Furthermore, according to the investigation, Wesley Tiago was killed due to a dispute between members of two rival gangs. The names of the two arrested have also been made public – José Carlos Evangelista dos Anjos and Luciano Alves de Souza – while the other two suspects Abraão Jhonny Alves de Freitas and a woman identified only as Carine were absconding.", "A video from Brazil was thus viral as lynching in India. Recently, another video from Brazil was shared as a Hindu woman raped and killed in Rajasthan. A clip from Bangladesh was also circulated with a false context, according to which a Hindu man was lynched by members of the Muslim community.", "Donate Now", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]