["Recent news reports have discussed the possibility of violence and unrest following the results of the upcoming presidential election, but there’s no evidence that a flyer circulating on social media is associated with antifa activists.", "\"Election Day nears Comrades!!!\" reads the description a a flyer posted on the Facebook. \"Prepare to defend your rights!!\"", "The flyer itself says: \"Antifa comrades! On Nov. 4, don’t forget to disguise yourselves as patriots/Trump supporters: wear MAGA hats, USA flags, 3%er insignias, a convincing police uniform is even better! This way police and patriots responding to us won’t know who their enemies are and onlookers and the media will think there are Trump supporters rioting so it’s hard to turn popular opinion against us!\"", "An image of this Facebook post is now being shared on the social media platform. But the flyer that appears in the post has been online since at least 2017, when online rumors claimed that antifa activists were planning a revolution that would begin on Nov. 4.", "This image was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Antifa stands for \"anti-fascist.\" It’s a broad, loose coalition of left-wing activists including communists, socialists and anarchists who protest white supremacy and other far-right causes. Sometimes antifa activists are violent, but experts say that most of the activity that happens under the antifa banner is nonviolent.", "The image that’s being shared online appears to be a picture of a Facebook post sharing the flyer in a Facebook group called \"Hickman County Antifa.\" The user who originally posted it there, Katy Krasnow, has told fact-checkers that she shared it as a joke.", "\"Hickman County Antifa was a satire page,\" she told Snopes. \"I deleted soon after it got shared because it made a lot of people freak out more than I expected. Nobody in the group was really actually connected. We were just sharing dumb antifa memes.\"", "On Sept. 4, Law Enforcement Today, which \"unapologetically supports those who hold the Thin Blue Line,\" published a story about the flyer being shared on Facebook.", "\"While I personally loathe the likes of Antifa and their tactics,\" the author wrote, \"I can assure you that this is simply a hoax.\"", "In 2017, Will Sommer, a politics reporter for the Daily Beast who covers conservative media, described the flyer in a Medium post as one of several \"fabricated ‘planning documents’ that urge antifa guerillas to commit violence while posing as police or Trump supporters.\"", "In June, a Twitter account — @ANTIFA_US — appeared to call for violence, rallying \"comrades\" to move into residential areas and \"take what’s ours.\" But the account wasn’t actually affiliated with antifa activists; rather, it was created by a known white supremacist group, according to Twitter.", "We rate this Facebook post False.", "Facebook post, Sept. 2, 2020", "The Daily Beast, The left secretly preps for MAGA violence after Election Day, Sept. 8, 2020", "Politico, 8 big reasons Election Day 2020 could be a disaster, July 24, 2020", "CNN, White supremacists pose as Antifa online, June 2, 2020", "FactCheck.org, Viral tweet ‘alert’ wasn’t from Antifa, June 2, 2020", "PolitiFact, Ask PolitiFact: What is antifa, and why is it over my timeline? July 2, 2020", "Sizzle post, Oct. 28, 2017", "Time, No, ‘Antifa’ protesters aren’t planning on toppling the government tomorrow, Nov. 3, 2017", "Law Enforcement Today, Is there an Antifa riot planned for the day after the election? Here are the rumors — and what we found, Sept. 4, 2020", "Snopes, Did an Antifa flyer tell ‘comrades’ to pose as Trump supporters and riot after Election Day? Sept. 4, 2020", "Medium, How the \"November 4\" conspiracy theory took over pro-Trump internet, Oct. 31, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]