["A video of a man, who is seated along with three other individuals, being interrogated by a group of men (behind the camera) is being shared on social media with the claim that people have caught a child-kidnapper who sells children for one lakh rupees in Delhi. “एक लाख रुपये का बिकता है एक बच्चा दिल्ली में बिकता है सुन लो जी आपने कानों से “, reads the message shared with the video, which has amassed over 7.5 lakh views. Facebook user Mahi Paul Sharma shared the video with the above text. The post has garnered more than 25,000 shares. In the video, a sobbing man speaking in Punjabi talks about kidnapping children for money and selling them in Delhi.", "एक लाख रुपये का बिकता है एक बच्चा दिल्ली में बिकता है सुन लो जी आपने कानों से viral video", "Posted by Mahi Paul Sharma on Thursday, 8 August 2019", "At the time of writing this article, the below post by Facebook page Support Digital India has garnered close to 2500 shares.", "बच्चा चोर पकड़ा गया एक लाख रुपये का बिकता है एक बच्चा दिल्ली में बिकता है सुन लो जी आपने कानों से## ऐसे डॉक्टरों को भी मृत्युदंड हो जो ऐसा काम करवाते हैं", "Posted by Support Digital India on Sunday, 11 August 2019", "Several other individuals on Facebook and Twitter have shared the video and an image of the same incident with a similar narrative.", "This video was also published with a similar narrative by several YouTube channels like News Dnn and BSR 013.", "After listening to the conversation, Alt News ran a Google search with keywords, “विक्की बच्चा चोर पंजाब”, we found a report published by Amar Ujala on August 1, 2019. The victim Vicky, who was forced to say on camera that he is a child-kidnapper, had reached out to the police after the video went viral on social media and got coverage on TV news channels. According to a statement given to the Sadar Fazilka police, Vicky, a resident of Fazilka’s Jhok Dipu Lana and her fiance were travelling to his village when at around 8 PM, the duo was stopped at Sant Khivapur village by a group and beaten up. Based on Vicky’s complaint, the police have registered a case against at least six accused.", "At 5:07 mins in the video posted below, Vicky said that he was stopped by some men while he was on the way to drop his fiancee. He was asked to call his friends at the spot and then, they were all thrashed. Vicky explains that at gunpoint, he was forced by them to say that he is child-kidnapper and a drug dealer on camera. He emphasised that these men promised to let them go if they agreed to say what they wanted them to on camera.", "Moreover, at 6:31 mins in the video above, Fazilka DSP Jagdish Kumar said that no such incident of child-lifting took place in Fazilka district.", "Alt News reached out to Sadar Fazilka police station. Inspector Jaswant Singh said, “It’s completely false, they are not child-kidnappers. We have registered a case against all the accused who made this video.” When inquired whether any arrest has been made so far, he said, “they are absconding right now. No arrest has been made so far. One Charanjit Singh was arrested but he escaped from the make-shift police station.”", "IIn conclusion, a young man was forced at gunpoint to say on camera that he is a child-kidnapper and later the video was shared on social media to stoke child kidnapping rumours.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]