["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "During the Republican debate on Fox News, Sen. Ted Cruz portrayed President Barack Obama as weak on military spending amid the battle against ISIS and terrorism.", "\"Barack Obama right now, No. 1, over seven years, has dramatically degraded our military. You know, just two weeks ago was the 25th anniversary of the first Persian Gulf war,\" the Texas senator said. \"When that war began, we had 8,000 planes. Today, we have about 4,000. When that war began, we had 529 ships. Today, we have 272.\"", "Has Obama slashed the military during his tenure? We found that Congress shoulders a good deal of the responsibility, and Obama has actually asked for larger increases than Congress approved.", "A Cruz spokesman declined to respond on debate night.", "Military spending under Obama", "It is a common talking point among Republican candidates to portray the United States’ military spending as weak during Obama’s administration.", "They argue that the cuts, known as sequestration, make it harder for the United States to battle terrorists. PolitiFact has previously fact-checked claims related to the military budget as well as whether our Navy and Army are shrinking. We will recap our earlier findings here.", "Spending on national security includes the Pentagon budget as well as other agencies, such as the Energy Department’s work on nuclear weapons. Spending increased in 2010 and 2011, but it has fallen every year for four years since then by a cumulative 15 percent.", "Other ways of looking at the question show declines as well. National security spending made up 20.1 percent of the federal budget in 2010, but in 2015 it was 15.9 percent. Over the same period, spending fell from 4.6 percent of gross domestic product to 3.3 percent.", "There are two main reasons for the spending drop. The first is the Obama administration’s decision to start removing U.S. troops from Iraq and Afghanistan. The second has to do with a process known as sequestration.", "Sequestration refers to automatic, across-the-board cuts to both military and nonmilitary spending that were originally designed to force bipartisan negotiators in Congress to strike a deal in 2011.", "Washington Post reporter Bob Woodward’s book The Price of Politics showed that defense sequestration was an idea that came out of Obama’s White House. But the intention was to force Republicans to negotiate, not to actually put the cuts into effect.", "But negotiations fell apart, so the cuts went into effect. The bipartisan nature of the sequestration provision means that both parties merit a share of the blame, experts say.", "The most recent Obama budget proposed a 7.8 percent increase in the base Defense Department budget between 2015 and 2016.", "The spending bill enacted this fall puts the defense budget on a path to start growing in fiscal year 2016, up about 6 percent from the previous year.", "\"For five years in a row, Congress enacted a defense budget that was less than President Obama requested,\" said Todd Harrison, director of defense budget analysis at the Center for Strategic and International Studies, told PolitiFact the night of the debate. \"So I don’t think it’s accurate to pin the blame on the president for reductions in defense spending.\"", "Army, Navy and military equipment", "Another way to look at Cruz’s statement is by the size of military services and the status of military equipment.", "Army: In 2012, the Army had about 570,000 soldiers. Reductions over several years have taken it down to its current size of about 490,000. In July, the Army said that it plans to cut the regular Army from 490,000 to 450,000 by fiscal year 2018, or a total of 40,000 positions. ‎As of early December, 1,299 soldier positions have been cut. The new cuts, which are scheduled to end by October 2018, will save about $7 billion. It’s unclear if all the planned cuts will occur and some experts argue we only need a larger Army if we are going to reoccupy Iraq or invade and occupy other countries.", "Navy: It’s a popular talking point about the United States having the \"smallest Navy\" in almost a century. In 1916, the U.S. Navy had 245 active ships. The number peaked at a massive 6,768 ships during World War II. Then the number drifted down during most of the 20th century, with slight upticks during the Korean War and the Vietnam War. As of Dec. 9, 2015, the number of active ships stood at 272, which is the lowest since 1916.", "However, today’s ships are far more powerful than those of 100 years ago. Today’s ships are outfitted with more advanced technology than they were during World War I. And today, the U.S. Navy has certain types of ships capable of launching nuclear ballistic missiles that didn’t exist in 1916.", "In March 2015, the Navy set a goal of goal for a fleet of 308 ships though the earliest that could be met is 2022 if sequestration ends.", "New military equipment: The United States is building various military equipment including ballistic submarines and F-35 Joint Strike Fighters, though there is debate among experts as to whether it is happening fast enough.", "Our ruling", "Cruz said, \"Barack Obama, right now, No. 1, over seven years has dramatically degraded our military.\"", "It’s inaccurate for Cruz to solely fault Obama for budget cuts as a result of sequestration. Both Democrats and Republicans share the blame for the budget negotiations that fell apart.", "Cruz’s statement contains an element of truth in that military spending has decreased, but ignores critical facts that would give a different impression.", "We rate this statement Mostly False.", "Washington Post, Annotated Transcript, Jan. 28, 2016", "PolitiFact, \"PolitiFact Sheet: Military spending under Obama and Congress,\" Dec. 14, 2015", "Defense News, \"USAF Wants to buy 100 long range strike-bombers,\" Dec. 2, 2015", "Defense News, \"Air Force ‘confident’ bomber contract award is airtight,\" Nov. 10, 2015", "PolitiFact, \"Barack Obama says Congress owns sequestration,\" Oct. 24, 2012", "PolitiFact, \"Marco Rubio says the United States is not modernizing its nuclear weapons,\" May 5, 2015", "PolitiFact, \"Marco Rubio says the United States isn't building aircraft, bombers, nuclear subs,\" May 5, 2015", "PolitiFact, \"Donald Trump says 'our nuclear arsenal doesn't work,'\" June 18, 2015", "PolitiFact, \"Jeb Bush says Democrats 'responsible' for 'swift, mindless' cuts to defense spending,\" June 22, 2015", "PolitiFact, \"Anatomy of a talking point: the smallest Navy since 1917,\" Aug. 3, 2015", "Interview, Todd Harrison, director of defense budget analysis and a senior fellow in the International Security Program at Center for Strategic and International Studies, Jan. 28, 2016", "Interview, Brian Phillips, Ted Cruz spokesman, Jan. 28, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]