["By Robert Farley", "Posted on July 12, 2016", "Trump is fond of the word “rigged.” The primary process, the economy, the justice system that did not charge Hillary Clinton with a crime: all rigged. Trump now says he’s a political trendsetter, claiming Bernie Sanders and then “everybody” followed his lead and started using the word “rigged” too. That’s false.", "Our review of public statements suggests Trump borrowed the word from Sanders, who regularly has used the term “rigged” to describe the government systems that institutionalize income inequality. That has been a Sanders theme since day one of his campaign — long before Trump made the word a regular staple of his stump speeches.", "In fact, populist politicians have been using the term “rigged” for decades to describe various government or political systems – despite Trump’s claim that a couple “political pros” told him that he was a trailblazer in using the word “rigged.”", "Before we dig into the political uses of “rigged,” though, let’s set the scene with Trump’s odd boast, made during a rally in Raleigh, North Carolina, on July 5 after the FBI director announced that he would not recommend criminal charges against Clinton for her use of a private email server when she served as secretary of state.", "“Today is the best evidence ever that we’ve seen that our system is absolutely, totally rigged,” Trump said. “It’s rigged.”", "Trump then went on to say that he was the first to use the term “rigged” in the Republican primaries, in reference to his displeasure with not being awarded delegates proportional to his vote tally in some states. Then “all of a sudden,” he said “rigged” became “a hot term.” People like Sanders started using it, Trump said, and “now everyone talks about ‘rigged.'”", "Trump in North Carolina, July 5: And I used that term initially when I was running in the Republican primaries and I was the first to use it. Then all of a sudden it became a hot term. Everybody was using the word, “rigged, rigged, rigged.” But if you remember, I’d win Louisiana and I’d find out I’d be getting enough delegates, what happens? And places like Colorado which were so good to me, but all of a sudden we find out that they don’t have the vote. And other things. OK. I used the word great. And frankly I’ll be honest. If I didn’t win in landslides I wouldn’t be standing up here. You’d be watching some politician who would lose to Hillary Clinton. OK? Believe me. Believe me.", "I started winning — I learned about rigged very fast. I learned. But I used the term “rigged.” Then all of a sudden Bernie started using it and other people and now everyone talks about “rigged” but I’m gonna keep using it because I was the one that brought it up and I’m the one, and I asked a couple of political pros, “Did you ever hear the word rigged, it’s a rigged everything?” And they really — it hasn’t been a thing used, I guess it has to be somewhere along the line, but it hasn’t.", "Trump mentioned it again the next day during a speech in Cincinnati.", "Trump in Cincinnati, July 6: The FBI director said Hillary failed to turn over several thousand work-related emails, including emails that were classified. Right? Rigged system folks. Remember I used to say it. I’m the one that brought that word up. Now everybody’s using it. Bernie Sanders is rightfully using it. Because honestly what they did with him was not good.", "We realize there are bigger issues being discussed on the campaign trail. But when Trump claimed that “I’m the one that brought that word up” and that “now everybody’s using it,” we wondered if that could possibly be true.", "Less than two months after announcing his presidential candidacy in June 2015, Trump got some written advice from his longtime adviser Roger Stone. As the Washington Post reported on Aug. 9, 2015, “In a 13-page memo to Trump, Stone urged him to state that ‘the system is rigged against the citizens’ and that he is the lone candidate ‘who cannot be bought.'”", "But we couldn’t find any evidence that Trump actually took that advice — at least not by literally using the word “rigged” — until the following April, when Trump began to criticize the Republican primary system — as well as the Democratic primary system, on behalf of Sanders. Trump was concerned that delegate counts were not matching popular vote counts in some states.", "At a rally in Albany, New York, on April 11, for example, Trump railed against the Republican primary process, calling it a “rigged, disgusting dirty system.” Later that month, at a rally in Indiana, Trump called the Republican primary process “a rigged, crooked system that’s designed so that the bosses can pick whoever they want.”", "In June, Trump described the political system more broadly as “totally rigged in order to keep [incumbent politicians] in power.”", "Trump, June 7: After years of disappointment, there is one thing we all have learned — we can’t fix the rigged system by relying on very, and I mean this so, so strongly, on the very people who rigged it, and they rigged it, and do not ever think anything differently. We can’t solve our problems by counting on the politicians who created our problems.", "In a June 22 speech in New York City, Trump used the word seven times in just over a minute to describe not just the political system, but the whole economy.", "Trump, June 22: We’ll will never be able to fix a rigged system by counting on the same people who have rigged it in the first place. The insiders wrote the rules of the game to keep themselves in power and in the money. That’s why we’re asking Bernie Sanders’ voters to join our movement: so together we can fix the system for all Americans. So important. This includes fixing all of our many disastrous trade deals. … Because it’s not just the political system that’s rigged, it’s the whole economy. It’s rigged by big donors who want to keep wages down. It’s rigged by big businesses who want to leave our country, fire our workers, and sell their products back into the United States with absolutely no consequences for them. It’s rigged by bureaucrats who are trapping kids in failing schools. It’s rigged against you, the American people.", "More recently, as we noted earlier, Trump has used the word “rigged” to describe the justice system that decided not to prosecute Clinton for her use of a private email system when she served as secretary of state.", "So there’s no question Trump has embraced “rigged everything” in his speeches and interviews. But is he responsible for introducing the term into the current political discourse? Hardly.", "We did word searches on speeches by Trump catalogued by Project Vote Smart and did a Lexis Nexis search of all newspaper articles using the words “Trump” and “rigged.” We didn’t find any evidence of Trump using the word “rigged” from the beginning of his campaign in June 2015 until April 2016, when it became a regular feature in his speeches.", "Sanders, on the other hand, regularly used the term “rigged” to describe the U.S. economy even before Trump entered the race and before Stone advised Trump to use the word “rigged” to describe “the system.” In his announcement speech on May 26, 2015, Sanders talked about income inequality and said, “This type of rigged economy is not what America is supposed to be about.”", "Project Vote Smart documents at least 40 instances of Sanders using the term “rigged” in speeches and interviews between the first day of his candidacy and Trump’s initial use of the term in April 2016. From the start, Sanders’ campaign website included a page on “Income and Wealth Inequality” and concludes, “This is what a rigged economic system looks like.” It was one of the central themes of Sanders’ campaign.", "Although Trump claimed to have introduced “rigged” to the Republican primary, he didn’t. During a Republican primary debate in January, Carly Fiorina criticized the “establishment,” the media and pundits, saying, “The game is rigged.” That same month, John Kasich similarly claimed the “system is rigged.”", "But let’s go back a little further, before the 2016 campaign. In a major speech at the Democratic convention in 2012, Sen. Elizabeth Warren famously said, “People feel like the system is rigged against them. And here’s the painful part: They’re right. The system is rigged.”", "Warren’s public statements archived by Project Vote Smart since January 2012 show the Massachusetts senator has used the term frequently over the last five years.", "But we can go back even further than that. Trump may take credit for introducing the term “rigged” to describe the primary process, but that’s exactly the word Jerry Brown used in 1992 to describe that very system.", "Jerry Brown, May 21, 1992: The way the Democratic Party has rigged its rules, it uses something it calls Super Tuesday to try to promote a Southern conservative candidate as a way to win votes. But what that does is leave California and Oregon and a lot of other states out of the process.", "Other random examples of elected officials using the term rigged on the House or Senate floor over the years can be found here and here and here and here and here and here. We could go on. But the point is that politicians have long been using the term rigged to describe government and political systems for years and years.", "Trump may have a newfound affection for the word. But he didn’t introduce it into the political discourse. It was already there.", "— Robert Farley, with Zachary Gross and Sydney Schaedel", "https://www.sharethefacts.co/share/d5509036-a4fd-497e-91a3-034f4b805c76", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]