["About this rating", "A Florida manatee spotted ensnared in a bicycle tire in October 2019 was seen again more than a year later, this time without the potentially deadly entrapment wrapped around its body.", "A Facebook post shared on Dec. 5, 2020, by the Florida Wildlife Commission (FWC) and Wildlife Research Institute described the return of the now-free manatee as it made its way back to Blue Spring State Park, a spring-fed sanctuary outside of Orlando known for its annual return of hundreds of manatees every winter.", "Aptly named “Schwinn” by researchers and “Wheelie” by concerned citizens, the manatee was reported in October 2019 in Fernandina Beach before it migrated some 150 miles to Blue Spring for the winter. During its stay, wildlife officials made several attempts to rescue the manatee but were unable to do so safely.", "“Due to the difficulties involved in making a safe rescue among hundreds of other manatees staying warm in the spring, Schwinn became wary and evaded rescue boats, research canoes, or approaching in-water biologists, making it impossible to safely rescue the tire-encircled manatee,” wrote the affiliated nonprofit organization, Save the Manatee, in a news release.", "But a cold front in late 2020 brought the manatees back to the sanctuary, where the previously entangled manatee was recognized on a live webcam maintained by the Save the Manatee Club. This time around, conservationists noted that the marine mammal returned a little lighter than last year.", "“Experts cannot determine exactly how the manatee escaped the encircling tire. Ironically, Schwinn the manatee was superficially struck by a boat’s propeller in February, which cut through a significant portion of the tire,” added the FWC. “The cut from the propeller likely weakened the tire, allowing the manatee to swim free sometime later.”", "Nicknamed “sea cows” for their similarities to livestock, manatees are fully aquatic marine mammals that survive nearly entirely on water grass. The Florida manatee, a subspecies of the West Indian manatee, is considered threatened under the Endangered Species Act and designated as below their optimum sustainable population level — or “depleted” — under the Marine Mammal Protection Act. These slow-moving mammals are largely threatened by human interference by way of boat collisions, entanglement in fishing gear and other trash, and a loss of habitat.", "“Schwinn” the manatee bears obvious scars from the bicycle tire entanglement. Each year, many manatees are killed or injured by debris discarded into the waterways. Save the Manatee", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]