["About this rating", "On March 20, 2021, we received messages from readers that asked about a purported giveaway on Facebook. The promotion offered $55 coupons and gift cards redeemable at Subway restaurants for the company's 55th anniversary.", "One page in question was created on March 18, 2021. The only post claimed \"Everyone Gets $55 Coupon + Surprises FREE!\":", "Subway is not giving out $55 gift cards for its 55th anniversary on Facebook.", "However, this was misleading and potentially harmful. This was not an official Facebook page. Subway was not offering $55 coupons and gift cards for its anniversary.", "The fake Facebook post appeared to lead to affiliate offers. It may also have led to identity theft or phishing attempts.", "The text of the post read as follows. We omitted the potentially harmful website that was displayed at the end of the post:", "Subway is going to celebrate its 55th anniversary on March 22, 2021, and In order to help our loyal customers Every single person who has shared&commented before 4PM Sunday will be sent one of these boxes containing a $55 subway gift-card plus surprises that will make your heart flutter! Make sure to validate your entry @ (website omitted) - Good luck!", "The fake page was named \"Subwáy,\" with an accent over one of the letters. This was not consistent with the official spelling of Subway restaurants.", "On the flip side, the real Facebook page for Subway has a white and blue verified badge. The fake page did not have a verified badge. This was one way to discern real versus fake information when it came to prominent companies like Subway.", "Unlike the fake page, the real Subway Facebook page has a white and blue verified badge.", "In past years, fake anniversary offers for coupons, gift cards, and vouchers were quite common on Facebook.", "Such pages often post fake prizes in order to lead Facebook users to various affiliate offers on other websites. Once a few users actually follow through with some of the affiliate offers, the people who created the fraudulent Facebook pages likely pocket a little bit of money.", "As for Facebook posts like the fake Subway offer, after it has been available for several hours or days, the page managers usually delete the post to scrub the page of any evidence of the scheme. Sometime later, they often make a new post to start the fake offer once again.", "For example, we previously reported about scams involving fake vacation offers for Las Vegas and Bora Bora. Weeks later, Facebook still hadn't taken action on the pages, likely because they had been scrubbed of the old offers to appear innocent.", "In sum, Subway was not offering $55 coupons and gift cards on Facebook on its 55th anniversary. The page where the fraudulent post was made was not an official Subway page.", "Jordan Liles is a Senior Reporter who has been with Snopes since 2016.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]