["About this rating", "The so-called \"War on Christmas\" supposedly involves commercial entities' deliberately eschewing the use of religious symbolism and terminology in their operations and products — even to the extent of forbidding their employees from wishing customers a \"Merry Christmas.\"", "The stereotype of the atheistic, liberal, anti-Christmas combatant was perfectly encapsulated in a Dec. 4, 2019, tweet from someone who asserted that he was the manager of a Starbucks outlet in Charlotte, North Carolina. He proclaimed that he had \"informed my employees that they will be fired on the spot if I hear them say 'Merry Christmas' to any customers\" — an action he purportedly took because he \"personally dislike(s) conservative Christians\":", "That outrage-inducing tweet gained added prominence when it was amplified a few weeks later by the Facebook campaign page for Republican U.S. Rep. Steve King of Iowa, where it was reposted with the added comment \"Wow\":\n\n\n\nBut King (or his campaign) was taken in by a troll. As Starbucks explained many times over, the person behind the Twitter account that posted the controversial tweet (@MuellerDad69) was not a Starbucks employee:", "And that account — which Business Insider (BI) noted \"previously claimed to discriminate against military service members and police officers who were customers at Starbucks\" — was indeed suspended for violating Twitter's rules:", "BI also observed that King, \"who was stripped of his committee seats by his own party in January [2019] after making a series of racist comments, often taunts his political opponents online and traffics in conspiracy theories.\"", "Taylor, Kate and Eliza Relman.   \"An Iowa Congressman Punished for Making Racist Comments Got Duped by a Twitter Troll Named 'MuellerDad69' Who Said He Manages a Starbucks and Discriminates Against Conservatives.\"\r\n    Business Insider.   17 December 2019.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]