["About this rating", "An Associated Press analysis published in late September 2018 warned that prescription drug prices in the United States were still rising precipitously despite President Trump's vow to reduce them. During the first seven months of the year, the report said, prescription drug prices saw 96 increases for every cut.", "The human cost of runaway prescription drugs prices was dramatically illustrated in a meme shared on the Occupy Democrats Facebook page on 18 September:", "This is Alex Smith. He died this year at age 26 because he couldn't afford insulin in America. He made $35,000 a year as a restaurant manager, and couldn't afford his $450 a month health insurance with a $7,600 out-of-pocket deductible. The insulin he needed for diabetes was $1,300 a month. When he turned 26 and was kicked off his mom's insurance, he started rationing his life-saving insulin. He died a month later.", "The text is mostly accurate, although it has Smith's given name wrong (it was Alec, not Alex), and he died in 2017, not \"this year\" as claimed in the 2018 meme.", "According to local news reports, Alec Raeshawn Smith's lifeless body was found in his apartment on 27 June 2017, 27 days after his coverage under his mother's health insurance policy had lapsed due to his age. The cause of death was diabetic ketoacidosis, a life-threatening complication of diabetes that occurs when the body produces excess blood acids (called ketones) because it lacks enough insulin.", "In a piece contributed to Truthout.org in February 2018, Smith's mother, Nicole Smith-Holt, wrote that even though Alec had a full-time job, it did not come with employer-provided health coverage:", "For Alec, this meant that his insulin and supplies cost almost $1,300 a month. He and I together researched for months in advance about his health insurance options. They weren’t good. The best plan we found would cost him $450 a month for the premium with a whopping $7,600 deductible. That deductible meant he would be paying out-of-pocket for his medicine for many months anyway, so he decided to go without the plan until he could find a different job with benefits.", "The prohibitive cost drove Smith to ration his insulin use to try to make his supply stretch to the next payday. \"I have since learned that this is not uncommon,\" Smith-Holt wrote, and is indicative of a worsening health care crisis:", "Globally, half of the people who need insulin can’t reliably get access to it. With 6 million people in the US insulin-dependent, and nearly 40 percent of Americans uninsured or facing high deductibles that leave their medicine costs uncovered, the crisis is occurring right here, too.", "Endocrinologists here in the US report that as many as one in five of their patients are not able to afford their insulin. For many persons with diabetes, that means they land in the emergency room with diabetic ketoacidosis. For others, like Alec, they never get there. Just 27 days after his coverage under my insurance ended, I received the call no parent ever wants to get.", "The American Diabetes Association released a report in March 2018 estimating that the total costs of diagnosed diabetes in the United States had risen 26 percent in the previous five years:", "People with diagnosed diabetes incur average medical expenditures of $16,752 per year, of which about $9,601 is attributed to diabetes. People with diagnosed diabetes, on average, have medical expenditures approximately 2.3 times higher than what expenditures would be in the absence of diabetes....", "People with diabetes who do not have health insurance have 60% fewer physician office visits and are prescribed 52% fewer medications than people with insurance coverage — but they also have 168% more emergency department visits than people who have insurance.", "In November 2017, we confirmed the similar case of Shane Patrick Boyle, an uninsured type 1 diabetic who died of ketoacidosis shortly after starting a GoFundMe campaign to try to raise enough money for a one-month supply of insulin.", "Haavik, Emily.   \"Mother Calls for Lower Insulin Prices in Wake of Son's Death.\"\r\n   WTSP-TV [Tampa/St. Petersburg].   13 May 2018.", "Karlin-Smith, Sarah.   \"Trump Says Drug Industry 'Getting Away with Murder.\"\r\n    Politico.   11 January 2017.", "Olson, Jeremy.   \"Son's Death Pushes Minnesota Mom Into Fight Against High, Rising Drug Prices.\"\r\n    [Minneapolis] Star Tribune.   11 May 2018.", "Smith-Holt, Nicole.   \"I Had to Bury My 26-Year-Old Son Because He Couldn't Afford Insulin.\"\r\n   Truthout.org.   1 February 2018.", "Symons, Xavier.   \"U.S. Insulin Price Hikes Prove Fatal for Diabetics.\"\r\n   BioEdge.   8 September 2018.", "American Diabetes Association.   \"The Cost of Diabetes.\"\r\n   30 April 2018.", "Mayo Clinic.   \"Diabetic Ketoacidosis.\"\r\n   Accessed 24 September 2018.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]