["A screengrab of plain text explaining that flu shots turn people into “an active live walking virus” was shared at least one thousand times in the past week. One Facebook user added the caption: “Your the carrier. Wake up!” as a warning.", "This myth is widespread enough that several health institutions explicitly debunk it on their websites, including the CPHA, the  Harvard Medical School, the CDC, and the University of California, Los Angeles health center.", "“I haven’t heard of this before, but it makes no scientific sense whatsoever,” according to Dr. Ian Gemmill, former chair of Immunize Canada, a coalition of non-government health organizations.", "All influenza vaccines approved in Canada this season are inactivated. “Yes the virus was live at one time but it is inactivated, which means it’s dead. It does not replicate, it has no ability to infect anybody,” Gemmill told AFP.", "Some vaccines, he added, have not only been inactivated but have also been split, and sometimes even purified down to the protein needed to create the vaccine.", "Once administered, the vaccine and the virus it contains stimulate immune cells that will be ready should the vaccine receiver come in contact with live flu virus.", "Gemmill compared a vaccinated body to an army that is prepared and knows what the enemy looks like, allowing it to fight the virus before it can take hold. An unvaccinated person’s immune system would not react so quickly and would have to fight the enemy faction, which is the illness.", "The list of flu shots authorized in Canada in 2019-2020 is publicly available on Health Canada’s website. Nine flu shots are authorized in Canada for the current influenza season.", "FluMist Quadrivalent is a flu vaccine that is only weakened (attenuated), rather than inactivated. Although it is licensed in Canada this year, it is not commercially available, Gemmill told AFP.", "Although theoretically possible, chances are slim that a live attenuated virus would be transmitted from the patient to another individual because the dose used in a single shot is so small and the virus so weak, Gemmill said. He added that he has never seen a report of contamination caused by vaccination.", "Vaccines in Canada must go through a rigorous multi-step evaluation before they can be commercialized or administered in the country, according to Health Canada.", "Flu viruses are constantly changing, so, flu shots change annually; the variations in their composition are determined by the World Health Organization’s (WHO) recommendations for that year, although the composition may be maintained over multiple years. Flu vaccine composition for the entire northern hemisphere is decided by the WHO every January, and manufacturers propose new vaccines in the following months.", "The flu vaccine is a regular source of misinformation. AFP Fact Check has also written about misleading posts about the ingredients in flu vaccines.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]