["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Responsibility for the 2008 housing crisis is at stake in a new attack launched by Donald Trump against Hillary Clinton.", "\"Hillary Clinton filibustered legislation to reform Fannie and Freddie Mae – institutions at the center of the Great Recession – which have been funneling hundreds of thousands to Hillary Clinton's campaign and Foundation,\" a statement from the Trump campaign said on June 21.", "Republican changes to Fannie Mae and Freddie Mac regulation never faced a cloture vote, the most clear-cut procedural sign that a filibuster has occurred. (The statement calls mistakenly calls them Fannie and Freddie Mae).", "Without a cloture vote, the question of whether the bill was filibustered becomes \"a gray area,\" according to one expert in congressional use of the filibuster. If a filibuster did occur, it's even harder to say that Clinton was responsible.", "Trump’s statement presumably refers to a Republican-backed attempt in 2005 to bolster regulation of Fannie Mae and Freddie Mac, two huge government-backed mortgage finance companies. The Trump campaign did not respond to requests for comment, but the statement itself cited a CNBC opinion piece.", "The Federal Housing Enterprise Regulatory Reform Act of 2005 passed out of the Senate Committee on Banking, Housing and Urban Affairs on a party line vote. It was never brought before the full Senate.", "After the mortgage collapse revealed the vulnerability of America’s housing market, some pointed to the bill as evidence of Republican foresight and Democratic obstruction. Experts disagree on the role Fannie and Freddie played in causing the financial crisis, but they certainly experienced its results: billions were spent bailing out the companies.", "Republican Sen. Chuck Hagel of Nebraska introduced the bill, and every committee Republican voted to move it out of committee. The question, then, is why Republican leadership did not introduce it on the floor of the full Senate, where they also had a majority.", "One possibility is that they suspected that Senate Democrats, including Clinton, would oppose the bill as a bloc, as the Democrats on the committee had done. Democrats had enough votes to sustain a successful filibuster if they had wanted to, and the then-Senate minority leader Harry Reid expressed his opposition when the bill passed out of committee.", "Experts are divided on whether even an explicit threat of a filibuster by the majority should be counted as a use of the filibuster power.", "The only mention of a filibuster in contemporary coverage of the bill’s progress is a quote from Democratic Sen. Chris Dodd of Connecticut.", "\"The word ‘filibuster’ is nowhere near the horizon,\" Dodd, a leading opponent of the bill, told reporters after the bill passed out of committee. Democratic and Republican senators both expressed optimism that a compromise version of the bill would go forward.", "Some accounts of the bill’s progress suggest that Dodd later blocked the bill by telling Sen. Richard Shelby, the head of the committee that passed the bill, that he planned to filibuster it.", "Democratic opposition was more widely expressed, but some Republican senators may have been reluctant as well. Fannie Mae and Freddie Mac lobbied some Republican senators to oppose the bill, the Associated Press reported.", "Without a vote or a public statement, it is impossible to see where individual senators who did not vote on the bill in committee, like Clinton, stood on the issue.", "Clinton never voted or publicly took a position on the bill. In contemporary reporting about the bill’s progress, her name is not mentioned.", "Three political scientists we spoke to had different standards for determining when a filibuster occurred, but all agreed that without specific evidence that she took some action to block it, it did not make sense to say Clinton filibustered the bill.", "\"In the absence of clear evidence, I’m not sure how you ascribe it to Hillary Clinton or any other Democrat,\" Sarah Binder, a professor of political science at George Washington University, said.", "Clinton’s campaigns and the Clinton Foundation have both taken large donations from Fannie Mae and Freddie Mac’s employees and an associated Political Action Committee. In 2008, Clinton was the fourth highest recipient of donations from Fannie Mae and Freddie Mac’s employees and PACs.", "Our ruling", "In an attempt to assign responsibility for the financial crisis to Clinton, Trump’s campaign accused her of filibustering legislation that would have changed how two government-backed mortgage giants were regulated.", "Republican leadership chose not to bring the bill before the whole Senate after it passed out of committee. It is possible that they thought Democratic senators would filibuster, but based on the evidence available, we found no evidence that Clinton herself took any action in relation to the bill.", "We rate this claim False.", "https://www.sharethefacts.co/share/a6493279-98a7-436c-85c6-c0d1a1955bd5", "American Banker, \"Room for Compromise Seen on GSER Bill,\" July 29, 2005.", "AP, \"Administration Hails Senate Bill,\" July 29, 2005.", "AP, \"Freddie Mac Tried to Kill Republican Regulatory Bill in 2005,\" October 19, 2008.", "Clinton Foundation, \"Contributor and Grantor Information.\"", "Congressional Quarterly, \"Attempts to Rein In Mortgage Giants Stall,\" 2006.", "Email interview with Steven Smith, professor of political science at Washington University in St. Louis.", "Factcheck.org, \"Who Caused the Economic Crisis,\" October 1, 2008.", "Opensecrets.org, \"Fannie Mae and Freddie Mac Invest in Democrats,\" July 16, 2008.", "Phone interview with Sarah Binder, Professor of Political Science at The George Washington University.", "Phone interview with Gregory Kroger, Professor of Political Science at the University of Miami.", "PolitiFact, \"Toobin says a Supreme Court nominee has never been filibustered successfully,\" April 14, 2010.", "PolitiFact, \"Sen. Rick Santorum says he warned 'of a meltdown and a bubble in the housing market’,\" January 27, 2012.", "PolitiFact, \"Ringing an alarm, not averting a crisis,\" September 17, 2008.", "Press Release from Senator Jeff Sessions, \"Few Paid Attention at the Time--Shelby Saw Crisis on the Horizon--Reform Efforts Stymied by Filibuster,\" May 11, 2010.", "UPI, \"Dems Rip New Fannie Mae Regulatory Measure,\" July 28, 2005.", "The Philadelphia Inquirer, \"Delay for Bill Limiting Fannie, Freddie,\" August 27, 2006.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]