["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "President Barack Obama spoke about climate change at a press conference in Paris Dec. 1, 2015. (Reuters)", "As the world watched President Barack Obama’s news conference about climate change, he drew on South Florida to illustrate a point about the impact -- and he zeroed in on fish.", "\"As the science around climate change is more accepted, as people start realizing that even today you can put a price on the damage that climate change is doing -- you go down to Miami and when it's flooding at high tide on a sunny day, fish are swimming through the middle of the streets, you know, that -- there's a cost to that,\" Obama said at the climate change conference in Paris Dec. 1.", "That opened the floodgates to a question about whether there are truly fish in the streets.", "At a town hall event in Iowa, former Florida Gov. Jeb Bush was among the skeptics: \"Obama said today the streets of Miami are flooded and fish are falling on them. I live there. I don’t know what he’s talking about.’’", "So is it a tall tale that fish swim in the streets of Miami? It’s certainly not a regular occurrence. But some people, including a few public officials, say they have seen it. And most importantly, it has been caught on video.", "The source of Obama’s fish story", "Spokespersons for the White House sent us news articles from 2014 and 2015 about flooding from king tides in South Florida. (King tides, for those who aren’t familiar with the term, are the highest predicted high tides and happen once or twice a year on the Florida coast. They occur when the orbits and alignment of the Earth, moon, and sun combine to produce the greatest tidal effects of the year.)", "\"There were fish swimming in the street,\" John Morgan, a Delray Beach city official, told the Sun-Sentinel in October 2014 after a few inches of sea water accumulated without any rain.", "Morgan told PolitiFact that he has seen fish on Marine Way, a road in a low-lying area, as well as at Veterans Park.", "\"I have been with the city a couple years now, and I’ve probably seen the fish in the streets at least a half dozen times,\" said Morgan, who now heads up his city’s environmental department.", "A Hollywood resident, Robin Rorapaugh, told the Miami Herald’s Public Insight Network in October 2015 that king tides had grown in her neighborhood and that \"anyone who doubts climate change should witness the sea come through the storm drains — fish were swimming in the street.\"", "We also found video evidence that supported Obama’s point. A Sept. 28 TV news report featured video showing a fish swimming on Cordova Road in Fort Lauderdale.", "\"Look at that,\" a bystander said. \"A mullet in the street.\"", "Nancy Gassman, assistant public works director in Fort Lauderdale, told PolitiFact Florida that fish on the streets are a \"regular occurrence\" during high tide flooding in Las Olas Isles and Las Olas Boulevard.", "\"In past tidal flooding, I personally have seen fish in the streets,\" she said.", "Obama’s comments echoed a recent statement by former Vice President Al Gore, who told NPR in November:", "\"I was in Miami last month and fish from the ocean were swimming on some of the streets on a sunny day because it was a high tide. In Miami Beach, Fort Lauderdale, many other places – that happens regularly.\"", "Our efforts to reach Gore were unsuccessful. However, Miami Beach officials told PolitiFact that Gore’s comment stems from a tour during a conference about climate change that happened to coincide with the king tides.", "Miami Beach officials, including assistant city manager/public works director Eric Carpenter, showed Gore the impact of the tides on the state-owned Indian Creek Drive where the water washes over the sea wall onto the street.", "\"I absolutely saw the fish,\" Carpenter told PolitiFact. \"You can actually see the fish swimming out of the creek, past the mangrove trees that are there and into the street. I probably saw close to a dozen. They weren’t big fish, but I don’t know, two or three inches long?\"", "While working on temporary fixes to the road to try to alleviate flooding, Carpenter said he saw the fish on several occasions. \"It was not an isolated incident,\" he said.", "Flooding has become an expensive problem for places such as Miami Beach, which flood for several days twice a year as a result of king tides. The coastal city is on track to spend around $500 million to install 80 pumps and raise roads and seawalls across the city. The Herald reported that while the city has flooded for decades during king tides, it has been getting worse.", "\"The king tides have gotten higher in recent years,\" said Colin Polsky, director of the center for environmental studies at Florida Atlantic University, told the Herald. \"And the king tides we're seeing more recently have been higher than they were predicted to be.\"", "It’s important to point out that sightings of fish in the street are not common. Hollywood City Commissioner Patty Asseff, who lives across the street from the intracoastal, said she had never heard of fish in the streets.", "\"It was the first I had heard about fish in the streets,\" she told PolitiFact after reading Obama’s comments about Miami. \"We have water, we have flooding, but fish I haven’t seen yet.\"", "In the past year, the city of Hollywood has spent more than $1 million on flood gates and pumps in parts of the city to alleviate flooding.", "For the record, Obama’s statement was technically about Miami -- not Miami Beach.", "Miami public works director Eduardo Santamaria said he wasn’t aware of fish on the streets in Miami, but he said the city is higher than Miami Beach and parts of Fort Lauderdale and Hollywood.", "Our ruling", "Obama said, \"You go down to Miami and when it's flooding at high tide on a sunny day, fish are swimming through the middle of the streets.\"", "This reminds us of the fishing stories you might hear from your uncle.", "Fish have been seen (and videotaped) on the streets.", "But that’s been in the low-lying areas that surround Miami, not on the streets in the city proper. And the sightings were during the more dramatic king tides, when high tides are at their highest, not during average daily high tides.", "Overall, we rate his statement Half True.", "YouTube, President Obama holds a press conference in Paris, Dec. 1, 2015", "Environmental Protection Agency, King tides and climate change, Accessed Dec. 2, 2015", "WSVN, \"High tides cause persistent flooding in South Florida,\" Sept. 28, 2015", "Washington Post, \"Forget \"bans\" on talking about climate. These Florida Republicans are too busy protecting their coasts,\" March 31, 2015", "Washington Post, \"During autumn king tides, nuisance flooding becomes chronic flooding in Miami area,\" Oct. 20, 2015", "CBS, \"Global Warming Blamed For South Florida Severe Flooding,\" Sept. 28, 2015", "New York Times First Draft blog, \"Jeb Bush Says He Would Have Probably Skipped Climate Conference,\" Dec. 1, 2015", "City of Fort Lauderdale, King Tides Nov. 24-27, Nov. 10, 2015", "White House, Press conference, Dec. 1, 2015", "Miami Herald, \"Far from Paris, South Florida climate talks begin in Key West,\" Dec. 1, 2015", "Miami Herald, \"Do fish really swim in Miami’s streets? Well not exactly,\" Dec. 2, 2015", "Miami Herald, \"How do high tides affect your day to day routine?\" Oct. 29, 2015", "Miami Herald, \"King tide sets stage for climate talks in South Florida,\" Sept. 28, 2015", "Miami Herald, \"Miami Beach's battle to stem rising tides,\" Oct. 23, 2015", "PolitiFact, Statements about climate change, Accessed Dec. 3, 2015", "Interview, Patty Asseff, Hollywood city commissioner and mayoral candidate, Dec. 2, 2015", "Interview, Robin Rorapaugh, Hollywood resident, Dec. 2, 2015", "Interview, Nannette Rodriguez, Miami Beach spokesman, Dec. 2, 2015", "Interview, Ben Kirtman, University of Miami professor Department of Atmospheric Sciences, Dec. 2, 2015", "Interview, David Hastings, Eckerd College professor of Marine Science & Chemistry, Dec. 2, 2015", "Interview, Frank Benenati, White House spokesman, Dec. 2, 2015", "Interview, Bruce Mowry, Miami beach city engineer, Dec. 2, 2015", "Interview, Eric Carpenter, Miami Beach assistant city manager/public works director, Dec. 2, 2015", "Interview, Philip Levine, Miami Beach mayor, Dec. 2, 2015", "Interview, Jennifer Jurado, director, Broward County Environmental Planning and Community Resilience Division, Dec. 2, 2015", "Interview, Mike Hernandez, Miami-Dade County spokesperson, Dec. 3, 2015", "Interview, Nancy Gassman, assistant public works director, Dec. 3, 2015", "Interview, John Morgan, Delray Beach director of environmental services, Dec. 3, 2015", "Interview, Eduardo Santamaria, city of Miami public works director, Dec. 3, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]