["About this rating", "As a D.C. circuit judge, Kavanaugh overturned a lower court decision that enjoined Washington, D.C.'s disability services officials from authorizing elective medical procedures without first making an attempt to ascertain the wishes of the patient.", "Kavanaugh's ruling did not involve abortion.", "In mid-August 2018, as confirmation hearings for President Donald Trump's U.S. Supreme Court nominee Brett Kavanaugh drew near, social media users shared a meme relating to a 2007 opinion Kavanaugh wrote as a D.C. circuit court judge:", "The meme presented an over-simplified representation of a complicated legal case and misstated Kavanaugh's role in it.", "In 2007, Kavanaugh was part of a three-judge panel that overturned a district court injunction blocking Washington, D.C.'s Mental Retardation and Developmental Disabilities Administration (MRDDA) from authorizing elective medical procedures on patients who were certified to be intellectually incapacitated without first making a documented effort to ascertain those patients' wishes. (The agency's name has since been changed to Department of Disability Services.)", "The matter before Kavanaugh did not pertain to specific medical procedures, but rather to the injunction itself. Kavanaugh supported reversing a 2005 lower court ruling that had found D.C.'s standard to be unconstitutional and had ordered the following:", "Before granting, refusing, or withdrawing consent for any elective surgery on any MRDDA consumer, the District of Columbia must attempt to ascertain the known wishes of the patient; an inquiry which is not limited to but which must include documented reasonable efforts to communicate with that person regarding her wishes. If after such an inquiry the wishes of the patient are unknown and cannot be ascertained, the District of Columbia must then make a good faith determination of the best interests of the patient, a determination that requires consideration of the totality of that person's circumstances ...", "MRDDA appealed that lower court decision and won, with Kavanaugh writing in his opinion that \"Consideration of the wishes of patients who are not and have never been competent is ... not required by the Supreme Court's procedural due process cases,\" and that \"plaintiffs have not shown that consideration of the wishes of a never-competent patient is 'deeply rooted in this Nation's history and tradition' and 'implicit in the concept of ordered liberty,' such that 'neither liberty nor justice would exist if [the asserted right] were sacrificed.'\"", "Washington, D.C.-based attorney Shep Williams, who represented the plaintiffs in the appeal, told us that Kavanaugh \"made a bad decision and he was wrong, but the issue of whether [the plaintiffs] could consent to an abortion was not before the court.\" What was before the court, he said, was the idea that intellectually disabled people \"are entitled to have an informed decision made on their behalf just like anyone else.\" Williams added that he felt the lower court had it right: \"We argued that they shouldn’t be making decisions until they talk to these people. They’re individuals, they’re not lumps of flesh.\"", "In the underlying case, Does v. D.C., three intellectually-disabled women who lived in an MRDDA-administered group home filed suit claiming they had been forced to undergo elective procedures they did not want: One had an eye surgery, while two underwent unwanted abortions. As Kavanaugh's opinion noted, however, D.C. law already rendered performing abortions (along with sterilization and \"psycho-surgeries\") without consent to be off-limits in the absence of a court order.", "Williams told us that in 2016 his clients won summary judgment against Washington, D.C. for the abortions and the case was settled, bringing the 15-year litigation to an end.", "Kavanaugh's 2007 opinion has been cited by disability advocacy groups that have come out in opposition to his nomination to the Supreme Court bench. They include the Disability Rights Education and Defense Fund (DREDF), the National Council on Independent Living (NCIL) and the American Association of People with Disabilities (AAPD), which said in a 15 August 2018 statement that:", "The principle of self-determination holds that people with disabilities must have the freedom and authority to exercise control over their own lives. Based on his ruling in Doe ex rel. Tarlow v. D.C., Judge Kavanaugh believes otherwise. The Doe plaintiffs were subjected to elective surgeries based on the consent of DC officials; Judge Kavanaugh dismissed the notion that the plaintiffs could express a choice or preference regarding medical treatment on the basis of their intellectual disability. AAPD will not support a Supreme Court nominee who does not affirm the rights and abilities of people with disabilities to determine the course of their own lives.", "Silvia Yee, senior staff attorney for DREDF told us that \"There’s a movement being pushed across states and courts to recognize there are levels of capacity [among intellectually-disabled people] and we need to figure out what those levels are.\" Kavanaugh's 2007 decision \"flies so much in the face of that.\" Although his ruling in the 2007 appeal was only binding in the court's geographical jurisdiction, Yee pointed out the concern among the disabled community is that as a Supreme Court justice, his opinions could potentially impact lives of throughout the entire country.", "Kavanaugh, Brett.   Doe ex rel. Tarlow v. District of Columbia.\r\n    Opinion for the Court.   12 June 2007.", "DREDF.   \"Why DREDF Opposes Judge Kavanaugh’s Appointment to the Supreme Court.\"\r\n    Accessed 17 August 2018.", "AAPD.   \"The American Association of People with Disabilities Opposes the Nomination of Judge Brett Kavanaugh to the U.S. Supreme Court.\"\r\n    15 August 2018.", "Jane Does I-III v. District of Columbia.\r\n    Accessed 17 August 2018.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]