["Several Facebook users shared an image featuring Home Minister Amit Shah, Bihar Chief Minister Nitish Kumar, West Bengal Chief Minister Mamata Banerjee dining along with two other people. Facebook user Hakeem Abdus Salam Khan posted the image with the message, “Discussion on West Bengal elections over breakfast. But some blind people will only call Owaisi an agent.. (-translated)” At the time of writing this article, the post has been shared over 1,100 times.", "Recently, Delhi CM Arvind Kejriwal’s old video from 2016 was shared to target AIMIM leader Asaduddin Owaisi. In the video, Arvind Kejriwal was seen reading a letter by then BJP leader Yatin Oza where it was alleged that Owaisi had struck a secret deal with the BJP. After the revival of this old and unrelated video, Owaisi is being called a ‘BJP agent’. Furthermore, Congress held AIMIM responsible for polarization during the recently concluded Bihar elections.", "Another Facebook user Aimim Zubair Qurashi also posted the image with the same narrative.", "Sharing this image on Twitter, some users similarly attempted to portray that BJP’s arch-rival in West Bengal Mamata Banerjee was seen together with Amit Shah and Nitish Kumar discussing the upcoming state assembly elections.", "With a reverse search on Google, we found multiple media reports. According to a February 2020 NDTV report, Home Minister Amit Shah and West Bengal Chief Minister Mamata Banerjee were seen dining together at Odisha CM Naveen Patnaik’s residence. “Ms Banerjee and Mr Shah had travelled to Bhubaneswar to attend a meeting of the Eastern Zonal Council (EZC), a forum of eastern states, chaired by the Home Minister. Mr Patnaik and his Bihar counterpart Nitish Kumar were also present while Jharkhand Chief Minister Hemant Soren could not make it.” stated the article published on February 29. Naveen Patnaik, the vice-chairman of the council, had hosted its 24th meeting.", "The report also included a tweet by the official handle of Odisha CM posted on February 28.", "Such a pleasure having the company of Union Home Minister @AmitShah ji, my colleague CMs, @MamataOfficial, @NitishKumar ji & Union Minister @dpradhanbjp ji at Naveen Niwas. Had a wonderfully interactive time over some home cooked #Odia delicacies. pic.twitter.com/tmhfsJnDq2", "— Naveen Patnaik (@Naveen_Odisha) February 28, 2020", "This was not the first time that thee two political leaders were seen together at a meeting. Mamata Banerjee had met Amit Shah at his office in the North Block where she raised the issue of National Register of Citizens. Moreover, the image also features several other state political leaders.", "Therefore, an old image featuring TMC Chief Mamata Banerjee and Home Minister Amit Shah was falsely linked with the upcoming state assembly elections in West Bengal.", "Donate Now", "A journalist and a dilettante person who always strives to learn new skills and meeting new people. Either sketching or working.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]