["A 19-second clip of president Ram Nath Kovind is massively viral on social media with a message claiming that the Narendra Modi-led BJP government has introduced a new law that awards death penalty for rape. “#Breaking_News बलत्कार करने वालो को फांसी पर लटकाया जाऐगा, मोदी सरकार ने कानून लागू कर दिया है। मोदी है तो मुमकिन है…” reads the message.", "The video received over 5 lakh views and 25,000 shares from the Facebook account of one Tanuj Thakur. Here, the president can be heard saying, “बलात्कार करने की जघन्य अपराध की सज़ा के लिए सरकार ने अपराधी को फांसी की सज़ा देने का प्रावधान किया है. कई राज्यों में तेज़ी से सुनवाई के बाद, दोषियों को फांसी की सज़ा मिलने से ऐसी विकृत सोच रखने वाले लोगों में कड़ा सन्देश गया. (The government has introduced a provision to award death penalty for the heinous crime of rape. A strong message will be sent to those with perverted minds if the accused are given the death penalty after speedy trials in many states.)”", "#Breaking_News", "बलत्कार करने वालो को फांसी पर लटकाया जाऐगा, मोदी सरकार ने कानून लागू कर दिया है। 🙏🚔 मोदी है तो मुमकिन है…", "Posted by Tanuj Thakur on Tuesday, 3 December 2019", "A keyword search on Youtube led Alt News to the original video. It was uploaded by ABP News on January 31, 2019. Here, the president talks about a new law to punish child rape offenders. He said that any person who rapes a “minor” (नाबालिक) would be given a death sentence. The word “minors” has been cropped from the original video and presented on social media in a manner that portrays the law as a blanket provision.", "Currently, the laws with provisions of the death penalty for rape crimes are The Criminal Law (Amendment) Act, 2013, The Criminal Law (Amendment), 2018 and The Protection of Children from Sexual Offences (Amendment) Bill, 2019.", "On April 21, 2018, an Ordinance was promulgated which provided, amongst other things, that rape and gang rape of girls below the age of 12 years will carry minimum imprisonment of twenty years, extendable to life imprisonment or death. The Criminal Law Amendment Bill, 2018 providing for the same was introduced in Parliament in July 2018 and became law in August 2018. The bill stipulated that it will come into effect from the date of the Ordinance.", "According to PRS, The Protection of Children from Sexual Offences (Amendment) Bill, 2019 was introduced in the Rajya Sabha on July 18, 2019, and passed on July 24, 2019. On August 1, 2019, the lower house of the parliament too passed the Bill. The Act received the assent of the President of India on August 5, 2019.", "The law awards the maximum punishment of death penalty for “aggravated penetrative sexual assault” which includes cases “when a police officer, a member of the armed forces, or a public servant commits penetrative sexual assault on a child. It also covers cases where the offender is a relative of the child, or if the assault injures the sexual organs of the child or the child becomes pregnant, among others.”  The Bill adds two more grounds to the definition – “(i) assault resulting in death of child, and (ii) assault committed during a natural calamity, or in any similar situations of violence.”", "The Criminal Law (Amendment) Act, 2013 passed after the Nirbhaya case allowed the death penalty for rape cases but only in ones where the accompanying brutality leads to death or leaves the victim in a persistent vegetative state, and in cases of repeat offenders.", "The clipped video has been widely circulated on Facebook.", "The video was also sent on the Alt News app for verification.", "An old speech of president Ram Nath Kovind talking about capital punishment to child rape offenders has been shared on social media a misleading claim. The Modi government has not introduced any new laws on rape with blanket provisions of the death penalty for all cases related to the crime. Since the gang-rape and murder of a veterinary doctor in Hyderabad, social media has been brimming with misinformation.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]