["The purported poster was posted on Facebook here post on June 14, 2020.", "It features an image of Dr. Shafi Shihabdeen, a doctor from northwestern Sri Lanka who was falsely accused of performing non-consensual sterilisation procedures on women.", "The post was shared 735 times before it was deleted.", "The poster features a telephone – the symbol of Sri Lanka’s newest political party Samagi Jana Balawegaya – and claims he will be contesting under No. 18. The district from which he will be contesting, however, is not mentioned.", "The Sinhala-language text on the purported poster translates to English as: “Educated, intelligent, humble Dr. Shafi Shihabdeen", "\"Staying in the frontlines alongside Sajith with unblemished medical profession”.", "The Sinhala-language text superimposed on the image translates to English as: “This is what Samagi Balawegaya means", "\"The lowlife executioner that deprived the country of Sinhala children", "\"Going forward with Sajith”.", "Sri Lanka is set to hold its parliamentary elections on August 5, 2020.", "Sajith Premadasa is the leader of the SJB.", "Dr. Shafi Shihabdeen, also known as Dr. Seigu Shihabdeen Mohamed Shafi, was arrested on May 24, 2019, on suspicion of amassing wealth through links to an Islamic extremist terrorist group. He subsequently faced allegations that he performed non-consensual sterilisation procedures on Sinhala women during C-section surgeries.", "The case accusing him of mass sterilisation was brought before the Kurunegala Magistrate’s Court on June 27, 2019, and in a 210-page report submitted to the court, the Criminal Investigation Department of Sri Lanka said no evidence was found to link Dr. Shafi to non-consensual sterilisation procedures. The court ruling was translated in this AFP fact check report.", "The purported poster was was published in Facebook posts here, here, here, here and here alongside a similar claim.", "The claim is false; political party SJB said the doctor is not contesting the upcoming parliamentary poll for their party.", "SJB’s head of campaign and communications, former minister Harin Fernando, told AFP by WhatsApp message on June 15, 2020, that Dr. Shafi would not be contesting the upcoming poll for the party.", "“There is no truth to this claim. It is a diabolical lie and this poster is a complete fabrication,” he said.", "AFP analysed the gazette published by the Elections Commission of Sri Lanka on June 9, 2020, which details the candidates representing recognised political parties who are set to contest the election for each district in Sri Lanka.", "Dr. Shafi’s name was not listed for the SJB in any of Sri Lanka’s 25 districts.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]