["In a widely shared photo from Michigan’s state Capitol, a bearded man yells while facing two masked police officers.", "Though the protester wasn’t identified in the caption that went out with the AFP image by photographer Jeff Kowalsky on April 30, a May 5 story in the Detroit Free Press identified him as Brian Cash, a 52-year-old flooring installer from New Hudson, Mich.", "That means he isn’t right-wing activist Rob Cantrall, as recent social media posts claim.", "\"This guy is Rob Cantrell (sic), longtime white supremacist and member of The Proud Boys\" reads the text above an image of the photo cropped around Cash’s face. \"Trump says these are good people. Rob lives in Los Angeles, but he and many others will travel if paid to take part in protests such as the one in Michigan. This is the face of MAGA. Spread their shame.\"", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Cantrall headed an Oregon chapter of the Proud Boys, a men’s organization of self-described \"western chauvinists\" that the Southern Poverty Law Center has called a \"hate group.\" The Free Press describes him as \"a controversial right-wing activist.\"", "Cash told the newspaper that he didn’t at first know who Cantrall was. But after researching it, Cash said he was upset to be associated with someone he considered a \"racist.\"", "We rate this Facebook post False.", "Facebook post, May 4, 2020", "Tweet, May 4, 2020", "Detroit Free Press, Michigan man in now-famous Capitol protest photo: ‘I didn’t scream in anybody’s face,’ May 5, 2020", "BBC, Proud Boys and antifa: When a right-wing activist met a left-wing anti-fascist, March 8, 2019", "The Hill, Bookstores, libraries and book fairs targeted by white nationalists: report, April 30, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]