["The photo was posted on Facebook here on November 5, 2020.", "The post's caption reads: “These ballot papers were stamped by Trump voters and have been found dumped by a roadside in Arizona. It's a naked show by Liberals & Lefties in the US. The level of vote rigging in US which no Data Analytics can calculate”.", "The post circulated online during the same week as the US presidential election in November 2020. Former vice president and Democratic challenger Joe Biden won the election on November 7, as AFP reported here.", "As of November 11, President Trump is yet to formally concede and continues to promote unsupported claims of voter fraud and manipulation.", "The image was also shared alongside an identical claim on Facebook here, here, here and here, and on Twitter here, here, here and here.", "The claim is false, according to law enforcement officials.", "A reverse image search on Google found the photo was published here in a statement from the Arizona Attorney General's Office that refuted the false claim.", "The statement, which was released on November 3, said that police in the Arizona city of Glendale were alerted to the discovery of 18 unopened ballots next to a road on October 30, 2020.", "“According to investigators, the ballots were stolen from individual mailboxes in a neighbourhood ...The envelopes were still sealed,” the statement reads.", "Voting by mail is routine in US elections in all 50 states. As the Arizona Attorney General reported, the ballots found in Glendale were still sealed and had not been filled out in favour of either candidate.", "Glendale police also posted a video of the worker who found the ballots on its Facebook account here.", "The man, who identifies himself as Brayan Ruiz, claims to have \"no information on who may have placed [the ballots] there\".", "\"All I know is that I acted and returned them to the Glendale Police and now I know that they have been returned to their owners so that they can vote,” Ruiz said.", "The second part of the video published by Glendale police shows agents from the Arizona Attorney General's Office returning the ballots to the respective voters on October 31.", "The incident was also reported here and here by US media.", "The false claim about the photo was also debunked by AFP’s Mexico team in Portuguese here on November 5, 2020.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]