["An “official msg from police” circulating on social media warns online users of a tactic devised by criminals: “If you are driving at night and eggs are thrown at your windscreen, do not stop to check the car, do not operate the wiper and do not spray any water, because eggs mixed with water become milky and block your vision up to 92.5%, and you are then forced to stop beside the road and become a victim of these criminals.”", "In Canada, the warning has been shared thousands of times in Manitoba and Ontario since October 2019. As fact-checking website Snopes reported, the urban legend began to be shared on social media at least ten years ago, and has circulated throughout the English-speaking world, including the US, the UK, Australia and South Africa.", "AFP Fact Check was not able to identify the origin of the urban legend, which some fact-checking websites say began as an email chain, though the use of the word “windscreen” for windshield suggests it was created outside of North America.", "A search for similar incidents in Canada shows one which took place in 2015 in Regina, the capital of the province of Saskatchewan. A woman’s car was egged as she was driving at night, and when she stopped on the side of the road, several individuals attempted to enter her car, but failed, and the woman drove away.", "AFP contacted the Regina Police, who said that nobody was caught in relation with this incident.", "Les Parker, a spokesperson for the Regina Police, deplored that “all the visibility on Facebook may inspire someone to commit the act,” even though he says that the 2015 incident was the only one of this nature he’s seen.", "“We haven’t seen anything like that happening,” Julie Courchaine, media relations officer for the Royal Canadian Mounted Police D-Division, which polices the province of Manitoba, told AFP, despite the post being shared more than 8,000 times from a Facebook user in the province.", "While nothing suggests the eggs-on-windshield tactic is a common tactic used by gangs, it is also false that eggs will entirely obscure a windshield. A Google and Google Scholar search reveals no study confirming that eggs on a windshield impair visibility up to 92.5 percent.", "Several online users have filmed tests on their windshields in order to disprove the idea. One is Sergeant Harry Tangye of the Devon and Cornwall Police, who shows that using wipers to rid a windshield of egg works fine, including when spraying water on the egg.", "Tales of new tactics used by criminals are commonplace on social media, but often leave out the time or place where the crime is occurring, making them easy to share but often unreliable.", "Over the summer, AFP Fact Check debunked a similar false warning about human trafficking at Canada’s Wonderland.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]