["The video was widely shared across various social media platforms -- we’ve archived one of the Facebook posts, viewed more than 20,000 times, here.", "“Schools are out all around Thokoza and Katlehong,” reads the caption on the September 4 post, referring to two townships in the Ekurhuleni municipality east of Johannesburg.", "The caption continues: “Apparently the foreign nationals are alleged to have kidnapped about 17 school kids, Parents are advised to fetch their kids.”", "The video itself shows an agitated traffic warden pacing across the street while a crowd of people gather in front of a wall.", "Speaking in Tswana, she looks into the camera and instructs parents to fetch their kids from school, cautioning that Pakistani nationals were “going to all the schools”.", "“Fetch your kids, I’m here at Monde to fetch my child.Please fetch your kids from school, it’s not safe, the Pakistanis are going to all the schools. Please,” she says.", "AFP verified the location of the video as Monde Primary School, in Katlehong with a resident of the area.", "We took recent images outside the school to compare with the video screenshots to identify the location where the traffic warden collected her child. The concrete wall, the tree without leaves on the right, the roof, and the metal gate are highlighted below.", "It’s not clear when exactly the video was filmed, but it began spreading on September 4 in posts claiming that Pakistanis were abducting children. Variants on the rumour quickly began spreading online, most of them locating the “kidnappers” in Katlehong.", "In this tweet also posted on September 4, which was retweeted more than 900 times, the “kidnappers” were identified as Somali nationals. A specific school in Katlehong was also mentioned: Lungisani Primary School.", "So a Nigerian Drug lord shoots and kill a Taxi Driver. Taxi Drivers retaliate and fight Nigerians, then Nigerians in Nigeria attack Shoprite, Multichoice and Somalians attack and kidnap school kids at Lungisani Primary School?\n\n\t\tWhat's going on ?#XenophobiaInSouthAfrica", "Some posts said that 17 children had been kidnapped, others gave the number as 30. Various messages said that Lungisani Primary School had been set on fire. We’ve archived a few of the panicked messages here, here and here.", "The scare came after a wave of attacks on foreign-owned shops broke out in Johannesburg on September 1, prompting looting, fighting and, in Nigeria, reprisal attacks on South African-owned businesses.", "Ten people were killed in the unrest in South Africa, the latest of numerous outbreaks of violence in recent years linked to tension over immigration. Migrants from other African countries, heading to the economic powerhouse in search of work, are often accused of taking up scarce jobs.", "As reported by AFP, the tensions had eased by mid-week. However, there was continuing unrest in Katlehong, fuelling the kidnapping rumours.", "In fact, officials said no school had been set on fire, and that there had been no reports of kidnappings by Pakistani or Somali nationals.", "The education department for Gauteng province, which counts Johannesburg as its capital, described the rumours as “fake news”.", "[Fake News] Social media alerts on disruptions & insinuation that there is a vehicle kidnapping children & burning schools- Katlehong: Parents are panicking fetching their children from schools. MEC @Lesufi is visiting Lungisani Primary School which was reported to be on fire. pic.twitter.com/PFYmN2u9nB", "In a statement published on Facebook, the education department called on parents in the province not to panic -- saying that amidst the unrest, school was the safest place for people’s children.", "“We would like to appeal to parents to remain calm and urge the community to refrain from disrupting teaching and learning. We believe that with the ongoing criminal activities, our schools are a safer and conducive environment for learners than roaming in the streets,” Gauteng education chief Panyaza Lesufi said in the statement.", "“There are circulating social media posts suggesting that Lungisani Primary School was torched this morning, the department strongly refutes all these allegations. We want to reiterate that no school was burned today.”", "Lungisani Primary School -- the school which had found itself at the centre of the rumours -- similarly described them as “fake and threatening rumours” and confirmed that the school was safe. It deplored the fact that few children had come to school on Thursday after the rumours began spreading.", "Local newspaper The Sowetan reported that 13 schools had briefly closed over the scare.", "In a week marked by a flood of misleading social media posts about the violence -- you can read a round-up of AFP fact-checks here -- Gauteng Premier David Makhura said the traffic warden’s comments had not helped.", "“The mayor will deal with an officer of the law, who basically is the one who circulated the video that caused lots of panic,” Makhura told a provincial briefing.", "“Many parents rushed to the schools to go and pick up their children -- that was fake news, total fake news. There were no Somalis, there were no Pakistanis who were going to schools to kidnap children.”", "Mzwandile Masina, mayor of the Ekurhuleni municipality which covers the area hit by the rumours, said the traffic warden had been suspended.", "“The decision has been made by the chief of police investigation to suspend the officer with immediate effect because she actually has plunged the city into crisis,” said Masina.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]