["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Democratic presidential candidate Sen. Bernie Sanders, I-Vt., speaks at the University of Chicago on September 28, 2015. (Getty)", "Vermont Sen. Bernie Sanders and his presidential campaign serve as an almost constant reminder that Hillary Clinton has not always taken the lead on issues near and dear to the more liberal members of the Democratic Party. She only recently declared that she opposed the Keystone XL pipeline that would link oil from the tar sand fields of Canada to refineries on the Gulf Coast. On same-sex marriage, Clinton’s views evolved.", "As PolitiFact has described, in 1999, Clinton both supported the 1996 Defense of Marriage Act (DOMA), which defined marriage as between a man and woman, and legal recognition of civil unions. By 2007, she opposed DOMA, but fell short of backing same-sex marriage. Then in 2013, she came out in favor of same-sex marriage pure and simple.", "Chuck Todd, the host of NBC’s Meet the Press, focused on same-sex marriage during an interview with Clinton on Sept. 27, 2015.", "\"Bernie Sanders has been where you are on these issues,\" Todd said. \"Bernie Sanders was there when it came to marriage 20 years ago. Do you think one of the reasons he's doing well right now is some progressives think, ‘Well, you know what? He was there when it wasn't popular.’\"", "Clinton said Sanders could speak for himself and used the question to attack Republicans.", "Here, we wanted to look at whether Sanders supported same-sex marriage two decades ago.", "What we found was long-standing support for gay rights in general, a voting record consistent with same-sex marriage, but not much in the way of public statements on behalf of same-sex marriage itself.", "An early gay rights backer", "Todd said Sanders was \"there\" on same-sex marriage 20 years ago, but we found evidence pointing back even further.", "In the early 1970s, Sanders ran for governor of Vermont under the banner of the Liberty Union party, a coalition of leftist groups. The party platform called for making taxes tougher on corporations and lighter on families, an end to the Vietnam War and a number of measures to get government out of people’s private lives.", "\"The Liberty Union believe that there are entirely too many laws that regulate human behavior,\" Sanders wrote in an open letter. \"Let us abolish all laws which attempt to impose a particular brand of morality or ‘right’ on people. Let’s abolish all laws dealing with abortion, drugs, sexual behavior (adultery, homosexuality, etc.).\"", "There’s an image of that letter, thanks to Alternet.", "While you could read Sanders’ sweeping reference to all laws dealing with homosexuality as including same-sex marriage, it doesn’t specifically say that.", "As mayor of Burlington, Vt., Sanders supported a gay pride parade in 1983, saying \"we must all be committed to the mutual respect of each other’s lifestyle.\" Sanders also put through a 1984 housing anti-discrimination ordinance that protected people based on \"his or her sexual preference.\"", "In 1995 on the House floor, Sanders came to his feet to chastise a Republican congressman who attacked supporters of a tougher Clean Water Act as \"the same people that would put homos in the military.\"", "According to a Boston Globe article at the time, \"You used the words 'homos in the military,' \" Sanders shouted at Cunningham. \"You have insulted thousands of gay people who have put their lives on the line in countless wars defending this country.\"", "So Sanders has a long track record on the side of gay rights in general.", "When it comes to same-sex marriage and Todd's reference to \"20 years ago,\" Todd is pointing to Sanders' votes related to the Defense of Marriage Act.", "The Defense of Marriage Act of 1996", "In May 1996, Rep. Bob Barr, R-Ga., introduced a bill most notable for its section on definitions. The bill, best known as DOMA, empowered states to disregard same-sex marriages that might be legal in other states.", "It also defined marriage as \"only a legal union between one man and one woman as husband and wife, and the word ‘spouse’ refers only to a person of the opposite sex who is a husband or a wife.\"", "Sanders had a couple of key opportunities to vote as DOMA moved through the House. As the bill was headed for a final vote, Rep. Barney Frank, D-Mass., offered an amendment that would allow each state to set its own definition of marriage. Sanders joined about 100 lawmakers in supporting Frank’s amendment, far short of the total needed.", "On DOMA itself, Sanders was part of a smaller group of opponents, just 67. The bill passed and President Bill Clinton signed it in September.", "We wondered if Sanders made any public statements about DOMA in 1996. A search of the Congressional Record and the Nexis news database turned up nothing. His campaign staff couldn’t provide any examples from that time. We contacted Susan Murray, a Burlington lawyer and a co-founder of the Vermont Freedom to Marry Task Force. Murray said members of her group met with Sanders in 1996.", "\"He opposed DOMA and explicitly told Freedom to Marry so,\" Murray told us. \"The meeting was not focused on whether Bernie affirmatively supported marriage equality.\"", "Same-sex marriage was not on the legislative table in the mid 1990s. When Todd said Bernie was on board before it was popular, the survey numbers back him up. In 1996, Gallup found that 68 percent of the public opposed marriage between couples of the same sex.", "Vermont passed a civil union law in 2000. Sanders supported it. The year before, Gallup found that 62 percent of the public opposed marriages between people of the same sex.", "In 2006, Sanders opposed a Republican-sponsored constitutional amendment that defined marriage as between a man and a woman. In an Associated Press interview, Sanders said the measure was designed to divide the public, and he praised Vermont’s civil union law. Vermont \"led the way,\" but noted that it was \"a very divisive debate.\" The AP reported that when asked if Vermont should legalize same-sex marriage, Sanders said, \"Not right now, not after what we went through.\"", "Our ruling", "Todd said that Sanders was \"there\" 20 years ago on the issue of same-sex marriage. What we found specific to same-sex marriage is that Sanders opposed defining marriage exclusively as between a man and a woman. He expressed that opinion through his votes, and in conversations with activists in his state.", "Todd’s claim is accurate. We rate it True.", "Editor's note, March 21, 2016: This fact-check has been updated to include Sanders' 2006 positions and comments to the Associated Press.", "NBC, Meet the Press, Sept. 27, 2015", "City of Burlington, Vermont, Burlington Code of Ordinances", "Queerty, 32 Years Before Marriage Equality, Bernie Sanders Fought For Gay Rights, July 19, 2015", "Associated Press, State Official: Being Gay Shouldn't Be A Public Issue, But ...,  Aug, 5, 1995", "Alternet, Bernie Sanders Was for Full Gay Equality 40 Years Ago, June 26, 2015", "Bernie Sanders for President, Sanders on Gay Marriage: ‘Time for Supreme Court to Catch Up to the American People’, April 28, 2015", "Boston Globe, Frank calls lawmaker's remark on gays bigotry May 12, 1995", "Library of Congress, Amendment to suspend definition of marriage, July 12, 1996", "Mother Jones, How Bernie Sanders Learned to Be a Real Politician, May 26, 2015", "PolitiFact, Hillary Clinton’s changing position on same-sex marriage, June 17, 2015", "Gallup, Marriage", "Email interview, Susan Murray, attorney, Langrock Sperry and Wool, Sept. 28, 2015", "Interview, Sheryl Rapée-Adams, chair, Vermont Freedom to Marry Task Force, Sept. 28, 2015", "Email interview, Warren Gunnel, spokesman, Sanders for President, Sept. 29, 2015", "Time, How Bernie Sanders Evolved on Gay Marriage, Oct. 28, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]