["The report was shared in this Instagram post on March 6, 2021.", "“Elon Musk declared dead after Tesla factory explosion,” the headline on an article featured in the post reads. The logo of Fox News is partly visible in the top-left corner.", "The same article screenshot was shared on Facebook, where the name of the purported author, Maria Quilam, is visible.", "Meanwhile, this tweet features a headline which claims the tech entrepreneur -- who is CEO of car firm Tesla and spacecraft manufacturer SpaceX -- died following a “Tesla Battery Malfunction”.", "However, the claim is false. The posts do not show genuine news reports and there are no credible reports of Musk’s death.", "A Google search of the headline “Elon Musk declared dead after Tesla factory explosion” found no such article published by Fox News or any other mainstream news outlet.", "AFP found no results for a journalist named Maria Quilam working at Fox News.", "There were also no matching news articles about an explosion when searching the headline “Elon Musk reportedly dead at 49 following Tesla Battery Malfunction”.", "The author of the purported news article in that tweet, Avery Hartmans, is a genuine reporter for Business Insider.", "Hartmans published an article on Musk on March 3, 2021, which uses the same header photo as the misleading news article, with a headline about Russian President Vladimir Putin.", "Musk is still active on Twitter since the false reports of his death emerged. He tweeted a photo of himself with his partner and son in Texas on March 8, 2021.", "Starbase, Texas pic.twitter.com/mt4IpqqmjF", "Furthermore, no statement on the matter has been released by Tesla or SpaceX.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]