["About this rating", "In February 2018, President Donald Trump spawned yet another political controversy when he said that he would have intervened to stop a recent mass school shooting if had he been present at the scene, as rhe New York Times reported:", "President Trump asserted that he would have rushed in to save the students and teachers of Marjory Stoneman Douglas High School from a gunman with an assault weapon, even if he was unarmed at the time of the massacre.", "Speaking to a meeting of the country’s governors at the White House, Mr. Trump conceded that “you don’t know until you test it.” But he said he believed he would have exhibited bravery “even if I didn’t have a weapon, and I think most of the people in this room would have done that, too.\"", "The president’s remarks came during an hour-long televised conversation with the governors in the State Dining Room, during which Mr. Trump continued to grapple publicly with how best to respond to the mass shooting in Parkland, Fla., discussing such things as arming teachers and reopening mental institutions.", "President Trump's remarks prompted a wave of scoffing from critics who scornfully pointed out that he had obtained a series of student and medical deferments that kept him out of the military during the Vietnam War era. But Trump's supporters backed him up by pointing to newspaper accounts from 1991 reporting that he had once confronted a baseball-bat-wielding mugger on the streets of New York City:", "Remember the time Donald Trump saw a bat wielding mugger and ran after him and stopped him: pic.twitter.com/MLqZlwpvti", "— MARK SIMONE (@MarkSimoneNY) February 26, 2018", "Many readers reacted with skepticism to this information, disbelieving it because it seemed conveniently and suspiciously new to them after the contentious 2016 presidential campaign in which Trump's actions over the course of his life came under scrutiny. However, a Google Trends graph that illustrates search data demonstrated spikes of interest in the story over the previous two years:", "The original New York< Daily News report of the incident carried a dateline of 20 November 1991 and was syndicated to a number of regional newspapers:", "The text of the article described Trump, en route to a Paula Abdul concert in November 1991, ordering his limo driver to pull over when he spotted a man wielding a bat attacking another man on the streets of Manhattan:", "NEW YORK — Call it The Donald to The Rescue.", "When he saw \"a big guy with a big bat\" bashing another fellow, Donald Trump did what any self-respecting billionaire would do: He ordered his driver to pull over.", "\"I'm not looking to play this thing up,\" Trump said [on 19 November 1991]. \"I'm surprised you found out about it.\"", "Witnesses said Trump, with Marla Maples tugging at his arm to try to stop him, leaped from his black stretch limousine during the Manhattan assault.", "\"Someone in the car looked over and said, 'Gee, look at that, it's a mugging,' \" Trump said. \"I said to my driver to stop the car because it was brutal-looking.\"", "Trump was at first reluctant to discuss his daredevil deed, but then he warmed to the task.", "\"The guy with the bat looked at me, and I said, \"Look, you've gotta stop this. Put down the bat,\"' Trump said. \"I guess he recognized me because he said, 'Mr. Trump, I didn't do anything wrong.' I said, 'How could you not do anything wrong when you're whacking a guy with a bat?' Then he ran away.\"", "Determining how much of this account is true nearly three decades later is difficult, especially given Trump's long history of self-aggrandizing statements (including his making self-publicizing phone calls to reporters while pretending to be someone else). But unless one were to believe that the Daily News was completely deceived or complicit in running an entirely fabricated story, replete with witness statements, this report would seem to have had some real-life incident behind it.", "However, the public record of the incident all stemmed from a single report, and even that account was contradictory about exactly what took place. One named witness asserted that the would-be mugger had already run off by the time Trump exited his limo, and the billionaire did nothing more than join a crowd of onlookers after the fact. Another anonymous witness supported Trump's account, maintaining that the bat-wielder had apparently dropped his weapon in response to the billionaire's verbally confronting him. Local police said they could provide no information about what transpired, as the incident wasn't reported to them:", "Kathleen Romeo, a 16-year-old student at St. Michael's Academy in Manhattan, said cries of \"There's Trump!\" went through the crowd of onlookers when the erstwhile deal maker emerged from his limousine in front of a Smiler's deli.", "\"A lot of people were surprised that he got out to see what was happening,\" Romeo said, adding that the bat-wielder ran off just before Trump actually appeared, and that Trump, \"just looked around and went back into his limo.\"", "But another witness, who asked not to be identified, supported Trump's tale.", "\"All of a sudden, a big long limousine pulls up on an angle, and Donald Trump pops out with the blond, too,\" the witness said. \"There was a guy with a bat, hitting a guy over the head, and Trump yelled, 'Put that bat down. What are you doing?' The guy dropped the bat, came over and started talking to him.\"", "A Midtown North Precinct spokeswoman said the attack was not reported to police.", "The article also noted that this account followed a high-profile mugging of Donald Trump's mother that had taken place a month earlier.", "Rosen, James.   \"Mugger's Trumped.\"\r\n    [New York] Daily News.   20 November 1991.", "The New York Times.   \"Youth Is Sentenced in Robbery of Mrs. Trump.\"\r\n    26 July 1992.", "Fisher, Marc and Will Hobson.   \"Donald Trump Masqueraded as Publicist to Brag About Himself.\"\r\n    The Washington Post.   13 May 2016.", "Shear, Michael D.   \"Trump Says He Would Have Rushed in Unarmed to Stop School Shooting.\"\r\n    The New York Times.   26 February 2018.", "Rosenthal, Max J.   \"The Trump Files: The Time Donald Trump Pulled Over His Limo to Stop a Beating.\"\r\n    Mother Jones.   23 June 2016.", "Kim LaCapria is a former writer for Snopes.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]