["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "President Donald Trump arrives on Capitol Hill for a Senate Republican policy lunch, Wednesday, Jan. 9, 2019, in Washington. (AP)", "The border wall impasse is not over construction materials. But President Donald Trump made it sound that way during his prime time address to the nation.", "Speaking on the 18th day of a partial government shutdown, Trump claimed he made a concession to the Democrats in his appeal for $5.7 billion for a border wall.", "\"At the request of Democrats, it will be a steel barrier rather than a concrete wall,\" Trump said Jan. 8.", "We found no evidence that Democrats requested the wall be made of steel. The White House did not respond to our request for comment.", "Mick Mulvaney, Trump’s acting chief of staff, however, said during an interview on Meet the Press on Jan. 6 that discussions with Democrats \"never even got to\" the \"definitional conversations\" on the wall, like whether a steel fence may qualify.", "\"Do we disagree on a wall, or do you really agree that maybe a steel fence qualifies as a fence and not a wall, and we want to build a steel barrier anyway?\" Mulvaney said.", "In recent weeks, Trump has embraced a version of the wall that’s different from the tall, concrete barrier he campaigned on.", "\"The Democrats, are saying loud and clear that they do not want to build a Concrete Wall - but we are not building a Concrete Wall, we are building artistically designed steel slats, so that you can easily see through it....,\" Trump tweeted on Dec. 18, 2018.", "We could find no evidence that Democrats ever said they wanted a steel wall.", "\"Democrats never requested this,\" said Drew Hammill, a spokesman for House Speaker Nancy Pelosi. \"This is completely false.\"", "Senate Democratic leader Charles Schumer’s spokesman echoed that.", "\"We’ve always said the funds must be restricted to existing border technology,\" said spokesman Justin Goodman. \"That’s what all the bills we’ve passed said.\"", "According to Goodman, the Democrats’ offer is a continuing resolution on last year’s appropriations act. The law, passed with Republican and Democratic support, provided $1.3 billion for fencing and additional money for other types of border security. The language made it so that the funds could only be used on repairing or extending fencing that had already been built under the Secure Fence Act of 2006.", "Pelosi did not mention wall materials in her televised response to Trump. Instead, she talked about bringing more technology to the border.", "\"The fact is we all agree we need to secure our borders while honoring our values,\" Pelosi said. \"We can build the infrastructure and roads at our ports of entry, we can install new technology to scan cars and trucks for drugs coming into our nation. We can hire the personnel we need to facilitate trade and immigration at the border. We can fund more innovation to detect unauthorized crossings.\"", "The New York Times reported that on Jan. 5, Democrats asked the administration for a detailed plan of how the requested $5.7 billion would be used. The Office of Management and Budget reiterated the president’s request for a steel barrier. Democrats rebuffed that offer.", "Trump said, \"At the request of Democrats, it will be a steel barrier rather than a concrete wall.\"", "There is no evidence that Democrats asked for a steel barrier. Democratic leadership affirmed there has been no request for a steel barrier. Democrats have been pushing for other forms to secure the border, including the reinforcement of existing physical barriers, but have made no concessions on Trump’s border wall proposals.", "We rate this statement False.", "Email interview with Drew Hammill, deputy press secretary for House Majority Leader Nancy Pelosi, Jan. 8, 2019", "Phone interview with Justin Goodman, press secretary for Senate Democratic leader Charles Schumer, Jan. 9, 2019", "New York Times, Trump Offers a ‘Steel Barrier,’ but Democrats Are Unmoved, Jan. 6, 2019", "NBC, Chuck Todd \"Meet the Press\", Jan. 6, 2019", "New York Times, Full Speech: Trump Addresses Nation on Immigration, Jan. 8, 2019", "New York Times, House Speaker Pelosi and Senate Minority Leader Schumer Deliver Response to President Trump's Address on Homeland Security and the U.S.-Mexico Border, Jan. 2019", "PolitiFact, Donald Trump secures about $1.6 billion for border barriers, March 23, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]