["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Sen. Rand Paul, R-Ky., speaks at the 42nd annual Conservative Political Action Conference (CPAC) Feb. 27, 2015 (AP Photo/Carolyn Kaster, File)", "Terrorists have thousands of dangerous missiles, and it’s former Secretary of State Hillary Clinton’s fault, said Sen. Rand Paul, R-Ky.", "Paul, a potential 2016 contender, threw some jabs at Clinton in his Feb. 27 speech at the Conservative Political Action Conference. In particular, he pointed to the United States’ military involvement in the 2011 Libyan uprising, during Clinton’s term as secretary of state.", "\"Hillary's war in Libya is a perfect example,\" Paul said. \"Hillary's war made us less safe. Libya's less stable, and radical jihadists run amok. They swim in our swimming pool! Hillary's war in Libya allowed thousands of surface-to-air missiles to fall into the hands of radical Islamists. As Hillary was declaring victory in Libya, Ambassador Stevens was pleading for more security.\"", "We were intrigued by Paul’s claim that radical Islamists got their hands on \"thousands\" of surface-to-air missiles.", "The United States has worked for years to destroy tens of thousands of man-portable air-defense systems (MANPADS) around the globe. These over-the-shoulder surface-to-air missiles are easy to transport, and they pose serious danger to both commercial and military aircraft.", "We found that it’s likely terrorists have acquired a few Libyan MANPADS as a result of the conflict, but experts told us that there is no way they number in the thousands, or even dozens. Moreover, experts told us U.S. military involvement isn’t to blame. American programs actually reduced by thousands the number of MANPADS accessible to terrorists.", "\"There is currently insufficient evidence to support the claim that radical Islamist groups have obtained ‘thousands’ of Libyan MANPADS,\" said Jeremy Binnie, the Middle East/Africa editor for Jane’s Defense Weekly.", "Where did they go?", "The 2011 U.S.-backed Libyan uprising -- part of the Arab Spring -- toppled the decades-long dictator Col. Muammar Gaddafi. At the time, the State Department estimated that Gaddafi had amassed about 20,000 MANPADS over 40 years.", "Paul's office sent us news reports from 2011 regarding the many MANPADS that went missing during the conflict; most were looted or destroyed. There was real concern that they would end up in the hands of terrorists.", "Three years later, a United Nations Panel of Experts report found: \"Fears that terrorist groups would acquire these weapons have materialized.\"", "According to the report, Libyan MANPADS are known to have been smuggled into Chad, Lebanon, Mali and Tunisia, and authorities seized some found on a boat headed to Syrian insurgents.  It’s also possible, but unconfirmed, that they’ve made their way to Egypt and Gaza. The MANPADS found in Mali and Tunisia were confirmed to be part of terrorists’ arsenals.", "But the idea that terrorists even had access to \"thousands\" of operable MANPADS is inexplicable, experts told us.", "First, Libya’s 20,000 MANPADS were amassed over 40 years. The U.N. report said only some would still be usable today, despite their age. Others were acquired in pieces and cannot be reassembled because they are missing key components, said William Lawrence, a professor at George Washington University's Elliott School, who previously worked at the United States Embassy in Tripoli, Libya. The missiles destined for Syria, for example, did not include launchers.", "Also, some of the weapons were controlled by anti-Gaddafi rebels, whom the U.S. supported, Lawrence added.", "As for the claim that U.S. military involvement is somehow to blame for any missiles falling into the wrong hands, Libyan rebels were seen with looted MANPADS before the United States got involved in March 2011, Binnie said.", "There is a long paper trail of America’s role in drastically reducing Libya’s MANPADS arsenal.", "The United States military spent about $2 billion and several months in Libya as part of a U.N.-sanctioned NATO coalition intent on toppling Gaddafi. In the mission, NATO airstrikes destroyed Libyan weapons depots, and in the process, according to the administration, eliminated thousands of MANPADS.", "Further, a major aspect of the United States’ diplomatic mission in Libya was a $40 million program to aid the U.S.-backed transitional government in regaining control over Libya’s weapons -- MANPADS in particular. The program -- which one State Department official called \"the most extensive effort to combat the proliferation of MANPADS in U.S. history\" -- recovered more than 5,000 Libyan MANPADS.", "According to the State Department, getting rid of Libya’s MANPADS were part of diplomatic discussions with Libya long before the 2011 uprising.", "So let’s review: Of those 20,000 MANPADS -- the United States recovered 5,000, NATO destroyed thousands, the U.S.-backed transitional government acquired many, and many are inoperable. While we know terrorists got their hands on a few, it’s highly unlikely that they have \"thousands.\"", "A line in the U.N. report", "Though the evidence overwhelmingly is against Paul, one line in the U.N. report threw us a curveball: \"Panel sources stated that thousands of MANPADS were still available in arsenals controlled by a wide array of non-state actors with tenuous or non-existent links to Libyan national authorities.\"", "If thousands of MANPADS are still in the hands of \"non-state actors,\" could that mean thousands are available to terrorists? Not likely, Binnie said. While Libya has some radical Islamic non-state actors, the county also has numerous local tribes and militias (who aren’t terrorists) that formed during the uprisings who likely stockpiled MANPADS.", "\"While Ansar al-Sharia and other radical groups affiliated to the Islamic State are operating in Libya, they remain very much a minority,\" Binnie said.", "It’s also worth noting that there have been no documented instances of a shootdown using Libyan MANPADS since the 2011 conflict, said Karim Mezran, senior fellow at the Rafik Hariri Center for the Middle East.", "\"The Islamist groups have been bombed from the air daily in the last six months,\" Mezran said. \"If they have thousands (of MANPADS) why haven't they used them so far?\"", "Our ruling", "Paul said that U.S. military involvement in Libya \"allowed thousands of surface-to-air missiles to fall into the hands of radical Islamists.\"", "Experts told us that even though some terrorists are known to have a few Libyan surface-to-air missiles, the idea that they have \"thousands\" is extremely unlikely. While many of Libya’s 20,000 surface-to-air missiles went missing during the conflict, thousands more were destroyed, recovered, rendered inoperable or believed to be in the hands of militias that aren’t radical Islamic terrorists.", "It’s also incorrect to say the United States’ military involvement caused these missiles to go missing. The weapon looting began before the United States and NATO showed up. And when they showed up, they destroyed or recovered many thousands. It’s arguable that American involvement had the exact opposite effect than what Paul asserts.", "The statement contains an element of truth but ignores critical facts that would give a different impression, so we rate Paul’s claim Mostly False.", "CQ, Rand Paul CPAC transcript, Feb. 26, 2015", "United Nations, \"Final report of the Panel of Experts established pursuant to resolution 1973 (2011) concerning Libya,\" Feb. 19, 2014", "ABC News, \"Nightmare in Libya: Thousands of Surface-to-Air Missiles Unaccounted For,\" Sept. 27, 2011", "State Department, MANPADS: Combating the Threat to Global Aviation from Man-Portable Air Defense Systems, Jan. 27, 2011", "State Department, \"Addressing the Challenge of MANPADS Proliferation,\" Feb. 2, 2012", "White House, Press Briefing by Press Secretary Jay Carney, Oct. 20, 2011", "White House, \"Press Briefing by Press Secretary Jay Carney,\" Sept. 28, 2011", "Los Angeles Times, \"U.S. intervention in Libya now seen as cautionary tale,\" June 27, 2014", "New York Times, \"In Tripoli, Clinton Pledges U.S. Help to a ‘Free Libya,’\" Oct. 18, 2011", "New York Times, \"Counting Qaddafi’s Heat-Seeking Missiles, and Tracking Them Back to their Sources,\" July 26, 2011", "Jane’s Defense Weekly, \"Grail quest: MANPADS proliferation in the wake of Libya,\" June 12, 2014", "Stratfor, \"The Continuing Threat of Libyan Missiles,\" May 3, 2012", "Federation of American Scientists, \"The MANPADS threat and International Efforts to Address It,\" August 2013", "Reuters, \"NATO hits Libyan arms depot as West faces dilemma,\" May 9, 2011", "Email interview, Jeremy Binnie, Middle East/Africa editor for Jane’s Defense Weekly, March 4, 2015", "Phone and email interview, William Lawrence, professor at George Washington University's Elliott School, March 4, 2015", "Phone and email interview, Karim Mezran, senior fellow at the Rafik Hariri Center for the Middle East, March 4, 2015", "Email interview, State Department spokesperson Alec Gerlach, March 4, 2015", "Email interview Paul spokesperson Eleanor May, March 4, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]