["Amidst the coronavirus pandemic, one Pakistani Twitter user Nasir Chinioti posted two photographs – one of Russian President Vladimir Putin and the other of a lion roaming on streets – with a claim that Putin has left 800 tigers and lions in Russia to clamp down on citizen’s movement across the country. He applauded the ‘stringent measures’ taken by Putin and opined that this will “push people to stay home.”", "#Covid_19#StayAtHome Vladimir Putin has given Russians two options.", "You stay at home for 2 weeks or you go to jail for 5years. No middle ground.", "RUSSIA: Vladimir Putin has Dropped 800 tigers and Lions all over the Country to push people to stay Home.. Stay Safe Everyone!! pic.twitter.com/vI1NSpe5TR", "— Nasir Chinioti ناصر چنیوٹی (@_Chinioty) March 22, 2020", "The photograph of the lion strolling across a road was posted by another Twitter user with the same claim. Facebook page Hamra TV shared the image and said, “President Vladimir Putin has dropped 800 Tigers and lions across the country to push people to stay home.” While the Facebook post has garnered close to 1,200 shares, the tweet has amassed over 34,000 retweets.", "Lord Sugar, the chairman of Amshold Group, too tweeted the image with the text, “Is this a wind up”. Along with his tweet, Sugar posted a supposed screengrab of a news channel which claimed, “Russia has unleashed more than 500 lions on its streets to ensure that people are staying indoors during the pandemic outbreak”. It was retweeted more than 5,500 so far. Multiple other users on Facebook and Twitter shared the image with an identical claim.", "Alt News has received several requests on its official Andriod application to fact-check this image.", "With a reverse search on Google, Alt News traced the image back to April 2016. The image is from South Africa’s Johannesburg and has nothing to do with the recent pandemic. “It’s almost old news already, but if you didn’t see it yet, here is the lion that was roaming around Johannesburg CBD in Braamies last night,” reads the caption attached to the image shared by Facebook page CICA – Crime Intelligence and Community Awareness – South Africa on April 13, 2016.", "The lion was seen prowling in a residential area of Johannesburg. According to a report by UK’s Daily Mail, residents of the area were later reassured that a lion named Columbus was not on the loose and had been brought in for filming by a production crew. “Columbus had been borrowed from a nearby lion park and the area was fenced off while the animal, which has starred in a number of films and advertising campaigns, is tame,” stated the report published on April 15, 2016.", "Moreover, the screengrab of a news channel reporting the same claim, which was posted by Lord Sugar, can be easily created on this “breaking news” generator website.", "According to a recent article by Independent media outlet The Moscow Times, the total number of patients who have tested positive for coronavirus has jumped to 367 in Russia. On March, the outlet reported, “Moscow authorities again ruled out the possibility of a citywide lockdown. Meanwhile, Mayor Sergei Sobyanin said the city’s metro will not close down.” Thus, the claim about the Russian government restricting the movement of its citizens inside the country by imposing a lockdown itself is untrue. Journalist Bryan Macdonald informed that while most of the European countries are under lockdown, bars and clubs still open in Russia.", "In conclusion, an old image of a tamed lion strolling in South Africa’s Johannesburg was shared with the false narrative that Russia is restricting the movements of its citizen leaving 800 tigers and lions across the country.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]