["About this rating", "For a window of time around Jan. 22, 2021, a large number of pornographic videos were uploaded to Facebook by pages purporting to represent small businesses. Based on identically named pages identified by Snopes, screenshots of these search results posted to social media appear to be genuine. This period of time roughly follows a large Facebook outage.", "While typing a single letter or other words in the search bar may well have triggered pornographic results, their appearance in search results could be the result of a flood of adult content uploaded to Facebook at around the same time, not a specific feature of the search tab.", "We do not know how, why, or by whom these videos were uploaded to Facebook, what caused them to show up in search results, or if this incident has any relationship to the outage.", "Beginning late on Jan. 22, 2021, Redditors began posting screenshots of Facebook video search results containing — or consisting solely of — pornographic videos. The influx of adult material in search results roughly coincided with a large-scale Jan. 22 Facebook outage described online as a \"black out\" that saw many users locked out of their accounts. This led some online commentators to suggest a link between the two events. \"Some users who managed to regain access to their accounts said that the were bombarded with pornography when looking at the video section of the site,\" the Daily Mail asserted after the outage. Facebook attributed the problem to \"configuration change.\"", "Two versions of the claim appear to exist. One is that typing in the word \"video\" into the search bar returned porn. The other is that simply typing any letter filled the results with porn. Both assertions could potentially be explained by a flood of videos uploaded to Facebook around the same time — something which has also been claimed and which is further supported by the recent time stamp on all the videos pictured in the Reddit screenshots. \"Facebook has been hacked,\" a Redditor claimed on Jan. 22. \"Someone has uploaded a massive amount of porn to the video search results.\"", "Snopes asked Facebook if it was possible for there to be a link between the \"black out\" and the influx of adult content; if a massive upload of adult content occurred around this time; and if large amounts of pornographic videos uploaded at the same time could explain the search results. In response, a spokesperson told us only that \"after receiving reports of inappropriate content showing up in some searches, [they] investigated and resolved the issue.”", "Faced with this set of claims and this opaque partial confirmation of some sort of porn-related occurrence, Snopes attempted to verify that the screenshots shared on Reddit showed, or plausibly showed, authentic Facebook search results. For several reasons, we believe them to be authentic screenshots.", "In the screenshot shared by the Redditor referencing the \"massive amount of porn uploaded to the video search results\" one of the videos shown in search results came from a Facebook page titled \"Full japanese movie sex.\" Snopes identified a page with the identical name whose timeline was filled only with pornographic content titled in a similar way to the videos shown in the Reddit threads.", "The page Snopes found, created after the screenshot in Reddit was taken, is unlikely to be the same page. However, its presence demonstrates that pornographic results and content in the Facebook video search are, or were, possible. Its similarities to the content shown in Reddit screenshots is suggestive of it being part of a related influx of content.", "\"Full japanese movie sex\" purports to be the Facebook page of a business. In this case, the business is allegedly a \"gaming video creator.\"  It is one of several pages identified by Snopes claiming to be various sorts of businesses —  ranging from gastroenterologists to nail salons — that also exclusively share similarly titled pornographic videos. In further support of the authenticity of the screenshots, all of the fake business/porn pages Snopes identified were created in a period of time roughly coinciding with this alleged massive dump of porn.", "Accepting the screenshots as real means that porn can and did show up in search results. The fact that Snopes can still identify such content at the time of this reporting is further verification. We are unable to explain why single letter searches or other words, specifically, returned these results, however. The fact that Snopes identified several pages with a similar M.O. created during the time period alleged to include a massive upload of porn suggests that this content was indeed uploaded to Facebook, and the recent creation of such pages could plausibly explain their presence in search results.", "The information provided by Facebook does not allow us to parse these issues further, nor does it address a possible connection to the Facebook \"outage.\" It does indicate, though, that a real pornography-related event happened that required investigation and work to \"resolve.\" For these reasons, and with those related caveats, we rank the claim \"Mostly True.\"", "In our email to Facebook, we specifically sent them the \"Full japanese movie sex\" page as an example. After we received a statement that asserted Facebook \"investigated and resolved the issue,\" Snopes checked to see if the page had been taken down. At the time of this reporting, the page and its content remain live.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]