["About this rating", "In April 2015, Donald Trump tweeted the statement,  \"If Hillary Clinton can't satisfy her husband what makes her think she can satisfy America?\"", "Trump's tweet quoted and amplified another Twitter user's words rather than offering a statement original to Trump himself.", "It is an unfortunate fact of life that women in the political arena — like women everywhere — are still commonly subjected to being the target of caustic remarks and jokes about their physical appearance and sexuality. One manifestation of that phenomenon is an image quote holding that Donald Trump once said, \"If Hillary Clinton can't satisfy her husband, what makes her think she can satisfy her husband?\":", "Trump (successfully) ran against Hillary Clinton in the 2016 U.S. presidential election, and Hillary Clinton is the wife of two-term former U.S. President Bill Clinton. And the statement reproduced above is something Trump spread about Clinton, albeit in an unoriginal and indirect sense.", "On April 16, 2015, two months before officially launching his campaign for the 2016 Republican presidential nomination, Trump tweeted the \"If Hillary Clinton can't satisfy her husband what makes her think she can satisfy America?\" remark, which was presented as a quote of another Twitter user's words. Trump soon deleted his own tweet, but multiple sources captured images of it before he did:", "According to TPM, the crude remark that Trump greatly amplified by retweeting it originated with \"Sawyer Burmeister, a competitive equestrian who apologized for the 'political joke' before deleting it\":", "Thompson, Catherine.   \"Trump Lets His Followers Know ‘Hillary Clinton Can’t Satisfy Her Husband.’\"\r\n    TPM.   17 April 2015.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]