["Social activist Harsh Mander filed a petition in the Supreme Court seeking action against leaders of the Bharatiya Janata Party (BJP) for their hate speeches leading up to communal riots in Delhi. The top court, however, refused to hear the case until the matter of Mander’s alleged ‘derogatory’ comments against the judiciary is sorted.", "Akhilesh Mishra, former director of BJP government’s online citizen engagement initiative ‘MyGov India’, referred to the alleged comments in a tweet. Mishra shared the affidavit filed by DCP Delhi police (legal cell) against Harsh Mander in the Supreme Court. The plea, among other things, claimed that the social activist instigated violence. Mishra wrote, “The wheels of justice have started turning. All those who plotted to unleash violence on the “streets” and subvert India’s democracy will have to face justice.”", "The wheels of justice have started turning. All those who plotted to unleash violence on the “streets” and subvert India’s democracy will have to face justice.", "The preferred hit man of Sonia Gandhi since many years, Harsh Mander, will now face action. pic.twitter.com/OQ4RFt2mWC", "— Akhilesh Mishra (@amishra77) March 4, 2020", "[Also read: Akhilesh Mishra’s Bluekraft, propaganda pages and BJP link]", "BJP spokesperson Sambit Patra shared a part of the speech in question and wrote, “He is the real rioter who is instigating people to come out in the streets and carry out violence.”", "[Translated from: “ये है असल दंगाई जो लोगों को उसका रहें है सड़क पर उतर के हिंसा करने के लिए”]", "“सुप्रिम कोर्ट मानवता,समानता और Secularism की रक्षा नहीं करती ..इसलिए न Supreme Court में,न संसद में फ़ैसला होगा ..फ़ैसला सड़क पर होगा” सोनिया गांधी के NAC के सदस्य और UrbanNaxal हर्ष मंदर का कहना है। ये है असल दंगाई जो लोगों को उसका रहें है सड़क पर उतर के हिंसा करने के लिए। pic.twitter.com/ajTt4q8zNJ", "— Sambit Patra (@sambitswaraj) March 4, 2020", "In the video, Mander can be heard saying, “This fight will not be won in the Supreme Court. We have been observing the Supreme Court since some time now in the cases of NRC, Ayodhya and Kashmir. Supreme Court has failed to uphold humanism, equality and secularism. We will keep trying in the Supreme Court, it is our Supreme Court, but the decision will neither happen in the Parliament nor in the Supreme Court. What will be the future of this country – you all are the youth – what sort of country do you want to leave for your kids – where will this decision happen? One, it will happen on the streets, we have come out on the streets…” – before the clip is stopped mid-way.", "OpIndia penned an article on Mander’s speech that sparked controversy. The right-wing website wrote, “Watch: “Supreme Court did not save secularism in Ayodhya, so now time has come to hit the streets” Harsh Mander inciting mob violence”", "Watch: “Supreme Court did not save secularism in Ayodhya, so now time has come to hit the streets” Harsh Mander inciting mob violence https://t.co/hgnroDOfSs", "— OpIndia.com (@OpIndia_com) March 4, 2020", "Several others claimed that Mander instigated violence during protests against the Citizenship Amendment Act (CAA). BJP IT cell head Amit Malviya tweeted the clip and attributed the following words to Mander – “Now the decision will not be taken in the Parliament or the SC. SC did not protect secularism at the time of Ayodhya and Kashmir which is why the decision will now be taken on the streets.", "[Translated from: “अब फ़ैसला संसद या SC में नहीं होगा। SC ने अयोध्या और कश्मीर के मामले में secularism की रक्षा नहीं की। इसलिए फ़ैसला अब सड़कों पर होगा।”]", "अब फ़ैसला संसद या SC में नहीं होगा। SC ने अयोध्या और कश्मीर के मामले में secularism की रक्षा नहीं की। इसलिए फ़ैसला अब सड़कों पर होगा।", "This man Harsh Mander, who wrote the draconian CVB, is in HC to get FIRs against people for hate speech… And a judge gave him midnight hearing! pic.twitter.com/zrXYyBxfE3", "— Amit Malviya (@amitmalviya) March 4, 2020", "Based on Malviya’s tweet Free Press Journal wrote an article titled, “SC didn’t defend secularism, we have to take decisions on the streets: Activist Harsh Mander stirs controversy.” The BJP IT cell chief’s tweet was also featured in a Hindi report by Zee News and a Marathi report by Lokmat. Others associated with the BJP who shared the video were Haryana IT cell head Arun Yadav, Karnataka tourism minister CT Ravi and Rahul Kaushik who describes himself as a ‘swayamsevak’ on Twitter.", "Harsh Mander’s speech that stirred controversy was made on December 16, 2019, at Jamia Milia Islamia. The address focused on how every Indian has equal rights in the country. It was made after students were thrashed by Delhi police inside the university campus. At 3:40 minutes into the speech, Mander said, “Those who claim to take your rights away from you, in response to them, a wave of protests have started in the country, and these protests are to save our constitution, and the soul of the constitution which is love and friendship, and which is why we all are out on the streets and will continue to do so. This fight will not be won in the Parliament because political parties which call themselves secular have no moral courage left in them to fight. This fight will also not be won in the Supreme Court…”", "The above excerpt was said right before the part which is viral.", "“What will be the future of this country – you all are the youth – what sort of country do you want to leave for your kids – where will this decision happen? One, it will happen on the streets, we have come out on the streets, but even beyond the streets, there’s another place where this decision will take place. Which is the place in which this fight will eventually be decided? That is in our hearts, in my heart, in your heart, we have to give a response – if they want to fill our hearts with hate, if we respond with hate, hatred will become deeper” – was Mander’s statement, starting at 5:25 minutes, after his address was abruptly stopped in the viral clip.", "He continued to say, “If someone is attempting to bring darkness to the country, and we also do the same in order to fight, then the darkness will only become more severe. If there’s darkness, then the only way that can be fought is by lighting a lamp. And if there’s a huge storm, we will light a lamp against the darkness. The only answer we have to their hate is love. They will resort to violence, they will instigate us to indulge in violence but we will never carry out any violence. You must understand that it is their plan to instigate you towards violence so that when we commit 2% violence, they respond with 100%. We have learnt from Gandhi ji how to respond to violence and injustice. We will fight with non-violence. Anyone who instigates you toward violence or hatred, they are not your friends.”", "Quite evidently, Mander was not instigating violence but advocating for a non-violent approach to fight injustice. Karwan e Mohabbat also tweeted the relevant portion where the context of his speech hasn’t been distorted.", "“This is a fight for the soul of our Constitution – which is love and fraternity.” pic.twitter.com/lGut7ylgkp", "— Karwan e Mohabbat (@karwanemohabbat) March 4, 2020", "Therefore, a clipped video was presented by members of the BJP and amplified by certain media outlets to portray that Harsh Mander’s reference to “coming out in the streets” promoted violence. Contrary to claims, the social activist said that people need to come out to protect the soul of the Constitution, which was founded on the ideals of love. He also stated that people can only be won over by love, not hate and the only way to fight injustice is through non-violence.", "[Update: Sambit Patra’s tweet was added to this report on March 5, 2020.]", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]