["“Some Canadians have got together and called their life insurance companies to see if their life insurance would pay out if they died after taking ‘the new medicine,’” reads a March 8, 2021 Instagram post that indirectly references Covid-19 vaccines.", "“One company (Manulife) replied they would not pay out because ‘the new medicine’ is experimental,” claims a version of the post with nearly 2,000 likes from the account of Jason Christoff, a fitness club owner in Ontario, who has previously spread false health information on social media.", "The same claim was shared by Christoff on Facebook as well as by other users here and here.", "The claim appears to have originated with a Facebook post from a user named Tracey Wiggins that is no longer publicly available.", "Screenshots of her post have been shared since March 5, 2021 on Facebook and Instagram.", "Wiggins confirmed to AFP via Facebook Messenger that she changed the settings on the original post to “private so that people would stop harassing me.”", "She said her March 12 Facebook post was intended as an update about the situation after she received “rude” comments on her original message.", "In the post, she stands by her assertion that a Manulife agent she spoke to on February 26 told her “that this vaccine is experimental, and my life policy would be void if I died from complications,” but also included documents she said the company sent her that refute the claim.", "Manulife also told AFP the social media claims are “false.”", "It posted a statement on its website that says: “Getting vaccinated for Covid-19 does not negatively affect your or your plan members’ existing life insurance or valid Group Benefits coverage with us in any way.", "“Additionally, getting a Covid-19 vaccine doesn’t impact a customer’s ability to get new life and health insurance coverage with Manulife.”", "The Canadian Life and Health Insurance Association has also addressed the inaccurate information via Twitter as well as in an online statement that said the claim has “no basis in fact whatsoever.”", "“Canada’s life and health insurers stress that vaccination is one of the most effective ways to protect yourself and others from serious illness and death from Covid-19. Receiving the vaccine will not affect your individual or workplace life or health insurance benefits, or ability to apply for future coverage,” said the association, which aims to promote consistent standards and practices for the industry.", "This claim also circulated in French and was debunked by AFP Factuel.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]