["By Eugene Kiely", "Posted on August 21, 2019", "Democratic presidential candidate Beto O’Rourke said workers living in the U.S. illegally who were swept up in immigration raids at chicken processing plants in Mississippi are “doing a job that no one else will do.” The jobs are hard and don’t pay well, but — at least at one of the plants that was raided — they are in demand.", "Dianne Bell, a spokeswoman for the Mississippi Department of Employment Security, told us that 349 people used the agency over a three-day period after the raids to apply for approximately 240 job openings at Koch Foods. A chicken processing plant in Morton, Mississippi, owned by Koch Foods was among those raided by U.S. Immigration and Customs Enforcement agents.", "On Aug. 7, ICE agents raided seven chicken processing plants in Mississippi. Its agents detained about 680 “removable aliens,” according to an ICE press release that contained affidavits used to obtain search warrants", "According to the affidavits, Peco Foods chicken processing plants in Bay Springs, Canton and Walnut Grove and a Koch Foods plant in Morton were raided. A PH Food plant, also in Morton, a Pearl River Foods plant in Carthage and an A&B Inc. plant in Pelahatchie were also targeted in the raid.", "O’Rourke visited the Peco Foods chicken processing plant in Canton on Aug. 16, and later addressed the issue of the ICE raids during an appearance on NBC’s “Meet the Press.”", "A former congressman who represented the El Paso, Texas, area, O’Rourke spoke about “the real consequence and cost of Donald Trump” that he saw in the aftermath of the mass shooting in El Paso and the ICE raids in Mississippi.", "O’Rourke, Aug. 18: I saw it again yesterday, in Mississippi, in Canton, in a community where nearly 700 people working in chicken processing plants, one of the toughest jobs in America, were raided, detained, taken from their kids, humiliated, hogtied, for the crime of being in this country, doing a job that no one else will do.", "O’Rourke is correct that jobs in chicken processing plants are not easy. They do not pay well, and they can be dangerous. But there’s evidence that the jobs are also in demand — and not just by those living in the U.S. illegally.", "We’ll first look at the job hazards and the low pay.", "“There are many serious safety and health hazards in the poultry processing industry,” the federal Occupational Safety and Health Administration explains on its website. “These hazards include exposure to high noise levels, dangerous equipment, slippery floors, musculoskeletal disorders, and hazardous chemicals.”", "They also don’t pay well, according to a 2016 report by the Government Accountability Office.", "Citing Bureau of Labor Statistics data, the GAO said that “the meat and poultry industry had an hourly mean wage of $12.50 per hour in 2014 and an annual mean wage of $26,010.” That’s barely above 2014 federal poverty guidelines for a family of four, GAO noted.", "As of May 2018, the mean wage wasn’t much higher at $13.68 per hour, according to BLS.", "The jobs are disproportionately held by foreign-born, including undocumented, workers, and traditionally the industry “has been a starting point for new immigrants,” the GAO report said. “About 28.7 percent of meat and poultry workers were foreign-born noncitizens in 2015 compared to about 9.5 percent of all manufacturing workers, according to CPS data,” the GAO report said, referring to the Bureau of Labor Statistics’ Current Population Survey.", "But that means that about 71 percent of meat and poultry workers are U.S. citizens.", "Also, an industry spokesman made the point that chicken processing plants provide some of the higher paying jobs in the areas where they are located.", "“Our industry offers wages that are competitive, are often the highest paying entry level jobs in the communities in which they operate and offer competitive and affordable medical, dental and vision benefits as well as retirement savings plans,” Tom Super, a spokesman for the National Chicken Council, told us in an email.", "On the day of the raid, Koch Foods contacted the Mississippi Department of Employment Security and sought help in filling approximately 240 jobs at the Morton plant, the agency’s spokeswoman told us. Bell said the state agency registered 242 applicants for Koch Foods after a job fair on Aug. 12, and another 107 applicants registered on Aug. 13 and 14 through the Forest WIN Job Center in Forest, Mississippi.", "In total, at least 349 people registered for approximately 240 jobs, Bell said. “Please bear in mind that these numbers represent the applicants that MDES Staff assisted,” she told us. “These numbers do not include self-served customers who did not use our staff to apply, but did use our computers.”", "Bell did not have data for other employers who were targeted in the ICE raids.", "The United Food and Commercial Workers labor union represents workers at one of the Peco Foods and the Koch Foods plants that were raided, but we were unable to reach a union representative regarding the demand for jobs at those locations.", "O’Rourke’s campaign provided us with news articles and think-tank reports about immigrants who are living and working in the U.S. legally and illegally. These reports said certain industries — farming and construction, in particular — rely heavily on immigrant labor, and that immigrants do not significantly affect the employment levels or wages of most native-born workers.", "Vanda Felbab-Brown, a senior fellow at the Brookings Institution, writes that “undocumented workers often work the unpleasant, back–breaking jobs that native–born workers are not willing to do. Sectors with large numbers of undocumented workers include agriculture, construction, manufacturing, hospitality services, and seafood processing.”", "That may be, but O’Rourke said those working in the chicken processing plants raided by ICE are “doing a job that no one else will do,” and there is evidence to the contrary.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]