["About this rating", "On 10 January 2016, the web site The Lapine published an article reporting that a 79-year-old birdwatcher had a physical confrontation with an armed militant at the Malheur National Wildlife Refuge in Oregon:", "Grandfather of four Robert Saunders says he was just out to check on some young burrowing owls at the crack of dawn this morning when he was confronted by a \"red-faced pudgy man with a big gun\".", "And things got physical when Saunders refused the barked orders to halt and identify himself. But it wasn't the retired teacher who ended up on the ground ...", "An FBI spokesperson at the entrance to the refuge told reporters that this is the first reported instance of any conflict between the occupying militant group and locals but warned that things could escalate quickly as other armed militants continue to arrive by the truckload.", "\"We're hoping this is an isolated incident and we're asking the elderly not to knock any more militants on their ass,\" said the grinning FBI agent.", "However, the above-quoted story is merely a bit of humorous fiction from the The Lapine, a satirical web site:", "The Lapine is all about poking people and things that deserve to be poked. It is satirical commentary written by all kinds of people from here, there and darned near everywhere.", "We're just two people who believe that satire can be very effective in pointing out that the emperor is buck naked.", "No Lapine content is intended to hurt even the most delicate of feelings ... but it's bound to happen. Get over it. But if you have concerns, let us know. Did we mention that The Lapine is satire?", "While this particular story is a spoof, a bird watcher in Oregon did write a strongly worded letter to the armed militants who took over the Malheur National Wildlife Refuge:", "Just a friendly warning from the birding and wildlife photography community to the Oregon terrorists. We are watching your every move, and we have been watching you for a long time. And yes absolutely you are domestic terrorists of the worst kind, and the truth about your decades of constant poaching of protected wildlife around Malheur and other wildlife refuges, national parks, national forests and BLM lands has been well-documented.", "As of 14 January 2016, however, the tension between birdwatchers and the anti-government ranchers at the Malheur National Wildlife Refuge has not boiled over into a physical altercation.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]