["State Sen. Joe Morrissey says all the vandalism that’s hit downtown Richmond during the past four weeks of protest can be traced to \"horrible\" leadership by Mayor Levar Stoney.", "Morrissey, D-Richmond, lost to Stoney, also a Democrat, in the 2016 mayoral election. On June 18, Morrissey appeared on the conservative John Fredericks radio show and blamed Stoney for creating friction between the city police department and demonstrators protesting the death of George Floyd underneath a policeman’s knee in Minneapolis.", "Another guest on the radio show, Republican strategist Martha Boneta, said she had stayed in a downtown Richmond hotel the previous night and heard horns, yelling and fireworks or gunshots that reminded her of being on Israel’s contentious Gaza Strip. \"This morning, we drove through Richmond,\" she said. \"I hadn’t been here in quite some time and I was amazed to see just the F-word written everywhere, all the graffiti on the walls, things boarded up.\"", "Morrissey said, replied, \"This all started two weeks ago when Mayor Stoney’s police gassed - tear gassed - a peaceful crowd of protestors, moms and children, at 7:30 p.m. sharp.\"", "Morrissey is referring to a June 1 occurrence at the Robert E. Lee statue on Monument Avenue. While the tear-gassing provoked outrage and an apology from Stoney, Morrissey is wrong in saying that recent protest vandalism and graffiti were \"all started\" by the incident. It started three days earlier.", "Timeline", "Floyd, a black man, died on May 25. Richmond, like many cities, was calm for several days.", "The first flash point Richmond came on Friday night, May 29, and carried early into next morning. A patrol car was set on fire outside police headquarters, a Pulse bus was torched and windows were shattered in several downtown buildings. Police sprayed a caustic substance at demonstrators, according to news accounts, and some protesters hurled water bottles and other objects at the police.", "At night on May 30, protesters set fire to the United Daughters of the Confederacy headquarters on Arthur Ashe Boulevard. They sprayed graffiti on the Confederate statues on Monument Ave., including the Lee Statue. Dumpsters were set on fire, windows were shattered on Broad St. and some businesses were looted. Police in riot gear sprayed tear gas at demonstrators.", "An 8 p.m. curfew went into effect May 31 and helped bring a quieter night of protest. The Richmond Times-Dispatch reported police \"used tear gas and pepper spray on demonstrators, who started marching downtown from the defaced Robert E. Lee statue on Monument Avenue shortly after the curfew took effect.\"", "On June 1, several hundred peaceful demonstrators were assembled by the Lee statue when, shortly before curfew, Richmond police lined up and tear gassed the crowd. Video shows the base of the statue had been sprayed with graffiti before the assault, again, disproving Morrissey’s claim that protest vandalism \"all started\" in response to the incident.", "The police department apologized for its action a few hours later, as did Stoney the next day before an estimated 1,000 protesters outside City Hall. On June 15, Stoney forced the resignation of Police Chief William Smith.", "Morrissey’s Response", "Morrissey acknowledged to us that there had been rioting before the Lee statue incident, and said Richmond police - under Stoney’s purview - exacerbated it with aggressive actions.", "He said the Lee statue tear gassing further incensed protesters and noted that Richmond has seen demonstrations every night after the incident.", "As for his statement of the John Fredericks show, Morrissey said, \"I stand by it, 100%.\"", "Our ruling", "Morrissey says Richmond vandalism in protest of George Floyd’s death \"all started\" when Richmond police tear gassed a peaceful demonstrators at the Lee statue on June 1. He stressed that the police fall under Mayor Stoney - a political rival who’s facing reelection this year.", "The demonstrations may bring the removal of Confederate monuments and other changes to Richmond, so it’s important to keep the record straight.", "The defacing of Richmond’s confederate statues began May 30. The monuments were already marked with graffiti when the police sprayed the Lee protesters on June 1. And buildings had been broken into, windows smashed and small fires were set several days before the Lee statue incident.", "We rate Morrissey’s statement False.", "Joe Morrissey, Comments on The John Fredericks Show, June 18, 2020 (2:55 mark).", "Interview with Morrissey, June 22, 2020.", "Martha Boneta, Comments on The John Fredericks Show, June 18, 2020 (1:20 mark).", "Virginia Mercury, \"Confederate memorial hall burned as second night of outrage erupts in Richmond,\" May 31, 2020.", "Richmond Times-Dispatch, \"Update: Approximately 2 dozen demonstrators detained after 9 p.m. Sunday night in Richmond,\" May 31, 2020.", "YouTube, Lee Circle tear gassing video, June 1, 2020.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]