["In 2018, the New York Times called attacks on the state of California a \"red-meat rallying cry for national Republicans.\"", "Now, some are reprising that criticism against Democratic vice-presidential candidate Sen. Kamala Harris, who hails from the Golden State.", "A user posted a quote to Facebook that purported to be from Harris that read, \"California is a model of what the country should be.\"", "\"No comment needed,'' the user, who did not respond to a request from USA TODAY for comment, captioned the post, which has been shared over a thousand times.", "Fact check:True claim about Harris failing bar exam on first try and Barrett's law school rank", "The quote in the post is inaccurate.", "There is no record that Harris ever said \"California is a model of what the country should be.\"", "However, at the vice-presidential debate on Oct. 7, Harris called her work on criminal justice reform in the state a \"model\" for the nation.", "\"First of all, having served as the Attorney General of the State of California, the work that I did is a model of what our nation needs to do and we will be able to do under a Joe Biden presidency,\" she said, according to USA TODAY.", "She listed reforms — like a ban on chokeholds and carotid holds — that she and Biden hope to implement in the future, and took credit for reforms in California in the past.", "\"I was the first statewide officer to institute a requirement that my agents would wear body cameras and keep them on full time,\" she said. \"We were the first to initiate a requirement that there would be a training for law enforcement on implicit bias.\"", "\"We did the work of instituting reforms that were about investing in reentry. This is the work that we have done and the work we will do going forward,\" Harris added.", "Though Harris hasn't said that California is a model for the nation in other sectors, analysis from CalMatters noted that \"many of the major policies that former Vice President Joe Biden is proposing are already in place\" in California, at least \"to some degree.\"", "Those include a $15 minimum wage, legalizing marijuana, eliminating cash bail, banning assault weapons, and making some college tuition-free.", "Fact check:In 1973, Biden said 'the two-party system' was 'good for the negro'", "Based on our research, the claim that Sen. Kamala Harris said \"California is a model of what the country should be\" is FALSE. In reality, she said that her work on criminal justice reform as the state's attorney general is \"a model of what our nation needs to do.\"", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]