["About this rating", "On Jan. 29, 2021, artist and product designer Danielle Baskin tweeted an image of two homes with a verified check mark crest on their exterior and a link to the website bluecheckhomes.com. \"You can now get a Verified Badge crest on your Bay Area home if you're an influencer, public figure, or represent a brand,\" she wrote in a tweet that subsequently went viral:", "The tweet is a joke, and the image used in the tweet is photoshopped. The idea came to Baskin after a Twitter exchange about the meaning of various crests seen on San Francisco homes. The website Blue Check Homes makes this abundantly clear:", "For context, I'm an artist who makes random internet jokes that sometimes pokes fun of \"let's turn this into a service\" culture, internet vanity culture, and terrible capitalist ideas. Historically, decorative crests found on Victorian homes were a mark to signal wealth and importance and I thought it would be dumb if that concept also existed today. But if it existed today, would you need to be verified by a third party to signal status? Here's the origin of the joke.", "Yes, I ALSO THINK THE IDEA OF VERIFIED BLUE HOUSE BADGES IS DUMB. I also love to fabricate funny shitposts on a Friday night, but my medium is writing satirical copy for landing pages and creating product launches. ...", "If you thought this was a full-fledged service, please investigate the things you read on the internet! And if you're an artist making jokes on the internet, we should consider adding disclaimers like this, because not everyone understands your commentary and will share your jokes as fact.", "Because the website advertised in Baskin's tweet is disclaimed satire, we rank the assertion that one can order blue check crests for Bay Area homes \"Labeled Satire.\"", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]