["About this rating", "On 23 February 2017, the Twitter account \"OMFG News\" published a video purportedly featuring CNN anchor Jake Tapper using racial slurs in a \"disturbing tirade\":", "BREAKING: Disturbing, racist tirade released at #CPAC2017 has been identified as CNN's @JakeTapper. #CNNLeaks pic.twitter.com/nKia7E8ivc", "— OMFG NEWS (@OMFGNN) February 23, 2017", "None of this is true, except that this is an audio recording, and it does feature many racial slurs.\"OMFG News\" took a picture of the CNN anchor and shared it along with the audio, which was originally taken in 2007, and features the voice of former reality show character Dog the Bounty Hunter:", "“I don't care if she's a Mexican, a whore or whatever. It's not because she's black, it's because we use the word n***er sometimes here. I'm not gonna take a chance ever in life of losing everything I've worked for for 30 years because some fucking n***er heard us say n***er and turned us in to the Enquirer magazine. Our career is over! I'm not taking that chance at all! Never in life! Never! Never! If Lyssa [Dog's daughter] was dating a n***er, we would all say 'fuck you!' And you know that. If Lyssa brought a black guy home ya da da... it's not that they're black, it's none of that. It's that we use the word n***er. We don't mean you fucking scum n***er without a soul. We don't mean that shit. But America would think we mean that. And we're not taking a chance on losing everything we got over a racial slur because our son goes with a girl like that. I can't do that Tucker. You can't expect Gary, Bonnie, Cecily, all them young kids to [garbled] because 'I'm in love for 7 months' - fuck that! So, I'll help you get another job but you can not work here unless you break up with her and she's out of your life. I can't handle that shit. I got 'em in the parking lot trying to record us. I got that girl saying she's gonna wear a recorder…”", "Tapper took to Twitter and confirmed that he was not the one speaking in this audio recording:", "Freedom of Speech = this person can take Dog the Bounty Hunter's words, lie and say it's me, and some folks are dumb enough to believe it. https://t.co/qC4lYARjKr", "— Jake Tapper (@jaketapper) February 23, 2017", "This is far from the first time that an unrelated piece of audio has been used in an attempt to smear a public personality. Two audio recordings were shared during the 2016 presidential election, each purportedly capturing Sen. Tim Kaine using vile language. Neither of the recordings featured the Vice Presidential candidate, however; one of the recordings featured the voice of Mel Gibson, while the other was an audio recording of Alec Baldwin.", "Larry King Live.   \"Dog's\" Reputation: How Badly Hurt?\"\r\n7 November 2007.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]