["About this rating", "Prescott College introduced a \"Freedom Education Fund\" (created and supported by students) to provide a scholarship for one student ineligible for financial aid or grants.", "Prescott College students are required to contribute $30 each to the fund.", "In early April 2016, multiple news outlets reported that Prescott College in Arizona was imposing a $30 fee on all students to fund scholarships for undocumented immigrants:", "A new, mandatory fee at an Arizona college will pay for a scholarship for undocumented immigrants.", "The $30 fee at Prescott College will be required this fall for all students attending class on its campus about 100 miles northwest of Phoenix.", "Many articles omitted that this initiative was implemented at the behest of its students, and that they could opt out of it at any time.", "At least 50,000 undocumented people graduate from high school in the United States every year.  Many go on to college, but are unable to legally work or receive federal assistance, such as grants and subsidized loans.  However, they can receive college (and in some cases state) funds.", "Prescott College says it is the first four-year college in Arizona to implement an initiative to use student fees to help provide financial assistance for students without documentation, and only the second in the country to do so (the first was Chicago's Loyola University):", "Prescott College is proud to announce the availability of this scholarship to one undocumented student as part of National Institution’s Coming Out Day in support of undocumented students, an annual event hosted by United We Dream.", "“Within the current political landscape of Arizona it is critical that Prescott College shows our commitment to education as a human right,” says Miriel Manning, founder of the Freedom Education Fund.", "Manning, a Prescott College student, started the Freedom Education Fund as her senior project specifically to raise money for students without documentation:", "...[T]his is now a collaboration between students organizers, Prescott College, the Social Justice Human Rights Masters Program, and community partners.", "However, Prescott College students are able to opt out of the fee each semester if they choose to do so. Manning told us:", "The fee will go onto tuition bills for on-campus students, and if a student reaches out and asks for a way to opt out, then they can. Because students overwhelmingly supported this and want to pay it, I don't expect many, if any, to do this.", "Erickson, Jon.    \"New Prescott College Fee Will Fund Undocumented Student Scholarship.\"\r\n    KNXV-TV [Phoenix].    4 April 2016.", "King, Jamilah.    \"Arizona's Prescott College Just Made It Easier for Undocumented Students to Earn Degrees.\"\r\n      Mic.     7 April 2016.", "Zimmerman, Malia.     \"Arizona College Imposes Fee to Fund Scholarship for Illegal Immigrants.\"\r\n      FoxNews.com.     6 April 2016.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]