["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "On Feb. 5, 2012, former Rep. Pete Hoekstra -- a Republican seeking to unseat Sen. Debbie Stabenow, D-Mich. -- released an ad titled \"Debbie-Spend-It-Now.\" The ad quickly attracted public attention for its use of a young Asian woman thanking Americans, in broken English, for helping to boost the Chinese economy.\n\nThe ad directed viewers to a website that provided additional statistical details. One of the claims on the site is that \"since ObamaCare and the stimulus passed, the unemployment rate in the U.S. has increased.\"\n\nWe decided to see whether that claim was correct.\n\nThe stimulus was the first of the two bills to be signed into law -- on Feb. 17, 2009. That month, the national unemployment rate stood at 8.3 percent.\n\nMeanwhile, the health care law was signed on March 23, 2010. During that month, the national unemployment rate was 9.8 percent.\n\nAnd in the most recent month for which figures are available -- January 2012 -- the unemployment rate stood at 8.3 percent.\n\nSo, since enactment of the stimulus three years ago, the unemployment rate has -- after a rise and then a decline -- remained at exactly the same rate. And since the health care legislation was passed, it has fallen by 1.5 percentage points.\n\nWe should note some fine print. The source for the claim on the website is \"Bureau of Labor Statistics, Accessed 1/23/2012\" -- a time before the latest decline in the unemployment rate. The rate on that date was 8.5 percent, but it dropped to 8.3 percent by the time the ad aired on Super Bowl weekend. Using the December figure makes the comparison for the stimulus correct, though the comparison for the health care law still would have been incorrect. Either way, though, it’s not the current figure.\n\nOur ruling\n\nNeither time span offered in Hoekstra’s website checks out, based on the unemployment rate on the day the ad first aired. One shows that the unemployment rate is the same now as it was when the stimulus passed (although it went up in the interim). The other shows that the rate has fallen since the health care law passed. We rate the statement False.", "EDITOR’S NOTE: After we published this story, a reader asked us to evaluate Hoekstra’s claim from the perspective of Michigan, where he’s running for Senate. So we did. In February 2009, when the stimulus was signed, unemployment in Michigan was 12.0 percent. In March 2010, when the health care bill was signed, the rate was 13.3 percent. In December 2011 -- the most recent month available -- the rate was 9.3 percent. So the declines in unemployment over both time spans were actually steeper in Michigan than they were nationally. We are keeping our rating at False.", "Pete Hoekstra, \"Debbie-Spend-It-Now\" (ad and related website), Feb. 5, 2012\n\nBureau of Labor Statistics, \"Labor Force Statistics including the National Unemployment Rate (Current Population Survey - CPS),\" accessed Feb. 6, 2012\n\nAmerican Recovery and Reinvestment Act, signed Feb. 17, 2009\n\nPatient Protection and Affordable Care Act, signed March 23, 2010", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]