["About this rating", "Many of us fondly recall the rhyming ditties we learned as children, such as \"Jack Be Nimble\" and \"The Farmer in the Dell.\" But how many of us realize that several of our most fondly-recalled nursery rhymes (e.g., \"A Tisket, A Tasket\" and \"Little Jack Horner\") were not mere nonsense songs, but actually originated as coded references to such dark events as plagues and religious persecution? Such was the case with another childhood favorite, \"Sing a Song of Sixpence.\"", "For those unfamiliar with this ditty, let's start by offering its lyrics:", "Sing a song of sixpence\nA pocket full of rye\nFour and twenty blackbirds\nBaked in a pie", "When the pie was opened\nThe birds began to sing\nWas that not a tasty dish\nTo set before a king?", "The King was in his counting house\nCounting out his money\nThe Queen was in the parlor\nEating bread and honey", "The Maid was in the garden\nHanging out the clothes\nWhen down came a blackbird\nAnd snapped off her nose!", "The surprising truth is that this innocent little rhyme, which dates from the early 1700s, actually represents a coded message used to recruit crew members for pirate vessels!", "Pirates (or corsairs, privateers whose activities were sanctioned by letters of marque from a sovereign) did not spend all their time at sea: they cruised the waters in areas such as the Mediterranean, the Spanish Main, or the Atlantic coast of North America, looking for prizes, and they returned to port when the need for supplies or repairs demanded it. Upon reaching port, the ship's captain paid off the crew (primarily by dividing the spoils of whatever they had captured), and the crew members then dispersed ashore (usually to spend all their pay on alcohol and prostitutes as quickly as possible). Some crewmen tended to stay in the vicinity, but others left for other regions, caught on with other ships, died, were killed, or simply disappeared. Thus, much like the captains of naval vessels and merchant traders, the captains of pirate ships needed to recruit new crew members whenever they embarked on yet another venture. Since piracy (as opposed to privateering) was against the law, pirates devised codes that could be used to advertise for crew members without openly revealing their illegal affiliations.", "The nursery rhyme \"Six a Song of Sixpence\" was a coded message that evolved over several years' times and was used by confederates of the notorious pirate Blackbeard to recruit crew members for his prize-hunting expeditions. Like many other messages passed down to us over hundreds of years by oral tradition, there is no one \"official\" version, nor is there a \"correct\" interpretation for any particular variant. In general, however, the most common form of this rhyme bore these veiled meanings:", "Sing a song of sixpence / A pocket full of rye", "Blackbeard's standard payment of sixpence a day was considered good money in the 1700s, especially since most pirate vessels did not pay a salary: the crew only received a share of the spoils if they were\nsuccessful in capturing prizes (and many a pirate ship had to return to port empty-handed after spending several fruitless months at sea). As well, his crew was promised a pocket (a leather bag somewhat like an early canteen which held about a liter) full of rye (whiskey) per day. Not bad, considering that alcohol was the average sailor's raison d'etre.", "Four and twenty blackbirds / Baked in a pie", "As Henry Betts points out in his book on the origins and history of nursery rhymes, \"It was a favourite trick in the sixteenth century to conceal all sorts of surprises in a pie.\" Buccaneers, too, were fond of surprises, and one of Blackbeard's favorite ruses to lure a ship within boarding range was to make his own vessel (or crew) appear to be in distress, typically by pretending to have been dismasted in a storm or to have sprung a leak below the waterline. Passing ships — both honest sailors wanting to help and other pirates looking for an easy catch — would sail in close to offer assistance, whereupon a crew of two dozen heavily-armed seamen dressed in black would board the other vessel (via a boat in darkness or fog, or by simply jumping into the other ship when it came alongside if no other means of surprise attack was possible) to quickly kill or disable as many crew members as possible. Thus the four and twenty \"blackbirds\" (i.e., Blackbeard's crewmen) \"baked in a pie\" (i.e., concealed in anticipation of springing a trap).", "When the pie was opened / The birds began to sing", "This follows from the previous line. Once the victim's ship was lured in for the kill, the \"blackbirds\" came out of hiding and attacked with a fearsome din.", "Was that not a tasty dish / To set before a king?", "This line is commonly misinterpreted. The King is not a reference to any real king, but rather to Blackbeard himself, the king of pirates. And the tasty dish is the plundered ship that was so easily captured.", "The King was in his counting house / Counting out his money", "Again, the King is Blackbeard (no real king would take on such a mean task as counting money). This line of the message signals that Blackbeard had the cash on hand to pay a crew on salary rather than strictly on divided spoils.", "The Queen was in the parlor / Eating bread and honey", "Blackbeard's main vessel was a French merchant ship named \"Le Concorde de Nantes\" that was jointly captured by Blackbeard and Captain Hornigold in the Grenadines in November of 1717. Upon his retirement from pirating, Hornigold presented the ship to Blackbeard, who renamed it \"The Queen Anne's Revenge\". Thus the \"Queen\" referred to here is Blackbeard's ship, and \"eating bread and honey\" meant that it was in port taking on supplies in preparation for a cruise.", "The Maid was in the garden / Hanging out the clothes", "The use of the word \"maid\" indicated that the location/route of one or more prize ships was known, and they were going to be specific targets of the upcoming cruise (this greatly enhancing the probability of the crew's collecting prize money). The waters around the Carolinas down to the Caribbean were referred to as the garden, as this was an area where pirates would often cruise for easy pickings. \"Hanging out the clothes\" meant the targeted ship was already at sea or just about to leave port (thus its sails — or \"clothes\" — have been hung).", "When down came a blackbird / And snapped off her nose!", "There is some scholarly debate in literary and maritime circles as to whether the last part was originally \"and snapped off her nose\" or \"and snapped off a rose.\" Either way, the passage is taken to be a Blackbeard's bragging about his plans to swoop in and have his way with the targeted ship.", "So, next time you hear this innocent children's song, remember that it was originally recited in taverns by drunken, bloodthirsty buccaneers as a code to recruit other pirates for their next murderous voyage!", "Additional information:", "Blackbeard's Ship", "More information about this page", "Bett, Henry.   Nursery Rhymes and Tales: Their Origin and History.\r\n    Boston: Folcroft Press, 1924.", "Cordingly, David.   Under the Black Flag.\r\n    New York: Random House, 1995.   ISBN 0-679-42560-8.", "Doss, Paul.   Pirates, Trolls, and Other Villains of the Nursery.\r\n    Chicago: SLC Publishing, 1955   (pp. 88-92).", "King, Dean.   A Sea of Words.\r\n    New York: Henry Holt, 1995.   ISBN 0-8050-3816-7.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]