["This Facebook post, published in April 2013, has been shared more than 320,000 times.", "Part of the lengthy caption reads: \"It is nice to have a cup of cold drink after a meal. However, the cold water will solidify the oily stuff that you have just consumed.\n\n\t“It will slow down the digestion. Once this 'sludge' reacts with the acid, it will break down and be absorbed by the intestine faster than the solid food. It will line the intestine.\n\n\t“Very soon, this will turn into fats and lead to cancer. It is best to drink hot soup or warm water after a meal.\"", "Below is a screenshot of the post:", "Similar claims have been shared hundreds of thousands of times here and here on Facebook.", "The claim is false; multiple cancer experts told AFP there is no scientific proof to support the claim; the claim has circulated online for over a decade and has been repeatedly debunked by independent fact checkers.", "Professor Sanchia Aranda, CEO of Cancer Council Australia, emailed a statement to AFP on August 7, 2019, which reads, in part:", "“There is no evidence to support the claim that drinking cold water will lead to the development of cancer. When cold beverages are consumed, the liquid quickly warms to body temperature and has no adverse effect on the way the body digests food.”", "An American Cancer Society spokesperson also told AFP via email on August 16 that they knew of “no credible evidence to support the claim.”", "The false claim has circulated online for at least over a decade, such as here, here and here on Facebook in 2008 and 2010.", "Fact-check website Snopes also debunked the claim in this 2006 report.", "AFP Fact Check has previously debunked claims that drinking warm water can cure all types of cancer.", "A public health official told AFP in this fact check report that water “doesn’t have the power to cure illnesses,” nor is it harmful either.", "“Water is vital for life, but of course it doesn’t have the power to cure illnesses,” said Bruno Falissard, director of the Centre for Research in Epidemiology and Population Health at French research institute Inserm and public health professor at Paris-Saclay university.", "“It doesn’t matter if water is hot or cold. It isn’t a cure and it isn’t harmful either. The body can tolerate water between 0 and 40 degrees,” he told AFP.", "In a similar claim debunked by AFP, a misleading post claimed that: \"Research proves that drinking iced water during menstruation can cause menstrual blood to clot and remain in the uterine lining (which) after 5-10 years can cause womb cancer or tumours.”", "Gynecologist Kiyoshi Macotela Nakagaki said that there was \"no link between consuming coconut water or iced water and this type of disease -- neither cancer nor infertility.\"", "\"This claim has no scientific basis,\" Kiyoshi Macotela Nakagaki said.", "AFP has also debunked claims that drinking hot water, eating a no sugar diet, and eating coconut oil will cure cancer.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]