["About this rating", "In another seeming attempt to discredit mass school shooting survivor Emma González, the outspoken teenaged gun control advocate, a widely shared meme fixated on a patch that was sewn on the shoulder of the jacket she wore during her speech at the March for Our Lives really in Washington, D.C., on 24 March 2018:", "González, who has been at the forefront of a new wave of gun safety activism spurred by the shooting attack at Marjory Stoneman Douglas High School that left seventeen people dead on 14 February 2018, has not ever identified as a \"communist\" nor expressed an affinity for the regime of the Castro brothers. However, she has been open about her Cuban heritage, stating in an op-ed piece she penned for Harper's Bazaar magazine that:", "I'm 18 years old, Cuban and bisexual. I'm so indecisive that I can't pick a favorite color, and I'm allergic to 12 things. I draw, paint, crochet, sew, embroider—anything productive I can do with my hands while watching Netflix.", "But none of this matters anymore.", "What matters is that the majority of American people have become complacent in a senseless injustice that occurs all around them.", "González was not born in Cuba, but her father is a native-born Cuban who immigrated from that island country to New York City in 1968 and now works in the U.S. as an attorney for a cybersecurity company.", "González had rejected the notion that she wants to \"disarm\" every American, stating that \"At the end of the day, we don't want people to have their guns taken away. We just want the people to be more responsible. We want civilians to have to go through more rolls of red tape to get what they want, because if any of that tape can stop those who shouldn't own a gun from owning a gun, then our government will have done something right.\"", "Other memes have also falsely presented González as having ripped up a copy of the U.S. Constitution. Leslie Gibson, a Republican candidate for Maine's state House, derisively called her a \"skinhead lesbian\" before abandoning his candidacy amidst backlash over his remarks.", "The attacks against González fall in line with efforts by far-right blogs to paint another shooting survivor, David Hogg, as a pawn of the \"deep state.\"", "González, Emma.   \"Parkland Student Emma González Opens Up About Her Fight for Gun Control.\"\r\n    Harper's Bazaar.   26 February 2018.", "Univisión.   \"Emma Gonzalez: La Súbita Nueva Estrella del Movimiento Antiarmas Es una Adolescente de 18 Años de Origen Cubano.\"\r\n    17 February 2018.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]