["About this rating", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "In March 2020, when \"social distancing\" was the norm for dealing with the COVID-19 coronavirus disease pandemic, social media users began sharing -- and questioning -- photographs said to show boxes marked on an open air Las Vegas parking lot to indicate where homeless persons could sleep while maintaining proper social distance from each other:", "Many viewers considered such pictures unbelievable (or heartless), especially given the large amount of vacant hotel rooms available in the city due to the cessation of nearly all tourist activities during the pandemic:", "These photographs were real, however. On March 28, the City of Las Vegas and Clark County issued a joint news release in which they announced the creation of a temporary homeless shelter in the parking lot of the Cashman Center multi-use facility. That announcement was prompted by the temporary closure of an existing area homeless shelter after a homeless man who had used their services tested positive for the coronavirus:", "Due to the closure of Catholic Charities, the city of Las Vegas, Clark County and area homeless providers are setting up a temporary shelter for the homeless on the upper parking lot of the Cashman Center. The location will begin tonight and run until April 3. It is anticipated that the Catholic Charities homeless shelter in the Corridor of Hope will reopen in the meantime.", "This past week the Southern Nevada Health District announced that a homeless man tested positive for the Coronavirus (COVID-19). As a result, the shelter run by Catholic Charities closed temporarily. This meant about 500 individuals would have no overnight shelter. The county and city worked together to expand the Homeless Courtyard to accommodate the homeless along Foremaster Lane, and will do an additional expansion onto the Cashman site to allow for greater social distancing.", "The temporary shelter at Cashman will operate from 6:00 p.m. to 8:00 a.m. It will be for homeless individuals who are able to walk to the site from the Courtyard. Those with fragile health or mobility problems will still be accommodated at the Courtyard.", "“This is an excellent example of the city, county and homeless providers coming together to help slow the spread of COVID-19,” said Ward 5 City Councilman Cedric Crear, who represents the area. “I want to thank the staff and volunteers who are making this happen during difficult times.”", "The city is reserving the building spaces at Cashman Center for potential hospital overflow should the community require it.", "As NBC News reported, the bare concrete surface of the parking lot was used due to concerns about the use of carpeting and the unavailability of easily disinfected mats, another aspect of the situation that drove criticism:", "The lot initially included carpeting, but officials later ditched it over concerns that it could help spread the virus, [city communications director David] Riggleman said in an email. When mats that could easily be disinfected weren't available, hundreds of 6-foot squares were painted onto the asphalt and surrounded by metal barricades — a grid meant to prevent more cases of the disease through social distancing measures, he said.", "[A]fter images of people on the ground with little more than a sheet and a blanket were published, observers pointed out — among other things — that thousands of Las Vegas hotel rooms were sitting empty because of a statewide, monthlong coronavirus ordinance.", "Riggleman said two local facilities — a Salvation Army-run overnight shelter and a city-run \"courtyard\" that offers homeless services — could have accommodated those who otherwise would have stayed at Catholic Charities. But concerns over social distancing led officials to \"very quickly\" set up the shelter at the 55-acre Cashman Field site, which includes a shuttered convention center.", "\"It'll be an open-air facility that will allow [homeless persons] a safe facility to come in [to]. Spend the night, especially since Catholic Charities [usually] takes in about 500-plus persons a night,\" said Ward 5 City Councilman Cedric Crear. \"Our goal is not to turn anybody away.\"", "Stelloh, Tim.   \"Las Vegas Officials Invited Homeless to Parking Lot After Coronavirus Closed Shelter.\r\n    NBC News.   30 March 2020.", "Pappa, Erik and David Riggleman.   \"Temporary Homeless Shelter to Open at Cashman Center.\"\r\n    Joint News Release.   28 March 2020.", "DeSilva, Kristen.   \"Displaced Homeless Shelter Clients Relocated to Cashman Center Parking Lot.\"\r\n    KVVU-TV.   28 March 2020.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]