["A viral message that “Italy has defeated coronavirus” has been shared in the form of a news broadcast. It says that the country performed autopsies on patients who died of COVID and found they had actually died of “5G electromagnetic radiation”. The message is widespread in India as the country witnesses the second wave of coronavirus infections. India’s daily COVID cases have crossed 4 lakh.", "Below is a post by one Thomas Bogaty that drew 14 million views as of this writing. “काेराेना नामक जन्तु काे वास्तविक्ता शैतानिकपना (It is demonic to give legitimacy to corona),” reads the caption.", "The same claim was earlier widespread via text messages on WhatsApp.", "“इटली विश्व का पहला देश बन गया है जिसनें एक कोविड-19 से मृत शरीर पर अटोप्सी (पोस्टमार्टम) किया और एक व्यापक जाँच करने के बाद पता लगाया है कि वायरस के रूप में कोविड-19 मौजूद नहीं है, बल्कि यह सब एक बहुत बड़ा ग्लोबल घोटाला है। लोग असल में “ऐमप्लीफाईड ग्लोबल 5G इलैक्ट्रोमैगनेटिक रेडिएशन (ज़हर)” के कारण मर रहे हैं,” reads a part of the message.", "An identical WhatsApp forward was shared last year. It said, “Italy defeated COVID-19 and instead, immediately burry or incinerate the ‘highly polluted’ bodies. Italian doctors defied this order and conducted an autopsy on COVID-19 patient and found that the pandemic is not caused by a virus but by a bacterium which has been amplified with 5G. This bacterium causes blood clotting and kills patients. The cure is antibiotics, anti-inflammatories, and anticoagulants while intensive care and ventilators were never needed. Immediately, the Italian government changed the protocols, patients quickly recovered and Italy defeated COVID-19. WHO already knew about this cure but did not inform China for doing business. This pandemic is because they want to vaccinate and chip the masses to control and assassinate us and reduce the world population.”", "My Goodness is this true? Some1nd2findout. US n mny cointrirs wth strongest Intel agencies cudnt detect d fact? WHO. cheated d world?Is Corona not a Virus but a bacterial infection and patients can cure only in one day? See this video and share it so that d facts can b verified. pic.twitter.com/drXuR8uyd3", "— Chowkidar Ravichiruvolu🇮🇳 proudBhaaratheeyan🇮🇳 (@Ravichiruvolu1) June 12, 2020", "This video and similar Facebook post claim that Italy is the first country to defy World Health Organisation (WHO) “law” to not carry out autopsies on patients who died of COVID-19. It also blames the 5G technology for COVID-19 deaths.", "False.", "1. COVID-19 is caused by a novel coronavirus named SARS-CoV-2, not a bacterium. Evidence from tissue samples of patients, epidemiological data, clinical data, genomic data conclusively establishes that the current pandemic named COVID-19 is caused by a novel coronavirus and not by a bacterium. Alt News Science has previously published a detailed fact-check on this claim.", "2. The WHO does not advise against autopsy of deceased COVID-19 patients.", "There is no such thing as “world health law” that the WHO has control over. The WHO is not an executive body to give out ‘orders’ to countries all over the world.", "As early as March 24, 2020, WHO had released an interim guidance on “Infection Prevention and Control for the safe management of a dead body in the context of COVID-19.” In this guidance, WHO does not advise against autopsy of deceased persons infected with COVID-19. In fact, it lays down the safety precautions for performing these autopsies when required. The updated WHO interim guideline dated September 4, 2020 is also consistent with the initial guidance.", "Therefore it is not true that WHO ever advised against the autopsy of deceased COVID-19 patients.", "3. The WHO did not order immediate incineration or burial of deceased COVID-19 patients", "The WHO’s initial interim guidance states, “Hasty disposal of a dead from COVID-19 should be avoided. Authorities should manage each situation on a case-by-case basis, balancing the rights of the family, the need to investigate the cause of death, and the risks of exposure to infection.”", "The latest WHO guideline also confirms this “all measures should respect the dignity of the dead including avoiding hasty disposal of the body of a person who has died of COVID-19.”", "Thus, rather than ‘ordering’ immediate disposal of the body of deceased COVID-19 patients, the WHO has advised against it from the very beginning.", "4. The WHO did not label the bodies of COVID-19 patients as highly polluted", "The WHO’s initial interim guideline notes “except in cases of hemorrhagic fevers (such as Ebola, Marburg) and cholera, dead bodies are generally not infectious. Only the lungs of patients with pandemic influenza, if handled improperly during an autopsy, can be infectious. Otherwise, cadavers do not transmit disease. There is no evidence of persons having become infected from exposure to deceased COVID-19 patients.”", "The latest WHO guideline adds “based on current knowledge of the symptoms of COVID-19 and its main modes of transmission (droplet/contact), the likelihood of transmission when handling human remains is low.”", "Thus, rather than calling them ‘highly polluted,’ the WHO has suggested low likelihood of transmission when handling human remains of deceased COVID-19 patients.", "5. Italy is not the first country to conduct an autopsy on COVID-19 patient", "One of the first autopsy reports on patients who died of COVID-19 came from China on February 16, 2020. The first cluster of COVID-19 in Italy (local transmission) which had one death was not noted until February 21, 2020.", "6. The Italian government did not change the protocol in response to autopsies", "The interim guideline released by the Italian government on March 22, 2020, laid down recommendations for an autopsy of patients who died of COVID-19 infection. This guidance even predated the initial WHO guidance by two days.", "The websites of the Health Ministry of Italy show that there is no change in their protocol for COVID-19, and it has been considered as a disease caused by the novel coronavirus (SARS-CoV-2). Their FAQ doesn’t even mention clots or thrombi. Anticoagulants like heparin are used globally, including in Italy for the prevention and treatment of clotting abnormalities in severe COVID-19 patients (Miesbach, W et al 2020). This does not mean that they do not think it is a viral illness or that COVID-19 only causes thrombosis.", "Alt News Science has previously debunked the claims that COVID-19 is caused by bacteria. Since the thrombotic complications of COVID-19 were publicly known since February 2020 (Tang N et al. 2020), and even autopsy reports note the same (Fox, S. E. et al. 2020), there is no truth to the claim that this was a well-kept secret by the WHO suddenly uncovered by Italian doctors from one protocol defying autopsy.", "7. Severe coronavirus infections require ventilatory and ICU support", "About 5–15% of patients with COVID-19 infection require intensive care surveillance and ventilatory support (Möhlenkamp, S et al. 2020). Alt News Science has previously published a detailed fact-check on this claim.", "8. Italy has not defeated COVID-19.", "Note that the various version of claims covered in this article date back to at least 10 May 2020. Yet, as of 17 September 2020, Italy still has 41,413 active cases.", "Therefore, Italy is far from defeating COVID-19.", "9. 5G technology has not amplified COVID-19", "There is no correlation between the use of 5G and the number of COVID-19 cases and deaths in any country. For instance, India did not roll out 5G, but ranks 2nd in the world in terms of total COVID-19 case burden and is currently recording the highest number of daily cases. Similarly, Iran did not roll out 5G but has recorded over 395,000 cases of COVID-19. On the other hand, South Korea, a leader in 5G deployment with nationwide coverage, has been successful in flattening the COVID-19 curve with aggressive testing and other measures. Similarly, New Zealand had deployed 5G but totalled only 1792 COVID-19 cases and was free of the first wave of COVID-19. A fresh outbreak in the country was reported in August.", "In fact, rather than higher frequency electromagnetic waves “amplifying” a virus, the opposite happens – viruses are inactivated by the strong electromagnetic waves. The ultraviolet rays can kill various airborne bacteria and viruses (Szeto, W. et al. 2020). For this reason, the ultraviolet and gamma rays are commonly used disinfectants.", "A detailed article addressing the health concerns related to 5G can be read here.", "The various conspiracy claims about the nature of the COVID-19 pandemic, the WHO ‘law’ and ‘orders’ and Italian Health ministry are false. It is absurd to assert that the nature of the pathogen causing the pandemic and its cure can be kept hidden from the world. The knowledge and communication gap between experts and the masses, lack of trust in authorities, contribute to the conspiracy theories that quickly spread. But these conspiracy theories only make the situation worse as they give rise to the misinfodemic. Conspiracy theories that COVID-19 is not an infection encourage complacency and non-adherence to social distancing, rigorous hand-washing and use of masks. They can also encourage people to dangerously self-medicate with anticoagulants and antibiotics, hoping to cure the illness in the light of a shortage of hospital beds and high costs of in-patient treatment.", "References:", "Infection Prevention and Control for the safe management of a dead body in the context of COVID-19. (24 Mar 2020). Retrieved 10 Sep 2020, from https://apps.who.int/iris/bitstream/handle/10665/331538/WHO-COVID-19-lPC_DBMgmt-2020.1-eng.pdf.", "Infection prevention and control for the safe management of a dead body in the context of COVID-19. (4 Sep 2020). Retrieved 17 Sep 2020, from https://apps.who.int/iris/rest/bitstreams/1300088/retrieve.", "Rapporto ISS COVID-19 n. 6/2020 – Procedura per l’esecuzione di riscontri diagnostici in pazienti deceduti con infezione da SARS-CoV-2. Versione del 23 marzo 2020. (2020) Retrieved 10 Sep 2020, from https://www.iss.it/documents/20126/0/Rapporto+COVID-19+n.+6_2020+Autopsie+v27+marzo.pdf/c4b363a1-a246-c36c-d007-ae24ed7e648b?t=1585307031219.", "FAQ – Covid-19, questions and answers. (2020). Retrieved 10 Sep 2020, from http://www.salute.gov.it/portale/nuovocoronavirus/dettaglioFaqNuovoCoronavirus.jsp?lingua=english&id=230#2", "Miesbach, W., & Makris, M. (2020). COVID-19: Coagulopathy, Risk of Thrombosis, and the Rationale for Anticoagulation. Clinical and Applied Thrombosis/Hemostasis, 26, 1076029620938149.", "Tang, N., Li, D., Wang, X., & Sun, Z. (2020). Abnormal coagulation parameters are associated with poor prognosis in patients with novel coronavirus pneumonia. Journal of thrombosis and haemostasis, 18(4), 844-847.", "Szeto, W., Yam, W. C., Huang, H., & Leung, D. Y. (2020). The efficacy of vacuum-ultraviolet light disinfection of some common environmental pathogens. BMC Infectious Diseases, 20(1), 1-9.", "Möhlenkamp, S., & Thiele, H. (2020). Ventilation of COVID-19 patients in intensive care units. Herz, 1.", "Fox, S. E., Akmatbekov, A., Harbert, J. L., Li, G., Brown, J. Q., & Vander Heide, R. S. (2020). Pulmonary and cardiac pathology in Covid-19: the first autopsy series from New Orleans. MedRxiv.", "Donate Now", "Dr Sharfaroz Satani is a science writer for Alt News Science and a drug safety physician. He advocates for evidence-based medicine, freethought, and social equality. He also writes satire, poetry and fiction.", "A video of a ladder moving on its own, purportedly from Jharkhand, is viral on…", "In a 2-minute video, a man recommends a “technique” to prevent infection from Omicron, the…", "A video of a set of iron nails that appear to melt after being placed…", "Several social media users have shared an image that shows two columns — ‘Cepa/variante’ (Spanish…", "A 90-second video of a man dissecting a banana has been shared on the internet…."]