["“2009: H1N1 Virus,” reads the text on the first photo, showing full supplies. “2020: COVID19,” says the text on the photo of empty shelves.", "Text at the bottom reads: “Still Think The Media Doesn't Control You?” The misleading posts date to at least March 15, 2020.", "The meme was shared more than 2,000 times on Facebook, including here, here, and here. It was also posted on Twitter here by a user with more than 21,000 followers, and here by a second user with nearly 5,000 followers.", "The image of the stocked shelves is a screenshot from footage shot for a story that aired March 13, 2020 on a South Dakota television station.", "Multimedia journalist Cali Montana shot the footage earlier that week in Sturgis, South Dakota for a segment reminding people not to flush cleaning products such as wipes and paper towels amid COVID-19 panic buying, Jen Blake, an executive producer in that newsroom, told AFP by email.", "The photo in the meme is a screenshot from Montana’s footage, Blake said.", "It does not show grocery shelves in 2009, when the H1N1 virus broke out.", "The lower photo is a Reuters image that depicts empty shelves in a grocery store in Sydney, Australia on March 6, 2020, according to the caption.", "It is estimated that there were more than 60 million cases of H1N1 (swine flu) and nearly 12,500 deaths from the disease in the US between April 2009 and April 2010, according to the Centers for Disease Control and Prevention.", "The novel coronavirus has spread from China around the world, killing more than 700 people in the US and infecting more than 54,000.", "AFP Fact Check has debunked more than 180 examples of false and misleading information about the novel coronavirus. You can find the complete list of our fact-checks on the topic in English here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]