["Cyclone Idai has affected almost three million people in Southern Africa, of whom nearly 500,000 have been driven from their homes, the United Nations said on Tuesday.", "More than 700 people have been killed in Mozambique and Zimbabwe alone and hundreds are missing, as AFP reported this week.", "The misleading post, archived here by AFP Fact Check, was made on the Facebook page of Zimbabwe Today, an independent online newspaper. It was shared more than 4,000 times and captioned: “Please share so the world the can see the devastation and loss of lives by cyclone Idai. Zimbabwe, Mozambique, Malawi need urgent help”.", "The same video was shared more than 200 times on this Facebook group with more than one million followers.", "A caption alongside the March 25, 2019 post read: “Situation in Zimbabwe now”.", "The first misleading post actually has a title at the start of the video stating \"ITN...Mozambique floods, 27.2.2000\" (see below).", "A search on video verification platform INVID showed the video was made by British broadcaster ITN on February 27, 2000, and published on the website of Getty Images.", "The caption read: “Aerial views of flooded town and stranded people on rooftops / South African military helicopters rescuing people / Flood victims wade through water to helicopter. Mozambique floods on February 27, 2000 in Mozambique”.", "Mozambique experienced devastating flooding in 2000, when Cyclone Leon-Eline struck, killing hundreds of people.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]