["About this rating", "In October 2016 Republican candidate Donald Trump came under fire after the release of a decade-old tape capturing him making lewd comments, followed by multiple women coming forward to claim that Trump had groped them.  Shortly afterwards, an image containing allegations about incidents of Trump's having sexually abused women circulated via social media:", "The first claim held that in 1989 Donald Trump's first ex-wife, Ivana, swore under oath in a deposition that he had violently raped her and that somehow that information wasn't brought to light during the comprehensive mudslinging that engulfed the extremely heated 2016 election. But a simple online search shows quite clearly that numerous articles published from the summer of 2015 onwards made frequent reference to Ivana Trump's purported statement:", "The allegation largely stemmed from a 1993 book about Trump titled Lost Tycoon: The Many Lives of Donald J. Trump by Harry Hurt III, as detailed by the New Yorker:", "The part of the book that caused the most controversy concerns Trump’s divorce from his first wife, Ivana. Hurt obtained a copy of her sworn divorce deposition, from 1990, in which she stated that, the previous year, her husband had raped her in a fit of rage. In Hurt’s account, Trump was furious that a “scalp reduction” operation he’d undergone to eliminate a bald spot had been unexpectedly painful. Ivana had recommended the plastic surgeon. In retaliation, Hurt wrote, Trump yanked out a handful of his wife’s hair, and then forced himself on her sexually. Afterward, according to the book, she spent the night locked in a bedroom, crying; in the morning, Trump asked her, “with menacing casualness, ‘Does it hurt?’” Trump has denied both the rape allegation and the suggestion that he had a scalp-reduction procedure. Hurt said that the incident, which is detailed in Ivana’s deposition, was confirmed by two of her friends.", "Hurt held on to his copy of Ivana’s sealed deposition for years. “It was sworn testimony,” he said. But eventually, when he was cleaning house during his own divorce, he said, “I threw it all out.” He went on, “The larger tragedy is that Trump might be elected President of the United States. I never imagined in my wildest nightmares that it would come to this.”", "Before Hurt’s book came out, Trump’s lawyers pressured the publisher, W. W. Norton, to paste a clarifying statement from Ivana into the flyleaf of every copy. In it, she confirmed that she had said in a deposition that her husband had “raped” her, but added that she did not want those words to be interpreted in “a literal or criminal sense.” She also said, “As a woman, I felt violated.” Hurt said that he considers the note a non-denial denial, and believes that Ivana agreed to amend her words in order to secure the divorce settlement, in which she reportedly received fourteen million dollars in cash.", "When the rape story resurfaced [in 2015], Ivana issued a statement saying that it was “without merit.” “She and Donald have raised three kids together. They’re picking their bedrooms in the White House,” Hurt said. “But she’s not saying it’s untrue, or that she didn’t swear to it under oath.”", "As described, the book was appended with a statement from Ivana Trump disavowing that she intended to use the word \"rape\" in its commonly understood manner (i.e., forcible sex without consent):", "During a deposition given by me in connection with my matrimonial case, I stated that my husband had raped me.", "I wish to say that on one occasion during 1989, Mr Trump and I had marital relations in which he behaved very differently toward me than he had during our marriage.", "As a woman, I felt violated, as the love and tenderness which he normally exhibited toward me, was absent. I referred to this as a 'rape,' but I do not want my words to be interpreted in a literal or criminal sense.", "Any contrary conclusion would be an incorrect and most unfortunate interpretation of my statement which I do not want to be interpreted in a speculative fashion and I do not want the press or media to misconstrue any of the facts set forth above.", "All I wish is for this matter to be put to rest.", "Ivana's statement, according to a “Notice to the Reader” in the book, “does not contradict or invalidate any information contained in this book.”", "The second allegation in the image was less well known and likely new to many social media users, holding that Trump Model Management (New York City modeling agency) was \"caught trafficking young girls and hiding them in basements\" — something that likely would have been quite newsworthy, given that human trafficking is an extremely serious crime. This claim originated with a 30 August 2016 Mother Jones article that notably had nothing to do with any allegations that Donald Trump or his modeling agency had engaged in human trafficking.", "Instead, the Mother Jones article presented a case that Trump's anti-immigration position was hypocritical due to Trump Model Management's purported illegal employment of non-American models. Many of the article's details involved uncompensated work, a grayer legal area and a circumstance not uncommon among hopefuls trying to get a break in the highly competitive field of modeling.", "The article included comment from Canadian former model Rachel Blais and two unnamed women who claimed they worked for Trump Model Management around the mid-2000s and experienced illegal and/or unethical business practices. Although the details of the article were not flattering to Trump or his agency if accurate, asserting that the article accused Trump or his agents of \"trafficking young women and hiding them in basements\" is a gross exaggeration.", "The word \"basement\" appeared a single time in the article and was not mentioned as a place young female models were held against their will but simply as an example of cramped and pricey \"model's quarters\" (of a type not exclusive to Trump's modeling agency). The image reproduced above elided the article's description of the unpleasant living arrangements as an unfortunate but not uncommon aspect of the industry that is too often foisted upon aspiring models by agencies:", "[Along with one named woman, t]wo other former Trump models — who requested anonymity to speak freely about their experiences, and who we are giving the pseudonyms Anna and Kate — said the agency never obtained work visas on their behalf, even as they performed modeling assignments in the United States ... Each of the three former Trump models said she arrived in New York with dreams of making it big in one of the world's most competitive fashion markets. But without work visas, they lived in constant fear of getting caught ... According to three immigration lawyers consulted by Mother Jones, even unpaid employment is against the law for foreign nationals who do not have a work visa. \"If the US company is benefiting from that person, that's work,\" explained Anastasia Tonello, global head of the US immigration team at Laura Devine Attorneys in New York. These rules for immigrants are in place to \"protect them from being exploited,\" she said. \"That US company shouldn't be making money off you.\"", "Two of the former Trump models said Trump's agency encouraged them to deceive customs officials about why they were visiting the United States and told them to lie on customs forms about where they intended to live. Anna said she received a specific instruction from a Trump agency representative: \"If they ask you any questions, you're just here for meetings.\"", "Fashion industry sources say that skirting immigration law in the manner that the three former Trump models described was once commonplace in the modeling world ... Kate, who worked for Trump Model Management in 2004, marveled at how her former boss has recently branded himself as an anti-illegal-immigration crusader on the campaign trail. \"He doesn't want to let anyone into the US anymore,\" she said. \"Meanwhile, behind everyone's back, he's bringing in all of these girls from all over the world and they're working illegally.\"", "Models' apartments, as they're known in the industry, are dormitory-style quarters where agencies pack their talent into bunks, in some cases charging the models sky-high rent and pocketing a profit. According to the three former models, Trump Model Management housed its models in a two-floor, three-bedroom apartment in the East Village, near Tompkins Square Park. Mother Jones is withholding the address of the building, which is known in the neighborhood for its model tenants, to protect the privacy of the current residents.", "When Blais lived in the apartment, she recalled, a Trump agency representative who served as a chaperone had a bedroom to herself on the ground floor of the building. A narrow flight of stairs led down to the basement, where the models lived in two small bedrooms that were crammed with bunk beds — two in one room, three in the other. An additional mattress was located in a common area near the stairs. At times, the apartment could be occupied by 11 or more people.", "The third and final claim in the meme was perhaps the most widely-reported of all the three things that no one was supposedly talking about. It pertained to a twice-filed civil (not criminal) lawsuit against Donald Trump brought by a woman using the alias \"Katie Johnson\" who claimed that Trump \"sexually and physically\" abused her at parties hosted by billionaire Jeffrey Epstein when she was 13 years old and then threatened her to ensure her silence:", "I traveled by bus to New York City in June 1994 in the hope of starting a modeling career. I went to several modeling agencies but was told that I needed to put together a modeling portfolio before I would be considered. I then went to the Port Authority in New York City to start to make my way back home. There I met a woman who introduced herself to me as Tiffany. She told me about the parties and said that, if I would join her at the parties, I would be introduced to people who could get me into the modeling profession. Tiffany also told me I would be paid for attending.", "The parties were held at a New York City residence that was being used by Defendant Jeffrey Epstein. Each of the parties had other minor females and a number of guests of Mr. Epstein, including Defendant Donald Trump at four of the parties I attended. I understood that both Mr. Trump and Mr. Epstein knew I was 13 years old.", "Defendant Trump had sexual contact with me at four different parties in the summer of 1994. On the fourth and fnial sexual encounter with Defendant Trump, Defendant Trump tied me to a bed, exposed himself to me, and then proceeded to forcibly rape me. During the course of this savage sexual attack, I loudly pleaded with Defendant Trump to stop but he did not. Defendant Trump responded to my pleas by violently striking me in the face with his open hand and screaming that he would do whatever he wanted,", "Immediately following this rape, Defendant Trump threatened me that, were I ever to reveal any of the details of Defendant Trump's sexual and physical abuse of me, my family and I wold be physically harmed if not killed.", "As our article on the lawsuit notes, \"Katie Johnson\" has not been identified or interviewed, and she has not provided any information or evidence outside of her court filing.  Donald Trump hasn't been afforded any opportunity to confront his accuser or the evidence against him in court, and the case may never get that far.", "The original poster of the image stated that after \"the 2005 video of Donald Trump was released\" she wished just to \"add fuel to the fire on how disgusting he is\" by highlighting things the public allegedly had ignored about the candidate's history. But two of the three claims about Trump that the public or the news media \"are not going to talk about\" have in fact received widespread media attention, and the third was contorted to the point of being unrecognizable when compared to the source material from which it was derived.", "Biddle, Sam.   \"The Time Donald Trump's Ex-Wife Accused Him of Brutally Raping Her.\"\r\n    Gawker.     30 July 2015.", "Ericksen, Brittany and Ilse Knecht.   \"Statutes of Limitations for Sexual Assault: A State-by-State Comparison.\"\r\n    The National Center for Victims of Crime.   21 August 2013.", "Osborne, Samuel.   \"Donald Trump's Ex-Wife's Claim He 'Raped' Her Resurfaces in New Documentary.\"\r\n    The Independent.   27 January 2016.", "West, James.   \"Former Models for Donald Trump's Agency Say They Violated Immigration Rules and Worked Illegally.\"\r\n    Mother Jones.   30 August 2016.", "Mayer, Jane.   \"Documenting Trump's Abuse of Women.\"\r\n    The New Yorker.   24 October 2016.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]