["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The 2020 election, with no declared winner as of the morning of Nov. 5 and votes still being tallied, is generating plenty of misinformation about the number of votes cast, and by whom. One claim about North Carolina and Wisconsin is that the number of votes in each of those states was higher than the number of registered voters.", "One Facebook post says, \"How is this possible?\" with a chart showing that in North Carolina, 5,160,000 people are registered to vote and 5,387,496 people cast votes there, for a turnout rate of 104.41%; and in Wisconsin, 3,129,000 people are registered to vote and 3,240,275 people cast ballots there, for a turnout rate of 103.56%.", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The post asks \"How is this possible?\" and the answer is simple: It’s not.", "The incorrect numbers of registered voters included in the claim appear to come from outdated 2018 voter registration statistics.", "In 2020, North Carolina had 7.36 million registered voters and 5.49 million votes cast, for 74.6% voter turnout, according to the state’s Board of Elections. Wisconsin had 3,684,726 registered voters on Nov. 1, the state’s Elections Commission reported, and 3.2 million people voted, for at least 71% voter turnout, according to the Milwaukee Journal Sentinel.", "The Wisconsin Elections Commission tweeted via its verified account that the state allows election-day registration, so the voter registration numbers that some counties include in unofficials results are \"not a true indicator of registration.\"", "PolitiFact previously checked the claim about Wisconsin having more votes cast than registered voters and rated it Pants on Fire.", "This claim suffers the same fate. We rate it Pants on Fire.", "This fact check is available at IFCN’s 2020 US Elections #Chatbot on WhatsApp. Click here, for more.", "Ballotpedia, \"Voter registration statistics, 2018,\" accessed Nov. 5, 2020", "Facebook post, Nov. 4, 2020", "Milwaukee Journal Sentinel, \"Fact check: Wisconsin did not have more votes than registered voters,\" Nov. 4, 2020", "North Carolina State Board of Elections, \"Voter Turnout Statistics,\" accessed Nov. 5, 2020", "PolitiFact, \"No, Wisconsin doesn’t have more ballots cast than registered voters,\" Nov. 4, 2020", "Wisconsin Elections Commission, \"Nov. 1, 2020 voter registration statistics,\" Nov. 1, 2020", "Wisconsin Elections Commission tweet, Nov 4, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]