["By Angelo Fichera", "Posted on August 10, 2018", "Q: Did France pass “a law saying having sex with a child is okay”?", "A: No. The country already didn’t have a legal consent age. The new law makes it easier to file rape charges against adults who have sex with those 15 or younger.", "Saw a post on fb (I know, so it must be true, right? Ha!) About France passing a law saying having sex with a child is okay. Research showed not true. Please post so I can blow this crazy woman out of the water for posting false information.", "French law doesn’t include a legal age of consent for sex — an established norm in many Western countries. But that doesn’t mean that “having sex with a child is okay.”", "France has had a law on the books that made it illegal to have sex with someone who is 15 or younger — an offense that was punishable by five years of imprisonment and a fine of 75,000 euros.", "Last week, the French Parliament gave final approval to legislation that increased those penalties to seven years of imprisonment and a fine of 100,000 euros. The new law also makes it easier to bring rape charges against an adult who has sex with a child 15 years old or younger — a crime that can lead to imprisonment of 20 years.", "But the new law did not include a proposed formal age of consent — a failure that has sparked much criticism and confusion. Multiple readers have asked us whether the country actually passed a law that made it acceptable for children to have sex with adults.", "That may be in part because of misleading information shared online.", "A viral Your News Wire story — headlined “France Passes Law Saying Children Can Consent To Sex With Adults” — began by saying that “President Macron’s government has voted against having an age of consent in France.”", "“Federal law in France now has no legal age of consent,” the Aug. 4 story adds.", "That’s inaccurate. The country didn’t have a consent age before the new law — and the measure passed didn’t include language about a consent age. So the government didn’t vote “against” one.", "Instead, the new law gives prosecutors more grounds to bring rape charges against an adult having sex with a child. It also penalizes street harassment.", "Under the existing law, there is no language that says outright that sex with a minor is rape. Cases of rape must involve “violence, coercion, threat or surprise” (though a 2010 law stipulated that moral coercion, or “la contrainte morale,” can result from the age difference between a minor and the perpetrator).", "The new law, however, broadens what constitutes rape when an adult has sex with someone 15-years-old or younger. Specifically, it says that the coercion and surprise factors can be characterized by the “abuse of the vulnerability,” if the victim did not have “the necessary discernment for these acts.” Judges will decide whether or not the victim was capable of giving consent, the Associated Press reported, and prosecution of such cases will be permitted for 30 years — instead of 20 — after the victim turns 18.", "Regardless of the issue of consent, French law does already penalize the offense, or infraction, of having sex with someone 15 or younger. And the new law upgraded penalties for such abuse to seven years imprisonment and a fine of 100,000 euros.", "The rape of a minor, on the other hand, can lead to imprisonment of 20 years.", "The new law also suggests that other sex offense charges can be raised if the “existence of violence or coercion, threat or surprise” — the basis of a rape charge — “was disputed during the proceedings.”", "France had considered setting a legal age of consent at 15 — prompted by high-profile cases in which men who had sex with minors were not convicted of, or initially charged with, rape. While an early draft of the bill included such language, Reuters reported, officials retreated from that plan following concerns that the measure would be deemed unconstitutional.", "The failed attempt to set an age of consent disappointed women’s rights advocates.", "“If you do not make it extremely clear in a legal text that it is by default rape, it leaves it up to judges and up to courts to decide,” women’s rights activist Nikita Blanes told Deutsche Welle, a German public broadcaster.", "The Your News Wire story, however, claimed France was “the latest nation to give in to pressure from an international network of liberal activists determined to normalize pedophilia and decriminalize sex with children across the world.”", "The website, known for posting false information, mixed some accurate details with misleading and incorrect statements.", "The story, for example, claimed that “support for the European motion also exists in the United States,” and quoted a supposed University of Michigan cultural anthropologist named Thomas Black. But we could find no record of that person at the university. The chair of the university’s anthropology department, Andrew Shryock, told us that there is no one by that name currently active in the department.", "The piece garnered almost 150,000 interactions on Facebook, including nearly 20,000 shares, according to CrowdTangle data. It was also posted on other websites and cited in a 4chan thread titled, “France Legalizes Child Rape.”", "The Your News Wire story was given added attention when Judith Collins, a member of the New Zealand Parliament, shared a link to the story on Twitter — prompting some to criticize her for sharing “fake news.”", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk false stories shared on the social media network.", "Corbet, Sylvie. “Fines for Sex Harassment on Streets Approved in France.” Associated Press. 1 Aug 2018.", "“France Passes Law Saying Children Can Consent To Sex With Adults.” Your News Wire. 4 Aug 2018.", "Reinforcing the fight against sexual and sexist violence. Law 2018-703. 3 Aug 2018.", "Shryock, Andrew. Chair, University of Michigan Anthropology Department. Email sent to FactCheck.org. 9 Aug 2018.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]