["About this rating", "Voting in the 2020 U.S. Election may be over, but the misinformation keeps on ticking. Never stop fact-checking. Follow our post-election coverage here.", "On Jan. 20, 2021, Kamala Harris placed her hand on a Bible and took the oath of office, becoming the first woman in United States' history to be sworn in as vice president. Shortly after, a photograph from the inauguration started circulating along with the claim that Harris' hand wasn't actually on a Bible. Rather, the social media post claimed Harris was sworn in on a clutch purse:", "This is a genuine photograph, but the object Harris is touching is not a purse, it's a Bible.", "Harris was sworn in on two Bibles. The Bible at the top of this picture belonged to the late U.S. Supreme Court Justice Thurgood Marshall. The Bible on the bottom belonged to close family friend Regina Shelton.", "NPR reported:", "Harris used two Bibles in the ceremony. The first belonged to Regina Shelton, a family friend whom Harris viewed as a surrogate mother. Harris has used this Bible before, when she took the oath of office as both California attorney general and U.S. senator. The second Bible was previously owned by the late Justice Thurgood Marshall, the first Black member of the Supreme Court and Harris' lifelong political role model.", "This rumor likely stems from (in addition to general misogyny toward the first female vice president and unfounded conspiracy theories that Democrats are Satanists) the fact that this Bible was in a zipped leather case. While Bible cases may be unfamiliar to those spreading this false rumor, they are not uncommon. Harris' cover even includes the words \"Holy Bible\" along its spine.", "The photograph at top of this article provides another angle of Harris taking the oath of office where the words \"Holy Bible\" are clearly visible. Here's a closer look at the Bibles used during Harris' inauguration:", "Correction [Feb. 9, 2021]:  A previous version of this article misidentified which Bible was which.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]