["By Katie Busch", "Posted on March 8, 2021", "Posts circulating on social media falsely claim that Vice President Kamala Harris supports deep cuts to veterans’ programs, telling them to “get a job.” It’s a fabricated quotation that originated on a satirical website.", "During her 2020 presidential campaign, then-Sen. Kamala Harris announced her plan to expand veterans’ health benefits and housing assistance. The plan, released in September 2019, also said she would work to “create new economic opportunity for military families by fighting to expand and institutionalize hiring and government contracting preferences for veterans and military families.”", "But social media posts have been spreading bogus claims that Harris, who is now the vice president, opposes benefits for veterans and has called for closing down the Department of Veterans Affairs.", "One post falsely claims Harris said: “Veterans Affairs coddles them. It creates a dependency upon us which is not doing these former soldiers any good. They need to learn to live on their own two feet and be responsible adults.”", "“The easiest way to assist them on this journey is to cut them off. Within these next four years, we will be shuttering the VA, taking away soldier welfare.” The post concludes:  “So here’s a message to the soldier boys. Get a job.”", "Slightly different versions of the fabricated quote have been circulating on Facebook, all of which center around Harris’ purported desire to cut funding for veteran services.", "These comments have not appeared on Harris’ Twitter account or Facebook page, and there is no evidence to suggest that Harris said any of these statements.", "In fact, the bogus quotes attributed to Harris originated on a satirical website. An article titled “Military-Hating Kamala Wants To Shut Down The VA” appeared Feb. 9 on America’s Last Line of Defense, a website that describes itself as “satire for your confirmation bias.” We’ve included the website in our Misinformation Directory of websites that post deceptive content.", "The article, which was published before the social media posts in question, includes the erroneous quote in its entirety.", "To the contrary, the Biden administration proposed $20 billion for veterans’ health care when it announced the COVID-19 relief bill known as the American Rescue Plan. The bill, as approved by the Senate on March 6, currently provides more than $15 billion for veterans.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "Harris, Kamala. “Kamala’s Promise to America’s Veterans and Military Families.” 7 Sep 2019.", "“Heinrich Secures Critical Funding For Veterans In American Rescue Plan.” Press release from Sen. Martin Heinreich. 6 Mar 2021.", "“President Biden Announces American Rescue Plan.” White House. 20 Jan 2021.", "“Military-Hating Kamala Wants to Shut Down The VA.” America’s Last Line of Defense. 9 Feb 2021.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]