["By Lori Robertson", "Posted on February 11, 2021", "President Joe Biden overstated the impact of raising the federal minimum wage to $15, claiming that “if you’re making less than $15 an hour,” and working 40 hours a week, “you’re living below the poverty wage.” Not everyone earning less than that would be below the federal poverty guidelines or lifted above the guidelines with $15-an-hour pay.", "The nonpartisan Congressional Budget Office estimates 17 million workers would be “directly affected” by increasing the federal minimum wage to $15 by 2025 — those workers would otherwise earn less than that. But the number in poverty would decline by 900,000.", "Those working full-time and earning the current federal minimum wage — $7.25 an hour — would be below the federal poverty guideline of $17,420 for a family of two. Such a worker would earn only $14,500 if working 40 hours a week for 50 weeks a year. A White House spokesperson referred us to those poverty guidelines, while another spokesperson told PolitiFact.com that Biden was referring to families of four.", "Workers earning between $11 and $13 an hour and in a family of four with no other income would still be below those poverty guidelines. But those earning $14 an hour — $28,000 a year — would be above the federal poverty level of $26,500 for a family of four.", "Federal guidelines include higher thresholds for Alaska and Hawaii. In those states, workers earning $14 or $15 an hour in a family of four would be below the poverty guidelines.", "Biden made the claim in an interview with CBS News that aired on Feb. 5. He said he expected a proposal to raise the federal minimum wage to $15 an hour — which was part of his COVID-19 relief package — would not be included in the final legislation, the American Rescue Plan.", "“My guess is it will not be in it,” Biden said. But he went on to say that he supported the policy.", "“I am prepared, as president of the United States on a separate negotiation on minimum wage, to work my way up from what it is now, which is — look, no one should work 40 hours a week and live below the poverty wage. And if you’re making less than $15 an hour, you’re living below the poverty wage,” Biden said, without specifying the size of the worker’s family.", "Our calculations above show gross income, before taxes. Federal, state and local government programs offering assistance to low-income individuals may use before- or after-tax thresholds for eligibility. The Census Bureau uses before-tax money income and slightly different poverty thresholds to determine its poverty measure.", "While the federal minimum wage has been $7.25 since 2009, 29 states plus Washington, D.C., Guam and the U.S. Virgin Islands have set higher minimums, and some cities have enacted their own minimum wage hikes. Washington state currently has the highest statewide minimum wage at $13.69, while the wage is $15 in Washington, D.C.", "As we said, raising the minimum wage as Biden proposes would lift some workers out of poverty, and raise the wages of millions more. But it also would cause job losses, according to a Feb. 8 report by the CBO.", "That also contradicts Biden’s claim in the CBS News interview that working up to a $15 minimum wage “all the economics show, if you do that, the whole economy rises.” The Washington Post Fact Checker wrote about that claim, explaining that economists disagree on the impact of a minimum wage hike, with liberal economists finding little to no job loss but competing research concluding employment would decline.", "The CBO estimated the effects of a Senate bill to increase the federal minimum wage annually, reaching $15 an hour by June 2025. In that year, the number of people in poverty would decline by 900,000, but employment would also drop by 1.4 million people, according to CBO’s average estimate.", "The report said there is a 33% chance that between zero and 1 million jobs would be lost, and a 33% chance that between 1 million and 2.7 million jobs would be lost.", "The “17 million workers whose wages would otherwise be below $15 per hour would be directly affected, and many of the 10 million workers whose wages would otherwise be slightly above that wage rate would also be affected,” the CBO said. Among the 10 million workers, “wages for many of those workers would increase as employers sought to retain some of the differences in pay that had previously existed among those workers.”", "The Economic Policy Institute, which receives some of its funding from labor unions, analyzed the same congressional proposal as the CBO but found more workers would see higher wages. It estimated the legislation would raise the pay of nearly 32 million workers and “meaningfully reduce the number of families in poverty.”", "EPI also argues that a single, full-time worker without kids needs $15 an hour “to achieve a modest but adequate standard of living.”", "Biden worded his claim differently in remarks on Jan. 22. He said: “No one in America should work 40 hours a week making below the poverty line. Fifteen dollars gets people above the poverty line. We have so many millions of people working 40 hours a week — working — and some with two jobs, and they’re still below the poverty line.”", "A $15 minimum wage would get some people “above the poverty line,” as the CBO report shows. But not everyone earning under $15 is below the poverty guidelines.", "Editor’s note: FactCheck.org does not accept advertising. We rely on grants and individual donations from people like you. Please consider a donation. Credit card donations may be made through our “Donate” page. If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, 202 S. 36th St., Philadelphia, PA 19104.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]