["On March 10, Congress moved a no confidence motion in the Haryana Legislative Assembly against Manohar Lal Khattar-led government. However, the BJP government won the trust vote with only 32 votes cast in support of the no confidence motion. The same day, several social media users began sharing a picture of Haryana Chief Minister Manohar Lal Khattar with former Chief Minister Bhupinder Singh Hooda. The Deputy Speaker of the Haryana Legislative Assembly is seen in the company of the two leaders. Facebook page Khari Khari News shared the photo with the caption, “This picture from today shows who is in cahoots with whom! There are too many two-faced snakes in politics nowadays…”", "आज की यह फोटो बता रही है कि कौन किससे मिला हुआ है…!!! सियासत में दो मुंहे सांप ज्यादा हो गए हैं…", "Posted by Khari Khari News on Wednesday, March 10, 2021", "The claim was also shared by multiple Twitter users.", "आज की यह फोटो बता रही है कि कौन किससे मिला हुआ है! सियासत में दो मुंहे सांप ज्यादा हो गए हैं @rssurjewala @kumari_selja @AbhaySChautala @CMOhryShadow @MonikaSingh__ @BhupinderSHooda @RahulGandhi @RoflGandhi_ @priyankagandhi @Ravishk356 @Rofl_Diiljit @CMOhryShadow @_YogendraYadav pic.twitter.com/cIKhnw13MD", "— Kawaljeet Singh (@kawaljeetambala) March 10, 2021", "A simple reverse image search is enough to establish the truth behind the viral photo. Alt News found several reports stating that the image was taken in 2019. According to a Deccan Herald article dated December 26, 2019, CM Manohar Lal Khattar and former Chief Minister Bhupinder Singh Hooda had come to congratulate Ranbir Singh Gangwa, the newly-elected Deputy Speaker of the Haryana Vidhan Sabha.", "India Today also published other photos from the same day.", "Therefore, social media users shared a 2019 picture of Haryana’s current Chief Minister Manohar Lal Khattar and former chief minister Bhupinder Singh Hooda on March 10, falsely linking it to the recent political developments in the state.", "Donate Now", "A journalist and a dilettante person who always strives to learn new skills and meeting new people. Either sketching or working.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]