["About this rating", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "In July 2020, social media users posted a meme that included a screenshot of an article excerpt that allegedly demonstrated hydroxychloroquine would be an effective \"cure and vaccine\" against COVID-19.", "The claim stems from an opinion piece by Bryan Fischer, former director of the American Family Association, that interpreted a 2005 study on the utility of chloroquine to treat SARS as being relevant to COVID-19 — a disease that did not exist at the time of that paper's publication. SARS (aka SARS-CoV, which caused epidemics in the early 2000s) and COVID-19 (aka SARS-CoV-2) are both caused by coronaviruses, but that does not mean that both could be treated with the same medication.", "Similarly, hydroxychloroquine and chloroquine are related drugs, but that does not mean they are interchangeable. Finally, the excerpted study was limited in scope and based on laboratory results. Fischer attempted to tie Dr. Anthony Fauci to the 2005 study by falsely alleging that it was published in a journal run by the U.S. agency Fauci heads.", "Are SARS and COVID-19 the same? No.", "While SARS and COVID-19 are both coronaviruses, that does not mean these two diseases are interchangeable, nor that they can be treated with identical medicines.", "Hundreds of coronaviruses exist, most of which circulate among animals. These viruses occasionally jump to humans and cause diseases that range in severity. The common cold, for instance, which isn't particularly known for being lethal, can be caused by a coronavirus. On the other hand, COVID-19, which has caused more than 150,000 deaths in the United States (and close to 700,000 total deaths worldwide) as of this writing, is also caused by a coronavirus. Nobody would argue that a treatment for the common cold would be equally effective against COVID-19.", "Fischer attempts to dismiss the fact that SARS and COVID-19 are two distinct diseases by arguing that they share a similar scientific name (SARS-CoV-1 and SARS-CoV-2) and 79% of the same genome. Saying that these two diseases share 79% of their genome sequence may make it sound like these diseases are nearly identical, but consider this: Humans share 98% of our genome with chimpanzees.", "Are hydroxycloroquine and chloroquine the same thing? No.", "Although these drugs are similar (they are both derivatives of a 4-aminoquinoline [4AQ] nucleus), they aren't interchangeable. Chloroquine is primarily used to treat malaria, while hydroxychloroquine, which is considered less toxic than chloroquine, is used to treat rheumatoid arthritis, lupus, and certain blood disorders.", "CNN writes:", "Chloroquine is used to treat malaria, as well as in chemoprophylaxis, which is the administering of drugs to prevent the development of disease, according to the US Centers for Disease Control and Prevention. Since 2006, it has not been recommended for use in severe malaria because of problems with resistance, particularly in the Oceania region, according to the World Health Organization.", "[...]", "Hydroxychloroquine is what's known as an analog of chloroquine, meaning the two have similar structures but different chemical and biological properties. The former is considered the less toxic derivative, according to studies.\nIt's given to patients with rheumatoid arthritis, lupus and the blood disorder porphyria cutanea tarda, the CDC said.", "Did this study prove that chloroquine was an effective treatment against SARS? No.", "The 2005 article published in Virology Journal was based on a laboratory cell-culture experiment that used primate cells, not human cells. The authors noted at the time that more testing was needed before antivirals could be developed to treat the disease in humans:", "Chloroquine has been widely used to treat human diseases, such as malaria, amoebiosis, HIV, and autoimmune diseases, without significant detrimental side effects [15]. Together with data presented here, showing virus inhibition in cell culture by chloroquine doses compatible with patient treatment, these features suggest that further evaluation of chloroquine in animal models of SARS-CoV infection would be warranted as we progress toward finding effective antivirals for prevention or treatment of the disease.", "It should also be noted that this was an in vitro study, meaning that it was conducted in a controlled environment, like a test tube, not inside a living organism. The Universal Health Network, a medical research organization in Toronto, Ontario, Canada, noted that in vitro models have a reputation of being \"less translatable\" to humans than other research methods:", "A major drawback is their failure to capture the inherent complexity of organ systems. For example, in vitro models may not account for interactions between cells and biochemical processes that occur during turnover and metabolism. As a result, in vitro studies have developed a reputation for being “less translatable” to humans.", "More importantly, in the years since the SARS outbreak in 2002, chloroquine has not been widely used to treat the disease.", "Did this study say that hydroxychloroquine was an effective treatment against SARS? No.", "The 2005 paper in the Virology Journal never mentions hydroxychloroquine.", "Was Fauci or the NIH involved in this 2005 paper? No.", "As mentioned earlier, the above-displayed screenshot shows an excerpt from an opinion piece written by Fischer, which was published on websites such as One News Now and the conspiratorial True Pundit, a site that traffics in misinformation.", "Fischer's article is centered on a 2005 paper published in the Virology Journal entitled \"Chloroquine Is a Potent Inhibitor of SARS Coronavirus Infection and Spread.\" Although this is a genuine article, it was not authored by Fauci. Fischer attempted to connect Fauci to this article by stating that the \"Virology Journal [is] the official publication of Dr. Fauci’s National Institutes of Health [NIH],\" but that simply isn't true. The Virology Journal is not an official publication of the NIH.", "The Virology Journal is published by Biomed Central (BMC), part of the publishing group Springer Nature, an academic publishing company. Some government researchers were involved with this 2005 study (five of the eight listed authors were from the Centers for Disease Control and Prevention [CDC], the other three were from Clinical Research Institute of Montreal), but this study did not involve Fauci or anyone else from the NIH.", "Is hydroxychloroquine an effective treatment for COVID-19? No.", "As of this writing, hydroxychloroquine has not been shown to be an effective treatment of COVID-19.", "Hydroxychloroquine has been an effective treatment for other diseases, such as malaria, but studies have not found the drug to be useful in the fight against COVID-19. In June 2020, the Food and Drug Administration (FDA) revoked \"the emergency use authorization (EUA) to use hydroxychloroquine and chloroquine to treat COVID-19,\" writing that a large, randomized clinical trial showed that the drug provided \"no benefit for decreasing the likelihood of death or speeding recovery.\"", "Universal Health Network.   \"In vitro vs. In vivo: Is One Better?\"\r\n    Retreived 4 August 2020.", "McLaughlin, Eliott.   \"Chloroquine and Hydroxychloroquine: What to Know About the Potential Coronavirus Drugs.\"\r\n    CNN.   24 March 2020.", "FDA.   \"FDA Cautions Against Use of Hydroxychloroquine or Chloroquine for COVID-19 Outside of the Hospital Setting or a Clinical Trial Due to Risk of Heart Rhythm Problems.\"\r\n    1 July 2020.", "Seley-Radtke, Katherine.   \"Here's Why Hydroxychloroquine Doesn't Block The Coronavirus in Human Lung Cells.\"\r\n    Science Alert.   1 August 2020.", "Duply, Beatrice.   \"Chloroquine/SARS Study Doesn’t Prove Hydroxychloroquine Works Against COVID-19.\"\r\n    Associated Press.   31 July 2020.", "Niaid.nih.gov.   \"Coronaviruses.\"\r\n    Retrieved 4 August 2020.", "Silverman, Craig.   \"Revealed: Notorious Pro-Trump Misinformation Site True Pundit Is Run By An Ex-Journalist With A Grudge Against The FBI.\"\r\n    Buzzfeed. &nbs; 27 August 2018.", "Virology Journal.   \"Chloroquine is a Potent Inhibitor of SARS Coronavirus Infection and Spread'\"     22 August 2005.", "True Pundit.   \"COVER UP: Fauci Approved Chloroquine, Hydroxychloroquine 15 Years Ago to Cure Coronaviruses; \"Nobody Needed to Die.'\"\r\n    5 May 2020.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]