["About this rating", "On 9 March 2015, the Facebook page \"Discovering Our Wonderful World\" published the image of purple ladybugs reproduced above, along with the following text about these visually remarkable small small beetles:", "Yes, there are purple ladybugs. The fifteen-spotted ladybug is found only in Hawaii. When young, it is grayish in color with fifteen black spots on the body. As it grows old, the color of the body changes to dark purple and hence, the spots are not clearly visible[.]", "While the \"top\" comments about the photograph were complimentary, changing the default sorting method to display \"new\" comments first revealed a bevy of skeptical users. Finding the original photograph that had been altered to create the image of \"purple ladybugs\" wasn't difficult, and the photographer's web site provided all the information necessary to discern the legitimacy of the purple ladybugs image:", "It was clear from the order of images that the photographer snapped the picture of typical red ladybugs seen in the montage before altering their color as part of her presented work. Unless she also happened upon red, yellow, green, and purple ladybugs (all positioned in the exact same formation) in her travels, those images were simply a creative exercise in digital color shading.", "It is true that ladybugs (or \"ladybirds\" in the UK) exhibit some color variations, as noted in a June 2015 study undertaken at the Universities of Exeter and Cambridge examining the relationship between ladybug signaling and their visual appearance to predatory birds:", "Although red ladybirds with black spots are most familiar, ladybirds are a diverse group of species and come in many different colours and patterns, from yellow and orange to even camouflaged browns. The bright coloration of different ladybird species acts as a warning signal, telling potential predators to beware of the foul smelling, poisonous chemicals they use for defence.", "Purple ladybugs weren't the first enhanced members of the animal kingdom to dupe social media users: teal owls (along with several other hues of owl) have proved to be popular online fakes.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]