["About this rating", "On some dark web marketplaces, there are listings for COVID-19 vaccines.", "These listings are almost always — if not always — scams.", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "In December 2020, as the U.S. Food and Drug Administration (FDA) approved the first COVID-19 vaccine for emergency use, the FBI and other federal agencies began to warn of fraudsters exploiting interest in the newly released vaccine. INTERPOL, as well, issued an Orange Notice alerting law enforcement to \"potential criminal activity in relation to the falsification, theft and illegal advertising of COVID-19 and flu vaccines.\"", "One area where these scams have reportedly proliferated is the so-called dark web. Broadly speaking, the dark web refers to unindexed content on the internet that can not be searched for and that, among other things, contains several anonymous marketplaces and forums that purport to sell a wide range of illicit material. On Feb. 8, 2021, CBS News reported that \"in just the last six weeks, the number of vaccine ads on the dark web has exploded,\" adding that \"the asking prices have doubled or even quadrupled.\"", "For a Dec. 25, 2020, segment on PlanetMoney, NPR spoke to Chad Anderson, a senior security researcher at the cyberthreat intelligence agency Domain Tools. \"We're a cyberthreat intelligence data company,\" he explained, \"so we scan the entire Internet as many times as we can every single day and give insights to customers based upon what we see.\" Back then, he argued the vaccine ads popping up on the dark web were clearly scams.", "\"For one thing,\" NPR correspondent Stacey Vanek Smith explained, \"the Pfizer vaccine requires a very intense cold storage chain. The vaccines have to be kept at negative 70 degrees Fahrenheit.\" And also, she added, \"the COVID vaccine ads are mixed in with ads for all kinds of other things, and Chad says that tends to be a red flag.\" At the time of this reporting, the only two FDA-approved vaccines are the Pfizer vaccine and the Moderna vaccine. Both shots are mRNA vaccines, and as such they both require this high level of refrigeration for transport.", "Snopes reached out to Anderson to ask if ads for vaccines on dark web marketplaces still appeared to be scams, as of February 2021. \"Just went and took a look at the last of the 'reputable' markets [on the dark web] and I still don't see any COVID vaccines for sale on there,\" he wrote to us by email, adding that he did see some ads for the largely discredited treatment hydroxychloroquine, but not much else on the COVID-19 front. One problem with the dark web, however, is that there is no requirement for \"reputable behavior\" and few safeguards against predatory behavior.", "Several media reports have cited a dark web market named Agartha as having ads for COVID-19 vaccines. Indeed it does — several hundred of them, according to a recent analysis by Snopes — but these ads are all comically obvious frauds. One ad listed under \"opiates,\" for instance, asked for \"mutual trust\" in its effort to sell some \"Moderona\" vaccine:", "Other ads claim to be able to ship the Pfizer vaccine, which as a reminder requires extreme refrigeration for storage, by FedEx at no additional cost. Many ads, like the one below, don't even specify what vaccine product they purport to sell. Instead, the ad appears to be a bait-and-switch for a seller peddling other drugs ranging from marijuana to fentanyl:", "According to DomainTools' Anderson, \"Agartha is considered an entire scam market.\" He added that \"I've never thrown money into my user wallet on there, but I have heard from others that the moment you do it's immediately siphoned off to another wallet that I would assume is the wallet of those running the site.\"", "CBS News, in its reporting, cited the work of cybersecurity company Check Point. That firm attempted to purchase COVID-19 vaccines from various dark web sellers, even sending a Bitcoin payment to one. \"A few days after the Bitcoin transaction, Check Point received a message from the vendor saying the vaccine had been shipped, CBS reported. \"Then a few days later, that vendor's account completely disappeared from the site.\" They never received any product in return, and the firm concluded that none of the sellers they found actually had any vaccine to sell.", "Overt fraud aside, a possibility remains that as more easily transportable vaccines are approved and produced, a dark web black market for vaccines could develop. \"As time goes by, and more people get access to legitimate doses, there's always the possibility that some of that real product could make its way onto the dark web,\" CBS reported. \"More providers will lead to looser shipping restrictions,\" Anderson agreed.", "The risks from engaging in these transactions are multifaceted. Outside of a potential loss of money, there are risks of receiving unknown and dangerous drugs instead of a vaccine or having identifying information stolen. \"In addition to the dangers of ordering potentially life-threatening products,\" a December 2020 Interpol news release stated, \"an analysis by the INTERPOL’s Cybercrime Unit revealed that of 3,000 websites associated with online pharmacies suspected of selling illicit medicines and medical devices, around 1,700 contained cyber threats, especially phishing and spamming malware.\" In other words, even if these listings were not overt scams, it's not worth the risk.", "Because at this time there are several ads for COVID-19 vaccines on various dark web markets of low repute, but that none of them appear to be legitimate, we rate the claim that the vaccines are for sale as \"Mostly False.\"", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]