["The photo was published in this Facebook on June 4, 2019 where it has been shared more than 700 times.", "The photo shows a man in a court dock flanked by two policemen in uniform.", "The post's caption states: “A Japanese man killed his friend just because he didn't give him 6x scope in PUBG.”", "Below is a screenshot of the misleading post:", "“PUBG” refers to an online video game could be played individually or in a group, on mobile phone, PC and Playstation. “6x scope” refers to a feature of the game.", "The same photo was shared on Facebook here with a similar claim, and here in Pashto, and here on Twitter.", "The claim is false; the photo has previously circulated in media reports about a Chinese man who was sentenced to death for killing nine schoolchildren in 2018.", "A reverse image search on Google and keyword search found this photo taken by Chinese news agency Imagine China, which is available on AFP Forum.", "Below is a screenshot of the photo in the AFP Forum:", "The caption states in part: \"A court in northwest China's Shaanxi Province on Tuesday (10 July 2018) sentenced a man to death for killing nine middle school students with a knife. Zhao Zewei, 28, was found guilty of attacking students near the No. 3 Middle School in Mizhi County on April 27, leading to nine deaths and 12 injured, according to the Yulin Intermediate People's Court.", "“According to the verdict, Zhao, a former student of the middle school, bought five knives online and planned the attack because he wanted to get revenge on his former classmates who had teased him. Failing to find his classmates, Zhao randomly stabbed students who were leaving the school. The court sentenced Zhao to death on charges of intentional homicide. Zhao said he would file an appeal.”", "The same photo was published by Hong Kong Free Press here on July 11, 2018 and here in a Reuters report published by the South China Morning Post on July 10, 2018.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]