["A video of a uniformed officer brutally thrashing a man stripped naked is widely circulating on social media. The accompanying claim suggests the video is from a concentration camp in China holding Uighur Muslims. A part of the viral message reads, “China is crushing the Uighurs. Inside those concentration camps they are holding up to three million Muslims they are beating them to convert their religion, eat pork they are basically trying to impose Islam with Chinese characteristics or if not they gon murder them kill them separate them from their families and friends…”", "(Disclaimer: Alt News has not embedded the video in this report due to its distressing nature.)", "China’s mistreatment of ethnic Uighurs, who are mostly Muslims, is well documented. According to the latest reports, more than one million Uighurs, Kazakhs and others are held in concentration camps in Xinjiang province where they are tortured and brainwashed to honour the ruling Chinese Communist Party (CPC) and renounce their religious beliefs. The Chinese government, however, calls these facilities ‘vocational educational schools’.", "The viral video has been shared by several Pakistani users on both Facebook and Instagram. In fact, most clips circulating online are sourced to Instagram user @bigwax124 who had shared the video on September 9 drawing over 26,000 views.", "The video has been viral for a while. It drew over 21 lakh views from another Pakistani page on Instagram @desiplugt.v which shared it with a similar message in December 2019.", "Alt News broke the video into multiple keyframes using InVid and reverse-searched one of the images on Yandex. This led us to the same clip uploaded on YouTube with a caption in Indonesian—”Video Viral !! Tni Menangkap gangster ! lalu lihat apa yang terjadi”—that translates to “Video viral!! TNI catch the gangsters! Then look what happened.”", "TNI is the acronym for Tentara Nasional Indonesia which is the Indonesian National Armed Forces.", "A subsequent keyword search in Indonesian ‘Tentara nasional Indonesia memukuli gangster (Indonesian National Armed Forces beating gangster)’ led us to a report by Tribun Medan from March 2017. According to the article, the man was caught for his involvement in street crimes. The video was also featured in another report by pojoksatu.id which said that the man used to stab bikers.", "We also noticed that one of the unformed men in the video is wearing a helmet with the initials ‘PKD’. Alt News contacted Ilham Akhsanu Ridlo, a faculty member at the University of Airlangga in Indonesia. He said that PKD stands for Petugas Pengamanan Dalam or Internal Security Officer, hired as a private security guard.", "A video from Indonesia is thus viral with the false claim that it depicts the torture of Uighur Muslims in China.", "Donate Now", "Kalim is a journalist with a keen interest in tech, misinformation, culture, etc", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]