["The false post from 2019 features two photos of a banana with the caption: “Warning! If you see that your fruit contains red weird colour in it, don’t eat it because a groups of people is injecting fruits with blood containing HIV and AIDS. With the aim of killing millions of people around the world.”", "Another variation of the English post was shared 28,000 times since 2016 from here.", "The report also has been shared hundreds of thousands of times in Spanish here and here and French here.", "The HIV-in-fruit false tale is not new. In November 2015, The Washington Post shot down a story that went viral about a woman who claimed that people were injecting HIV into bananas in Nebraska.", "In 2016, another false report attracted quite a bit of attention. A person claimed that bananas sold at an Oklahoma Walmart had tested positive for HIV and that a boy died after becoming infected. However, multiple fact-checking organizations all refuted the report.", "The PAHO rejected the false reports out of hand.", "“Reports about people contracting the HIV virus from fruit are false. The HIV virus dies very quickly outside the body. So it’s not possible to transmit HIV with everyday contact like kisses and hugs, nor by sharing personal things like water or food,” a spokesman told AFP.", "The Public Health Agency of Canada explains here that a person risks contracting HIV if they:", "The CDC answered questions about contracting HIV from food here.", "When asked about the color of the fruit, Mexico City health officials told AFP that reddish color can be caused by a fungus called fusarium.  “Sometimes it gets in the fruit when the fruit is bruised physically. Sometimes it can be transmitted by an insect.”", "Canadian food safety authorities also noted that there are many plant ailments that could turn the inside of fruits, in this case a banana, a reddish color.", "The false narrative has not been contained to bananas. In late 2014, claims that oranges were infected with HIV circulated in English (1, 2, 3, 4), Spanish (1, 2), French (1), Portuguese and Arabic.", "The false posts claimed that north African oranges had been injected with the virus that causes AIDS. The caption read: “The immigration services of Algeria recoverred[sic] a large quantity of these oranges coming from Libiya[sic]. These oranges were injected with positive tested HIV & AIDS blood. Please share this message and warn people of the dangers involved.”", "Food safety experts contacted by AFP said that in the case of oranges, in addition to bacteria or fungi, an off-reddish coloring could be due to the presence of a natural reddish pigment.", "Based on our consultation with health experts, the HIV virus cannot be transmitted by fruit.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]