["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Newark Mayor Cory Booker doesn’t know whether Jeff Vanderbeek was acting out of callous disregard or indifference, but the mayor claims the managing partner of the New Jersey Devils broke his legal obligation to provide funds to the city for charities and job training.\n\nA long-running feud between city and team officials over unpaid rent, parking revenues and other issues at the Prudential Center culminated last week in a decision from a panel of arbitrators. That decision leaves Newark owing about $600,000 to the Devils.\n\nA few days after denouncing Vanderbeek as a \"high-class, high-falutin’ huckster and hustler,\" Booker continued his battle against the hockey team owner during an April 9 interview on MSNBC’s Morning Joe program.\n\n\"Not only did he make those promises, but he was required to do so by the contract,\" Booker said. \"He froze all those monies during the toughest years in ‘08-’09, when our economy was falling out. He refused to give the charitable dollars that he was required to give by the contract.\"\n\nFor the most part, the mayor’s claim is on solid ground, PolitiFact New Jersey found. As the legal dispute rolled on, the Devils did not make $1.5 million in combined payments over three years of the lease agreement for youth and community sports programs and job training programs, according to the arbitrators’ decision.\n\nBut the hockey team did pay $346,576 toward those programs for the first year of the lease agreement, according to the decision.\n\nIn a statement, Booker spokeswoman Anne Torres argued that \"the $346,576 paid only represents a fraction of what is owed.\"\n\n\"We’re disappointed that Politifact is choosing (to)...ignore the facts surrounding Jeff Vanderbeek’s decision to neglect his public commitments to the city,\" Torres wrote. \"Year after year, the Devils have denied resources to charities and job training programs.\"\n\nLet’s explain how those programs factor into the lease agreement for the arena.\n\nUnder a February 2005 lease agreement with the Newark Housing Authority, which owns the arena, the Devils agreed to pay rent consisting of four components. At the outset, two of those components were $250,000 annual payments for youth and community sports programs, as well as $250,000 annual payments for job training programs.\n\nThe Devils paid $173,288 for each of the two sets of programs for the first year of the contract, which ran from October 2007 to June 2008, according to the arbitrators’ decision. The payments were smaller because the first payments applied to less than a full year.\n\nBut as a result of the legal dispute, the Devils paid no rent in years two through four of the lease agreement, according to the arbitrators’ decision. The team was asserting its right to withhold rent under a clause in the lease agreement, the decision states.\n\nArena spokesman Robert Sommer argued that both the city and the team were withholding payments to each other.\n\n\"They withheld money as well,\" Sommer told us. \"No payments were being made in either direction.\"\n\nAmong other rent payments, the arbitrators determined that the Devils owe $1.5 million for the sports and job training programs for those three years. The hockey team also owes an additional $2,738 for the first year, according to the decision.\n\nBut instead of getting money back, city officials end up owing money to the Devils, because of parking revenues and other issues addressed in the arbitrators’ decision.\n\nOur ruling\n\nIn an interview on MSNBC’s Morning Joe, Booker claimed Vanderbeek \"froze all those monies during the toughest years in ‘08-’09\" and \"refused to give the charitable dollars that he was required to give by the contract.\"\n\nAccording to the arbitrators’ decision, the Devils paid $346,576 toward youth and community sports programs and job training programs for the first year of the contract. But the hockey team did not pay $1.5 million in combined payments over the next three years of the contract.\n\nWe rate the statement Mostly True.", "To comment on this ruling, go to NJ.com.", "Cory Booker interview on MSNBC’s Morning Joe, April 9, 2012\n\nArbitration decision in dispute between Newark and the Devils, accessed April 9, 2012\n\nThe Star-Ledger, Newark mayor Booker slams Devils owner following arbitrators' ruling against city, April 5, 2012\n\nThe Star-Ledger, Judge rules $2.7M parking payment letter is not enforceable contract in Newark, N.J. Devils dispute, Oct. 28, 2010\n\nThe Star-Ledger, Court to decide on revenue dispute between Newark, N.J. Devils, Oct. 16, 2010\n\nThe Star-Ledger, N.J. Devils, Newark Housing Authority abandon negotiations on Prudential Center rent, head to court, June 16, 2010\n\nThe Star-Ledger, Newark Housing Authority says NJ Devils owe millions in back rent on Prudential Center, May 15, 2010\n\nLease agreement between Newark Housing Authority and the New Jersey Devils, Feb. 2, 2005\n\nDemand for Arbitration filed by the Newark Housing Authority, June 2010\n\nE-mail interview with Anne Torres, spokeswoman for Mayor Cory Booker, April 10-11, 2012\n\nPhone and e-mail interviews with Robert Sommer, spokesman for the Prudential Center, April 11, 2012", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]