["About this rating", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "In July 2020, a meme was circulated on social media that supposedly showed a man named Christopher Harrington who filed a suspiciously named patent for a mask — CV19-N95 —  back in 2015, years before the COVID-19 coronavirus pandemic. The meme went on to claim that Harrington's patent was denied because Microsoft co-founder Bill Gates had filed a similar patent six months earlier:", "There's nothing factual about this meme. This graphic was created as a joke to mock the type of conspiracy theories that have plagued the internet during the pandemic, which began in 2019.", "For starters, the man in this photograph is not a government employee named Christopher Harrington who worked under the administration of President Barack Obama. This is a generic stock photo of a businessman.", "Second, we were unable to find any patents for a mask with the serial number CV19-N95. Lastly, we've looked into Gates' patent history for previous articles, and found no record of him filing a CV19-N95 patent in 2015.", "The biggest red flag, however, comes from an uncropped version of this meme. The above-displayed image was originally circulated with a disclaimer at the bottom, noting that all of the included claims were fictitious.", "The disclaimer reads:", "Source: Independent research July 2020 by me, Brett Lofgreen. This is completely fake. I made this whole thing up. That's a stock photo I found when I googled old man in suit. Also Christopher Harrington is the real name of the guy who played Jon Snow in Game of Thrones. Get it together, people. Memes aren't news sources.", "At some point, someone cropped this image to remove Brett Lofgreen's disclaimer and started to circulate this meme as if it relayed factual information. Here's the uncropped version of this meme. Note the small text at the bottom of the image:", "Evstatieva, Monnika.   \"Anatomy Of A COVID-19 Conspiracy Theory.\"\r\n    NPR.   10 July 2020.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]