["The one-minute, 48-second video was published here on Facebook on November 18, 2020. It has been viewed more than 9,800 times.", "The caption reads: “Pirate's hijacked the Batam Singapore ferry Indonesian special forces stromed the ferry and killed some and captured others and rescue the passenger's..”", "Batam is an Indonesian island close to Singapore.", "The video was also shared on Facebook here alongside a similar claim.", "The video also appeared with a similar claim in Malaysian here and here on Facebook, in Indonesian here and here, as well as here on YouTube.", "The claim, however, is false.", "A keyword search on Google found this November 15, 2020, report by Indonesian news site iNews about a military simulation exercise at Karimun, an Indonesian island close to Singapore and Batam.", "Below is a screenshot of the iNews report:", "The Indonesian-language report's first two paragraphs translate to English as: “One of the three pirates who took passengers hostage on the Oceanna 17 ship was shot dead by the Visit Board Search and Seizure (VBSS) team at the Tanjung Balai Karimun Navy Base. This was a simulation which was part of an operation to improve the readiness of soldiers to take action against maritime crimes.", "“In the simulation, the pirates asked the ship's captain to turn around. Pirates also took all of the passengers' belongings.”", "According to this report from Indonesian media site Batamnews, the simulation exercise was conducted on November 12, 2020.", "Below is a screenshot of the video in the misleading post (L) and the iNews report’s photo (R):", "Indonesian navy spokesman Julius Widjojono told AFP via WhatsApp on November 23, 2020, the video shows their simulation exercise. Referring to the first 17 seconds of the video, he said: “The ‘injured’ person seen in the video – a man in crew cut – is our personnel.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]