["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Sen. Marco Rubio previewed a potential 2016 presidential run in his new book, American Dreams, by outlining several policy positions -- including a push for energy independence and a distaste for industrial regulation.", "The Republican discussed in one chapter the future of the controversial Keystone XL pipeline, praising the process known as hydraulic fracturing (or fracking) for providing abundant oil and natural gas. But \"government-created obstacles\" such as overregulation of the energy sector make the United States its own worst enemy, Rubio wrote, and states such as Florida suffer for it.", "\"A private company is interested in building a natural gas pipeline into Florida,\" the book read. \"But before it can even begin construction, it is being forced to spend months under the review of six federal agencies.\"", "No matter your political stance on government regulation, we’re not civil engineers, so we didn’t know how many federal entities were needed to approve a new pipeline. We decided to pull the permits and find out whether Rubio was correct.", "Sabal Trail Transmission", "Neither Rubio’s Senate office nor his book publicist returned our calls, but the biggest pipeline project on the drawing board to come into Florida is the Sabal Trail Transmission expansion.", "The project stretches about 460 miles from central Alabama through Georgia to Florida just south of Orlando, eventually sending natural gas all the way to a Florida Power & Light plant in South Florida. The state’s gas capacity would increase 20 percent, at a cost of $3 billion. Duke Energy also has plans to build a connection from the pipeline to power its Crystal River plant.", "Environmentalists have decried the project, calling the pipeline and its compressor stations unnecessary and the source of too much pollution. It would be the third major natural gas pipeline into the state.", "The plan begat another controversy when it was discovered that Gov. Rick Scott owned a $53,000 stake in the company responsible for the project after signing legislation in 2013 to help approve permits for the pipeline. The Public Service Commission, run by Scott appointees, later that year approved building the pipeline.", "When Scott in 2014 disclosed the assets of a blind trust held in his name as part of his re-election campaign, the Broward Bulldog noted he owned the stake in Spectra Energy, the Houston company working with FP&L’s parent company NextEra Energy to build the pipeline.", "Scott’s office argued that because the holdings were bought as part of the blind trust, there’s no way the governor knew about it, and therefore the stake didn’t present a conflict of interest. Scott did use proceeds from the trust to fund in part his 2014 re-election bid. His office told us they had no further comment on the issue.", "Sabal Trail Transmission LLC, the joint Spectra and NextEra company building the pipeline, made no secret about the regulatory process for the pipeline, which began surveys in September 2013. The company directed us to a resource report that listed all the agencies from which the company must get approval. There are many state agencies listed, including the Alabama Department of Conservation and Natural Resources, Alabama Department of Environmental Management, Georgia Department of Natural Resources, Florida Department of Environmental Regulation, Florida Fish and Wildlife Conservation Commission and various water management districts.", "There’s also a list of federal agencies:", "Federal Energy Regulatory Commission, which oversees all pipeline building in the United States.", "U.S. Environmental Protection Agency, which oversees permits for compliance with health and environmental requirements.", "U.S. Army Corps of Engineers, which examines the project for dredge and fill permits and compliance with the Rivers and Harbors Act. Three districts of the Corps are involved.", "U.S. Department of Interior’s Fish and Wildlife Service, which examines the plan over three states for effects on endangered species and migratory birds.", "U.S. Department of Commerce’s National Oceanic and Atmospheric Administration and National Marine Fisheries Service, technically two agencies in the same federal department, which consult on the impact on endangered species, marine mammals and fish habitats.", "So that’s five listed outright in the project’s paperwork. But Sabal Trail Transmission LLC pointed out there’s a sixth, too.", "U.S. Department of Transportation, which has the authority to conduct a facilities design safety review, and perform construction inspections. And since there’s construction and other work involved, we’ll go ahead and tack on the U.S. Department of Labor’s Occupational Safety and Health Administration’s requirements, to give Rubio a smidge of extra credit.", "Is that too much regulation? That depends on your political point of view. But Susan Glickman, Florida director of the Southern Alliance for Clean Energy, which opposes the project, says it’s not like those groups are simply there to mire the project in red tape.", "\"Every agency has a distinct role in this pipeline, which is going through very delicate ecosystems, geologic formations and communities in our state,\" she said.", "The pipeline expansion is currently in regulatory review, with a projected completion date of May 2017.", "Our ruling", "Rubio said a private company building a natural gas pipeline into Florida \"is being forced to spend months under the review of six federal agencies.\"", "When we checked on the groups involved in the building of the Sabal Trail Transmission expansion, five agencies were listed in paperwork from the builder. Throw in the fact the Department of Transportation has to okay the plans, that makes six. OSHA compliance could bring it to seven, but Rubio doesn’t need it.", "We rate the statement True.", "Marco Rubio, American Dreams, Jan. 13, 2015", "Tampa Bay Times, \"Florida PSC approves third major natural gas pipeline,\" Oct. 24, 2013", "Ocala Star-Banner, \"Utility will build plant with or without new pipeline,\" July 14, 2014", "Broward Bulldog, \"Gov. Scott had stake in pipeline firm whose $3 billion venture he and his appointees backed,\" July 21, 2014", "Miami Herald, \"Gov. Rick Scott’s complex finances raise new questions about his state disclosure,\" Oct. 3, 2014", "Miami Herald, \"Lawsuit: Gov. Rick Scott shields more than $200 million in assets,\" Oct. 8, 2014", "Tampa Bay Times, \"Gov. Rick Scott taps assets in his blind trust to fund campaign,\" Nov. 1, 2014", "Sabal Trail Transmission LLC, \"Sabal Trail Project Resource Report 1: General Project Description,\" November 2014", "Florida Power & Light, \"Sabal Trail Transmission & Florida Southeast Connection,\" accessed Jan. 12, 2015", "Spectra Energy, \"Sabal Trail Transmission Expansion,\" accessed Jan. 12, 2015", "Interview with Andrea Grover, Sabal Trail Transmission LLC spokesperson, Jan. 9, 2015", "Interview with Jeri Bustamante, Gov. Rick Scott spokesperson, Jan. 9, 2015", "Interview with Susan Glickman, Florida director of the Southern Alliance for Clean Energy, Jan. 9, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]