["“Corona virus developed in Canada and stolen by China?” reads the headline of this article from January 22, 2020. It appears to be the first of a series of such claims about the coronavirus, which caused an outbreak in the central Chinese city of Wuhan before spreading elsewhere in the country and around the world.", "Other social media users soon shared similar versions of the claim, referring to the investigation of two Chinese virologists in Canada in 2019. Kyle Bass, an American hedge fund manager who was shorting Hong Kong’s currency, falsely claimed on Twitter that a “Chinese spy team” sent pathogens “to the Wuhan facility.” He was retweeted 12,500 times, and screenshots of the tweet were shared on Facebook.", "The claims appear to be based on a mischaracterization of August 2019 reports about a transfer of Ebola and Henipah viruses from a Canadian lab to China, and an investigation involving two researchers at Canada’s National Microbiology Laboratory (NML) in Winnipeg, in the central province of Manitoba.", "The NML is part of the federal Public Health Agency of Canada (PHAC), whose senior media officer Tammy Jarbeau told AFP in January 2020 that “this is disinformation. (These) statements made on social networks have no factual basis.”", "In July 2019, the Canadian Broadcasting Corporation (CBC) reported that two researchers with ties to China were removed from the NML in Winnipeg by the Royal Canadian Mounted Police (RCMP) for a possible “policy breach.” The article did not mention the coronavirus.", "Robert Cyrenne, spokesman for the RCMP in Manitoba, told AFP in January 2020 that “there is no connection between the outbreak in China and any RCMP investigation. Any reporting of such is misinformation.”", "Dr Xiangguo Qiu, who helped develop a treatment for the Ebola virus, her husband Keding Cheng, a biologist who has published papers on coronavirus strains such as SARS-CoV, and Chinese students working under them had their security access revoked for Canada’s only Level-4 lab, a facility equipped for research on the deadliest diseases.", "CBC later found through an access to information request that Qiu was responsible for a shipment of Ebola and Henipah viruses to the Wuhan Institute of Virology four months before she and her husband were escorted from the NML. These pathogens are not coronaviruses.", "The University of Manitoba, with which Qiu and Cheng were affiliated, ended their non-salaried appointments and re-assigned the students working with them, a spokesperson told the Canadian Press.", "In February 2021, CBC reported that the couple were let go from the lab.", "The RCMP did not comment on the current whereabouts of Qiu and Cheng for privacy reasons.", "In a letter published on February 19, 2020 in The Lancet medical journal, a group of public health scientists made a statement about the origins of the coronavirus, which causes the Covid-19 disease.", "“Scientists from multiple countries have published and analysed genomes of the causative agent, severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2), and they overwhelmingly conclude that this coronavirus originated in wildlife, as have so many other emerging pathogens,” they said.", "A team of scientists led by Shan-Lu Liu of The Ohio State University also concluded that there is no “credible evidence” that the virus -- officially known as SARS-CoV-2 -- was engineered in a laboratory, in research published on February 26, 2020.", "Suggestions that the virus emanated from a laboratory gained renewed attention in 2021. Such claims remain unproven, but US President Joe Biden on May 26 ordered intelligence agencies to report to him within 90 days on the origin of Covid-19.", "AFP Fact Check’s articles about Covid-19 can be found here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]