["About this rating", "Voting in the 2020 U.S. Election may be over, but the misinformation keeps on ticking. Never stop fact-checking. Follow our post-election coverage here.", "On Nov. 23, 2020, U.S. General Services Administrator Emily Murphy — an appointee of President Donald Trump — wrote a letter to President-elect Joe Biden that allowed him to start a formal transition of power. The paperwork, obtained by Snopes and displayed below, was the first formal recognition by Trump's government of a Biden presidency.", "The document from the head of the General Services Administration (GSA), an executive branch agency that oversees presidential transitions, raised questions about whether it meant that Trump himself acknowledged defeat to Biden.", "Concession statements to Americans or phone calls to winning candidates represent an informal step in the country's election process that typically occurs when one candidate secures the majority of electoral votes. Biden reached that milestone — winning key battleground states, including Michigan and Pennsylvania, by comfortable margins — weeks before Murphy's letter. However, Trump broke democratic norms by refusing to concede publicly.", "Instead, the president's campaign filed a barrage of lawsuits in local jurisdictions across the country and accelerated a misinformation campaign online that denied or falsely presented the election results. While legal experts said the litigation did not contain enough evidence to reverse Biden's win, Trump's supporters viewed the effort as a commendable, tough, not-going-to-back-down approach to electoral politics.", "\"It is not a stain on our national honor for a candidate to refuse to concede when there are open and compelling disputes about an electoral outcome,\" read a Nov. 23 statement by supporters of the Conservative Action Project, an initiative founded by former Attorney General Edwin Meese III.", "Despite not receiving Trump's concession, Biden filled his Cabinet for the White House, addressing the country under the \"Office of the President Elect,\" and states certified results of the popular vote in order to begin the process of voting for president through the Electoral College.", "Cue Murphy's letter on Nov. 23. The document carried out the government's obligation under the 1963 Presidential Transition Act to allow presidents-elect and their appointees, aids, and other staff — otherwise known as a transition team — to access millions of federal dollars and set up White House operations before swearing-in ceremonies that would take place the January after general elections.", "Murphy submitted the paperwork after election officials in Michigan certified Biden's win there, and a conservative Republican judge in Pennsylvania shot down a Trump campaign lawsuit, The Associated Press reported.", "Murphy's letter said:", "[Because] of recent developments involving legal challenges and certifications of election results, I have determined that you may access the post-election resources and services described in Section 3 of the Act upon request. The actual winner of the presidential election will be determined by the electoral process detailed in the Constitution.", "So, in short, a member of the Trump administration, Murphy, filed paperwork to change Biden's official title in government systems to \"apparent president-elect\" and, as a result, granted him new privileges that only someone with that job title in federal government gets.", "But it was a wrong interpretation of that procedural step to claim Trump had therefore conceded the 2020 presidential race.", "Let us note here: No constitutional mandate or federal law requires losing presidential candidates to acknowledge defeat in order for the election's processes to continue. Rather, concession speeches have been an informal tradition that often symbolized a losing candidate's willingness to help with a peaceful transition between presidencies.", "The Associated Press reported:", "In recent days, senior Trump aides including chief of staff Mark Meadows and White House counsel Pat Cipollone had also encouraged him to allow the transition to begin, telling the president he didn’t need to concede but could no longer justify withholding support to the Biden transition. [...]", "Senate Democratic leader Chuck Schumer said the GSA action “is probably the closest thing to a concession that President Trump could issue.″", "Even after Murphy's letter, the Trump campaign sent supporters emails promoting false claims about the election outcome to solicit donations, including messages to sell \"COUNT ALL LEGAL VOTES\" T-shirts.", "Additionally, on Twitter the president said: \"Remember the GSA has been terrific, and Emily Murphy has done a great job, but the GSA does not determine who the next President of the United States will be.\"", "The tweet accurately suggested that presidential elections are technically unfinished until the Electoral College casts its votes and Congress certifies that count, no matter what the administrator does or says.", "However, it was a misinterpretation of the U.S. Constitution, federal statutes, and state statutes to regard those post-Election Day procedures — steps that officially cement Americans' pick for president — as an opportunity to defy the will of the voters without providing compelling evidence of error or fraud.", "Hours after that tweet, Trump called reporters to a White House briefing room. He gave one-minute remarks about the economy and exited the room without taking questions from reporters. As he walked out, journalists shouted questions about his lack of a concession, and the president did not acknowledge them, White House footage of the event showed.", "In short, while a government agency under Trump's administration for the first time officially acknowledged Biden the \"apparent president-elect\" in a letter that grants him access to federal assets before his swearing-in ceremony on Jan. 20, 2021, it is false to claim that Trump had conceded defeat to the president-elect.", "Jessica Lee is Snopes' Senior Assignments Editor with expertise in investigative storytelling, media literacy advocacy and digital audience engagement.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]