["Joe Biden’s inauguration as the 46th US President took place on January 20. While outgoing President Donald Trump did not attend the inauguration ceremony, White House spokesperson Judd Deere told AFP that he left a letter for his successor before leaving office.", "An image of a letter allegedly from Trump to President Biden began circulating on the internet. The one-line letter reads, “Joe, You know I won.” It also appears that the letter has been signed by Trump.", "Grant Stinchfield of Newsmax tweeted the image and wrote, “I got a copy of the letter President Trump left behind for @JoeBiden.” It gained close to 1,000 retweets. (archived link)", "I got a copy of the letter President Trump left behind for @JoeBiden pic.twitter.com/1hVbstPQuj", "— Grant Stinchfield (@stinchfield1776) January 20, 2021", "Sharjah-based Hend bint Faisal Al Qasimi, Emirati princess of Al Qasimi family, also tweeted the image.", "President Trump left a letter at the White House for President-elect Joe Biden. pic.twitter.com/lA1ZNzNQAv", "— Hend F Q (@LadyVelvet_HFQ) January 20, 2021", "So did Padma Shri awardee Adnan Sami.", "Trumps letter to President Joe Biden !!! pic.twitter.com/f8rjyquYD9", "— Adnan Sami (@AdnanSamiLive) January 20, 2021", "This image has been shared by multiple users on Twitter and Facebook. Along with English, the image has been shared in Vietnamese, Thai, Spanish and Japanese.", "Alt News received several requests on our WhatsApp helpline number (+917600011160) and official Android application to authenticate the letter.", "As per The Washington Post, the tradition of Presidential letters to successors started in 1989 when Ronald Reagan was passing the Presidential baton to his Vice President, George HW Bush. According to CNN, these letters are handwritten.", "Trump has shirked several Presidential traditions including conceding election in a congratulatory phone call, welcoming the President-elect and the incoming First Lady to the White House and attending the successor’s inauguration. There was uncertainty around Trump upholding the norm of writing a letter to President Biden.", "From the last sitting President to lose reelection. George HW Bush was a true American and gentleman. Will Trump leave a letter to @JoeBiden? “You will be our President when you read this note. … Your success now is our country’s success. I am rooting hard for you.” pic.twitter.com/JvZKy1VJE1", "— John Anzalone (@JohnAnzo) January 18, 2021", "On January 20, President Biden was asked if Trump had offered him a letter at the Oval Office. He responded, “The president wrote a very generous letter,” referring to Trump. “Because it was private, I won’t talk about it until I talk to him. But it was generous.”", "Thus, Trump indeed wrote a letter to Biden but we do not know its contents.", "Since the controversy around the letter, several versions have been shared satirically. (1,2,3,4)", "BREAKING NEWS:", "I found the letter that Trump left for Biden… pic.twitter.com/F8NAwL6MIU", "— Brian O’Sullivan (@osullivanauthor) January 20, 2021", "Alt News compared an official letter by former president Trump to Nancy Pelosi, Speaker of the House of Representative in 2019. This letter was fact-checked by The New York Times. After a comparison with the viral image, we noticed that the date format [red] and the POTUS seal [green] in both letters are different.", "A hoax letter was used to falsely claim that former US President Trump wrote a one-line letter to his successor President Biden that read, “Joe, You know I won.”", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]