["The 54-second video was shared in this Facebook post on July 29, 2019, where it has been viewed more than 10,000 times.", "The post’s caption says: “Crocodile found in Open Nala in Mumbai”. The Hindi word “Nala” means gutter or sewer.", "Below is a screenshot of the misleading post:", "The same video has been published elsewhere on Facebook, for example here, here, here and here alongside similar claims. Some of these posts say the crocodile was found in a Mumbai suburb called Dadar.", "The clip was also published here and here on YouTube alongside a similar claim, and here on Twitter.", "The claim is misleading; the video was actually filmed in the Dadar locality of Chiplun district in India’s Maharashtra state – around 250km (150 miles) south of Mumbai, the state’s capital.", "A Google search using keywords like “crocodile”, “rescued” and “Mumbai” found this report published on a local news website on July 29, 2019, which contains the same video.", "The report is headlined “Alert: Viral crocodile rescue video from Dadar Mohalla in Chiplun, not Dadar in Mumbai”.", "It includes a picture of four men trying to get the crocodile into a cage, which is credited to “Kalusta.Chiplun”.", "A search on Facebook for the name Kalusta found a user with the same name had published the image and video along with one more video of the incident here on July 27, 2019.", "The post is embedded below:", "A caption alongside the image and videos in the post reads: “Crocodile is caught by forest officers. Location: Dadar Mohalla, #Chiplun. #Ratnagiri.”", "A journalist from AFP’s Delhi bureau spoke over Facebook messenger to Facebook user Kalusta, who confirmed the incident took place in Chiplun.", "“I am a resident of Chiplun. The videos are of Dadar Mohalla (locality) in Chiplun, Ratnagiri,” he replied to a query about the location of the incident.", "The incident was reported by Indian media, for example here on the website of newspaper Deccan Chronicle, here by NDTV and here by the Indian Express, all saying that it happened in Chiplun district in Maharashtra state.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]