["About this rating", "One popular fact included on numerous list of \"science facts that sound wrong\" is the claim that there are more trees on Earth than stars in our own Milky Way galaxy. This claim has its origins in a September 2015 paper published in the scientific journal Nature titled “Mapping Tree Density at a Global Scale,” which provided an estimate for the number of trees on Earth of 3.04 trillion:", "We provide the first spatially continuous map of forest tree density at a global scale. This map reveals that the global number of trees is approximately 3.04 trillion, an order of magnitude higher than the previous estimate. Of these trees, approximately 1.30 trillion exist in tropical and subtropical forests, with 0.74 trillion in boreal regions and 0.66 trillion in temperate regions.", "According to NASA education and outreach specialist Maggie Masetti, most estimates put the number of stars in the Milky Way at between 100 billion and 400 billion stars:", "There are different models for estimating the number of stars in the Milky Way and the answers they give differ depending on what is used as the average mass of a star. The most common answer seems to be that there are 100 billion stars in the Milky Way on the low-end and 400 billion on the high end. But I’ve seen even higher numbers thrown around.", "Inasmuch as these estimates approximate the actual (and impossible to verify) numbers of trees on Earth and stars in the Milky Way, the claim is accurate. However, it should be noted that estimating both the number of trees across the globe and stars in the sky is extremely difficult, and thus any such numbers come with plenty of caveats and limitations.", "The Nature paper that estimated the number of trees arrived at a total an entire order of magnitude higher than the previous estimate, made in 2005, of 400.25 billion trees. To arrive at the 2015 estimate, scientists used 428,775 actual field measurements from selected areas and from different biomes, then created mathematical models to extrapolate to a global scale.", "As discussed by Space.com’s Elizabeth Howell, coming up with an estimate for the number of stars in our galaxy carries with it even more uncertainty:", "The primary way astronomers estimate stars in a galaxy is by determining the galaxy's mass. The mass is estimated by looking at how the galaxy rotates, as well as its spectrum using spectroscopy ...", "Once a galaxy's mass is determined, the other tricky thing is figuring out how much of that mass is stars. Most of the mass will be made up of dark matter, which is a mysterious substance believed to bind most of the universe together ...", "So is there any way to figure out how many stars are for sure? In the end, it comes down to an estimate. In one calculation, the Milky Way has a mass of about 100 billion solar masses, so it is easiest to translate that to 100 billion stars. This accounts for the stars that would be bigger or smaller than our sun, and averages them out. Other mass estimates bring the number up to 400 billion.", "Unless someone develops a new methodology for counting stars which yields a much higher number than current estimates, it does seem as though there are more trees on Earth than stars in the Milky Way.", "Also relevant to the discussion is the fact that the authors of the tree study estimated that around 15 billion trees are cut down every year.", "Nadkarni, Nalini.   Between Earth and Sky.\r\n     University of California Press, 2008.   ISBN 0520933125.", "Howell, Elizabeth.   \"How Many Stars Are in the Milky Way?\"\r\n    Space.com.   21 May 2014.", "Crowther, T.W. et al.   “Mapping Tree Density at a Global Scale.”\r\n    Nature.   10 September 2015.", "Mastetti, Maggie.   \"How Many Stars Are in the Milky Way?\"\r\n    Space.com.   22 July 2015.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]