["“If you elect me…. your taxes are gonna be raised not cut,” Biden says in the clip used in an October 15, 2020 ad on Facebook from America First Action, which describes itself as an “official pro-Trump Super PAC.”", "Members of a PAC or a Super PAC pool their funding to support candidates or issues.", "America First Action used the same clip again in an October 21 ad that claimed Biden will raise taxes on the middle class, and earlier in an ad about Biden’s “radical” tax plan.", "Another political action committee, Preserve America PAC, also featured the clip in an October 16 ad that likewise claimed Biden wants to raise taxes.", "The clip used in the ads is misleading because it has been edited to exclude the rest of the conversation, as fact-checking organization Politifact previously reported.", "It is taken from a campaign event in South Carolina on February 27, 2020, and the full exchange can be seen from the 10:50 minute mark of this video:", "“By the way how many of you did really well with that $1.9 trillion tax cut… ?” Biden asks, referring to major 2017 tax reforms enacted under Trump.", "Biden’s position is that the middle class was largely left out of those changes, and in the video he addresses someone who acknowledged benefiting from Trump’s cuts.", "“Well you did? Well that’s great. You must, I’m glad to see you’re doing well already and I’m just, but guess what? If you elect me you’re not gonna have your, your taxes are gonna be raised not cut,” Biden says.", "Among his proposals, Biden says he will raise the corporate tax rate to 28 percent from 21 percent, return the top individual rate to 39.6 percent from 37 percent for people earning more than $400,000, place a 15 percent minimum tax on corporate book income and require a “true” minimum tax on all foreign earnings of US companies located overseas.", "Biden’s tax plan would generate between $2.4 trillion and $3.375 trillion in additional federal revenue over 10 years, according to estimates from three think tanks, the Urban-Brookings Tax Policy Center, the Tax Foundation and the Penn Wharton Budget Model at the University of Pennsylvania.", "The new tax revenue “comes mainly from those with relatively high household incomes, with the top one percent by income shouldering 80 percent of tax increase,” Penn Wharton analysts say on the program’s website.", "“In the first years under the Biden tax plan we would expect everyone making $400,000 or less to see either no change in their taxes or a tax cut,” Penn Wharton senior tax analyst John Ricco said in an email to AFP.", "Biden’s platform says he “won’t ask a single person making under $400,000 per year to pay a penny more in taxes, and will in fact enact more than one-dozen middle class tax cuts.”", "The Tax Policy Center estimated that the wealthiest one percent, earning more than about $788,000, would see their levies rise an average of almost $266,000 or 16 percent of after-tax income, in 2022.", "That compares with an average drop in taxes of $620 or one percent for middle income earners making around $50,000 to $89,000, the Tax Policy Center says.", "“High-income taxpayers would face increased income and payroll taxes,” the Center wrote.", "However, by 2030, analysts see an indirect effect of the corporate tax hikes that would lead to lower investment income and wages even for those earning less.", "This is not a direct tax increase and it would amount to a drop of no more than 0.5 percent of after-tax income for 80 percent of earners, according to Tax Foundation data.", "AFP has debunked other misleading claims about the Biden tax plan here and here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]