["About this rating", "In January 2018, click-seeking web site YourNewsWire.com fabricated an inflammatory Dolly Parton quote -- a sure-fire way to attract attention. According to the web site, the actress and country music star blamed California's recent natural disasters on the city's \"embracing Satan\":", "“California just keeps on being hit by disaster after disaster as foretold in the Bible,” the Grammy Award-winning entertainer and businesswoman told guests at Dolly Parton’s Stampede, a dinner and entertainment evening.", "“Pestilence, and epidemics, and crime, and disease. And you know what? They don’t even realize what is happening to them. They are so corrupted, they can’t even see what is right in front of their eyes.”", "“First they had the drought that lasted years and years, killing off billions and billions of dollars in crops, and making the soil so incredibly dry that a large rainstorm could easily turn into a major flood.", "“Then they had the fires. Awful, awful fires. Historical, deadly fires. Thousands lost their homes, scores lost their lives and their livelihoods. Did you know the Thomas fire is still burning? In the winter!“", "[...]", "“And don’t forget the sexual abuse scandals rocking Hollywood. They are being punished for embracing Satan and rejecting God.”", "The web site likely targeted Parton because of news this week that the dinner show attraction\"Dolly Parton's Dixie Stampede\" had stripped the word \"Dixie\" from its title to avoid glorifying the antebellum South. The show will now be known as \"Dolly Parton's Stampede.\" The news angered a portion of the public (mainly those upset over the removal of confederate monuments), providing Your News Wire with another opportunity to stir the pot.", "The quote Your News Wire reported does not appear in any genuine news publication. The web site doesn't provide any video or audio recording to prove that Parton actually spoke these words. This fictional quote also stands in stark contrasts to Parton's previous comments and actions following natural disasters.", "After fires ravaged Tennessee in November 2016, for instance, the country icon established the My People Fund  to aid the recovery effort. She said at the time:", "I know the money helps but most of all I want people to know we will always provide you a shoulder to lean on.\"", "The success of the \"My People Fund\" inspired Parton to lend a hand to other disaster victims. After a series of hurricanes battered the United States in 2017, she donated books and money to One America Appeal for Hurricane Relief.", "Nor does the quote square with Parton's previously-stated religious beliefs. In a 2015 Reuters interview, she spoke about the need for tolerance:", "“We don’t try to shove anything down anybody’s throat. We are very open,” says Parton, who is well known for her support of the LGBT community. “So many of my businesspeople and my best friends are different faiths, and I work with them, live with them, love them. The gays and lesbians, they come to our parks. I think people just know I’m a very open and accepting person.", "“And in any religion we’re supposed to be that—we’re supposed to be kind...we’re not supposed to pass judgment. Our Bible says, ‘Judge not, lest ye be judged,’ and I believe in all those kinds of things.”", "Flanagan, Andrew.   \"Dolly Parton Provides Fire Victims 'Shoulder To Lean On.\"\r\n    NPR.   8 May 2017.", "USA Today.   \"Dolly Parton Donates Money, Books to 2017 Hurricane Victims.\"\r\n    18 October 2017.", "Alcorn, Jonathan.  \"Dolly Parton Talks About Her 'Judge Not, Lest Ye Be Judged' Philosophy.\"  Newsweek.  28 August 2015.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]