["About this rating", "Tweets by two academics in October 2018 shed light on legislative efforts in North Carolina to target non-white voters, as documented by court excerpts they shared which were distributed widely online.", "On 15 October 2018, Sarah Damaske, an associate professor of labor and employment relations at Penn State University, shared a tweet from University of Chicago professor Harold Pollak linking to a federal court decision regarding the state's \"voter ID\" law, known as House Bill 589 or SL 2013-381:", "This can’t be retweeted enough. North Carolina publicly stated in court that the reason they stopped Sunday voting was that counties with Sunday voting were disproportionately black, and blacks disproportionately vote Democrat. https://t.co/5C3lCMSmix", "— Sarah Damaske (@SarahDamaske) October 15, 2018", "The law, which was passed in 2013, shortened the early voting period from 17 days to ten and eliminated both same-day voter registration and two Sunday voting dates which frequently saw African-American churches provide rides for parishioners to the polls.", "While Pollak's original tweet posted a day earlier, had been shared more than 9,000 times Damaske's amplification of it had been retweeted nearly 23,000 times within a week after her posting of it.", "\"I think people picked it up, because there is a lot of concern about the many stories about voter suppression along racial lines in this election cycle (even though the story that Dr. Pollack tweeted about and that I re-tweeted was from an earlier voting cycle),\" Damaske said of the re-circulated tweet.", "The legal excerpt cited in the tweet was taken from a 29 July 2016 decision by the the U.S. Court of Appeals for the 4th Circuit which struck down the voter ID law:", "As \"evidence of justifications\" for the changes to early voting, the State offered purported inconsistencies in voting hours across counties, including the fact that only some counties had decided to offer Sunday voting. The State then elaborated on its justification, explaining that \"[c]ounties with Sunday voting in 2014 were disproportionately black\" and \"disproportionately Democratic.\"", "The decision overturned a district court ruling upholding the state voter ID law. Writing for the 4th Circuit, Judge Diana Gribbon called the prior decision \"erroneous\":", "Socioeconomic disparities establish that no mere \"preference\" led African Americans to disproportionately use early voting, same-day registration, out-of-precinct voting, and preregistration. Nor does preference lead African Americans to disproportionately lack acceptable photo ID. Yet the district court refused to make the inference that undeniably flows from the disparities it found many African Americans in North Carolina experienced. Registration and voting tools may be a simple \"preference\" for many white North Carolinians, but for many African Americans, they are a necessity.", "According to Gribbon, the 4th Circuit court concluded \"that the General Assembly would not have eliminated same-day registration entirely but for its disproportionate impact on African Americans,\" and said that parts of the law amounted to solutions in search of a problem:", "The only clear factor linking these various \"reforms\" is their impact on African American voters. The record thus makes obvious that the \"problem\" the majority in the General Assembly sought to remedy was emerging support for the minority party. Identifying and restricting the ways African Americans vote was an easy and effective way to do so. We therefore must conclude that race constituted a but-for cause of SL 2013-381, in violation of the Constitutional and statutory prohibitions on intentional discrimination.", "In May 2017, the U.S. Supreme Court opted not to hear an appeal of the lower court's ruling:", "The U.S. Supreme Court rebuffed a Republican bid to revive a strict North Carolina voter-identification law that a lower court found deliberately discriminated against black voters, handing a victory to Democrats and civil rights groups.", "The appeals court found that the law’s provisions “target African-Americans with almost surgical precision” and “impose cures for problems that did not exist,” concluding that the Republican-led legislature enacted it “with discriminatory intent.”", "Republicans have said laws like the one in North Carolina are needed to prevent voter fraud. Democrats have said such laws are voter suppression measures intended to make it harder for groups that tend to back Democratic candidates, including black and Hispanic voters, to cast ballots.", "Barnes, Robert and Ann E Marimow.   \"Appeals Court Strikes Down North Carolina's Voter-ID Law.\"\r\n    The Washington Post.   29 July 2016.", "Hurley, Lawrence.   \"U.S. Top Court Lets North Carolina Voter Law Die, Pleasing Rights Groups.\"\r\n    Reuters.   15 May 2017.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]