["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "West Virginia Attorney General Patrick Morrisey speaks on Sept. 18, 2017, at a news conference at Marshall University. (APJohn Raby)", "The West Virginia teachers’ strike in February was months ago, but rhetoric about the strike has continued to crop up on the campaign trail.", "On Sept. 14, Sen. Joe Manchin, D-W.Va. -- who is in a tough reelection contest against West Virginia Attorney General Patrick Morrisey -- tweeted, \"It’s really a shame that Pat doesn’t have the guts to answer questions about his lawsuit to take away coverage for people with pre-existing conditions, his career as a Washington lobbyist for the opioid industry, or his efforts to put educators in jail.\"", "“It’s really a shame that Pat doesn’t have the guts to answer questions about his lawsuit to take away coverage for people with pre-existing conditions, his career as a Washington lobbyist for the opioid industry, or his efforts to put educators in jail.” https://t.co/R94dTXNJvY", "We’ve already looked at the question of pre-existing conditions and his lobbying history, so we decided to look at the question about the teachers’ strike.", "PolitiFact previously concluded that Morrisey was on solid legal ground when he said the teacher strike was unlawful. But did he make efforts to put teachers behind bars, as Manchin charged?", "Let’s take a closer look. (Manchin’s office did not respond to inquiries.)", "Teachers in West Virginia went on a nine-day strike on Feb. 23, 2018, after Republican Gov. Jim Justice signed a bill giving teachers and other state employees a 1 percent to 2 percent pay raise, an amount they deemed insufficient. The striking teachers teachers sought higher salaries and relief from rising health care costs.", "The strike involved 34,000 workers and touched all 55 counties; it was considered one of the nation's biggest strikes in recent years, according to Tthe New York Times. It ended when Justice signed a bill giving teachers a 5 percent raise.", "From the start, Morrisey asserted that the strike was unlawful.", "On Feb. 21, 2018, he tweeted, \"The impending work stoppage is unlawful and should come to an end.\"", "As we’ve previously reported, there was precedent for this. During a 1990 teacher strike, the West Virginia Supreme Court found that the stoppage was unlawful because \"public employees provide essential public services which, if interrupted by strikes, would threaten the public welfare.\" A preliminary injunction was issued by Jefferson County Court in 1990, ending the strike.", "MetroNews reported that Morrissey was ready to take legal action against striking teachers if he was asked to do so under the law.", "\"Let us make no mistake,\" Morrisey told MetroNews on Feb. 21. \"The impending work stoppage is unlawful. State law and court rulings give specific parties avenues to remedy such illegal conduct, including the option to seek an injunction to end an unlawful strike.\"", "However, Morrisey’s words were more precise -- and accurate -- than Manchin’s. Morrisey said the strikes would be unlawful -- but that doesn’t mean they would lead to \"jail\" for striking teachers.", "\"The teachers may have been subject to an injunction to go back to work, but they could not have been prosecuted for going out on strike,\" said West Virginia University law professor Bob Bastress.", "In a news release at the time, Morrisey talked about the possibility of seeking an injunction -- but not jail. \"State law and court rulings give specific parties avenues to remedy such illegal conduct, including the option to seek an injunction to end an unlawful strike,\" he wrote.", "When we reached out to Morrisey’s campaign, a spokesman said that Morrisey never suggested locking up teachers. \"You can go through his statements from the time, and you won't find anything that suggests what Manchin is claiming,\" the campaign said in a statement.", "When asked about what Morrisey meant when hold MetroNews he was willing to take \"legal action\" against teachers, the Morrisey campaign cited an opinion letter by the then-Attorney General, Democrat Roger Tompkins, in 1990.", "Tompkins wrote that teachers who went on strike in 1990 could be \"disqualified from teaching in a public school for one year, and the state department of education and county board of education may withhold all papers and credentials of such teacher.\"", "These are serious consequences -- but well short of jail.", "\"Morrisey has civil legal authority, which does not include criminal authority,\" the campaign said. \"That authority is left to the governor and the criminal justice system.\"", "Manchin tweeted that Morrisey made \"efforts to put educators in jail.\"", "Morrisey, in his capacity as attorney general, said the strike was unlawful -- but that meant that striking teachers could have been punished by disciplinary actions, not criminal charges that could land them in jail. While the disciplinary actions could have had severe consequences in some cases, Manchin’s suggestion that \"jail\" could have resulted is a significant exaggeration.", "We rate the statement False.", "Joe Manchin, tweet, Sept. 14, 2018", "Roger Tompkins, opinion letter, March 8, 1990", "West Virginia Supreme Court of Appeals, Jefferson Cty. Bd. of Educ. v. Educ. Ass'n, 393 S.E.2d 653 (1990)", "Charleston Gazette-Mail, \"WV school employees may face legal consequences for work stoppage,\" Feb. 20, 2018", "Patrick Morrisey, tweet, Feb. 21, 2018", "MetroNews, \"Attorney General: Teacher strike is illegal,\" Feb. 21, 2018", "PolitiFact, \"Precedent says West Virginia teachers strike is unlawful,\" Feb. 21, 2018", "New York Times, \"West Virginia Raises Teachers’ Pay to End Statewide Strike,\" March 6, 2018", "The Nation, \"The West Virginia Teachers Strike Shows That Winning Big Requires Creating a Crisis,\" April 9, 2018", "Email interview with Bob Bastress, West Virginia University law professor, September 28, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]