["About this rating", "Voting in the 2020 U.S. Election may be over, but the misinformation keeps on ticking. Never stop fact-checking. Follow our post-election coverage here.", "In October 2020, a photograph supposedly showing Democratic U.S. presidential candidate Joe Biden and running mate Sen. Kamala Harris sitting near a group of people burning an American flag was circulated on social media:", "This is not a genuine photograph of Biden and Harris sitting near a group of people burning an American flag. This is a composite of two wholly unrelated pictures.", "The bottom half of the composite image comes from a photograph that was taken for the August 2020 issue of People Magazine. The original photograph was captioned:", "\"From left: Sen. Kamala Harris and former Vice President Joe Biden photographed for PEOPLE on Aug. 15 outside Wilmington, Delaware. GIONCARLO VALENTINE.\"", "The top half of this image comes from a photograph taken by Elias Valverde II of The Shorthorn, the student newspaper at University of Texas at Arlington, and shows a group of people burning U.S. flags in the hours after a peaceful protest devolved into violence in June 2020 in Arlington, Texas. At least six people were arrested during this night of unrest. This photograph was originally captioned:", "\"Protesters cheer as American flags burn outside the Ott Cribbs Public Safety Center during a demonstration against police brutality June 1, 2020, in Arlington. Protesters threw the flag poles at the police station after the flags had burned. (Elias Valverde II / The Shorthorn)\"", "While this composite image was created in an apparent attempt to connect Biden and Harris to the more violent aspects of the protests that engulfed the U.S. during the summer of 2020, it should be noted that on June 2 — the day after this photograph of protesters burning an American flag was taken — the Democratic presidential candidate delivered a speech in Philadelphia, Pennsylvania in which he denounced such violent acts:", "\"There is no place for violence, no place for looting or destroying property or burning churches, or destroying businesses — many of them built by people of color who for the first time were beginning to realize their dreams and build wealth.\"", "This isn't the first time that the original photograph of Biden and Harris has been subjected to digital manipulations. In August 2020, the \"fake album covers\" section of Reddit re-imagined this image as a, well, a fake album cover:", "Oxner, Reese.   \"Peaceful Protest Escalates Into Looting at Walmart Near AT&T Stadium in Arlington, Six Arrested.\"\r\n    Dallas Morning News.   2 June 2020.", "Biden, Joe.   \"Remarks as Prepared for Delivery by Vice President Joe Biden in Philadelphia, Pennsylvania.\"\r\n    Medium.   2 June 2020.", "Carlson, Adam.   \"Joe Biden and Kamala Harris' First Joint Interview: 'Audacity' of Partnering & Their 'Modern Family' Values.\"\r\n    People.   18 August 2020.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]