["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A viral Facebook post depicts President Donald Trump as a generous airline owner who donated his planes to transport American soldiers home from Saudi Arabia in 1991. But the details don’t square with what happened.", "The post features a letter purportedly written by a man named Ron Knouse. He describes how he and other soldiers had to wait four days for buses to the airport because there was a shortage of planes at the end of Operation Desert Storm.", "\"Finally, the buses came and took the young man to the airport. The planes waiting were from Tower Air. The owner of Tower Air had volunteered his planes and staff to bring soldiers home for the cost of fuel only. Happily, the young veteran got home just in time for Easter weekend in 1991 and spent that time emotionally healing with friends and family surrounding him…", "\"The Airline owner – Donald J Trump.", "\"This needs to go viral. He’s done so many good things you never hear about.\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Donald Trump did operate an airline at one time. But the details of the letter are inaccurate. Trump did not own Tower Air, and we found no evidence he assisted in the transport of military personnel from Saudi Arabia.", "Beyond that, Trump’s airline — Trump Shuttle — was being controlled by a consortium of banks, not Trump, when the United States military chartered flights from the airline for personnel transport. That was for flights within the United States, not from Saudi Arabia.", "A different story about a Trump plane transporting 200 marines from North Carolina to Florida after Operation Desert Storm in 1991 emerged when conservative talk radio host Sean Hannity aired a now-deleted segment about it in May 2016, during Trump’s presidential campaign. In that version, about 200 Marines took two trips on a Trump-owned plane from North Carolina to Florida after a logistics error left them stranded.", "While Trump’s 2016 presidential campaign allegedly confirmed the story, details show that he was not personally involved in transporting any American troops.", "Trump ran the airline for a short time. In May 1989, he purchased Eastern Airlines for $365 million, renaming it Trump Shuttle. The airline operated short flights in the northeastern United States using a fleet of Boeing 727 airliners.", "A 2016 fact-check by the Washington Post reported that while some Trump Shuttle planes did transport military personnel around the country in the early 1990s, it was the U.S. military that chartered those flights, not Trump personally.", "Retired Lt. Gen. Vernon Kondra, who was in charge of all military airlift operations at the time, told the newspaper his notes indicated several references to a 1990-91 contract for Trump Shuttle to carry personnel across the country. He said it would have made little sense if Trump personally arranged the flights and said he was \"certainly not aware\" of him being involved.", "Trump wasn’t in a position to donate plane rides, anyway.", "NYC Aviation reported that he had defaulted on his loan in September 1990, and control of the airline went back to the banks until it was sold to US Air. US Air agreed in late 1991 to operate the airline with an option to buy it outright after five years. By April 1992, Trump Shuttle had ceased to exist when it was merged into a new corporation, Shuttle, Inc., which began operating as the USAir Shuttle.", "Trump’s name does not appear anywhere in the nearly 20-year history of Tower Air, which is mentioned as being owned by Trump in the Facebook post.", "The airline contracted with the Department of Defense to transport soldiers on charter flights in the early 1990s and was founded by Zev Melamid, Mordechi Gill, Morris Nachtomi and Sam Fondlier in 1982, according to Airline History records.", "When Tower Air filed for bankruptcy in May 2000, Nachtomi was listed as its CEO.", "To summarize our findings, Trump Shuttle planes were contracted by the U.S. military to transport personnel around the country while the airline was in the process of being sold; it was not under Trump’s control at the time. Trump was not affiliated with Tower Air, which contracted with the Department of Defense in the 1990s to transport soldiers stationed overseas.", "We rate this Facebook story False.", "Facebook post, March 31, 2019", "Wayback Machine, 200 Stranded Marines Needed A Plane Ride Home, Here's How Donald Trump Responded, May 19, 2016", "Snopes, Did Donald Trump Transport Stranded Troops on His Own Airplane?, Oct. 22, 2016", "Washington Post, Too good to check: Sean Hannity’s tale of a Trump rescue, Aug. 11, 2016", "TruthorFiction, Did Donald Trump’s Tower Air Transport Soldiers Home From the First Gulf War?, March 4, 2016", "The Globe and Mail, Trump: I ran a great airline, May 5, 2011", "NYC Aviation, Remember That One Time Donald Trump Owned an Airline?, July 9, 2015", "The Washington Post, The ups and (mostly) downs of Trump Shuttle, the president’s long-defunct airline, Jan. 2, 2018", "Airline History, Tower Air, Accessed Jan. 3, 2020", "Funding Universe, Tower Air, Inc. History, Accessed Jan. 3, 2020", "New York Times, CHARTER AIRLINES CARRY MANY MILITARY TRAVELERS, Dec. 19, 1985", "New York Times, Deal Made On Trump Shuttle, Dec. 20, 1991", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]