["Democratic presidential candidate Joe Biden campaigns at a home in Detroit, Sept. 9, 2020. (AP)", "• The photo doesn’t show Biden’s current house.", "• Biden bought the property in 1975 for $185,000. He renovated and sold it for $1.2 million in 1996.", "Social media users are circulating a claim about a house purportedly owned by Democratic presidential candidate Joe Biden, and questioning how he could afford it on a government salary.", "Eric Trump, President Donald Trump’s son, tweeted the aerial-view photo of the Delaware mansion with this comment: \"The salary of a U.S. senator is $174,000 per year. This is Joe Biden’s house. ... seems legit.\" The tweet has been shared more than 50,000 times.", "The salary of a U.S. senator rose to $174,000 in 2009, the year Biden left the chamber to become vice president. But Eric Trump’s tweet juxtaposed that figure with the photo of a mansion that hasn’t belonged to Biden in nearly 25 years. Biden bought the house in 1975 for $185,000, then sold it in 1996 after major renovations.", "The image comes from a Wall Street Journal article about Biden’s real estate investments. Wall Street Journal staffers confirmed they used Pictometry, an aerial imaging service, to download the satellite image of the property. The same article reported that Biden purchased the DuPont mansion in 1975 for $185,000, and sold it in 1996 for $1.2 million. He does not currently own it.", "A parcel search for the Delaware address on New Castle County’s website confirmed that Biden sold the property in 1996. The New York Times also reported the sale in a 2008 article, which said Biden initially bought the property after he learned it was slated for demolition.", "The Eric Trump tweet cites a Senate salary figure of $174,000 to suggest that the mansion would have been beyond Biden’s means. Biden’s salary as a senator varied from $42,500 a year when he began serving in the Senate in 1973, to $169,300 by the time he left the chamber in January 2009. As vice president, he earned up to $230,700 a year, and his wife, Jill, continued her teaching career.", "But after he left office, both Bidens wrote books, and his financial disclosure form lists dozens of speaking engagements and book-tour events that typically earned him five- and six-figure payments each. The couple, who file their taxes jointly, reported adjusted gross income of about $11 million in 2017.", "Biden’s campaign confirmed that he owns two Delaware properties, a house on a 4-acre lakefront lot in Wilmington and a vacation house on Rehoboth Beach, Del.", "The campaign also directed PolitiFact to Richard Ben Cramer’s book, \"What It Takes,\" which describes some of the work Biden put into the home he sold.", "The Trump campaign didn’t respond to requests for comment.", "The tweet claimed that a photo of a Delaware mansion was Biden’s current home, and appears to question how he paid for the property with a senator’s salary.", "Biden bought the mansion in 1975 for $185,000, when his salary was about $42,500, then sold it in 1996 for $1.2 million after a renovation. He does not live there.", "We rate this claim Mostly False.", "Twitter post, Oct. 17, 2020", "Google Images, accessed Oct. 18, 2020", "Tineye.com, accessed Oct. 18, 2020", "Wall Street Journal, \"In His Own Words, Joe Biden Was ‘Seduced by Real Estate,’\" accessed Oct. 19, 2020", "Google Maps, \"6 Montchan Dr, Wilmington, DE,\" accessed Oct. 19, 2020", "Twitter post, Oct. 17, 2020", "The New York Times, \"An Everyman on the Trail, With Perks at Home,\" accessed Oct. 19, 2020", "New Castle County Delaware Parcel Search, accessed Oct. 19, 2020", "DelawareOnline.com, \"Search Delaware property records statewide,\" accessed Oct. 19, 2020", "United States Senate, \"Senate Salaries,\" accessed Oct. 20, 2020", "The Washington Post, \"Once the poorest senator, ‘Middle Class Joe’ has reaped millions since he left the vice presidency,\" accessed Oct. 20, 2020", "PolitiFact, Fact-checking Joe Biden’s claim about his own income, accessed Oct. 20, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]