["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "On the president’s list of gun-control priorities: require background checks for all gun sales.\n\nThat step has widespread support, even among gun owners, gun-control advocates say.\n\nIn fact, many assume such a measure is already in place, claimed Rep. Jackie Speier, a California Democrat who is vice chair of a new congressional Gun Violence Prevention Task Force.\n\n\"Even members of the NRA, when they were polled recently, were under the impression that everyone has a criminal background check,\" she told Ed Schultz in a Jan. 15, 2013, appearance on MSNBC’s The Ed Show.\n\nWe wondered: Is that true?\n\nWe asked Speier’s office to point us to the poll.\n\n Mayors Against Illegal Guns\n\nSpeier’s communications director, Jenny Werwa, told us the lawmaker based her comment on a July 2012 poll commissioned by Mayors Against Illegal Guns.\n\nAs its name suggests, the group includes city mayors concerned with illegal guns and gun violence and is helmed by New York Mayor Michael Bloomberg, an independent, and Boston Mayor Thomas Menino, a Democrat.\n\nThe group hired Republican pollster Frank Luntz. His organization, Luntz Global, polled 945 gun owners nationwide in May 2012, half of whom were gun owners who were \"current or lapsed\" members of the National Rifle Association and half of whom were non-NRA gun owners.\n\nThe poll showed that \"gun owners’ knowledge of existing laws is tenuous,\" Luntz Global’s report says. \"Over half (53 percent ) of non-NRA members and 57 percent of NRA members believe the statement, ‘Everyone who wants to buy a gun has to pass a background check to complete the purchase’ is true.\"\n\nThe reality is that background checks are required in sales by federally licensed gun dealers, but not for those by private sellers.\n\nThe White House wants to require criminal background checks for all gun sales. The National Rifle Association, which supports the current background check requirement, has suggested that an expansion of the law might be a step toward gun confiscation.\n\n What the NRA says\n\nWe contacted NRA spokesmen to ask for their evaluation of Speier’s claim, but they didn’t respond.\n\nWe found an NRA response, however, to a similar poll by Mayors Against Illegal Guns conducted by Frank Luntz in 2009.\n\nThe Web post calls Bloomberg an \"anti-gun politician-activist,\" and attacks Luntz, a widely quoted communications consultant for Republican politicians and Fortune 100 companies, with decade-old criticism from two polling organizations.", "In other words, the NRA attacked the source of the previous poll, not the results.\n\nWe looked for other polls to see if they exposed weakness in the poll’s conclusions.\n\nWe didn’t immediately find a survey that addressed gun owners’ knowledge of existing laws. But the Luntz poll also asked about support for \"requiring a criminal background check of anyone purchasing a gun.\" The poll found that 82 percent of gun owners were in favor of required background checks, including 74 percent of NRA members.\n\nRecent independent polls show similar numbers. A Pew Research Center poll from Jan. 9-13, 2013, of 1,502 adults found 85 percent of gun owners favor making private gun sales and sales at gun shows subject to background checks — nearly identical to the Luntz poll. A CBS/New York Times poll conducted Jan. 11-15 among 1,110 adults showed that 85 percent of respondents living in a household with an NRA member support universal background checks.\n\n Our ruling\n\nRep. Jackie Speier said, \"even members of the NRA, when they were polled recently, were under the impression that everyone has a criminal background check.\"\n\nShe relied on a poll conducted last summer by an interest group that broke out results for \"current or lapsed\" NRA members. It showed a majority of those NRA gun owners believe \"everyone who wants to buy a gun has to pass a background check.\" While we didn’t find recent polls asking a similar question, we did find other polls showing that NRA members support background checks for all, including private purchases and purchases at gun shows.\n\nIt should be clarified that the Luntz poll results were for current and former NRA members.\n\nFor that reason, we rate this claim Mostly True.", "MSNBC, \"The Ed Show for Wednesday, January 16th, 2013,\" Jan. 17, 2013\n\nCongresswoman Jackie Speier, Gun Control, accessed Jan. 22, 2013\n\nEmail interview with Jenny Werwa, communications director for Rep. Jackie Speier, D–Calif., Jan. 22, 2013\n\nMayors Against Illegal Guns, Gun Owners Poll by Luntz Global, July 2012\n\nMayors Against Illegal Guns, \"New Poll of NRA Members By Frank Luntz Shows Strong Support For Common-Sense Gun Laws, Exposing Significant Divide Between Rank-And-File Members And NRA Leadership,\" July 24, 2013\n\nCenter for American Progress, \"RELEASE: Poll Shows NRA Members at Odds with NRA Leadership on Commonsense Gun Laws,\" July 24, 2012\n\nNational Journal, \"Gun Owners, NRA Members Back Some Restrictions,\" July 24, 2012\n\nLos Angeles Times, \"Poll: Most gun owners support some gun controls,\" July 24, 2012\n\nBrady Campaign to Prevent Gun Violence, \"Facts, Studies and Reports: Gun Owners Poll,\" July 2012\n\nWhite House, \"Now is the Time,\" Jan. 16, 2013\n\nCBS News Polls, \"9 in 10 back universal gun background checks,\" Jan. 17, 2013\n\nPew Research Center for the People and the Press, \"In Gun Control Debate, Several Options Draw Majority Support,\" Jan. 14, 2013\n\nNational Rifle Association, \"Update On Bogus 'Poll' Of NRA Members,\" Feb. 9, 2010\n\nNational Rifle Association Institute for Legislative Action, \"Gun Owners Enter the Fight of Our Lives,\" Nov. 21, 2012\n\nNational Rifle Association Institute for Legislative Action, \"Private Sales Restrictions and Gun Registration,\" Jan. 17, 2013\n\nLuntz Global, About Frank Luntz, accessed Jan. 23, 2013\n\nWashington Post, \"Famous for 15 Minutes,\" Aug. 28, 2000", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]