["About this rating", "On Oct. 28, 2019, the website Genesiustime published an article positing that Congresswoman Ilhan Omar, D-Minnesota, had offered her condolences to the friends and family of Islamic State leader and \"austere scholar\" Abu Bakr al-Baghdadi after the terrorist leader died during a U.S. military raid:", "Omar offers condolences to friends and family of ‘austere scholar’ al-Baghdadi", "Abu Bakr al-Baghdadi, the reclusive leader of the world’s most austere religious movement, was killed during a daring nighttime raid by U.S. Special Operations soldiers in northwestern Syria.", "US Rep. Ilhan Omar released a statement offering her condolences to the friends and family of the deceased religious leader.", "“It is with a heavy heart that I offer my thoughts and prayers to the friends and family of such a remarkable man—the austere religious scholar, Abu Bakr al-Baghdadi,” Omar said. “I probably would’ve married him if we were more closely related.”", "This item was not a factual recounting of real-life events. The article originated with a website that describes its output as being humorous or satirical in nature, as follows:", "We strive to provide the most up-to-date, accurate fake news on the Internet. Our team of journalists, hacks, and starving writers only want one thing: to make you laugh and/or cry.", "This fictional article's inclusion of the phrase \"austere scholar\" is referencing an errant obituary headline that briefly appeared on WashingtonPost.com after al-Baghdadi's death. Omar was likely chosen as the target of this piece of satire because she is a Muslim. Omar, however, did not praise al-Baghdadi or offer condolences to his family.", "Here's what the Minnesota lawmaker actually said after al-Baghdadi's death:", "Abu Bakr al Baghdadi was an evil man and a terrorist, who terrorized the world with violence and a message of hate.", "The world is a safer place without him.", "We have deep gratitude for the brave men and women who carried out this dangerous operation.", "— Ilhan Omar (@IlhanMN) October 27, 2019", "For background, here is why we sometimes write about satire/humor.", "Genesiustimes.com.   \"Omar Offers Condolences to Friends and Family of ‘Austere Scholar’ al-Baghdadi.\"\r\n    28 October 2019.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]