["At what was widely seen as a vice presidential tryout, Indiana Gov. Mike Pence warmed up a Donald Trump rally in his home state on July 12, 2016.", "Pence took the opportunity in the national spotlight to tout the health of his state’s economy, saying, \"Today, there are more Hoosiers going to work than ever before in the 200-year history of the great state of Indiana.\"", "With Pence potentially on the verge of becoming Trump’s running mate, we decided to take a closer look at what Pence said. We discovered that the statistic, as Pence stated it, is accurate — but close to meaningless.", "Pence has a point that more people in Indiana are working today than at any time in history -- 3.07 million in May 2016, according to the Bureau of Labor Statistics. Here’s a chart showing BLS data for Indiana as far back as the database goes online:", "However, the historical peak Pence cites has more to do with long-term population growth than with the robustness of the economy. The more accurate way to look at a statement like this is to look at the percentage of people working, not the raw number.", "Otherwise, you could say that President Barack Obama at the depths of the Great Recession was presiding over a healthier job market than Ronald Reagan in his second term, because 25 percent more Americans were working at the nadir of the Great Recession. The difference was that the base U.S. population -- rather than job prospects -- grew substantially in the interim.", "As a general rule, \"focusing on the total number of people employed is misleading,\" said Tara Sinclair, an economist with George Washington University and the jobs site Indeed.", "So let’s take a look at what happens if you calculate the percentage of the Indiana population that is working.", "According to the Census Bureau’s 2015 population estimate — the most recent one available — Indiana has a population of about 6.48 million. So 47.3 percent of Indiana residents were working this year.", "By contrast, at the previous raw-number peak in Indiana employment -- May 2000 -- there were 3.02 million residents working. That year, the state had 6.08 million residents, so the percentage working was 49.7 percent.", "In other words, a bigger percentage of Indiana’s population was working in 2000 than in 2016. That throws some cold water on Pence’s assertion.", "These calculations use all Indiana residents as a baseline, regardless of age, but the same pattern holds if you just look at Indiana residents between the ages of 18 and 64, the prime working years.", "Currently, 75.4 percent of Indiana residents in that age range are working. In 2000, the comparable figure was 80.5 percent. So by this measure, too, Pence is wrong about 2016 representing a historical peak.", "Then there’s the more traditional measure of the health of the job market, the unemployment rate. This statistic uses as its baseline the number of people who are looking for a job, which makes it even more precise and in most cases more useful to economists.", "Indiana’s current rate of 5 percent is what experts would generally consider good, but it’s hardly a historical low for Indiana. For most of the time between 1993 and 2008, Indiana’s unemployment was right around 5 percent and often even lower. Here’s a chart going back to 1976:", "Gary Burtless, an economist with the Brookings Institution, noticed another pattern in the numbers. He used federal data to determine that even though the state’s working-age population grew by 311,000 between 2000 and 2015, the number of people actually working in the state increased by far less over that period -- only 45,400.", "That does not seem like an obvious sign of a strong employment trend.", "Our ruling", "Pence said, \"Today, there are more Hoosiers going to work than ever before in the 200-year history of the great state of Indiana.\"", "Literally, Pence has a point: More Indiana residents are employed now than at any time in the past. But it’s a data point with very little meaning, since, as any statistician will tell you, it doesn’t take into account the size of the state’s population.", "Looking instead at the percentage of Hoosiers working shows that the percentage was higher during the previous employment peak in 2000. And the widely used unemployment rate — which is even more precise because it is based on the number of residents who are actively looking for a job — has been lower than its current rate over long stretches of recent history.", "We rate the statement Half True.", "Mike Pence, remarks at a rally for Donald Trump in Westfield, Ind., July 12, 2016", "Bureau of Labor Statistics, \"Employment, Hours, and Earnings from the Current Employment Statistics survey (National)\", accessed July 14, 2016", "Bureau of Labor Statistics, \"State and Metro Area Employment, Hours, & Earnings,\" accessed July 14, 2016", "Bureau of Labor Statistics, \"Local Area Unemployment Statistics,\" accessed July 14, 2016", "U.S. Census Bureau, \"Annual Estimates of the Resident Population for Selected Age Groups by Sex for the United States, States, Counties, and Puerto Rico Commonwealth and Municipios: April 1, 2010 to July 1, 2015  more information,\" accessed July 14, 2016", "U.S. Census Bureau, \"Table 2. Resident Population of the 50 States, the District of Columbia, and Puerto Rico: Census 2000,\" July 14, 2016", "U.S. Census Bureau, \"Table 2. Population by Selected Age Groups for the United States, Regions, and States, and for Puerto Rico: 1990 and 2000,\" accessed July 14, 2016", "Email interview with Tara Sinclair, an economist with George Washington University and the jobs site Indeed, July 14, 2016", "Email interview with Gary Burtless, senior fellow at the Brookings Institution, July 14, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]