["About this rating", "A rumor widely circulated on social media claimed that the storyline of the Will Smith movie \"I Am Legend\" took place in the year 2021, and was centered on a zombie outbreak that was caused by a vaccine:", "It's difficult to find a claim with as many factual errors as this one.", "\"I Am Legend\" is not set in 2021. The movie is about vampires — not zombies — and the outbreak was not caused by a vaccine.", "The movie \"I Am Legend\" is based on a book of the same name by Richard Matheson that was published in 1954. Both works are set in the near future, but neither version takes place in 2021. In the book, the story takes place in Los Angeles in the 1970s. In the movie version, the story takes place in New York in 2012 (an earlier film adaptation called \"The Last Man on Earth\" and starring Vincent Price is set in 1968).", "Here's an excerpt from Reel Reviews that describes the setting of \"I Am Legend\":", "I Am Legend opens in 2012 New York City - the most deserted place on Earth. Kudos to the special effects wizards for using computers to so effectively depopulate the city. It's eerie watching such emptiness. New York has a human population of one: Dr. Robert Neville (Will Smith), an ex-military scientist who was to some degree culpable for what happened to his race. The disease was initially hyped as a cure for cancer (by Emma Thompson in an unbilled cameo) but it mutated and became a killer. The creatures it transforms can't emerge in the sunlight, so they stay hidden during the day only to come out and seek fresh blood between dusk and dawn. In that period, Robert and his faithful dog, Sam, are padlocked within his apartment. They hunt by day and hide by night.", "In both the book and movie, there was an outbreak that turns people into \"darkseekers.\" While Matheson's 1954 book had an impact on how both zombies and vampires would be depicted in future horror books and films, the fact that the defining characteristics of these movie villains is that they cannot be in sunlight places them firmly in the vampire section of the monster Venn diagram.", "Regardless, the darkseekers were not created with a vaccine. In the backstory of both the book and the movie, a plague spread across the globe that gave people rabies-like symptoms before turning them into vampire-like creatures. In the book, the origin of the disease is unknown, and Robert Neville, the protagonist, spends much of the story searching for a cure. At one point, after examining a woman's blood, he discovers that the plague was caused by a bacterial infection, and dubs the germ \"vampiris.\"", "Matheson wrote:", "The moment arrived; his breath caught.", "It wasn't a virus, then. You couldn't see a virus. And there, fluttering delicately on the slide, was a germ.", "I dub thee vampiris. The words crept across his mind as he stood looking down into the earpiece.", "In the movie version, humanity has a little more responsibility for causing the plague. Still, the vampires weren't actually caused by a vaccine. They were caused by a genetically modified virus called the Krippin Virus that was meant to be a cure for cancer.", "Here's how Screenrant described the origins of the Krippin Virus in \"I Am Legend\":", "A news interview with Dr. Krippin in I Am Legend's opening lays out the origins of the Krippin virus. Dr. Krippin had genetically edited the measles virus in order to change its effects from damaging to beneficial, spreading a cure for cancer through the bodies of patients. The idea is similar in basic principal to how vaccines work: taking something that would otherwise be harmful to people and turning it into a way to save people. Krippin compares the process of creating her virus to replacing a dangerous driver behind the wheel of a powerful car with a cop.", "Initially it seems that the virus is a success, with more than 10,000 cancer patients cured. However, it then begins to have much more lethal effects and mutates from a contact-borne virus to an airborne one. 90% of people who are infected with the virus die. 1% (about 12 million people on the planet) are immune to the virus. The remaining people transform into Darkseekers - pale-skinned creatures with a savage lust for flesh, enhanced strength and speed, and no apparent higher brain function. The only safe haven from the Darkseekers is daylight, since they experience severe reactions to UV light.", "Whether you are reading the book or watching the movie, \"I Am Legend\" does not take place in 2021, and the vampires (not zombies) were not created by a vaccine.", "Interestingly, this is at least the second rumor to circulate on social media claiming that some apocalyptic movie was set in the year 2021.", "\"Mad Max\" actually takes place sometime in the mid-1980s.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]