["About this rating", "On June 4, 2020, a security fence was erected around the perimeter of the White House as protests against police brutality and racial injustice continued across the country, spurred by the in-custody killing in Minneapolis of an unarmed Black man. Shortly after this fence was erected, an image supposedly showing that it had been topped with barbed wire, which is spiked or studded wire often used on farms, was circulated on social media. (Some social media posts alternatively used the term \"razor wire,\" which is traditionally used for security purposes.):", "This is not a genuine photograph of barbed wire resting on top of a security fence around the White House. The wire in this picture is a digital alteration.", "While it may appear at first glance that this is a genuine picture of barbed wire, it is clear that this deterrent was drawn on the picture if you zoom in on it.", "Furthermore, plenty of news coverage exists about the construction of this security fence, yet none of those reports mentioned the addition of barbed wire. Photographs from Getty Images, the Associated Press and Reuters also show no razor wire on the fence.", "NPR reported:", "An expanded security perimeter around the White House will be in place for several more days, even as the mayor of Washington, D.C., called on the Trump administration to withdraw its extra federal law enforcement and military presence from the city.", "Fencing around Lafayette Park, just across the street from 1600 Pennsylvania Ave., was installed earlier this week amid heightened security measures in response to days of peaceful protests over police treatment of African Americans. Now, according to the U.S. Secret Service, more areas in the vicinity are being closed.", "Security fencing has been installed around the entire Ellipse and extends multiple blocks to Constitution Avenue.", "In sum, the newly constructed security fence around the White House is not adorned with barbed wire. However, the fence did get some other additions. On June 7, 2020, the DCist reported that demonstrators were hanging signs and other protest art on the fence.", "(Photo by JOSE LUIS MAGANA/AFP via Getty Images)", "Schwartz, Matthew.   \"Security Perimeter Around White House Expanded By Several Blocks.\"\r\n    NPR,/Em>.   7 June 2020.", "Proud, Kelsey; Strupp, Julie; Gathright, Jenny; Diller, Nathan.   \"The New White House Fence Is Getting Covered In Protest Art.\"\r\n    DCist/Em>.   7 June 2020.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]