["About this rating", "On Sept. 18, 2020, shortly after news broke that U.S. Supreme Court Justice Ruth Bader Ginsburg had died, a controversy started swirling over whether her replacement should be named before or after the Nov. 3 presidential election.", "Justices of the Supreme Court are appointed by the president, confirmed by the U.S. Senate, and serve for life. For these reasons, as political divisiveness increased over the past several decades, replacing Supreme Court justices has become an intensely partisan process.", "In 2016, Republicans blocked then-U.S. President Barack Obama's nomination of Merrick Garland following the death of Antonin Scalia, arguing that Scalia's passing occurred too close to a presidential election — Scalia died 269 days before the 2016 election — and that the nomination should be made by whomever the American people picked as their next president. Republican Senate Majority Leader Mitch McConnell, for instance, said at the time: \"The American people should have a voice in the selection of their next Supreme Court justice. Therefore, this vacancy should not be filled until we have a new president.”", "As McConnell reversed course in 2020, saying that Trump should be the one to nominate a replacement for Ginsburg (despite the fact that this seat on the Supreme Court Bench opened up just 46 days before an election), a quote supposedly uttered by Ginsburg during her final days expressing that her most \"fervent wish\" was not to be replaced by Trump started to circulate on social media:", "The quote reads: \"My most fervent wish is that I will not be replaced until a new President is installed.\"", "This is a genuine quote from Ginsburg. This quote was first reported by NPR in an article about the Supreme Court judge's death. Ginsburg dictated this statement to her granddaughter, Clara Spera, in the days before her death.", "NPR reported:", "Just days before her death, as her strength waned, Ginsburg dictated this statement to her granddaughter Clara Spera: \"My most fervent wish is that I will not be replaced until a new president is installed.\"", "She knew what was to come. Ginsburg's death will have profound consequences for the court and the country. Inside the court, not only is the leader of the liberal wing gone, but with the court about to open a new term, the chief justice no longer holds the controlling vote in closely contested cases.", "The above-displayed quote originated with Ginsburg's family. Spera described her close relationship with her grandmother, whom she called \"Bubbie,\" in a 2018 profile published by Glamour:", "\"You may know her as Justice Ruth Bader Ginsburg, or affectionately as the Notorious RBG, but to me she's Bubbie. Bubbie with whom I spend most High Holy Days. Bubbie who took me to see The Book of Mormon, where we both laughed until we cried. Bubbie who loves going to the movies. Bubbie at whom I get a kick out of poking fun. Just a Bubbie like any other.", "Despite the origins of this quote, Trump cast aspersions on this remark, baselessly claiming that it could have been written by a Democrat:", "There's no evidence that this quote was written by Chuck Schumer, Adam Schiff, Nancy Pelosi, or any other politician. This quote, transcribed by Ginsburg's granddaughter, was released by her family shortly after Ginsburg's death.", "Slotkin, Jason.   \"Justices Remember Ruth Bader Ginsburg, 'A Jurist Of Historic Stature'.\"  \r\n  NPR.   19 September 2020.", "Everett, Burgess.   \"McConnell Throws Down the Gauntlet: No Scalia Replacement Under Obama.\"  \r\n  Politico.   13 February 2016.", "Taddonio, Patrice.   \"In Wake of Ruth Bader Ginsburg’s Death, McConnell Reverses Course on Supreme Court Vacancy; Vows Vote on Nominee.\"\r\n    PBS.   19 September 2020.", "Spera, Clara.   \"Ruth Bader Ginsburg's Granddaughter: ‘You Know Her as the Notorious RBG, but She’s Bubbie to Me’.\"\r\n    Glamour.   4 May 2018.", "Totenberg, Nina.   \"Justice Ruth Bader Ginsburg, Champion Of Gender Equality, Dies At 87.\"  \r\n  NPR.   18 September 2020.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]