["Vice President Mike Pence says terrorists are getting caught at the U.S.-Mexico border day after day.", "In his Feb. 17, 2018, remarks in Dallas, Pence mentioned his visit the day before to the port inside the Hidalgo-Reynosa International Bridge in Hidalgo, a border town in Texas’ Rio Grande Valley.", "\"We’ve made progress but we still have work to do,\" Pence said. According to the White House transcript, Pence went on: \"I learned yesterday at the Hidalgo border center that along the southern border of the United States, we actually still apprehend 1,100 individuals a day, who are attempting to enter this country illegally, including seven individuals a day who are either known or suspected terrorists.\"", "\"So men and women, let me say, we’re going to continue to work to secure our borders,\" Pence said next. \"We’re going to reform a broken immigration system. And make no mistake about it, we’re going to build that wall,\" Pence said to applause.", "We sought to verify Pence’s declaration that seven suspected or known terrorists are daily getting nabbed at the border.", "The FBI’s Terrorist Screening Center says in a FAQ last updated in January 2017 that a \"known terrorist\" is an individual who’s been arrested, charged or convicted in the U.S. or abroad of a crime related to terrorism or terrorist-related activities--or a person identified as a terrorist or member of a terrorist organization \"pursuant to statute, executive order, or international legal obligation pursuant to a United Nations Security Council resolution.\"", "A suspected terrorist, the FBI says, is an individual reasonably suspected to have engaged in or currently or about to be engaged in conduct constituting, in preparation for, in aid of, or related to terrorism and/or terrorist activities.", "Total apprehensions in border region", "We didn’t draw fresh information when we asked the White House about the basis of Pence’s reference to border apprehensions. Separately, Carlos Diaz, a Customs and Border Protection spokesman, suggested that we review that agency’s latest counts of individuals apprehended by the government along the U.S.-Mexico border. In January 2018, the month before Pence spoke, CBP says, 35,822 individuals were apprehended in the Southwest Border region, which takes in the more than 2,000 miles from Brownsville, Texas, to San Diego. That breaks out to 1,155 apprehended people a day.", "No data for terrorists apprehended at border", "Best we could tell, though, the statistics pointed out by Diaz don’t include counts of deterred or detained terrorists or suspected terrorists--a judgment shared, when we asked for help, by Alex Nowrestah, an analyst for the Cato Institute, which published a 2016 paper finding that foreign-born terrorists who entered the country, either as immigrants or tourists, were responsible for 88 percent (or 3,024) of the 3,432 murders caused by terrorists on U.S. soil from 1975 through the end of 2015.", "By email, Nowrestah told us he was unaware of statistics supporting Pence’s seven-a-day statement about the U.S.-Mexico border.", "Generally, Nowrestah suggested we attempt our own ballpark estimate starting from a Department of Homeland Security table tallying \"aliens\" apprehended nationally in 2016 (the latest year of compiled data) by countries of origin--putting our focus on the number of individuals stopped from entering from countries that President Donald Trump seeks to bar U.S. visitors. Taking this approach, we found that 211 of the people apprehended in 2016 hailed from Chad, Iran, Libya, Somalia, Syria and Yemen (with no one apprehended from another travel-ban country, North Korea)--less than a person a day.", "An alternate claim", "Another expert helped us identify a seven-a-day claim that has factual footing.", "By email, David Sterman, an analyst with the New America think tank, which has compiled information on terrorist activities in the United States after 9/11, pointed out that in January 2018, the Justice Department and Homeland Security released a report supporting a seven-a-day calculation.", "A government press release and the report itself each say that  in 2017, Homeland Security  \"had 2,554 encounters with individuals on the terrorist watch list (also known as the FBI’s Terrorist Screening Database) traveling to the United States,\" which breaks out to seven individuals a day.", "Pence made such a statement during his visit to Hidalgo, according to a McAllen Monitor news story on his visit. The story quoted the vice president saying: \"Homeland Security, I am told, refuses entry to seven known or suspected individuals who may have terrorist intent in this country every day, or roughly 2,500 a year.\"", "The 2018 report says: \"Where consistent with the law, such individuals are denied entry into the United States, while in some cases law enforcement authorities are notified and can take appropriate action.\" The report further says: \"This data only includes individuals of which the United States encountered and not all of those who may have entered or attempted to enter the country undetected.\"", "Most stopped at airports?", "In Dallas, Pence said the seven daily apprehensions were taking place along the southern border. But in 2017, according to the report, most of the deterred individuals were stopped from entering by airplane--not necessarily at the border. According to the report, of the 2,554 individuals, 335 were attempting to enter by land, 2,170 were attempting to enter by air and 49 were attempting to enter by sea.", "Also by email, Sterman cautioned that being on a watch list \"is not the same as being a terrorism suspect. It’s a vast architecture that includes many names for varying levels of concern. Denying entry is a low bar to clear. Which is part of the reason citing this number to defend the immigration-centric counterterrorism strategy is misleading. It’s more of a sign that a lot is already done.\"", "We sought the FBI’s comment on whether people on the watch list consists of known terrorists and suspected terrorists and didn’t immediately hear back.", "Our ruling", "Pence said in Dallas that \"along the southern border of the U.S.,\" the government apprehends \"seven individuals a day who are either known or suspected terrorists.\"", "We found no facts that back up this border-specific tally. Nationally in 2017, the federal government says, Homeland Security stopped 2,554 individuals on its terrorist watch list from entering the country, which breaks out to seven people a day. Most of those individuals tried to enter by air, the government says.", "We rate Pence’s claim Pants on Fire.", "PANTS ON FIRE – The statement is not accurate and makes a ridiculous claim. Click here for more on the six PolitiFact ratings and how we select facts to check.", "Transcript, \"Remarks by Vice President Mike Pence at an America First Policies Tax Reform Event,\" The White House, Feb. 17, 2018", "Document, \"Terrorist Screening Center - FAQs,\" FBI, as of January 2017 (accessed Feb. 20, 2018)", "Emails, Carlos A. Díaz, Southwest Border Branch chief, Office of Public Affairs – Media Division, Customs and Border Protection, Feb. 20, 2018", "Policy analysis, \"Terrorism and Immigration: A Risk Analysis,\" Alex Nowrestah, immigration policy analyst, Center for Global Liberty and Prosperity, Cato Institute, Sept. 13, 2016", "Phone interview, Alex Nowrasteh, Feb. 20, 2018", "Web page, \"Southwest Border Migration, FY 2018,\" U.S. Customs and Border Protection, last published Feb. 7, 2018 (accessed Feb. 20, 2018)", "News story, \"Supreme Court to Consider Challenge to Trump’s Latest Travel Ban,\" The New York Times, Jan. 19, 2018", "Table, \"Aliens Apprehended By Country Of Nationality: Fiscal Years 2014 To 2016,\" from 2016 Yearbook of Immigration Statistics, Department of Homeland Security, table last published Nov. 30, 2017 (accessed Feb. 20, 2018)", "News story, \"Vice president stops in McAllen to tour border,\" McAllen Monitor, Feb. 16, 2018", "Email, David Sterman, policy analyst, International Security program, New America, Feb. 20, 2018", "Press release and report, Justice Department, \"DOJ, DHS Report: Three Out of Four Individuals Convicted of International Terrorism and Terrorism-Related Offenses were Foreign-Born,\" \"Executive Order 13780: Protecting the Nation From Foreign Terrorist Entry Into the United States Initial Section 11 Report,\" Jan. 16, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]