["“How is finding 39 missing children in a double wide trailer in Georgia NOT the biggest news story in America?” reads an August 28, 2020 Facebook post shared more than one million times.", "“Can someone - anyone - explain to me why finding 39 missing KIDS in a double wide trailer in Georgia not the biggest news story on the planet ??” reads another post shared 34,000 times.", "The claim was also shared on Facebook here and here, on Twitter here and on Instagram here.", "Some posts, for example here, here and here, spread the claim using the hashtag #SaveTheChildren.", "Supporters of the QAnon conspiracy theory -- which alleges that powerful Democrats and Hollywood figures engage in child sex trafficking and abuse -- have hijacked the hashtag to stoke fears on social media about sexual predators.", "President Donald Trump has done nothing to tamp down the theory, and said of Q supporters: “they like me very much.”", "The US Marshals Service announced on August 27 that 39 children were indeed found over two weeks as part of “Operation Not Forgotten.\"", "However, spokesman Dave Oney told AFP by email that the children were found in multiple locations, not in a double-wide trailer.", "The children were mostly found in Georgia -- where all 39 were reported missing, according to Oney -- but in 15 different counties, not one trailer. Others were found in South Carolina, Tennessee, Oklahoma, Florida, Kentucky and Michigan.", "He said that 15 of the children were identified as victims of trafficking, while “13 of the 39 children were located during the operation and determined to be with a proper custodian.”", "The rest of them were victims of parental kidnappings, or runaways from foster or adoptive homes or from juvenile justice custody, he said.", "“These missing children were considered to be some of the most at-risk and challenging recovery cases in the area, based on indications of high-risk factors such as victimization of child sex trafficking, child exploitation, sexual abuse, physical abuse, and medical or mental health conditions,” the US Marshals press release said.", "Oney sent AFP a chart outlining the counties and states where each of the children were found during the operation, available below.", "Despite claims that mainstream media failed to cover the story, the results of “Operation Not Forgotten” were reported on or before the date of the posts by Fox News here as well as local media here, here and here, and subsequently by CBS and CNN.", "Oney said “there’s plenty of misinformation” circulating about child trafficking and encouraged people “to do their due diligence.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]