["About this rating", "In the wake of revelations that President Donald Trump's son had met with a Kremlin-linked lawyer during the 2016 presidential election, a photograph purporting to show the President with his arm around that same lawyer spread widely on Facebook in July 2017.", "The woman in the photograph and Natalia Veselnitskaya share Russian nationality and some physical features (long brown hair and petite builds) but are two different individuals.", "Congratulations, @realDonaldTrump @potus!\nWe are ready and hope to build constructive and positive relationships between our counties! pic.twitter.com/pchk038h7h", "— Alferova Yulya (@AlferovaYulyaE) January 21, 2017", "Alferova, who earned brief Internet notoriety in 2015 after posting a picture of her cat eating caviar, met Trump in November 2013 when he held his Miss Universe beauty pageant in Moscow. She wrote that the image was taken exactly three years prior to Trump's election win, on 9 November 2013, joking in Russian, \"Coincidence? I do not think so.\"", "Alferova was described in a 20 January 2017 Daily Beast story as an avid Trump admirer who read his books and emulated his famed career as a real estate mogul and celebrity. At one point she worked for the Crocus Group, a real estate firm owned by Trump's friends, the father-and-son team Aras and Emin Agalarov. The Daily Beast reported:", "In 2013, Trump’s longtime friends and interlocutors on business matters in Russia, the billionaire Aras Agalarov and his son Emin, the president and vice president of the Crocus Group real-estate company, asked the then-26-year-old Alferova, a quick-thinking Moscow entrepreneur, to help organize Trump’s Miss Universe contest. If three years ago Alferova’s job was to make sure that beautiful images of the event appeared on social media, today, as Trump is inaugurated as the next president of the United States, Alferova sees her mission as advocating for him. ...", "Trump had long been Alferova’s business idol. She read his books, his life story, and modeled herself after him, working in commercial real estate for Crocus Group, developing social-media pages for Russian governors and regional officials, organizing federal and regional events. That day in November, Trump teamed up with Alferova, as if they were old friends. “We talked as if we were equals, and I felt certain we were very much alike,” she said. Trump invited her to have lunch together—Alferova pulled up one more picture to demonstrate that there were just a few men and her waiting for lunch at the Crocus restaurant that day. When she mentioned she was interested in the real-estate business, Trump pulled out his business card and encouraged her to call him when she was in New York.", "Regardless of whether you think Alferova and Veselnitskaya look alike, they do share a connection -- a representative of Emin Agalarov, Alferova's former boss, was present was at the now-infamous 9 June 2016 meeting at Trump Tower in New York City between Donald Trump's son, Donald Trump Jr., and Veselnitskaya, along with former campaign manager Paul Manafort and son-in-law Jared Kushner.", "The meeting was arranged by Rob Goldstone, a former British tabloid writer-turned-publicist for Emin Agalarov (who is also a pop singer and featured the current U.S. president in a 2013 music video). Goldstone told Trump Jr. that the Russian government wanted to help his father win the election and that Veselnitskaya would provide deleterious information about Trump's opponent, Hillary Clinton. Trump Jr. has said no useful information was provided.", "The revelation about the meeting occurred amid an FBI investigation into whether members of the president's campaign colluded with the Russian government's meddling in the 2016 election.", "Li, David K. \"This Russian Cat Eats Caviar While You Don’t.\"\r\n  New York Post. 12 March 2015.", "Nemtsova, Anna. \"She Met Donald Trump at the Moscow Ritz (Not That Way!)\"\r\n  The Daily Beast. 20 January 2017.", "Twohey, Megan, and Eder, Steve. \"How a Pageant Led to a Trump Son’s Meeting With a Russian Lawyer.\"\r\n  The New York Times. 10 July 2017.", "Crowley, Michael. \"When Donald Trump Brought Miss Universe to Moscow.\"\r\n  Politico. 15 May 2016.", "Ruiz, Rebecca R., and Landler, Mark. \"Robert Mueller, Former F.B.I. Director, Is Named Special Counsel for Russia Investigation.\"\r\n  The New York Times. 17 May 2017.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]