["Steven King, left, fills out paperwork before selling a handgun to first-time gun owner Dave Benne at Metro Shooting Supplies, in Bridgeton, Mo., in 2014. (AP/Jeff Roberson)", "After the shooting in Charleston, S.C., that left nine African-American worshippers dead, President Barack Obama made it clear where he directs the blame. \"Every country has violent, hateful, or mentally unstable people,\" Obama said. \"What’s different is not every country is awash with easily accessible guns.\"", "Though efforts to enact comprehensive gun control legislation through Congress withered amid intense opposition from gun rights supporters, Obama has done what he can to use executive orders to curb access to guns.", "One potential policy for his administration would have the Social Security Administration share information with the national background check system that is used to conduct background checks of gun purchasers. Adding names from the Social Security list would potentially increase the number of people barred from purchasing a gun.", "After this possibility emerged, gun-rights advocates reacted quickly and aggressively.", "\"SPREAD THIS: Obama Makes Huge Move to BAN Social Security Recipients From Owning Guns,\" read the headline in the Conservative Tribune.", "Breitbart, another conservative website, declared: \"Obama’s Secret Plan to Block Seniors on Social Security from Owning Guns.\"", "Other websites qualified their message by referring to \"some Social Security recipients,\" and some cited a specific figure -- 4.2 million -- as the number of people that would be unable to own guns.", "We were curious to see how all these claims stacked up, so we dug into the evidence.", "The background check system", "Under existing federal law, several factors can prevent someone from buying a gun. Most of these have to do with law enforcement issues, such as a prior felony conviction or a record of domestic abuse. Mental-health issues can be another factor, such as involuntary commitment to a mental institution.", "The National Instant Criminal Background Check System, or NICS, is supposed to streamline the process of gun purchasing by quickly weeding out those who cannot legally buy a gun. In 36 states or territories, the FBI performs all background checks, whereas the remaining 25 states set up their own state agencies to either conduct full or partial background checks. But such a system is only as good as the databases it’s linked to -- and several analyses have shown that these databases are far from complete.", "If someone is ineligible to purchase a gun but their information didn’t get into the right database, then the background check won’t stop the purchase. For instance, suspected Charleston shooter Dylann Roof should have been ineligible to buy a gun because of a prior felony on a drug charge, but errors in paperwork, and a mistake by the FBI examiner in charge of the background check, meant that Roof passed the check.", "The Los Angeles Times article", "The source that every site we found linked back to was a July 18 Los Angeles Times article, headlined, \"Obama pushes to extend gun background checks to Social Security.\"", "The article reports that the Social Security Administration is crafting a new policy that would prevent gun purchases by certain types of beneficiaries. The ineligible beneficiaries would be those who were deemed mentally incompetent. In this instance, a mentally incompetent person would be categorized as someone who has their finances handled by another party, known as a \"representative payee.\"", "The Social Security change did not emerge suddenly. It stems from an executive order by Obama in January 2013 that required \"require federal agencies to make data available to the federal background check system.\" The idea behind the executive order was to make the background check database more complete and prevent gun purchases by people who, under the law, are ineligible.", "We found several problems with the websites’ claims.", "• The new policy would not ban all Social Security recipients from owning guns. Rather, it would only affect the small fraction who are deemed mentally incompetent, and who are thus are barred from purchasing guns under the law.", "• The policy is not yet in force. When we reached out to the Social Security Administration, a spokesman responded, \"We are still developing our policy.\"", "In developing the plan, the Social Security Administration is following the lead of another federal agency, the Veterans Administration, which is already sharing names with the National Instant Criminal Background Check System. The Social Security Administration’s policy is expected to be similar.", "• The policy would not take away guns from people who already own them. There is no indication that this policy would take guns away from people who already own guns. Rather, the policy would affect the ability of some mentally incompetent people from buying new guns.", "\"There is nothing in the policy that would change the definition of who may possess a gun, nor anything that extends the federal government’s authority to take guns away from those who already have them,\" said Gary Kleck, a professor of criminology at Florida State University.", "There is one exception to this: California currently tracks and disarms ineligible gun owners. In addition to seizing the guns of those people determined to be mentally unstable, California law enforcement also disarms people with felonies or a domestic violence restraining order. The new policy, once it’s instituted, could marginally increase the number of mentally incompetent individuals living in California who are disarmed under that 2013 law.", "What about the charge that 4.2 million people would be affected by the policy?", "There’s some truth to it, but there’s an important caveat: 2.7 million of the beneficiaries who have their finances managed by others receive Social Security because of a mental disability, not just because of their age, according to LaVenia LaVelle, a spokeswoman for the Social Security Administration.", "So it’s not really accurate to say, as Breitbart did, that the plan is \"to block seniors\" from buying guns, since a large number of those affected would not be seniors. Data from December 2013 shows that about 1.2 million disabled workers with mental disorders who were receiving Social Security disability were under 50.", "Finally, some of these people may already be in the database for another reason.", "Our ruling", "Bloggers such as the Conservative Tribune wrote headlines like this one: \"SPREAD THIS: Obama Makes Huge Move to BAN Social Security Recipients From Owning Guns.\"", "This is a vast exaggeration of the actual policy under consideration. It would not affect all Social Security recipients, but rather those who have already been declared mentally incompetent, and thus ineligible under current law from purchasing a gun. And it is targeted at blocking gun purchases, not taking away guns from people who already have them. Only in California could the policy lead to increased gun seizures, and only -- potentially -- for mentally incompetent residents of the state who would be newly added to the background check database.", "Obama has not made a sweeping move to disarm gun-owning senior citizens, as these websites claim. We rate the claim False.", "Los Angeles Times, \"Obama pushes to extend gun background checks to Social Security,\" July 18, 2015", "Conservative Tribune, \"SPREAD THIS: Obama Makes Huge Move to BAN Social Security Recipients From Owning Guns,\" July 20, 2015", "Breitbart, \"Obama’s Secret Plan to Block Seniors on Social Security from Owning Guns,\" July 18, 2015", "Snopes, \"No Guns for Pensioners?\" July 20, 2015", "Zero Hedge, \"New Obama Initiative to Ban Guns for Some Social Security Recipients, Veterans and Disabled,\" July 20, 2015", "Hot Air, \"New Obama plan: ban gun ownership for some Social Security recipients based on ‘incompetency,’\" July 20, 2015", "Down Trend, \"Obama to Ban 4.2 Million Social Security Recipients from Owning Guns,\" July 18, 2015", "Forbes, \"Here are the 23 Executive Orders on Gun Safety Signed Today by the President,\" January 16, 2013", "Interview with Alan Zarembo, Los Angeles Times, July 22, 2015", "Interview with Ben Stump, Social Security Administration, July 21, 2015", "Interview with LaVenia LaVelle, Social Security Administration, July 22, 2015", "Social Security Administration, \"Annual Statistical Report on the Social Security Disability Insurance Program,\" 2013", "FBI, \"National Instant Criminal Background Check System: Participation Map,\" April 2015", "Tien et al, \"Cost-Benefit of Point-of-Contact (POC) Versus Non-POC Firearm Eligibility Background Checks,\" May 2008", "Congressional Research Service, \"Submission of Mental Health Records to NICS and the HIPAA Privacy Rule,\" April 15, 2013", "Interview with Gary Kleck, Florida State University, July 29, 2015", "Bloomberg, \"California Seizes Guns as Owners Lose Right to Keep Arms,\" March 12, 2013", "California Healthline, \"New California Law Will Restrict Guns for Mentally Ill Individuals,\" October 1, 2014", "Politifact, \"Conservative website says Barack Obama signed law to require health professionals to share private data that would lead to gun confiscation,\" February 6, 2014", "United States Government Accountability Office, \"Gun Control: Sharing Promising Practices and Assessing Incentives Could Better Position Justice to Assist States in Providing Records for Background Checks,\" July 2012", "NPR, \"FBI Says Background Check Error Let Charleston Shooting Suspect Buy Gun,\" July 10, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]