["About this rating", "Wendy's faced backlash across Twitter after rumors surfaced that the fast food chain's CEO, Todd Penegor, donated to U.S. President Donald Trump's re-election campaign, prompting the hashtag #WendysIsOverParty to begin trending in early June 2020.", "This information spread on social media, including from the Twitter account of Ryan Fournier, a founder of Students for Trump:", "The truth is, the campaign donor was a CEO named James Bodenstedt of Muy! Companies. Bodenstedt's connection to Wendy's is known: His company owns hundreds of Wendy's, Taco Bell, and Pizza Hut franchises across the country.", "In May, a Business Insider report revealed that Bodenstedt donated hundreds of thousands of dollars to Trump's campaign.", "According to Federal Election Commission (FEC) filings, since 2018, Bodenstedt has donated around $440,000 to Trump's campaign, including a March 12, 2020, donation of $200,000 to the Trump Victory PAC (political action committee). In May 2020, Bodenstedt also joined a roundtable discussion with Trump and restaurant-industry leaders to talk about the field's recovery from the COVID-19 coronavirus pandemic.", "In response to the backlash, Wendy's -- known for its snarky approach to social media -- responded to the backlash with a tweet:", "While this tweet is accurate, CNN found that Wendy's CEO Todd Penegor donated around $6,000 to the Wendy's PAC. The PAC hasn't donated to any presidential campaigns, but has donated to more Republican than Democrat congressional candidates.", "After the outrage on social media grew, Wendy's also announced that they will donate $500,000 toward supporting “social justice, the youth and education in the Black community.” In a series of tweets, they said:", "Because Wendy's CEO did not donate to Trump's re-election campaign, and the donation came instead from the CEO of a company that operates Wendy's franchises, we rate this claim as \"False.\"", "Folley, Aris.   \"Wendy's donating $500K to social justice amid controversy over franchisee CEO's Trump donation.\"\r\n   The Hill.   4 June 2020.", "Taylor, Katie.   \"Wendy's faces backlash after a franchisee donates more than $440,000 to Trump, as #WendysIsOverParty explodes on Twitter.\"\r\n   Business Insider.   2 June 2020.", "Taylor, Katie.   \"The first fast-food franchisee to advise Trump on reopening restaurants has donated more than $400,000 to the president's reelection — including $200,000 in March.\"\r\n   Business Insider.   18 May 2020.", "Tardi, Carla.   \"Franchisee.\"\r\n   Investopedia.   25 June 2019.", "Valinsky, Jordan.   \"How Wendy's is responding to criticism after a franchisee donated to Trump's reelection campaign.\"\r\n   CNN.   4 June 2020.", "Nur Nasreen Ibrahim is a reporter with experience working in television, international news coverage, fact checking, and creative writing.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]