["About this rating", "As surviving students of a deadly February 2018 high school shooting in Parkland, Florida, started the #NeverAgain movement advocating for stricter gun laws, some of the more cynical opponents of gun control set about attacking the teenagers and their message.", "While some stuck to deriding the students as too young and emotional to comment on policy, others went much further than that — for example, cooking up conspiracy theories calling them \"crisis actors,\" an especially offensive rumor that has been used against survivors of mass shootings and loved ones of those who have been killed in them: That no one has ever died in any of these events, and that every bloodied body or grieving family member appearing in public is all fake, part of a grand conspiracy bankrolled by liberals to push gun control. Years after the Sandy Hook mass shooting, for example, victims' families still report harassment and death threats.", "Amidst all of this, a fake tweet emerged aimed at defaming David Hogg, one of the most vocal survivors of the 14 February 2018 high school shooting in which a gunman murdered seventeen people:", "The earliest example of this message that we could uncover was a 26 February 2018 thread on the web site 4Chan where a user posted it without any source information. The users debated briefly about whether the image was real (it's not) before devolving into a litany of racial slurs.", "The fake message was supposedly posted in June 2016, but it does not appear on Hogg's timeline, nor is there any cached record of it stored anywhere (yet there are dozens of other tweets from Hogg archived):", "David Hogg did not post this homophobic message on Twitter. This is a doctored image that was created in an attempt to smear the reputation of a young man who survived a school shooting. And this is a good time for a reminder: It is incredibly easy to create hoax tweets. Proceed with caution.", "Updated [2 March 2018]:  A previous version of this article noted that the tweet in question did not match Twitter's standard font. This was a moot point, however, as a Twitter spokesperson informed us that the font may change depending on the device used to view a tweet.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]