["The sudden and unusual emergence of rapper Kanye West as a potential presidential candidate has sparked questions on what kind of impact the mercurial entertainer could have at the ballot box.", "The questions — and conspiracy theories — only gained traction when we learned the attorney who submitted West’s signatures for Wisconsin (minutes after the technical deadline) was a former GOP lawyer who is representing Trump’s campaign in a pending lawsuit.", "One widely-read post on Instagram claimed West joining the race would help Trump — citing past elections as supposed proof.", "\"Third party votes only siphon from dems for a candidate with no chance of winning,\" said the Aug. 6, 2020 post.", "The post went on to show a breakdown of total votes cast in Wisconsin from the 2016 election, noting Green Party candidate Jill Stein won more votes here than Republican Donald Trump’s margin of victory over Democrat Hillary Clinton.", "But a review of past elections shows this claim is nonsense.", "The post was flagged as part of Facebook and Instagram’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership.)", "Here’s what we found.", "For starters, the evidence listed by the post isn’t evidence at all. It simply reports the vote totals for Trump, Clinton, Stein and Libertarian Gary Johnson.", "Clinton lost Wisconsin by 22,748 votes, while Stein accumulated 31,072, according to the Wisconsin Election Commission. But this would only be evidence if every Stein voter had voted for Clinton instead, a claim the post doesn’t make and that experts say is not true.", "And this line of thinking ignores that Johnson pulled a far larger vote share — 106,674 — and Libertarians have historically drawn more voters from the Republican side.", "\"This idea that categorically minority parties draw from Democratic voters is just absurd,\" said Christopher Devine, assistant professor of political science at the University of Dayton, whose study on the 2016 third-party candidates is currently going through peer review.", "Barry Burden, a political science professor at the University of Wisconsin-Madison, agreed.", "\"Every minor party or independent candidate who has run in modern history has taken some votes from (both parties),\" said Burden, who has authored numerous studies on the impact of third-party candidates. \"It’s also incorrect to say the votes come even disproportionately from a Democratic candidate.\"", "To be sure, some third-party candidates have swung races to Democrats, most notably the 2000 election where Ralph Nader’s presence pulled votes that could have swung Florida — and ultimately the country — in favor of Al Gore instead of George W. Bush.", "But the impact in other recent elections has varied, according to experts and an array of studies. The impact depended on the specific background of the third-party candidate.", "In the 2016 election, voters who backed Johnson or Stein would have leaned toward Trump if forced to choose in a two-way race, according to a survey by international research group YouGov. Among likely voters, 34% preferred Trump, 25% preferred Clinton and 42% said they had no preference.", "The Washington Post cited exit polls in reporting Johnson likely moved the final margin about 0.4% in Trump’s favor. And a study from Devine going through peer review found Johnson voters would have favored Trump by a 2-to-1 margin in a two-person race.", "Nader in 2000 is the most prominent example of third-party impact given the historically tiny margin deciding that election. Florida’s outcome determined the presidency, and Bush topped Gore there by a mere 537 votes.", "Nader received 97,488 votes in Florida. And national exit polling showed Nader voters would have chosen Gore (47%) over Bush (21%) in a two-man race. A book by Burden estimated a similar breakdown.", "The highest-polling third-party candidate in recent history was Ross Perot, who ran in 1992 and 1996. He drew support from both parties, but a study by Burden found 36% of Perot voters would have backed George H.W. Bush with Perot out of the 1992 race, while 44% would have supported Bill Clinton. About 20% would not have voted.", "Devine noted that Libertarians, the most prominent and successful third-party in recent decades, have nominated a slate of former Republican politicians, and \"clearly it has tended to draw more from Republicans over the years.\"", "The trickier question is what impact West could have on the 2020 race if he does make it on the ballot in Wisconsin or anywhere else.", "West has previously supported Trump — including donning a \"Make America Great Again\" hat — but he’s such an unusual candidate experts say it’s too early to say much for sure.", "A July 2020 poll found Biden leading Trump 48% to 40% if West wasn’t mentioned. But if West was included as a potential candidate in the poll question, Biden remained at 48% while Trump dropped a point to 39%.", "\"He has a kind of unorthodox and muddled set of things he would do in office, so it’s not a clear ideological thing he has to offer,\" Burden said. \"He’s more progressive in some issues, but he’s also pro-life apparently and in favor of private schools to some degree, things Democrats wouldn’t normally go for. I think he would appeal to a real hodgepodge of voters.\"", "Addressing the potential addition of West in the 2020 race, an Instagram post claimed \"Third party votes only siphon from dems for a candidate with no chance of winning.\"", "There have been prominent examples of Democrats losing votes, most notably Nader in 2000. But experts are unanimous in noting this is not remotely true as a hard-and-fast-rule.", "The 2016 election even disproves this claim, with far more third-party voters favoring Trump over Clinton.", "We rate this claim False.", "Instagram post, Aug. 6, 2020", "Interview with Christopher Devine, assistant professor of political science at the University of Dayton, Aug. 7, 2020", "Interview with Barry Burden, political science professor at the University of Wisconsin-Madison, Aug. 7, 2020", "Email exchange with Matt Hindman, associate professor of political science, University of Tulsa, Aug. 7, 2020", "Wisconsin Election Commission, Canvass Results for 2016 General Election, Nov. 8, 2016", "The Economist/YouGov, poll, Oct. 2-26, 2016", "Models of Presidential Elections, Minor Parties in the 2000 Presidential Election, 2004", "Dean Lacy and Barry Burden, The Vote-Stealing and Turnout Effects of Ross Perot in the 1992 U.S. Presidential Election, January 1999", "The Hill, Kanye West gets 2 percent in national presidential poll, July 14, 2020", "Political Science Quarterly, The 2000 Presidential Election: Why Gore Lost, Summer 2001", "Michael C. Herron and Jeffrey B. Lewis, Did Ralph Nader Spoil a Gore Presidency? A Ballot-Level Study of Green and Reform Party Voters in the 2000 Presidential Election, April 24, 2006", "Washington Post, Gary Johnson helped Hillary. Not by enough, but he did., Nov. 11, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]