["About this rating", "On 10 March 2019, The New York Times reported that the U.S. Social Security Administration (SSA) was considering leveraging people's social media accounts to determine the veracity of their disability claims:", "The Trump administration has been quietly working on a proposal to use social media like Facebook and Twitter to help identify people who claim Social Security disability benefits without actually being disabled. If, for example, a person claimed benefits because of a back injury but was shown playing golf in a photograph posted on Facebook, that could be used as evidence that the injury was not disabling.", "The story resulted in spin-offs from various publications including Forbes (\"How a Trump Proposal Could Reduce 'Happy' Disabled People\") and the Daily Kos website (\"Trump administration seeks to monitor social media of disability recipients, including vets\"). As with any story that sounds far-fetched, Snopes.com readers queried whether the story could be believed.", "It is true that SSA proposed using social media posts in making disability determinations. The proposal was put forward in its fiscal year 2020 budget request, noting (on page 26) that the agency wants to take a more proactive approach in looking at people's posts on the platforms. Whereas social media posts can currently come into play in fraud investigations, the practice could be expanded, per the budget request:", "In FY 2018, we studied strategies of our private sector counterparts and other government agencies on how social media networks can be used to evaluate disability allegations. Currently, agency adjudicators use social media information to evaluate a beneficiary’s symptoms when there is a CDI unit’s Report of Investigation that contains social media data corroborating the investigative findings. In FY 2019, we are evaluating how social media could be used by disability adjudicators in assessing the consistency and supportability of evidence in a claimant’s case file.", "(CDI refers to the Cooperative Disability Investigations unit and is responsible for working in conjunction with various agencies to \"investigate suspicious disability claims under SSA’s Title II and Title XVI disability Programs.\")", "In a statement emailed to Snopes, agency spokesman Darren Lutz said SSA is studying strategies of \"other agencies and private entities to determine how social media might be used to evaluate disability applications\" but declined to provide further details.", "Although neither The Times nor Forbes articles mentioned veterans, the Daily Kos website cited a tweet posted by writer Dylan Park that introduced the idea that veterans could also be targets of such investigations.", "The Trump administration is proposing to monitor the social media accounts of veterans, and if the veterans are “too happy” their disability pensions for PTSD will be reduced. What a fucking joke. https://t.co/dKcCK57OkS", "— Dylan (@dyllyp) April 14, 2019", "In that same post, Park recounts having benefits cut for telling a medical professional he was feeling \"fine\" in one visit, despite having post-traumatic stress disorder from his experiences on the battlefield.", "I had to appeal my case in front of a board. I whipped out a photo of the head of a suicide bomber who jumped on a humvee at my checkpoint and said “This is something I think about at least once a day. Fuck all of you.” They reversed that shit so fast.", "— Dylan (@dyllyp) April 14, 2019", "The SSA and Veterans Administration (VA) run separate benefits programs for adjudicating and dispersing disability benefits. But the two programs can overlap, meaning a disabled veteran can receive benefits from both agencies simultaneously. We sent questions to SSA asking how investigating social media posts could impact veterans receiving SSA disability payments but got no answer by the time of publication.", "The SSA hasn't yet offered specifics on how it might use social media in evaluating disability claims. But writing for Forbes, Imani Barbarin, who has cerebral palsy and is an advocate for the disabled community, observed that the policy could backfire by mistakenly rejecting people from the program. She noted that such a proposal demonstrates a \"fundamental misunderstanding\" of disability and how a social media post made by a disabled person could easily be misconstrued.", "\"Disabled people don’t all function in the same way, and disability is not a set of stereotypes like taking selfies staring longingly at the world. They live lives while managing their energy for the activities they can handle and trying to make those they cannot more accessible,\" Barbarin wrote. \"Additionally, studies have shown that a majority of social media users show only the good in their lives, not the hardships or difficulties.\"", "Perusing people's social media posts is already a common practice by private insurance companies determining coverage or investigating claims. But the prospect of the U.S. government adopting the practice to evaluate applications has raised a number of concerns among privacy advocates and advocates for the disabled community, as CBS News reported:", "[Disability attorney Paul] Young said social media reviews can exacerbate a claims process that's already time-consuming for applicants who are out of work, taking anywhere from one year to three years. The SSA has a very strict definition of disability by law: Claimants must not be able to do work because of their medical condition, and the condition must have lasted or be expected to last at least one year — or be expected to result in death. Social media posts taken out of context can put applicants on the defensive before they even reach a hearing, Young said.", "Images and videos also have technical problems: A user may have posted a throwback photo to when she was water-skiing in 2016, but the publish date may make it appear the photo is from after she filed her claim. In a world with increasingly sophisticated image-altering technology, it's also getting ever more difficult to authenticate the veracity of a photo.", "Furthermore as CBS reports, \"it's hard to imagine how federal disability examiners could even authenticate profiles to evaluate applicants for disability. Social media profiles aren't tied to Social Security numbers, for example, and many users set their profiles to private, preventing strangers from viewing them.\"", "Pear, Robert. \"On Disability and on Facebook? Uncle Sam Wants to Watch What You Post.\"\r\n  The New York Times. 10 March 2019.", "Barbarin, Imani. \"How a Trump Proposal Could Reduce 'Happy' Disabled People.\"\r\n  Forbes. 11 April 2019.", "Hayden, Jen. \"Trump Administration Seeks to Monitor Social Media of Disability Recipients, Including Vets.\"\r\n  DailyKos.com. 15 April 2019.", "Min, Sarah. \"Social Security May Use Your Facebook and Instagram Photos to Nix Disability Claims.\"\r\n  CBS News. 21 March 2019.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]