["The nation's capital is closed to people without I.D., according to a Feb. 21 viral Facebook claim.", "\"Checking i.ds. to get into Washington, D.C.,\" the post says. \"Hmmmm if we had checked i.ds. at the polls we wouldn't be at the mess we are in.\"", "The post closely resembles an older claim, now archived, shared to Facebook on Feb. 14. The type of I.D. is not specified in either post.", "USA TODAY reached out to the poster for comment.", "Law enforcement took unprecedented measures to protectthe District of Columbia in the wake of the Jan. 6 attack on the U.S. Capitol by supporters of former President Donald Trump. The city was occupied by National Guard troops ahead of the inauguration of President Joe Biden and Vice President Kamala Harris. Some troops will remain until early March, USA TODAY reported.", "Despite those precautions, there is little evidence to support the claim.", "More:Fact check: No deadline is in place for delivering State of the Union", "\"There is no ID requirement or check taking place in the District of Columbia. I do not recall a time we ever had this requirement in the city,\" Alaina Gertz, public affairs specialist for the Metropolitan Police Department, told USA TODAY.", "Backing this up, the District of Columbia Homeland Security and Emergency Management Agency did not release a public notice about restricted access to the city on the date the claim was posted, according to the agency's website.", "The only press release dated Feb. 21 is a statement from the office of Mayor Muriel Bowser on the deployment of the District Snow Team to prepare for inclement weather. The same notice was posted by the District Department of Transportation that day.", "Streets, bridges and Metro stations leading into the city were closed ahead of the presidential inauguration on Jan. 20 as part of a National Special Security event launched by the U.S. Secret Service, WTOP News reported on Jan. 21. Most restrictions were lifted the following day.", "USA TODAY also reached out to the D.C. HSEMA for comment.", "The claim also referenced I.D. requirements \"at the polls,\" or prior to casting a ballot. Though not a nationwide requirement, 36 states have laws requiring or requesting that voters show some form of identification prior to submitting a ballot. Thirty-five of those laws were in force in 2020, according to the National Conference of State Legislatures. There is no document required to vote in Washington, D.C.", "We rate this claim FALSE, based on our research. There is no evidence to support a claim stating identification is being \"checked\" to get into Washington. Barriers to accessing the city after the attack on the U.S. Capitol on Jan. 6 were lifted around Jan. 21.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook."]