["The photo was published here on Facebook on August 11, 2020.", "The Sinhala-language text below the images translates to English as: “After producing a vaccine that will save the whole world from corona, Putin administered the vaccine on his own daughter that he loves to ensure its safety and to show the world that the vaccine is safe. Dear little girl, thank you for the service you and your father did for this world”.", "The post’s Sinhala-language caption reads: “Thank you Putin Sir, for the service done for the world”.", "The post was published just hours after Russia announced it was the first country to approve a vaccine for COVID-19, the disease caused by the novel coronavirus. At a meeting with government ministers on August 11, 2020, Putin said that one of his daughters was inoculated with the vaccine as part of a medical trial.", "The WHO said on August 12, 2020, it was looking forward to reviewing clinical trials of the potential coronavirus vaccine. It says 28 of more than 150 potential vaccines are currently being actively tested on humans worldwide, among which six have reached Phase 3, the final stage when candidate drugs are tested on large groups of people. Russia's vaccine, developed by the Gamaleya research institute and the defence ministry, is among the 28 in clinical evaluation but is listed by the WHO as only being in Phase 1, AFP reported here.", "The image was also shared alongside a similar claim on Facebook here and here.", "The claim, however, is misleading.", "A reverse image search on Google found the photo in fact shows a young girl who was a patient at a Moscow oncology centre. She was photographed sitting next to Putin during a visit to the Kremlin in May 2012.", "The photo was published on the Kremlin’s official website here in a post titled “Vladimir Putin met with a girl undergoing treatment at a children’s oncology center”.", "According to the official press release, Putin welcomed “8-year-old Sonya from Pskov, a patient at the Federal Clinical Centre for Child Oncology, Haematology and Immunology, and her parents” to the Kremlin on May 9, 2012.", "The report adds that Putin met Sonya at the oncology centre’s opening ceremony in 2011 and later promised her that she could visit the Kremlin.", "Photos from Putin’s meeting with Soyna and her parents were also released by RIA Novosti, Russia’s state-owned news agency, and published by AFP here, here, here and here.", "The features of the girl in the photograph do not match images of Putin’s daughters, Maria Vorontsova and Katerina Tikhonova, which can be seen here in a BBC news report and here in a report by The Guardian.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]