["About this rating", "When \"mass shooting\" is defined as an incident in which four or more people are shot, the U.S. had 251 such incidents in the first 216 days of 2019.", "No set definition exists for \"mass shooting.\" As such, the number of incidents varies greatly depending on the criteria used to count them.", "For most people, the word \"mass shooting\" invokes images of horrifying events such as the shooting at Sandy Hook Elementary School, where 26 people (including 20 children) were killed in December 2012, the massacre in Las Vegas in 2017 where more than 50 people were killed at a music festival, or the killing of more than 20 people at a Walmart in El Paso, Texas, in August 2019.", "So when outlets such as USA Today, CBS News, and Yahoo News published articles with headlines such as \"El Paso, Dayton make 251 mass shootings in the US in 216 days, more shootings than days in the year,\" or \"There have been more mass shootings than days this year,\" some readers were a bit shocked by the numbers.", "At the moment, no set definition exists for what is meant by \"mass shooting.\" That means the number of mass shootings that occur each year varies greatly depending on the criteria used to count them. For instance, one organization may count a mass shooting if it involves four or more people who are injured by a gun, while other organizations may only count a mass shooting if it involves four or more people killed by a gun. These numbers can also be skewed by other factors. For example, some organizations don't include crimes involving gangs or domestic violence in their mass-shooting reports, while others do.", "The FBI itself has no set definition for \"mass shooting.\" In 2005, the government organization described \"mass murder\" as a single incident that results in four or more deaths. This standard was also used for a 2015 Congressional Research Service report about mass shootings:", "According to the FBI, the term “mass murder” has been defined generally as a multiple homicide incident in which four or more victims are murdered, within one event, and in one or more locations in close geographical proximity. Based on this definition, for the purposes of this report, “mass shooting” is defined as a multiple homicide incident in which four or more victims are murdered with firearms, within one event, and in one or more locations in close proximity. Similarly, a “mass public shooting” is defined to mean a multiple homicide incident in which four or more victims are murdered with firearms, within one event, in at least one or more public locations, such as, a workplace, school, restaurant, house of worship, neighborhood, or other public setting.", "The claim that the United States had 251 mass shootings in the first 216 days of 2019 originates from data collected by the Gun Violence Archive (GVA), a non-profit organization that tracks gun-related violence in the U.S. The GVA counts any incident in which four or more people were shot and/or killed. Also, the GVA list includes ALL incidents of gun violence, meaning that they don't exclude incidents involving gangs or domestic violence:", "GVA uses a purely statistical threshold to define mass shooting based ONLY on the numeric value of 4 or more shot or killed, not including the shooter. GVA does not parse the definition to remove any subcategory of shooting. To that end we don’t exclude, set apart, caveat, or differentiate victims based upon the circumstances in which they were shot.", "GVA believes that equal importance is given to the counting of those injured as well as killed in a mass shooting incident.", "The Gun Violence Archive's ongoing tally of mass shootings can be viewed here. As the GVA only requires four or more people to be shot, and not necessarily killed, many of the shootings on this list don't involve fatalities. As such, many of these incidents probably didn't make headline news, which explains why so many people were shocked to see the number \"251,\" using GVA's criteria, for the first 216 days of 2019.", "Beyond GVA, others have tallied mass shootings differently. News outlet Mother Jones, for instance, has been studying mass shootings since a dozen people were killed in a movie theater in Aurora, Colorado, in 2012. Mother Jones uses a stricter set of rules to define mass shootings. For that organization, a mass shooting is defined as an incident involving four or more people killed by guns. Mother Jones also excludes incidents that may stem from crimes, such as armed robbery or gang violence.", "In July 2012, in the aftermath of the movie theater massacre in Aurora, Colorado, Mother Jones created a first-of-its-kind open-source database documenting mass shootings in the United States. Our research focused on indiscriminate rampages in public places resulting in four or more victims killed by the attacker. We exclude shootings stemming from more conventionally motivated crimes such as armed robbery or gang violence. Other news outlets and researchers have since published larger tallies that include a wide range of gun crimes in which four or more people have been either wounded or killed. While those larger datasets of multiple-victim shootings are useful for studying the broader problem of gun violence, our investigation provides an in-depth look at a distinct phenomenon—from the firearms used and mental health factors to the growing copycat problem. Tracking mass shootings is complex; we believe ours is the most useful approach.", "Under Mother Jones' criteria, the number of mass shootings in the U.S for the first 216 days of 2019 is seven.", "ABC News used similar criteria for an August 2019 report on mass shootings in the U.S. The news outlet did not exclude shootings related to more conventional crimes, as Mother Jones did, and found that the U.S. had 17 deadly mass shootings in the same time period:", "The two shootings, first in El Paso, Texas, and then in Dayton, Ohio, are the latest instances of deadly mass shootings in 2019, bringing the total number of such incidents up to at least 17 — an average of one every 12.7 days this year.", "The FBI doesn't have an official definition of a mass shooting, but defines a mass killing as an incident in which three or more people, not including the suspect, are killed. Various groups and watchdog organizations keep their own lists, often using different criteria for what qualifies as a mass shooting.", "For the list compiled by ABC News below, the incidents took place over the course of a day and involved four or more victims, not including the suspect, who died as a result of gunshot wounds. For instance, shooting sprees that spanned longer amounts of time were not included on this list.", "In sum, the question boils down to how \"mass shooting\" is defined.", "When defined as any incident in which four or more people are shot, the number of mass shootings for the first 216 days of 2019 is above 250. When mass shooting is defined as an incident in which more four or more people are killed (and excludes domestic and other more conventional crime-related violence) the number of mass shootings during that time period in 2019 is seven. If we include conventional crime-related incidents, such as domestic violence, the number of mass shootings is around 17.", "Follman, Mark; Aronsen, Gavin; Pan, Deanna.   US Mass Shootings, 1982-2019: Data From Mother Jones’ Investigation.\"\r\n    Mother Jones. Retrieved 5 August 2019.", "ABC 15.   \"Las Vegas Shooting: This is What Investigators Found in Stephen Paddock's Hotel Room.\"\r\n    19 January 2018.", "Keneally, Meghan.   \"There Have Been at Least 17 Deadly Mass Shootings in the US So Far in 2019.\"\r\n    ABC News   5 August 2019.", "CNN.   \"Sandy Hook Shooting: What Happened?.\"\r\n    December 2012.", "Krouse, William.   \"Mass Murder with Firearms: Incidents and Victims, 1999-2013.\"\r\n    Congressional Research Service.   30 July 2015.", "Miller, Susan.   \"El Paso, Dayton Make 251 Mass Shootings in the US in 216 Days, More Shootings Than Days in the Year.\"\r\n    USA Today.   4 August 2019.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]