["Orlando Magic center Nikola Vucevic acknowledges the crowd after it was announced, before an NBA basketball game against the Detroit Pistons on Feb. 23, 2021, in Orlando, Fla., that he was selected for the 2021 All-Star game. (AP)", "Atlanta’s mayor has asked people not to travel to the city, and asked businesses not to hold events in the city, in connection with the NBA All-Star Game being played there on March 7.", "She has not ordered any formal shutdowns in connection with the game.", "A Facebook post falsely claimed that Atlanta Mayor Keisha Lance Bottoms is shutting down the city in connection with the NBA All-Star Game being played there on March 7.", "In capital letters, the post said:", "\"SO THE MAYOR OF ATLANTA SHUTTING THE CITY DOWN FOR ALLSTAR WEEKEND.\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Even before the NBA officially announced that the game would be held in Atlanta, Bottoms asked that people not travel to her city for the game, and asked that businesses not hold events in connection with it. She didn’t order any shutdowns.", "It all relates to the coronavirus.", "The COVID-19 pandemic led the NBA to relocate the All-Star Game from Indianapolis in 2021. The league said \"public health conditions prevented\" it \"from appropriately planning and executing fan-focused All-Star activities in Indianapolis.\" At the time, the league said revised plans for the 2021 game would be announced later but that it did plan for the game to come to Indianapolis in 2024.", "Debate ensued among players and others about whether the game should be played in 2021.", "But the NBA announced Feb. 18 that the 2021 game would be held March 7 in Atlanta — it would be limited, however, to one evening inside the arena hosting the game, rather than a weekend of events at various venues.", "\"For the well-being and safety of the greater Atlanta community, there will be no fan activities, ticketed events or hospitality functions,\" the league said.", "Bottoms issued orders after the pandemic emerged in March 2020 that temporarily shut down bars and nightclubs that do not serve food, gyms and fitness centers, movie theaters, live performance venues, bowling alleys, arcades and private social clubs, and that ordered residents to stay in their homes.", "Bottoms issued her statement about the All-Star Game on Feb. 16, two days before the NBA made its announcement. She made it clear she didn’t want any public gatherings associated with the game, but didn’t order any shutdowns. She said:", "\"Under normal circumstances, we would be extremely grateful for the opportunity to host the NBA All-Star game, but this is not a typical year. I have shared my concerns related to public health and safety with the NBA and Atlanta Hawks. We are in agreement that this is a made-for-TV event only, and people should not travel to Atlanta to party. There will be no NBA-sanctioned events open to the public and we strongly encourage promoters, clubs, bars, etc. not to host events in the city related to this game.\"", "We rate the Facebook post False.", "Facebook, post, Feb. 25, 2021", "Twitter, Keisha Lance Bottoms tweet, Feb. 16, 2021", "ESPN.com, \"Atlanta Mayor Keisha Lance Bottoms on NBA All-Star Game: Fans shouldn't come to city to party,\" Feb. 16, 2021", "11Alive.com, Mayor Keisha Lance Bottoms statement, Feb. 16, 2021", "11Alive.com, \"Bars, clubs plan NBA All-Star weekend parties despite warning from Atlanta mayor,\" Feb. 22, 2021", "Atlanta Journal-Constitution, \"Atlanta mayor asks fans not to travel to city for NBA All-Star game,\" Feb. 16, 2021", "City of Atlanta, \"City of Atlanta Coronavirus Disease 2019 (COVID-19) Response,\" accessed March 1, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]