["Sen. Scott Jensen, R-Minn., a physician in Minnesota, was interviewed by \"The Ingraham Angle\" host Laura Ingraham on April 8 on Fox News and claimed hospitals get paid more if Medicare patients are listed as having COVID-19 and get three times as much money if they need a ventilator.", "The claim was published April 9 by The Spectator, a conservative publication. WorldNetDaily shared it April 10 and, according to Snopes, a related meme was shared on social media in mid-April.", "Jensen took it to his own Facebook page April 15, saying, in part:", "\"How can anyone not believe that increasing the number of COVID-19 deaths may create an avenue for states to receive a larger portion of federal dollars. Already some states are complaining that they are not getting enough of the CARES Act dollars because they are having significantly more proportional COVID-19 deaths.\"", "On April 19, he doubled down on his assertion via video on his Facebook page.", "Jensen said, \"Hospital administrators might well want to see COVID-19 attached to a discharge summary or a death certificate. Why? Because if it's a straightforward, garden-variety pneumonia that a person is admitted to the hospital for – if they're Medicare – typically, the diagnosis-related group lump sum payment would be $5,000. But if it's COVID-19 pneumonia, then it's $13,000, and if that COVID-19 pneumonia patient ends up on a ventilator, it goes up to $39,000.\"", "Jensen clarified in the video that he doesn't think physicians are \"gaming the system\" so much as other \"players,\" such as hospital administrators, who he said may pressure physicians to cite all diagnoses, including \"probable\" COVID-19, on discharge papers or death certificates to get the higher Medicare allocation allowed under the Coronavirus Aid, Relief and Economic Security Act. Past practice, Jensen said, did not include probabilities.", "He noted that some states, including his home state of Minnesota, as well as California, list only laboratory-confirmed COVID-19 diagnoses. Others, specifically New York, list all presumed cases, which is allowed under guidelines from the Centers for Disease Control and Prevention as of mid-April and which will result in a larger payout.", "Jensen said he thinks the overall number of COVID-19 cases have been undercounted based on limitations in the number of tests available.", "The coronavirus relief legislation created a 20% premium, or add-on, for COVID-19 Medicare patients.", "There have been no public reports that hospitals are exaggerating COVID-19 numbers to receive higher Medicare payments.", "Jensen didn't explicitly make that claim. He simply suggested there is an \"avenue\" to do so now that \"plausible\" COVID-19, not just laboratory-confirmed, cases can be greenlighted for Medicare payment and eligible for the 20% add-on allowed under the relief act.", "The initial $30 billion – out of $100 billion – in the grants dedicated to health care providers to address the pandemic was disbursed according to 2019 Medicare reimbursements.", "The second wave will focus on providers in areas more heavily affected by the outbreak, according to Kaiser Health News, giving rise to Jensen's concern that hospitals could exploit the CDC's guidelines allowing presumed cases.", "Jensen did not return an email request from USA TODAY for comment about his claim.", "USA TODAY reached out to Marty Makary, a surgeon and professor of health policy and management at Johns Hopkins Bloomberg School of Public Health, about the claim. Makary said in an email April 21 that \"what Scott Jensen said sounds right to me.\"", "Makary did not elaborate, answer additional questions or respond to a request for an interview.", "USA TODAY reached out to the American Hospital Association and Federation of American Hospitals on April 22, but as of publication had not received a response.", "Snopes investigated the claim, finding it's plausible Medicare pays in the range Jensen mentions but doesn't have a \"one-size-fits-all\" payment to hospitals for COVID-19 patients.", "As explained by nurse Elizabeth Davis in her piece for verywellhealth.com, each hospital has a base payment rate assigned by Medicare. It takes into account nationwide and regional trends, including labor costs and varying health care resources in each market.", "Then, each diagnosis-related group, which classifies various diagnoses into groups and subgroups, is assigned a weight based on the average amount of resources it takes to care for a patient. Those figures are multiplied to determine the payment from Medicare. A hospital in one city and state may be paid more or less for treating a patient than a hospital in another.", "PolitiFact reporter Tom Kertscher wrote, \"The dollar amounts Jensen cited are roughly what we found in an analysis published April 7 by the Kaiser Family Foundation, a leading source of health information.\"", "Ask FactCheck weighed in April 21: \"The figures cited by Jensen generally square with estimated Medicare payments for COVID-19 hospitalizations, based on average Medicare payments for patients with similar diagnoses.\"", "Ask FactCheck reporter Angelo Fichera, who interviewed Jensen, noted, \"Jensen said he did not think that hospitals were intentionally misclassifying cases for financial reasons. But that’s how his comments have been widely interpreted and paraded on social media.\"", "Ask FactCheck's conclusion: \"Recent legislation pays hospitals higher Medicare rates for COVID-19 patients and treatment, but there is no evidence of fraudulent reporting.\"", "Julie Aultman, a member of the editorial board of the American Medical Association’s Journal of Ethics, told PolitiFact it is “very unlikely that physicians or hospitals will falsify data or be motivated by money to do so.”", "We rate the claim that hospitals get paid more if patients are listed as COVID-19 and on ventilators as TRUE.", "Hospitals and doctors do get paid more for Medicare patients diagnosed with COVID-19 or if it's considered presumed they have COVID-19 absent a laboratory-confirmed test, and three times more if the patients are placed on a ventilator to cover the cost of care and loss of business resulting from a shift in focus to treat COVID-19 cases.", "This higher allocation of funds has been made possible under the Coronavirus Aid, Relief and Economic Security Act through a Medicare 20% add-on to its regular payment for COVID-19 patients, as verified by USA TODAY through the American Hospital Association Special Bulletin on the topic.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here."]