["About this rating", "An image graphic comparing the book sales of Michelle Obama's autobiographical memoir Becoming and Donald Trump's business tome Trump: The Art of the Deal was widely shared on social media in November 2018.  The bragging point it offered was that the former first lady's book had sold considerably more copies in one week than the current president's book had in over three decades:", "However, we have to note from the beginning that accurate book sales figures are often difficult to determine, especially given the wide variety of retail outlets and publishing formats that comprise today's literary marketplace.  Moreover, as Electric Literature noted, sales figures can refer to any one of several metrics:", "[O]ne of the things that makes the conversation about book sales so confusing is that there are several different numbers thrown around, and often even people in the publishing industry completely confuse them. Here are four different numbers that are frequently conflated:", "1) The number of copies of the book that are printed.", "2) The number of copies that have been shipped to stores or other markets like libraries.", "3) The number of copies that have been sold to readers.", "4) The Nielsen BookScan number.", "These numbers can all be wildly different. It’s not uncommon at all for a publisher to, say, print 5,000 copies, but only sell 3,000 copies to bookstores/other markets, of which, 2,000 copies are actually sold to customers. Meanwhile, BookScan shows 600 copies sold. And we haven’t even gotten into ebooks yet.", "What’s the actual number of books sold? Well ... basically a combo of 2 and 3, plus ebook and audiobook sales. A publisher sells books to retailers like bookstores, but also to some institutions like libraries. However, retailers normally (though not always) have the right to return unsold copies. So some copies that are “sold” will eventually be unsold.", "That said, the numbers presented here were at least taken from reasonably credible sources.  On 21 November 2018, Crown Publishing reported to the Associated Press that Michelle Obama's memoir had sold 1.4 million copies since it had been released a week earlier:", "Michelle Obama’s “Becoming” has become a massive hit.", "Crown Publishing told The Associated Press that the former first lady’s memoir has sold more than 1.4 million copies in print and digital formats in the U.S. and Canada in the seven days since it was released Nov. 13.", "Based on demand from retailers across all channels, the publisher has printed 3 million hardcover copies in North America. On its first day, the book sold more than 725,000 copies, making it one of the year’s biggest debuts.", "The Art of the Deal was also a hit when it was first published in 1987, spending 13 weeks at the top of the New York Times best-seller list. Just how many copies it has sold over the last thirty-plus years is difficult to determine, however, especially since its publication antedated the adoption of the Nielsen BookScan sales tracking system.", "According to the 2005 book TrumpNation: The Art of Being the Donald, Trump's first publishing effort had an initial print run of 150,000 copies, and an additional 170,000 copies have been sold since Nielsen Bookscan started keeping track of sales in 2001, which leaves a considerable gap of time unmeasured. The figure cited in this graphic likely stems from a 2016 CBS News report report that quoted a source \"familiar with the book's sales\" stating that 1.1 million copies of Art of the Deal had been sold since its initial publication.", "The New Yorker magazine reported a similar figure in a \"tell-all\" article centered on the book's ghostwriter, Tony Schwartz:", "Schwartz had ghostwritten Trump’s 1987 breakthrough memoir, earning a joint byline on the cover, half of the book’s five-hundred-thousand-dollar advance, and half of the royalties. The book was a phenomenal success, spending forty-eight weeks on the Times best-seller list, thirteen of them at No. 1. More than a million copies have been bought, generating several million dollars in royalties.", "Regardless of the exact sales numbers, this meme doesn't really offer an apt comparison of the popularity of these two very different political figures, for a number of reasons:", "We've reached out to Random House, the company that first published The Art of the Deal, and Tony Schwartz, the book's ghostwriter, to see if they can offer more information about the work's overall sales.", "O'Brien, Timothy.   TrumpNation: The Art of Being the Donald.\r\n    Business Plus, 2005.   ISBN 0446578541.", "Mayer, Jane.   \"Donald Trump’s Ghostwriter Tells All.\"\r\n    The New Yorker.   25 July 2016.", "CBS News.   \"Donald Trump Book Royalties to Charity? A Mixed Bag.\"\r\n    11 August 2016.", "Kennedy, Mark.   \"Obama’s Book Sells 1.4 Million Copies in a Week.\"\r\n    Associated Press.   21 November 2018.", "Michel, Lincoln.   \"Everything You Wanted to Know About Book Sales (But Were Afraid to Ask).\"\r\n    Electric Literature.   30 June 2016.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]