["By D'Angelo Gore", "Posted on October 1, 2019", "President Donald Trump and some of his defenders have advanced a bogus theory that whistleblower rules were changed to allow a complaint alleging misconduct by the president to be forwarded to Congress based only on secondhand information.", "There was no such change in law or policy, according to a Sept. 30 statement issued by the independent Office of the Inspector General of the Intelligence Community.", "“In fact, by law the Complainant – or any individual in the Intelligence Community who wants to report information with respect to an urgent concern to the congressional intelligence committees – need not possess first-hand information in order to file a complaint,” the three-page statement said.", "The ICIG statement also said that the whistleblower had “direct knowledge of certain alleged conduct” and that “other information obtained during the ICIG’s preliminary review supported the Complainant’s allegations.”", "Earlier that day, however, Trump sought to discredit a whistleblower’s recent complaint accusing him of “using the power of his office to solicit interference in the 2020 U.S. election.” The president — who has repeatedly charged that the whistleblower had “all second hand information” — took to Twitter and asked, in all capital letters, “WHO CHANGED THE LONG STANDING WHISTLEBLOWER RULES JUST BEFORE SUBMITTAL OF THE FAKE WHISTLEBLOWER REPORT?”", "WHO CHANGED THE LONG STANDING WHISTLEBLOWER RULES JUST BEFORE SUBMITTAL OF THE FAKE WHISTLEBLOWER REPORT? DRAIN THE SWAMP!", "— Donald J. Trump (@realDonaldTrump) September 30, 2019", "He wasn’t the only one to claim a change had been made.", "“I want to know why they changed the rules about whistleblowers,” Republican Sen. Lindsey Graham said on CBS’ “Face the Nation” on Sept. 29. “The hearsay rule was changed just a short period of time before the complaint was filed.”", "And on CNN’s “State of the Union” the same day, Republican Rep. Jim Jordan said the unnamed whistleblower “had no firsthand knowledge” and had only “heard something from someone who may have heard something from someone.” That prompted a real-time fact-check from Jake Tapper, the show’s host.", "“You know as well as I do that you do not need to have firsthand knowledge to be a whistleblower,” Tapper told Jordan.", "“Well, you don’t now because they changed the form,” Jordan retorted. “You used to. They changed the form.”", "“There’s no evidence of that,” Tapper shot back. “Experts say it has never been true that you need to have firsthand knowledge to be a whistleblower.”", "Jordan’s office told us the congressman was referring to a change that was made to the May 24, 2018, version of ICWSP Form 401, which intelligence community whistleblowers previously used to submit complaints of potential wrongdoing.", "The Federalist, a conservative online magazine, wrote about the form in a Sept. 27 story.", "“Between May 2018 and August 2019, the intelligence community secretly eliminated a requirement that whistleblowers provide direct, first-hand knowledge of alleged wrongdoings,” the Federalist claimed. Trump shared the story on Twitter over the weekend.", "The disclosure form was modified in August, but that did not change the rules for submitting complaints. Instead, in its Sept. 30 statement, the office of the ICIG said that particular form and a few others had been under review since earlier this year and were recently modified to clarify language that could have been misinterpreted by would-be whistleblowers.", "“In the process of reviewing and clarifying those forms, and in response to recent press inquiries regarding the instant whistleblower complaint, the ICIG understood that certain language in those forms and, more specifically, the informational materials accompanying the forms, could be read – incorrectly – as suggesting that whistleblowers must possess first-hand information in order to file an urgent concern complaint with the congressional intelligence committees,” the statement said.", "“Consistent with the law, the new forms do not require whistleblowers to possess first-hand information in order to file a complaint or information with respect to an urgent concern.”", "The Intelligence Community Whistleblower Protection Act of 1998 defines an “urgent concern” as, among other things, “a serious or flagrant problem, abuse, violation of the law of Executive order, or deficiency relating to the funding, administration, or operations of an intelligence activity involving classified information.”", "The old form included two pages of background information on the ICWPA submission process. The section titled “FIRST-HAND INFORMATION REQUIRED” said:", "ICIG ICWSP Form 401, May 24, 2018: In order to find an urgent concern “credible,” the IC IG must be in possession of reliable, first-hand information. The IC IG cannot transmit information via the ICWPA based on an employee’s second-hand knowledge of wrongdoing. This includes information received from another person, such as when a fellow employee informs you that he/she witnessed some type of wrongdoing. (Anyone with first-hand knowledge of the allegations may file a disclosure in writing directly with IC IG.) Similarly, speculation about the existence of wrongdoing does not provide sufficient legal basis to meet the statutory requirements of the ICWPA. If you think that wrongdoing took place, but can provide nothing more than second-hand or unsubstantiated assertions, IC IG will not be able to process the complaint or information for submission as an ICWPA.", "That language does not appear along with the new version of the form dated August 2019, but it never meant that whistleblowers couldn’t file a complaint based on hearsay, or secondhand information, in the first place.", "“It’s clear the language at issue is about what gets escalated, not what’s reportable,” tweeted Cato Institute senior fellow Julian Sanchez, whose studies focus on national security and intelligence surveillance. “What the form they’re citing” says is “‘this won’t go up the chain without something more,’ which the IG did indeed get in this case,” he explained in another tweet on the subject.", "In fact, the old form gave filers the following options to indicate how they obtained the information that was being disclosed: “I have personal and/or direct knowledge of events or records involved”; “Other employees have told me about events or records involved”; or “Other source(s) (please explain).”", "“Although the form requests information about whether the Complainant possesses first-hand knowledge about the matter about which he or she is lodging the complaint, there is no such requirement set forth in the statute,” the ICIG’s statement said. “The ICIG cannot add conditions to the filing of an urgent concern that do not exist in law.”", "The statement went on to add that since Michael Atkinson started as inspector general on May 29, 2018, “the ICIG has not rejected the filing of an alleged urgent concern due to a whistleblower’s lack of first-hand knowledge of the allegations.”", "Furthermore, the ICIG statement said that the whistleblower who filed the Aug. 12 complaint against Trump used the old form — not the new one — and checked the boxes indicating that the claims were based on both direct knowledge of events and information obtained from others. (The new form still asks similar questions.)", "Office of the ICIG, Sept. 30: As part of his determination that the urgent concern appeared credible, the Inspector General of the Intelligence Community determined that the Complainant had official and authorized access to the information and sources referenced in the Complainant’s Letter and Classified Appendix, including direct knowledge of certain alleged conduct, and that the Complainant has subject matter expertise related to much of the material information provided in the Complainant’s Letter and Classified Appendix. In short, the ICIG did not find that the Complainant could “provide nothing more than second-hand or unsubstantiated assertions,” which would have made it much harder, and significantly less likely, for the Inspector General to determine in a 14-calendar day review period that the complaint “appeared credible,” as required by statute. Therefore, although the Complainant’s Letter acknowledged that the Complainant was not a direct witness to the President’s July 25, 2019, telephone call with the Ukrainian President, the Inspector General of the Intelligence Community determined that other information obtained during the ICIG’s preliminary review supported the Complainant’s allegations.", "So, not only was there no rule change for complaints based on hearsay, but those details from the ICIG also refute claims that the whistleblower “had no firsthand knowledge,” as Jordan, the Ohio congressman, claimed in his interview with CNN’s Tapper.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]