["By Angelo Fichera", "Posted on April 10, 2020", "Posts across social media are falsely claiming that a vaccine trial for the novel coronavirus in Senegal resulted in the death of seven children. The video behind those claims does not show that. And there is no clinical trial for a potential vaccine currently taking place in Senegal.", "There is no vaccine developed yet for the novel coronavirus, which causes COVID-19, though some clinical tests for potential vaccines are underway in the U.S. and China.", "But a falsehood circulating across social media platforms — spread through numerous posts, headlines and screenshots — is wrongly purporting that seven children in Senegal died after being given an experimental vaccine for the virus.", "“Mass vaccination for COVID-19 in Senegal was started yesterday (4/8) and the first 7 CHILDREN who received it DIED on the spot,” a Facebook post reads. An Instagram post from an account called “bye_bye_big_pharma” says that “CV vaccine tested in patients in Africa started yesterday. (4/8/2020) It was passed without any animal safety studies. 7 children died on the spot after injection.”", "That’s not true.", "There is no clinical trial currently underway in that country, or anywhere in Africa, according to a list of vaccine candidates compiled for the scientific journal Nature Reviews Drug Discovery. As of April 8, there were 115 candidates worldwide — and while 78 were confirmed as active, only five are in the clinical trial phase. Those five trials are happening in the U.S. and China.", "The false claim appears to stem from a viral video that shows a crowd of people in a street near a police car. A French speaker in the video tells of a “serious scandal in Senegal.” Sharon Bell, an assistant professor of French translation at Kent State University, translated the video for FactCheck.org.", "The speaker claims that “a guy … went into a house to vaccinate children against the problem of Coronavirus, the COVID-19. He vaccinated seven people, children. Seven children. They immediately died. They dropped dead.” It further says the police are on the scene.", "But the speaker’s claims evidently were added to the original video, which told a very different story.", "AFP Senegal found the video in a late March news report in that country — and it didn’t say that anybody had died. Instead, the video appeared in a story about the alleged arrest of two individuals claiming they had vaccines.", "That video — which is in Wolof, a language spoken in Senegal — does not claim that any children died, according to Omar Ka, an associate professor of modern languages, linguistics and intercultural communication at the University of Maryland, Baltimore County.", "“The difference between the French version and the Wolof one is that the latter does not talk about children being killed,” Ka told us in an email. “It simply states that an individual was caught trying to vaccinate people for COVID-19 and he was chased away, finding refuge at the neighborhood leader’s (Chef de Quartier, in French) house.”", "Ka said that in the beginning of the French version, “you can clearly overhear the Wolof narrator, but he gets quickly overtaken by the French-speaking narrator.” The French version, he said, “definitely is not a translation of the Wolof version” — he said it adds more dramatic details, “talking about seven kids killed and the need in return to kill the individual.”", "Multiple government agencies told AFP Senegal that one Senegalese man (not two people) was briefly arrested on March 26 in Dalifort, an area in the country’s capital of Dakar, and that he was selling cosmetics and hadn’t actually tried to vaccinate anyone. An armed forces ministry spokesman said the mishap occurred because the man was wearing a health ministry T-shirt and jokingly said he had vaccines, causing a stir. Police found that he only had cosmetic products.", "One website in Ghana, ezone57.com, ran the video under the headline: “Coronavirus: COVID-19 Vaccine Killed 7 Children in Senegal(West Africa) [VIDEO].” That post garnered considerable attention, and its headline appeared in screenshots on Facebook, before the website took down the story and published another debunking the claim.", "The falsehood circulated amid news reports about controversial remarks made by two French doctors who suggested vaccine trials should be conducted in Africa.", "World Health Organization Director General Tedros Adhanom Ghebreyesus referred to those comments as “racist,” saying during an April 6 press conference that “Africa cannot and will not be a testing ground for any vaccine.”", "“We will follow all the rules to test any vaccines or therapeutics all over the world using exactly the same rule,” he said. “Whether it’s in Europe, Africa or wherever — we will use the same protocol.”", "“The hangover from a colonial mentality has to stop,” he said.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "Bell, Sharon. Assistant professor of French translation, Kent State University. Email to FactCheck.org. 9 Apr 2020.", "Le, Tung Than, et. al. “The COVID-19 vaccine development landscape.” Nature Reviews Drug Discovery. 9 Apr 2020.", "Faivre Le Cadre, Anne-Sophie. “Senegalese children did not die from a coronavirus vaccine (which does not yet exist).” AFP Fact Check. 10 Apr 2020.", "Ka, Omar. Associate professor of modern languages, linguistics and intercultural communication, University of Maryland, Baltimore County. Email to FactCheck.org. 10 Apr 2020.", "“WATCH: The World Health Organization gives coronavirus update — April 6, 2020.” PBS NewsHour. YouTube. 6 Apr 2020.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]