["By Mitchell Aronoff", "Posted on April 7, 2020", "A viral post circulating on Facebook falsely claims that Walmart, in response to the coronavirus pandemic, has instituted a “staggered shopping schedule” that allows only certain age groups on specific days. The store has started a weekly “senior shopping event,” but no other restrictions based on age.", "As the novel coronavirus spreads across the U.S., governments and public health experts are cautioning people to stay home, go out only when necessary, and keep a safe distance from other people to mitigate the impact of the pandemic. Some retail companies are adopting procedures to help deal with the crisis by limiting the number of shoppers in a store at one time and protecting at-risk patrons.", "But a viral post on Facebook falsely purports to be an announcement from Walmart, one of the largest retail chains, that a new policy has been instituted allowing only certain age groups to shop on specific days of the week.", "“Due to the COVID-19 pandemic, effective immediately Walmart is adopting a staggered shopping schedule as follows,” reads the post, which has been shared extensively on Facebook and bears the logos of Walmart and its members-only Sam’s Club. “We apologize for any inconeince: Monday Age 66+, Tuesday 56-65, Wednesday 46-55, Thursday 36-45, Friday 25-35, Saturday 24 and below, Sunday shopping emergency only”", "The misspelling of “inconvenience” is a hint that this announcement came from an unreliable source.", "Rebecca Thomason, a Walmart corporate communications senior manager, told us in an email that the information presented in the viral posts is “completely false.”", "Walmart has changed the hours at many of its stores, which are now open from 7 a.m. to 8:30 p.m. Some stores were previously open 24 hours or until midnight, although closing times vary by location. In a March 18 press release, the executive vice president and chief operating officer of Walmart U.S., Dacona Smith, said: “This will further help associates restock the shelves for customers while continuing to clean and sanitize the store.”", "In addition, Smith said in the press release, “We know our older customers could be more vulnerable to the coronavirus and to better support them, Walmart is offering special shopping hours. From March 24 through April 28, Walmart stores will host an hour-long senior shopping event every Tuesday for customers aged 60 and older. This will start one hour before the store opens.”", "Walmart also has launched a policy that reduces crowding during the pandemic. In an April 3 press release, Smith announced: “[W]e will limit the number of customers who can be in a store at once. Stores will now allow no more than five customers for each 1,000 square feet at a given time, roughly 20 percent of a store’s capacity.”", "Thomason, the Walmart communications senior manager, said the company is implementing other protocols to protect its customers and associates.  The company is encouraging people to socially distance while in stores, aided by signs and floor decals. It is installing sneeze guards at pharmacy lanes and checkout, and prohibiting employees with fever or other symptoms — determined by a temperature check and questionnaire — from working.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "“Social Distancing, Quarantine, and Isolation.” Centers for Disease Control and Prevention. Accessed April 6.", "Smith, Dacona. “Changes to Our Shopping Process to Encourage Social Distancing.” Walmart. 3 Apr 2020.", "Smith, Dacona. “Latest Walmart Store Changes to Support Associates and Customers.” Walmart. 18 Mar 2020.", "Thomason, Rebecca. Walmart corporate communications senior manager. Email to FactCheck.org. 6 Apr 2020.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]