["About this rating", "As billions of holiday packages made their way around the world during the 2020 holiday season, a post shared to social media in late December claimed that packages distributed by Amazon were sprayed with chemicals that may be harmful to pets.", "A Dec. 27 Facebook post shared by the New York-based charity Uptown Cat Rescue warned pet owners that “ALL” boxes are sprayed with “toxic pesticides to kill wearouse [sic] rodents!”", "Allegations involving packaging materials and pet illnesses around the holiday season are rare, but have surfaced before this one. Claims that sprayed-on chemicals could cause chemical burns in some pets circulated through social media in a variety of platforms and methods, including Reddit and Twitter. In particular, Snopes readers sent our team the below post shared by a woman named Debora Berger with the Facebook group Yorkie Lovers.", "Berger told Snopes that she had contacted the original poster — a woman by the name of Alicia Plant — who first shared the pictures of her cat that had allegedly experienced chemical burns after licking Amazon boxes. Snopes subsequently contacted Plant, who confirmed that she had initially shared the photo to social media but had since deleted it.", "“I don’t want to bash Amazon. I love Amazon and I have deleted my post bc of all the hate,” Plant told Snopes in a Facebook message. “Amazon and I have been in contact and I do not wish to speak about it as it is being handled by them. Have a nice day.”", "In an interview with Snopes, Amazon spokesperson Leah Seay said that the company does not have a policy of spraying their packaging boxes with any sort of rodenticide or insecticide.", "“Boxes aren’t sprayed for any reason. If somewhere down the supply chain are they sprayed? The answer to that is no,” said Seay. “Corrugated boxes are made of wood pulp and wood pulp binders, which is basically what all manufacturers make their boxes out of. So, we don’t have special boxes. They are essentially the same thing that every other manufacturer uses.”", "Corrugated cardboard boxes are made of paper and represent one of the most recycled products in the United States, according to the Environmental Protection Agency. Garbage and recycling service provider Waste Management noted that corrugated shipping boxes like those used by Amazon are made of recycled materials or lumber industry byproducts, such as sawdust. When recycled, cardboard materials are re-pulped, separated, bleached, and screened and cleaned to eliminate contaminants.", "In 2019, it was estimated that Amazon shipped around 2.5 billion packages around the world every year. But during the 2020 novel coronavirus pandemic, Amazon upped its global shipping fleet and expanded its shipping flight activity by at least 30% since April 2020, according to a report published in September by the Chicago-based Chaddick Institute for Metropolitan Development.", "Because Amazon contracts different airlines and facilities for package delivery, Seay said that she could not rule out the possibility that Amazon boxes could be cross-contaminated by chemicals from other sources, such as disinfectants used to clean out airplane holds or rodenticides used at various warehouse storage facilities around the world. For instance, the U.S. Department of Transportation permits the disinsection of aircraft to protect public health, agriculture, and the environment, and may do so by either spraying the aircraft cabin with aerosolized insecticides while passengers are on board, or treat the aircraft’s interior surfaces with residual insecticide — neither of which are thought to present a risk to human or pet health.", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]