["A controversy over a harmless advertisement by jewellery brand Tanishq featuring an interfaith couple was blown out of proportion due to social media vitriol. The company’s brand manager Mansoor Khan’s social media profiles were circulated with threatening messages, forcing him to eventually take down his accounts. The jewellery brand succumbed to the outrage and pulled down the advertisement two days after its release. But Tanishq made fresh headlines on October 14 after NDTV claimed that its Gandhidham store was attacked and the manager was forced to write an apology note. Twitter user ‘The Skin Doctor’ posted an alleged call recording with the branch manager refuting reports that the store was ‘attacked’.", "This is fake news. I just spoke to the store manager at Tanishq Gandhidham. I hope @TanishqJewelry too issues a clarification on this. Are they hand in gloves with NDTV in this victim playing? pic.twitter.com/Gp1LrZo6jg", "— THE SKIN DOCTOR (@theskindoctor13) October 14, 2020", "The channel was subsequently accused of circulating misinformation but more on that later.", "Economic Times journalist DP Bhattacharya reported that Tanishq was “forced to put out an apology notice at its showroom in Gandhidham for the already withdrawn advertisement” after pressure from right-wing outfits. The handwritten note reads, “We apologise to the Hindu community of Kutch on the shameful advertisement of Tanishq.”", "After pressure from the RW outfits, #tanishq #Gandhidham #Gujarat is forced to put out an apology notice at its showroom in Gandhidham for the already withdrawn advertisement @ETPolitics ⁦@CMOGuj⁩ pic.twitter.com/uUQeZJEWeY", "— DP (@dpbhattaET) October 14, 2020", "The note was put up on October 12 which is also mentioned on top. Though it was circulating online since its appearance, NDTV reported the incident on October 14. The channel, however, used the word ‘attack’ which exaggerates the incident. There are no reports of vandalism or assault.", "But this doesn’t mean that the store wasn’t targetted. A widespread video shows a man threatening a staff member, asking him to hang a board at the store entrance with an apology. He further demands that a picture of the apology is sent to him on his phone.", "Person: I’m folding my hands and requesting you and trying to make you understand that [inaudible] are you guaranteeing that you’ll put up the board on the gate tomorrow?", "Staffer: If possible we’ll put it up at 7 am.", "Person: A large board must be put up, then you click a picture and send it to me.", "Staffer: Please give your number.", "Person: [Reads out his mobile number]", "The person also browbeats that the staffer makes a living because people like him [the intruder] purchase their products.", "Well here is how pressure was mounted … the man in black seeking assurance from the manager of #Tanishq Gandhidham about the apology note regarding the already withdrawn ad being put up outside the showroom. “Once you put out the note call me”, he says… pic.twitter.com/3L4NwWWMo6", "— DP (@dpbhattaET) October 14, 2020", "Mayur Patil, SP, Kutch (East), Gujarat put out a video statement where he said that two men barged into the store and forced the staff to put up an apology in Gujarati. The store kept getting threatening calls from the Kutch area and other parts of Gujarat even after the note was installed. The police arranged for patrolling outside the store after a complaint was made (although no FIR was filed). SP Patil clarified that the shop was not vandalised, attacked or ransacked.", "For those who cried “fake news” … please listen to SP Kutch(East) Mayur Patil… read the tweet again, I wrote pressure and not vandalism. please understand we at @EconomicTimes don’t peddle fake news. Appreciate truth… it helps https://t.co/2I8GIeh7w6 pic.twitter.com/H3YUadVF1m", "— DP (@dpbhattaET) October 14, 2020", "Alt News, however, could not verify the police’s claim that only two people had forcefully entered the store. Pictures of the night show a larger gathering outside.", "આ છે મારો કચ્છડો બારે માસ.. ગાંધીધામ તનિષ્ક શોરૂમ વાળાએ જાહેરમાં માફી માંગતું સ્ટીકર શોરૂમના કાચ પર લગાડ્યું.. pic.twitter.com/OhBqqfLoS1", "— नंदु आहीर (@NANDUVARU) October 13, 2020", "Several leaders of the Bharatiya Janata Party (BJP) accused NDTV of publishing false news including Gujarat MLA Piyush Desai, Karnataka MP Shobha Karandlaje, BJP National Secretary Dushyant Kumar Gautam, Odisha MP Sangeeta Kumari Singh Deo, Gujarat MLA Pradipsinh Jadeja and BJP members Asha Nakum and Vikas Pandey.", "This slideshow requires JavaScript.", "Other prominent handles that criticised the channel were Surendra Poonia, Anshul Saxena, OpIndia, Ramesh Solanki, Minhaz Merchant, Madhav Sharma, Ashu @muglikar_ and Prashant Patel Umrao.", "[Also read: Prashant Patel Umrao and his countless trysts with misinformation]", "However, NDTV was not the only news organisation to report that the store was attacked. India.com, Times Now, One India and The Logical Indian followed suit.", "This slideshow requires JavaScript.", "NDTV later altered ‘attack’ to ‘threats’ and tweeted an update with the police’s statement.", "Update: Tanishq source alleges threat to store. Gujarat cops say no attack at store but threats were issued. Apology note was put up at store. Read here: https://t.co/BI8DCNL4HT", "— NDTV (@ndtv) October 14, 2020", "The channel’s initial misleading report suggested that the store was vandalised when in fact staff members were threatened. However, online criticisms directed at the channel failed to acknowledge that the store did not merely receive threatening calls but a group of men visited the place and coerced the jewellery brand into putting up an apology note. That the police had to provide security to the staff was a far greater issue that was never discussed. Government agency PIB ‘fact-checked’ NDTV’s report declaring that the store wasn’t attacked which was only partially true.", "Claim: NDTV has reported that a mob attacked a #Tanishq store in Gandhidham, Gujarat. #PIBFactCheck: This claim is #Fake. No such incident has taken place in any Tanishq store. pic.twitter.com/MgqWUElFns", "— PIB Fact Check (@PIBFactCheck) October 14, 2020", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]