["About this rating", "On May 2, 2011, President Barack Obama announced that U.S. forces had finally located and killed the elusive al Qaeda leader Osama bin Laden during a raid on a compound in Pakistan, ten years after bin Laden had masterminded the 9/11 terrorist attacks on the U.S.", "On October 27, 2019, President Donald Trump announced that a U.S. operation had resulted in the death of Abu Bakr al-Baghdadi, the shadowy leader of the Islamic State group (commonly known ISIS) during a military raid in Syria", "During the press conference held to announce al-Baghdadi's death, Trump played up the accomplishment as being an even greater achievement than the killing of bin Laden, saying: “This is the biggest one perhaps that we’ve ever captured,” and “This is the biggest there is. This is the worst ever. Osama bin Laden was big, but Osama bin Laden became big with the World Trade Center. This is a man who built a whole, as he would like to call it, a country.\"", "During the press event Trump also once again referred to the debunked claim that prior to 9/11 that he had issued a warning that the U.S. needed to \"take out\" Osama bin Laden, declaring:  “I don’t get any credit for [my warning] ... But that’s okay. I never do. But here we are.”", "All of that verbal wrangling prompted some Trump critics to point out that after U.S. forces had finally run Osama bin Laden to ground, Trump had declared President Obama did not deserve congratulations for the feat because it was \"Navy SEALS [who] killed bin Laden\" and not Obama himself.  Those criticisms in turn prompted questions about whether Trump critics were correct in stating that Trump had really said such a thing.", "In short, the answer those questions is \"yes,\" Donald Trump did say such a thing.  Back on October 23, 2012 -- just two weeks before President Obama's re-election to a second term -- Trump tweeted the imperative, \"Stop congratulating Obama for killing Bin Laden. The Navy Seals killed Bin Laden\":", "Stop congratulating Obama for killing Bin Laden. The Navy Seals killed Bin Laden. #debate", "— Donald J. Trump (@realDonaldTrump) October 23, 2012", "Why don't we ask the Navy SEALs who killed Bin Laden? They don't seem to be happy with Obama claiming credit. All he did is say O.K.", "— Donald J. Trump (@realDonaldTrump) October 22, 2012", "In November 2018, Trump also responded to criticism of him from retired Adm. William McRaven by questioning, “Wouldn’t it have been nice if we got Osama bin Laden a lot sooner than that, wouldn’t it have been nice?”", "Blake, Aaron.   \"Bigger Than bin Laden? 3 Striking Things About Trump’s Announcement That Baghdadi Is Dead.\"\r\n    The Washington Post.   27 October 2019.", "Associated Press.   \"Trump Criticizes War Hero for Not Capturing bin Laden Sooner.\"\r\n    20 November 2018.", "Associated Press.   \"Trump Says Islamic State Leader Dead After US Raid in Syria.\"\r\n    27 October 2019.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]