["Corrections & Clarifications: An earlier version of this article misstated the affiliation between the Widener University Delaware Law School and the University of Delaware.", "Following his town hall on Oct. 15, Democratic presidential nominee Joe Biden has come under scrutiny about his teaching credentials.", "\"Joe Biden just said he will 'go back to being a professor' at the University of Pennsylvania when he loses and be 'back teaching,'\" reads a meme shared by Facebook user Amiri King.", "But King claims \"Biden never taught a single class a UPenn.\"", "The meme, which features a screenshot of Biden from the first presidential debate on Sept. 29, has received over 1,700 reactions since posted on Oct. 21.", "King declined to offer further comment.", "Fact check: Joe Biden faces friendly fire – partly false – over age, pot, prisons and more", "During Biden's televised town hall on Oct. 15 at the National Constitution Center in Philadelphia, the former vice president stated he would return to academia if defeated but would continue his efforts to improve the country's political landscape.", "\"So — but what I will do, I will — hopefully, I will go back to being a professor at the University of Pennsylvania ... and at the Biden Institute at the University of Delaware, focusing on, on these same issues relating to what constitutes decency and honor in this country,\" he said according to ABC News' full transcript of the event.", "Later, Biden reiterates that whether he becomes the next president or a \"defeated candidate for president back teaching,\" he would still strive for a better politics in the country.", "Fact check:False rumors that Hunter Biden is dead are a 4chan hoax", "Where exactly the Democratic nominee would resume teaching is ambiguous.", "Biden mentions the University of Pennsylvania.", "At Penn, he is the Benjamin Franklin Presidential Practice Professor, a position which has been only honorary and no teaching involved, according to Penn's independent student newspaper, the Daily Pennsylvanian.", "However, the former vice president has contributed greatly to the university, said Ron Ozio, director of media relations at Penn.", "\"As our Benjamin Franklin Presidential Professor of Practice, the Vice President helped to expand Penn's global outreach, while sharing his wisdom and insights with thousands of Penn students through seminars, talks and classroom visits,\" Ozio stated in an email to USA TODAY.", "He added Biden had been involved in three annual Silfen University Forums – a series the university states fosters \"conversation and debate regarding important contemporary issues\" – as well as several campus interview events and the Perry World House Penn Biden Leaders Dialogue.", "Biden has taken an unpaid leave of absence since beginning his presidential campaign, according to the university.", "Although not mentioned by Biden during the town hall, the former vice president had been an adjunct law professor at the Widener University Delaware Law School, a position confirmed by Rodney Smolla, the school's dean and professor of law.", "\"Senator Biden began teaching at the Delaware Law School in the fall of 1991,\" Smolla wrote in an email to USA TODAY.", "\"He taught a course in constitutional law on Saturdays, one semester each year. He taught the course by himself until 2003, when he was was joined by a co-teacher, Professor Robert Hayman of the Delaware Law faculty.\"", "Smolla stated Biden last taught in the fall of 2008.", "Fact check:In 1977, Biden said without orderly integration, his kids would grow up in 'racial jungle'", "We rate this claim MISSING CONTEXT because without additional context it could be misleading. During the Oct. 15 town hall, Biden stated he would return to being a professor if he lost the election, mentioning both the University of Pennsylvania and the University of Delaware. He does not specifically mention teaching until much later in his response but does not clearly state where exactly he would teach, whether at Penn where his position was honorary and did not involve teaching responsibilities, or elsewhere.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]