["By Rem Rieder", "Posted on September 10, 2020", "In a campaign speech in Warren, Michigan, Democratic presidential nominee Joe Biden falsely claimed that the United States’ trade deficit had “hit an all-time high” under President Donald Trump.", "It is true that the trade deficit for goods and services has grown under Trump compared with the levels under his predecessor, Barack Obama, whom Biden served as vice president. But the deficit was at much higher levels between 2004 and 2008 under President George W. Bush than it has been under Trump.", "Biden, Sept. 9: Under President Trump, U.S. trade deficit has grown. It’s hit an all-time high. Let me say that again. U.S. trade deficit is at an all-time high under Trump in the last three years.", "As a candidate, Trump vowed to bring down the trade deficit, the difference between imports and exports of goods and services. In a campaign appearance in Manchester, New Hampshire, on June 30, 2016, Trump said of the trade deficit, “You will see a drop like you’ve never seen before.” But during Trump’s presidency, the trade deficit has gone in the other direction, despite Trump’s claims to the contrary.", "During Trump’s first three years in the White House, the trade deficit in goods and services came in at $514 billion in 2017, $580 billion in 2018 and $577 billion in 2019, according to figures from the U.S. Census Bureau. By contrast, the figure for the last three years of Obama/Biden was $484 billion in 2014, $491 billion in 2015 and $481 billion in 2016.", "But trade deficits were much higher during the Bush years, ballooning to $764 billion in 2006, an all-time peak. The figure was also over $700 billion in 2005 ($717 billion), 2007 ($711 billion) and 2008 ($712 billion). Then trade fell off thanks to the recession. The trade deficit plummeted to $395 billion in 2009.", "We asked the Biden campaign for support for the candidate’s assertion but received no response.", "Editor’s Note: Please consider a donation to FactCheck.org. We do not accept advertising. We rely on grants and individual donations from people like you. Credit card donations may be made through our “Donate” page. If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, 202 S. 36th St., Philadelphia, PA 19104.", "Editor’s Note: Swing State Watch is an occasional series about false and misleading political messages in key states that will help decide the 2020 presidential election.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]