["The claim was published here on Facebook on July 29, 2020. The post has been shared 264 times.", "The Burmese-language post’s caption translates to English as: “#Breaking_News/ It’s reported that our beloved singer and actress, Tint Tint Htun passed away today at 9 am this morning at the age of 56 at the Kyaung Pann nuns monastery in Bu-talin township. Full detail will be reported soon.”", "The claim was also published here and here on Facebook. It was also shared on this news website in July 2020.", "The claim, however, is false.", "“I am sure that she is now healthy. I don’t want to say other personal things because this is her privacy,” U Hla Taw, a Buddhist monk who said he was in close contact with the former actress, told AFP by phone on July 30, 2020.", "U Hla Taw did not provide details of Tint Tint Htun's precise whereabouts but said “she is still alive, healthy and takes meditation as usual.”", "Yone Lay, a well-known rapper in Myanmar, also refuted the claim in the misleading posts, stating on his verified Facebook account that “our beloved Ma Tint is still alive and nothing happened to her.”", "Another popular pop singer, Moe Moe, added on his verified Facebook account that “the news about Tint Tint Htun’s death is not true.”", "“Her younger brother confirmed it. She is still meditating at the nunnery where she lives,” Moe Moe wrote in the post.", "Other Myanmar local media outlets including Mizzima, Duwun and 7 Day TV also reported here, here and here that Tint Tint Htun was in good health.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]