["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Gov. Rick Scott has been on the defense for months about All Aboard Florida, a controversial passenger rail project that he supports.", "All Aboard Florida will run from Miami to West Palm Beach in 2016 and could extend to Orlando the following year. The project has faced opposition from some residents on the Treasure Coast, who fear noise and other impacts. And as he campaigns for re-election, Scott has faced heat for the role of his chief of staff, who previously worked for All Aboard’s parent company.", "A key point of contention has been about the role of public dollars in the project.", "In an interview with the West Palm Beach TV station WPEC June 30, Scott said: \"All Aboard is a 100 percent private venture. There is no state money involved.\"", "Scott made similar claims in June in a letter to the editor in the Tampa Bay Times and at a campaign event in Largo in July.", "His description of the \"100 percent private venture\" prompted an outcry from the Florida Democratic Party and opponents of the project. Media reports have also outlined the public funding -- and potential public funding -- associated with the project. Earl Barrett of Clearwater wrote a letter to the editor of the Tampa Bay Times in June seeking some clarity: \"A PolitiFact check seems in order.\"", "Meanwhile, Scott’s likely nemesis on the November ballot, former Gov. Charlie Crist, made a claim that contradicted Scott’s assertion. \"All Aboard Florida is receiving millions in Florida taxpayer dollars,\" Crist wrote in a July fundraising email.", "As the All Aboard controversy moved full steam ahead in August, we decided it was time for us to subject Scott’s and Crist’s statements to our Truth-O-Meter.", "What we found is that All Aboard Florida is a private enterprise, but it also takes advantage of infrastructure paid for by the government. So neither Crist nor Scott is telling the full story.", "Here, we’ll look in depth at Scott’s statement that All Aboard is \"100 percent private\" with \"no state money involved.\"", "Scott has been asked why he rejected federal funds for high-speed rail in 2011 but now has shown support for All Aboard Florida.", "Republican Party of Florida Communications Director Susan Hepworth said in statements earlier this summer that the financing was vastly different: \"The proposed high-speed rail would have wasted millions of Florida taxpayer dollars by leaving the state on the hook for an unprofitable project. A private sector project — of any kind — not run on state funding obviously doesn’t have the same risks. Anyone saying these two issues are the same is being intentionally dishonest.\"", "In 2011, PolitiFact Florida fact-checked Scott’s claim that high-speed rail would have cost Florida $1 billion. The state’s portion of the project was going to be $280 million -- Scott based his figure on a suspect study. We rated that claim False.", "All Aboard Florida", "All Aboard Florida is a $2.5 billion passenger rail line that will connect Miami, Fort Lauderdale and West Palm Beach in 2016, with hopes to extend to Orlando in 2017. Proposed by Florida East Coast Industries, LLC, All Aboard will use private financing for a large portion of its costs and has applied for a $1.6 billion federal loan. In the TV interview, Scott didn’t mention that federal loan, but his administration has acknowledged in press statements that federal dollars could be part of the project.", "So there’s definitely federal money involved, but is there state money? We found three points of contention here.", "Quiet zones: In response to residents’ concerns about noise from All Aboard trains, the Legislature this year approved $10 million in \"quiet zone\" money for horns at railroad crossings. Local government agencies can apply for the money for any rail crossing, not exclusively for those used by All Aboard. Local governments have until mid October to apply for the money so no money has been granted yet, Florida Department of Transportation spokesman Dick Kane told PolitiFact Florida.", "Tri-Rail: Tri-Rail is an existing government-run passenger rail service in South Florida overseen by the South Florida Regional Transportation Authority. All Aboard mentioned in bond documents the possibility of using $44 million in state money to connect their trains to Tri-Rail, according to the Naples Daily News.", "While All Aboard and regional transportation officials talked about the idea of state funding, that never materialized and the Florida Department of Transportation officially shot down that idea amid all the publicity. So for now, there is no state money \"involved\" with connecting these two rail services.", "The Orlando International Airport: This is the most concrete connection between All Aboard and state funding.", "The airport is building a complex to include the airport’s people mover, parking and ground transportation. Connected to that project, the airport is also building an intermodal transportation facility -- and that’s the piece that will get about $214 million from a loan and grant from the state.", "The intermodal facility will accommodate rail -- including All Aboard Florida -- and potentially two other future rail projects, Phil Brown, airport director, told PolitiFact Florida.", "All Aboard Florida will pay the airport $2.8 million a year for a lease, which the airport will use to repay a portion of the state loan. In addition, All Aboard will pay the airport between $1 and $1.50 per passenger. (All Aboard Florida estimates that combined the total will add up to about $4.5 million a year.)", "\"Whatever they are using of that facility they are going to pay for,\" Brown said. The airport is required under federal regulations to charge fair market rate.", "\"The funding is for the Orlando International Airport, not All Aboard Florida,\" states a July 25 press release from FDOT. \"The airport will reimburse the state for the portion of funding related to the rail connection, whether it is All Aboard Florida or another private rail provider.\"", "Our ruling", "Scott said in a TV interview that \"All Aboard Florida is a 100 percent private venture. There is no state money involved.\"", "While All Aboard Florida is a private venture, it has applied for a $1.6 billion federal loan. Also, the state is kicking in money for infrastructure, particularly for a new intermodal center at the Orlando International Airport. The funding for that infrastructure doesn’t go directly to All Aboard, but All Aboard does derive some benefit from the spending.", "Overall, we rate Scott’s claim Mostly False.", "WPEC, \"All Aboard Florida Governor Scott weighs in,\" June 30, 2014", "WUSF, \"Gov. Scott, reporters duel over questions,\" July 15, 2014", "Florida Not All Aboard, Website, Accessed Aug. 4, 2014", "Tampa Bay Times, Letter to the editor by Gov. Rick Scott about All Aboard Florida (accessed in Nexis) June 9, 2016", "Orlando Sentinel op-ed by Phil Brown, executive director of the Greater Orlando Aviation Authority, \"Intercity rail has long been part of the airport’s vision,\" Aug. 3, 2013", "Florida Democratic Party press release, \"Rick Scott, you may want to call your office,\" July 7, 2014", "Charlie Crist campaign, Fundraising email, July 10, 2014", "Change.org, Petition against All Aboard Florida, Accessed Aug. 4, 2014", "Jacksonville Business Journal, \"All Aboard Florida creating political noise,\" July 16, 2014", "Naples Daily News, \"Rick Scott adviser had inside track to keep All Aboard Florida rail project rolling,\" July 5, 2014", "Naples Daily News, \"Analysis: All Aboard Florida private rail project has government financial support,\" July 12, 2014", "Gov. Rick Scott, Letter, July 15, 2014", "Florida Department of Transportation, Press releases related to All Aboard Florida, June and July 2014", "Florida House, HB 5001, 2014 session", "PolitiFact, \"Gov. Rick Scott says rail would have cost state taxpayers $1 billion to build,\" Aug. 11, 2011", "Tampa Bay Times, \"Gov. Rick Scott supports controversial rail project along Florida’s east coast,\" June 8, 2014", "Tampa Bay Times editorial, \"Scott should come clean about rail project,\" July 23, 2014", "Interview, Dick Kane, Florida Department of Transportation spokesman, Aug. 4, 2014", "Interview, Kevin Cate, Charlie Crist campaign spokesman July 29, 2014", "Interview, Susie Wiles, consultant to All Aboard Florida and manager of Gov. Rick Scott’s 2010 campaign, July 29, 2014", "Interview, Carolyn Fennell, Orlando International Airport spokeswoman, July 29, 2014", "Interview, Phil Brown, Orlando International Airport director, July 29, 2014", "Interview, Jack Stephens, South Florida Regional Transportation Authority director, July 29, 2014", "Interview, Bonnie Arnold, South Florida Regional Transportation Authority spokeswoman, July 29, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]