["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "President Donald Trump (AP)", "President Donald Trump called out New York on Twitter, asserting the state did not fight a provision in the 2017 tax law backed by Republicans. The provision, a $10,000 limit on deductions of state and local taxes, has a negative impact for some filers largely in high-tax states like New York, New Jersey and California.", "His tweet followed the news that New York Attorney General Letitia James would investigate the National Rifle Association and its tax-exempt status.", "\"...People are fleeing New York State because of high taxes and yes, even oppression of sorts,\" Trump wrote. \"They didn’t even put up a fight against SALT - could have won. So much litigation. The NRA should leave and fight from the outside of this very difficult to deal with (unfair) State!\"", "Trump’s claim that New York didn’t fight the provision in the Tax Cuts and Jobs Act that caps the deduction for state and local taxes at $10,000 was immediately challenged. Rep. Nita Lowey, a Democrat who represents Rockland County and part of Westchester County, tweeted: \"Is he living under a rock?! We fought tooth and nail against the Republican elimination of the SALT deduction. If he’s OK with bringing it back, he should join me in convincing members of his own party to reverse their decision to hurt working families.\"", "During a news conference on the day Trump tweeted, Gov. Andrew Cuomo questioned why Trump supported the policy if he knew it was bad for New York.", "\"What he said about SALT is unbelievable,\" Cuomo said. \"I’ve been saying for months it was an assault on New York, pardon the pun,\" Cuomo said. \"And now the President is running from his own policy. ... Why did you start it? It was your policy. It is your budget. You took credit for it.\"", "We asked Trump’s press office about how he formed his view of New York’s response to the cap but did not receive a response.", "Cuomo’s response to the cap goes back to 2017, when it was proposed. Shortly before it became law, he called the SALT cap provision an \"economic dagger directed at this state\" and \"a gross injustice.\" In 2018 he launched a campaign against the provision using legal and legislative tools.", "Cuomo even met with Trump at the White House in February to discuss changes to the cap after Trump indicated he would be open to them. Cuomo has continued to publicly criticize the cap, and following his meeting with Trump, he announced he had enlisted other governors in the effort.", "\"As governor of the state of New York today, my top priority is repealing SALT. Period,\" Cuomo told reporters in March.", "Advocacy came from New Yorkers in Congress, too.", "In October 2017, when discussion of the Republican tax changes was in the early stages, Sen. Charles Schumer called on New York’s House delegation to oppose any proposed repeal of the state and local tax deduction.", "While negotiations were ongoing, House Minority Leader Nancy Pelosi, in a news conference with Schumer, spoke of how people were upset with proposed changes to state and local tax deductions, that it \"rubs salt in the wounds of the taxpayers.\"", "Schumer's spokesperson, Dan Yoken, also provided a lengthy history of Schumer's public advocacy on the issue, including at least 22 instances in which the senator spoke publicly about preserving the SALT deduction.", "In October 2017, Treasury Secretary Steven Mnuchin said on Fox Business: \"Senator Schumer has been complaining about this [SALT Deduction] since the beginning of the year.\"", "Democrats did not vote in favor of the law, and some Republicans in New York’s House delegation voted against it too, including Reps. Peter King and Lee Zeldin of Long Island, Dan Donovan of Staten Island, John Faso of the Albany and Catskills areas, and Elise Stefanik, who represents the Adirondack and North Country regions. With one exception, House Republicans who voted against the tax reform law were from New York, New Jersey, and California.", "New York Republicans voting in favor of it were Reps. Chris Collins, Tom Reed, Claudia Tenney and John Katko. Some of the New York and New Jersey Republicans who favored the law told the New York Times that they blamed state government, not the tax bill, for the problems the SALT cap would create.", "The Trump administration also blocked states’ efforts to work around the cap, once the law was enacted, something Lowey fought in a letter to the IRS commissioner.", "Lowey and King have bipartisan legislation to restore the SALT deduction, introduced in January 2018 and in January 2019.", "Trump said that people in New York didn’t fight a cap on the deduction of state and local taxes, which was included in the 2017 tax reform law.", "New York elected officials have been speaking out against it since the time it was proposed, in the news media, in meetings with Trump, and in Congress. While the majority of New York’s representatives in Congress voted against the Tax Cuts and Jobs Act, four Republican New York House members voted for it.", "The Democrats who were vocal in speaking against the SALT cap were in the minority party and had little influence in the White House, House of Representatives and Senate, all controlled by Republicans. If anyone didn’t \"put up a fight\" in New York, it could have been the Republicans who could have used their influence as members of the majority party to push to eliminate the cap, but voted in favor of the tax legislation.", "We rate Trump’s statement False.", "Tweet, @realDonaldTrump, April 29, 2019. Accessed April 30, 2019.", "Tweet, @NitaLowey, April 29, 2019. Accessed May 1, 2019.", "\"Are New Yorkers really fleeing to Florida over taxes?\" PolitiFact, March 29. 2019. Accessed May 1, 2019.", "\"It’s true: A lot of people are leaving New York,\" PolitiFact, Sept. 29, 2017. Accessed May 3, 2019.", "\"Cuomo's claim not the case for most NY taxpayers,\" PolitiFact, April 17, 2019. Accessed May 8, 2019.", "\"Trump blasts N.Y. for NRA’s woes - and says state didn’t fight tax changes,\" The Buffalo News, April 29, 2019. Accessed April 30. 2019.", "\"Dem tax-writers forming working group on SALT deduction cap,\" The Hill, April 2, 2019. Accessed May 1, 2019.", "\"Rush transcript, Gov. Cuomo Responds to President Trump’s Latest Tweets on the NRA and SALT Deductions,\" April 29. 2019. Accessed May 1, 2019", "\"Trump Revises SALT History, saying New Yorkers Didn’t Fight Caps,\" Bloomberg, April 29 2019. Accessed May 1, 2019.", "\"President Trump knocks New York, Cuomo, and Attorney General James over NRA fight,\" Democrat and Chronicle, April 29, 2019. Accessed May 3, 2019.", "\"President Trump raises abortion, fracking issues during tax talk with Andrew Cuomo,\" Democrat and Chronicle, Feb. 12, 2019. Accessed May 3, 2019.", "News release, Sen. Schumer on LI, calling on House members to oppose repeal of state and local tax deduction, Oct. 12, 2017. Accessed May 3, 2019.", "Video, news conference, Minority Leaders Nancy Pelosi and Charles Schumer, Nov. 13, 2017, via C-SPAN. Accessed May 5, 2019.", "\"New Yorkers saved SALT years ago, but this time, they’re falling short,\" Politico, Nov. 16, 2017. Accessed May 5, 2019.", "Final Vote Results For Roll Call 692, Tax Cuts and Jobs Act, Dec. 19, 2017.  Accessed May 5, 2019.", "How Each House Member Voted on the Tax Bill, New York Times, Dec. 19 2017. Accessed May 5, 2019.", "Rush transcript, Gov. Andrew Cuomo conference call, Dec. 18, 2017. Accessed May 5, 2019.", "Email conversation, E.J. McMahon, founder and research director, Empire Center for Public Policy, May 3, 2019.", "\"Treasury Issues Crackdown on State and Local Tax Workarounds,\" New York Times, Aug. 23, 2018. Accessed May 5, 2019.", "\"If the G.O.P. Tax Plan Hurts You, Congressmen Say It’s Your State’s Fault,\" New York Times, Dec. 7, 2017. Accessed May 5, 2019.", "\"Gov. Cuomo Announces States Join Campaign to Fight for Tax Fairness,\" Gov. Andrew Cuomo’s website, Feb. 22, 2019. Accessed May 5, 2019.\n\"Gov. Cuomo Launches Tax Fairness for New York Campaign,\" Gov. Andrew Cuomo’s website. Feb. 8, 2018. Accessed May 5, 2019.", "Transcript: Governor Cuomo Outlines Remaining Budget Priorities, Gov. Andrew Cuomo website, March 11, 2019. Accessed May 8, 2019.", "Email conversation, Dan Yoken, spokesperson, Sen. Charles Schumer, May 8, 2019.", "Interview, Steven Mnuchin, Mornings with Maria, Fox Business, Oct. 25, 2017. Accessed May 8, 2019.", "Phone, email conversation, Katelynn Thorpe, spokeswoman, Rep. Nita Lowey, May 8, 9, 2019.", "Lowey, King Reintroduce Bipartisan Legislation to Restore SALT Deduction, Rep. Nita Lowey, Jan. 3, 2019. Accessed May 9, 2019.", "Lowey Urges IRS Commissioner to Drop Proposed SALT Regulation, Rep. Nita Lowey, Oct. 5, 2018. Accessed May 9, 2019.", "Lowey, King Introduce Bill to Restore SALT Deduction, Rep. Nita Lowey, Jan. 9, 2018. Accessed May 9, 2019.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]