["By D'Angelo Gore", "Posted on May 3, 2017", "Q: Did President Trump urge Jehovah’s Witnesses to seek asylum in the U.S. after the religious group was banned in Russia?", "A: No. A fake news story attributed that statement to Trump.", "The fake news story “Trump Warns Russia Over Jehovah’s Witnesses Ban and Urges Members to Seek Asylum in the US” has been published on a number of websites that sound like legitimate news sources, but aren’t.", "The sham story says that “President Trump has sent a strong message to the Russia Federation over the country’s ban on the ‘peaceful activities’ of Jehovah’s Witnesses.”", "Russia’s Supreme Court did recently uphold the Russian Justice Ministry’s decision in March to label Jehovah’s Witnesses an “extremist” group and ban followers of the religion from operating in the country. There were plenty of real news stories about that.", "However, there was no statement from Trump about it on the White House website. And our search of the Nexis news database turned up no stories that said Trump reacted to the decision by threatening to use Russia’s own constitution against them, or that he urged Jehovah’s Witnesses in Russia “to seek asylum in the United states until your rights are fully reinstated,” as the fake story claims.", "Instead, we saw a genuine news story about the State Department denouncing the ban.", "U.S. News and World Report, April 21: The U.S. State Department has condemned the Russian ban on Jehovah’s Witnesses.", "“The United States is extremely concerned by the Russian government’s actions targeting and repressing members of religious minorities, including Jehovah’s Witnesses, under the pretense of combating extremism,” Acting State Department spokesman Mark C. Toner told U.S. News by email late Thursday night.", "Earlier Thursday, the Russian Supreme Court called the pacifist religious sect extremist and ordered the shuttering of more than 300 chapters in the country.", "“We call on the Russian authorities to ensure that Russia’s anti-terrorism and anti-extremism legislation is not misused to target members of peaceful religious minorities, including the Jehovah’s Witnesses,” Toner said. “The prosecution of peaceful religious minority groups for ‘extremism’ creates a climate of fear which itself undermines efforts to combat the threat of radicalization.”", "The U.S. News & World Report story didn’t include any quotes from Trump. Neither did a Newsweek story that quoted the chair of the U.S. Commission on International Religious Freedom, Thomas J. Reese, saying: “Russia has been cracking down on religious groups that are not supportive of the government and it’s just amazing to pick on a small group which is pacifist which doesn’t want to be involved in politics and to classify them as the same is [sic] ISIS just shows how absurd these extremism laws are in Russia.”", "Facebook users have reported the fake story — which was published on websites including houstonchronicle-tv.com, states-tv.com, usanews-tv.com and fox-news24.com — using the social network’s tool for flagging suspected hoaxes.", "Readers should know that houstonchronicle-tv.com isn’t the website of the Houston Chronicle newspaper, nor is fox-news24.com a website of Fox News. Fox-news24.com is actually affiliated with the website USA Television, which publishes fake news stories, but also republishes some real stories from authentic news sources.", "We wrote about one of the bogus stories on USA Television that said Trump signed executive orders allowing nationals from various countries to travel to the U.S. without visas.", "Another USA Television website posted a fake story under the headline “Trump consoles Jehovah’s Witnesses on Russia ban as he worships with them.” That story was published on ab.cnewsgo.com, which shouldn’t be confused for the URL of the real ABC News website, abcnews.go.com. Snopes.com found that that made-up story had been shared on Facebook with a photo of Trump and others attending an interfaith prayer service in January and not a recent service with Jehovah’s Witnesses, as the story claims.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to help identify and label viral fake news stories flagged by readers on the social media network.", "Houstonchronicle-tv.com. “Trump Warns Russia Over Jehovah’s Witnesses Ban and Urges Members to Seek Asylum in the US.” 20 Apr 2017.", "Fox-news24.com. “Trump Warns Russia Over Jehovah’s Witnesses Ban and Urges Members to Seek Asylum in the US.” 20 Apr 2017.", "Ab.cnewsgo.com. “Trump consoles Jehovah’s Witnesses on Russia ban as he worships with them.” Accessed 2 May 2017.", "Mills, Curt. “State Dept. Condemns Russian Religious Clampdown.” U.S. News & World Report. 21 Apr 2017.", "Reuters. “Russian court bans Jehovah’s Witnesses as extremist.” 20 Apr 2017.", "Higgens, Andrew. “Russia Bans Jehovah’s Witnesses, Calling It an Extremist Group.” New York Times. 20 Apr 2017.", "Higgens, Andrew. “Russia Moves to Ban Jehovah’s Witnesses as ‘Extremist.’ ” New York Times. 4 Apr 2017.", "Le Miere, Jason. “US: Russia’s Jehovah’s Witnesses Ban Shows ‘Paranoia’ of Vladimir Putin’s Government.” Newsweek. 21 Apr 2017.", "Gross, Zachary. “Bogus Visa Waiver Stories.” FactCheck.org. 21 Feb 2017.", "Evon, Dan. “Did Trump Warn Russia Over Jehovah’s Witnesses Ban and Urge Members to Seek Asylum in the U.S.?” Snopes.com. 2 May 2017.", "FactCheck.org Rating:", "Read More", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]