["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "U.S. Rep Annie Kuster raised eyebrows earlier this month when she claimed on NHPR’s Morning Edition that a bill putting extra restrictions on Syrian refugees wouldn't actually slow down the program.", "\"The bill would not prohibit Syrian refugees from entering the nation. I think there's been a lot of misinformation frankly about the bill,\" she said. \"It doesn't pause the program. It doesn't apply a religious test. It's a certification that the person does not pose a threat to the security of the United States.\"", "The bit that caught our attention was Kuster’s statement that the the bill \"doesn’t pause the program.\" Could that be true? Or did the Democrat go overboard in defending her support of a GOP-backed proposal?", "We decided to check it out.", "The bill in question is called the American Security Against Foreign Enemies Act of 2015. It passed the U.S. House with nearly unanimous Republican support and with the backing of 47 Democrats, including Kuster. According to behind-the-scenes reporting from the Huffington Post, the White House lobbied Democrats to oppose the measure, but ultimately couldn't persuade them all to oppose the bill.", "So, what's in the SAFE Act? What does it do, and would it actually slow down Syrian refugees coming into the country? It's useful in this case to go to the bill itself. And luckily for us, the SAFE Act is a relatively simple read.", "Unfortunately, its implications are murkier.", "Here are the two most pertinent sections of the bill. They’re worth quoting in full, as we’ll see soon enough.", "\"In addition to the screening conducted by the Secretary of Homeland Security, the Director of the Federal Bureau of Investigation shall take all actions necessary to ensure that each covered alien receives a thorough background investigation prior to admission as a refugee. A covered alien may not be admitted as a refugee until the Director of the Federal Bureau of Investigation certifies to the Secretary of Homeland Security and the Director of National Intelligence that each covered alien has received a background investigation that is sufficient to determine whether the covered alien is a threat to the security of the United States. ...", "\"A covered alien may only be admitted to the United States after the Secretary of Homeland Security, with the unanimous concurrence of the Director of the Federal Bureau of Investigation and the Director of National Intelligence, certifies to the appropriate Congressional Committees that the covered alien is not a threat to the security of the United States.\"", "The rest of the bill adds reporting requirements and defines the refugees in question as those coming from Iraq or Syria. It does not institute any penalties or consequences for failure to comply with its requirements.", "A simple distillation of that text comes from the govtrack.us website, which describes it thusly: \"H.R. 4038 would expand the screening process for those refugees attempting to enter the United States by requiring the Federal Bureau of Investigation (FBI) to conduct its own background checks in addition to the Department of Homeland Security’s (DHS). Any refugee would be prohibited from entry until the FBI certifies that they pose no security threat. Refugees would only be admitted with the unanimous agreement of the FBI, DHS, and Director of National Intelligence.\"", "In other words, it adds layers of certification beyond what’s already on the books requiring that refugees are safe before entering the United states. But as Kuster said, the bill does not bar Syrian refugees from the United States, nor does it impose a religious test.", "What would the legislation mean in practice? The White House certainly had its interpretation, which was the extra requirements would cause big delays.", "According to an official statement from the executive branch, the bill would \"create significant delays and obstacles in the fulfillment of a vital program that satisfies both humanitarian and national security objectives.\"", "U.S. Attorney General Loretta Lynch and FBI Director James Comey made the same arguments during  a news conference after the bill passed.", "\"To ask that we have my FBI director make personal guarantees would effectively grind the program to a halt,\" Lynch told reporters last month.", "And that seemed to be the goal of House Republicans who supported it, at least in part. According to National Public Radio’s reporting, \"Supporters of the bill say it would require a ‘pause’ in admitting Syrian and Iraqi refugees, as current applications would be halted while a new vetting process was established.\"", "But the House Democrats who broke ranks with their party to support the bill disagreed with both the president and Republicans. According to the Huffington Post report mentioned earlier, a Democrat told lawmakers that the bill \"doesn't hurt the refugee process, so put a certification stamp at the bottom and move on.\"", "A top House Democrat cited in the article also said that the defectors had \"a sense that the underlying reforms weren't severe.\"", "In other words, Kuster and 46 other House Democrats decided that if all that was needed was extra certifications, surely they could be put into place without many problems. And while the bill seems to suggest that the FBI would need to conduct an extra background check -- and the bill summary says as much -- the actual text is less clear about what that would entail.", "It instead reads that \"the Director of the Federal Bureau of Investigation shall take all actions necessary to ensure that each covered alien receives a thorough background investigation.\" That’s not specifically calling for another check.", "We contacted Kuster’s office, which said the congresswoman’s intention was to protect the American people.", "Our ruling", "U.S. Rep Annie Kuster said the Republican-backed bill she voted for wouldn't pause the resettlement of Syrian refugees. While a number of House Democrats agree with her, the White House and Republicans believe the contrary, saying the bill would either slow down or stop the flow of refugees.", "Although there’s nothing in the bill that says it will specifically cause a pause, a reasonable reading of the legislation could lead to such an interpretation.", "Kuster’s claim ignores critical evidence that could lead to an opposite conclusion. We rate her statement Half True.", "\"Kuster Disputes Bill She Voted For Would 'Pause' Syrian, Iraqi Refugee Program,\" NHPR, Dec. 3, 2015", "H.R.4038 - American Security Against Foreign Enemies Act of 2015, Congress.gov, Nov. 19, 2015", "Final vote results for roll call 643, clerk.house.gov, Nov. 19, 2015", "\"How The White House Lost Democrats On The Syrian Refugee Bill,\" Huffington Post, Nov. 20, 2015", "\"House Votes To Increase Security Checks On Refugees From Iraq, Syria,\" NPR, Nov. 19, 2015", "\"4 Things To Know About The Vetting Process For Syrian Refugees,\" NPR, Nov. 8, 2015", "H.R. 4038: American SAFE Act of 2015 summary, govtrack.us", "\"House Passes Bill to Halt, Overhaul Syrian Refugee Process,\" The Wall Street Journal, Nov. 19, 2015", "Correspondence with U.S. Rep. Annie Kuster’s office, Dec. 16, 17", "\"PolitiFact Sheet: 5 questions about Syrian refugees,\" PolitiFact, Nov. 19, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]