["By Lori Robertson and Jessica McDonald", "Posted on July 6, 2020", "The Centers for Disease Control and Prevention reported that through May 30, 14% of confirmed coronavirus cases led to hospitalizations — including 2% in intensive care units. But President Donald Trump falsely claimed “99%” of cases “are totally harmless.”", "The president, according to his press secretary, was referring to the case fatality rate, and he claimed the amount of testing the U.S. has conducted showed this. The testing actually shows a case fatality rate of 4.5%, but not everyone who has contracted COVID-19, the disease caused by the virus, has been tested. Some estimates say the fatality rate among those infected is likely around 1%.", "Asked whether cases that don’t result in death are “harmless,” White House Press Secretary Kayleigh McEnany said: “The president was noting the fact that the vast majority of Americans who contract coronavirus will come out on the other side of this.”", "“Some estimates do place the mortality at about 1%,” Columbia University epidemiologist Stephen Morse told us in an email, noting that we don’t have a solid figure for the total number of people who have been infected. “However, 1% mortality is not the same as ‘99% … totally harmless’. I wish that were true. ‘Totally harmless’ suggests that the infection doesn’t do any harm.”", "In addition to patients who get sick enough to need hospitalization, some who have recovered from COVID-19 report experiencing long-term effects, “including lung damage but also other symptoms, and we don’t know how common these sequelae (the term for aftereffects of disease) are,” Morse said.", "Trump made his claim in July 4 remarks at the White House.", "“Likewise, testing — there were no tests for a new virus, but now we have tested almost 40 million people,” he said. “By so doing, we show cases, 99% of which are totally harmless. Results that no other country can show, because no other country has testing that we have — not in terms of the numbers or in terms of the quality.”", "The president exaggerated the number of tests a bit: 36.3 million had been conducted as of July 3, according to the CDC. The COVID Tracking Project had the total at 34.9 million as of July 4.", "What those tests show is that 2.8 million people had tested positive for COVID-19 and 122,464 had died in the U.S., as of July 4. That puts the case-fatality rate — the percentage of confirmed cases that resulted in death — at more than 4%.", "Trump is also wrong to say these are “results that no other country can show.” Several countries have lower case fatality rates than the U.S.", "Among the 20 countries most affected by COVID-19 now, the U.S. has the sixth highest case fatality rate — which means 14 other countries have lower rates, according to data collected by Johns Hopkins University & Medicine.", "And, as we’ve written before, the president is wrong to claim other countries don’t have the same “quality” of tests. Rangarajan Sampath, the chief scientific officer of the nonprofit Foundation for Innovative New Diagnostics, told us in late April there wasn’t any data to support Trump’s claims that the U.S. tests are better than those in other countries.", "Morse said: “Most of our tests for the virus are of very good quality, but quality varies, too, and many tests in other countries use the same methodology and are just as good.”", "“There’s a lot of debate about the infection fatality rate,” Dr. Ashish Jha, faculty director of the Harvard Global Health Institute, said in a July 6 press call. “I think the broad consensus in the community is that the infection fatality rate is somewhere between 0.6% and 1%,” but that varies based on whether a population is older or younger.", "Jha pointed to a study published in the Lancet on July 6 that used antibody tests to estimate the prevalence of COVID-19 in Spain. The findings — that about 5% of the population could have been infected — suggest an infection fatality rate of 1.2%, as Jha explained in a Twitter thread.", "Based on several studies in various countries, the World Health Organization’s chief scientist, Dr. Soumya Swaminathan, said on July 2 that the infection fatality rate is about 0.6% — at least for now, according to the New York Times.", "Jha said he thinks the rate “should come down over time because we’re getting better at treating COVID.”", "“And so somebody who spends three weeks in the ICU, has severe lung damage and would have died two months ago might now survive,” he said. “But let’s be very clear, that if you spent three weeks in the ICU, have severe, diffuse lung damage and you survive, it’s fabulous that you survived. That was not inconsequential.”", "Even if the infection fatality rate is about 1%, that’s “still a lot of people,” Dr. Lee Riley, professor and chair of the Division of Infectious Disease and Vaccinology at the University of California, Berkeley School of Public Health, told us. “I’m more concerned about the actual numbers of people who are dying rather than the percent.”", "As of July 6, that figure was 130,208 deaths in the United States, according to Johns Hopkins’ figures.", "“Whatever the proportion, we’ve had over 130,000 deaths in the US so far,” Morse, at Columbia University, said, “more than twice as many as died in the Vietnam War, and more than died in Korea, Vietnam, Iraq, and Afghanistan combined, but I don’t think war could be called ‘99% harmless’.”", "McEnany said in the July 6 press briefing that Trump’s claim was a reference to “the fact that mortality in this country is very low.” And the case “fatality rate in this country, vis-a-vis other European countries, is much lower than, let’s say, France and Italy.”", "The U.S., at 4.5%, does have a lower case fatality rate than France (14.6%) and Italy (14.4%), as well as other countries, but a higher rate than many countries, too.", "But McEnany’s explanation doesn’t support what Trump said, in claiming 99% of coronavirus cases are “totally harmless.”", "In addition to those who die, many are hospitalized. In June, the CDC published data on the 1.3 million reported cases in the U.S. from Jan. 22 to May 30, finding: “Overall, 184,673 (14%) patients were hospitalized, 29,837 (2%) were admitted to an intensive care unit (ICU), and 71,116 (5%) died.”", "A study published in late February by the Chinese Center for Disease Control and Prevention similarly found that 14% of cases in mainland China were severe and 5% were critical. The latter category included “respiratory failure, septic shock, and/or multiple organ dysfunction or failure.”", "The WHO also says that 13.8% of confirmed coronavirus patients have severe disease and 6.1% have critical cases.", "Beyond the harm caused by being sick and hospitalized, there are the financial ramifications of that treatment, the impact on hospitals of the pandemic and the burden to the U.S. health system, Riley said.", "And even those who have mild symptoms may transmit the infection to others. “They can still pass it on to others, who may get sick or even (tragically) die,” Morse said.", "Not much is known about how frequently COVID-19 patients suffer long-term effects, but there are signs that the disease does not always completely resolve itself as rapidly as expected — and is unlikely to be described as “harmless” by many who are affected.", "“We don’t have any long-term data because the virus has only been around for a little while,” said Harvard’s Jha. “But we certainly are seeing more and more cases of people with … lingering symptoms.”", "According to the WHO, it takes about two weeks for a person to recover from a mild case of COVID-19, and three to six weeks to recover from a severe or critical one.", "Anecdotally, however, some patients — even those with mild cases — report months of extreme fatigue or on-and-off again symptoms such as headaches, brain fog or shortness of breath that make daily life difficult.", "These so-called “long-haulers,” as some call themselves, have shared their stories in online support groups and with journalists. One patient in the U.K. told The Atlantic that her case might be “mild relative to dying in a hospital, but this virus has ruined my life.”", "Without more data, it’s difficult to know how common these complaints are or why they might be happening, but similar types of symptoms have been reported in the wake of other viral infections, including SARS.", "One hypothesis is that the lingering symptoms are the result of the immune system still reacting to the virus, even if infectious virus is long gone from the body.", "Experts also have concerns that some proportion of those who survive severe COVID-19 infections may be left with organ damage.", "“The amount of lung damage that we’re seeing in a lot of CAT scans make me very worried about functional capacity and long-term lung function in a lot of these people who survive,” Jha said. “And so my best guess — and it is just a guess — is a sizable minority of people who end up getting infected, I don’t know, 10, 20% of people will end up having meaningful long-term clinical effects of this virus.”", "The National Heart, Lung, and Blood Institute launched an observational study in June to investigate the long-term health effects of having been hospitalized with COVID-19, with a special focus on the heart and lungs.", "Dr. Stephen Hahn, the commissioner of the Food and Drug Administration, was asked about Trump’s “totally harmless” claim on CNN’s “State of the Union” on July 5. Hahn wouldn’t say whether the president was wrong.", "“I’m not going to get into who is right and who is wrong,” he said. “[W]hat I will say is that we have data in the White House task force. Those data show us that this is a serious problem. People need to take it seriously.”", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]