["About this rating", "President Donald Trump repeatedly promised throughout the first two years of his presidency to build a concrete border wall between the United States and Mexico, arguing that it was the best way to stem the flow of illegal immigrants into the U.S. So when the Daily Show shared a clip of Donald Trump telling a group of students to get around a concrete wall by any means necessary -- his metaphorical way of telling them to never give up -- some viewers were a little taken aback:", "Oh man, once Trump gets his wall he better hope no one shows Mexico this old video we found. pic.twitter.com/FtzeGlmecz", "— The Daily Show (@TheDailyShow) January 10, 2019", "Trump exhorted graduates during his speech to \"Never ever give up. Don't give up. Don't allow it to happen. If there's a concrete wall in front of you, go through it, go over it, go around it, but get to the other side of that wall.\"", "Those words are documented in a genuine clip from a commencement speech Donald Trump delivered to students at Wagner College on Staten Island in May 2004. The New York  Daily News reported of the speech at the time that:", "The Donald is now The Doctor. Donald Trump added the title to his trophy case yesterday, picking up an honorary doctorate of humane letters from Wagner College on Staten Island. \"Melania, from now on you will address me as Dr. Trump,\" the billionaire joked to his model fiancée, Melania Knauss. Sure, she will.", "Speaking before hundreds of graduates, the star of \"The Apprentice\" dished out the sort of advice commonly heard at commencement ceremonies: Always give 100% effort. Be disciplined. Study and learn. The twice-divorced developer also offered some wisdom he learned the hard way.", "\"Always have a prenuptial agreement,\" Trump said, drawing laughs from the crowd. Trump wore a green graduation gown, but didn't don a cap - keeping every strand of his renowned hair in place as he accepted his honors. The Donald took the audience through his rise and fall as a real-estate titan - and then his meteoric spike in popularity with the advent of \"The Apprentice.\"", "\"I'm a star - and there's nothing like it,\" he said. \"It beats real estate all the time.\"", "The full video of Trump's speech adds a little more context to his comments. The real estate mogul was telling the crowd about his views on what is most important in life. First, according to Trump, was to do what you love. Second, was to never give up:", "I'll tell you to me the second most important thing after love what you do, is never, ever give up. Don't give up. Don't allow it to happen.  If there's a concrete wall in front of you, go through it, go over it, go around it, but get to the other side of that wall.", "I have so many people I have seen over the years that if they just fought a little bit harder they would have made it. They would have succeeded. They would have accomplished their goal. But they gave up. Don't give up.", "The relevant portion of the speech can be glimpsed at the 12:30 mark below:", "Trump was obviously using a metaphor in his speech and not urging students to climb an actual concrete wall along a national border. Still, many viewers found it to be an odd choice of words given that Trump would later make the supposed impenetrability of concrete walls a central focus of his presidency.", "Martinez, Jose.   \"It's Dr. Trump to You, Pal!\"\r\n    [New York] Daily News.   22 May 2004.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]