["The report, which includes several photos of a visible ailing Pope Francis, was shared in this Facebook post on February 29, 2020.", "The article is headlined: “Vatican confirms Pope Francis and two aides test positive for Coronavirus”.", "The Facebook post’s caption reads: “This is serious”.", "Below is a screenshot of the misleading post:", "“The Vatican has confirmed in a statement that Pope Francis and two of his aides have tested positive for the novel Coronavirus,” the article states. “Pope Francis missed a planned Mass with clergy in Rome yesterday after showing Coronavirus-like symptoms.”", "The report was published by a website called “Make Comments Meaningful”.", "The report is not dated. It includes photos of the pope taken on February 26, 2020 by the Associated Press and Reuters published here and here.", "The report was also shared alongside a similar claim here on Facebook, here on Twitter, and here on Reddit.", "Below is a screenshot of the report:", "The 83-year-old pontiff was recently suffering from a cold, as AFP reported here on March 1, 2020.", "But the claim that the Vatican confirmed he had contracted the novel coronavirus is false.", "Vatican spokesman Matteo Bruni said in a statement that \"the cold diagnosed (in the pope) was running its course, without symptoms attributable to other pathologies,” AFP reported on March 4.", "The statement was released after Messaggero, an Italian newspaper, reported that Pope Francis had tested negative for the novel coronavirus. The Vatican’s statement did not directly confirm or acknowledge the reported test.", "Keyword searches on the websites of the Vatican Press Office and Vatican News also found no statements about Pope Francis contracting the novel coronavirus.", "A closer analysis of the website “Make Comments Meaningful” reveals it is not a legitimate news site.", "Its reports do not have bylines and the sources for its reporting are vague. The site also does not have any description section detailing the nature of the organisation or how to contact the site's creators.", "The false report about the pope was also debunked by multiple fact-checking organizations, including Snopes, Politifact and the Taiwan Fact Check Center.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]