["By Vanessa Schipani", "Posted on April 14, 2017", "Sen. Bill Cassidy of Louisiana said William Wilberforce, a late 18th century British politician, “pushed the sale of beer” to successfully combat “drunkenness related to gin” in England. But Wilberforce wasn’t even born until after the so-called gin epidemic had ended in the early 1750s, and its conclusion wasn’t due to beer.", "The gin epidemic’s end eventually came at the hand of multiple factors, including the rising price of grain, reduced wages and legislation that raised taxes on gin. Beer consumption also remained stagnant during the 18th century, which experts say suggests people were drinking gin, or cheap spirits generally, in addition to beer, not substituting one for the other.", "Cassidy, also a doctor, made his claims on April 5 during the confirmation hearing of Scott Gottlieb, President Donald Trump’s nominee to head the Food and Drug Administration.", "Cassidy, April 5: One of my favorite historical figures is William Wilberforce. Many reasons why, but among them is that he realized that there’s a lot of problems with drunkenness related to gin. And so the way he mitigated that was he pushed the sale of beer. And the idea is that you’d get so bloated, you’d have to urinate, etc., etc., that you could only drink so much beer as opposed to drinking a lot of gin. It went really successful [sic].", "Cassidy then compared what he believed to be the solution to gin drinking in England to tobacco use today. He said “maybe the way to address tobacco is by tobacco mitigation,” namely by “looking for products that would be an alternative to a cigarette” with “less of the untoward effects.” Later on during the hearing, Cassidy doubled-down on his claims about gin and beer during an exchange with Sen. Al Franken of Minnesota.", "Franken, April 5: I’m struck by the gin for beer, because I would just like to throw it open to anybody here — I think that doesn’t actually work.", "Cassidy: It worked in England. That was actually seen as a milestone, I don’t want to use your time, but as a milestone in the cessation of alcoholism.", "Franken: I’m skeptical.", "Franken has good reason to be skeptical. There was a William at the time who depicted beer drinking as being preferrable to gin drinking during the gin epidemic — Cassidy may have been referring to that. But, if so, Cassidy had the wrong William, and, regardless, beer consumption didn’t end the gin epidemic.", "We reached out to Cassidy’s office for support multiple times, but we haven’t received a response. If we do, we’ll update this piece accordingly.", "What caused the epidemic to begin with? According to historians, a proliferation in the domestic production of spirits played a large role.", "In the 16th century, gin and other spirits were rarely consumed in England. Most distilling occurred only for medicinal purposes, according to Peter Clark, a historian at the University of Helsinki in Finland. But by the 1680s, the consumption of spirits had spread across the southern portion of the country, though most supplies came from abroad, primarily France, explains Clark in a paper published in Transactions of the Royal Historical Society in April 1987.", "In the late 1680s, when England went to war with France, the English Parliament passed a series of laws that protected domestic distilleries from foreign imports. For example, England imposed duties on imported spirits and abolished the monopoly that the London Company of Distillers had on the domestic production of spirits. This led to a proliferation of distillers in the country. By the 1730s, London alone was said to have 1,500 distilleries, says Clark.", "With more distilleries, gin and other spirits became affordable and accessible to “working-class consumers,” explains historian Jessica Warner and co-authors in a paper published in the American Journal of Public Health in March 2001. In an email, Warner, who wrote a book on the gin epidemic, also explained that “‘gin’ was an umbrella term for cheap, domestically produced spirits”; hence the historical label, “gin epidemic” or “gin craze.”", "According to Warner and colleagues, “Once established, the domestic distillery very quickly emerged as an important source of revenue to the Crown.” This led to increasing taxation on gin and other spirits between 1710 and 1762. At the same time, “Only gradually did the state concern itself with the threat, probably more imagined than real, that gin posed to maintaining public order,” particularly in London, which was England’s largest market for distilled spirits, the group adds. With this concern, regulating gin also became a way of combating what was seen as an epidemic.", "In fact, it’s unclear how much of a problem the so-called epidemic posed, but Warner and her colleagues write, “attempts to restrict the consumption of distilled spirits were rooted in an essentially hierarchical vision of the social order.” These attempts “reflected the belief that the excesses of the working poor posed a particular threat to the nation, threatening to deprive it of both workers and soldiers.”", "Warner and colleagues date the so-called epidemic as peaking between roughly 1720 and 1751. During this time, the British Parliament passed a number of “Gin Acts” that raised taxes on distilled spirits, while also aiming to “limit the number” of outlets “licensed to sell them,” the group writes.", "From 1700 to 1729, the consumption of British spirits grew by 260 percent, from 0.36 gallons per person (15 years or older) per year to 1.31 gallons. A peak in consumption in 1729 paralleled the first of the gin acts, which Warner and colleagues argue led to a 24 percent drop in consumption the following year.", "However, consumption grew again, reaching a peak of 1.74 gallons in 1735. The Parliament then passed another act in 1736, which led to a 30 percent drop in consumption over the next year. Yet by 1743, consumption had again grown, reaching a peak of 2.21 gallons per person per year.", "Consumption then dropped from 1.83 gallons in 1744 to 0.59 gallons in 1771. Another gin act was also passed in 1751, which Warner and colleagues argue finally “succeeded” in controlling the gin epidemic, but “by accident rather than by design,” as we’ll explain.", "At the height of consumption, the 2.21 gallons per person per year would be less than an ounce of gin (or other spirits) per person per day. It would be the equivalent of drinking about one gin and tonic (with 1.5 ounces of gin) every other day.", "For comparison, U.S. consumption between 2008 and 2010 was about 2 gallons of spirits (80 proof) per person (15 years or older) per year on average, according to the World Health Organization — also under an ounce per day. However, Warner told us that spirits were likely often diluted during the epidemic, so comparisons to today might not be valid.", "Overall, Warner and her colleagues argue legislation had mainly short-term effects on combating the so-called epidemic, that is, only in the first year after the passage of each act.", "But what finally did in the epidemic?", "Around the time of the passage of the 1751 act, “the government started to gain the upper hand,” write Warner and colleagues. Based on their analysis, “the effects of increased taxation may have been magnified by a gradual decline in real wages,” they write. Hence, this gin act may have “succeeded” because of other changes occurring in the country at the time.", "Warner elaborated on this point in an email. She said, “[T]he English population is pretty much stagnant in the first half of the eighteenth century, meaning that it had the disposable income to spend on more alcohol.” But in the second half of the century, the population grew rapidly, which means “that working people had less money to spend on luxuries such as alcohol.”", "In other words, rapid population growth can drive down real wages. The idea is that if more people are available for work, then employers can pay each person they do hire less, she explained.", "But there was another stressor at play — the rising cost of grain.", "The price of grain went up for two reasons, Warner told us. First, “demand rose with the population,” and second, “the generally good harvests of the first half of the century were followed by the generally poor harvests of the second half,” she said. “Obviously, gin is made from grain, so that’s one factor in pricing it out of the reach of more people,” but “with food being the principal expenditure for most families, any increase in the price of bread had to be met by belt-tightening elsewhere,” she added.", "In a nutshell, “Lower wages + higher food costs = less money to spend on alcohol,” Warner said.", "Warner and colleagues also say that the government’s “interventions to limit consumption did not succeed” until there was “some level of public consensus” on gin’s negative effects. They point out that a lack of public consensus might help account for the failure of early legislation to regulate gin.", "Warner et al, March 2001: Consensus—or rather its absence—also helps account for the conspicuous failure of the gin acts of 1729 and 1736. These were the most draconian of the acts, and in both instances consumption declined only momentarily, reflecting a brief flurry of activity on the part of the magistrates responsible for enforcing the acts. Within a year or so, consumption rebounded, rising to new heights shortly thereafter. Then, upon repeal, consumption actually dropped. This pattern makes sense, in part, if we again shift the focus of the argument and concede that what was being regulated was not so much a commodity as a moral behavior rooted in the values and daily routines of the larger community.", "So, did beer, as Cassidy said, play any part in ending the gin epidemic?", "The trends in consumption don’t suggest it. While the consumption of spirits increased, beer drinking during the 18th century generally remained static, say Warner and colleagues, at roughly 30 gallons per person per year. That’s about 10.5 ounces of beer a day.", "In other words, there’s no evidence to support Cassidy’s claim that promoting beer to combat gin drinking led to “a milestone in the cessation of alcoholism.” And that certainly wasn’t done by William Wilberforce, who was born in 1759, after the gin epidemic had ended.", "(For comparison, U.S. consumption between 2008 and 2010 was about 8.5 ounces of beer per person per day on average, according to the WHO data. Warner also told us that the strength of beer in the 18th century was roughly comparable to beer today.)", "However, James Nicholls, a historian at the London School of Hygiene and Tropical Medicine, did say by email that Cassidy may be confusing William Wilberforce with William Hogarth.", "“The Senator may be thinking about the regulation of the gin trade around 1751, which was in part motivated by William Hogarth’s famous prints Gin Lane and Beer Street, which certainly did suggest beer was the healthy alternative to gin,” Nicholls said.", "According to the BBC, Hogarth’s prints were part of a campaign to curb gin drinking around this time, a campaign which resulted in the 1751 gin act. “However, the 1751 Gin Act really only amplified a reduction in gin drinking that had started in the mid-1740s – though it was seen at the time as effectively bringing an end to the ‘Gin Craze,'” added Nicholls.", "Wilberforce, on the other hand, “was a founding member of the ‘Proclamation Society‘ in 1787, which campaigned against vice generally, and did call for better regulation of public houses,” or pubs, added Nicholls. “But by then gin was not the political issue it had been 50 years earlier.”", "To top it off, Dan Malleck, a historian at Brock University in Canada, told us by email that another premise of Cassidy’s claim is off. Cassidy said Wilberforce pushed the sale of beer over gin because “the idea is that you’d get so bloated” when drinking beer, compared with drinking gin, thereby tempering alcohol consumption. But “beer wasn’t heavily carbonated in the 18th century,” Malleck said, which means that it likely wouldn’t cause as much bloating as beer does today.", "Editor’s Note: SciCheck is made possible by a grant from the Stanton Foundation.", "FactCheck.org Rating:", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]