["A video currently viral on social media, depicting police lathi-charge on a group of people, is being circulated with the caption – “ప్రత్యక హోదా కోసం ఆరోజు మేము రోడ్ల మీదకి వస్తే నిర్దాక్షిణ్యంగా కొట్టించావు, కేసులు పెట్టావు.. ఈ రోజు ఓటు కోసం మళ్లీ అఖిల పక్షం అని సమావేశం పెడితే మిమ్మల్ని నమ్మే వారు ఎవరూ లేరు ఇక్కడ. #నిన్ను_నమ్మం_బాబు #YsJagan #VoteForFan (Back when youngsters of Vizag protested for special status, Chandrababu Naidu had the police beat them. Today, he claims to be working for the same special status (like a chameleon). The yellow media (media controlled by the Telugu Desam Party) will not show the pain we suffered on that day, which is why we have the responsibility to share this video.)", "From a Facebook page అన్న వస్తున్నాడు (Annavasthunnadu.YSRCP), the video has received over 12,000 views.", "ప్రత్యక హోదా కోసం ఆరోజు మేము రోడ్ల మీదకి వస్తే నిర్దాక్షిణ్యంగా కొట్టించావు, కేసులు పెట్టావు.. ఈ రోజు ఓటు కోసం మళ్లీ అఖిల పక్షం అని సమావేశం పెడితే మిమ్మల్ని నమ్మే వారు ఎవరూ లేరు ఇక్కడ. #నిన్ను_నమ్మం_బాబు #YsJagan #VoteForFan", "Posted by అన్న వస్తున్నాడు on Tuesday, 29 January 2019", "In fact, it is viral on Facebook with the similar narrative that CM Chandrababu Naidu-led TDP government had the police lathi-charge on the youth in Vizag protesting for the special status of Andhra Pradesh. Terming him a “chameleon”, or a hypocrite, the caption says that the same government is now making identical demands. The video makes a call for voting for YSR Congress.", "A few users also reached out to Alt News on WhatsApp, suggesting that the video is viral on the messaging app as well.", "Alt News broke up the video into individual frames using InVid software, and reverse searched the images via Google. We found that a Facebook page Bytes Today had shared the video on June 12, 2018, and described it as – “SSP office Aligarh: Police lathi charge on Hindu Jagran Manch coterie.”", "Lathicharge at SSP office ligarh On Hindu Jagran Manch Mmebers", "SSP office Aligarh: Police lathi charge on Hindu Jagran Manch coterie. Video Cr- जनपत्र – Janpatr", "Posted by Bytes Today on Tuesday, 12 June 2018", "The incident in question had occurred when activists of the Hindu Jagran Manch (HJM) staged a protest outside the SSP’s office. ANI, The Times of India, and The Indian Express were among the many media outlets that reported the incident. The video posted below depicts the same incident shot from a different angle.", "#WATCH: Police baton charge on members of Hindu Jagran Manch who were protesting outside the office of Aligarh Senior Superintent of Police (SSP), demanding the arrest of accused who had attacked one of their members. pic.twitter.com/vJkqoWxUkT", "— ANI UP (@ANINewsUP) June 12, 2018", "Hindutva outfit HJM is affiliated to the Vishva Hindu Parishad (VHP). On June 12, 2018, its workers forcibly locked the gate of the SSP’s office while demanding the arrest of a man booked for attempt to murder. The Indian Express had reported that the man was a cinema hall owner who had open-fired at two members of HJM three months ago. According to The Times of India, SP (crime) Ashutosh Dwivedi assured the protesters that he will personally look into the probe after they claimed that the police was not investigating the case properly. The TOI report further stated that “moderate” force was used to disperse the protestors when they did not heed to police’s requests and “misbehaved” with the general public.", "Alt News had debunked this video last year when it was shared by Rajasthan Congress committee general secretary as the then CM Vasundhara Raje-led BJP government’s action against the state’s youth. Old videos often reappear on social media as a recent incident or are ascribed to an unrelated incident. Self-verification of claims becomes essential in such cases.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]