["A view of a nearly empty Red Square in Moscow on March 23, 2020. It's an unusual sight and is due to restrictions on movement due to the coronavirus. (AP)", "• Russian President Vladimir Putin has implemented some policies to cancel large gatherings and keep people at home during the coronavirus pandemic. But we could not find any evidence that he has threatened jail time for people who don’t comply.", "• The claim about a Putin policy to jail those who don’t stay at home appears to come from a post by the Twitter account of an Indian comedian, who later labeled his assertion a “joke.”", "As many Americans grapple with the new reality of sheltering in place, social media posts have pointed to a purportedly stark choice in Russia.", "A March 23 Instagram post said, \"Putin has stated: Russian citizens (have) 2 options: Stay home for 15 days or in jail for 5 years.\"", "I love that", "A post shared by  Val (@itsvalos) on Mar 22, 2020 at 11:27am PDT", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Is this something Putin said, or did? No.", "The idea appears to stem from a tweet by an Indian comedian whose account goes by the name Nasir Chinioti.", "The tweet says, \"#Covid_19 #StayAtHome Vladimir Putin has given Russians two options. You stay at home for 2 weeks or you go to jail for 5 years. No middle ground.\"", "Two days later, the author of the original post tweeted, \"Just joke,\" with three emojis. (Oddly, many social media posts circulating didn’t include the second part of the tweet, even though it’s even more eye-catching: \"RUSSIA: Vladimir Putin has Dropped 800 tigers and Lions all over the Country to push people to stay home.. Stay Safe Everyone!!\")", "Just joke 😜😎😷", "Looking through credible media reports, we found no evidence that Putin had given Russians the draconian choice between lockdown or jail.", "\"Schools, sports facilities, and other gathering places are closed, and it seems Moscow asked residents over 65 to stay home, from March 26 to April 14, but they offered them the equivalent of $50 in two payments, one at the beginning and one at the end,\" said Yoshiko M. Herrera, a political scientist at the University Wisconsin-Madison who specializes in Russia. \"He also ordered that phone and internet not be shut off and that other housing-related fines not be collected.\"", "Herrera said that these measures, plus earlier measures to close its long border with China, seem appropriate, but she added that \"there are some big caveats.\"", "\"There is a lot of skepticism and criticism of the statistics,\" she said, citing allegations of undercounting and misreporting coronavirus deaths in other categories.", "In recent days, the BBC reported, the infection rate in Russia \"has begun to escalate even according to official figures.\"", "Social media posts have said \"Putin has stated: Russian citizens (have) 2 options: Stay home for 15 days or in jail for 5 years.\"", "Credible news accounts and experts on the region see no evidence of such a draconian choice in Russia. The claim appears to stem from a post by an Indian comedian, who later clarified that this was intended as a \"joke.\"", "We rate the statement False.", "Instagram post, March 23, 2020", "Nasir Chinioti, tweet, March 22, 2020", "Nasir Chinioti, tweet, March 24, 2020", "Globalnews.ca, \"No, Putin is not using lions in Russia’s coronavirus lockdown,\" March 23, 2020", "BBC, \"Coronavirus: No Russia lockdown as Putin puts on show of calm,\" March 22, 2020", "NBC News, \"Coronavirus: Russia's low infection numbers viewed skeptically,\" March 22, 2020", "CNN, \"Why does Russia, population 146 million, have fewer coronavirus cases than Luxembourg?\" March 22, 2020", "Moscow Times, \"Coronavirus in Russia: The Latest News,\" March 24, 2020", "Email interview with Yoshiko M. Herrera, political scientist at the University Wisconsin-Madison, March 24", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]