["Social media was recently brimming with allegations that JNU student leader Shehla Rashid embezzled the money crowdfunded for the family of the Kathua rape victim. The accusations reached to the extent that lawyer Vibhor Anand appealed to those who felt “cheated” by Rashid that he is planning to take legal action against her.", "Several accusations of an identical nature were directed at Rashid even after the organisers of the crowdfunding, Crowdnewsing, tweeted that the money has reached the family. They provided proof of transaction by posting a photograph of the family’s passbook. The entire process was handled electronically with funds being transferred directly from Ketto into the account of the victims’ families.", "Here are 3 screenshots of the #Kathua funds transferred. The passbook, the passbook entry & the proof of electronic transfer from Ketto to the family’s account. Also, since the beginning of the Campaign, we have been regularly updating everything –https://t.co/CkwBrn4toa pic.twitter.com/CNB7WHXtrD", "— Crowdnewsing (@crowdnewsing) November 15, 2018", "Allegations against Rashid were furthered when the student leader decided to deactivate her Twitter account citing “toxicity and hate”. Right-wing social media influencer Sonam Mahajan linked this to Rashid trying to evade questions on the “Rs 40 lakh” raised for the family of the victim, implying that it never reached them. At the time of writing this article, Mahajan’s tweet was retweeted over 7,000 times and liked over 16,000 times.", "Similar allegations were floating on social media since the crowdfunding was initiated in April. That same month, Zee News’ Sudhir Chaudhary on his show ‘Daily News Analysis’ reported on the funds with the hashtag #KathuaBahanaDeshNishana (Kathua an excuse, nation a target). The broadcast was titled – “देखें, गैंगरेप पीड़ित के नाम पर लाखों का चंदा जमा करने का खेल| (Watch, the game of collecting lakhs of funds in the name of a gang-rape victim).”", "देखें, गैंगरेप पीड़ित के नाम पर लाखों का चंदा जमा करने का खेल #KathuaBahanaDeshNishana @sudhirchaudhary pic.twitter.com/bIA6PX7tvQ", "— Zee News Hindi (@ZeeNewsHindi) April 17, 2018", "“In the name of helping the parents of the child, lakhs of money are being collected from across the nation. However, the family is not receiving any help,” declared Chaudhary.", "On April 13, 2018, online crowdfunding platform Crowdnewsing began the collection of funds for the family of the Kathua rape victim with the help of Ketto. The target amount was Rs 10 lakh and Shehla Rashid was one of the initiators of the campaign.", "As the public response was unexpectedly overwhelming, the organisers decided to extend the campaign to the Unnao rape survivor as well. Crowdnewsing published an update on their website on April 14 that the final amount would be equally distributed between the two families.", "“It took some time for acquiring the PAN details of the Unnao rape survivor and getting a joint account made for the family of the Kathua rape victim. But by the end of May, both the families had received their share of Rs 18,46,774,” said Bilal Zaidi, founder of Crowdnewsing, to Alt News. The same was updated on their website on May 25. The month before, Shehla Rashid had uploaded a video, updating donors on the campaign.", "On November 4, Crowdnewsing held a press conference to elaborate on the fund collection and its subsequent transfer step by step. To counter the incessant misinformation on social media, the portal uploaded the statement of the Kathua victim’s family as proof that the money was transferred.", "Alt News was also able to independently confirm the transfer of funds with a J&K Bank official. On the matter of a few social media users raising questions vis-a-vis the photograph of a handwritten passbook uploaded by Crowdnewsing, the official said, “Most of the J&K Bank branches in Kashmir do not issue printed passbooks but the entries are made manually.”", "We also verified the transfer of funds with the family of the Unnao rape survivor. “Yes, the money was transferred to us by Crowdnewsing about 4-5 months ago and we have been able to use it,” said the survivor’s uncle Mahesh Singh.", "Furthermore, we contacted former J&K Chief Minister Omar Abdullah who had donated to the crowdfunding. “Initially, I helped them [organisers of the crowdfund] get in touch with the bank because there were some formalities that needed to be completed for the account to be set up. The account was needed to transfer the money from the portal [ketto] to the family. This was the extent of my involvement in the process.”", "When asked about the allegations that the funds never reached the family, Abdullah said, “I haven’t seen evidence to support these claims. I have heard nothing from the family. I also tried to find out from my colleagues in the area whether there were any complaints that the funds were not made available to the family, but I heard nothing of the sort. At least from what I can gather, the campaign was vilified by politics and a deep-rooted hatred for the political position that Shehla Rashid takes.”", "On November 2, News18 published a report titled – ‘Sold Livestock to Travel for Court Hearing: How Kathua Victim’s Parents Are Struggling to Get Justice’. The article by journalist Aakash Hassan said, “the victim’s father had to sell cattle to pay for expenses of travelling from Kargil, 530 km down to Pathankot, where a trial court is hearing the matter.” This further fueled the ongoing misinformation campaign on social media.", "News18’s story omitted the essential detail that the family had to sell livestock because they were unable to access the bank account and not because the funds were not transferred. Crowdnewsing’s Bilal Zaidi’s clarification was later added to the story – “For most of the year, the families are travelling with their herd in remote forests of Jammu and Kashmir, so we understand that accessing banks would not be very convenient, but locals are helping them with the banking process. Since crowdfunding is a 100% digital and transparent process, it was a bank to bank transaction and offering cash was not an option.”", "Shout out to @CNNnews18 for updating the story with crowdfunding perspective and setting the record straight. At @crowdnewsing we have done over several campaigns and not once have we failed the transparency test. Thank you to everyone for their support!https://t.co/RIMlpIEBN4", "— Crowdnewsing (@crowdnewsing) November 2, 2018", "A Newsclick report published earlier this month – ‘Amid allegations, Kathua family confirms receipt of fund from Crowdnewsing’ – quoted the victim’s father giving reasons for his inability to access the money. “We have received Rs 18 lakh from Crowdnewsing, and we are able to access that money. The only problem is that I have a joint account with my daughter’s foster father. So, we both have to go together to withdraw.”", "Alt News contacted an official from J&K Bank to understand the nature of the family’s joint account. “Yes, there is a joint account in the bank’s Nowabad branch in the names of the maternal uncle and the foster father of the victim,” he informed. “The signatures of both the individuals are needed to withdraw money from this account because of the mode of operation selected at the time of opening the bank account.”", "The account opening form of J&K Bank is available online. Alt News found that it has the option of opening three kinds of joint accounts:", "In the case of the Kathua rape victim’s family, their account’s mode of operation is “jointly” hence, the presence of both account holders is needed to withdraw money, which is why the family was facing troubles accessing the fund.", "The misinformation campaign on social media was based on the aforementioned issue. But the allegations were false on the account that Rs 18+ lakh (not Rs 40 lakh) was transferred to both the families and that the money rightfully reached them. Crowdnewsing was updating donors about the campaign every step of the way, despite which Rashid was targeted with fake news.", "The identical narrative was also echoed by many right-wing pages on Facebook – Bharat Positive, The Frustrated Indian, Bharatiya Yuva Shakti.", "Alt News contacted Shehla Rashid for comments on the issue. “The entire process was handled electronically for utmost transparency. Despite providing proof of transaction multiple times, there were people accusing me of pocketing the fund. Either there is an ignorance about how online transactions work or there was a malicious attempt to bring me down.”", "When told that many on social media were connecting her departure from Twitter to evading questions on the funds, Rashid said, “I was being targeted since April. If I had to leave, I’d have left then. People have been morphing my photos and videos since I initiated the fund collection.”", "On November 12, the story again took a fresh turn after National Herald published a misleading report.", "News organisation National Herald penned a feature based on the account of Pathankot lawyer Mubeen Farooqui who claimed that the victim’s family was unable to withdraw money from the account because it was frozen by the bank.", "According to National Herald, the victim’s father was accompanied by Farooqui who filed a complaint with the National Human Right Commission (NHRC). “The victim’s father, Mohd Yousuf, is not able to understand why his bank account was frozen because the family was able to fight the case legally with the help of the money that was being deposited in this account. His lawyer (Mubeen Farooqui) tells that on July 10, Mohd Yousuf, received a call from the Bhadingi branch of the J&K Bank that since the source of the money coming into this account is not known, therefore the account is being seized,” said the report.", "The news outlet, however, later made changes to its story by removing the words “frozen” and “seized” from the report. The aforementioned excerpt was changed to – “The victim’s father, Mohd Yousuf, is not able to understand why he is not able to draw the money because the family was able to fight the case legally with the help of the money that was being deposited in this account…”", "Alt News contacted the manager of the Nowabad branch of J&K Bank where the family’s joint account is held. The manager rubbished the claims that the account has been frozen. “It is operational and I do not know where the false news is coming from,” he said.", "We also contacted Farooqui to question his reasons for lodging an application with the NHRC. He vaguely answered that the misunderstanding was caused due to “confusion” with the source of some money in the account. “However, I confirmed with bank officials that the account is operational,” he told Alt News.", "Since crowdfunding for the Kathua rape victim’s family was started in April, there have been attempts on social media to brand it a “scam”. Student leader Shehla Rashid was targeted incessantly to malign the public-spirited effort, however, all funds have reached the rightful persons.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]