["About this rating", "On 6 February 2017, the pro-life website Life News published an article headlined “Oregon Bill Would Allow Starving Mentally Ill Patients to Death.” That article, consisting primarily of a press release from the Oregon Right to Life group, reported on Oregon Senate Bill 494, which proposed changes to that state’s advance directive legislation.  (Advanced directives are legal documents used to appoint an official representative to make health decisions in the event someone becomes incapacitated.)", "The Life News article is out of date, as a different version of the same legislation, House Bill 4135, was signed into law on 16 March 2018.  The primary purpose behind both pieces of legislation was the simplification and clarification of the form used to create advance directives. The advance directive debate in 2018 was indeed controversial, and the passage of House Bill 4135 took place along party lines, but those debates were largely about how much power to give the committee charged with creating the new form and not about the cessation of life support.", "Most opponents of HB 4135, such as Republican state Sen. Dennis Linthicum, agreed in general with the direction of the bill but expressed concern that the legislation’s wording gave “the committee too much power and provides the legislature too little oversight.”", "According to the Statesman-General, “Lawmakers on both sides agreed the current form [was] in dire need of improvement,” primarily owing to its overly complicated or vague wording. In a broad sense the bill made two substantive changes to existing advance directive laws, which were first passed in 1993 and had not been modified until 2018, as described by the Corvallis Gazette-Times:", "House Bill 4135 updates the portion of the advance directive form that deals with the appointment of the personal representative — the person who makes health care decisions for another individual when that person becomes incapacitated. The bill also establishes a 13-member Advance Directive Adoption Committee that is charged with reviewing, every four years, the instructions portion of the form to make sure it's current and as understandable as possible. That ease of use is important, because there's some evidence that the forms currently in use can lead to some confusion.", "In Oregon, this area of legislation frequently intersects with concerns raised by pro-life groups that typically focus on the rights of the unborn. That's because advance directives can include directions and preferences on receiving (or declining) life-sustaining treatments under certain circumstances. In their article, Life News attempted to draw a connection between this proposed legislation and Oregon's 1997 Death with Dignity Act, implying the new law represented a step toward forced euthanasia via the cessation of life support or artificial feeding of persons  medically incapable of making medical decisions for themselves:", "When Oregon became the first state in the nation to legalize the practice of assisted suicide, pro-life advocates argued this would be a slippery slope that would lead to euthanasia. Apparently assisted suicide is not enough for the death peddlers in this Pacific Northwest State. Now they are pushing legislation in the Oregon State Legislature that would allow starving mentally ill patients to death.", "This is a bad-faith argument. While certain circumstances exist in which it would be legal in Oregon to cease providing tube-feeding or other life support to mentally incapacitated individuals who left no advance directive and whose next of kin or legal representatives could not be located, such a scenario existed in Oregon state law before House Bill 4135. And the plausibility of that scenario remained largely unchanged following the bill’s passage.", "At issue are sections 127.580 and 127.635 of the Oregon Revised Statutes (ORS) respectively related to “Presumption of consent to artificially administered nutrition and hydration” and “Withdrawal of life-sustaining procedures.” These sections, which were modified only slightly by House Bill 4135, stipulated that “It shall be presumed that every person who is temporarily or permanently incapable has consented to artificially administered nutrition and hydration ... that are necessary to sustain life except” under six explicitly defined scenarios, including:", "(d) The person does not have an appointed health care representative or an advance directive that clearly states that the person did not want artificially administered nutrition and hydration, and the person is permanently unconscious.", "(e) The person does not have an appointed health care representative or an advance directive that clearly states that the person did not want artificially administered nutrition and hydration, the person is incapable, and the person has a terminal condition.", "ORS 127.580 stipulates that if any of these criteria are met, “artificially administered nutrition and hydration may be withheld or withdrawn under the provisions of ORS 127.635.” The provisions of ORS 127.635 state that “life-sustaining procedures that would otherwise be applied to a principal who is incapable and who does not have an appointed health care representative or applicable valid advance directive may be withheld or withdrawn ... if the principal has been medically confirmed to be in one of the following conditions:", "(a) A terminal condition;\n(b) Permanently unconscious;\n(c) A condition in which administration of life-sustaining procedures would not benefit the principal’s medical condition and would cause permanent and severe pain; or\n(d) An advanced stage of a progressive illness that will be fatal, and the principal is consistently and permanently unable to communicate by any means, to swallow food and water safely, to care for the principal’s self and to recognize the principal’s family and other people, and it is very unlikely that the principal’s condition will substantially improve.", "The notion that the bill would “allow for the starving of patients with dementia or mental illness” comes from the subsequent portions of ORS 127.635, which touch on scenarios under which an “incapable” adult meets the above conditions and has no appointed healthcare representative, next of kin, or advance directive under Oregon law:", "Incapable means that in the opinion of the court in a proceeding to appoint or confirm authority of a health care representative, or in the opinion of the principal’s attending physician, a principal lacks the ability to make and communicate health care decisions to health care providers, including communication through persons familiar with the principal’s manner of communicating if those persons are available. “Capable” means not incapable.", "This section states that if a mentally incapable person meets the criteria described in all the excerpts above, but that person does not have an advance directive or appointed health care representative, the de facto representative shall be drawn from a specific list of people ranging from an authorized guardian to “any adult relative or adult friend.” If none of these people can be identified, the law states “then life-sustaining procedures may be withheld or withdrawn upon the direction and under the supervision of the attending physician.”", "As mentioned before, though, the entirety of the Oregon law cited above, which could allow for the termination of life support for incapable individuals who met extremely narrow criteria, existed prior to Senate Bill 494 or House Bill 4135. The legislation signed into law in 2018 did make minor changes to section 127.635 of the Oregon Revised Statutes, but the substance of these laws remains unchanged. Before the passage of House Bill 4135, as well as after, the only situation in which the headline claim that it is legal to “starve mentally ill patients to death” would be true would be a situation in which:", "A person who suffers from mental illness or dementia may be classified as \"incapable,\" but that is not sufficient grounds for terminating life support. This was true before House Bill 4135, and it remains true now after that bill was signed into law: that law made no changes to ORS 127.580. The most notable change made to 127.635 was the addition of a clause after the sentence “life-sustaining procedures may be withheld or withdrawn upon the direction and under the supervision of the attending physician or attending health care provider” (emphasis ours).", "Because both Senate Bill 494 or House Bill 4135 did not substantively alter the legal requirements for terminating life support in incapable adults, however, we rank as false the claim that these bills’ purpose was “designed to allow for the starving of patients with dementia or mental illness.”", "Ertelt, Steven.   “Oregon Bill Would Allow Starving Mentally Ill Patients to Death.”\r\n    LifeNews.com.   6 February 2017.", "79th Oregon Legislative Assembly, 2018 Regular Session.   \"HB 4135 Staff Measure Summary.\"\r\n    12 February 2018.", "Oregon Health Authority.   \"Oregon's Death with Dignity Act.\"\r\n    Accessed 5 March 2018.", "79th Oregon Legislative Assembly, 2018 Regular Session.   \"HB 4135.\"\r\n    Accessed 5 March 2018.", "Radnovich, Connor.   “Bill Updating Oregon Advance Directives Heads to Governor's Desk.”\r\n    Statesman Journal.   27 February 2018.", "Corvallis Gazette-Times.   \"Editorial: Advance Directive Bill Offers a Step Forward.\"\r\n    1 March 2018.", "OregonLaws.org.   \"2017 ORS 127.580.\"\r\n    Accessed 5 March 2018.", "OregonLaws.org.   \"2017 ORS 127.635.\"\r\n    Accessed 5 March 2018.", "79th Oregon Legislative Assembly, 2018 Regular Session.   \"House Bill 4135 (Enrolled).\"\r\n    Accessed 5 March 2018.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]