["About this rating", "In the aftermath of violence at a white supremacist rally in Charlottesville, Virginia in August 2017 (and in the context of a wider debate over the removal of Confederate statues), a particular quote spread on Facebook and Twitter, appearing to indicate Abraham Lincoln's opposition to racial equality.  On 14 August, the remarks formed part of a Dallas Morning News column by former Texas State Senator Jerry Patterson, who wrote:", "During his famous debates with Sen. Stephen Douglas, Lincoln explained to the crowd: \"I am not, nor ever have been, in favor of bringing about in any way the social and political equality of the white and black races ... I am not nor ever have been in favor of making voters or jurors of Negroes, nor of qualifying them to hold office, nor to intermarry with white people; and I will say in addition to this that there is a physical difference between the white and black races which I believe will forever forbid the two races from living together on terms of social and political equality. And inasmuch as they cannot so live, while they do remain together there must be a position of superior and inferior, and I as much as any other man am in favor of having the superior position assigned to the white race.\"", "Lincoln was no different than most white males, North and South, at the time. He was a white supremacist.", "The quote as presented by Patterson, and in several Facebook and Twitter posts, is authentic. Lincoln did make those remarks on 18 September 1858. They came at the beginning of his opening speech at the fourth of seven famous debates with Stephen Douglas, during Lincoln's unsuccessful campaign for the U.S. Senate in Illinois. Lincoln had been under attack from Democrats who accused him of supporting racial equality, and his comments were a defense against those allegations.", "There is no official transcript of those debates, and the accounts published at the time in two Illinois newspapers — the Republican Chicago Press and Tribune and the Democratic Chicago Times — often diverged along partisan lines, according to Rodney Davis and Douglas Wilson's annotated \"Lincoln-Douglas Debates\" (page vii.)", "Nonetheless, here are the most relevant remarks, as reported in the pro-Lincoln Chicago Press and Tribune on 21 September 1858. You can read that day's report in full here.", "Chicago Tribune Archives", "Despite the frequent spinning of the speeches by both newspapers, there appears to be consensus on Lincoln's Charleston remarks regarding racial equality. The Chicago Times report, reprinted in Harold Holzer's 1993 Lincoln-Douglas Debates, does not significantly vary from that published by the Press and Tribune:", "I will say then, that I am not nor ever have been in favor of making voters of the negroes, or jurors, or qualifying them to hold office, of having them to marry with white people. I will say in addition, that there is a physical difference between the white and black races, which I suppose, will forever forbid the two races living together upon terms of social and political equality, and inasmuch, as they cannot so live, that while they do remain together, there must be the position of superior and inferior, that I as much as any other man am in favor of the superior position being assigned to the white man.", "Of course, this excerpt from one speech does not represent the totality of Lincoln's views on race and racial equality, but the remarks were far from a complete outlier, and Lincoln's views were more complex and uncomfortable than the prevalent modern impression of him as the racially-enlightened Great Emancipator.", "We spoke to Columbia University historian Eric Foner, author of several books on Lincoln, including The Fiery Trial: Abraham Lincoln and American Slavery.", "\"There's no question that: one, before the Civil War, Lincoln hated slavery. He always did,\"  Foner told us:", "Two, he shared many of the prejudices of his society. That was a deeply racist society both north and south before the Civil War.", "He did insist that black people were entitled to what they call the natural rights of man — life, liberty and the pursuit of happiness.... And also that black people were entitled to what they used to call the fruits of their own labor.", "During the Civil War, Foner says, Lincoln's views evolved radically as he was exposed to black people such as Frederick Douglass, who were far more talented than he had assumed, and as the efforts of freed slaves in the Union army earned them, in Lincoln's view, the right to citizenship.", "Just before his death, Lincoln gave a speech in which he mentioned the possibility of giving black Union soldiers and wealthy black elites the right to vote, in direct contradiction to his 1858 remarks. And yet, Foner told us, for a long time Lincoln's plan for black people in the United States largely consisted of arranging for them to the leave the country and set up colonies elsewhere.", "Foner also warned against overemphasizing the importance of ethnicity to Lincoln by isolating specific racist remarks he made:", "The fact is, Lincoln said almost nothing about race. He was not that interested in race...Race was not a major intellectual construct for Lincoln...And the 1858 speech was purely defensive. That doesn't excuse it, but he was being attacked in those debates as believing in negro equality.", "\"Whereas abolition was a central aspect of Lincoln’s moral compass\", the Harvard historian Henry Louis Gates wrote in 2009, \"racial equality was not\":", "...Lincoln despised slavery as an institution, an economic institution that discriminated against white men who couldn’t afford to own slaves and, thus, could not profit from the advantage in the marketplace that slaves provided. At the same time, however, he was deeply ambivalent about the status of black people vis-à-vis white people, having fundamental doubts about their innate intelligence and their capacity to fight nobly with guns against white men in the initial years of the Civil War.", "Gates concluded:", "[Lincoln] certainly embraced anti-black attitudes and phobias in his early years and throughout his debates with Douglas in the 1858 Senate race... By the end of the Civil War, Lincoln was on an upward arc, perhaps heading toward becoming the man he has since been mythologized as being: the Great Emancipator, the man who freed — and loved — the slaves. But his journey was certainly not complete on the day that he died. Abraham Lincoln wrestled with race until the end.", "Patterson, Jerry.    \"If We Mean to Remove Memorials of White Supremacists, that Includes Lincoln.\"\r\n     Dallas Morning News.    14 August 2017.", "Davis, Rodney O.; Wilson, Douglas J. [eds].    \"The Lincoln-Douglas Debates.\"\r\n    University of Illinois Press.    2008.", "Chicago Daily Press and Tribune.    \"Mr. Lincoln's Speech.\"\r\n     Chicago Tribune Archive.    21 September 1858.", "Holzer, Harold. [Editor].    \"The Lincoln-Douglas Debates.\"\r\n     Fordham University Press.   2004.", "Gates Jr., Henry Louis.  \"Was Lincoln a Racist?\"\r\n  The Root.  12 February 2009.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]