["The Trump administration has scrambled to control damaging headlines based on Michael Wolff’s Fire and Fury: Inside the Trump White House, which was rushed to shelves Jan. 5 over threats from President Donald Trump’s attorneys.", "For his part, Trump sought to undermine Wolff’s credibility by calling into question the author’s access to the administration’s highest levels.", "\"I authorized Zero access to White House (actually turned him down many times) for author of phony book!\" Trump tweeted Jan. 4. \"I never spoke to him for book.\"", "I authorized Zero access to White House (actually turned him down many times) for author of phony book! I never spoke to him for book. Full of lies, misrepresentations and sources that don’t exist. Look at this guy’s past and watch what happens to him and Sloppy Steve!", "We decided to dissect Trump’s tweet by sifting through what’s known about Wolff’s White House access. We can’t know everything that goes on behind the scenes, but even the public record shows that Trump’s statement is inaccurate.", "Trump’s tweet could give the impression that Wolff was denied access to the White House entirely. But as Trump’s own press secretary has acknowledged, the author had more than a dozen interactions with administration officials at 1600 Pennsylvania Avenue.", "Wolff claims that over an 18-month period, he conducted more than 200 interviews with Trump and senior staff. In the course of reporting his book, Wolff said he was able to take up \"something like a semi-permanent seat on a couch in the West Wing.\"", "Trump never explicitly allowed his visits nor barred him from the White House, Wolff said, which allowed Wolff to exploit this \"non-disapproval\" to gain access through \"various senior staffers.\" Here’s the author’s account of his access, as written in the Hollywood Reporter (the circumstances of which we could not independently verify):", "\"Since the new White House was often uncertain about what the president meant or did not mean in any given utterance, his non-disapproval became a kind of passport for me to hang around — checking in each week at the Hay-Adams hotel, making appointments with various senior staffers who put my name in the ‘system,’ and then wandering across the street to the White House and plunking myself down, day after day, on a West Wing couch.\"", "As excerpts of Wolff’s book began to circulate, journalists were eager to have the White House weigh in on the incendiary headlines.", "During a White House press briefing, press secretary Sarah Huckabee Sanders faced questions about Wolff’s access from one journalist who recalled seeing Wolff in the building multiple times. Here’s their Jan. 3 exchange:", "Margaret Brennan, CBS News: \"Sarah, can you clarify? Because many of us here have seen Michael Wolff at the White House on multiple occasions. We’ve seen him first-hand. So we know he was here. Who gave him access to the White House? What was he here for? Can you explain any of that since we don’t have access to the logs?\"", "Sanders: \"Yeah. So far, from what I can tell of the roughly just over a dozen interactions that he had with officials at the White House, I think close to 95 percent were all done so at the request of (former adviser) Mr. (Steve) Bannon.\"", "Sanders underscored that Wolff had not been given unfettered access to the White House, saying he had been denied more than 30 requests for access, including at least two dozen requests to interview the president.", "However, she did not dispute that Wolff had been \"seen often\" with Bannon in his White House office.", "\"I know there were a number of times where he met with Steve. And I think they have both said and repeated that that happened,\" she said in a Jan. 5 interview on Fox & Friends. \"We looked at the logs. We know that they met on multiple occasions. He was frequently seen meeting with him. So I think that's a pretty indisputable fact on that front.\"", "So, while it may be the case that Trump did not personally grant Wolff access, his own press secretary says the author had access to administration officials at the White House.", "To the casual reader, Trump’s tweet could give the impression that he and Wolff never spoke — but that’s far from the case.", "While it may be the case that Trump never talked to Wolff with the express understanding that their discussion would later be incorporated into a book, the two men certainly spoke, though the length and nature of their conversations is not entirely clear.", "Wolff said he spent about three hours with Trump over the course of the campaign and at the White House.", "\"Whether he realized it was an interview or not, I don’t know, but it certainly was not off the record,\" Wolff said in a Jan. 5 interview on NBC’s Today. \"I spoke to him after the inauguration, yes. And I had spoken to, I mean I spent about three hours with the president over the course of the campaign and in the White House, so my window into Donald Trump is pretty significant.\"", "For her part, Sanders does not dispute that the two men spoke. According to Sanders, their only conversation since Trump became president took the form of a brief phone call, which, at that time, was not related to Wolff’s book.", "\"There was one brief conversation that had nothing to do, originally, with the book,\" Sanders said at a Jan. 3 White House press briefing. \"It was, I think, around five to seven minutes in total since the president has taken office. And that’s the only interaction that he’s had.\"", "Trump said, \"I authorized Zero access to White House (actually turned him down many times) for author of phony book! I never spoke to him for book.\"", "The president may not have personally authorized it, but Wolff had more than a dozen interactions with officials at the White House, according to Trump’s own press secretary. Press corps members also spotted Wolff at the White House on multiple occasions.", "Sanders also said Wolff and Trump spoke by phone for \"five to seven minutes\" after Trump became president, which contradicts Trump’s artful phrasing as to their communication.", "We rate this statement False.", "Fox & Friends interview with Sarah Huckabee Sanders, Jan. 5, 2018", "New York Magazine, \"Donald Trump Didn’t Want to Be President,\" Jan. 3, 2018", "Hollywood Reporter, \" ‘You Can’t Make This S--- Up’: My Year Inside Trump's Insane White House,\" Jan. 4, 2018", "White House press briefing, Jan. 3, 2018", "White House press briefing, Jan. 4, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]