["A video of a man belting a woman in the presence of policemen is viral on social media with the claim that the incident took place inside a police station and the man thrashing the woman is a cop.", "👆🏻👇🏻👉 पुलिस चौकी में महिला को बेल्ट से पिट रहा है पुलिस वाला।जबकि महिला को पुरुष पुलिसवाले हाथ भी नहीं लगा सकते।नियमानुसार।इस वीडियो को इतना फैलाओ की इन कुत्तों के खिलाफ कार्यवाही हो।😡😡😡 Share kare Page Like follow kare", "Posted by SKS स्टोरीज on Friday, 13 September 2019", "“पुलिस चौकी में महिला को बेल्ट से पिट रहा है पुलिस वाला।जबकि महिला को पुरुष पुलिसवाले हाथ भी नहीं लगा सकते।नियमानुसार।इस वीडियो को इतना फैलाओ की इन कुत्तों के खिलाफ कार्यवाही हो। Share kare. (A policeman is whipping a woman with a belt inside a police station. But male policemen cannot even touch women according to law. Circulate this video so much that a case is registered against these dogs. Do share.)” – reads the complete message accompanying the clip.", "The video has been shared by many on Facebook.", "It has also been posted on Twitter.", "👆🏻👇🏻👉 पुलिस चौकी में महिला को बेल्ट से पिट रहा है पुलिस वाला।जबकि महिला को पुरुष पुलिसवाले हाथ भी नहीं लगा सकते।नियमानुसार।इस वीडियो को इतना फैलाओ की इन कुत्तों के खिलाफ कार्यवाही हो।😡😡😡 pic.twitter.com/QiUP6HNF4j", "— raaj goswami (@raaj389) September 18, 2019", "With a keyword search on Google, Alt News found that the viral video represents an incident that took place in October 2018 in Haryana’s Faridabad. Two head constables were suspended and the services of three Special Police Officers were terminated after the clip surfaced online months later in May 2019. According to NDTV, “A spokesman of [the] police department said that the incident happened in October last year and was not reported to police by the woman.”", "Other media outlets – India Today, The Economic Times, Scroll, The Indian Express – also reported the incident.", "The incident took place in a park and not inside a police station, as claimed recently on social media. The Indian Express quoted Sube Singh, PRO of Faridabad Police, as saying, “Adarsh Nagar police received information that a man and a woman were doing something wrong in the park. When police reached the spot, the man fled. The police personnel behaved indecently with the woman and hit her while questioning her.”", "Additional DGP Law and Order (Haryana) Navdeep Virk had put out a series of tweets on May 27, 2019, detailing the police action taken against the accused cops.", "1/3: Haryana Police Department has taken a strong view about the incident of beating of a woman by police personnel that appeared in media today. Faridabad Police has registered an FIR u/s 342/323/509 IPC against those responsible", "— Navdeep Virk IPS (@nsvirk) May 27, 2019", "A video of Faridabad police beating up a woman with a belt is circulating on social media giving the impression that the case is recent. The incident took place in October 2018 in a park that falls under the jurisdiction of the Adarsh Nagar police station. An FIR was filed against the five cops after the video was widespread online in May 2019.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]