["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "In a new television ad supporting U.S. Sen. Mark Kirk, the Independent Voice for Illinois PAC went after his opponent, U.S. Rep. Tammy Duckworth, D-Hoffman Estates. In the 30-second spot, a female narrator attacks Duckworth’s national security track record, slamming her for supporting the Iran nuclear deal.", "The ad portrays the Iran nuclear deal as a bad one and says recently unearthed information makes the deal even worse. The narrator says, \"...Secret documents reveal that Iran could obtain a nuclear weapon far sooner than we were told. And Tammy Duckworth voted ‘yes’ (on the Iran nuclear deal).\"", "The Politico Illinois Playbook said the spot is running in \"Rockford and number of downstate markets, namely Peoria, Champaign and Springfield.\"", "Tammy Duckworth did vote yes for the Iran nuclear deal, officially known as the Joint Comprehensive Plan of Action (JCPOA). That’s an established fact. But did secret documents reveal Iranians could have access to nuclear weapons earlier than the 15-year window outlined in the JCPOA? We took a look into the PAC’s claim to find out.", "Independent Voice for Illinois PAC", "First off, what is the Independent Voice for Illinois (IVFI) PAC?", "It’s what’s known as an independent expenditure PAC or a Super PAC. Independent expenditure PACs can raise and spend unlimited amounts of money in support of or in opposition to political candidates, but are prohibited from coordinating their activities with or donating directly to candidate campaigns. This means that Kirk would not have known about the IVFI ad before it appeared.", "There’s not much information out there on the group. But we did find the PAC’s treasurer Jo Merlau submitted its statement of organization in February 2015, according to the Federal Election Commission.", "The political research website Open Secrets shows IVFI has raised more than $1.6 million in 2016 with hundreds of thousands of dollars in donations coming from people like Chicago businessman Ken Griffin and New York hedge fund manager Paul Singer. Open Secrets also showed IVFI spent money on vendors supporting failed Republican presidential candidates John Kasich, Marco Rubio and Bobby Jindal.", "Notably, IVFI filed three independent expenditures in late July and early August with the FEC for media production. The payments went to the Washington, D.C., media firm Strategic Media Services, Inc., and the documents showed a media placement/media production order opposing Duckworth. Strategic Media Services did not return calls to confirm whether they were responsible for the ad.", "The Iran deal, the IVFI advertisement and the Associated Press", "Next, let’s look at the Iran nuclear deal. In the original document outlining the deal, the JCPOA never says it would allow Iran to build or obtain a nuclear weapon before the 15-year deal expires. In fact, the JCPOA says, \"Iran reaffirms that under no circumstances will Iran ever seek, develop or acquire any nuclear weapons,\" and reiterates that point throughout the deal.", "The IVFI PAC video ad says secret documents that were leaked contain information about the Iran deal. An illustration in the video indicates they are referencing information reported in a July 18 article by the Associated Press. The Associated Press reported an unnamed source leaked unpublished information about an add-on agreement to the JCPOA. The source told the Associated Press members of Congress knew about the add-on agreement, but its contents never were made public.", "However, the Associated Press only references one confidential document in its story. The Associated Press, in fact, says this \"confidential document is the only text linked to last year’s deal between Iran and six foreign powers that hasn’t been made public.\"", "IVFI’s ad incorrectly says there are multiple secret documents. That implied the federal government was hiding more information than was actually reported in the Associated Press story.", "Investigating the specific language of the IVFI ad reveals another discrepancy with the Associated Press story. The IVFI ad says \"Iran could obtain a nuclear weapon far sooner than we were told,\" according to \"secret documents.\"", "However, the Associated Press story never says that. The story says the leaked document revealed that Iran’s nuclear limitations will ease up earlier than what is outlined in the 15-year deal approved in January. It also says the internally negotiated deal would advance \"Tehran's ability to build a bomb even before the end of the pact.\" Even though Iran will have the ability, it would not be allowed to create a fully completed weapon until the deal ends.", "The Associated Press goes further, saying the contents of the secret document give Iran fewer limits on installing more advanced centrifuges to churn uranium for the core of a nuclear weapon. However, the Associated Press explicitly says Iran’s ability to install these newer centrifuges doesn’t mean it would be allowed to build bombs before the 15-year pact ends. From the Associated Press story:", "(The centrifuge machines) will give Iran a huge potential boost in enrichment capacity, including bomb making should it choose to do so. But it can be put to use only after the deal expires.", "The story never reports Iran can obtain a nuclear weapon sooner than outlined in the JCPOA, as claimed in the IVFI advertisement.", "The secret document and the JCPOA", "The Associated Press story reveals the contents of a secret document showing an add-on agreement imposing fewer restrictions to the JCPOA.", "But Daniel Joyner, the director of international programs at the University of Alabama School of Law, says not so fast.", "\"The (Associated Press) story isn’t wrong. It’s just a little misleading,\" he said.", "Joyner points out the contents of the leaked secret document aren’t much different from pages 6 and 7 of the JCPOA, which deals with centrifuge and uranium enrichment regulation.", "\"You’ll see there that the commitments with regard to centrifuges last for 10 years, not for 15. So the confidential document, which discusses years 11-13, does not contradict the terms of the JCPOA.", "So why would anyone interpret this new information as something that conflicts with the JCPOA?", "\"There are people out there who are out to kill (the JCPOA),\" Joyner said. \"The fact that it was from a confidential source throws up some red flags. There’s nothing contradictory in the leaked documents.\"", "Our ruling", "In their anti-Duckworth campaign ad, the Independent Voice for Illinois PAC says \"...Secret documents reveal that Iran could obtain a nuclear weapon far sooner than we were told. And Tammy Duckworth voted ‘yes.’ \"", "Duckworth did vote in favor of the JCPOA, but the Independent Voice for Illinois PAC’s ad is still incorrect on several fronts. The advertisement indicates there are multiple documents. But according to the Associated Press story the ad references, there is only one secret document. The ad also says these \"secret documents\" would allow Iran to obtain a nuclear weapon sooner than we were told. This, too, is incorrect. The document explains the secret agreement would boost uranium enrichment capacity, but never says Iran would be able to obtain a weapon sooner.", "Finally, an expert told PolitiFact Illinois that there is actually no contradiction between the main agreement and the secret document, just a bit more detail.", "Together, these points show a manipulation of the facts. IVFI misinterpreted information from the Associated Press in their advertisement, potentially leading people to believe Iran will have access to a completed and usable weapon before the deal expires.", "For that, we rate this claim Mostly False.", "Federal Election Commission, the Independent Voice for Illinois statement of Organization, Feb. 12, 2015", "The European Union, Joint Comprehensive Plan of Action, July 14, 2015", "U.S. House of Representatives Office of the Clerk, Roll Call vote to approve the Joint Comprehensive Plan of Action, signed at Vienna on July 14, 2015, relating to the nuclear program of Iran, Sept. 11, 2015", "The Associated Press, \"Document shows less limits on Iran nuke work\", July 18, 2016", "Open Secrets, Independent Voice for Illinois PAC, Aug. 9 2016", "Politico Illinois Playbook, \"Kirk ad slams DUCKWORTH on national security,\" Aug. 15, 2016", "YouTube, \"Secret Documents campaign\" video, Aug. 15, 2016", "Emails with Dan Joyner, the director of international programs at the University of Alabama School of Law, Aug.16, 2016", "Federal Election Commission, Independent Voice for Illinois Current Committee Information, August 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]