["For years, Texas House Speaker Joe Straus of San Antonio has been characterized on right-leaning websites like Breitbart and Red State as effectively pro-choice, in favor of abortion rights.", "Of late, SpeakerStraus.com, a site run by the Empower Texans Foundation, a tea party nonprofit, suggests Straus, who faces tea-party challengers in the March 2016 Republican primary, had a perfect pro-abortion voting record in the two legislative sessions before he became speaker in 2009.", "At the top of the SpeakerStraus.com page: A graphic stating Straus received a 100% legislator rating from NARAL Pro-Choice, an abortion rights advocacy group, in 2005. Further down on the page: \"In 2007, Joe Straus received a 100 percent rating by NARAL (the National Abortion and Reproductive Rights Action League).\"", "Image from SpeakerStraus.com (fetched Feb. 12, 2016)", "We wondered if the foundation’s representation of NARAL’s ratings were accurate.", "As it turned out, the posted 2005 rating for Straus was inaccurate and the one for 2007 could arguably use a blinking asterisk.", "NARAL scorecards", "The foundation didn't respond to repeated inquiries. But we found the NARAL Pro-Choice Texas scorecards using the web’s Wayback Machine and confirmed their authenticity with a NARAL representative. In 2005, that year’s scorecard shows, the group gave Straus a 45 percent rating — not \"100\" — for his House votes. Straus leaned \"pro-choice,\" the ‘05 scorecard says, in voting to require agencies getting funds for abstinence-only sex education to report to the state about successes reducing teen pregnancy and sexually transmitted diseases and also voting on the group’s side in four instances during action on abortion restrictions. But Straus otherwise took six \"anti-choice\" votes that session, the scorecard says, fueling his 5-of-11 rating.", "The group’s 2007 scorecard indeed shows a \"100%\" score for Straus based on his \"pro-choice\" vote against setting aside a NARAL-backed amendment to the 2008-09 state budget. But a web search led us to a Dec. 16, 2014, blog post by the anti-abortion Texas Alliance for Life’s Joe Pojman stating Straus’s 2007 rating \"has little validity. NARAL’s scorecard is wrong.\" That is, Pojman wrote, Straus didn’t even vote on the amendment that NARAL’s scorecard cites for Straus’ \"100.\"", "The 2007 vote", "Stop the carousel: Did Straus get his ‘07 \"100\" based on a single, possibly misreported vote?", "According to the ‘07 scorecard, Straus got his \"100\" for being 1-for-1 on the group’s scored votes in which he participated — a result confirmed by email by Zoey Lichtenheld, communications coordinator for NARAL Pro-Choice Texas. Then again, the scorecard shows, Straus didn’t vote on 10 other items potentially affecting each House member’s NARAL rating; he wasn’t on the House State Affairs Committee where the votes occurred.", "Lichtenfeld said NARAL records indicate Straus on March 29, 2007, voted on the group’s side against tabling proposed Amendment 20 to the 2008-09 state budget, the committee substitute for House Bill 1. That amendment, offered by Rep. Elliott Naishtat, D-Austin, sought to strip the state’s Alternatives to Abortion program of its $5 million in funding over two years and put that amount into child abuse prevention grants for community organizations.", "Alternatives to Abortion program", "The Alternatives to Abortion program’s state backing traces to 2005 when a rider to the 2006-07 appropriations act directed $2.5 million a year in Temporary Assistance for Needy Families funding to the Texas Department of Health and Human Services to implement a program \"focused on pregnancy support services that promote childbirth\" among women who don’t want abortions.  The program took the form of a network of clinics run by the nonprofit Texas Pregnancy Care Network that offer counseling along with adoption and parenting resources. In 2011, lawmakers amended a 2003 law and newly required doctors to give patients a directory listing such centers (along with a sonogram and verbal explanation of the sonogram) 24 hours before performing an abortion.", "NARAL has been an outspoken opponent of the Alternatives to Abortion program and of crisis pregnancy centers in general, deeming them \"outposts across the country with the sole purpose of preventing women from accessing abortion (through lies and coercion).\" In a March 2011 report, NARAL Pro-Choice Texas called the Alternatives to Abortion program \"bad health policy, bad fiscal policy,\" and described the program’s primary provider, the Texas Pregnancy Care Network, as \"a wasteful and inefficient public structure\" that \"overestimated its budget needs by half a million dollars in FY 2010.\"", "House Journal: Straus absent from vote", "So, what was Straus’ position? We checked the Texas House Journal for voting details. It says Straus — who otherwise participated in 26 of 35 votes that day — was absent during the vote on Amendment 20, as were 11 of his colleagues.", "House-posted video of the floor action that day shows that after the amendment was offered, another legislator moved to table it. Next, Speaker Tom Craddick announced the unfavorable-to-NARAL result (89 ayes to 48 nays); the journal presents the same tally. From the video, we further determined that a few minutes after the vote, Straus wasn’t at his desk on the floor; members usually vote from their desks.", "The speaker’s press secretary, Jason Embry, said by email he wasn’t sure why Straus missed the decision.", "Our ruling", "The foundation says Straus in 2005 and 2007 received 100 percent NARAL ratings.", "To the contrary, Straus got a 45 percent \"pro-choice\" NARAL rating in 2005. And while he got that \"100\" in 2007, that result was based entirely on the group concluding that Straus sided with it on a budget amendment when, records show, he was absent from the scored vote.", "On balance, we rate this claim Mostly False.", "MOSTLY FALSE – The statement contains an element of truth but ignores critical facts that would give a different impression.", "Click here for more on the six PolitiFact ratings and how we select facts to check.", "Web page, \"The Joe Straus Record: Opposing Conservatives & Obstructing Reforms.\" The Empower Texans Foundation (accessed Jan. 28, 2016)", "Blog post, \"8 False Claims about Joe Straus,\" Joe Pojman, Texas Alliance for Life, Dec. 16, 2014", "House Journal, 2007 Texas Legislature, Regular Session, March 29, 2007", "Bill, Committee Substitute for House Bill 1, Eightieth Legislature, State of Texas, March 2007", "Blog post, \"Will the People of Texas Fold or Fight for Conservatives?\" Erick Erickson, Redstate, Jan. 7, 2011.", "Blog post, \"Straus being 50 percent pro-life not good enough for Texas,\" Dr. Joseph Graham, LifeNews, Dec. 9, 2010.", "Report, \"The Texas \"Alternatives to Abortion\" Program: Bad Health Policy, Bad Fiscal Policy,\" Sara S. Cleveland, Katie Mahoney, and Blake Rocap, NARAL Pro-Choice Texas Foundation, March 2011", "Report, \"Crisis Pregnancy Centers Lie: The insidious threat to reproductive freedom,\" Lisa McIntire, NARAL Pro-Choice America, Jan. 2015", "Video, House Chamber Session - Mar 29th, 2007, Texas House", "Report, Texas House Rules, Texas Legislative Council, 2015", "House seating chart, 80th Legislature, Legislative Reference Library of Texas, accessed Feb. 10, 2016", "Emails, Jason Embry, press secretary, House Speaker Joe Straus, Jan. 28, 2016", "Emails and phone conversation, Zoey Lichtenheld, communications coordinator, NARAL Pro-Choice Texas, Jan. 28, 2016", "Report, \"Writing the State Budget,\" House Research Organization, Texas House of Representatives, Feb. 14, 2007", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]