["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "In one of the more pointed barbs in a Feb. 26, 2008, debate, Sen. Hillary Clinton charged that Sen. Barack Obama has been so busy running for president that he hasn't done much of anything as chairman of the Senate Foreign Relations Subcommittee on European Affairs.", "\"I also have heard Senator Obama refer continually to Afghanistan, and he references being on the Foreign Relations Committee,\" Clinton said. \"He chairs the Subcommittee on Europe. It has jurisdiction over NATO. NATO is critical to our mission in Afghanistan. He's held not one substantive hearing to do oversight, to figure out what we can do to actually have a stronger presence with NATO in Afghanistan.\"", "Obama responded: \"Well, first of all, I became chairman of this committee at the beginning of this campaign, at the beginning of 2007. So it is true that we haven't had oversight hearings on Afghanistan.\"", "Although Obama acknowledges the point, we sought to confirm what the subcommittee has been doing.", "Congressional records show, and spokesmen for several subcommittee members confirm, the subcommittee has not held any policy hearings since Obama was appointed chair in early 2007.\nThe subcommittee's jurisdiction includes \"all matters, policies and problems concerning the continent of Europe, including the European member states of the North Atlantic Treaty Organization.\"", "The chair sets the agenda for a subcommittee and Obama could have asked to hold a hearing on NATO and its role in Afghanistan.", "But Clinton's claim, while technically true, is unfair, said Andrew J. Fischer, a spokesman for Republican Sen. Richard Lugar. Lugar now serves as a minority member of the Foreign Relations Committee, but he was the chair, from 2003 to 2006, when Republicans controlled the Senate. He is the ranking Republican on the committee.", "Fischer, who is a minority staff member of the Foreign Relations Committee, said something as major as NATO's role in Afghanistan would typically be held before the full Foreign Relations Committee, rather than Obama's European subcommittee.", "In fact, the Foreign Relations Committee held a hearing on Afghanistan on Jan. 31, 2008, and NATO was a part of the discussion. Obama attended a Democratic debate in California that day. Clinton is not on the committee.", "The Clinton campaign put out a statement reiterating Clinton's comments to reinforce the theme that Obama is more about talk than action.", "\"Given the opportunity to take the reins of leadership and shape two critical areas of U.S. foreign policy — Afghanistan and our alliances in Europe — Senator Obama has done next to nothing,\" the statement said.", "Obama's campaign did not respond to a request for comment.", "So let's look at Clinton's statement:", "\"He chairs the subcommittee on Europe.\" Yep.", "\"It has jurisdiction over NATO.\" Yep.", "\"NATO is critical to our mission in Afghanistan. He's held not one substantive hearing to do oversight, to figure out what we can do to actually have a stronger presence with NATO in Afghanistan.\" Yep.", "Some may argue that the issue of NATO's role in Afghanistan typically and more appropriately would come before the full Foreign Relations Committee. But Clinton is right when she says Obama's subcommittee has been largely dormant while Obama has campaigned for president. We rate her comment True.", "Congressional Staff Directory,\n\nSubcommittee on European Affairs,\n\nfrom CQ Press, a division of Congressional Quarterly", "Salon.com,\n\n\"Obama's European problem,\"\n\nby Joe Conason, Dec. 29, 2007", "Washingtonnote.com,\n\n\"Obama vs. Clinton on Putting Legislative Machinery to Work,\"\n\nby Steven C. Clemons, Dec. 17, 2007", "Times of London,\n\n'Stay-at-home' Barack Obama comes under fire for a lack of foreign experience,\n\nby Tom Baldwin, Dec. 21, 2007", "Interview with Andrew J. Fischer, spokesman for U.S. Sen. Richard Lugar and a minority staff member with the Foreign Relations Committee, Feb. 27, 2008", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]