["About this rating", "In April 2019, a video supposedly showing a chicken being hypnotized went viral on social media:", "This is a genuine, unaltered video of a chicken reacting to a line being drawn in the sand directly in front of it. However, while this practice is often described as \"hypnosis,\" Dimitrios Beredimas, an agronomist and blogger at Strange Animals, noted that it would be more accurate to say that this chicken is in a state of \"tonic immobility.\"", "This video appears to have originated on the Insane Monkey YouTube page. That version was accompanied by the following description:", "This video shows you how it really works by drawing a single line in front of a chicken or a rooster and they become hypnotized almost instantly and will not move until the line is gone. This really works and i have done it many times and so have all my neighbors and family who have chickens and roosters.", "While many people may be seeing this chicken hypnotism video for the first time, this behavior has been acknowledged since at least 1648, when it was mentioned in \"Ars Magna Lucis et Umbrae\" (\"The Great Art of Light and Shadow\") by Athanasius Kircher, a German Jesuit scholar:", "So what's happening here? The video shows a chicken entering a catatonic-type state after experiencing a \"fear-potentiated response\" to a line drawn in the sand. This animal behavior is called \"'tonic immobility,\" but readers may be more familiar with the colloquial terms \"playing dead\" or \"playing possum.\"  While this is typically a defensive mechanism, Beredimas notes that the chicken isn't particularly good at pretending to be dead:", "This strange animal behaviour is officially called 'tonic immobility', a natural state of semi-paralysis that many animals exhibit when under threat. Commonly known as apparent death, playing dead and playing possum, this state serves as a defensive mechanism as most predators prefer live prey.", "In chickens, this is most probably a vestigial trait as it doesn't seem to have a useful purpose. The chicken doesn't make a good job hiding the fact it's still alive. Its obvious that is breathing and we can see some eye movement and blinking.", "Since this phenomenon may be new to city folk, let's take a look at a few other videos showcasing this technique:", "If you have access to a chicken and want to try this, the Strange Animals blog provided the following instructions:", "The trick is quite simple. All you have to do is hold the chicken's head down against the ground, and draw a straight line using a stick, your finger, a piece of chalk or whatever.", "The line should start at the beak and extend straight outwards, in front of the chicken. If done properly, the chicken — or rooster — will be put into a state of trance and lie still for anywhere from 30 seconds to 30 minutes! To de-hypnotize the chicken, just clap your hands or give it a gentle push. It may take a few tries to awaken the bird.", "This isn't the only way to hypnotize a chicken. Other methods include swirling your finger in a circle around the birds head or tucking its head underneath its wing. The latter method was briefly mentioned in Ernest Hemingway's posthumous 1985 book, \"The Dangerous Summer\":", "You can lay the chicken down with its head still under its wing and it will lie, hypnotized, for an hour or more or until you wake it. It was a parlor trick that had much success in East Africa. Sometimes I would have a dozen chickens lying asleep in a row on the porch of some native hut in a village under Kilimanjaro when we needed something badly and it was necessary to make magic to obtain it.", "While Hemingway may be taking some artistic license with his \"an hour or more\" sentence, and although this trick isn't guaranteed to work on all breeds of chicken, the above-displayed viral video showcases a technique to \"hypnotize\" chickens that has been used for centuries.", "Strange Animals.   \"How to Hypnotize a Chicken.\"\r\n    27 February 2014.", "Kircher, Athanasius.   \"Ars Magna Lucis et Umbrae.\"\r\n    Waesberge, 1671.", "Eveleth, Rose.   \"Can You Hypnotize a Chicken?\"\r\n    Smithsonian Magazine.   3 March 2014.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]