["About this rating", "On 5 December 2018, the notorious junk news web site World News Daily Report (WNDR) published an article about a teacher who was arrested in Olympia, Washington, after she stripped naked and bit two of her students while she was high on crystal meth:", "Olympia, Washington | An elementary school teacher was arrested this morning after a drug “bad trip” caused her to strip naked in class and physically assault her 4th-grade students, severely biting two of them and injuring six others.", "According to the Olympia police department, 37-year old Laura James was “visibly intoxicated and behaving erratically” when she showed up for work this morning.", "This was not a genuine news report.", "World News Daily Report is an entertainment web site with a long history of publishing misinformation. The site's disclaimer notes that its content is fictional in nature: \"World News Daily Report assumes all responsibility for the satirical nature of its articles and for the fictional nature of their content. All characters appearing in the articles in this website – even those based on real people – are entirely fictional and any resemblance between them and any person, living, dead or undead, is purely a miracle.\"", "Much of the content on World News Daily Report is accompanied by out-of-context, unrelated photographs. In this case, the story featured a mugshot of a woman who was arrested in Mundelein, Illinois, on theft and drug possession charges in August 2017.", "Gloore, Lindsay.   \"Police: Mundelein Woman Faces Drug, Theft Charges After Meth Arrest in Crystal Lake.\"\r\n    Northwest Herald.   Aug. 3, 2017", "World News Daily Report.   \"Teacher on Crystal Meth Strips Naked in Class and Bites 2 Students.\"\r\n    5 December 2018.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]