["The post shares a photo of a young girl smiling and putting her thumbs up with text superimposed across the image saying: “My vaccines gave me cancer”.", "The text across the bottom of the image says: “Now I’m being poisoned to death with nitrogen mustard gas”.", "The lengthy caption of the post says in part: “This little girl is merely one of thousands across the United States with cancer from vaccines. Those 'children's hospitals' are NOT hospitals they are extermination compounds. First they give kids cancer in their shots and then they put them down with nitrogen mustard gas otherwise known as chemotherapy.”", "The post has been shared more than 600 times since it was uploaded to Facebook on January 11.", "Below is a screenshot of the misleading post:", "But the person in the photograph is not a young American girl who got cancer from her vaccines.", "A reverse image search on Google led to this report from Canadian broadcaster CTV on August 7, 2018.", "The caption of the original photo reads: “Nevaeh Denine, a 9-year-old girl from St. John’s, N.L., who raised thousands of dollars for other kids with cancer, has died after a battle with neuroblastoma”.", "St. John’s is a city on Canada’s Newfoundland island.", "The premier of Newfoundland and Labrador and mayor of St John’s both tweeted their condolences following Denine’s death, see here and here.", "Our thoughts and prayers are with a sweet little girl who taught us all about courage, caring and love; an inspiration to us all #PrayersForNevaeh Nevaeh Denine, 9, Passes Away https://t.co/rqS6d7cPOE via @vocmnews", "The report coordinates with this Facebook post uploaded on the same day. The post says Denine was “welcomed into heaven in her daddy’s loving arms”, along with the dates of her birth and death.", "The Facebook page, called “Happiness for Nevaeh”, states on its “About” page here that Denine was “diagnosed with neuroblastoma in December 2013, but relapsed February 2016”.", "According to Minnesota-based medical centre Mayo Clinic here, neuroblastoma is a type of cancer caused by immature nerve cells forming a tumor, instead of maturing by birth.", "“Neuroblastoma is a cancer that develops from immature nerve cells found in several areas of the body. Neuroblastoma most commonly arises in and around the adrenal glands, which have similar origins to nerve cells and sit atop the kidneys. However, neuroblastoma can also develop in other areas of the abdomen and in the chest, neck and near the spine, where groups of nerve cells exist. Neuroblastoma most commonly affects children age 5 or younger, though it may rarely occur in older children.”", "The same photograph in a larger size that shows Denine’s dress as well as her face was originally posted to the Facebook page here on March 12, 2017.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]