["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "President Donald Trump gestures during a news conference with Japanese Prime Minister Shinzo Abe at Trump's private Mar-a-Lago club, Wednesday, April 18, 2018, in Palm Beach, Fla. (AP)", "Trump then opened Mar-a-Lago as a private club and — as a business move and without having to go to court — allowed Jews and African Americans, making it different from most private clubs in Palm Beach.", "A years-old pro-Trump Facebook post that’s still viral shows a photo of a young Donald Trump with the headline: \"So You Think You Know The Real Donald Trump?\"", "The post claims that Trump did good deeds for five individuals, and it makes a claim of one larger gesture, saying:", "\"Donald Trump sued the City of Palm Beach when he bought a segregated club, Mar A Lago, to open it to Jews & Blacks.\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Trump did accept African Americans and Jews at Mar-a-Lago at a time when most private clubs in Palm Beach, Fla., were not open to them.", "But it was a business move, not a crusade, and he did not sue in court to do so.", "Here’s what happened, based on reports from the Washington Post, the Wall Street Journal, Vanity Fair and other media.", "Mar-a-Lago (in Spanish, sea-to-lake) was a mansion built by cereal heiress Marjorie Merriweather Post in 1927. Trump bought the 128-room, 20-acre estate and its furnishings in 1985, for $9 million.", "Trump used Mar-a-Lago as a private residence until 1995, when he turned it into a private club, open to anyone who could afford the $100,000 initiation fee.", "That made his club different from other Palm Beach clubs (only one was open to Jews). Trump’s club was the first to accept African Americans and openly gay couples, according to the Washington Post.", "Trump lawyer Paul Rampell eventually persuaded Trump of the business value of wider membership by arguing that Palm Beach had many Jewish residents but they had no real club of their own, Laurence Leamer wrote in his book, \"Mar-a-Lago: Inside the Gates of Power at Donald Trump’s Presidential Palace.\"", "So, what about a lawsuit?", "Before making Mar-a-Lago a private club, Trump originally wanted to subdivide the land and sell mansions on it. After a year of meetings and hearings, the Palm Beach Town Council voted down the project.", "After Trump sued the town for $50 million, the town approved the club (the lawsuit was settled), but with restrictions to limit traffic and noise.", "Trump didn’t invoke African Americans and Jews until he tried to get those restrictions lifted. In December 1996, when the town council refused, he sued, alleging that the town was discriminating against Mar-a-Lago, in part because it was open to Jews and African Americans. The town denied the allegation, saying it was merely deciding a zoning matter.", "In any case, the lawsuit was not about opening the club to Jews and African Americans; it was already open to them.", "A Facebook post claims: \"Donald Trump sued the City of Palm Beach when he bought a segregated club, Mar A Lago, to open it to Jews & Blacks.\"", "Trump used Mar-a-Lago for a private residence for a decade before opening it as a private club. He was a pioneer, of sorts, in Palm Beach by opening it to Jewish people and African Americans. But he did so on his own, for business reasons, and he didn’t have to go to court.", "We rate the statement Mostly False.", "Facebook, post, Jan. 11, 2018", "Interview, Laurence Leamer, author of \"Mar-a-Lago: Inside the Gates of Power at Donald Trump’s Presidential Palace,\" Feb. 8, 2020", "Snopes, \"So You Think You Know the Real Donald Trump?\" July 25, 2016", "Washington Post, \"Palm Beach used to be a nice town for billionaires. Then Trump came along,\" Jan. 8, 2019", "Vanity Fair, \"How Donald Trump Beat Palm Beach Society and Won the Fight for Mar-a-Lago,\" Dec. 27, 2016", "Politico Magazine, \"How Mar-a-Lago Taught Trump to Play Politics,\" Feb. 1, 2019", "Wall Street Journal, \"Trump's Palm Beach Club Roils the Old Social Order,\" April 30, 1997", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]