["About this rating", "In June 2019, a viral video purportedly showing the insanely dangerous mechanics of an amusement park ride called the \"Gyro Drop\" went viral on social media:", "WHO even thinks about creating something like this?!?!!???? pic.twitter.com/oXByLOhW54", "— dweena (@itsnotdweena) June 13, 2019", "This is not a genuine video of an amusement park ride, but rather digitally manipulated footage of the Gyro Drop attraction found at a South Korean amusement park called Lotte World.", "The real Gyro Drop carries 40 people approximately 70 meters (about 230 feet) into the air before dropping them at a reported speed of 100 kph (about 60 mph). However, it does not, as portrayed in the above-displayed video, release people on their own individual rope swings and spin them around.", "Lotte World describes the attraction as offering the \"Thrill of nose-diving, starting from a height where it almost touches the sky! The first playing facility in Korea for high-altitude, free-fall experience.\"", "Here's a video of the real Gyro Drop ride:", "Unclear is who created the viral CGI footage of the Gyro Drop. It's reminiscent of another piece of content supposedly showing an extreme amusement park ride which was created by Till Nowak for the 2012 short film The Centrifuge Brain Project:", "While Nowak has created several digitally altered amusement park rides, we haven been unable to definitively link the Gyro Drop footage to him. We've reached out to Nowak for comment and will update this article when more information becomes available.", "The video possibly was created by Lotte World as a piece of viral marketing, as the amusement park shared this clip to their social media profiles in the early hours of 13 June 2019, along with the caption (loosely translated): \"If the gyro drop doubles ...? Oh my. Everyone can ride this degree or not?\"", "Travel Vui.   \"Get Excited at Lotte World Theme Park.\"\r\n    25 September 2016.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]