["About this rating", "On 18 July 2017, Fox News published a story reporting that former Secretary of State and Democratic presidential candidate Hillary Clinton had \"sided\" with Russia against a U.S. sanctions law known as the Magnitsky Act because her husband, former President Bill Clinton, received $500,000 in speaking fees in 2010 from a Russian investment bank.", "The story, authored by the same Fox reporter who wrote a debunked and retracted May 2017 story claiming the Clintons were behind a murder conspiracy that took the life of DNC staffer Seth Rich, relies only on innuendo and a portion of a 2015 email written by a Clinton campaign aide that was published by document-dumping site WikiLeaks.", "This sole piece of supposed evidence from the 21 May 2015 email was one sentence in an evening run-down of news stories in the works about then-candidate Clinton. Former communications staffer Jesse Lehrich sent the email to Clinton's rapid response team:", "With the help of the research team, we killed a Bloomberg story trying to link HRC's opposition to the Magnitsky bill to a $500,000 speech that [Bill Clinton] gave in Moscow.", "Based on the subject line of the email, \"May 21st Nightly Press Traffic Summary,\" it's clear the email was a routine intra-campaign communication. It describes multiple articles reporters were working on, both positive and negative, including a Politico piece about Clinton's campaign inspiring female donors and fundraisers and an Associated Press story \"alleging that [Bill Clinton] pushed laws granting tax breaks for charitable donations to help with fundraising for his library.\"", "We reached out to Lehrich and asked him to elaborate on the email. He told us digging up the old message was an attempt to shift focus away from the current president's ongoing Russia scandal:", "The administration's line has devolved from \"this Russia thing is a hoax\" to \"sure the President's son and top two advisers met with Kremlin-linked operatives in hopes of getting dirt on Hillary – but one time her husband gave a speech in Moscow.\" \n\nIt's a ridiculous attempt to muddy the waters by an administration embroiled in scandal. The only new detail here seems to be a throwaway reference to a non-story in a nightly summary I compiled two years ago, which is only public because of the Kremlin's hacking operation. If there was evidence of anything inappropriate, it surely would've been widely reported, but there's not – and I'd imagine that's why the piece was spiked.", "We reached out to Bloomberg and were told by a representative that the organization doesn't comment on internal editorial decisions.", "But Kathleen Culver, the James E. Burgess Ethics in Journalism chair at the University of Wisconsin - Madison, told us it's not surprising that a campaign staffer doing strategic communications would claim credit for \"killing\" a negative story because the job involves seeking favorable, or at least balanced, press coverage. Claiming credit for \"killing\" a negative story doesn't mean they actually asserted undue influence over a news organization. Further she told us, Bloomberg's chief currency is its stature and credibility as a major news organization:", "As a journalist you have to be open when someone tells you that what you think is so, is not so. If you’re not open to hearing that and thinking critically about it, you’re not doing the job you’re supposed to do.", "I have not studied this case in depth, but it is very common for strategic communications people to try to get their side of the story straight with journalists and it is journalists' job to be open to what sources have to say while thinking about what the truth is. This is no less common on the left or the right, and it’s not less common in politics than any other kind of commerce.", "Given what I know about Bloomberg, I would be astounded if a campaign was able to shut down a story just because it wasn't favorable to their candidate.", "The Magnitsky Act was passed by Congress and signed into law by President Barack Obama in 2012, but it followed a rocky and ultimately failed attempt by the administration to \"reset\" relations with Russia after a longstanding adversarial relationship. It is named for Sergei Magnitsky, a lawyer and auditor who while working for American investor Bill Browder uncovered $230 million in tax fraud -- and was the arrested when he reported the fraud to Russian authorities. Magnitsky died in prison in 2009 at the age of 37. Browder said he was beaten to death.", "Passage of the law, which spotlights corruption and human rights abuses in Russia, reportedly infuriated Russian President Vladimir Putin and was a catalyst for U.S.-Russia relations progressively souring. Natalia Veselnitskaya, a Kremlin-linked Russian lawyer, has since been crusading to overturn the law. Veselnitskaya has come front and center after the New York Times revealed on 9 July 2017 that President Trump's eldest son met with her and several other operatives in hopes of obtaining deleterious information about Clinton during the presidential race.", "It is against this backdrop in mid-July 2017 that Fox News other outlets published stories attempting to link Bill Clinton's speaking fee with Hillary Clinton's stance on Russia. They resurrect a round of scrutiny Hillary Clinton received after announcing in April 2015 her bid for the presidency -- she was, at the time, considered the front runner.", "At least two major news outlets, the New York Times and the Wall Street Journal, published articles in 2015 that juxtaposed Clinton's role as Secretary of State and her husband's paid speeches during her tenure. Both stopped short of reporting conclusive evidence that the payments influenced Clinton's stance on the Magnitsky Act in her State Department role.", "On 30 December 2015, the Wall Street Journal reported that more than two dozen companies and one foreign government (Abu Dhabi) paid Bill Clinton a combined $8 million in speaking fees while they had matters before the State Department:", "In several instances, State Department actions benefited those that paid Mr. Clinton. The Journal found no evidence that speaking fees were paid to the former president in exchange for any action by Mrs. Clinton, now the front-runner for the Democratic presidential nomination.", "Mrs. Clinton has come under fire from Republicans and some Democrats for potential conflicts of interest between her family’s work at the foundation and her duties as secretary of state between 2009 and February 2013. Her husband’s high-profile activities pose a unique challenge for Mrs. Clinton as she runs for president and he prepares to step up his role in her campaign.", "The article goes on to note Bill Clinton spoke in Moscow and was paid by a bank that had officials implicated in the fraud scheme uncovered by Magnitsky:", "Members of Congress wrote to Mrs. Clinton in 2010 seeking to deny visas to people who had been implicated by Russian accountant Sergei Magnitsky, who was jailed and died in prison after he uncovered evidence of a large tax-refund fraud. William Browder, a foreign investor in Russia who had hired Mr. Magnitsky, alleged that the accountant had turned up evidence that Renaissance officials, among others, participated in the fraud.", "The Russian government was opposed to sanctions. At the time, the Obama administration was attempting to reset relations with Russia. The State Department rebuffed the request from Congress. “We…do not support such a measure at this time,” a department official wrote to one senator.", "A few weeks later, Bill Clinton participated in a question-and-answer session at a Renaissance Capital investors conference. He was paid $500,000. After the appearance, Mr. Clinton received a personal thank-you call from Vladimir Putin, then the Russian prime minister, the government news agency TASS reported.", "Mrs. Clinton’s spokesman said she took aggressive steps on human-rights abuses in Russia and “personally acted to impose a ban on travel to the U.S. by several dozen officials believed to have been involved in Magnitsky’s death.” Sponsors of the congressional legislation said the move, coming in 2011, was a major step, but that it didn’t go far enough.", "In preceding years, the Obama administration, with Clinton as Secretary of State, was actively trying to normalize relations with Russia, hoping Putin's predecessor Dmitry Medvedev would serve as a moderating force. Part of that effort included hesitation by the administration to pass the Magnitsky Act.", "Although in hindsight it's clear the effort was doomed to fail, it seemed to start optimistically (despite prescient warnings from Russian critics of Putin, like chess champion Gary Kasparov). Medvedev and Obama hammered out an arms agreement in 2010. The Russians allowed the Americans to fly through their airspace to reach Afghanistan.", "During this time, the Obama administration was criticized for its inaction on the Magnitsky Act -- a move they feared would scuttle reset efforts. Writing for Foreign Policy in June 2012, Jamison Firestone, a co-founder of the law firm Firestone Duncan that employed Sergei Magnitsky, expressed frustration at the policy:", "This is the real argument in Congress right now: not whether to repeal Jackson-Vanik, but what should replace it. Congress’s answer is the Sergei Magnitsky Rule of Law Accountability Act. It’s a simple law that says if an official uses his position to illegally arrest or harm a journalist or human rights activist, that person and his or her family will lose the privilege of traveling to the United States and keeping assets there. They will also be publicly named and shamed, and therefore they will effectively lose the ability to do business in the West.", "The law would act as a powerful disincentive for officials to persecute people who are fighting for a better Russia, just as Magnitsky was. However, President Barack Obama’s administration has stalled the bill and tried to water it down at every opportunity due to fears that it will upset its efforts to \"reset\" the U.S.-Russian relationship. Clinton’s efforts to portray the repeal of Jackson-Vanik as a simple trade issue — delinking its repeal from the passage of a new bill protecting human rights — is just the latest administration attempt to kill the Magnitsky bill.", "By 2011, any specter of friendship between Russia and the U.S. had faded. Putin won the presidential election -- a result that was greeted by large popular protests accusing him of rigging the result. Putin believed that Clinton, as Secretary of State, had undermined his power when she questioned the veracity of the election outcome, thus placing his leadership in peril. On 20 March 2017, former FBI director James Comey testified that Putin \"hated\" Clinton:", "Putin hated Secretary Clinton so much that the flip side of that coin was that he had a clear preference for the person running against the person he hated so much.", "We haven't found evidence that supports the claim that Clinton's posture on the Magnitsky Act was influenced by her husband's speaking fee. Instead, it appears the position was one adopted by the Obama administration as a whole in a wider foreign policy effort to shift Russia relations to a friendlier footing. A single email message from a campaign staffer claiming to have \"killed\" a story at Bloomberg doesn't prove the claim.", "Zimmerman, Malia. \"Hillary Clinton Sided With Russia on Sanctions As Bill Made $500G on Moscow Speech.\"\r\n  Fox News. 18 July 2017.", "Taylor, Adam. \"The Failure of the U.S.-Russia Reset in 9 Photos.\"\r\n  The Washington Post. 17 March 2014.", "Applebaum, Anne. \"This Law Might Explain Why a Russian Lawyer Wanted to Meet With Trump.\"\r\n  The Washington Post. 11 July 2017.", "Becker, Jo, et al. \"Trump’s Son Met With Russian Lawyer After Being Promised Damaging Information on Clinton.\"\r\n  The New York Times. 9 July 2017.", "Grimaldi, James V., and Ballhaus, Rebecca. \"Speaking Fees Meet Politics for Clintons.\"\r\n  The Wall Street Journal. 30 December 2015.", "Glenza, Jessica. \"Hillary Clinton on Course to Win Presidential Election, Poll Says.\"\r\n  The Guardian. 23 June 2015.", "Firestone, Jamison. \"Abandoning Sergei Magnitsky.\"\r\n  Foreign Policy. 21 June 2012.", "Neuman, Scott. \"U.S.-Russia Nuclear Pact Is a 'Reset' For Old Rivals.'\"\r\n  NPR. 8 April 2010.", "Baker, Peter, and Barry, Ellen. \"Russia and U.S. Report Breakthrough on Arms.\"\r\n  The New York Times. 24 March 2010.", "Lowry, Rich. \"The Reset Failure.\"\r\n  National Review. 10 January 2017.", "Lake, Eli. \"Garry Kasparov: Obama’s Russia Reset a ‘Disaster.’\"\r\n  The Daily Beast. 26 October 2011.", "Crowley, Michael, and Ioffe, Julia.. \"Why Putin Hates Hillary.\"\r\n  Politico. 25 July 2016.", "Becker, Jo, and McIntire, Mike. \"Cash Flowed to Clinton Foundation Amid Russian Uranium Deal.\"\r\n  The New York Times. 23 April 2015.", "Grant, Charles. \"The US-Russia Reset Is Over.\"\r\n  Centre for European Reform. 2 April 2012.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]