["About this rating", "On 12 November 2016, a self-described \"news/satire platform\" called Newslo shared a story claiming that a former Republican Senate candidate from Florida, Carlos Beruff, called on Melania Trump to \"sterilize\" the White House after the departure of the Obama family:", "This week, Beruff was at it again, this time calling for the new First Lady, Melania Trump, to “sterilize the White House” after the “animals’ departure.” In an interview with KYOT Radio stationed in Orlando, the GOPer argued that President-elect Trump and the new First Lady Melania Trump will have “some serious thinking to do” before they move into the White House in January, as well as that they’d be “wise to sterilize the place” now that the previous president “is getting evicted.”", "The story is a riff off legitimate news. In early May 2016, when Beruff, a Florida developer, was running a campaign attempting to replace Marco Rubio as U.S. Senator, he was caught on camera calling the president an animal:", "Unfortunately, for seven and a half years this animal we call president, because he's an animal, OK ... has surgically and with thought and very smart, intelligent manner, destroyed this country and dismantled the military.", "Beruff's comments were condemned as racist by both Republicans and Democrats.", "However, that is all the truth that story contains; we found no evidence he doubled down on them by suggesting incoming First Lady Melania Trump \"sterilize\" the White House due to the presence of the Obama family. The claim that Beruff doubled down on the comment while a guest on radio station KYOT is also not based in reality, as that station is actually in Phoenix, Arizona (the general rule of thumb, with a few exceptions, is that all stations west of the Mississippi River have call letters that begin with \"K,\" rather than \"W\")  and dedicated to playing easy-listening music, not news.", "Newslo's sites include a \"show facts\" or \"hide facts\" button. However, all items are displayed in \"hide facts\" mode by default, ensuring new visitors rarely use or are even aware of the option:", "Newslo, Politicalo and Religionlo articles typically follow the same template, featuring a paragraph consisting of accurate information along with outrageous embellishments. Previous Newslo fabrications included claims that an Alabama politician proposed saliva-based \"hunger tests\" for food stamp recipients, Pat Robertson claimed David Bowie was still alive after his death, and the father of Brock Turner lamented the lack of punishment for the victim in his son's case.", "Stevan, Alex. \"GOP Candidate Calls Melania Trump To 'Sterilize The White House After The Animals’ Departure.'\"\r\n  Newslo. 12 November 2016.", "Fineout, Gary. \"Florida man running for US Senate calls Obama 'animal.'\"\r\n  Associated Press. 16 May 2016.", "Wallace, Jeremy. \"How U.S. Senate Candidate Carlos Beruff Avoided $235,000 in Taxes Last Year.\"\r\n  Tampa Bay Times. 29 July 2016.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]