["About this rating", "Until 2011, Michael Yeadon worked in a drug discovery research unit within Pfizer and was a vice president and chief scientist of that specific division, which focused on allergy and respiratory medical research. His views on COVID-19, lockdowns, and vaccination have elevated his position on some corners of the internet, despite a scientific rationale for those claims that has since been proven to be unambiguously incorrect.", "Yeadon's title was not \"chief scientist of Pfizer,\" \"chief scientific officer of Pfizer,\" or \"vice president of Pfizer.\" The division he ran had nothing to do with vaccines or infectious disease and at the time of its closure in 2011, was focused on developing compounds that targeted asthma and chronic obstructive pulmonary disease.", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "Anti-vaccine and medical conspiracy theory websites often cite a former Pfizer employee named Michael Yeadon as their source. Yeadon, who left Pfizer in 2011, has made several controversial claims since the start of the COVID-19 pandemic. As vaccination efforts ramp up across the world, a statement he made in October 2020 is being reshared in meme form to sow doubt about the necessity of vaccination:", "Narrowly speaking, this fact check concerns the accuracy of the title media reports and memes have ascribed to Yeadon, which generally identify him as some variation as the former \"chief science officer,\" \"chief scientist,\" or \"vice president\" of Pfizer.  While Yeadon himself has not presented his credentials in that manner, reports ascribing such titles to him add gravitas to his inaccurate claims about COVID-19.", "More broadly speaking, however, the reemergence of his five-month-old quote offers a great opportunity to see how Yeadon's oft-cited pronouncements about the COVID-19 pandemic have held up. As it turns out, they have been, to put it mildly, alarmingly incorrect. The quote on vaccines stems from a broader argument he made that claimed, due to purported preexisting immunity to COVID-19, that the pandemic ended in October and that there would be no second wave globally or in his home county of the U.K.", "In other words, regardless of who he is or where he once worked, Yeadon's argument that there is \"no need for vaccines\" relies on a series of assumptions that predicted the worst of the pandemic was behind us in October 2020. As that claim is self-evidently ridiculous, his conclusion on vaccines is entirely without merit.", "\"Viruses do not do waves,\" Yeadon wrote about two months before the second COVID-19 wave dwarfed anything the U.K had seen previously during the pandemic.", "In reality, a scientist named Mikael Dolsten has served as the Chief Scientific Officer for Pfizer since May 2010, when he replaced a man named Martin Mackay. In Dolsten's capacity as Chief Scientific Officer, he is President of Pfizer's Worldwide Research, Development and Medical (WRDM) organization.", "Pfizer's WRDM has historically contained several different \"therapeutic area\" research units. Until 2011, one of those was the Allergy and Respiratory Unit. It was this specific division within Pfizer's WRDM that Yeadon served as vice president and chief scientific officer. Dolsten significantly downsized the number of WRDM therapeutic areas at Pfizer, and the company closed the U.K.-based Allergy and Respiratory unit in 2011.", "At the time of its closure, Yeadon's unit was focused on \"developing compounds that target two of these diseases that affect the lower airways -- asthma and chronic obstructive pulmonary disease (COPD) and also diseases of the pulmonary vasculature,\" according to a 2010 Pfizer report.", "The Yeadon quote, commonly presented in an anti-vaccine context, was taken from an Oct. 16, 2020 post Yeadon wrote on a U.K.-based blog named Lockdown Sceptics. In that piece, he argued that the U.K's Scientific Advisory Group for Emergencies (SAGE) — a medical body that makes recommendations about lockdowns and other COVID-19 health measures — relied on faulty numbers to calculate the level of risk posed by COVID-19.", "He argued the group's models were \"fatally flawed\" because they did not account for people previously exposed to other milder coronaviruses that imparted some level of protective immunity, and because they relied on blood antibody tests that did not detect the specific antibodies imparted by these milder coronaviruses, broadly termed common cold coronaviruses (CCCs).", "Yeadon's arguments referenced research or reporting that came out in August and September 2020. At the time, studies showed that blood taken from dialysis patients before the pandemic demonstrated that a large portion of the population's immune systems already possessed some ability to at least recognize and fight SARS-CoV-2, which is the virus that caused COVID-19.", "\"It is hypothesized, but not yet proven,\" the August 2020 study's authors wrote, \"that this might be due to immunity to CCCs.\" Such findings, a September 2020 BMJ editorial posited, \"may force pandemic planners to revisit some of their foundational assumptions about how to measure population susceptibility.\" Due to this purported pre-existing immunity, Yeadon argued that in October 2020 about 30% of the globe had some level of immunity to COVID-19 as opposed to the 7% estimated by SAGE.\"", "Based on this belief, Yeadon wrote that \"there is absolutely no need for vaccines to extinguish the pandemic.\" He argued that \"at a national level, the greatly reduced proportion of the population that remains susceptible now means we will not see another large, national scale outbreak of COVID-19.\"", "To take Yeadon's October 2020 statement about vaccines seriously, therefore, one also has to defend the claim that a second coronavirus wave never hit the U.K. Such a claim is comically indefensible. The chart below shows new COVID-19 cases in the U.K. by day. The highlighted data point, Oct. 16, 2020, is the day Yeadon published his article. That large spike beginning in December is the second wave that Yeadon said would never come:", "Yeadon structured his article by highlighting what he believed to be flawed assumptions made by SAGE. It is perhaps ironic, then, that a flawed assumption is what led Yeadon awry. Yeadon's assumption — one that the very papers he referenced cautioned against making —  was that the antibodies potentially derived from previous CCCs can effectively or meaningfully prevent infection from SARS-CoV-2. By December 2020, it became clear that this was not the case.", "In a November 2020 commentary piece concerning preexisting immunity to COVID-19 published in the medical journal JAMA, public health officials and immunologists concluded that \"achieving herd immunity through natural infections will take years of painful sacrifice that are tallied in numerous deaths, severe long-term health sequelae, and widespread economic disruption and hardship.\"", "The only hope to avoid such an outcome, the authors concluded, was vaccination. \"Let us hope that safe and effective vaccines help avoid the consequences of naturally developing herd immunity to COVID-19,\" the authors of the piece wrote in November 2020. At the time of this reporting, those vaccines appear to be doing just that.", "Broadly speaking, the argument Yeadon made to caution against vaccines is based on conclusions which the passage of time has already exposed as woefully misguided. Narrowly speaking, however, the claim that a former \"Chief Scientist\" or \"Vice President\" of Pfizer made these vaccine skeptical comments is \"Mostly False\" because Yeadon, while being employed by Pfizer, never held such a senior position at the company.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]