["About this rating", "Under his plan to end the “gun violence epidemic,” Biden outlines several policies on his website to reduce the accessibility of firearms, implement universal background checks on purchasers, and institute buy-back programs for assault weapons and high-capacity magazines. The plan also notes that new measures will “respect the Second Amendment, which is limited.”", "Biden has never called for abolishing the Second Amendment. Moreover, under the U.S. Constitution, abolishing an amendment requires two-thirds approval in Congress and ratification by three-quarters of states. Though Biden’s proposed administration could push for an overhaul of the Second Amendment, that power is not vested in the president alone.", "Voting in the 2020 U.S. Election may be over, but the misinformation keeps on ticking. Never stop fact-checking. Follow our post-election coverage here.", "In September 2020, several iterations of the same meme circulated on social media claiming that U.S. President Donald Trump repeatedly stated that Democratic presidential candidate Joe Biden “wants to abolish the Second Amendment.”", "We rate this claim as \"Mostly False.\"", "Our search did not reveal a specific point in time when Biden said that he wanted to abolish the Second Amendment. In fact, we found several incidents where Biden denied wanting to abolish the amendment in its entirety. As part of his 2020 campaign, the presidential hopeful did outline a plan to end the “gun violence epidemic,” which included several policies aimed at reducing the accessibility of firearms such as implementing universal background checks on those who intend to purchase a gun, as well as instituting buy-back programs for assault weapons and high-capacity magazines, among other measures.", "“It’s within our grasp to end our gun violence epidemic and respect the Second Amendment, which is limited. As president, Biden will pursue constitutional, common-sense gun safety policies,” noted the plan, which can be viewed in its entirety here.", "The Second Amendment is one of 10 within the U.S. Constitution that comprises the Bill of Rights. It reads that “a well-regulated Militia, being necessary to the security of a free State, the right of the people to keep and bear Arms, shall not be infringed.” Interpretation of its scope has come under fire in the last century, with gun advocates arguing for what is known as “individual right theory,” which means that the language in the Second Amendment restricts legislative bodies from prohibiting firearm possession and renders any regulation or prohibition unconstitutional, according to the Legal Information Institute at Cornell Law School. Those in favor of stricter gun legislation, on the other hand, abide under the “collective rights theory,” which argues that the Second Amendment does not grant an individual the right to possess guns and that legislative bodies have the authority to regulate firearms without infringing on a constitutional right.", "On numerous occasions throughout his presidency, Trump and his administration — as well as the National Rifle Association (NRA) — played into such heated debates by claiming that, if elected, Biden intended to “abolish the Second Amendment” and the “American way of life.”", "On July 30, a video titled “Joe Biden will abolish the Second Amendment” was shared on YouTube by Trump’s verified account. The video, which was not accompanied by a description, appeared to feature Trump on a recorded phone line stating the following:", "He also wants to take away your guns. He’s going to — they are going to terminate, in my opinion, or essentially do the same thing your second amendment. We’ve had a tremendous surge in gun buying under this administration and when people look at a Portland and when they look at a Seattle, I don’t blame them at all.", "We have — we just got, by the way — if we had it last time and we just got it this time — a \"triple a\" endorsement from the NRA, National Rifle Association. They gave us their highest, absolute highest, endorsement and if I weren’t president, I don’t think you’d even have a Second Amendment right now. I’ve saved it, and it was not easy and you know that. It was not easy.", "Posters of the meme in-question went on to argue that Trump’s accusation was meant to distract the general public and spread disinformation about both Biden’s platform and his would-be executive powers if elected.", "Under the U.S. Constitution, abolishing an amendment requires two-thirds approval in Congress and ratification by three-quarters of states. Though it is true that a Biden administration could push for an overhaul of the Second Amendment, that power is not vested in the president alone and would need to be confirmed by both the House and Senate, as well as state legislatures, according to the National Constitution Center in Philadelphia.", "Reuters Staff.   \"Fact Check: False Quotes Attributed to Nancy Pelosi, Joe Biden and Alexandria Ocasio-Cortez.\"\r\n    Reuters.   9 June 2020.", "BBC.   \"Trump Says Biden is ‘Against God and He’s Against Guns.’\"\r\n    6 August 2020.", "Blitzer, Ronn.   \"Trump Claims Biden Wants to ‘Abolish the American Way of Life.’\"\r\n    Fox News.   15 July 2020.", "Coleman, Justine.   \"NRA: Biden Will Destroy Second Amendment if Elected.\"\r\n    The Hill.   30 August 2020.", "Bomboy, Scott.   \"What Does it Take to Repeal a Constitutional Amendment.\"\r\n    Constitutional Daily.   28 March 2018.", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]