["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Vice President-elect Kamala Harris speaks on Nov. 7, 2020, in Wilmington, Del. (AP)", "The Siri responses were part of a bug involving election data from Wolfram Alpha, a website that feeds into the assistant’s responses.", "There is no evidence that Democrats are working to invoke the 25th Amendment.", "After four days of counting ballots, the 2020 presidential race was called for Joe Biden on Nov. 7. But some Facebook users say his election was a Democratic plot to put his running mate, Sen. Kamala Harris, in the White House.", "Their evidence? Something Siri told some iPhone users over the weekend.", "\"God gave us a gift today--CONFIRMATION of the Democrats' sinister plan to REMOVE Sleepy Joe immediately using the 25th Amendment and instate Kamala Harris as President!\" wrote actor Darin Southam in a Nov. 9 Facebook post.", "The post includes several clips that show people asking Siri, a virtual, voice-activated assistant included in Apple’s operating systems, how old the president is. In response, Siri responds: \"Kamala Harris was born 56 years ago on Tuesday, Oct. 20, 1964.\"", "Southam’s post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.) Similar claims have been shared in hundreds of other posts, according to CrowdTangle, a social media insights tool. So we wanted to investigate.", "(Screenshot from Facebook)", "The 25th Amendment to the U.S. Constitution provides for the vice president to become president if the president is unable to do his or her job. But there is no evidence that Democrats are working to invoke the 25th Amendment against Biden — and if there were, it doesn’t stand to reason that Siri would reveal their plot.", "The Siri responses were the result of a bug involving election data supplied by Wolfram Alpha, one of the websites that provide information to form Siri’s responses.", "In one of the videos included in the Facebook post, Siri answered an iPhone user’s question with information from Wolfram Alpha, which describes itself as a \"computational intelligence engine.\" Another version of the post shows that, at some point, Wolfram Alpha appeared to label Harris as president.", "In a Nov. 9 tweet, the company acknowledged a problem with some of its data about the election, but said it had been fixed.", "\"The brief issue affecting data on Wolfram|Alpha about the US presidential election has now been corrected,\" the tweet says. \"A bug in a new update process for handling uncertain/projected results caused garbled data to go live.\"", "Danielle Rommel Mayer, director of outreach and communications, explained it this way: \"A small mistake made by a data curator, and quickly aborted, led to a chain of issues within our new update system that caused an inconsistency to be introduced, and not detected by our automated testing. The ultimate result of this was that certain natural language queries produced garbled results that incorrectly accessed mismatched parts of (the) internal knowledgebase, without correct tagging.\"", "In layman's terms: A mistake made by a data curator at Wolfram Alpha gave some iPhone users incorrect results when asking Siri about the age of the president. Rommel Mayer said the bug was fixed by 2:22 a.m. CST on Nov. 9.", "The bug is not evidence that Democrats are trying to remove Biden, who will be the oldest president ever to take office.", "RELATED: Trump supporters falsely tie Nancy Pelosi to broader election misfire scheme", "The 25th Amendment has been the subject of conjecture and misinformation since House Democrats introduced a bill in October that would create a new body to take over the role of the Cabinet accordingly. The bill came days after President Donald Trump was diagnosed with COVID-19.", "Trump tweeted Oct. 9 that Speaker Nancy Pelosi was \"looking at the 25th Amendment in order to replace Joe Biden with Kamala Harris.\" There is no evidence that’s the case.", "On Nov. 9, we tried asking Siri how old the president is. The assistant responded: \"Donald Trump is 74 years old.\"", "The Facebook post is not accurate and makes a claim based on a ridiculous premise that Siri would reveal a \"sinister plan\" by Democrats. Siri’s answer was the result of a mundane error. We rate this post Pants on Fire.", "Associated Press, \"Biden defeats Trump for White House, says ‘time to heal,’\" Nov. 8, 2020", "Congress.gov, H.R.8548 - Commission on Presidential Capacity to Discharge the Powers and Duties of the Office Act", "CrowdTangle, accessed Nov. 9, 2020", "Email from Danielle Rommel Mayer, director of outreach and communications for Wolfram Alpha, Nov. 9, 2020", "Facebook post, Nov. 9, 2020", "GovInfo.gov, TWENTY-FIFTH AMENDMENT", "The New York Times, \"Trump Tests Positive for the Coronavirus,\" Oct. 2, 2020", "PolitiFact, \"House Democrats’ new bill on the 25th Amendment, explained,\" Oct. 9, 2020", "Siri, accessed Nov. 9, 2020", "Tweet from Donald Trump, Oct. 9, 2020", "Tweet from Trish Regan, Nov. 8, 2020", "Tweet from Wolfram Alpha, Nov. 9, 2020", "USA Today, \"Joe Biden will become the oldest president in American history, a title previously held by Ronald Reagan,\" Nov. 5, 2020", "Wolfram Alpha, accessed Nov. 9, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]