["The claim was made in a graphic image published on Facebook here on February 18, 2021.", "The graphic’s Sinhala-language text translates to English as: “From today onwards, cash can be withdrawn using any bank card off ATMs without any withdrawal fee”.", "The Facebook post’s caption translates as: “A must be done request / Here is the good news that was implemented”.", "A similar claim was made on Facebook here, here and here.", "The claim is false, according to private banks and Sri Lanka’s national payment infrastructure.", "A spokesperson for LankaClear, a national payment infrastructure organisation that is owned by the Central Bank of Sri Lanka, told AFP by phone on February 23, 2021: “No decision has been made to revise or wave off the withdrawal fee charged for CAS\".", "CAS is an acronym for the Common ATM Switch, a LankaClear system that allows consumers to withdraw money from any ATM in the country regardless of their personal bank. The CAS network connects 99.95% of ATMs in Sri Lanka, LankaClear notes here.", "CAS fees for withdrawing cash or checking account balances were listed by LankaClear here.", "Customer support centres from multiple banks — including People’s Bank, Nations Trust Bank and Bank of Ceylon — also told AFP no decision has been made to waive ATM fees as of February 26, 2021.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]