["This report on a website called “Pilipinas Online Update” says that photos have been circulating online showing protesters demanding payment.", "It was published in 2016, the URL shows, and has been shared more than 7,400 times by different Facebook accounts since, according to data from social media monitoring app Crowdtangle.", "Its headline, translated to English, says: \"Rallyist Asking for Payment! ‘Payment should be given now\".", "Below is a screenshot of the online report, written in a mixture of English and Tagalog:", "In the image contained in the report, the yellow text on the blue banner translates as: \"Pay the rallyists now!!! Kabataan partylist”, while the red text on the white banner translates as: \"Payment to rallyists should be given now! KMU Bayan Muna ACT Gabriela”.", "Kabataan partylist is a sectoral political party representing Philippine youth. KMU refers to Kilusang Mayo Uno, a labor center advocating for trade unionism. Bayan Muna and Gabriela are sectoral political parties, while ACT refers to the Alliance of Concerned Teachers, a teachers’ activist group.", "Facebook posts that link to the misleading report include this one dated November 26, 2016, shared more than 5,800 times, and this one published the same month.", "The same image of the protesters supposedly demanding payment was also featured in this Youtube video published February 18, 2017, which has been viewed nearly 100,000 times.", "The image has been doctored; a reverse image search on Google led to this Facebook post published by Philippine news site GMA News on July 13, 2014.", "Below is a comparison of the image in the misleading 2016 article (top) and the 2014 photo posted by GMA News (bottom):", "In the photo from the GMA News Facebook post, the yellow text on the blue banner translates as: “Aquino, you should be ousted now!” and the red text on the white banner translates as: “You should be put in prison!”", "Aquino refers to Benigno Aquino III, also known as “Noynoy”, who was president of the Philippines between 2010 and 2016.", "The GMA Facebook post’s caption says: “At least two militant groups are expected to file impeachment complaints against President Noynoy Aquino this coming week”.", "It links to this GMA News article published July 13, 2014, about protests against an economic stimulus initiative whose key parts were later declared unconstitutional by the Supreme Court, as reported at the time here by local news site SunStar.", "Protests were also held in November 2016 – around the time the misleading online article emerged – following the burial of the late Philippine dictator Ferdinand Marcos in the national cemetery of heroes. Here is AFP’s report on those demonstrations.", "The misleading report says those who were demanding for payment came from the “Anti-Marcos Rally”.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]