["About this rating", "On 29 February 2016, an image purportedly showing a newly hatched baby dragon was shared on Facebook:\n    News Flash.....  Dragons to be reintroduced to Wales after an absence of more than a 1000 years , local conservation groups say they are pleased by the move that will put a large preditor back in the food chain ....  There have been concern shown by the farming community due to the risk of predation to livestock but the Welsh assembly say they are willing to pay compesation to farmers who can prove loss, the other danger with the dragons eating habits of taking virgins is not thought to be a problem as they went extinct in Wales may years ago anyway......", "The above-displayed photo does not, of course, show a real baby dragon. This image was created for a 2008 Photoshop contest on the web site Worth 1000. Worth1000.com, which has since moved to DesignCrowd.com, asked digital artists to create their own version of the mythical creature:\nDragons. Small and cuddly or big and nasty, Chinese or European, furry or scaly, slick or rough, feathered wings or bat wings, fire breathing or smoke snorting, reptile head or lion head, intelligent or instinctual, ancient or modern, living or robotic. Never has there been a fantasy creature so revered and yet so reviled.", "The rules are thus: create a dragon of your own making. No illustrations, no modifying some else's dragon. You may not use sources from fantasy art. You may use photos of dinosaur models, but (as always) the standard copyright rules apply.", "In addition to the image's source (a site dedicated to digital art contests) and the fact that dragons don't exist, the creator of the digital baby dragon provided the source images used:", "This is not the first time that rumors that dragons actually are real (complete with \"photo proof\") have swirled around the internet. In March 2015, images of a dragon sculpture were shared as authentic, and in June 2015, a digital artist added wings to a picture of a Satanic Leaf-Tailed Gecko and then passed it off as a photo of a real dragon.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]