["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Republican state Sen. Tom Kean Jr. provided a stark but erroneous statistic comparing New Jersey’s investment in higher education to the rest of the nation.\n\nWhile touring William Paterson University to rally support for a bond referendum on the Nov. 6 ballot, Kean said in the last decade New Jersey was the only state in the country that took money away from higher education. If voters approve the referendum, New Jersey may borrow $750 million to fund construction projects at all of the state’s colleges and universities.\n\n\"New Jersey is the only state in the union that spent less on higher education than it did at the beginning of the decade,\" Kean, the Senate minority leader, said to reporters on Oct. 17.  \"That's unfathomable that over the course of the last decade the state aid to higher education went down.\"\n\nHere, we’ll address Kean’s point that only New Jersey decreased aid over the last decade.\n\nOn that point, Kean is wrong.\n\nThe legislator’s spokesman, Adam Bauer, said Kean meant to refer to state appropriations for higher education in the two-year window between fiscal years 2006 and 2008. \n\nOver those years, New Jersey was the only state to decrease its aid for higher education, according to a Rutgers University analysis of data from the Grapevine report produced by Center for the Study of Education Policy at Illinois State University.\n\nNew Jersey’s state tax funds for operating expenses of higher education fell by 0.3 percent in that time frame.\n\nAs of fiscal year 2010, the Grapevine report has been produced in cooperation with the State Higher Education Executive Officers.\n\nAccording to the State Higher Education Executive Officers data on state and local support available for public higher education operating expenses, New Jersey’s appropriations have increased during the last decade.\n\nBy that measure, New Jersey’s appropriations increased by 37 percent from 2000 to 2010.  Other measures of state support for higher education also show increases of more than 30 percent over the last decade.\n\nBut what about inflation? Depending on what index you use to adjust for inflation -- the State Higher Education Executive Officers uses an index specifically intended to take into account the increases in costs for colleges and universities -- the amount of the percentage increase in educational appropriations varies, but it is still an increase.\n\nThe amount of per-student spending is another worthwhile way to compare higher education spending between states, according to experts.\n\nThe State Higher Education Executive Officers calculates the educational appropriations for each equivalent of a full-time student in constant dollars. \n\nNew Jersey spent $11,194 by that measure in 2000. By 2010, that amount had dropped to $7,300. \n\nBut even by that measure, New Jersey’s far from alone. More than 40 states decreased educational appropriations per student over the decade.\n\nOur ruling\n\n\"New Jersey is the only state in the union that spent less on higher education than it did at the beginning of the decade,\" said Kean.\n\nThat’s not true. \n\nKean’s spokesman said he intended to refer to the two-year period between fiscal years 2006 and 2008, but over the last decade, the raw numbers show appropriations for higher education in New Jersey have increased. \n\nSpending levels per student have decreased over the last decade. But data shows New Jersey is one of dozens of states to cut funding by that measure.\n\nWe rate this statement False.\n\nTo comment on this ruling, go to NJ.com.", "YouTube, Senators Sweeney and Kean Visit William Paterson to Discuss Support for Bond Referendum, Oct. 18, 2012\n\nE-mail interview with Adam Bauer, spokesman for state Sen. Thomas Kean, Oct. 24, 2012\n\nGrapevine, Historical Data, accessed Oct. 23, 2012\n\nGrapevine, Summary Tables, Fiscal Year (FY) 2011-12, accessed Oct. 23, 2012\n\nCenter for the Study of Education Policy, Grapevine Compilation of State Higher Education Tax Appropriations Data for Fiscal Year 2008, June 2008\n\nState Higher Education Executive Officers, State Higher Education Finance: FY 2011, accessed Oct. 23, 2012\n\nState Higher Education Executive Officers, All SHEF Data Table, accessed Oct. 23, 2012\n\nState Higher Education Executive Officers, 1986-2011 All States and National (XLS), accessed Oct. 23, 2012\n\nPhone and e-mail interview with Andy Carlson, policy analyst with the association of State Higher Education Executive Officers, Oct. 23 & 24, 2012\n\nInterview with Paul Shelly, spokesman for the New Jersey Association of State Colleges and Universities, Oct. 24, 2012\n\nInterview with James C. Palmer, Grapevine Editor for the Center for the Study of Education Policy at Illinois State University, Oct. 24, 2012\n\nNew Jersey Association of State Colleges & Universities, NJ State College/University\nAccountability Sourcebook, March 2012\n\nInterview with Darryl Greer, senior fellow of Higher Education Strategic Information and Governance at The Richard Stockton College of New Jersey, Oct. 25, 2012\n\nInterview with Wendell Hall, deputy director of the Institute for Higher Education Policy, Oct. 25, 2012\n\nNew Jersey Office of Legislative Services, Budget and Finance, accessed Oct. 23, 2012\n\nState of New Jersey, The Report of the Governor’s Task Force on Higher Education, December 2010\n\nNew Jersey 101.5, NJ Leaders Push Higher-Ed Bond Question Ahead Of Election [AUDIO], Oct. 17, 2012\n\nThe Record, Bond backers push support for $750M college construction ballot question, Oct. 17, 2012\n\nNew Jersey Association of State Colleges and Universities, Higher Education Budget, accessed Oct. 23, 2012\n\nNBC New York, NJ Voters Weigh Bond for Colleges, Universities, Oct. 22, 2012\n\nThe Star-Ledger, N.J. voters to decide whether to approve $750M in higher education borrowing, Aug. 8, 2012\n\nNew Jersey Legislature, Senate Bill No. 2500, introduced June 14, 2012\n\nU.S. Bureau of Labor Statistics, CPI Inflation Calculator, accessed Oct. 25, 2012", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]