["About this rating", "Among the many conspiracy theories surrounding the October 2017 mass shooting in Las Vegas, Nevada is one that involves Chad Nishimura, a Mandalay Bay Hotel valet worker who said he parked suspected shooter Stephen Paddock's car on his arrival at the hotel.", "According to conspiracy theorists, Nishimura told a reporter in his native Hawaii that Paddock did not appear to have many bags with him, thus contradicting the \"official\" narrative that Paddock acted alone, and prompting Nishimura's sinister disappearance.  On 10 October 2017, the disreputable and rarely accurate web site Neon Nettle wrote:", "A valet worker from the Mandalay Bay hotel, who parked the suspected Las Vegas shooting gunman's car, has mysteriously vanished after giving an interview saying Stephen Paddock was a \"normal guy\" who \"didn't have many bags.\"", "There is no evidence that Nishimura has disappeared or been reported missing, and this account contains several important factual errors and logical mistakes, typical of much of the content that Neon Nettle and other sites of its ilk publish.", "It is true that Nishimura spoke to KITV 4, a Honolulu ABC affiliate, for an article published on 3 October 2017 that has since been deleted:", "A Kamehameha graduate working as a valet at the Mandalay Bay Resort said he parked the shooter's car on Saturday. The gunman, 64-year-old Stephen Paddock, checked his car into the hotel on Saturday morning. Valet Chad Nishimura, who is from Mililani, said he spoke briefly with Paddock.\n\n\"Just in shock, really. It's scary to know that I was close to someone that was that dangerous. I would've never thought. He seemed like a normal guy. When he came in, nothing too weird about him. He didn't have any crazy bags with him that I can remember. We are a convention hotel so we have a bunch of people that have boxes and multiple carts worth of stuff. There's nothing weird that I can remember,\" Nishimura said.", "(An archived version of the story can be viewed here.)", "The first thing to note here is that Nishimura did not say Stephen Paddock didn't have many bags. He said Paddock didn't have any \"crazy bags\" and brought \"nothing weird\" that he could could remember. Further, it requires a logical leap to propose that if Stephen Paddock didn't have much luggage with him upon arriving at the Mandalay Bay Hotel, it follows that he must have had an accomplice in the 1 October 2017 mass shooting. Nothing in Nishimura's account of meeting Paddock eliminates the possibility that Paddock made multiple trips to the hotel, therefore making that particular conspiracy theory surrounding Nishimura fall down on this logical point alone.", "Neon Nettle also attributes the removal of the KITV 4 article to \"higher-ups at ABC taking issue with a report that conflicts with the narrative they are pushing on the public,\" and falsely states that the reporter Moanike'ala Nabarro had declined to answer readers who asked why the story had been deleted.", "In fact, Nabarro gave a clear answer to this question on 7 October 2017, three days before Neon Nettle published its story, saying that the decision was made in order to protect Nishimura's privacy:", "Mililani native says he spoke to shooter before checking his car into the valet at Mandalay Bay- https://t.co/GjkRE9HRVk", "— Moanike'ala Nabarro (@moanikitv) October 3, 2017", "Finally, there is no evidence that Chad Nishimura has \"vanished\" — mysteriously or otherwise — and in fact, there is evidence to contradict this claim.", "According to Neon Nettle, Nishimura \"has completely vanished since the report was published, with all of his social media accounts being scrubbed from the internet.\"", "This is completely and provably false. Nishimura has been active on Facebook after 3 October, the publication date of the KITV 4 article which — at least according to the conspiracy theory being pushed here — prompted his \"disappearance\". (His Facebook account remains active, but we are not linking to it in the interest of protecting Nishimura's privacy from readers provoked by the groundless conspiracy theory peddled and promulgated by Neon Nettle and others.)", "On 5 October 2017, Nishimura wrote:", "I'm okay everyone, I was at the concert the night before, thankfully cut my wristband off and didnt [sic] go on Sunday. However I did park the shooters [sic] car...Thats been the rough part for me.", "Furthermore, the Las Vegas Metropolitan Police Department has not listed Nishimura as a missing person.", "This conspiracy theory is illogical, not supported by any evidence, contradicted by other evidence, and is false. Neon Nettle has a history of publishing inaccurate conspiracy theories, hoaxes and other fabricated content.  The Chad Nishimura case joins a laundry list of conspiracy theories and hoaxes revolving around the October 2017 mass shooting in Las Vegas.", "Nabarro, Moanike'ala.  \"Hawaii Native Parked Shooter's Car.\"\r\n  KITV 4/Archive.is.  3 October 2017 (Archived).", "LaCapria, Kim.  \"Las Vegas Shooting Rumors, Hoaxes and Conspiracy Theories.\"\r\n  Snopes.com.  5 October 2017.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]