["A significant number of posts that circulate false claims online are directed toward Speaker of the House Nancy Pelosi, D-Calif. Recently, USA TODAY has debunked false claims that Pelosi is responsible for the Jan. 6 insurrection at the Capitol, that she spends $52,000 of taxpayer money annually on in-flight drinks and that she said 'It will be a cold day in hell before Trump gets acquitted again.'", "In another post, however, the heat is also on her deputy chief of staff and spokesman, Drew Hammill. Hundreds of people have shared a meme that claims Hammill is attempting to erase evidence of Pelosi ripping up President Donald Trump’s 2020 State of the Union address from social media platforms.", "“Nancy Pelosi’s deputy chief of staff Drew Hammill is demanding Facebook and Twitter remove videos of her ripping President Trump’s State of the Union speech,” reads the meme in the post. “I say we make this picture go viral so the American people can see the TRUTH! Who’s with me?”", "Fact check:Claims about Pelosi's in-flight bar tab are unfounded", "Fact check:Fact check: U.S. Capitol Police Board oversees the force, along with congressional committees", "USA TODAY reached out to the user for comment.", "In an email to USA TODAY, Hammill denied claims that he was attempting to remove videos of the moment, saying on the contrary that he enjoys them.", "“Not true,” Hammill wrote. “I like those videos.”", "Pelosi's press team seems to have owned the moment publicly, with Pelosi giving several interviews about her decision to rip up the speech. The speaker's public show of disdain for Trump's speech, which she later called a \"manifesto of mistruths,\" went viral on its own after the SOTU on Feb. 4, 2020.", "Related:Trump's State of the Union: Several Democrats skipping speech, others ready to hammer health care", "Hammill did ask Facebook and Twitter to remove a particular video that showed Pelosi ripping up the speech — and viral posts lack that demand’s context. His statements were in relation to a video posted by Trump, which Hammill and others deemed “deceptively altered.”", "“The latest fake video of Speaker Pelosi is deliberately designed to mislead and lie to the American people, and every day that these platforms refuse to take it down is another reminder that they care more about their shareholders’ interests than the public’s interests,” Hammill tweeted on Feb. 7, 2020.", "At the beginning of the video, Trump honors one of the last living members of the Tuskegee airmen, which was a group of Black military pilots and aviators who became famous for their skill and achievements during WWII. Immediately after this, the video shows Pelosi ripping up Trump’s speech. The audio is continuous throughout the two scenes, making it appear as if Pelosi ripped the speech right after this tribute. The video then splices the clip of Pelosi over and over after other key moments of the speech.", "However, Pelosi ripped Trump’s speech only once, after he had completed it and was receiving the audience’s applause. The official recording from C-SPAN shows that Trump spoke about the Tuskegee airman at the 30:35 mark, and that Pelosi did not rip the speech up until 1:22:20.", "Andy Stone, policy communications director for Facebook, pushed back against Hammill's claims at the time. Stone responded to the original tweet, “Sorry, are you suggesting the President didn't make those remarks and the Speaker didn't rip the speech?”", "Hammill rebuffed him, writing “what planet are you living on? this is deceptively altered. take it down.\"", "According to USA TODAY, CNBC and other outlets, Twitter and Facebook both stated that the video did not violate their policy for manipulated media and left the video up; however, the video is not currently live on Twitter due to Trump’s suspension from the platform.", "The claim that Nancy Pelosi's deputy chief of staff demanded social media platforms delete videos of her ripping up President Donald Trump's 2020 State of the Union address is MISSING CONTEXT, because without additional information it could be misleading. Drew Hammill did urge Twitter and Facebook to remove one particular video of Pelosi ripping up the speech that he deemed altered, but he neither wished to nor attempted to erase all evidence of Pelosi's act of defiance from these platforms.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact-check work is supported in part by a grant from Facebook."]