["About this rating", "On 12 March 2019, the U.S. government indicted over 40 people, some of them celebrities, in a college admissions scandal that allegedly involved their bribing college coaches to accept students as sports recruits even when those students had no experience in those sports. One of the coaches named in these indictments was Gordon Ernst, who served between 2006 and 2018 as the head men’s and women’s tennis coach at Georgetown University:", "Ernst was also at least somewhat close with the Obama family. A January 2014 New York Times profile of then-First Lady Michelle Obama discussed how Ernst had helped her and her daughter Malia with their tennis games: \"[Michelle Obama] takes occasional tennis lessons with Malia or has clinics with friends to work on their swing. In addition to her forehand, 'Michelle has a big backhand,' said Gordie Ernst, who coaches mother and daughter.\"", "This coincidence has been used to suggest that former U.S. President Barack Obama and his wife had to bribe colleges to accept their elder daughter during her college admissions process. For example, the website “Joe for America” ran an article misleadingly titled “Busted: Obama Family Linked to College Bribery Scandal as the Kids Tennis Coach Accepted Nearly $3 Million in Bribes.” However, the article itself provided no evidence that the Obama family bribed their daughter’s way into college, nor did it even attempt to make that argument — a textbook example of clickbait.", "Malia Obama decided to attend Harvard University in 2016. She was not accepted as a tennis recruit or as an athletic recruit of any kind. The extent of the connection between the Obamas and the admissions scandal was the tangential coincidence that Michelle Obama and her daughters took lessons from someone who was later indicted in that probe.", "Feis, Aaron and Lia Eustachewich.   “Felicity Huffman, Lori Loughlin Busted in College Admissions Cheating Scandal.”\r\n    New York Post.   12 March 2019.", "Beaujon, Andrew.   “5 Facts About the DC Life of Gordon Ernst, The Tennis Coach Named in the Admissions-Scandal Indictment.”\r\n    The Washingtonian.   12 March 2019.", "United States District Court, Massachusetts.   “United States v. Gordon Ernst et al, (19-cr-10081).\"\r\n    27 January 2017.", "Lewontin, Alex and Nick Gavio.   “Nationwide Admissions Scandal Implicates Former Georgetown Tennis Coach, Parents.”\r\n    The Georgetown Voice.   12 March 2019.", "Steinhauer, Jennifer.   “A First Lady at 50, Finding Her Own Path.”\r\n    The New York Times.   16 January 2014.", "Draper, Raymond.   “Busted: Obama Family Linked to College Bribery Scandal as the Kids Tennis Coach Accepted Nearly $3 Million in Bribes.”\r\n    Joe for America.   18 March 2019.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]