["About this rating", "President Donald Trump has pursued a starkly different approach to environmental policy than his predecessor, Barack Obama, whose agenda prioritized replacing fossil fuels with renewable energy sources and taking action to stem global warming.", "Since Trump became president, his administration has reversed many Obama-era initiatives in order to make environmental laws more business-friendly.", "One exception was Trump's signing in October 2018 of bipartisan legislation aimed at reducing the amount of garbage (mainly plastic debris) littering the world's oceans and threatening sea life. Called the Save Our Seas Act of 2018 (S.3508), the bill was described by the activist group Ocean Conservancy as \"a small but significant piece of legislation\" showing \"leadership in the global fight to tackle the marine debris crisis.\"", "The act reauthorized the existing National Oceanic and Atmospheric Administration (NOAA) Marine Debris Program for another five years and called for more international cooperation in the effort to clean up the world's oceans. Ocean Conservancy reported of the bill that:", "It calls on the Executive Branch to get the U.S. State Department more engaged in addressing marine debris. The State Department would do this by working directly with countries that have been identified as significant sources of ocean plastic. This process will help open a dialogue about potential solutions, including waste management infrastructure, to reduce trash leaking into the marine environment.", "President Trump signed the bill on 11 October 2018, and soon afterward a meme began making the rounds of social media criticizing the news media for (allegedly) failing to report on the legislation:", "The meme echoed a complaint often uttered by Trump himself that the mainstream news media ignore his positive accomplishments, dwelling on the negative instead.", "When we searched for press coverage of the Save Our Oceans Act, however, we found that a number of national news organizations had, in fact, reported on its passage and signing. Associated Press ran an article, \"Trump Signs Save Our Seas Act into Law,\" that was syndicated in dozens of daily newspapers and websites across the country. United Press International syndicated a similar article. Bloomberg ran a story emphasizing Trump's remarks during the signing ceremony criticizing Japan and China for continuing to dump plastic waste into the oceans. We did not find coverage in the New York Times.", "We also observed that CNN had covered Trump's signing of the bill on at least two occasions. On 11 October, CNN's Inside Politics aired a portion of the ceremony live in which Trump, flanked by Commerce Secretary Wilbur Ross, NOAA Administrator Admiral Tim Gallaudet, and Sen. Dan Sullivan (R-Alaska), expounded on the need for the legislation and what it would do. And a 16 October article on CNN.com mentioned the signing of the bill in the context of the deployment of an apparatus designed to retrieve plastic waste from the ocean.", "We couldn't find coverage on the prime time news shows of broadcast networks ABC and NBC (nor on cable network MSNBC), though we did turn up an article on the CBS News website giving advance notice of the signing ceremony.", "It's valid to ask whether the enactment of legislation whose main import is the renewal of an existing federal program is all that newsworthy in the first place. When President Obama signed a virtually identical bill in 2012 (reauthorizing and expanding the scope of the NOAA's Marine Debris Program), it appeared to have received no national press coverage at all.", "Downs, Ray.   \"Trump Signs 'Save Our Seas Act' to Boost Clean-Up Efforts in World's Oceans.\"\r\n   United Press International.   12 October 2018.", "Garcia, Ahiza.   \"This Floating Pipe Is Trying to Clean Up All the Plastic in the Ocean.\"\r\n    CNN Business.   16 October 2018.", "Greshko, Michael et al.   \"Trump Is Changing Environmental Policy.\"\r\n    National Geographic.   24 October 2018.", "Bloomberg Environment.   \"Trump Calls Out China, Japan Over Ocean Plastic.\"\r\n    11 October 2018.", "CBS News.   \"Trump Signs Bills on Day of Kanye West's Visit -- Live Updates.\"\r\n    11 October 2018.", "CNN.   \"Donald Trump Speaks on Hurricane Michael Recovery and the Save Our Seas Act; FEMA Takes Action to help Devastated Communities.\"\r\n    11 October 2018.", "NOAA Office of Response and Restoration.   \"New Legislation Expands Scope of NOAA Marine Debris Program to Deal with Natural Disaster Debris.\"\r\n    9 January 2013.", "Video: CBC, CNN, CTV, KATH-TV, KDBC-TV, KDRV-TV, KEYT-TV, KFVS-TV, KGWN-TV, KIRO-TV, KJTV-TV, KPHO-TV, KSWO-TV, KTUU-TV, KTVA-TV, KUSI-TV, KUTV-TV, MSNBC, WKYT-TV, WLAJ-TV, WLNS-TV, WPRI-TV, WREX-TV, WRGB-TV and WTVW-TV.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]