["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Khalid Al-Falih, the minister of energy, industry and mineral resources of Saudi Arabia, center, speaks during an OPEC meeting in Algiers on Sept. 23, 2018. (AP/Anis Belghoul)", "President Donald Trump touted a reduction in oil prices ahead of Thanksgiving and thanked Saudi Arabia for making it possible.", "\"Oil prices getting lower. Great! Like a big Tax Cut for America and the World,\" he tweeted. \"Enjoy! $54, was just $82. Thank you to Saudi Arabia, but let’s go lower!\"", "Oil prices getting lower. Great! Like a big Tax Cut for America and the World. Enjoy! $54, was just $82. Thank you to Saudi Arabia, but let’s go lower!", "The tweet came a day after the president indicated he would not go after Saudi Arabia for the murder of journalist Jamal Khashoggi. Trump has broken with the CIA, which concluded Saudi Crown Prince Mohammed bin Salman ordered Khashoggi’s assassination.", "We wondered, how big has the price drop been? And how much of it can be attributed to actions by Saudi Arabia? The short answer is that both parts of the statement are exaggerated. (The White House did not respond to an inquiry.)", "There has been a drop in gas prices, but the fall-off has been less dramatic than Trump indicated. That’s the case regardless of which metric you use: West Texas intermediate crude or benchmark Brent crude, the two key yardsticks for per-barrel crude oil prices.", "The last time a barrel of oil cost $82 was in October 2014, according to federal data for West Texas Intermediate crude. The price hit $76.40 as recently as early October 2018, and the most recent data shows it at $57.16.", "That’s a drop of $19.24, not the $28 Trump said.", "For Brent crude, a barrel of oil did hit $86.07 in early October, and it’s since fallen to $64.14. That’s a $21.93 drop, again smaller than the drop Trump cited. In addition, the most recent price for Brent crude is still $10 more per barrel than Trump tweeted.", "Here’s how the two prices have tracked since early September.", "That said, despite the decline in recent weeks, prices at the pump on the heavy-travel Thanksgiving week were still the highest in four years.", "Saudi Arabia is a major player in oil, and it has increased its output recently. But Saudi Arabia’s recent increase in oil production is not enough to explain the drop in oil prices, experts told PolitiFact.", "For starters, Saudi Arabia isn’t as big a force in the world market as it once was.", "Oil production by the United States has experienced a larger net increase than the entire production increase from the Organization of Petroleum Exporting Countries (OPEC, of which Saudi Arabia is part).", "Other countries have also increased their production, including Russia and the United Arab Emirates. Overall, this high level of production has had a significant impact on global markets.", "While Iran has decreased oil production in light of pending U.S. sanctions, that hasn’t hurt supply as much as some expected, said Paul J. Sullivan, an economics professor in the Eisenhower School at the National Defense University.", "Another factor is on the demand side. A big reason for the decline is the expectation that the global economy will slow, leaving too much oil and not enough customers, Sullivan said.", "The International Energy Agency released revised expectations projecting this slower global demand growth through 2019, and those expectations play into the price drop, said Anna Mikulska, a nonresident fellow in the Center for Energy Studies at the Baker Institute.", "In addition, oil is priced in dollars, and the increasing strength of the dollar has also made oil cheaper, Sullivan said.", "All told, there are \"hundreds of other economic factors\" that played into oil prices outside of Saudi Arabia, Sullivan said. \"That tweet hits on maybe 15-20 percent of the explanation, but misses the other 80-85 percent.\"", "Mikulska agreed. \"Saudi Arabia's commitment to higher production mattered in lowering oil prices since October, but it has not been the only factor,\" she said.", "Trump tweeted that just before Thanksgiving, oil was $54 a barrel, down from $82. He added, \"Thank you to Saudi Arabia.\"", "The price of oil has dropped in recent weeks, and increased production by Saudi Arabia has played a role.", "However, oil prices haven’t dropped by as much as Trump said, and several factors other than Saudi Arabia — including increased production by other big suppliers and an expected drop in demand — have played a significant role.", "We rate the claim Half True.", "Donald Trump, tweet, Nov. 21, 2018", "U.S. Energy Information Administration, \"Spot Prices for Crude Oil and Petroleum Products,\" accessed Nov. 21, 2018", "Washington Post, \"Trump celebrates low oil prices, tweeting ‘Thank you to Saudi Arabia,’\" Nov. 21, 2018", "Associated Press, \"Oil plunge could help US consumers, some emerging markets,\" Nov. 21, 2018", "USA Today, \"President Trump thanks Saudis for lower oil prices, a day after he defended kingdom over Khashoggi murder,\" Nov. 21, 2018", "MarketWatch, \"Trump thanks Saudis for $54 oil, but says in Wednesday tweet, ‘let’s go lower,’\" Nov. 21, 2018", "Email interview with Paul J. Sullivan, National Defense University economics professor, Nov. 21, 2018", "Email interview with Anna Mikulska, nonresident fellow in the Center for Energy Studies at Rice University’s Baker Institute, Nov. 21, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]