["The 15-second video was published here on Facebook on May 20, 2020.", "It has been viewed more than 272,000 times.", "The video caption states: “Cyclone \"Amphan\" at Digha, West Bengal.”", "Digha is a coastal town in the east Indian state of West Bengal.", "Cyclone Amphan made landfall in West Bengal on 20 May, 2020, killing at least 72 in the state and causing much structural damage.", "The video was also shared here, here, here and here on Facebook, and here and here on Twitter, alongside a similar claim.", "The claim is false.", "A reverse image search of keyframes extracted from the video in the misleading post using InVID-WeVerify, a digital verification tool, found the same clip published in this May 3, 2019 report by the Indian newspaper The Economic Times.", "The video description reads, in part: “Cyclone Fani barrelled through Odisha Friday, unleashing copious rain and windstorm that gusted up to 175 kmph, killing at least eight people, blowing away thatched houses, and swamping towns and villages, officials said.", "“The extremely severe cyclonic storm 'Fani' or the 'Hood of Snake' made landfall around 8 am in Puri, with roaring winds flattening huts, enveloping the pilgrim town in sheets of rain, and submerging homes.”", "The same video was also published on The Economic Times’ official YouTube channel here on May 3, 2019.", "Below is a screenshot comparison of the video in the misleading post (L) and The Economic Times’ video (R):", "Longer versions of the video in the misleading posts have also been shared here, here and here on YouTube dated May 3 and May 4, 2019, alongside descriptions that state the clip shows damage caused by Cyclone Fani.", "Cyclone Fani was a major tropical cyclone that hit India and Bangladesh in May 2019. Here is an AFP report on the disaster.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]