["About this rating", "On 25 January 2017, the Daily Mail published a report with the terrifying headline: \"A doomsday asteroid will hit Earth next month and trigger devastating mega-tsunamis, claims conspiracy theorist”. If ever you wanted a textbook example of the balance fallacy (when two sides of an argument are represented as having comparable value regardless of their merits), or of revenue-driven, shameless pseudoscientific clickbait, this would be the place to see it in the wild.", "On one side of the debate you have NASA, the National Aeronautics and Space Administration. It is a large collection of professionally trained scientists, some of whom have spent decades specifically studying the science of asteroid tracking, engineers who are trained to operate multi-million dollar instruments to perform said tracking, and offices whose sole purpose is to monitor the trajectory of near earth objects. This organization’s NEOWISE mission detected an object dubbed 2016 WF9 on 27 November 2016. After collecting enough data on its orbit, they reported that it was no threat to Earth on 29 December 2016:", "2016 WF9 will approach Earth's orbit on Feb. 25, 2017. At a distance of nearly 32 million miles (51 million kilometers) from Earth, this pass will not bring it particularly close. The trajectory of 2016 WF9 is well understood, and the object is not a threat to Earth for the foreseeable future.", "On the other side of the debate (as framed by the Daily Mail), you have “Self-proclaimed Russian astronomer Dr Dyomin Damir Zakharovich” who says NASA is lying, and that it will hit Earth on 16 February 2017:", "'The object they call WF9 left the Nibiru system in October when Nibiru began spinning counter clockwise around the sun,' he said.", "'Since then, Nasa has known it will hit Earth. But they are only telling people now.'", "If the asteroid hit Earth, he says, it could destroy cities or cause a tsunami. 'We are all in peril.'", "The UK tabloid Metro also reported on this mysterious astronomer:", "Dr Zakharovich believes that there’s a global conspiracy to conceal the existence of Nibiru – orchestrated by the leaders of Russia and the West.", "Two quick notes on the Zakharovich hypothesis. The “Nibiru system” refers to an as yet undetected planet in the outer reaches of our solar system, whose name is rooted in a misreading of ancient Babylonian texts, and which has been the basis for myriad predictions (many of which have come and gone) of our civilization's ultimate demise. While an undetected planet may well exist in our solar system, there is a fairly specific area in which it would be found, and nothing leaving that distant region of space in October is going to be hitting us this February — even if it were on the right trajectory.", "Second, even the Daily Mail seems to think the man on whom  they have based their entire article may not exist:", "The name 'Dyomin Damir Zakharovich' seems to have only appeared online in recent months, relating to doomsday reports regarding the fictional planet Nibiru.", "What we do know for sure, though, is that all available data suggests it is not a risk to our planet. That data is sufficient enough for NASA to have mapped out a Lonely Planet-caliber tour guide for its trip through the inner solar system:", "It's in an orbit that takes it on a scenic tour of our solar system. At its farthest distance from the sun, it approaches Jupiter's orbit. Over the course of 4.9 Earth-years, it travels inward, passing under the main asteroid belt and the orbit of Mars until it swings just inside Earth's own orbit. After that, it heads back toward the outer solar system. Objects in these types of orbits have multiple possible origins; it might once have been a comet, or it could have strayed from a population of dark objects in the main asteroid belt.", "Beall, Abigail.   \"A doomsday asteroid will hit Earth next month and trigger devastating mega-tsunamis, claims conspiracy theorist.\"\r\n    Daily Mail Online.   26 January 2017.", "Waugh, Rob.   \"Doomsday asteroid ‘will hit Earth on February 16,’ Russian maniac warns.\"\r\n    Metro.co.uk.   25 January 2017", "NASA Jet Propulsion Laboratory.   \"NASA's NEOWISE Mission Spies One Comet, Maybe Two.\"\r\n    29 December 2016", "Guarino, Ben.   \"Will the mysterious shadow planet Nibiru obliterate Earth in October?\"\r\n    Washington Post.   5 January 2017", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]