["About this rating", "A pride flag temporarily flew in place of a POW/MIA flag at Veterans Memorial Plaza in Rockville, Maryland, on June 10, 2019, as Montgomery County did not have a mechanism in place to display both flags simultaneously as intended.", "The pride flag didn't replace the POW/MIA flag. As soon the technical issue was resolved (by the following day), the flags were flown together.", "On June 10, 2019, a rainbow flag was raised at Veterans Memorial Plaza in Rockville, Maryland, in honor of Pride Month. In flying that flag, Montgomery County Council officials had to temporarily remove another flag, a POW/MIA flag, as the flag pole was not equipped to simultaneously hold multiple flags.", "NBC Washington reported of the subject that:", "For the first time ever, a rainbow pride flag flew outside a Maryland county's executive office building, but the flag it replaced had people raising objections.", "Montgomery County Council member Evan Glass, the council's first LGBTQ member, helped celebrate the raising of the pride flag Monday morning at Veterans Memorial Plaza in Rockville.", "But Vietnam veteran John “Bill” Williams said he’s upset the flag that honored soldiers still missing was taken down ...", "“I wasn’t happy about it at all because the park is supposed to be a veterans park,” Williams said. “People died. Now they took it down and put another flag up.”", "Montgomery County Councilman Evan Glass said at the time that once officials learned the flag pole couldn't accommodate both flags, they quickly worked on a solution: “The flag post was only able to accommodate one flag, and when we learned of that, we are quickly, the county government, is quickly changing it. So we’re adding more ringlets so that by tomorrow morning both flags will be raised.”", "The following day, the Montgomery County government rectified the situation by adding more ringlets to the flag pole so that the pride flag could be flown during Pride Month without replacing any of the other flags.", "The county said in a statement on the issue that:", "The Pride flag did not replace the POW/MIA flag. On June 10th, when the Pride flag was raised, there was not a mechanism in place for both flags to be displayed. This has been corrected, and both flags are flying now. The Pride flag was raised to honor Pride Month and will be replaced by the County flag at the end of June.", "More than a week after this issue was rectified, the website The Blaze published an article headlined \"Rainbow pride flag replaces POW/MIA flag at veterans memorial plaza — and public outcry is ignited.\" But the piece didn't disclose the POW/MIA flag was still being flown until its penultimate sentence. This article was also aggregated on conservative websites such as JoeMiller.us, True Pundit, and 4 Conservative.", "On June 17, the Twitter account \"Educating Liberals\" posted the following tweet claiming that the a pride flag had replaced the POW/MIA flag. The tweet did not mention that the POW/MIA flag was flying at the time it was posted:", "In short, a POW/MIA flag was temporarily removed on June 10, 2019, to make room for a rainbow flag in celebration of Pride Month, as the flag poles were not equipped to carry multiple flags. The POW/MIA flag was only down for a day, however, as city officials added additional ringlets to the pole so that the rainbow flag could be flown without replacing any of the other flags at the Veterans Memorial Plaza.", "The rainbow flag will be taken down at the end of Pride Month. The POW/MIA flag will remain in place.", "Stone, Shomari.   \"Pride Flag Replaces POW/MIA Flag at Montgomery County Executive Building.\"\r\n    WRC-TV.   10 June 2019.", "Urbanski, Dave.   \"Rainbow Pride Flag Replaces POW/MIA Flag at Veterans Memorial Plaza — And Public Outcry Is Ignited.\"\r\n    The Blaze.   19 June 2019.", "Montgomery County Government.   \"Statement by County Executive Marc Elrich on the POW/MIA Flag.\"\r\n    11 June 2019.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]