["After conspiracy theorists claimed former first lady Melania Trump used a body double for public appearances, some social media posts have surfaced targeting President Joe Biden and accusing him of doing the same.", "A viral post shared on Feb. 12 compares side-by-side images of Biden signing documents with different hands in an attempt to support the claim.", "One photo is a recent image of Biden signing executive orders in the Oval Office with his left hand, and the other shows a photo of him purportedly writing with his right hand. A caption below the two photos reads, \"Is he left-handed or right-handed?\"", "\"Oops. Biden's body double is left-handed. Casting director slipped up!\" reads a text included in the post, which has more than 600 shares.", "Another Facebook user shared the same two images on Feb. 3 and wrote, \"Okay folk's here is the deal in 2008 Joe Biden is right-handed. Joe Biden in 2021 is left-handed. The stories are true our President is a body double.\"", "USA TODAY reached out to the Facebook users for comment.", "Fact check: Student loan debt still exists, despite viral social media claim", "Both photos included in the post are authentic, however, the more recent image of Biden in the Oval Office has been flipped to make it appear as if he is writing with his left hand.", "In the original image, taken by AFP photographer Jim Watson on Jan. 20, the pocket square is on the left side of Biden's coat, not the right, and he is writing with his right hand.", "The executive orders sitting on Biden's desk and the American flags behind the president also appear on the opposite side of the photo in the authentic version.", "The second photo included in the post is genuine and was captured by White House photographer David Lienemann. But it was not captured in 2008 as the post claims and was taken on April 14, 2010, when Biden was vice president in the Obama administration.", "In the photo, Biden is seen signing a condolence book at the Polish Embassy in Washington, and he is writing with his right hand.", "Social media users have previously used this method of mirroring images to spread false claims. For example, in 2010, a flipped photo of  Barack Obama and Michelle Obama was used to claim that they saluted the flag with their left hands instead of their right, Factcheck.org reported.", "Fact check: Famous 16th century Japanese samurai was an African expatriate", "In a 2020 Autocomplete interview with Wired, Biden answered the most popular questions asked about him on Google, one of them being, \"Is Joe Biden left-handed?\" In response, Biden confirmed that he does not write with his left hand.", "Only eight  presidents have been left-handed. James. A Garfield was the first left-handed president, according to Potus.com. Barack Obama was the most recent one.", "Other claims that Biden has someone stand in as him for public events have been debunked by Snopes.", "Fact check:Biden didn't mangle proverb about teaching someone to fish", "A post using an altered image of President Joe Biden to claim that he has a body double is FALSE, based on our research. A photo included in the post has been digitally flipped to make Biden appear as if he is writing with his left hand. Biden has confirmed in an interview that he is right-handed.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook."]