["About this rating", "In May 2017, people on social media got wind of an article about a Colorado hunter who apparently claimed that a Sasquatch (a creature of legend also known as Bigfoot or, in some circles, the Yeti) sexually assaulted him:", "The article was published by World News Daily Report on 11 May 2017:", "The 57-year old man was walking to his hunting cabin on Sunday, to see if it had suffered any damage during the winter.", "All of a sudden, a large “gorilla-like” creature dropped from a tree in front of him punched him in the face ... While Mr. Whitaker was trying to recover from the attack, the large humanoid creature began to tear his clothes while letting out some terrifying howls.", "“When I regained consciousness, he had already torn my pants and was tearing through my underwear. I stabbed him in the shoulder with my hunting knife, and that made him run away.”", "The item included a photograph of large footprints, purportedly captured at the scene of the incident. That image dated back to at least 2011, and was unrelated to any incidents involving a hunter versus Bigfoot encounter in 2017.", "However, all of this is beside the point, because there is no truth to this story; World News Daily Report admits on its own disclaimer page that all of its site content is fictional:", "WNDR assumes however all responsibility for the satirical nature of its articles and for the fictional nature of their content. All characters appearing in the articles in this website – even those based on real people – are entirely fictional and any resemblance between them and any persons, living, dead, or undead is purely a miracle.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]