["About this rating", "In the hours after a mass shooting at a high school in Santa Fe, Texas killed at least ten people on the morning of 18 May 2018, attempts to draw a common cause between many of the major mass shootings in the United States appeared on social media and were quickly and widely spread.", "The viral post, which was copied and pasted as well as shared and retweeted, read as follows:", "Aurora: AR-15\nOrlando: AR-15\nParkland: AR-15\nLas Vegas: AR-15\nSandy Hook: AR-15\nTexas Church: AR-15\nSan Bernardino: AR-15\nWaffle House: AR-15\nSanta Fe High School: AR-15", "The only ones who don't see where the problem is are Republicans.", "But while the statement is accurate for the most part, the weapon most commonly associated with such massacres was reportedly not used in Santa Fe.", "In a press conference following the 18 May 2018 shooting Gov. Greg Abbott refuted early reports saying that the suspect, 17-year-old Dimitrios Pagourtzis, used an AR-15 rifle. Instead, Abbot said, the suspect used a shotgun and a .38-caliber revolver to carry out the attack, killing 10 people and injuring 10 more.", "However, the post is correct in that the rifle has been used in several widely-covered mass shootings in the U.S. since 2012. Specifically, an AR-15 or a modified version of one was used to commit the attacks in Aurora, Colorado (June 2012); Sandy Hook Elementary School in Newtown, Connecticut (December 2012); San Bernardino, California (December 2015); First Baptist Church in Sutherland Springs, Texas (November 2017); and Parkland, Florida in February 2018.", "Regarding the June 2016 attack at Pulse nightclub in Orlando, Florida, authorities revised their initial description of one of the weapons used. After initially describing it as an \"AR-15-type assault rifle,\" police said it was a different type of firearm, the Sig Sauer MCX.", "While the National Rifle Association has reportedly promoted the AR-15 as \"America's rifle,\" calls for it to be banned have been a reocurring phenomenon since the Sandy Hook attack, in which 28 people were killed, most of them children. They increased again following the Parkland shooting, with several students at Marjory Stoneman Douglas High School, where it occurred, becoming public advocates for tighter laws concerning firearm sales.", "The suspect in the May 2018 shooting has been charged with capital murder. He is being held without bond.", "Houston Chronicle. \"Shooter Identified in Santa Fe High School Rampage that Killed 10.\"\r\n    18 May 2018.", "Cummings, William and Jensen, Bart. \"Why the AR-15 Keeps Appearing at America's Deadliest Mass Shootings.\"\r\n    USA Today, accessed via cnbc.com. 15 February 2018.", "LoGiurato, Brett. \"This Is The Gun Used In The Colorado Shooting That Everyone Can't Believe Is Actually Legal.\"\r\n    Business Insider. 20 July 2012.", "Goode, Erica. \"Rifle Used in Killings, America’s Most Popular, Highlights Regulation Debate.\"\r\n    New York Times. 16 December 2012.", "Lawrence, J.P. \"Shooter's Weapon Described as AR-15 Variant.\"\r\n    San Antonio Express-News. 5 November 2017.", "Keller, Chris. \"San Bernardino Shooting Update: Rifles Used in Attack Were Modified to be Illegal.\"\r\n    KPCC-FM. 4 December 2015.", "Gibbons-Neff, Thomas. \"The Gun the Orlando Shooter Used Was a Sig Sauer MCX, Not an AR-15. That Doesn't Change Much.\"\r\n    Washington Post. 14 June 2016.", "Elfrink, Tim. \"Nikolas Cruz, Who Was Too Disturbed to Carry a Backpack, Legally Bought AR-15.\"\r\n    Miami New Times. 15 February 2018.", "Fisher, Marc. \"The AR-15, a Symbol of America's Political Gulf, is Easy to Use and Obtain.\"\r\n    Washington Post, accessed via chicagotribune.com. 15 February 2018.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]