["About this rating", "Myriad unfounded claims have been made of the UK’s Cancer Act of 1939, a law which some critics of the modern medical industry have suggested is part of a conspiracy to prevent a cure for cancer from being discovered so that “big pharma” can continue to profit from the disease unabated.", "In fact, the law prohibits any person from taking “any part in the publication of any advertisement ... containing an offer to treat any person for cancer, or to prescribe any remedy therefor, or to give any advice in connection with the treatment thereof.” The act had other provisions when first passed, but the advertising portion is the only aspect of the act that remains on the books:", "Because it arrived nearly a decade before the founding of the NHS [National Health Service], the [Cancer] Act also contained details about how local councils should provide treatment and other services for cancer patients. And there was a whole section explaining how money should be allocated around the country to buy supplies of a radioactive element called radium — a forerunner of the far more sophisticated radiotherapy treatments we have today.", "All but one of these sections have now been repealed or subsumed into other pieces of legislation, and only one — section four — still stands. [Put simply, that section] is a blanket ban on advertising cancer treatments to the general public.", "One meme on the subject appearing online attempts to state as fact that the actually prevents anyone from curing cancer by criminalizing that activity:", "First, since this law was passed by the British Parliament, no “medical practitioners” are being prosecuted “in America” under the law.", "More important, the act in no way prevents people from developing or researching cures for cancer. In fact, UK-based entities frequently fund research into cancer cures. The Act merely bars anyone (including UK drug manufacturers) from advertising they have a product that will “cure” cancer.", "The Act also does not, as claimed by Cannabis-culture website Herb, make it “illegal to promote, write about, or even speak about cancer therapies other than radiation.” That claim apparently stems from the way the act defines an advertisement: \"In this section the expression 'advertisement' includes any notice, circular, label, wrapper or other document, and any announcement made orally or by any means of producing or transmitting sounds.\"", "While the definition of what constitutes an advertisement is broad, the Act applies to the “publication” of an advertisement. The law was intended to protect patients from quacks and snake oil peddlers, a threat as real to cancer patients then as it is today. The few prosecutions that have taken place under the Act are in keeping with that spirit of the law.", "For example, a man named Jerry Sargeant, who calls himself “The Facilitator” and purports to have the ability to edit “people’s karmic blueprints through distance healing” (for the low price of £90 per quarter hour), claimed in several YouTube videos that his skills allowed him to rid people of cancer. He was found guilty of four violations under the Act and fined £4,700.", "In another example, a “life coach and naturopathic doctor” who calls himself Dr. Stephen Ferguson (who is not a medical doctor, but has a PhD in nutrition and hypnosis), claimed that multiple patients of his had been “cured” of cancer thanks to vitamin supplements and protein shakes sold on his website. He was fined £1,750 for violating the Act.", "If, in a bizarre turn of events, an individual did actually discover smoothie-based or telepathic cures for cancer, they would be free under the Cancer Act of 1939 to publish about their discoveries in scientific journals, discuss them privately or in academic contexts, or to continue researching the concept. They would not, however, be allowed to present that information to the general public in advertisements in the United Kingdom.", "legislation.gov.uk.   \"Cancer Act 1939.\"\r\n    Accessed 18 July 2018.", "Cancer Research UK.   \"The 1939 Cancer Act: What Is It, What Does it Do, And Is It ‘Suppressing the Cure’?\"\r\n    19 February 2016.", "gov.uk.   \"Cancer Research and Treatment.\"\r\n    Accessed 18 July 2018.", "Teague, Christopher.   \"Seriously, WTF: Have You Ever Heard Of The 1939 Cancer Act?\"\r\n    Herb.   16 July 2016.", "parliament.uk.   \"House of Commons Written Answers 12 June 2014\"\r\n    12 June 2014.", "Hartley-Parkinson, Richard.   \"Man Who Says He Cures People Through Crystals and Star Magic Facing Jail.\"\r\n    Metro.   20 September 2017.", "de Graaf, Mia.   \"Bodybuilder Turned Harley Street Nutritionist Fined for Claiming He Could Cure Cancer With Diet and Fitness Techniques \"\r\n    Daily Mail.   6 May 2014.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]