["During a Senate appropriations Feb. 25 subcommittee hearing, Chad Wolf, the acting secretary of Homeland Security, said the U.S. flu mortality rate was about the same as the current estimated global mortality rate of the coronavirus outbreak.", "He made this statement during an exchange with Sen. John Neely Kennedy (R-La.) regarding what the acting secretary knew about the coronavirus, which causes a disease known as COVID-19. This C-SPAN video shows the full discussion between the two.", "Kennedy first asked what the worldwide mortality rate for coronavirus is, to which Wolf responded, that it was \"under 2%\" but that he would need to check with the Centers for Disease Control and Prevention to get the actual figure and that \"it changes daily.\" The Louisiana senator then asked, \"What’s the mortality rate for influenza over, say, the last 10 years in America?\"", "Wolf answered: \"It’s also right around that percentage as well. I don’t have that offhand, but it’s right around 2% as well.\"", "We asked the Department of Homeland Security where Wolf’s figure came from.", "A DHS spokesperson said in an email, \"As the acting secretary said in his hearing, he did not have that information on hand and refers to Health and Human Services -- the federal agency in charge of the federal government’s coronavirus response.\"", "The comparison of coronavirus to flu in terms of mortality rates seemed like an important mechanism to understanding the growing concern about the reach of coronavirus, so we decided to dig deeper to find out if these statistics hold up. We also asked experts to explain what the numbers mean in terms of risk.", "Digging into mortality rate numbers", "The CDC directed us to its online influenza resources and referred us to the World Health Organization for more information on coronavirus.", "Christopher Mores, a global health professor at George Washington University, helped make sense of some of the figures. He calculated the average, 10-year mortality rate for flu using CDC data and found it was 0.1%. That 0.1% rate is frequently cited among experts, including Dr. Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases.", "Dr. Amesh Adalja, a senior scholar at the Johns Hopkins University Center for Health Security, called it \"sort of the canonical seasonal influenza mortality figure.\"", "It’s important to note, that although this percentage seems like a small number, influenza is responsible for an estimated 30,000 to 40,000 deaths annually.", "Now, for coronavirus.", "According to statistics released Feb. 17 by the Chinese Center for Disease Control and Prevention, the mortality rate for coronavirus was 2.3%. That’s based on cases reported through Feb. 11 and calculated by dividing the numbers of coronavirus-related deaths at the time (1,023) by the number of the confirmed cases (44,672) of the coronavirus. (These numbers reflect the information available at the time of the secretary’s testimony.)", "But this report has limitations, Mores said, including the vague way Chinese officials are defining who has been infected by the coronavirus.", "\"We have not been able to understand what precisely has gone on there,\" said Mores. \"They have changed their case definitions multiple times. It’s murky what has gone into the case count and who has gone into being counted on cases.\"", "The WHO said in a press conference Monday that in Wuhan, China, the city where the virus first hit, the mortality rate ranged from 2% to 4%. Officials said that in the rest of China, outside of Wuhan, the mortality rate of coronavirus is 0.7%.", "Mike Osterholm, director of the Center for Infectious Disease Research and Policy at the University of Minnesota, said the mortality rate in China has since risen to 0.9%.", "Right now he doesn’t see a similarity in the flu mortality rate and the coronavirus mortality rate. \"We don’t have any evidence to that being the case,\" said Osterholm.", "Mores said U.S. health officials just don’t have enough information to know whether the two mortality rates are similar. Understanding this comparison would offer a means to better understand the severity of the coronavirus. It could also help in educating the public about the novel illness.", "\"Until we can gain our own experience with this virus, it’s going to be pretty squishy. So, all the numbers that you have come across here are within the range of possibility,\" he said. \"Absolutely, the hope is we will end up with something similar to the flu, but we just don’t know yet.\"", "Multiple experts told us that the number of coronavirus cases not just in China but worldwide has probably been undercounted because many people with the infection do not suffer serious symptoms and may not seek medical treatment. It is possible that only those who have tested positive are being counted as \"confirmed cases.\"", "Until the case definition is expanded, they said, to include people clinicians think may have COVID-19 but who were not tested for it, then the total estimated number of cases will remain lower than the likely reality. But, if the number of cases widens to include those with mild symptoms who have not been tested, then the mortality rate will go down.", "This is the way mortality rates are calculated for the flu, said Mores. The numbers of flu illnesses and deaths are estimates based not only on positive flu tests, but also on doctors’ suspicions and symptomatic diagnosis.", "One key difference between the flu and the coronavirus illness, Osterholm cautioned, is that, with the flu, the population has a partially built up immunity, whether through receiving flu shots or already having been exposed to the illness.", "Mores concurred. \"You know, the risk is this: We have a brand-new virus in a completely naive population on Earth, we’re all susceptible to it. Everyone is potentially infectable with this virus,\" he said. \"Even with a high transmission rate and the low case fatality rate, that still becomes a massive number of ill and fatal cases.\"", "Our ruling", "There are two ways to parse out this claim: First, is it true that the average U.S. mortality rate for flu is 2%?", "That’s not true, according to data from the CDC and exchanges with multiple global health experts. On average, the flu mortality rate during the past 10 years has been 0.1%. In addition, Wolf and a DHS spokesperson admitted that the acting secretary did not have the statistics in front of him when he answered questions at the hearing about the mortality rates.", "Second, is it true the COVID-19 mortality rate is similar to the flu mortality rate?", "Wolf is also wrong on that account, based on the limited information currently known about the coronavirus. Recent data from the Chinese government set the COVID-19 mortality rate at 2.3%. That’s vastly different from the flu’s mortality rate of 0.1%.", "Experts also said that while it’s possible the mortality rate from the new virus could come close to the flu’s mortality rate eventually ― if the case definition of coronavirus is expanded -- it’s too soon to make that assumption with the limited information available.", "For these reasons, we rate the claim False.", "C-SPAN, \"Department of Homeland Security Fiscal Year 2021 Budget Request,\" Feb. 25, 2020.", "The Washington Post, \"Trump’s DHS head has a brutal exchange on coronavirus — courtesy of a GOP senator,\" Feb. 25, 2020.", "Email exchange with the Department of Homeland Security Office of Public Affairs, Feb. 26, 2020.", "Email exchange with the Centers for Disease Control and Prevention Office of the Associate Director for Communications, Feb. 28, 2020.", "Centers for Disease Control and Prevention, \"Influenza,\" page last reviewed Jan. 27, 2015.", "Centers for Disease Control and Prevention, \"Estimated Influenza Illnesses, Medical visits, Hospitalizations, and Deaths in the United States — 2018–2019 influenza season,\" page last updated Jan. 8, 2020.", "Centers for Disease Control and Prevention, \"Coronavirus Disease 2019 COVID-19,\" page last updated Feb. 14, 2020.", "Centers for Disease Control and Prevention, \"Disease Burden of Influenza,\" page last updated Jan. 10, 2020.", "Phone interview with Christopher Mores, a professor of global health at the Milken Institute School of Public Health, George Washington University, Feb. 27, 2020.", "Email exchange with Dr. Amesh Adalja, a senior scholar with the Johns Hopkins University Center for Health Security, Feb. 26, 2020.", "Phone interview with Michael Osterholm, Regents professor and director of the Center for Infectious Disease Research and Policy at the University of Minnesota, Feb. 27, 2020.", "Chinese Center for Disease Control and Prevention, \"Vital Surveillances: The Epidemiological Characteristics of an Outbreak of 2019 Novel Coronavirus Diseases (COVID-19) — China, 2020,\" Feb. 17, 2020.", "JAMA, \"Characteristics of and Important Lessons From the Coronavirus Disease 2019 (COVID-19) Outbreak in China,\" Feb. 24, 2020.", "World Health Organization, \"Coronavirus Disease (COVID-19) Press Conference 24 February 2020,\" Feb. 24, 2020.", "Email exchange with Yanzhong Huang, a professor and director of the Center for Global Health Studies at Seton Hall University and senior fellow for global health studies at the Council on Foreign Relations, Feb. 26, 2020.", "Email exchange with Ian Lipkin, John Snow professor and director of the Center for Infection and Immunity, Columbia University, Feb. 26, 2020.", "The Washington Post, \"White House homeland security adviser Tom Bossert resigns,\" April 10, 2018.", "The Washington Post, \"Top White House official in charge of pandemic response exits abruptly,\" May 10, 2018.", "The Washington Post Health 202, \"President Trump made it harder to fight coronavirus by actions he took two years ago,\" Feb. 27, 2020.", "Center for Strategic and International Studies, \"Ending the Cycle of Crisis and Complacency in U.S. Global Health Security,\" November 2019.", "Democratic Senators’ Letter to National Security Adviser Robert O’Brien, \"021320 NSC Novel Coronavirus Letter,\" Feb. 13, 2020.", "Politico, \"Lawmakers spar with Trump team over coordinating coronavirus response,\" Feb. 26, 2020.", "Centers for Disease Control and Prevention, \"Transcript for the CDC Telebriefing Update on COVID-19,\" Feb. 26, 2020.", "Politico, \"Trump puts Pence in charge of coronavirus response,\" Feb. 26, 2020.", "Politico, \"White House announces coronavirus 'coordinator' to lead response under Pence,\" Feb. 27, 2020.", "The White House press release, \"Vice President Pence Announces Ambassador Debbie Birx to Serve as the White House Coronavirus Response Coordinator,\" Feb. 27, 2020.", "KHN Morning Briefing, \"Trump To Assemble U.S. Task Force To Tackle Coronavirus; Top Health Officials Reiterate Americans Are At Low Risk,\" Jan. 30, 2020.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]