["About this rating", "On April 5, 2020, U.S. Democratic presidential candidate Joe Biden was interviewed on the ABC News \"This Week with George Stephanopoulos\" program.  Later in the campaign, a meme circulated via social media reproduced a transcript of a brief portion of that interview, calling attention to \"words that made no sense\":", "The transcript presented in the meme was reasonably accurate in a literal sense, as can be verified in the following video clip, although reproducing an oral statement in written form, with no punctuation and no context, can create a very different impression than one might glean from listening to a recording of the spoken version:", "The full context of Biden's remark, according to ABC News' transcript of the interview, was as follows:", "STEPHANOPOULOS: And does [delaying a primary election due to the COVID-19 pandemic] hold for the [Democratic national] convention as well? If -- are you open to the idea that -- it just may not be possible to do the convention in August?", "BIDEN: Well, we're going to have to do a convention, may have to do a virtual convention. I know -- I think we should be thinking about that right now. The idea of holding a convention is going to be necessary, but we may not be able to put 10,000, 20,000, 30,000 people in one place and that's very possible. Again, let's see where it is.", "What we do between now and then is going to dictate a lot of that as well. But my point is that I think you just got to follow the science. Listen to the experts. Listen to the Faucis of the world. And if that's the case, it's the case.", "But we cannot let this ... we’ve never allowed any crisis from a Civil War, straight through to a pandemic in ‘17, all the way around -- in ’16 -- we have never, never let our democracy take second fiddle, we can both have a democracy and elections and at the same time protect the public health.", "But I think it's time we start thinking about how we're going to hold elections, whether we're going to have to spend a lot of time figuring whether we do -- is it going to mostly be by mail, which is not the preferred route for everyone -- how are we going to do that? How are we going to make it available to everybody?", "Biden was referring to the early 20th century influenza outbreak commonly known as the \"Spanish flu,\" and (like President Donald Trump consistently does) he misstated that it began in \"'17\" (i.e., 1917) rather than 1918. Then he interrupted his answer a few words later to correct himself, but his correction was also erroneous, placing the outbreak a year earlier (in 1916) rather than a year later (in 1918).", "Biden also slurred the word \"take\" such that it sounded like \"sakes,\" and he quickly said the words \"way they\" after \"second fiddle,\" as if he were going to pursue a different line of expression before stating that, \"We can both have a democracy, and elections, and at the same time protect the public health.\"", "https://abcnews.go.com/Politics/week-transcript-20-joe-biden-secretary-mark-esper/story?id=69981088", "ABC News.   'This Week' Transcript 4-5-20: Joe Biden, Secretary Mark Esper.\"\r\n    5 April 2020.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]