["About this rating", "In the photograph, a young blonde girl stands in front of a piece of poster board set up for a school science fair. The title of her project is \"Jumping Off Buildings: How High is Too High?\" -- and the girl apparently used herself as a guinea pig. She sports a cast on each of her arms. Depending on how you look at it, it's a terrible use of the scientific method, or a kid truly dedicated to her school work.", "Either way, the picture is fake.", "Here's a look at the doctored image (left) and the original photograph (right). As you can see in the second image, the science project actually focused on how water towers work:", "The local newspaper The Woodstock Sentinel Review published the photograph alongside an article about the annual science fair at John Knox Christian School in 2012. The student in the image is student Kaitlyn Homan, who was in eighth grade at the time and who spoke to the newspaper about her project:", "Grade 8 student Kaitlyn Homan researched water towers for her project, which included a replica of the Ingersoll water tower.", "“I was kind of interested on how water towers work, so I decided to do that for my science fair project,” she said. “I studied a bit on it and I built a model to show other people how it works.”", "Homan was surprised to discover how water towers work.", "“I thought they would be used on a pump, but I guess it’s by how high they are up in the air,” she said. “They work by pressure, so that pressure brings the water up it, but it does have an additional pump to help it.”", "She had no idea about water towers before she started the project, but Homan was eager to learn about something new.", "“I was just driving by one when we had to think about what we had to do our project on, so I thought ‘I’m going to learn how it works,’ ” she said.", "Homan took to Twitter in March 2017 to confirm that the viral image was a doctored one:", "Thomson, Ron.   \"John Knox Christian School Holds Annual Science Fair.\"\r\n    Woodstock Sentinel-Review.   8 March 2012.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]