["By Eugene Kiely", "Posted on October 2, 2017", "Q: Did comedian David Letterman respond to the mass shooting in Las Vegas by tweeting, “End white privilege today”?", "A: No. A website that claims to be a safe haven from “fake news” posted that bogus information based on a tweet from a parody Twitter account.", "False and misleading claims have flooded the internet in the wake of the mass shooting that left more than 50 people dead at an outdoor country music concert in Las Vegas. Facebook users flagged one such story that carried the false headline “David Letterman Just Pointed Out What Others Won’t About The Vegas Mass Shooter.”", "The story, which appears on the website Verified Politics, claims that the former late night talk show host “took to Twitter to lay bare an inconvenient truth that the media usually fails to mention.” The story then inserted a tweet purportedly from Letterman that says, “Las Vegas shooter Stephen Paddock was NOT a ‘lone wolf’, he was NOT ‘mentally ill’, he was a TERRORIST. End white privilege today.”", "But the tweet embedded in the story is not real. It was from an unverified parody account, which Twitter allows under certain rules.", "Twitter says a parody account “should indicate that the user is not affiliated with the account subject by stating a word such as ‘parody’” in the account bio. Twitter also says the parody account name “should not be the exact name of the account subject.”", "The Twitter handle for the Letterman parody account is @DavidLetternan – a misspelling of Letterman’s name. The account also has the word “parody” in the bio.", "Letterman’s real Twitter handle is @Letterman, and, unlike the parody account, it is a verified account — which carries the iconic blue check that indicates the account has been verified by Twitter.", "Ironically, the website Verified Politics tells its readers, “If you are tired of ‘fake news,’ we are the site for you.”", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to help identify and label viral fake news stories flagged by readers on the social media network.", "Associated Press. “Las Vegas attack is deadliest shooting in modern US history.” ABC News. 2 Oct 2017.", "Rivero, Omar. “David Letterman Just Pointed Out What Others Won’t About The Vegas Mass Shooter.” Verified Politics. 2 Oct 2017.", "“Parody, commentary, and fan account policy.” Twitter. Undated. Accessed 2 Oct 2017.", "“About verified accounts.” Twitter. Undated. Accessed 2 Oct 2017.", "FactCheck.org Rating:", "Read More", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]