["The claim was shared on Facebook here on February 20, 2020.", "Below is a screenshot of the misleading post:", "The post’s Thai caption translates to English, in part, as: “Don’t forget tomorrow will be the first day that Facebook implements the new rule where they can use your photos freely. Your photos can be used in court cases in litigation against you. Everything you've ever posted becomes public from today, even messages that have been deleted or photos that are not allowed to use in public. It costs nothing for a simple copy and paste, better safe than sorry.”", "Similar claims were published here, here, here and here  on Facebook and here and here on Twitter.", "The claim was also shared in English here, here, here and here on Twitter.", "The claim is false.", "“I can confirm that the viral post in question is not true,” Manaschuen ‘Tukata’ Kovapirat, Facebook’s communications manager for Thailand and Laos, told AFP via email on February 24, 2020.", "“Protecting people's privacy is central to Facebook. People can view and adjust their privacy settings at any time and also use the Privacy Checkup tool to help them control who can see what they share, how their information is used and how to strengthen their account security.”", "In a Facebook community help forum on January 28, 2019, the platform also said claims of such a new policy circulating were \"likely a scam\".", "“I'm sorry to hear that you experienced this and thank you for sharing your question with the Community,” Facebook said. “It sounds like the message you saw is likely a scam.”", "Below is a screenshot of the post on the forum:", "Thai news website Brand Buffet also refuted the false claims in this report dated February 24, 2020.", "The article’s headline translates to English as: “Facebook says viral post ‘Rules for using images or information’ is not true. Users can set Privacy settings in the system.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]