["The news of discovery of gold mines with 3,500 tonnes of gold reserve in Uttar Pradesh’s Sonbhadra district first broke on the Feb 20th in regional papers. By February 22nd, 2020, the entire Indian media was abuzz with the news that Sonbhadra gold mines had gold deposits estimated to be around 3,350 tonnes and worth Rs 12 lakh crore, which is almost five times India’s current gold reserve. The reports quoted a District Mining Officer and estimated that with this find, India’s current gold reserve of 626 tonnes, would jump to second place in the world behind US which holds 8,133.5 tonnes of gold. Even though the reports mentioned ‘gold deposits’, they equated it to actual gold mined and added the entire 3350 tonnes to India’s current gold reserve. Such exuberant reporting continued till later in the day when Geological Survey of India intervened and denied making any such discovery. In this article Alt News will trace how the Indian media fell for unverified news.", "The coverage in Jagran news specified that it is a discovery of gold ore and it quoted Dr Rohtash, professor of Geology of BHU, who explained that the amount of gold that can be extracted from it depends on the grading of the deposit. However, this is not how it was interpreted by the time the news reached English media.", "One of the earliest tweets on Feb 20th interpreting 3,350 tonnes of gold ore as 3,350 tonnes of actual gold mined was Mahesh Hegde, founder of the dubious website, Postcard News. Hegde linked the finding to India’s gold reserves implying that the entire 3,350 tonnes will be added to India’s gold reserves. This line of thinking was subsequently parroted by several mainstream media outlets.", "3500 tonnes of GOLD found in Sonbhadra, UP", "Extraction work will soon begin", "Credit goes to Geological Survey of India for working behind this since 2005", "Prior to this India’s Gold reserves in world was 618.2 tonnes", "Once again India will be called Golden Bird (Sone Ki Chidiya)", "— Mahesh Vikram Hegde (@mvmeet) February 20, 2020", "On Feb 21st, the news was published by ANI. Curiously the ANI story quoted the District Mining Officer, KK Rai who claimed that Gold deposits were 2700 ‘million’ tonnes in Son Pahadi and 650 ‘million’ tonnes in Hardi field. State broadcaster Doordarshan also tweeted the news and the statement of the mining officer. The tweet is now deleted.", "A widely quoted story by Times of India and Economic Times researched the value of gold reserves of different countries and estimated that with this discovery, India’s gold reserve would jump to second place behind the US.", "It is noteworthy that almost all the media outlets took the line of thinking that gold ore is the same as gold extracted. A Money Control report was a little more specific about the discovery being ‘gold ore’ which gave a clue that the actual gold extracted would only be a fraction of the amount. However, like the others, the story here also stated that the discovery was five times India’s current reserve.", "Oblivious to the distinction between gold ore and actual gold mined, there was massive celebration on media as well as social media. Predictably, soon enough, the ruling party in the state was given credit for the discovery. “Yogi Adityanath strikes gold”, read a Financial Express headline which was extensively shared on social media crediting the Uttar Pradesh Chief Minister for the find.", "Yogi Adityanath strikes gold! 3,500-tonne goldmine found in Uttar Pradesh’s #Sonbhadra district https://t.co/8tIB01tdvL pic.twitter.com/Em4Zqh9z1d", "— Financial Express (@FinancialXpress) February 21, 2020", "Ironically, it was a Financial Express article that had earlier accurately reported on Feb 21st that the deposits had estimated gold reserves of 52,806 tonne and the inferred grade as 3.04 gram/tonne.", "The news made it to TV news shows in the most entertaining manner, devoid of any fact-check. From Aaj Tak calling India ‘phir sonay ki chidiya’ to ABP News describing the hillock that will change India’s fortunes forever, the TV channels went over the top in describing the find.", "Even though by that time, there was no tweet confirming the news from either the Ministry of Mines or the Geological Survey of India, Hardeep Singh Puri, Union Minister for Housing & Urban Affairs and Civil Aviation acknowledged the news and tweeted that India will now have the world’s 2nd largest gold reserves after the massive Gold discovery in Sonbhadra.", "UP Deputy CM KP Maurya went on to give media byte that the discovery will help in making India financially strong.", "UP Deputy CM KP Maurya on gold deposits found in Sonbhadra: This will help in making India financially strong. The state government is happy with this news. pic.twitter.com/MyERmHE5Qi", "— ANI UP (@ANINewsUP) February 22, 2020", "RBI Director, S. Gurumurthy, tweeted about the possibility of India controlling the world gold market.", "Yogi Adityanath strikes gold! 3,500-tonne goldmine found in Uttar Pradesh’s Sonbhadra district-https://t.co/ybcFnhQutU If this were true it is my 30 year dream come true. If India has 3500 tons of gold it will control the world gold market, decide the world gold prices too.", "— S Gurumurthy (@sgurumurthy) February 21, 2020", "However, it turned out that there was no such discovery of gold. “GSI has not estimated such kind of vast resource of gold deposits in Sonbhadra district”, GSI Director General (DG) M Sridhar told PTI.", "Geological Survey of India issued a press release, clarifying that the exploration was carried out in field season 1998-99 and 1999-2000 and stating that “the mineralised zone having an average grade of 3.03 grams per tonne of gold is tentative in nature and the total gold which can be extracted from the total resource of 52,806.25 tonnes of ore is approximately 160 kg and not 3,350 tonnes as mentioned in the media.”", "Since the exploration was carried out in 1998-2000, there is in fact no new discovery as reported by the media outlets. Alt News found that even an October 2011 report of the Ministry of Mines contained reference to this ‘discovery’ . The image below shows a reference to .053mt (million tonnes) which is the same as 53,000 tonnes and matches with 52,806.25 tonnes of ore in the GSI press release.", "It was amply clear that both media and social media users were confused between gold ore and actual gold mined. The proportion of gold contained in the ore of a particular mine is represented in grams per metric ton (g/t). According to the World Gold Council, better-quality underground mines contain around 8 to 10 g/t gold, marginal underground mines average around 4 to 6 g/t gold and open-pit mines range from 1 to 4 g/t gold.", "This means that even if the Sonbhadra gold deposit was of a high 10g/t grade, 3500 tonnes of gold ore would translate into 35 kgs of gold. The number however as clarified by GSI is actually 52,806.25 tonnes of ore which for the average grade of 3.03 g/t would potentially translate into 160kg of gold.", "It turns out that media outlets amplified the misinformation without even a basic fact check. They did not verify the gold ore quantity with past reports or any official GSI source. As a result, they not only got the number wrong but also considered gold extracted to be equal to the gold ore deposit. Using the same line of thinking as Postcard News founder, they added the entire amount to India’s gold reserves and declared that India would jump to second place in the world. They did not even question why such a massive discovery that would impact India’s gold reserves was made by a district mining officer and not the Head of GSI or the Minister of Mines himself.", "Donate Now", "Nobody's cheerleader, I tweet at @samjawed65", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]