["About this rating", "A U.S. postage stamp commemorates the Islamic holidays of Eid al-Fitr and Eid al-Adha.", "The stamp was created and issued long before Barack Obama became President, and it is not a \"Christmas\" stamp.", "The stamp described in the Example section above exists, although it is not new, it is not a \"Christmas stamp,\" and it has nothing to do with President Barack Obama.", "The EID stamp was a 2001 USPS Holiday Series stamp commemorating two Islamic holidays that have no connection to Christmas. It was introduced by the United States Postal Service (at the then-current 34-cent rate) as part of its Holiday Celebrations Series on 1 September 2001, just ten days before the September 11 terrorist attacks on New York and Washington. It has since been reissued (with varying background colors) at updated first-class postage rates in 2002, 2006, 2007, 2008, 2009, and as a Forever stamp after 2011.", "As the USPS describes the EID stamp:", "The Eid stamp commemorates the two most important festivals — or eids — in the Islamic calendar: Eid Al-Fitr and Eid Al-Adha. On these days, Muslims wish each other \"Eid mubarak,\" the phrase featured in Islamic calligraphy on the stamp. \"Eid mubarak\" translates literally as \"blessed festival,\" and can be paraphrased as \"May your religious holiday be blessed.\" This phrase can be applied to both Eid al-Fitr and Eid al-Adha.", "The word \"eid\" is roughly equivalent to the English word \"celebration\" or \"festival.\" The three-day Eid Al-Fitr celebrates the end of the month-long fasting of Ramadan; the three-day Eid Al-Adha commemorates the willingness of the Prophet Abraham to sacrifice his son Ishmael in response to God's command*, and it marks the end of Hajj, the annual Muslim pilgrimage to the holy city of Mecca. (In 2016, Eid Al-Fitr begins at sundown on July 6, and Eid Al-Adha commences at sundown on September 12.)", "The EID commemorative is often mischaracterized as a \"Christmas stamp,\" but it has nothing to do with Christmas other than that it is part of a series of U.S. postage stamps commemorating several diverse celebrations, some of which generally occur around the November-December \"holiday season\" timeframe (Christmas, Hanukkah, Kwanzaa, Thanksgiving), some of which occur at other times of year (Cinco de Mayo), and some of which move around from year to year relative to the Gregorian calendar (Eid Al-Fitr and Eid Al-Adha).", "The statement \"[Muslims] don't even believe in Christ and they're getting their own Christmas stamp!\" is therefore nonsensical, akin to protesting Hanukkah stamps because \"Jews don't even believe in Christ but they have their own Christmas stamp!\" (Although Muslims do not believe that Jesus was the son of God, Islam does regard him as a prophet, a mortal who was divinely chosen to spread God's message.)", "An August 2009 version of the \"Muslim stamp\" e-mail added the claim that \"President Obama has directed the United States Postal Service to REMEMBER and HONOR the EID MUSLIM holiday season with a new commemorative 42 Cent First Class Holiday Postage Stamp.\" This statement is manifestly false: The EID stamp was introduced in 2001, eight years before Barack Obama became President of the United States, and USPS stamp designs are chosen by the Citizens' Stamp Advisory Committee (CSAC) and not by U.S. presidents.", "The issue of \"boycotting\" a stamp that commemorates Islamic holidays is largely moot, since EID stamps are generally a specialty item sold mostly to postal customers who specifically request them. Moreover, the EID stamp is an ordinary first-class postage stamp; all proceeds from its sale go to the USPS, not to any Muslim-related groups or organizations.", "The EID stamp is also not the first or only governmental or commercial recognition of these Islamic holidays in the U.S. The American greeting card manufacturer Hallmark has produced a variety of holiday cards celebrating Eid al-Fitr, and President Obama's predecessor in the White House, President George W. Bush, extended official greetings, issued messages, participated in commemorations of both Eid al-Fitr and Eid al-Adha (even after the September 11 attacks), and promoted the EID stamp via the White House web site.", "Variations:   The following images have been circulated as pictures of the USPS \"Muslim\" stamp (or as an \"Arabic Valentine's Day stamp\"), but neither depicts the Eid stamp: the former is a non-USPS custom stamp ordered through the Zazzle web site, and the latter is one of the USPS's 2013 Kaleidoscope Flowers series:", "(*This is the reverse of Judeo-Christian tradition, which holds that Abraham was commanded by God to sacrifice not Ishmael but his other son, Isaac.)", "The Associated Press.   \"Muslim Stamp Reissued at New Rate.\"\r\n    28 September 2007.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]