["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Democratic state lawmakers held a news conference at Milwaukee Area Technical College on Oct. 23, 2013, to announce a proposal to help Wisconsinites refinance their student loan debt.", "Financial aid for college has gotten its share of attention around Wisconsin during 2014, and moreso in the days leading up to the Nov. 4, 2014 gubernatorial election.", "When U.S. Sen. Tammy Baldwin, D-Wis., said college students on average are graduating with $30,000 in student loan debt, we rated her claim Half True. Some reliable data indicated the figure is accurate, but other figures suggested it might be lower.", "And when U.S. Sen. Ron Johnson, R-Wis., claimed the affluent are taking advantage of student loans at the expense of middle-class families, our rating was Mostly False. He overstated the problem on both ends.", "In the governor’s race, Democratic challenger Mary Burke has said easing student loan debt is one of her priorities. Her claim that there are 41,000 people on a waitlist for financial aid for Wisconsin technical colleges and universities earned a Mostly True. The number wasn't totally firm, but pretty solid.", "Meanwhile, Republican Gov. Scott Walker has touted his tuition freeze at University of Wisconsin System schools rather than discussing college financial aid.", "But on Oct. 27, 2014, the liberal Greater Wisconsin Committee, which has run TV ads criticizing Walker, released another ad making this claim:", "\"Scott Walker opposed a plan to help Wisconsin students refinance their student loans.\"", "Let’s see.", "Refinancing proposals", "It turns out the Greater Wisconsin Committee doesn’t have any proof that Walker opposed a state proposal to help students refinance student debt.", "Rather, the group contends that since Walker didn’t speak, or take action, in favor of the plan proposed by Democrats, he opposed it.", "Walker \"has had every opportunity to show support for this legislative proposal. He specifically chose not to express support and has instead avoided the topic altogether,\" the group’s executive director, Rich Judge, told us in an email.", "Judge referred to legislation announced in October 2013 to create a state student loan refinancing authority. Legislative committee hearings were held on the proposal in February 2014.", "But no votes were ever taken by a committee or the full Legislature, so the issue never reached Walker’s desk.", "Judge also noted that Walker refused an April 2014 request from Democrats to hold a special session of the Legislature. But he noted that request was to take up not only the refinancing proposal but a number of other bills, as well.", "Finally, Judge cited a September 2014 news article in the Green Bay Press-Gazette about a Walker campaign appearance.", "Walker did not speak specifically about student loan debt during the stop, but did say he prefers controlling tuition over government-subsidized financial aid, the newspaper reported. Walker was quoted as saying: \"We know it's not just about providing more financial assistance, it's about providing a great price for a UW education that's low to begin with.\"", "But none of the above shows opposition by the governor to the refinance proposal.", "We found another September 2014 news article, in the Racine Journal Times. That article reported that Walker said he would be willing to look at measures like the refinancing bill, but questioned whether the proposal is \"more than just politics\" because Democrats had not enacted it when they controlled the Legislature and the governor’s office prior to his election in 2010.", "\"If it was a good idea, I’m sure they would have passed it four years ago when they controlled the Assembly and the Senate and the governorship,\" Walker was quoted as saying in response to questions from reporters. \"They not only did not do it then, they presided over a state government that saw 5.5 percent average annual increases in tuition.\"", "Walker certainly isn’t declaring support for the refinancing authority, but he isn’t stating opposition, either.", "Our rating", "The Greater Wisconsin Committee says Walker \"opposed a plan to help Wisconsin students refinance their student loans.\"", "The group acknowledged it has no evidence that Walker opposed a 2013 Democratic proposal to create a state student loan refinancing authority. Walker may not support the idea, but he hasn’t fought it, either -- as the group claimed.", "We rate the statement False.", "YouTube, Greater Wisconsin Committee, student loan ad, Oct. 27, 2014", "Email interview, Greater Wisconsin Committee executive director Rich Judge, Oct. 28, 2014", "Isthmus, \"The student debt issue could decide the 2014 election,\" May 22, 2014", "Green Bay Press-Gazette, \"Tuition freeze ignores student loan debt crisis,\" Sept. 21, 2014", "Green Bay Press-Gazette, \"Walker pushes UW tuition freeze, downplays deficit,\" Sept. 10, 2014", "Milwaukee Journal Sentinel, \"Why Scott Walker will not act on student loan debt,\" Sept. 15, 2014", "Milwaukee Journal Sentinel, \"Bill sponsored by Wisconsin Democrats would ease student loan debt,\" Oct. 23, 2013", "Racine Journal Times, \"Walker highlights tuition freeze in Parkside stop,\" Sept. 10, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]