["The photo was posted here on Facebook on March 4, 2021.", "“A man from Oregon, US, is jailed and fined $1500 for collecting rainwater for everyday use,” reads the Indonesian-language text superimposed on the photo. “The reason the police arrested him because ‘rainwater is the state’s property’.”", "The picture has been shared alongside a similar claim on Facebook here, here, here and here; as well as on Instagram here and here.", "However, the claim is misleading.", "A Google reverse image search followed by subsequent keyword searches found the picture in the misleading post was posted here on a report by American news portal AOL on August 14, 2012, headlined: “Gary Harrington of Oregon Jailed for Illegal Rainwater Reservoirs on His Property.”", "The first two paragraphs of the report reads: “An Eagle Point, Ore., man has begun serving a 30-day jail sentence after he built three reservoirs on his property to collect rainwater -- an apparent violation of a state law that says all water is publicly owned.", "“Gary Harrington (pictured above) has collected nearly 13 million gallons of water in his reservoirs (one of which is pictured below). That's enough to fill 20 Olympic-size swimming pools. But two weeks ago, he was found guilty of breaking the 1925 Oregon law against private water collection. He was sentenced to 30 days in jail and issued a $1,500 fine.”", "Eagle Point is a city in Jackson County, Oregon.", "Below is the screenshot comparison between picture in the misleading post (L) and the photo in the AOL report (R):", "The Oregon Department of Justice published a press release about the case on July 27, 2012, here.", "According to the press release, Harrington “stored and used water illegally by placing dams across channels on his property and preventing the flow of water out of these artificial reservoirs without obtaining a water right permit. The height of each dam varies; two dams stand about ten feet tall [3 meters] and the third stands about 20 feet tall [6 meters].”", "It is also said: “These man-made reservoirs feature boat docks, boats, and were stocked by Harrington with trout and Bluegill for recreational fishing.”", "Rainwater is not a property of the state as claimed in the misleading post.", "The Oregon Water Laws section 537.110, page 44, stipulated that: “All water within the state from all sources of water supply belongs to the public.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]