["About this rating", "In November 2020, videos and photographs purportedly showing a bright purple sky in Sweden started circulating on social media:", "These are genuine images showing a purple sky over the town of Trelleborg, Sweden, in late November 2020. This visual may bring about thoughts of some sort of natural phenomena, but the culprit behind these purple skies is actually a nearby tomato farm.", "SVT, Sweden's national public television company, reported on Nov. 24 that these purple skies appeared after a new energy-saving LED system was installed at a tomato farm in nearby Gislöv. The lights were meant to extend the farm's growing season, but they had an unexpected side effect: purple skies.", "SVT writes:", "A light phenomenon amuses and worries the inhabitants of Gislöv's location. A strong purple light that now the environmental manager in Trelleborg has on his table.", "Tomato cultivation outside Gislöv's location in southern Skåne is one of Sweden's largest and has changed lighting to more energy-saving LED lamps with a new purple glow that should be good for the plants. The lamp system also extends the growing season.", "While the images above may appear eerily beautiful when viewing them online, the residents of Trelleborg weren't thrilled about the light pollution. Alfred Pedersen & Son, the company that owns the farm, said that it did not intend to anger the local residents and that it was working on a solution for the lights. For the moment, the company said that it would stop using the lights at night.", "Here's a video from TRT World showing these purple skies in Sweden:", "This tomato farm, of course, is not the first to install powerful LED lights to aid the cultivation of its plants. And the residents of Trelleborg are not the first to deal with these neon-colored skies. Here's an excerpt from a 2017 NPR report about a similar problem in New England:", "\"We love sun,\" says LaDue. \"We expect with our location, latitude and longitude in this part of the country, we should be able to get about 80 percent of our light requirements from the sun.\"", "And the other 20 percent? That comes from high-powered grow lights.", "Lights that — because of shorter winter days — LEF Farms has been running after the sun sets. The problem is, when you turn on lights in a room made of glass, the light doesn't stay inside that room.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]