["About this rating", "Erwin Perzy, an Austrian surgical instruments mechanic, created one of the first snow globes in 1900 while attempting to fashion a brighter light bulb.", "The first snow globes predate Perzy's invention by two decades.", "In December 2020, with the holiday season just around the corner, an interesting tidbit about the ubiquitous snow globe ornament was circulated on social media:", "[Today I Learned] that snow globes were accidentally invented by a medical tool repair man. He was trying to make a brighter light bulb for operating rooms, so he tried using a water filled glass with reflective particles to do this. The effect looked like snow to him which is how he got the idea for snow globes.", "This is an honest anecdote about the invention of the snow globe. However, it's not the entire story.", "The above-displayed message refers to Erwin Perzy, an Austrian surgical instruments mechanic who accidentally created one of the first snow globes in 1900 while he was attempting to improve the brightness of a lightbulb, as the BBC reported in 2013:", "The 57-year-old Austrian is the grandson of the man widely acknowledged as the inventor of the snow globe. His grandfather, the first Erwin Perzy, came up with the idea by accident in 1900.", "Mr Perzy I, a surgical instruments mechanic, accidentally created the first snow globe in 1900 as a result of an experiment to try to improve the brightness of the newly invented -- and then not very bright -- electric light bulb.", "He was inspired by the shoemakers of the time, who to get more light from a candle mounted a glass globe filled with water in front of the flame. This gave them a light spot the size of a hand.", "This was the principle that Mr Perzy I wanted to re-create in front of a light bulb, but found that it did not work very well.", "His grandson picks up the story: \"And one day he found a white powder, semolina, used for baby food. And he poured it into the glass globe, and it got soaked by the water and floated very slowly to the base of the globe. This effect reminded him of snowfall.", "\"And this was the very first, the basic idea for inventing a snow globe.\"", "Perzy would eventually start selling these snow globes via his company, Original Vienna Snow Globes, which is still in operation today. Here's a video of Perzy's grandson, who currently runs the operation, talking about his grandfather's legacy:", "https://youtu.be/pm7YB749LOs", "While Perzy may have accidentally stumbled upon the idea for the snow globe, he wasn't the first to come up with the concept. In fact, records indicate that these ornamental displays were around at least two decades before Perzy's \"invention.\"", "A report from United States Commissioners detailing the exhibits at the Paris Universal Exposition in 1878 described one snow globe displayed there:", "\"Paper weights of hollow balls filled with water, containing a man with an umbrella. These balls also contain a white powder which, when the paper weight is turned upside down, falls in imitation of a snow storm.\"", "While images of this 1878 snow globe do not appear to exist, we did find a photograph of another snow globe displayed at the 1889 Paris Universal Exposition. The following photograph from the Bergstrom-Mahler Museum of Glass shows \"one of the first water globes, or snow globes\" that was introduced as a \"souvenir at the 1889 Exposition Universelle (world's fair) in Paris by the famous postcard editors Léon & Levy\":", "According to the Bergstrom-Mahler Museum of Glass, this snow globe was made of ceramic and glass and stands about 3 inches tall.", "In the United States, the snow globe ball didn't start rolling until 1927 when Joseph Garaja of Pittsburgh, Pennsylvania, filed a patent for an ornamental paper weight. While Garaja's design did not feature a holiday display — rather, it showed fish floating in seaweed — the Pittsburgh Post-Gazette wrote that Garaja's method of constructing the snow globe entirely underwater \"revolutionized the snowdome industry\":", "Garaja's process, which involved assembling the globes entirely underwater, revolutionized the snowdome industry. They went from being expensive mementos individually crafted by skilled artisans to items that could be cheaply mass-produced and sold.", "The rest is history. Suddenly, inexpensive snowdomes were everywhere, especially once manufacturers such as Garaja perfected the techniques of making globes out of plastic.", "Here's an image of Garaja's patent:", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]