["About this rating", "In early 2021, Snopes readers asked us to look into the accuracy and origins of a story shared widely on social media that described a heartwarming episode in the later life of the novelist Franz Kafka.", "The Facebook and Twitter posts typically began as follows:", "At 40, Franz Kafka (1883-1924), who never married and had no children, walked through the park in Berlin when he met a girl who was crying because she had lost her favourite doll. She and Kafka searched for the doll unsuccessfully.", "The story describes how Kafka consoled the girl by bringing her letters, supposedly written by the doll, recounting her exciting adventures around the world. Eventually, the story goes, Kafka brought her a different doll, passing it off as the original one. Kafka dies, and years later the girl, now a woman, finds a note hidden inside the doll given to her by Kafka. It reads:", "\"Everything you love will probably be lost, but in the end, love will return in another way.\"", "The story, in several versions, has a venerable history dating back more than half a century and was first recounted by a source very close to Kafka himself — his partner for the final year of his life, Dora Diamant. However, despite the enthusiastic efforts of several Kafka experts and researchers, concrete proof — for example copies of the \"doll\" letters themselves — has never been found.", "As such, it remains \"Unproven,\" but some experts have written that its core claims are plausible.", "Kafka, the renowned author of significant novels including \"The Metamorphosis\" and \"The Trial,\" was born in Prague, in what is now the Czech Republic, in July 1883. He died in Austria in June 1924 at age 40. A year earlier, he met the 25-year-old Dora Diamant, from Poland, and the couple lived together in Berlin until March 1924 — the period during which the \"doll\" episode is purported to have taken place.", "The vignette has enjoyed waves of popularity on social media in recent years and saw a resurgence in February and March 2021, prompting inquiries from Snopes readers. One especially influential iteration of it came in October 2011, when the psychoanalyst and writer May Benatar recalled the story in a column for HuffPost. That piece appears to have been the original written source of the wording of the final, touching message from Kafka: \"Everything you love will probably be lost, but in the end, love will return in another way.\"", "Paul Auster included the doll story in his 2005 novel \"The Brooklyn Follies,\" and it inspired the March 2021 graphic novel \"Kafka and the Doll\" by Larissa Theule and Rebecca Green.", "In 1982, Ronald Hayman mentioned the doll story in his biography of Kafka, and in 1984, the literary critic Anthony Rudolf published a version of the story, translated from French, in the literary supplement of the Jewish Chronicle. Rudolf prefaces the tale by describing it as a \"simple, perfect and true Kafka story,\" which Diamant had originally relayed in person to Marthe Robert, a French Kafka translator, in the early 1950s.", "The Robert/Rudolf version of the story can be read in full below and here. In this version, there is no replacement doll, no reunion with the little girl, and no heartwarming discovery of a note a year later. Rather, after writing a letter every day \"for at least three weeks,\" Kafka eventually ended the episode by informing the little girl (in the persona of the doll), that she was to be married and begin a new life with her husband: \"You yourself will understand, we must give up seeing each other.\"", "However, according to the Irish-American Kafka scholar and translator Mark Harman, Diamant told a slightly different version to Max Brod, the novelist's lifelong friend and the executor of his estate. That version, according to Harman, included an ending in which Kafka, in order to further comfort the little girl, did indeed provide her with a replacement.", "In 2001, while living and working in Berlin, Harman himself searched for evidence to substantiate the doll story, but nothing concrete emerged. He recounted his quest in a 2004 essay in the New England Review, outlining several possible explanations for the story and the absence of corroborating evidence so far:", "As I had half-anticipated all along, nothing much came to the surface. Why, despite several searches, of which mine was only the latest, have no witnesses to the doll story ever materialized? One obvious hypothesis is that Dora Diamant simply made up the incident. However, it seems unlikely that she would just have invented this encounter in the park. The details about the incident and the doll story itself sound authentic, and, though Dora had an exalted, mystical streak ... she had too high an opinion of Kafka to engage in any such fabrication. Besides, what motive would she have had?", "So what happened to the little girl and the doll letters? As is often the case with Kafka, there are multiple possibilities. The little girl may have died many years ago, or been traumatized by later events, or perhaps even been Jewish and been killed during the Holocaust. As for the letters themselves, there is a remote possibility that they could still surface.", "Kafka may not have given them to the little girl to keep or he may have held on to copies. We know that Dora Diamant burned quite a few manuscripts on Kafka's instructions, and it is possible that the doll letters also went up in flames. However, she did not destroy as many manuscripts as she initially claimed...", "In spring 1933 the Gestapo raided a Berlin apartment where she was living with the man she subsequently married, Ludwig Lask, a German Communist leader, they carted off a number of Kafka manuscripts, including, possibly, the doll letters. Dora sought help from Brod, who contacted the Prague poet Camill Hoffmann, then cultural attaché at the Czech embassy, who tried to intervene but was told by the Gestapo that there was no hope of recovering any such manuscripts from the mass of confiscated material. Perhaps they're still lurking somewhere in a former East German or perhaps even Russian archive along with other manuscripts from Kafka's stay in Berlin.", "Whether or not the story of Kafka and the doll is factually accurate, embellished, or a complete fabrication is not yet clear. Nonetheless, it continues to provide comfort and encouragement to millions, decades later, in the face of grief and loss. In her 2011 column, May Benatar described it as a \"healing story,\" adding that:", "\"For me there are two wise lessons in this story: Grief and loss are ubiquitous even for a young child. And the way toward healing is to look for how love comes back in another form.\"", "It could also be that the story of Kafka's kindness and compassion provide, for the wider global audience, the same service that the letters themselves do for the little girl in the park — consolation through storytelling, regardless of accuracy. Tom Glass, the character who tells the tale in Paul Auster's novel \"The Brooklyn Follies,\" describes the profound effect of the fake letters on the girl:", "By that point, of course, the girl no longer misses the doll. Kafka has given her something else instead, and by the time those three weeks are up, the letters have cured her of her unhappiness. She has the story, and when a person is lucky enough to live inside a story, to live inside an imaginary world, the pains of this world disappear. For as long as the story goes on, reality no longer exists.", "[Correction] 25 May, 2021: Dora Diamant was born in March 1898, and was therefore 25 years old, not 19 years old, when she and Kafka met in 1923.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]