["The video was shared here on South Korean social media platform Naver Band on January 13, 2021.", "The Korean-language caption claims the video shows “the condition of a teenager after the Covid-19 vaccination.”", "“She is experiencing a convulsion and severe dyspnoea,” it reads in part. “She is unconscious and has a seizure every 20 seconds.”", "The video was also shared alongside similar claims on Facebook here and Naver Blog here.", "However, the claim is false.", "A reverse Google image search found that the footage was published on YouTube here on March 21, 2015, nearly five years before the Covid-19 pandemic began.", "Below is a screenshot comparison between the video shared in the misleading posts (L) and the video published on YouTube in 2015 (R):", "Radio Free Europe/Radio Liberty (RFE/RL) also reported on the video here on March 20, 2015. The Russian-language article, which features screenshots from the footage, states that the video shows a girl in the Kazakh city of Zhanaozen who was admitted to a hospital after getting vaccinated against measles.", "Citing a local health official, RFE/RL reported that the video was filmed in March 2015. The official added that the health authorities did not attribute her condition to the vaccine, RFE/RL reported.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]