["Fox News host Gretchen Carlson reports on a new report about the Affordable Care Act and employment.", "Ever since the Affordable Care Act passed, Republicans and conservative talk show hosts labeled it as a job killer and in their view, the latest economic report proves their point.", "The Congressional Budget Office, the nonpartisan number crunchers for Congress, estimated that 10 years from now, there would be about 2.5 million fewer workers than there otherwise would be. How was that conveyed by the pundits?", "\"The CBO now says the president's health care law will cut the number of full-time jobs in the United States by 2.3 million by 2021,\" said Gretchen Carlson of Fox News. In the interview that followed, interrupted by a live briefing on the report from the White House, Carlson noted that much of the change stems from people deciding not to work.", "Carlson then went onto interview U.S. Rep. Jason Chaffetz, R-Utah, where they discussed workers who have a difficult time finding full-time work.", "But Carlson’s statement is missing an important distinction that the CBO report makes between workers and jobs. (And it’s a mistake we’ve spotted before.) Carlson makes it sound as if jobs are going away because businesses don’t create them or they eliminate existing jobs. The CBO report, though, was referring to workers who decide on their own to leave the workforce.", "Here are the key quotes from the report:", "\"CBO’s projections of hours worked represent a decline in the number of full-time-equivalent workers of about 2.0 million in 2017, rising to about 2.5 million in 2024.\"", "\"The estimated reduction stems almost entirely from a net decline in the amount of labor that workers choose to supply, rather than from a net drop in businesses’ demand for labor.\"", "The government analysts basically figured that millions of people will decide they don’t need to work as much because the law makes health insurance more affordable.", "\"It will not represent an increase in either the unemployment rate or the number of unemployed workers,\" said Gary Burtless, an economist at the Brookings Institution, a Washington-based academic research center. \"Workers who now have access to less expensive health insurance through Medicaid or with refundable federal tax credits that help them pay for premiums will not want to work such long hours after the ACA becomes fully implemented.\"", "For economist Jeffrey Clemens at the University of California - San Diego, this result is no surprise. The law gives most of its assistance to people making less money.", "\"Subsidizing insurance for low-income households, and providing Medicaid to the poor, involves reducing the returns to work. As earned income rises, the benefits phase out,\" Clemens said.", "The CBO report tracks with that, noting that the voluntary decisions to leave the workforce would be concentrated among lower-paid jobs.", "Another key point: The CBO did not specify how many of the 2 million figure would include actual full-time positions, as compared to cases of an employee keeping a job but working fewer hours, keeping one job but quitting a separate, part-time job, or leaving the workforce.", "And to be clear, the report predicts that total employment will rise. It just won’t rise as much as it would if the health care law did not exist.", "A drop in the number of people who feel they need to work actually could even be a boon to those who remain in the labor force, especially with relatively high unemployment.", "\"Unemployed workers who really need to find jobs to support their families, rather than to obtain health coverage, will find it easier to get jobs,\" said Burtless. \"After all, they will not face as much competition from the workers who were mainly remaining in the labor force to get a job with health coverage.\"", "Still, the CBO expects the current unemployment rate to remain elevated; it won’t drop below 6 percent until 2017.", "This is not to say there are no downsides woven into the CBO projections. The labor force participation rate is expected to decline, putting a larger burden on those who remain working.", "\"Bigger implicit and explicit tax distortions are reducing productive economic activity,\" said Alan Auerbach, an economist at the University of California - Berkeley.", "As the economy returns to full employment, Burtless expects that there would be a shortage of low-wage workers.", "\"The remaining taxpayers will have to pay slightly higher taxes to finance public health insurance subsidies than they would otherwise have to pay if the work hours of low-wage workers remained unchanged,\" Burtless said.", "Ultimately, it boils down to a tradeoff, said Tara Sinclair, a George Washington University economist.", "\"Admittedly there are some touchy issues with the government potentially paying or subsidizing the health care costs for people who could work but choose not to,\" Sinclair said. \"But overall I think separating health care from employment, at least making it like any other service where employment may provide the money to pay for it but where we work doesn't determine our choices, is a good thing.\"", "Our ruling", "Carlson said that the CBO predicts that Obamacare will cut the number of full-time jobs by 2.3 million. The word \"cut\" sends the message that jobs are being taken away, but that's not the case. On top of that, the statement confuses the number of jobs with the number of workers, and more specifically, the number of hours worked. The CBO said the health care law will give more people an incentive to reduce their hours; some will limit their hours and some will stop working altogether by their own choice. The law would not push up unemployment.", "It can be easy to miss the distinction between jobs and workers, but the statement remains flawed. We rate the claim Mostly False.", "Fox News, The Real Story, Feb. 4, 2014", "Congressional Budget Office, The budget and economic outlook: 2014 to 2024, Feb. 4, 2014", "Washington Post, No, the CBO did not say Obamacare will kill 2 million jobs, Feb. 4, 2014", "PolitiFact, Michele Bachmann says Obamacare will kill 800,000 jobs, June 14, 2011", "Forbes, White House: It's A Good Thing That Obamacare Will Drive 2.5 Million Americans Out Of The Workforce, Feb. 5, 2014", "Washington Post, Yes, Obamacare will probably downsize the workforce. Economists explain why, Feb. 5, 2014", "Email interview, Gary Burtless, economist, Brookings Institution, Feb. 4, 2014", "Email interview, Jeffrey Clemens, economist, University of California - San Diego, Feb. 4, 2014", "Email interview, Alan Auerbach, economist, University of California - Berkeley, Feb. 4, 2014", "Email interview, Tara Sinclair, economist, George Washington University, Feb. 5, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]