["The image was shared in this Facebook post on October 20, 2020.", "The Hindi-language text in the photo translates to English as: “Just before elections in Bihar, she has come out in the attire of her grandmother but she won't get anything in elections.”", "The woman in the photo is Priyanka Gandhi, the general secretary of the Indian National Congress party.", "The mention of “her grandmother” is a reference to former Indian prime minister Indira Gandhi.", "Elections are due to be held in the east Indian state of Bihar from October 28 to November 7, 2020.", "The same photo was also published here, here and here on Facebook, and here on Twitter, alongside similar claims.", "The claim, however, is false; this photo of Priyanka Gandhi dates back to 2009. It was taken during an election campaign in the north Indian state of Uttar Pradesh.", "A combined reverse image and keyword search on Google found the original photo published here on April 12, 2009 on Flickr, a photo and video hosting website.", "The caption reads: “Priyanka gandhi at durga temple during the election campaign for her brother rahul gandhi in amethi on sunday.Pressbrief.In.”", "Pressbrief.in is a website that hosts photo and video collections of Indira Gandhi, Sonia Gandhi, Rahul Gandhi and Priyanka Gandhi.", "Rahul Gandhi, a Congress party leader, contested for a seat in Uttar Pradesh's Amethi constituency in the 2009 Indian elections.", "Below is a screenshot comparison of the photo in the misleading Facebook post (L) and the Flickr photo (R):", "More photos of Priyanka Gandhi's visit to the temple in 2009 can be found here on the Pressbrief.in Flickr page.", "An AFP photographer also captured this photo of Gandhi at the same temple visit in 2009.", "Below is a screenshot of the AFP photo:", "The caption states: “Priyanka Gandhi Vadra smiles as she leaves a Durga Temple during an election campaign for her brother Rahul Gandhi, Congress general secretary in Amethi on April 12, 2009. Indian voters are set to go to the polls in five phases across the country for general elections from April 16-May 13.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]