["By Vanessa Schipani", "Posted on September 21, 2017", "Environmental Protection Agency head Scott Pruitt criticized former President Barack Obama for leaving 40 percent of Americans with air quality that doesn’t meet EPA standards. By some measures, this is true. But a report Pruitt’s office cited as evidence said there had been a “major improvement” in air quality under Obama.", "The American Lung Association’s 2017 air quality report does say that 38.9 percent of the population was breathing “unhealthy air,” based on EPA data from 2013 to 2015 for two of the most common air pollutants. However, that figure is down from 58 percent of the population before Obama took office.", "Pruitt also failed to mention that the Obama administration updated the standard for four out of the six air pollutants that the EPA regulates under the Clean Air Act, one of which hadn’t changed since the early 1970s, when the act was first put into law.", "Pruitt made his claim on Sept. 11 during an interview with the Washington Examiner:", "Pruitt, Sept. 11: Everybody looks at the Obama Administration as being the environmental savior. Really? He was the environmental savior? He’s the gold standard, right? He left us with more Superfund sites than when he came in. Air quality standards, 40 percent of the country, nonattainment.", "This isn’t the first time Pruitt has criticized Obama’s environmental record. In May, he cited the same 40 percent figure on Hugh Hewitt’s radio show, adding, “What exactly did [the Obama administration] accomplish for the environment that folks are so excited about?”", "Pruitt has a right to his opinion that the Obama administration shouldn’t be the “gold standard” for environmental protection. But he cites a statistic — that 40 percent of Americans live in nonattainment areas — without providing any context. In fact, there’s evidence of improvement in air quality under Obama.", "(Pruitt also isn’t telling the whole story when it comes to Obama’s action on Superfund sites, which are areas that have been contaminated by hazardous waste. The EPA identifies these sites for cleanup when they could impact human health or the environment. But we’ll be explaining the ins and outs of that issue in a future article.)", "There are a number of different ways to evaluate whether air quality has gotten better or worse over time. Let’s start with the most straightforward — did the concentration of air pollutants go up or down during President Obama’s tenure?", "Between 2010 and 2016, which makes up the bulk of his presidency, the concentrations of all six air pollutants the EPA monitors decreased, some by as much as 77 percent. This makes sense, because cars, power plants, factories and other sources decreased emissions of these pollutants during this same period.", "However, emissions haven’t decreased just during this period — they’ve been decreasing since the inception of the Clean Air Act in 1970.", "Under the Clean Air Act, the EPA regulates carbon monoxide, lead, nitrogen dioxide, ground level ozone, particle pollution and sulfur dioxide. Each of these pollutants pose a risk to human health, the environment or both.", "Particle pollution, for example, gets into the air via smokestacks, fires and other sources and can cause both respiratory and heart issues. It can also reduce visibility and damage forests, crops and water sources.", "Unlike particulate matter, ground level ozone isn’t emitted directly into the air. It’s created when pollutants from cars, power plants and other sources react to sunlight. Ground level ozone shouldn’t be confused with the ozone layer in the upper atmosphere, which protects the planet from the sun’s ultraviolet rays.", "These two pollutants are the most widespread, according to the American Lung Association.", "Another metric for air quality is the percentage of people in the country exposed to concentrations of air pollutants above the EPA’s standards. That’s what Pruitt means by 40 percent “nonattainment.” By this measure, air quality also improved under Obama.", "When we reached out to the EPA for comment on Pruitt’s claim, agency spokeswoman Liz Bowman said he was “primarily” referring to ozone when he said the country is at 40 percent nonattainment.", "Specifically, Bowman referred us to the page on the EPA’s website that gives regional and population-based nonattainment estimates for ozone’s older 2008 standard – which was strengthened by Obama along with the standards for nitrogen dioxide, particle pollution and sulfur dioxide. It wasn’t clear to us how data based on an outdated standard supported Pruitt’s claim. We asked for clarification, but she has yet to respond.", "Number of People (in millions)*", "Bowman also referred us to the American Lung Association’s 2017 air quality report that found that, between 2013 and 2015, 38.9 percent of the population — or about 125 million people — lived in areas with air that didn’t meet the EPA’s current standards for particle pollution or ozone (see table to left).", "However, that report says there had been a “major improvement” in air quality under Obama.", "According to the association’s 2010 report, between 2006 and 2008, before Obama took office in 2009, about 58 percent of the U.S. population — an estimated 175.3 million people — lived in areas where the levels of these two pollutants were worse than the EPA’s standards.", "That’s an estimated 50 million fewer people living in nonattainment areas during Obama’s second term than before he took office.", "The association attributes the lion’s share of these improvements “to cleaner power plants and increased use of cleaner vehicles and engines.”", "Obama lowered the acceptable concentration of ozone in the air in 2015, and the American Lung Association began using the more strict standard on ozone in its 2016 report – even though that report covered 2012-2014. This initially increased the number of people living in nonattainment areas, but the figure then dropped. “One-quarter fewer people now live where the air quality hit unhealthy levels in 2013-2015 than in the 2016 report,” the ALA said in its most recent report.", "During his presidency, Obama also finalized rules to increase fuel efficiency standards for vehicles. Higher fuel efficiency leads to less emissions, which contribute to both ozone and particle matter pollution. The average EPA city/highway sticker mileage of light duty vehicles sold rose from 21 miles per gallon in January 2009, when Obama took office, to 25.1 mpg by the time he left, according to the Transportation Research Institute of the University of Michigan.", "However, President Donald Trump said in March that he may roll back some of these Obama-era rules. At that time, Pruitt said he supported the review of Obama’s standards, calling them “costly for automakers and the American people.”", "Despite improvements in air quality, the American Lung Association concluded in 2017 that “too many people in the United States live where the air is unhealthy for them to breathe.”", "Pruitt has repeatedly criticized Obama on air quality issues. As we already mentioned, he made similar claims on Hugh Hewitt’s radio show back in May.", "In February, Pruitt also criticized Obama for being “so focused on climate change and so focused on CO2” that “other priorities were left behind.” These other priorities included “air quality issues and water quality issues that cross state lines.”", "But it’s worth mentioning that the American Lung Association reports have emphasized that climate change will hinder efforts to further improve air quality.", "In fact, the association attributes the 5 percent increase in the population exposed to “unhealthy” levels of ozone or particle pollution between its 2013 and 2014 reports (see table above) primarily to “warmer temperatures” worsening ozone levels. “Sunlight and heat create conditions that increase the risk of high ozone levels,” the association explains.", "As we said, Pruitt is entitled to his opinion of Obama’s environmental record. But Pruitt cited a statistic without context, and the evidence shows air quality actually improved under Obama.", "Editor’s Note: SciCheck is made possible by a grant from the Stanton Foundation.", "FactCheck.org Rating:", "Read More", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]