["“Nigerian man stoned to death by a South African and his car destroyed. Watch till the end. #saynotoxenophobia,” reads the caption on one Facebook video of the incident, which has been shared more than 350 times since it was posted on September 3.", "The video has also been shared more than 80 times via a Facebook post accompanied by a poem about anti-immigrant violence.", "“Mother Africa is Thirsty, Quenched wt the blood of Mozambiquens Blood of Nigerians Tender blood of Zimbabweans,” reads part of the poem. “Johannesburg is Bleeding.”", "Using InVid, an online tool which allows users to isolate and analyse key frames from videos, we were able to track down another video of the incident, filmed from a different angle. Various features are recognisable, such as the man in the green shirt standing next to the white car.", "This video was posted on Twitter on August 5, a month ago -- proving that the incident was not part of the recent deadly unrest in Johannesburg, which broke out on September 1.", "In both videos, a street name is visible -- Anderson Road. A basic internet search of “Anderson Road stoning” led us to this local media report about the incident in Menlo Park, a suburb of Pretoria. The report was dated August 3 -- two days before the tweet was posted.", "According to the report, two suspected robbers were attacked with stones by an angry mob. There was no reference to the men’s nationality.", "We’ve contacted Pretoria police to ask for more information about the stoning attack. But we do know that this video is not recent, and there is as yet no evidence that the incident it shows was linked to immigration.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]