["Among the top Twitter trends on February 25 were ‘mosque’ and ‘Rana Ayyub’. The words gained traction after the journalist shared a video of a mob chanting “Jai Shri Ram” and “Hinduon ka Hindustan” planted a saffron flag atop a mosque in Delhi. Ayyub later took down the video after Tehseen Poonawala claimed that it is unrelated to protests against the Citizenship Amendment Act (CAA). Ayyub has now posted the video again after confirming its authenticity.", "Re-posting this video after verifying its authenticity. It is from Delhi. Men marching on top of a mosque, vandalising it and placing a saffron flag over it. pic.twitter.com/bScgJMxKc3", "— Rana Ayyub (@RanaAyyub) February 25, 2020", "Poonawala, in response, attached a statement by DCP North West, Delhi which says that no mosque has been damaged in Ashok Vihar area.", "https://t.co/DOwnDqVFmE", "— Tehseen Poonawalla Official (@tehseenp) February 25, 2020", "It is noteworthy that Poonawalla retweeted ANI’s tweet which has over 8,000 likes. Since then several users have claimed that Ayyub was circulating false information.", "Dear @DelhiPolice fake news was spread by @RanaAyyub who is a serial offender.Hope you take strict action against her. How does @washingtonpost associate itself with a communal bigot and a hatemongers. #RanaAyub #DelhiRiots pic.twitter.com/rpW00atZrs", "— Naina 🇮🇳 (@NaIna0806) February 25, 2020", "Many individuals including Sadhvi Khosla called for the arrest of Ayyub. Ramesh Solanki claimed that Ayyub shared a two-year-old video from Bihar and wrote that he has filed a police complaint against the journalist.", "Times Now broadcast a show on the DCP’s statement and declared that the video was “fake”. Right-wing website OpIndia penned a report on unverified social media claims, saying that the outlet doesn’t vouch for the authenticity of the allegations.", "Police responds to the fake ‘mosque vandalising’ video being circulated on social media.", "‘No such incident took place’, says police.", "Details by TIMES NOW’s Priyank Tripathi. | #DelhiFightHate | @thenewshour AGENDA with Padmaja Joshi. pic.twitter.com/Su324UTof2", "— TIMES NOW (@TimesNow) February 25, 2020", "The Wire’s Naomi Barton reported that the mosque in question is in Ashok Nagar (which was earlier described as Ashok Vihar but rectified). Alt News found a higher resolution video of a mob climbing atop the minaret and hoisting a saffron flag.", "A YouTube user uploaded a video of the incident from a different angle.", "Barton tweeted that she personally saw the flag on top of the minaret and witnessed a footwear shop underneath the mosque being looted.", "Making this very clear : I personally saw the flag on top of the miniaret of the mosque at Ashok NAGAR, not VIHAR.", "The mosque had been burned, and a footwear shop underneath it was looted in front of my eyes. https://t.co/tRLTWsz6qP", "— Naomi Barton (@therealnaomib) February 25, 2020", "Speaking with Alt News, she informed that the name of the mosque is Badi Masjid. Barton was accompanied by journalist Avichal Dubey who shot photographs of the mosque. Dubey shared a close-up image with Alt News.", "According to the EXIF data of the photograph, it was shot on February 25 at 3:57 pm.", "The Wire had also uploaded a video of water hoses being used to dose the fire in the mosque. Heavy smoke is seen coming out of the building, same as in the viral video and the image shared by Dubey. The journalist shared another video with Alt News where firefighters can be seen at the same spot. However, the most important portion of the clip starts at the 13th-second mark when the same minaret, where the saffron flag was planted, is visible.", "A place of worship, Badi Masjid, in Ashok Nagar was indeed set on fire by a mob. This was also confirmed to us by a local on the condition of anonymity.", "Several social users falsely claimed that the video is two years old when a similar incident had taken place in Bihar’s Samastipur. It is noteworthy that another mosque was vandalised in Delhi however this was in Gokulpuri area and is a separate incident.", "While DCP North-West Delhi’s statement that no mosque was vandalised in Ashok Vihar is true, ANI and Times Now did not clarify that the incident took place in Ashok Nagar. This gave rise to the misinformation that no such incident occurred.", "Donate Now", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]