["A recent version of the warning post says: “Bryan/College Station Friends: My windshield wipers were zip tied together while I was shopping at post oak mall. Law enforcement let me know that this is a trick human traffickers use.”", "This concerning warning has been shared repeatedly in the central Canadian province of Ontario since late November.", "However, the two towns mentioned in the post, Bryan and College Station, are not located in Canada. Rather, they are two adjacent cities in the southern US state of Texas.", "One of the first variations of this post appeared on Facebook in October 2018 in the San Angelo, Texas area, according to fact-checking website Snopes. Local police dispelled the tale in an official statement at the time.", "When the post emerged again in late 2019 local police in College Station also published an official statement to address citizens’ concerns, calling the relation between zip ties on cars and human traffickers “extremely unlikely,” while advising people to “be aware of their surroundings and to report suspicious activity.”", "Tristen Lopez, a spokesperson for the College Station Police Department, recounted to AFP that the individual who published the warning had informed police of the zip ties threat after finding her windshield wipers tied in a mall parking lot. Lopez said that nothing suggested human trafficking was the reason for the zip ties, and they  could have been placed on the car as a prank, or as a way to distract the driver in order to rob them of their bags while they removed the zip ties.", "In the US state of North Carolina, where the tale was also shared, local TV station WFMY journalists asked the Greensboro police department about zip ties on cars and were told that no such occurrence had taken place in the jurisdiction.", "Contacted by AFP, Ontario Provincial Police spokesperson Carolle Dionne said there have not been any reports of abduction featuring the use of zip ties within the provincial police’s jurisdiction.", "“Traffickers are typically looking for a victim who they can build some sort of relationship with before they force them to enter the sex trade,” Dionne added.", "Modern lore warning of new tactics used by human traffickers to abduct their victims abounds. The posts feature stories told from a first-person perspective by an individual claiming to have understood the trick and thus avoid kidnapping. The posts ask people to share the information to avoid tragedy in their communities, but it’s important to check with local media and authorities before sharing. AFP Fact Check debunked a similar claim presented in this format in Ontario in August 2019.", "According to this data from Canada’s National Centre for Missing Persons and Unidentified Remains, only 34 individuals were abducted by strangers out of 31,387 reports of missing adults in 2018. The report adds that 88 percent of missing adult reports were removed from the list within a week.", "If you or someone you know may be a victim, contact Canada's national human trafficking hotline.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]