["The clip was published on Facebook here on January 11, 2021.", "In the clip's first 14 seconds, Pakistani Prime Minister Imran Khan states in Urdu, “Pakistan needs a strong military today. And we need it because of the neighbour we have. There has been no government like this in India in the last 73 years of history.”", "An image of Indian Prime Minister Narendra Modi then appears on the screen and a TV anchor voiceover states, “There has been no government like this in India in the last 73 years of history, Prime Minister Imran Khan's criticism...” The video then ends abruptly.", "The Facebook post’s caption reads: “You cannot have a better endorsement of the Modi govt than this. Your sworn enemy publicly admitting that in 73 years India had never had a government as strong and iron-willed as this!”", "'73 years' is a reference to the 1947 partition that created India and Pakistan as two independent nations.", "The clip was also shared alongside similar claims on Facebook here, here, and here; and on Twitter here, here and here.", "The video, however, has been misleadingly edited.", "A keyword search found that the clip is from a news segment from Pakistani TV network 92 News, published on YouTube here on December 26, 2020. The clip circulating on social media can be found between 0:56 - 1:16 in the full video.", "The video’s description reads: “PM Imran Khan's Dabang Announcement | Headlines | 06:00 PM | 26 December 2020 | 92NewsHD”", "“Dabang” is an Urdu term meaning bold or audacious.", "The full news clip shows that after Khan makes the remark shared in the misleading clip, the news anchor explains that he is speaking about the EU DisinfoLab report in December 2020 that detailed a major propaganda campaign in India.", "92 News also published Khan's entire speech on YouTube here on December 26, 2020. The full remarks show that Khan is in fact harshly criticising Modi's government.", "“If Pakistan needs a strong army, it is today. And we need it because the neighbour we have. There has been no government like this in India in the last 73 years of history. This is an extremist, totalitarian, racist, anti-Muslim, anti-Islam and anti-Pakistan government,” he states at the video’s six-minute mark.", "Khan’s full speech was also published on his official YouTube channel here and the official YouTube channel of his political party here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]