["It was June 22, 2016. House Democrats had staged a sit-in on the floor of the House to try to force a vote on gun-control legislation. The House, in response, went into recess and the cameras in the House chamber were shut off.", "It may not sound like the makings of a viral late-night joke, but stay tuned.", "Undaunted, Democrats started transmitting video and images of the sit-in via social media tools such as Periscope, a live video streaming app. The sit-in, which House Speaker Paul Ryan subsequently blasted as a publicity stunt, lasted 26 hours.", "The Late Show with Stephen Colbert carried a 25-second comedy bit about the event, which began with a pan up the facade of the Ed Sullivan Theater, where the show is taped, followed by a quick cut to Colbert, holding a dog and sitting on a couch with supervising producer and writer Paul Dinello. Both were watching the feed from the House floor on a wall-mounted TV.", "\"Why am I watching Congress on Periscope?\" Colbert asks.", "\"That's because Paul Ryan shut off the C-SPAN cameras when the Democrats started their sit-in,\" Dinello responds.", "\"Really?\" Colbert responds. \"Wow, what a petty son of a —\"", "Suddenly the picture cuts to a cartoon of Ryan holding two ends of an unplugged power cord and the sign, \"Sorry! Technical Difficulties.\"", "The crowd inside the Ed Sullivan Theater cackled.", "But they didn’t have the full story.", "Did Ryan really shut off the C-SPAN cameras in the House chamber?", "Facebook posts said yes. Elizabeth Warren tweeted, \"@SpeakerRyan shut off the camera so you can't watch. Shameful.\" The Daily Show said so as well.", "The real answer is no.", "Congress' rules for operating the cameras — which Congress controls — call for video transmission to end as soon as the gavel goes down for recess or adjournment.", "What happened when the protest started", "Roll Call provided a good timeline of the protest and the reaction of Republicans.", "The House was in session and cameras were rolling the morning of June 22. Lawmakers were in something called  \"Morning Hour,\" which basically allows members to speak to any issue.", "At about 11:25 a.m., Rep. John Lewis, D-Ga., took to the House floor with a group of Democrats and demanded lawmakers vote on gun legislation. Rep. John Larson, D-Conn., spoke next with a similar message.", "At that point, Larson yielded the floor to Lewis, who said, \"Now is the time to find a way to dramatize it, to make it real.\"", "Lewis and a number of Democrats then sat down in the House well.", "At the time, Ryan wasn't at the speaker's rostrum. The presiding officer was Rep. Daniel Webster, R-Fla. Webster, after conferring with House staff, declared a recess.", "When Webster declared the recess, the cameras in the House went dead.", "About a half-hour later, around noon, Republicans tried to gavel the House back into session and the cameras came back on. Again, Ryan was not the presiding officer. This time it was Rep. Ted Poe, R-Texas. Democrats remained in the well of the House.", "Poe declared that the House \"is currently not in a state of order\" and called another recess. The cameras went black again.", "Fast-forward to shortly after 10 p.m. The House came back into session and the cameras turned on again. This time, Ryan asked Democrats to end the protest. They didn't, and the protest continued as Republicans struggled off and on to conduct some House business into the early morning hours. At 3:13 a.m., they adjourned until Friday, and the cameras were turned off.", "The key point", "The main takeaway in all of this is what triggered the camera going on and off.", "The camera was off because the House was not in session, not because of an order from Ryan. That's been a House standard going back years.", "This isn't the first time this has happened. During a sit-in eight years ago, cameras were cut for the Republicans when Democrats controlled the House.", "Minority Leader John Boehner wanted a vote on offshore oil drilling, a motion to adjourn was passed, and the C-SPAN cameras were turned off. The Republicans kept talking anyway.", "In that case, the lights and the microphones were turned off for a while as well. Yet the Republicans kept talking. As Politico reported, \"Democratic aides were furious at the GOP stunt.\"", "That protest lasted five hours.", "But back then, social media and video streaming services weren’t in the palms of every lawmaker’s hand.", "When the Democrats staged the latest protest, several members were broadcasting on Facebook and Periscope. C-SPAN picked up both feeds and continued to show the events, using the same style and logos they use when they're tapping into the House cameras.", "We note that, in the sketch, Colbert isn't the person saying, \"Paul Ryan shut off the C-SPAN cameras when the Democrats started their sit-in.\" But just as we make candidates responsible for all the statements in their ads, we have no doubt Colbert approved this message.", "A CBS spokeswoman, who identified Dinello for us, declined comment on the content of the sketch.", "Our ruling", "The Late Show with Stephen Colbert asserted that Ryan \"shut off the C-SPAN cameras when the Democrats started their sit-in.\"", "Ryan didn't order the cameras shut off in response to the protest. They were turned off because House Republicans declared the House session in recess. That's a standard policy of Congress, even if it was Republicans making the decision.", "Colbert's bit was funny, but on its factual basis we rate the statement Mostly False.", "https://www.sharethefacts.co/share/92344eb8-90bb-4f8f-8538-82fe220e5176", "YouTube, \"Why Am I Watching Congress on Periscope?\" The Late Show with Stephen Colbert channel, June 24, 2016, and \"The Daily Show - House Democrats Stage a Sit-In,\" The Daily Show with Trevor Noah channel, June 24, 2016", "The Washington Post, \"C-SPAN cameras couldn't show Democrats' gun conrol sit-in — so Democrats did it themselves,\" and \"Stephen Colbert calls Paul Ryan a 'petty son of a' over C-SPAN cameras,\" June 24, 2016", "C-SPAN, \"House Session, Part 1,\" \"House Democratic Sit-In,\" and \"Democratic Sit-in Over Gun Violence Continues,\" June 22, 2016", "Politico, \"House Dems turn out the lights by GOP keeps talking,\" Aug. 1, 2008 and \"C-SPAN's viral video moment,\" June 22, 2016", "Email, Lauren Kamm, CBS spokeswoman, June 24, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]