["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "That image of Trump purportedly in a coffin in an episode of “The Simpsons has been circulating for years and has been debunked.", "The image did not appear in “The Simpsons” and while its origins are unclear, it appears to have been promoted on the fringe forum website 4chan.", "Shortly after President Donald Trump tweeted that he had tested positive for the coronavirus, Facebook posts started popping up claiming that the long-running TV show \"The Simpsons\" had featured Trump in a coffin.", "That image of Trump purportedly in a coffin in an episode of \"The Simpsons\" has been circulating for years and has been debunked. Snopes in February 2017 reported that the image did not appear in \"The Simpsons,\" and while its origins are unclear, it appears to have been promoted on the fringe forum website 4chan.", "The Facebook post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Earlier this year, social media posts also claimed that \"The Simpsons\" predicted Trump would die Aug. 27, 2020, and used that same image of Trump in a coffin. \"The Simpsons\" has featured Trump before, but we found no indication that the show aired an episode of him in a coffin.", "Bill Oakley, a former writer for \"The Simpsons,\" told the Hollywood Reporter in a story published March 2020 that the show gets too much credit for predicting the future and also didn’t like past episodes being used for nefarious purposes. Facebook posts have falsely claimed that \"The Simpsons\" predicted the coronavirus. We rated that Pants on Fire.", "\"There are very few cases where ‘The Simpsons’ predicted something,\" Oakley told the Hollywood Reporter. \"It's mainly just coincidence because the episodes are so old that history repeats itself. Most of these episodes are based on things that happened in the '60s, '70s or '80s that we knew about.\"", "In his Oct. 2 tweet, Trump said that his wife, Melania Trump, also tested positive for COVID-19. \"We will begin our quarantine and recovery process immediately. We will get through this TOGETHER!,\" Trump said.", "We rate this claim Pants on Fire!", "Facebook post, Oct. 2020", "Twitter, @realdonaldtrump tweet, Oct. 2, 2020", "The Hollywood Reporter, 'Simpsons' Writer Calls Perversion of Classic Episode During Coronavirus Outbreak \"Gross\", March 15, 2020", "PolitiFact, D’oh, ‘The Simpsons’ didn’t predict the coronavirus, Feb. 27, 2020", "Snopes.com, Did ‘The Simpsons’ Predict President Trump’s Death?, Feb. 7, 2017", "Twitter advanced search for Trump @TheSimpsons", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]