["“Bhai log kolkata ke raza bazar me 63 madarse ke bachhe ko police ne giraftar kr liya h unka kahna h ke ye aatankwadi ka training lene ja rahe h..is Msg ko jaldi forward kre media dekhne se in kar kar Diya h media bol raha h ke hme uper se order h nhi dekhne ka plz forward all grp”, reads the message attached to a video posted by an individual user on Facebook. In the video, a group of students can be seen walking in a queue with policemen guiding them. It is being claimed that these were Madrasa students who were arrested by police. According to the post, the police said that they on their way to attaining training in terrorism. A few other individual users shared the post on Facebook.", "Bhai log kolkata ke raza bazar me 63 madarse ke bachhe ko police ne giraftar kr liya h unka kahna h ke ye aatankwadi ka training lene ja rahe h..is Msg ko jaldi forward kre media dekhne se in kar kar Diya h media bol raha h ke hme uper se order h nhi dekhne ka plz forward all grp…", "Posted by Nazeer Naz on Friday, 31 May 2019", "The same clip has been doing rounds on social media with an identical narrative since the last four years. A user named Ajaz Khan had shared the video on August 7, 2015. Khan’s post was shared more than 64,000 times and viewed in excess of 10 lakh times.", "It’s also being shared on WhatsApp and Twitter.", "It is also getting shared with a similar Bengali text.", "কলকাতা র রাজা বাজার এলাকা থেকে 63 জোন মাদ্রাসা ছাত্র কে গেরপ্তার করেছে পুলিশ। এরা সকলেই আতঙ্ক বাদি traning নিতে যাচ্ছি লো। খবরটা টা কে তারা তরি ফরওয়ার্ড করুন।", "কারন মিডিয়া ঐ খবর দেখবে না।", "মিডিয়া র উপরে order আছে এটা না দেখতে ।", "Posted by Binoy Bose on Monday, 10 June 2019", "Alt News found that the video is four years old and has been circulating on social media with a false narrative. According to media reports, the students were on their way to a madrasa in Pune when they were stopped by the police in Kolkata’s Sealdah railway station due to alleged lack of documentation. If one listens carefully, people in the video can be heard talking in Bengali.", "According to The Indian Express, the incident took place in August 2015 when Government Railway Police (GRP) intercepted 63 children who were travelling to a madrasa in Pune for training. The children were detained based on a tip-off from officials of CINI Asha Child Welfare Society.", "According to a statement issued by then Chairman of State Commission for Protection of Child Rights, Asokendu Sengupta, the children were taken into custody and a stay was arranged for them at Purnea by the Child Welfare Committee (CWC). In another statement given to The Hindu, Sengupta had said, “We will follow the provisions laid down by the law in this case. If documents of children being admitted to madrasa will be provided, the CWC will release them. The children will also be released if parents want that them to return home”.", "“Meanwhile, top officials of Kolkata Police have said that the children would be released and sent back to Bihar by Monday night itself, to avoid any untoward incident”, stated a report published by DNA on August 3, 2015.", "However, agitators protesting against the detention of the students blamed the police – “It is unfair on their part. Only because there are so many Muslims travelling, they think they are going to be trained as terrorists. Do we now need passports to travel within our own country? They were little children who were going to study”.", "Alt News contacted Sengupta for further details of the case. He said, “As far as my knowledge goes, first of all, the incident is old and we took the decision based on a report by the Childline Sealdah. In this particular case, some children accompanied by one or two senior members were going from one place to another without any documents. That’s why I asked the childline to not to allow them to move any further. According to JJ [Juvenile Justice] Act, CWC is the legal custodian of all the children (children in need of care & protection, CNCP) of their respective districts. So the boys needed to be sent to their respective [district] CWC authorities for identification. The protestors started a clamour that the children were apprehended only with the intention to stop them from taking religious training. That was not the case at all. I would like to say that our CM [Mamta Banerjee] took a very firm stand and supported me wholeheartedly and didn’t allow the local administration to go against my wishes”.", "Clarifying the doubts over the children’s release, he added, “The children were taken without their knowledge and consent. Hence, they were handed over to the Child Welfare Committees of their respective districts.”", "An old video of students being detained by the railway police for identification was shared with a hate-filled narrative that attempted to propagate that the children were on their way to receive training for terrorism. When the incident took place four years ago, the children were released by the police.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]