["Specific details in a range of widely shared posts claimed on Facebook that Leah Sharibu had been released and was currently based in Jos, Central Nigeria. In one post shared almost 1,000 times, it claimed that the government and various activist groups had failed to secure her release but that her Christian faith had freed her.", "The first online mention of the claim found by AFP which stated she had been freed was uploaded by a Facebook user on October 3.", "The claim later proliferated online. In many posts copied and shared by several users on Facebook or Twitter, no evidence was given for their claims and no details were provided for her release.", "The post was critical of Nigerian President Muhammadu Buhari's government, claiming it had made no attempt to release the teenager, contradicting several official statements that reassured her family and Christian groups that the authorities were working free her.", "The post and several similar claims online are false and contradict statements and sentiments expressed by the government and Leah Sharibu's family.", "On October 3, the presidency said in a statement that Buhari had called the girl’s mother, Rebecca Sharibu, to reassure her the government would do their best to bring her daughter home.", "President Muhammadu Buhari, Wednesday, spoke with Mrs Rebecca Sharibu, mother of the Dapchi Secondary schoolgirl, Leah, who had been kidnapped by Boko Haram terrorists, and assured her that his administration will do everything it would take to bring her daughter back home.", "In Nigeria, which is almost evenly split between a mostly Christian south and a largely Muslim north, the issue of Leah Sharibu's captivity has exploited religious divisions.", "Christian groups have criticised President Buhari, a Muslim, and his government, for securing only the release of all the Muslim schoolgirls seized in Dapchi but not Leah Sharibu, who was the only Christian among them.", "On October 13, information minister Lai Mohammed led a government delegation to see Leah Sharibu’s family in Dapchi, in Yobe state.", "FG's Delegation Visits Mother of Leah Sharibu in Dapchi Friday pic.twitter.com/LNgZCuCyWM", "The minister sought to reassure the family that the government was still working to free their daughter after the Islamic State-allied Boko Haram faction that abducted her threatened to kill one of three other abductees held with her unless their demands were met.", "It is not known what those demands were and the government has refused to release further information.", "On October 16, the second of three aid workers kidnapped by Islamic State West Africa Province in March this year, was executed by the militants. Leah Sharibu and a midwife, Alice Loksha remain held captive by the group.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]