["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Karl Rove, a former top adviser to President George W. Bush, appeared on the March 16, 2014, edition of \"Fox News Sunday\" (AP file).", "We and our friends at PolitiFact are used to poring over American election results. Here, we’ll test our skills looking at election returns from Ukraine.", "We’re checking a claim by Karl Rove, a former top adviser to President George W. Bush, who appeared on the March 16, 2014, edition of Fox News Sunday. Rove was discussing the Russian takeover of Crimea, suggesting that Russian-leaning candidates would now face long odds in Ukrainian politics without the votes of supporters on the Crimean peninsula.", "First, some background. Crimea which had long been a part of Russia until it was handed over in 1954 by Soviet leader Nikita Khrushchev. After the breakup of the Soviet Union in the early 1990s, Crimea, despite the presence of Russian military facilities and a majority-Russian populace, remained part of the newly independent Ukraine.", "But earlier this month, protesters in the Ukrainian capital of Kiev ousted pro-Russia president Viktor Yanukovych. After a pro-western transitional government took power, Russia sent troops into Crimea -- located on the country’s southeast flank -- and scheduled a referendum to determine whether Crimea should affiliate with Russia.", "In the March 16 referendum, which was criticized by the West as illegal, roughly 97 percent of Crimean voters sided with secession to Russia. Within two days, Russian president Vladimir Putin had formally accepted Crimea into Russia by signing an annexation treaty.", "While this treaty still needs to pass through a few more hoops to take effect, these are considered formalities. On Fox News Sunday, Rove operated under the assumption that annexation would go forward.", "Annexation, Rove said, \"removes a million residents of the Ukraine that have provided the margin of victory for Yanukovych, the pro-Moscow prime minister in his last election.\"", "Such a change to the map would mean that the remainder of Ukraine, following the removal of one of its strongest pro-Russia bastions, would become more favorable electoral territory for pro-Ukrainian politicians.", "In the United States, it might be analogous to gains the Democratic Party could make if Texas were to secede from the union, or gains the GOP could make if California were to quit the United States.", "We wondered whether what Rove said was accurate, so we looked through Ukrainian election results from the 2010 presidential election. In that election, the second and final round of voting pitted Yanukovych against pro-Ukraine politician Yulia Tymoshenko. In the final balloting, Yanukovych defeated Tymoshenko 49 percent to 46 percent.", "In order for Rove to be correct, Yanukovych’s margin of victory over Tymoshenko in Crimea and Sevastopol -- the two regions that joined Russia -- would have to match or exceed his margin of victory in the nation as a whole.", "It turns out that Rove’s claim was close, but not perfect.", "In Crimea, Yanukovych beat Tymoshenko by a 639,529-vote margin, and in Sevastopol, he won by a 156,261-vote margin. Together, that equals a margin of 795,790.", "Nationally, though, Yanukovych beat Tymoshenko by a somewhat larger margin -- 887,909 votes.", "So Yanukovych’s margin in Crimea and Sevastopol didn’t account for all of his national margin of victory, but it came close -- about 90 percent of the vote.", "Dominique Arel, who chairs the Ukrainian studies department at the University of Ottawa, said that \"47 percent of the electorate lives in the southeast. With the removal of Crimea, it probably shrinks to 45 percent or a touch less, making it very difficult in a polarized election for a southeast candidate to win.\"", "A final note: Other regions provided even more votes for Yanukovych than Crimea and Sevastopol did. Donetsk provided him with a margin of more than 2.2 million votes, while Luhansk gave him a margin of more than 1.1 million votes.", "Our ruling", "Rove said that Russian annexation of Crimea \"removes a million residents of the Ukraine that have provided the margin of victory for (Viktor) Yanukovych, the pro-Moscow prime minister in his last election.\"", "Crimea and neighboring Sevastopol -- the two newly annexed portions of Russia -- were certainly bastions of support for Yanukovych in the 2010 election. But while they came close to providing his entire national margin of victory, they fell a bit short, providing 90 percent of Yanukovych’s winning margin. We rate Rove’s claim Mostly True.", "Karl Rove, remarks on Fox News Sunday, March 16, 2014", "Election Resources on the Internet, \"Presidential and Parliamentary Elections in Ukraine - Results Lookup,\" accessed March 18, 2014", "Kyiv Post, \"Interactive Ukraine election maps,\" Jan. 18, 2010", "New York Times, \"Defying West, Putin Formally Claims Crimea for Russia,\" March 18, 2014", "Washington Post, \"Russian and Crimean parliaments sign treaty of accession,\" March 18, 2014", "Email interview with Dominique Arel, chair of the Ukrainian studies department at the University of Ottawa, March 18, 2014", "Email interview with Kristin Davison, spokeswoman for Karl Rove, March 18, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]