["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Rhode Island Sen. Leonidas P. Raptakis, D-Coventry, addresses the House Committee on Labor Feb. 5, 2015. (Capitol TV)", "The Rhode Island minimum wage rose on Jan. 1 this year, following increases on Jan. 1 in 2013 and 2014. It's now at $9 an hour unless you're in a special category such as waiter or waitress, in which case the hourly minimum is $2.89.", "A proposal to raise the minimum to $10.10 per hour (but not for waiters and waitresses) was the subject of a Feb. 5 hearing before the House Committee on Labor.", "We heard two opponents complain that the minimum wage had already risen by 16 percent in the last two years. Then we heard testimony from Sen. Leonidas P. Raptakis, D-Coventry, who wants future increases tied to inflation, not hiked randomly.", "\"We're talking about small business here in Rhode Island,\" said Raptakis, referring to \"increases that are unacceptable. Two dollars and thirty five cents the minimum wage has risen in the last two years. That's 31 percent. Never in Rhode Island history has the minimum wage gone up in two years (by) $2.35 or 31 percent.\"", "Sixteen percent? Thirty one percent? The discrepancy sent us scrambling for some data and our calculator.", "Two years ago, the minimum wage was $7.75. It's $9 an hour now. That's an increase of $1.25 or 16.1 percent. It seemed that Raptakis had doubled the actual increase.", "So we called him. He said he was referring to what the increase would be if the new legislation and its $10.10 minimum wage were approved. That's a jump of $2.35, but over three years, not two. That increase would be 30.3 percent, which is close to 31 percent.", "Raptakis also said Rhode Island's minimum wage has never risen by $2.35 or 31 percent in two years. (We'll assume he meant three years because raising the number of years is the only way his statement is accurate.)", "He's correct on the amount, but not on the percentage. The biggest three-year dollar increase we found was $1.60 due to hikes implemented in 2013, 2014 and 2015.", "If you look at percentage, the years 1979, 1980 and 1981 become important. That's when three increases totaling 80 cents were implemented. That was added to a starting base of $2.30 per hour. That's a three-year hike of 34.8 percent.", "Thus, the 31 percent increase over three years that Raptakis was talking about would not be unprecedented. However, unlike today, those were years when the U.S. was dealing with double-digit inflation rates.", "In summary, Sen. Raptakis testified that Rhode Island's minimum wage has risen $2.35 or 31 percent in the past two years.", "The actual increase Rhode Island businesses have been wrestling with over the past two years is significantly less, and he subsequently told us he was referring to what would happen if the $10.10 minimum wage was approved.", "The correct answer is 16.1 percent.", "We rate his statement False.", "(If you have a claim you’d like PolitiFact Rhode Island to check, email us at [email protected]. And follow us on Twitter: @politifactri.)", "RILIN.state.RI.US, \"2-5-15 House Committee on Labor Part 2 of 2,\" Rhode Island General Assembly website, Capitol Television Video on Demand, Feb. 5, 2015, accessed Feb. 10, 2015", "Interview, Sen. Leonidas P. Raptakis, D-Coventry, Feb. 10, 2015", "DLT.RI.gov, \"Statistical & Fiscal Digest 2013,\" \"Rhode Island Minimum Hourly Wage Rates: 1956 to Present\" chart, Rhode Island Department of Labor and Training, accessed Feb. 6, 2015 and \"A Guild to Wage and Workplace Laws in Rhode Island,\" issue date March 2015, accessed Feb. 11, 2015", "USInflationCalculator.com, \"Historical Inflation Rates: 1914-2015,\" accessed Feb. 11, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]