["The doctored image of the president’s daughter was shared thousands of times in North America. One post shared on July 30,2019, by a Facebook account located in Manitoba, Canada, reads: “Stay blind if you want to.”", "Other examples were found on Facebook here and here and on Twitter here.", "The fake Trump logo was also shared thousands of times in a 2017 meme that said: “‘Can I copy your homework?’ ‘Yeah just change it up a bit so it doesn’t look obvious you copied’ ‘ok’”", "Here is an example of the 2017 post that continues to be shared in 2019.", "The photo of Ivanka Trump actually shows her standing with Tony Spurlock, Sheriff of Douglas County, Colorado. The sheriff shared the photo on his personal Twitter account on July 22, 2019.", "Thrilled to visit with Ivanka Trump again during her visit to Colorado. Thankful for her support for law enforcement! pic.twitter.com/QRrCHHjPgI", "Ivanka Trump also visited a Lockheed Martin facility in Colorado on July 22. Public images from the visit, including in this article in the Denver Post, and in this video released by the White House, clearly show that Trump’s sweater does not include a logo.", "The image used to doctor the photo of Trump was originally created by graphic designers Mark Fox and Angie Wang. The professors at the California College of the Arts in San Francisco confirmed in a call with AFP that the design is named Trump Gold-Plated and was created in August 2016, before the US presidential election.", "The image is described here: “Composed of four T monograms, the poster uses the visual tension between foreground and background to reveal the metaphoric negative spaces created by Trump’s divisive rhetoric.”", "“We issued this poster really as a warning to America,” Wang said. “Perhaps after the election it became more of a protest.”", "Fox said he has long produced agitation propaganda work and the poster is only one of the pieces the designers have created in that vein. Others are detailed in this article.", "Fox and Wang originally provided a website for people to download the image, but they said that they took the high resolution artwork offline after Donald Trump was elected president, largely to prevent people trying to make money off of it.", "“I was very surprised to see the image because I thought people had forgotten about the piece,” Wang said of the doctored photo of the president’s daughter.", "Fox seemed less surprised, telling AFP that the appropriation of their design was to be expected.", "“That’s the nature of design, but it’s also what happens when you have technology that enables you to do it and then disseminate what you create rather easily.”", "This topic was previously fact-checked by Snopes and Fact-Check.org.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]