["About this rating", "We saw this email in 2006:", "German Parking Garage", "This is pretty amazing! Can you imagine how all this operates? How do they lock each car in its cubicle for safety. WHO CARES. NO ONE IN THEIR RIGHT MIND COULD GET IN THERE.", "Talk about German efficiency! The two photos below were taken at a new parking garage in Munich. The actual space that the facility occupies is approximately only 20% of a comparable facility with the traditional design that is used primarily in the US. Not only is the German structure less expensive to build, but vehicles are also \"retrieved\" in less time and without the potential of being damaged by an attendant.", "The photographs displayed above are real, and they show something resembling compact, multi-story parking structures that can indeed be found in some German cities, but in this case the two don't go together.", "The structure pictured here is not a public parking garage, but rather a storage facility for newly-manufactured automobiles. It's an inside view of one of the 20-story Car Towers at Volkswagen's Autostadt facility in Wolfsburg, Germany, which is sort of a cross between a Volkswagen showcase and theme park. Visitors can take in the shops, restaurants, and cinemas, as well as enjoying automobile-themed attractions, such as the virtual Car Configuration which guests can use to design their dream cars, and the\nAll-Terrain Tracks where visitors can put their driving skills to the test on a variety of road surfaces.", "If you visit Autostadt, the high point of your day might be taking delivery of a brand-new Volkswagen automobile. This is the part where a Car Tower like the one pictured above comes into play:", "Your new car is waiting!", "Anyone considering buying a new car usually does a lot of careful research before coming to the realization: this is it! At Autostadt, we think the moment in which you receive your new car should be just as special. And this is exactly what we offer. At Autostadt, collecting your new car is an event in itself. The best idea is to begin that special day with a relaxing trip to Autostadt followed by a tour until the big moment arrives: In a fully automated procedure, your new car is brought down to you from one of the 20-story Car Towers. Large signboards in the Customer Center show you when your turn has come. Then, you're handed the keys, your picture is taken, the glass doors open and your brand-new car appears. You're all set to go.", "Ritholtz, Barry.   \"The Truth About Auto Sales.\"\n     Bloomberg View.   19 May 2014.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]