["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "On Inauguration Day President Biden signed 16 proclamations and executive actions, including several related to immigration, the border wall and deferred action for childhood arrivals (DACA).", "Rep. Ashley Hinson, the Republican from Iowa’s 1st Congressional District, voiced her opposition to Biden’s immigration approach in a tweet on Jan. 23. It read:", "\"President Biden’s day one approach to immigration is radical— it will make our country less safe and disadvantage us economically. There’s no doubt our immigration system is broken, but blanket amnesty and halting border wall construction will take us in the wrong direction.\"", "We’re going to focus on whether or not Biden’s presidential actions include plans to halt border wall construction and give blanket amnesty.", "Hinson’s communication’s director did not respond to PolitiFact’s multiple attempts contact her.", "First, the wall. Biden’s \"Proclamation on the Termination Of Emergency With Respect To The Southern Border Of The United States And Redirection Of Funds Diverted To Border Wall Construction\" responds to former President Trump’s proclamation declaring a national emergency at the southern border. Biden’s order calls Trump’s declaration unwarranted and terminates it. Biden said his administration would not divert more money to the U.S.-Mexico border wall and that construction would be paused unless the Secretary of Defense or Secretary of Homeland Security made an exception.", "Biden’s proclamation says the Secretary of Defense and Secretary of Homeland Security will assess the legality of funding and contracting methods used to build the wall and the consequences for stopping the wall’s construction.", "\"Like every nation, the United States has a right and a duty to secure its borders and protect its people against threats. But building a massive wall that spans the entire southern border is not a serious policy solution,\" Biden said in the proclamation. \"It is a waste of money that diverts attention from genuine threats to our homeland security.\"", "However, none of Biden’s day one executive actions mentions amnesty. Moreover, a Fox News articlethat Hinson responded to in a retweet of the article does not mention blanket amnesty.", "A previous fact check stated, \"The idea of ‘blanket amnesty’ suggests a formal, legal act, in which the government pardons a group for violating immigration policies and allows them to obtain permanent residency.\"", "The executive action Biden took revoked Trump’s executive order, which restricted people from a list of countries, predominantly Musilim, from entering the United States. Biden also restored the Obama Administration’s Deferred Action for Childhood Arrivals policy, which allowed for a two-year deferment on removing from the country immigrants who met certain criteria.", "Biden favors giving legal status to people who live in the United States illegally, although they would have to clear hurdles. His executive order on the revision of civil immigiration enforcement policies and priorities revoked another Trump executive action that directed the Secretary of Homeland Security to prioritize removing immigrants who entered the U.S. illegally or overstayed their visa. Removal was called for, especially, for those convicted of a criminal offense, charged with an offense that is not resolved, engaged in fraud, or who have abused any government program distributing public benefits, are under final order of removal but have not exited the country, of have been deemed a risk to public safety or national security by an immigration officer.", "While Biden’s executive actions call for a pause of border wall construction with a goal of ending it, none of his day-one immigration related actions call for blanket amnesty. Hinson’s comment on the retweet contains an element of truth — the border wall characterization. But it adds something that is not in the Biden order or retweeted news story, giving a different impression of the order than exists in reality. That is why we rate Hinson’s statement as being Half True.", "The White House, Executive Actions", "Hinson tweet, Jan. 23, 2021", "The White House, \"Proclamation on the Termination OF Emergency With Respect To The Southern Border Of The United States And Redirection Of Funds Diverted To Border Wall Construction,\" Jan. 20, 2021", "Federal Register, \"Declaring a National Emergency Concerning the Southern Border of the United States,\" Feb. 20, 2019", "Fox News, \"Biden to reverse Trump travel ban, halt wall, strengthen DACA in slew of immigration orders,\" Jan. 20, 2021", "PolitiFact, \"Says Jon Ossoff \"wants total, blanket amnesty and he wants a total lockdown,\" Dec. 14, 2020", "The White House, \"Proclamation on Ending Discriminatory Bans on Entry to The United States,\" Jan. 20, 2021", "Federal Register, \"Protecting the Nation From Foreign Terrorist Entry Into the United States,\" March. 9, 2017", "The White House, \"Preserving and Fortifying Deferred Action for Childhood Arrivals (DACA),\" Jan. 20, 2021", "Homeland Security, \"Deferred Action for Childhood Arrivals: Who Can Be Considered?\" Aug, 15, 2012", "The White House, \"Executive Order on the Revision of Civil Immigration Enforcement Policies and Priorities,\" Jan. 20, 2021", "Federal Register, \"Enhancing Public Safety in the Interior of the United States,\" Jan. 30, 2017", "PolitiFact, Biden Promise Tracker.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]