["About this rating", "On 13 April 2016, the Facebook page \"Occupy Democrats\" published the above-reproduced image meme stating that 92-year-old Pam Nelson of Victoria, Texas, was unable to vote in her state's primary because of a new law requiring voters to present photo ID at the polls:", "This is 92-year-old Pam Nelson from Victoria, Texas.", "She's voted in every election she's ever been eligible for. Due to Texas' new \"voter ID law\" she WASN'T able to vote in last month's primary.", "She tried several times to get an ID but couldn't wait the hours in line required. She tried to get an ID by mail, but you can't do that if you're over 70.", "Share if you agree \"voter ID\" laws are voter suppression!", "The post did not include links to any news articles or other media providing more information about \"Pam Nelson\" or her inability to vote. We were unable to find any other articles providing information about the claim, and we were unable even to locate anyone by that name in or near Victoria, Texas. Eventually, \"Occupy Democrats\" contacted us to say that, oh, the woman in the meme wasn't named Pam Nelson, as they stated; rather, Pam Nelson was her granddaughter's name (and the woman herself was named Bernice).", "In 2011, the Texas Legislature passed Senate Bill 14 (SB 14), creating a new requirement for voters to show photo identification when voting in person. Acceptable forms of identification include the following:", "· Texas driver license issued by Texas Department of Public Safety (DPS)", "· Texas Election Identification Certificate issued by DPS", "· Texas personal identification card issued by DPS", "· Texas license to carry a handgun issued by DPS", "· United State military identification card containing the person's photograph", "· United States citizenship certificate containing the person's photograph", "· United States passport", "The reference to age in the meme suggests that \"Bernice\" had an expired driver's license and was unable to renew it in time to use it as ID for voting because Texans over the age of 70 can't renew their licenses by mail, and the lines at her local Department of Public Safety (DPS) were too long for her. This isn't quite correct: Texas DPS requires that persons 79 (not 70) or older must always renew their licenses in person because they must take a vision test.", "Still, wasn't \"Bernice\" effectively disenfranchised from voting by this requirement? Not fully.", "For starters, Texas allows driver's licenses to be renewed up to one year before their expiration date, and Texas voter ID laws allow the acceptance of an approved form of ID up to 60 days after its expiration date — so \"Bernice\" had a fourteen-month span during which she could have renewed her license in time to vote, including a full two months after its expiration.", "Moreover, Texas allows residents lacking current driver's licenses to obtain an Election Identification Certificate (EIC) as a form of valid voter ID. EICs are available at a variety of locations other than Texas DPS offices (and their presumably lengthy lines).", "As well, a person lacking a valid form of photo identification at the polls may still cast a provisional ballot, which provides that person up to six days after the election to present him/herself to the county voter registrar and present appropriate photo identification. If the provisional voter presents the photo identification to the county voter registrar within the six-day period and meets all other requirements, then the provisional ballot must be accepted.", "Finally, and most important, Texas allows persons aged 65 or older to vote by mail, a form of voting that does not require the presentation of a current piece of photo ID.", "Subsequent Facebook posts indicated that \"Bernice\" (who is actually 97) could indeed have voted by mail but ... didn't want to. So apparently this issue was far less a case of voter disenfranchisement than it was an instance of the democratic process taking a backseat to personal preference.", "Matthews, George.   \"Primary Election Day Is Tuesday, March 1, 2016.\"\r\nVictoria Advocate.   27 February 2016.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]