["After votes conclude for the day, members of Congress can book time at the U.S. House of Representatives’ podium to deliver floor speeches on their favorite topics. That’s what Youngstown-area Democratic Rep. Tim Ryan did earlier this month when he and California Democratic Rep. John Garamendi held forth on the \"The American Dream,\" and obstacles the poor face in their efforts to improve their situation.", "\"If you are born poor in America, we rank about ninth or tenth in our citizens’ ability to climb up through that ladder and get themselves into the middle class,\" Ryan told Garamendi, arguing that the United States had moved away from a philosophy it had until the mid 1980s when it made educational investments that facilitated people’s economic rise.", "Because the ability to rise from rags to riches is a key facet of the American Dream, we asked Ryan’s office where he got his sobering statistic about America’s lack of social mobility. Ryan spokesman Pat Lowry said it came from a March 2010 article in the British newspaper, The Guardian, which was reporting on a study produced by a Paris-based coalition of 34 countries, including the United States. The study performed by the Organisation for Economic Co-Operation and Development found it is easier to climb the social ladder in other developed countries than it is in the United States, Italy and Britain. In that study, Denmark, Australia, Norway, Finland, Canada, Sweden, Germany, Spain and France all scored ahead of the United States in children’s ability to exceed their parents’ income.", "The study found that in the United States, Italy and the United Kingdom, at least 40 percent of the economic advantage that high-earning fathers have over low-earning fathers is transmitted to their sons. In countries with more social mobility, just 20 percent of that advantage carries into the next generation.", "\"Policies that facilitate access to education of individuals from disadvantaged family backgrounds promote intergenerational wage mobility, and are also likely to be good for economic growth,\" the study said.", "Its findings echo similar research conducted in the United States. A 2008 report on economic mobility produced by the Pew Charitable Trusts and Brookings Institution found that while \"Americans have an optimistic faith in the ability of individuals to get ahead within a lifetime or from one generation to the next, there is growing evidence of less intergenerational economic mobility in the United States than in many other rich, industrialized countries.\"", "It noted yet another study that showed U.S. social mobility lags behind Canada and several other northern European countries, but observed that other research has found U.S. social mobility exceeds that of developing countries such as Ecuador, Peru and Brazil. The research on developing countries equated America’s level of social mobility with that of Pakistan and Nepal, though it cautioned that statistics for developing countries are harder to come by because they lack income surveys that span three or more decades, so researchers must estimate how much money participants’ parents made.", "During the 2012 election cycle, Republicans including presidential candidate Rick Santorum of Pennsylvania and vice presidential candidate Paul Ryan of Wisconsin observed that mobility in the U.S. lags behind other countries.", "A 2012 New York Times article on the subject cited some of the factors that hinder social mobility in the U.S., like pay tilted toward educated workers and the magnitude of the gaps between the rich and middle class. It notes the U.S. \"maintains a thinner safety net than other rich countries,\" and that \"poor Americans are more likely than foreign peers to grow up with single mothers.", "\"That places them at an elevated risk of experiencing poverty and related problems, a point frequently made by Mr. Santorum,\" the article says. \"The United States also has uniquely high incarceration rates, and a longer history of racial stratification than its peers.\".", "While it flies in the face of the notion that anyone can rise from the bottom to the top in the United States, a number of studies uphold Ryan’s contention that America’s social mobility lags behind that of many other countries. America’s exact ranking in those studies depends on which countries are surveyed, but the research Ryan alluded to did find the U.S. to be 10th among the 12 examined countries.", "However, it is important to clarify that those 12 were all developed countries, and other research has found that U.S. social mobility exceeds that of developing countries.  Ryan did not qualify his statement to reflect that. We rate it Mostly True.", "House of Representatives floor speech by Tim Ryan, June 11, 2013", "Emails with Ryan spokesman Pat Lowry, June 17-20, 2013", "The Guardian, OECD: UK has worse social mobility than other developed countries, March 10, 2010", "Organisation for Economic Co-Operation and Development, Intergenerational Social Mobility: A Family Affair? Feb. 10, 2010", "Economic Mobility Project: An Initiative of the Pew Charitable Trusts, International Comparisons of Economic Mobility,  2008", "The Future of Children, Intergenerational Social Mobility: The United States in Comparative Perspective, Fall 2006", "New York Times, Harder for Americans to Rise From Lower Rungs, Jan. 4, 2012", "National Review, Mobility Impaired, Nov. 7, 2011", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]