["By Angelo Fichera", "Posted on November 1, 2019", "Facebook posts purport to outline “the rules” of the House impeachment inquiry into President Donald Trump, but they distort the facts in doing so.", "The House voted Oct. 31 to approve a resolution further advancing the impeachment inquiry into President Donald Trump, and social media claims immediately began to distort the facts about the process.", "Some viral posts, shared by thousands of Facebook users, purport to state “the rules” of the impeachment inquiry proceedings — likening the U.S. to the “USSR.” But two of the three “rules” distort the facts. One of them — about what can and can’t be asked of witnesses — is false, and another (that no “involvement” by Trump’s counsel is permitted) is misleading.", "We’ll explain below.", "Some background: House Speaker Nancy Pelosi announced in late September that the House would launch a formal impeachment inquiry into Trump. The investigation is being carried out by multiple committees and focusing on Trump’s dealings with Ukraine. In particular, the inquiry is exploring his decision to withhold appropriated security aid to Ukraine — and whether he did so to pressure Ukrainian President Volodymyr Zelensky to investigate Democrats and former Vice President Joe Biden, a potential 2020 political opponent. (For more, see “What We’ve Learned From Impeachment Inquiry.”)", "While the investigative work done to date has occurred behind closed doors, the Oct. 31 resolution, which codifies aspects of the probe and formalizes how it will proceed, paved the way for a more public airing of the evidence.", "One of the purported rules of the inquiry listed in the viral posts distorts the facts about what authority Trump’s attorney will have during the House’s investigation.", "“The rules do not allow involvement of the President’s legal counsel,” the social media posts read.", "While some Republicans have criticized the fact that Trump’s counsel is not permitted to take part in the House intelligence committee’s probe — which is to include public hearings — there is involvement by the president’s team incorporated into the phase handled by the House Judiciary Committee.", "The intelligence committee, according to the resolution, is expected to issue a report on its findings (in coordination with other committees) to the Judiciary Committee, which will ultimately decide whether to draft articles of impeachment. If the articles are approved by a simple majority in the House, then a trial would be held in the Senate.", "The resolution says:", "The House authorizes the Committee on the Judiciary to conduct proceedings relating to the impeachment inquiry referenced in the first section of this resolution pursuant to the procedures submitted for printing in the Congressional Record by the chair of the Committee on Rules, including such procedures as to allow for the participation of the President and his counsel.", "The procedures for the judiciary committee’s part of the impeachment inquiry were printed in the Congressional Record on Oct. 29, and they outline a number of ways the president’s counsel may be involved in the inquiry.", "For example, the procedures say that the president’s counsel shall be given copies of certain records and depositions related to the inquiry and that his counsel can submit written requests for additional testimony or evidence.", "Also, when witnesses are called to testify, the procedures say, “the President and his counsel shall be invited to attend all hearings, including any held in executive session” — and that Trump’s counsel will have the right to raise objections to “the examination of witnesses or to the admissibility of testimony and evidence.”", "The procedures also say “the President’s counsel may question any witness called before the Committee, subject to instructions from the chair or presiding member respecting the time, scope and duration of the examination.”", "It’s worth noting that one provision among the procedures indicates that, “should the President unlawfully refuse to make witnesses available for testimony, or to produce documents requested by” any of the investigative committees, “the chair shall have the discretion to impose appropriate remedies, including by denying specific requests by the President or his counsel under these procedures to call or question witnesses.”", "The committee chairman, Rep. Jerry Nadler, told CQ Roll Call that the provision is “just a precaution.”", "So, while some Republicans have objected to the absence of Trump’s counsel in the intelligence committee proceedings, it is not correct to simply say that the “rules do not allow involvement of the President’s legal counsel.”", "The posts also claim that the “rules do not allow any witnesses to be questioned unless the question is approved by Adam Schiff.” Schiff, a Democrat, is chairman of the intelligence committee.", "There is no language in the resolution that requires such approval.", "The resolution indicates that Schiff and Rep. Devin Nunes, the highest-ranking Republican on the committee, shall be given equal time to question a witness — which may be conducted by staff — and then the committee “shall proceed with questioning under the five-minute rule” established in the Rules of the House of Representatives. The corresponding section of the House rules states that “each committee shall apply the five-minute rule during the questioning of witnesses in a hearing until such time as each member of the committee who so desires has had an opportunity to question each witness.”", "In other words, both Republicans and Democrats on the committee will be afforded time to ask witnesses questions. And, as we said, there is no requirement that members have questions approved by Schiff first.", "Finally, the posts say that the “rules do not allow any witness to be called unless the witness is approved by Adam Schiff.” That is mostly correct.", "Regarding the intelligence committee’s work, the resolution allows the “ranking minority member” — Nunes — to make “requests for witness testimony.”", "And while it authorizes Nunes to issue subpoenas for witnesses or documents, that power is to be exercised “with the concurrence of the chair.”", "If Schiff “declines to concur in a proposed action of the ranking minority member,” then Nunes can ask that the committee vote to determine whether the action should be taken. Democrats have the majority on the committee.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "Congressional Record. “Impeachment Inquiry Procedures in the Committee on the Judiciary Pursuant to H. Res. 660.” 29 Oct. 2019.", "U.S. House. “H. Res. 660, Directing certain committees to continue their ongoing investigations as part of the existing House of Representatives inquiry into whether sufficient grounds exist for the House of Representatives to exercise its Constitutional power to impeach Donald John Trump, President of the United States of America, and for other purposes.” (as passed by the House 31 Oct 2019.)", "U.S. House. Rules of the House of Representatives | One Hundred Sixteenth Congress. 11 Jan 2019.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]