["About this rating", "An Internet meme circulating during the final weeks of the 2016 presidential campaign purported to reveal financial trickery on the part of Democratic contender Hillary Clinton, who allegedly deducted $1 million from her 2015 income tax return after donating it \"to herself\" via contributions to the Clinton Foundation.", "On the assumption that this information came from the candidate's 2015 tax filing (released to the public earlier this year), that's where we went to verify the accuracy of the claims. Our findings were these:", "1. The return was a joint filing for both Hillary and William J. Clinton.", "2. Their shared charitable donations totaled $1,042,000: $42,000 to Desert Classic Charities and $1 million to the Clinton Family Foundation.", "3. Declaring an amount — say $1 million — as a charitable donation only reduces your taxable income; it doesn't mean your \"tax bill\" is reduced by that amount.", "4. The Clinton Family Foundation is a separate entity from the Clinton Foundation. Inside Philanthropy describes the Clinton Family Foundation as \"a traditional private foundation that serves as the vehicle for the couple's personal charitable giving.\" It has neither staff nor offices.", "5. According to Inside Philanthropy, the Clinton Family Foundation regularly disburses contributions to scores of different charities (one of which is, in fact, the Clinton Foundation):", "Digging into the Clinton Family Foundation's 2014 tax return reveals that they did around $3.8 million in grantmaking and held some $5.3 million in assets. Of total grantmaking in 2014, $1.8 million went to the Clinton Foundation, just under half of total giving.", "However, in 2013, the Clintons gave $1.8 million through their personal foundation, with only around a fifth of that money going to the Clinton Foundation, around the same share as in 2012.", "So where have all the other gifts gone? To lots of different places, is the short answer. In 2014, the Clintons gave money to 70 nonprofits through their foundation. The picture looked similar the year before, with many grants falling in the range of $5,000 to $25,000.", "Recipients of the Clintons' largesse via the Clinton Family Foundation in 2014 ranged from the School of American Ballet to the Arkansas Children’s Hospital Foundation to Wellesley College to the Elie Wiesel Foundation for Humanity.", "The foundation's 2015 tax filing has not yet been made public, so we don't have an accounting of the organizations to whom the $1 million contributed by the Clintons that year was disbursed.", "Regarding the apparent assumption that any monies donated to the Clinton Foundation simply end up in the Clintons' own pockets, we refer readers, once again, to Inside Philanthropy, which describes the actual work the foundation does, and to the charity rating service Charity Navigator, which gives the Clinton Foundation an overall score of 94.74 points out of 100 in terms of its financials, accountability, and transparency.", "Callahan, David.   \"What the Heck Does the Clinton Foundation Actually DO?\"\r\n   Inside Philanthropy.   23 June 2016.", "Callahan, David and Adeniji, Ade.   \"The Other Clinton Foundation: A Look at Bill and Hillary's Personal Philanthropy.\"\r\n   Inside Philanthropy.   29 July 2016.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]