["The video was published on August 28, 2020, here on Facebook. It has been viewed more than 1.2 million times.", "It purports to show a drone delivering a box of Indomie instant noodles before collecting a card payment.", "Its caption, written in traditional Chinese characters, translates to English as: “The era of unmanned aerial vehicle transportation and card swiping is approaching.”", "The video was also shared in Indonesian on Facebook, YouTube and Twitter; and in a Malaysian post with a similar claim.", "Facebook posts, such as this one and this one, also shared the video along with a claim in English that it was taken in Nigeria.", "The claim, however, is false; the video is actually a 3D visual effects animation.", "A reverse image search using keyframes generated by the InVID-WeVerify verification tool found the same video posted on Twitter here on August 26, 2020.", "The Twitter user, Uche Anisiuba, describes himself as a co-founder of a Nigerian content production company, Quadron Studios.", "The Twitter post’s caption reads: “So I ran out of Indomie yesterday, needed to make a quick restock, never knew we had a drone delivery service in Lagos,” followed by a laughing emoji.", "So I ran out of Indomie yesterday, needed to make a quick restock, never knew we had a drone delivery service in Lagos ?.#visualeffects #redshift3d #nollywood #africarising #africatech #nigerian #3Danimation #motiondesign @IndomieNigeria @myaccessbank @AccelerateTV @burnaboy pic.twitter.com/TyYGBOXnf8", "Below is a screenshot of the video in the misleading Facebook post (L) and Anisiuba’s tweet (R):", "In response to a question about the clip on Twitter, Anisiuba said that the video was a “3d visual effects. Like the type they use in Avengers.”", "He later tweeted this footage, which compares the video before and after the special effects.", "I hear some people have been energetically arguing if this is real or not. Let me help you out. Here is a before and after ?. Sorry, not sorry ? pic.twitter.com/sUapRMTftl", "Anisiuba explained in detail how he created the animation in this video on the YouTube channel of Artfrocentric.com, an online platform that showcases African digital arts.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]