["About this rating", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "From April 10, 2020, to June 27, 2020, 13 sisters from the same convent in Michigan died from COVID-19, prompting Snopes readers to ask if that particularly concentrated pandemic tragedy was true.", "Sadly, it is true. Twelve sisters from Presentation of the Blessed Virgin Mary Convent in Livonia, Michigan, died within 30 days of each other during an outbreak of the coronavirus disease between April 10 and May 10. Another sister died on June 27.", "Suzanne English, executive director of mission advancement for the Felician Sisters of North America — the congregation that the sisters belonged to — told us in a statement that although not all 13 sisters were tested, their symptoms were \"inline with COVID\" amid the outbreak at the convent.", "In the case of the final fatality on June 27, English said, \"the Sister had been COVID-positive and while she had passed the 28-day quarantine, we believe it was the lingering effects that caused her death.\"", "Although some news reports referred to the women as \"nuns,\" English pointed out that because the Felicians are monastic (living under religious vows), they are correctly referred to as \"sisters.\"", "A total of 30 sisters at the Livonia convent — of the 57 then living there — were infected. Seventeen recovered, English said in an email, citing Sister Noel Marie Gabriel, director of clinical health services for the Felicians.", "According to Global Sisters Report, a news publication focusing on Catholic sisters and current events, the 13 sisters who passed were heavily involved in their community, performing services like working as nurses, educators, and librarians.", "\"That was our most tragic time,\" Sister Gabriel told the publication. \"It was a month of tragedy and sorrow and mourning and grieving.\"", "Officially known as the Congregation of the Sisters of St. Felix of Cantalice, the convent in Livonia is one of 60 Felician convents in North America.", "Walker, Allyson and Christine Hauser. \"Convent in Michigan Loses 13 Sisters to Covid-19.\"\r\n  The New York Times. 23 July 2020.", "Stockman, Dan. \"'Our Most Tragic Time': Felician Sisters Bear Loss of 13 Sisters to COVID-19.\"\r\n  Global Sisters Report. 20 July 2020.", "Updated to note that the first sister passed away on April 10, 2020, and that 12 sisters died between April 10 and May 10, 2020.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]