["An image of a group of people offering namaz together on the terrace of buildings is going viral on social media. Film director Vivek Agnihotri tweeted the image and asked, “Any idea where is this? #Quarantine”. It has been retweeted close to 5,000 times so far.", "Facebook page Hukka aur Khat posted the image with the message, “ये मजहब से वफ़ादारी हो सकती है परन्तु क्या यह वतन से गद्दारी नही.? (This might be loyalty towards the religion but isn’t it being a traitor to the country -translated)”. The post has been shared more than 400 times so far. While the text doesn’t mention the location where the image was shot, it implicitly targets the Muslim community in India.", "It is important to note that the image tweeted by Agnihotri has been cropped to remove certain structures in the background which are visible in other posts that have tweeted the full photograph.", "The image was shared on Facebook with the Kannada text, “ಆರೋಗ್ಯ, ಸಮಾಜ ಹಾಗೂ ವೈಜ್ಞಾನಿಕತೆ ಬಗ್ಗೆ #ಕೆಲವರಿಗೆ ಮನವರಿಕೆ ಮಾಡೋದು.! #ಕತ್ತೆ_ಮುಂದೆ_ಕಿನ್ನರಿ_ಬಾರಿಸಿದಂತೆ..?”. Posts by Facebook Pages – Namo and Modi Kingdom – have garnered over 4,300 shares.", "Alt News has received several requests on its official Android application to fact-check the image.", "With a Google reverse image search, Alt News found that this image was earlier shared in Saudi Arabia and Kuwait. We found multiple tweets by individuals from these countries. However, the location couldn’t be ascertained.", "We then closely analysed the image and found that there is a mosque, a water body (possibly a sea), and a water ferry visible in the background. A Google search with the keywords and an assumption that it could possibly be from Dubai led us to the location.", "We were able to locate the tall building seen in the background of the image near the Dubai creek. The dome and minaret like structures are located inside the Architectural Heritage Department in Dubai, UAE. In the comparison below, we have pointed out the same structure seen in the viral image and the image of the Architectural Heritage Department available on Google.", "Moreover, we matched the shed or covers seen in the viral image with a Google Earth view of these buildings. The sheds are highlighted with purple stripes.", "Another image from Google Earth shows the top view of these buildings and the angle from which the image was shot. The reference points were the dome and the minaret in the background circled in yellow.", "In the comparison below, we were able to match the shopping mall seen in the background of these buildings and further ascertain the location. The image on the top left is the Google Street View while on the right is the Google Earth view of the shopping mall. The image placed on the bottom shows the same shopping mall seen in the viral image.", "While Alt News could independently verify the location of this image, it is unclear if is recent or an old.", "An image from Dubai where members of the Muslim community are seen offering namaz has been shared in India with an implied attack on the community for violating lockdown protocol.", "Donate Now", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]