["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Gov. Rick Scott and former Gov. Charlie Crist argued about immigration reform during their third and final debate.", "Scott defended his record in the debate, arguing that he had helped out a certain group of illegal immigrants afford college -- \"dreamers.\"", "\"Dreamers,\" named for the as-yet unpassed DREAM Act, are illegal immigrants who were brought to the United States as children. After Congress failed to pass the bill, President Barack Obama in June 2012 announced a two-year moratorium on the deportation of some children who had been brought to United States illegally by their parents.", "\"Let’s look at what I did do that Charlie said was the wrong thing to do,\" Scott said. \"I said if you grow up in our state, you should get the same in-state tuition as your peers. Charlie said when the Legislature didn’t pass it before, that they did the right thing. So Charlie was against that, but we did the right thing, because whatever country you grew up in, if you live in Florida you ought to have the same right (to) in-state tuition as your peers.\"", "However, Scott is omitting part of his own record -- and part of Crist’s record -- about \"dreamers\" and in-state tuition.", "In-state tuition battles", "In April 2014 when it appeared that the Legislature under Gov. Scott would approve in-state tuition for certain illegal immigrants, the Republican Party of Florida said in an email that \"In 2006, Charlie Crist opposed in-state tuition for illegal immigrants.\" (That was back when Crist was a Republican; he’s now running as a Democrat to win back his old office.)", "As support for its claim, the state party's email cited a 2006 Miami Herald article about Crist, who was then serving as state attorney general.", "The Herald article said that \"Crist, like (his GOP rival for governor CFO Tom) Gallagher, said state lawmakers did the ‘right thing’ earlier this year when they rejected a bill allowing children of illegal immigrants to pay the same tuition rates as Florida residents. But Crist, also like Gallagher, said he supported a proposal to let illegal immigrants get drivers' licenses. It didn't pass two years ago, despite support from Gov. Jeb Bush.\"", "That year, a proposal to give certain Florida residents who were illegal immigrants in-state tuition divided Republican legislators and drew opposition from then-Senate President Tom Lee. Ultimately, the proposal failed. (Bush had said he supported giving in-state tuition to those children if they’d lived in Florida at least two years, but he added that he felt it wasn’t the year to deal with it, so the controversial provision was removed from an education bill.)", "When we looked at this question previously, a spokeswoman for the Republican Party of Florida didn’t point to any additional statements by Crist as support for the claim. So we searched for other statements by Crist about giving in-state tuition to children of illegal immigrants.", "We found little else prior to his current campaign as a Democrat. We did not locate any bills to grant in-state tuition to \"dreamers\" that reached Crist’s desk during his tenure as governor 2007 and 2011.", "We did find an August 2006 article in the Tampa Bay Times that included a one-word \"yes\" or \"no\" answer from gubernatorial candidates to several questions, including: \"Should we allow the children of illegal immigrants to pay in-state tuition at our universities?\"", "The answer for Crist? \"No.\" That provides support for Scott’s claim.", "However, both candidates have had a zigzagging approach to the issue, which complicates the neat story line Scott tried to communicate in the CNN debate.", "Scott omitted that during the 2014 campaign, Crist has supported in-state tuition for illegal immigrants.", "\"We must immediately pass legislation that allows the children of undocumented parents to attend Florida colleges and universities at in-state tuition levels,\" Crist wrote on the immigration page of his campaign website. \"It simply isn’t fair to punish children of undocumented parents.\"", "At the same time, Scott omitted that he changed his opinion about the issue, earning him a Full Flop from PolitiFact Florida.", "In September 2011, Scott told the conservative website Newsmax that \"with regard to in-state tuition for illegal immigrants, I completely oppose it.\"", "That changed by 2014 when, after a decade of failed attempts, it appeared that the Legislature might pass the bill.", "In mid-April, Scott made his support clear. In a joint statement with former Republican Govs. Jeb Bush and Bob Martinez, Scott said, \"Students who have spent their childhood here in Florida deserve to qualify for the same in-state tuition rate at universities their peers and classmates do. We want our students to stay here in Florida when they go to college and when they choose a career, and that means we must make college more affordable for all those students who call Florida home. The Florida Senate should take immediate action to move S.B. 1400 forward.\"", "Our ruling", "Scott said he supported in-state tuition for \"dreamers\" while Crist was against it. There’s some truth to that claim, but the reality is that both candidates have flip-flopped on the issue, manking such a clear-cut comparison problematic.", "In reality, Scott was against in-state tuition for \"dreamers\" in 2011 but came for it in 2014. Crist opposed it in 2006 but voiced his support during this current campaign. On balance, we rate the claim Half True.", "CNN, Debate, Oct. 21, 2014", "Republican Party of Florida, \"Charlie Crist opposed in-state tuition for illegal immigrants,\" April 10, 2014", "Gov. Rick Scott office press release, \"Gov. Scott applauds judiciary committee on supporting bill to keep college affordable,\" April 1, 2014", "Florida Democratic Party press release, \"FDP statement on in-state tuition for Dreamers,\" April 9, 2014", "PewResearch Hispanic Trends Project, \"Latino voters in the 2012 election,\" Nov. 7, 2012", "PolitiFact, \"Jeb Bush says Rick Scott won Hispanic vote, bucking national trend,\" Nov. 15, 2010", "Miami Herald, \"Governor signs college aid bill,\" June 2, 2006", "Miami Herald, \"Cuban Americans courted,\" June 10, 2006", "Tampa Bay Times, \"No Jeb? Hispanics wait to be wooed,\" Aug. 7, 2006", "Sun-Sentinel, \"A conversation with Gov. Rick Scott,\" April 21, 2013", "Miami Herald, \"Gov. Rick Scott backs in-state tuition for undocumented students,\" March 12, 2014", "Miami Herald op-ed by Dario Moreno, \"Rick Scott’s support among Hispanics at risk,\" April 3, 2014", "PolitiFact, \"Charlie Crist opposed in-state tuition for Dreamers in 2006, Republican Party of Florida says,\" April 11, 2014", "PolitiFact, \"Rick Scott opposed in-state tuition for Dreamers before he embraced it,\" May 2, 2014", "PolitiFact, \"Rick Scott said bill he vetoed to give drivers licenses to DACA immigrants changed ‘nothing,’\" Oct. 20, 2014", "Interview, Susan Hepworth, spokeswoman Republican Party of Florida, April 10 and Oct. 21, 2014", "Interview, Kevin Cate, spokesman Charlie Crist campaign, April 10, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]