["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "In a series of tweets justifying the U.S. killing of Qassem Soleimani, Vice President Mike Pence said that among the Iranian military leader’s \"worst atrocities\" was helping 9/11 terrorists.", "Soleimani \"assisted in the clandestine travel to Afghanistan of 10 of the 12 terrorists who carried out the September 11 terrorist attacks in the United States,\" Pence tweeted Jan. 3.", "The U.S. Defense Department on Jan. 2 announced it had killed Soleimani, who commanded the Quds Force in Iran’s Islamic Revolutionary Guard Corps. The Trump administration said the killing was a defensive action and that Soleimani was developing plans to attack American diplomats and troops in Iraq and the region.", "PolitiFact decided to take a closer look at Pence’s claim that Soleimani assisted the men who carried out the terrorist attacks on 9/11. There’s no evidence to support his statement, and his press secretary did not provide information that directly tied Soleimani to the travel of the 9/11 terrorists.", "The 9/11 terrorist attacks were carried out by 19 men who hijacked four commercial airplanes, deliberately crashing two planes against the World Trade Center towers, flying another plane into the Pentagon, and the fourth crashing into a field in Pennsylvania. The attacks killed nearly 3,000 people and were orchestrated by the al-Qaida terrorist group based in Afghanistan. The attackers traveled to Afghanistan for training.", "The 19 hijackers included 15 from Saudi Arabia, two from the United Arab Emirates, one from Lebanon, and one from Egypt.", "The 9/11 Commission Report, published in 2004, provided a comprehensive account of the 9/11 terrorist attacks, the events and circumstances leading to the attacks, and recommendations to prevent other attacks.", "Soleimani is not named anywhere in the report.", "A section of the report said Iranian officials had been willing to facilitate the travel of al-Qaida members through Iran, on their way to and from Afghanistan, telling Iranian border inspectors not to stamp the passports of those travelers. (Iran and Afghanistan share a border.)", "The report said that Saudi \"muscle\" operatives traveled into or out of Iran between October 2000 and February 2001. \"Muscle\" operatives were hijackers who would storm cockpits and control passengers.", "But the report also said it found no evidence that Iran was aware of the planning for what later became the 9/11 attack.", "\"At the time of their travel through Iran, the al-Qaida operatives themselves were probably not aware of the specific details of their future operation,\" the report said.", "So while the report mentions Iranian officials’ willingness to facilitate the travel of al-Qaida members, it doesn’t implicate Soleimani.", "Philip Zelikow, executive director of the 9/11 Commission Report, told PolitiFact that the report did not directly tie Soleimani to assisting the travel of the terrorists and that he was not aware of any other information that would tie Soleimani to their travel.", "Two other experts shared the view of a lacking Soleimani connection: James Gelvin, a professor of modern Middle East history at UCLA, and Hooshang Amirahmadi, a distinguished service professor at Rutgers University with expertise in United States-Iran relations.", "What is Pence’s defense?", "Pence spokeswoman Katie Waldman pointed out the Trump administration’s April 2019 stated intention to designate the Islamic Revolutionary Guard Corps as a foreign terrorist organization. The administration in a fact-sheet said the U.S. Treasury Department in 2016 sanctioned three senior al-Qaida operatives in Iran, and that Iran had knowingly permitted those operatives, including several of the 9/11 hijackers, to transit Iran on their way to Afghanistan. But that fact-sheet does not mention Soleimani.", "Pence’s tweet said Soleimani assisted \"10 of the 12 terrorists,\" and Twitter users pointed out that there were 19 terrorists on 9/11. Waldman tweeted, \"For those asking: 12 of the 19 transited through Afghanistan. 10 of those 12 were assisted by Soleimani.\" Her tweet did not provide any additional information or links to evidence to support Pence’s claim.", "Pence said that Soleimani \"assisted in the clandestine travel to Afghanistan of 10 of the 12 terrorists who carried out the September 11 terrorist attacks in the United States.\"", "The 9/11 Commission Report said that Iran facilitated travel for al-Qaida members who would carry out the 9/11 attacks. But the report also found no evidence that Iran knew of the plans for the attacks. The report also does not mention Soleimani. We found no evidence that Soleimani was involved with the travel of terrorists from Iran to Afghanistan.", "In the absence of evidence for Pence’s claim, we rate his statement False.", "Twitter, @Mike_Pence tweet, Jan. 3, 2020", "Twitter, @VPPressSec tweet, Jan. 3, 2020", "U.S. Treasury Department, Treasury Designates Three Senior Al-Qaida Members, July 20, 2016", "U.S. State Department, Designation of the Islamic Revolutionary Guard Corps, April 8, 2019", "U.S. Defense Department, Statement by the Department of Defense, Jan. 2, 2020", "FAS.org, 9/11 Commission Report", "Council on Foreign Relations, Iran’s Revolutionary Guards, last updated May 6, 2019", "Email interview, James Gelvin, a professor of modern Middle East history at UCLA, Jan. 6, 2020", "Email interview, Philip Zelikow, executive director of the 9/11 Commission Report, Jan. 6, 2020", "Phone interview, Hooshang Amirahmadi, a Distinguished Service Professor at Rutgers University, Jan. 6, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]