["The two-minute and 54-second video was published on Facebook here on August 8, 2020.", "The caption reads: “New Zealand Prime Minister Jacinda Ardern visits Hindu Temple after declaring no Covid patients in her country.”", "The video was also shared alongside the same claim here, here, here and here on Facebook, and here, here and here on Twitter.", "The claim, however, is misleading.", "Keyword and reverse image searches found that the footage shows Ardern visiting the Hindu temple in the city of Auckland on August 6, 2020.", "Three days later, on August 9, New Zealand announced that it had been 100 days since it had recorded a single COVID-19 case that “was acquired locally from an unknown source,” the Ministry of Health declared here.", "The same footage of Ardern’s August 6 visit was also published on YouTube here on August 7 by Desh Gujarat, a regional Indian news outlet. The post is titled: “New Zealand Prime Minister Jacinda Ardern visits Radha Krishna Hindu Temple in Auckland.”", "Below is a screenshot comparison of keyframes in the misleading post (L) and the YouTube video (R):", "Ardern visited the temple to speak at an event organised by Indian Newslink and Radio Tarana, two Indian community media outlets in New Zealand.", "Indian Newslink published the livestream of Ardern’s speech here and a photo album of the event here and here. Radio Tarana published photos from the event here.", "The August 6 event was also attended by Muktesh Pardeshi, India’s High Commissioner to New Zealand. Pardeshi published photos of Ardern’s visit to the temple here on Twitter on August 8.", "“Some precious moments with the honourable Prime Minister of New Zealand, Ardern, at ⁦Indian Newslink event on 6 Aug 2020. She paid a short visit to Radha Krishna Mandir and enjoyed a simple Indian vegetarian meal- Puri, Chhole and Daal,” the tweet read.", "New Zealand's dream run of 102 days without locally transmitted coronavirus ended on August 11, prompting a stay-at-home lockdown order for the country's largest city, Auckland, AFP reported here.", "The misleading post was also debunked by BOOM, an Indian fact-checking organisation, here on August 11, 2020,", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]