["“This Nagpur Congress neta snatched milk from poor Farmers & spilled it on road. He also abused & threatened police men when they try to stop him” tweeted Rishi Bagree, a serial faker repeatedly caught spreading misinformation. Bagree has shared a photograph showing a person spilling milk on the road and using abusive language against the police during a farmers’ protest in Maharashtra which has gone viral on social media. In his tweet, he has alleged that this person is a Congress leader. At the time of writing this article, Bagree’s tweet has been retweeted more than 900 times. The tweet from this account @rishibagree which is followed by PM Modi has been shared by multiple accounts.", "This Nagpur Congress neta snatched milk from poor Farmers & spilled it on road . He also abused & threatened police men when they try to stop him pic.twitter.com/T93ncTrFIR", "— Rishi Bagree 🇮🇳 (@rishibagree) June 4, 2018", "किसान आंदोलन का घिनौना सच! यह साबित हो गया है कि आंदोलन के पीछे कांग्रेस के कुत्तों का हाथ है! इसे ज्यादा से ज्यादा शेयर करें और लोगों को जागरुक कीजिए! (The disgusting truth of farmer’s protest, this proves that Congress’ dogs were behind it. Share this to the max, so that people become aware- translated). The photo has been shared more than 32000 times so far from a Facebook page ग्रेट नरेन्द्र मोदी(Great Narendra Modi).", "किसान आंदोलन का घिनौना सच…👇 😡 👉 यह साबित हो गया है कि आंदोलन के पीछे कांग्रेस के कुत्तों का हाथ है", "➡ इसे ज्यादा से ज्यादा शेयर करें और लोगों को जागरुक कीजिए!", "Posted by ग्रेट नरेन्द्र मोदी on Monday, 4 June 2018", "Multiple pages also had shared the same image with the exact text claiming that the protest was backed by Congress leaders and the party workers had coerced the farmers to join the protest by spilling their milk. The image was also shared more than 24000 times so far from another Facebook page विधानसभा क्षेत्र कसरावद BJP (Assembly Area Kasrawad).", "While a number of BJP leaning accounts have shared this image claiming the person is a Congress leader, a Twitter user Shumbham Amdhare countered this claim and said that the person in the photo is Prashant Pawar, an MNS leader from Nagpur.", "This Hate Monger @rishibagree spreading Lies by targeting Congress without have knowledge . Men in this pic is Prashant Pawar MNS leader from Nagpur BJP IT cell can share anything to target Cong Be aware Cc @free_thinker@ameytirodkar@Awhadspeaks @jencyjac https://t.co/vbLEYaRLTm", "— Shubham Amdhare (@shubhamamdhare) June 4, 2018", "Alt News compared the viral image with a photograph of Prashant Pawar and found that the two match. Prashant Pawar was the Deputy City Chief of Nagpur for MNS. He quit the party two years back, and is currently the director of Jai Jawan Jai Kisan, an NGO working for farmers’ rights.", "Prashant Pawar in a conversation with Alt News regarding the allegation raised about his political allegiance said, “I have no links with Congress except for being an NSUI student leader in 1984 and I have also left MNS from two years. These BJP goons don’t know how to respond farmer’s protest hence they are linking it with a political party. Our NGO is fighting for the farmers’ rights from last five years”. Moreover, Nagpur Today, a local News website based in Nagpur also confirmed that Prashant Pawar is an ex MNS leader and has no political links with Congress.", "He is Prashant Pawar, ex-mns leader, no way connected to Congress, can google his name for truth..", "— Nagpur Today (@nagpurtoday1) June 4, 2018", "While the source story published by ANI made no reference to political parties and leaders, it reported that a 10-day protest was organized by Rashtriya Kisan Mahasangh, a farmers’ organisation. These are the images of the 4th day of protest when the farmers spilled their milk produce on the road in protest against Union Agriculture Minister Radha Mohan Singh’s recent remark on the agitation.", "Misinformation of this nature is usually part of a systematic political campaign that plays out on a daily basis on social media. In this instance, the Congress party has been targeted by the pro-BJP ecosystem.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]