["The two-minute clip was published here on Facebook on November 18, 2020.", "The video caption states: “Kolkata resumes its local suburban EMU train after 8 months. Corona getting confused as to whom to attack.”", "Kolkata is the capital city of the northeastern Indian state of West Bengal. According to this report by Indian newspaper The Hindu, local suburban train services in the city resumed on November 11, 2020 after a seven-month hiatus caused by the novel coronavirus pandemic.", "The video was also shared here, here, here and here on Facebook, and here, here, here and here Twitter, alongside a similar claim.", "The claim is false.", "A reverse image search using keyframes extracted from the video in the misleading post found an identical clip published here on Facebook on September 23, 2018.", "The video’s Bangla-language caption reads: “Ranaghat station at 8:30am Bangaon local.", "“Today is the test of the West Bengal Police Constable, and it was a battle to reach the test center. See what happens if you take the exam in one day. The government should think of alternatives to avoid holding the exam in one day. It causes a lot of problems for the common examinees. Please suggest ideas for alternatives. Ranaghat station. Video- #Sumanta Kumar Nath.”", "Ranaghat Railway Station is located 80 kilometers (50 miles) north of Kolkata, in the Nadia district of West Bengal.", "A subsequent keyword search found that India’s Eastern Railways also denied the false claim here on Twitter on November 13, 2020.", "THIS IS VERY OLD & MISLEADING VIDEO. NOT PERTAINING TO PRESENT TIME. NOT PERTAINING TO RESTORATION OF EMU SERVICES ALSO. EVERYONE IS REQUESTED TO STOP SPREADING OF SUCH MISINFORMATION. pic.twitter.com/MmcSnBPM6H", "It reads: “This is [a] very old & misleading video. Not pertaining to present time. Not pertaining to restoration of EMU services also. Everyone is requested to stop spreading of [sic] such misinformation.”", "Sumanta Kumar Nath, credited as the source of the video in the 2018 Facebook post, previously told AFP he filmed the clip at Ranaghat Station, in reference to another misleading claim about the same video debunked by AFP in November 2018.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]