["About this rating", "Photographic and video evidence, as well as her emergency department discharge instructions, show DeLuca suffered facial injuries consistent with being assaulted during an incident at the Women's March in Washington, D.C., on Oct. 17, 2020.", "However, video footage indicates that DeLuca instigated or escalated a physical confrontation with rival protesters by pushing a woman and then confronting her after retrieving her Trump 2020 flag from the ground.", "Evidence is lacking as to whether DeLuca's flag was forcibly taken from her in the first place, as she claims, something that could quite reasonably be understood as an act of aggression. If her flag was torn from her hands, the level of physical force potentially involved in that action is also not known.", "In October 2020, readers asked Snopes to look into allegations made by Isabella Maria DeLuca, a Republican activist who claimed she was assaulted by left-wing protesters at the Oct. 17 \"Women's March\" in Washington D.C.", "On Oct. 17, DeLuca, who is outreach director for the conservative group Republicans for National Renewal, wrote on Twitter: \"I just got punched in the face and choked by two women because I was holding a Trump flag here at the Supreme Court.\"", "DeLuca attended a counterprotest against the Women's March at the U.S. Supreme Court on Oct. 17 that was organized to express opposition to U.S. President Donald Trump and any U.S. Senate confirmation of the appointment of Amy Coney Barrett to the Supreme Court. DeLuca carried a flag that read \"Trump 2020 — Keep America Great,\" as shown in footage recorded by the website Breitbart.", "Later on the day of the protest, DeLuca posted photographs of herself wearing a neck brace, one of which also showed what appeared to be a bloodied mouth and contusions on her chin and right cheek. On Oct. 19, she posted a short video of herself with what appeared to be bruising on her chin, mouth, and left cheek.", "On Oct. 18, the Pulitzer Prize-winning photographer Carol Guzy posted two photographs of DeLuca, the captions of which described her as having suffered a \"bloodied mouth after a scuffle with marchers.\"", "DeLuca's experience formed the basis of several news reports by right-wing websites, all of which unambiguously presented her as the victim of a politically motivated assault by left-wing and Black Lives Matter (BLM) protesters. On Oct. 18, she gave further details about the incident to the National File:", "“The first woman was a white older woman – she had glasses on, a glittery bedazzled Black Lives Matter shirt,” Deluca told National File. “She looked like she could’ve been my grandma, honestly.”", "The Black Lives Matter supporter grabbed DeLuca’s Trump flag, and then when DeLuca attempted to grab it back, the woman punched and choked her. Due to the advanced age of the woman and her presumably fragile condition, DeLuca felt reluctant to defend herself, but was determined to get her property – the Trump flag – back.", "It was at that moment that a much younger female leftist arrived on the scene and began joining her older compatriot in hitting, pushing and punching DeLuca.", "The Blaze posted an article with the headline \"Women's March, BLM Activists Reportedly Pummel Female Trump Supporter, Who Ends Up Hospitalized for Head, Neck Injuries,\" while RF Angle, a right-wing website started by Students for Trump co-founder Ryan Fournier, published an article with the headline \"Young Female Trump Supporter Brutally Beaten at DC Woman’s March.\"", "DeLuca certainly appears to have suffered facial injuries during an incident at the protest and counterprotest on Oct. 17. However, the evidence and testimony in support of the claim that she was the victim of a unilateral assault, as opposed to being hurt during a fight, or even after instigating violence, is not definitive. For those reasons, we are issuing a rating of \"Mixture.\"", "DeLuca gave Snopes the following account of her experience:", "Some lady grabbed my flag and when I went to go and retrieve my flag, I put my hand up so she didn’t kick me while I was down. When I went to come back up from getting my flag, some lady punched me in the face and I was hesitant to punch her back, but I also had to defend myself. Another woman got involved and punched me in the face, they both choked me at some point, and then the fight had broke up.", "DeLuca told Snopes that the incident took place early in the afternoon of Oct. 17 in front of the Supreme Court and that she left the scene around 15 or 20 minutes later. In response to our inquiries, she said she told a nearby police officer what happened, but she did not make a formal police report because she was focused on getting medical attention for her injuries, though she added that she might still make such a report.", "DeLuca provided Snopes with a redacted copy of her discharge instructions from the emergency department at Howard University Hospital in Washington D.C. The document lists the date of her admission as Oct. 17 and her \"final diagnosis\" as \"assault.\" (A photograph of the document can be viewed below. Snopes has redacted additional details, out of an abundance of caution and concern for DeLuca's privacy). This constitutes definitive proof that DeLuca did indeed go to the hospital with her injuries and emergency department medical staff deemed her injuries to have been consistent with an assault.", "However, the circumstances leading up to the incident are less clear. On Oct. 18, a Twitter user with the handle @mariahhh_faithh posted a short video, originally published on her own TikTok account, which is no longer available.", "The video shows DeLuca, dressed in black with blonde hair, amid a crowd of anti-Trump protesters, a few feet away from her Trump 2020 flag, which is on the ground. She walks quickly toward an older woman wearing a pink T-shirt and \"I can't breathe\" face mask and carrying an \"Arrest Trump\" sign. DeLuca strides towards the woman and pushes her with both hands:", "DeLuca then picks up her flag and quickly walks toward the woman, who is retreating:", "What happens next is obscured by bystanders, but a few seconds later DeLuca emerges with her mouth bloodied and gets into a verbal altercation with protesters. The video can be watched below:", "Of @mariahhh_faithh's video, DeLuca told Snopes, \"The video that is circulating is clearly edited and cropped up to the beginning of the assault because my flag was already on the ground – I was already going to get my flag from the girl. How did my flag end up on the ground if it wasn’t taken from me? I didn’t put it there, someone stole it from me.\"", "Notwithstanding DeLuca's claims that the video was selectively edited and the woman in the pink T-shirt first took the flag from her and threw it on the ground, DeLuca notably did not claim that she was struck or pushed first. Moreover, the footage posted by @mariahhh_faithh shows that DeLuca did not merely \"put my hand up to retrieve [the flag] from the ground so I didn't get kicked while I was down on the ground,\" as she claimed on Twitter. In fact, she actively pushed the woman in question with both hands. Then, when she had retrieved the flag from the ground, she did not simply walk away with it, she walked quickly towards the woman in question, in what could readily be interpreted as an aggressive manner.", "The purpose of this analysis is not to offer a moral critique of DeLuca's actions or the actions of the woman in the pink T-shirt. Tearing a flag from another person's hands (if that is what happened) could quite reasonably be interpreted as an aggressive act, and DeLuca's visible anger might well be eminently understandable to many viewers.", "However, the video footage indicates that she was not simply set upon, or the victim of a unilateral assault, as subsequent online articles claimed. She chose to push the woman in the pink shirt, an action that was not necessary for the purpose of retrieving her flag, and when she had the flag in her hands again, DeLuca chose to walk quickly towards that woman, rather than walking away.", "However, DeLuca was right to point out that the footage does not show what preceded this incident or the level of physical contact and force involved in taking the flag from her hands in the first place, if that is what happened. Although DeLuca did not tell Snopes that she was struck or pushed before she went to retrieve the flag, it's possible that that is what happened, a scenario that would mean she was not primarily responsible for instigating or escalating the level of physical force involved in the confrontation. Snopes reviewed several hours of video footage from the protest and counterprotest, published by various sources, and we did not find any evidence relating to the moments leading up to the incident shown in @mariahhh_faithh's video.", "On her TikTok account (@mariahdrocella), Twitter user @mariahhh_faithh posted three videos offering her first-hand account of the incident. That TikTok account is no longer available, but Snopes recorded the videos in which @mariahdrocella said she wasn't sure whether DeLuca dropped her flag or it was taken from her hands. She added:", "She went down to pick up her flag. As she was standing up, [she] raised her hands and started charging at an older woman... Someone else stopped her and then when she still continued to push through the person stopping her, that girl did hit her in the face... She didn't get hit just because she's a Trump supporter, she got hit because she was trying to assault someone else.", "Evidence is also lacking to support the claim that DeLuca was attacked by BLM activists, specifically. In her interview with National File, she described one of the women who assaulted her as a \"white older woman – she had glasses on, a glittery bedazzled Black Lives Matter shirt.\" However, in @mariahhh_faithh's video, the incident that appears to have left DeLuca with a bloodied mouth is obscured by bystanders. So we can't identify the person who appears to have punched DeLuca, or what they were wearing.", "The woman whom DeLuca can be seen pushing wore a pink T-shirt with what appears to be a \"My Roots\" design — a graphic that consists of a woman wearing glasses, whose hair is composed of images of iconic figures from Black history, including Nelson Mandela, Thurgood Marshall, Jessie Owens, and Barack and Michelle Obama. The same T-shirt was worn by others at the Oct. 17 Women's March. A screenshot of the woman pushed by DeLuca can be viewed below, alongside a clearer image of the T-shirt, worn by another protester, and a postcard available for purchase online:", "The T-shirt does not appear to mention the BLM movement, so even if the woman whom DeLuca pushed later struck her, it would constitute poor evidence for the claim that DeLuca was struck by BLM activists, although that remains a possibility.", "Rivero, Eduardo.  \"Trump Supporter Hospitalized By Black Lives Matter Thugs At Women’s March.\"\r\n    National File.  18 October 2020.", "Taylor, Sarah.  \"Women's March, BLM Activists Reportedly Pummel Female Trump Supporter, Who Ends Up Hospitalized for Head, Neck Injuries.\"\r\n    The Blaze.  19 October", "RF Angle.  \"Young Female Trump Supporter Brutally Beaten at DC Woman’s March.\"\r\n    17 October 2020.", "[Updated] 20 October 2020: Added redacted photograph of DeLuca's hospital discharge instructions; clarified that DeLuca's earlier remarks referred to @mariahhh_faithh's Twitter video.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]