["By Angelo Fichera", "Posted on November 12, 2018", "Q: Was former National Security Adviser Michael Flynn recently cleared by the FBI in the Russia probe?", "A: No. A website makes that claim based on an outdated news story that was published prior to Flynn pleading guilty to making false statements to FBI agents about his conversations with a top Russian official.", "The website of anti-Islamic activist Pamela Geller reposted an outdated story that says the “FBI clears” retired Lt. Gen. Michael Flynn — President Trump’s former national security adviser. It has not. Flynn has pleaded guilty to lying to the FBI about his post-election conversations with a top Russian government official.", "The Geller Report published an item on Nov. 5 that begins: “It was all a big fat lie — a coup against the President that continues to this very day. But the real criminals — Hillary Clinton and co. — escape justice.” The next three paragraphs are identical to a Jan. 24, 2017, story in the New York Post that carried the headline, “FBI clears Michael Flynn in probe linking him to Russia.” The Geller Report used the same headline.", "But Geller disregards developments that have occurred since the New York Post story appeared nearly 22 months ago.", "That New York Post story was based on Washington Post article from a day earlier that said FBI agents investigating Russian interference in the 2016 election had “reviewed intercepts of communications” in December 2016 between Flynn, then an adviser to the president-elect, and Sergey Kislyak, the Russian ambassador to the U.S. at the time. Citing U.S. officials, the Washington Post reported that the FBI “has not found any evidence of wrongdoing or illicit ties to the Russian government.”", "However, a day after the Washington Post published its story, the FBI interviewed Flynn about his conversations with Kislyak. And months later, on Dec. 1, 2017, the special counsel’s office announced that Flynn pleaded guilty to making false statements to FBI agents during that interview, as we’ve explained in our article about “Michael Flynn’s Russia Timeline.”", "During a Dec. 22, 2016, call with Kislyak, according to the special counsel’s office, Flynn asked Russia to delay or defeat a U.N. Security Council resolution — something Flynn initially denied to the FBI. In another call, seven days later, Flynn discussed sanctions the Obama administration placed on Russia for its interference in the election. The special counsel’s office said that Flynn asked Russia to refrain from escalating the situation; Kislyak agreed that Russia would “moderate its response to those sanctions” following the request. When interviewed about that second call by the FBI, Flynn denied making that request and couldn’t recall if Kislyak had agreed to it.", "When Flynn agreed to plead guilty for lying about those conversations, he said in a statement that he would cooperate with the special counsel’s investigation. He is scheduled to be sentenced next month.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on the social media network.", "Geller, Pamela. “FBI clears Michael Flynn in probe linking him to Russia.” Geller Report. 5 Nov 2018.", "Kiely, Eugene. “Michael Flynn’s Russia Timeline.” FactCheck.org. 1 Dec 2017.", "Order No. 3915-2017: Appointment of Special Counsel to Investigate Russian Interference with the 2016 Presidential Election and Related Matters. U.S. Office of the Deputy Attorney General. 17 May 2017.", "United States of America v. Michael T. Flynn.  1:17-cr-00232-RC. U.S. District Court, District of Columbia. Letter. 1 Dec 2017.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]