["About this rating", "A set of unrelated images, one showing Lady Gaga wearing a (possibly fake) fur accessory, the other showing a baby fox in a cage, has been passed around the internet with a variety of messages claiming that that this animal was brutally killed and made into a clothing item for the famous singer.", "Here's how the Facebook page Humans Heart Animals presented these images in February 2017:", "This is the white fox cub that was killed for Lady Gaga’s fashion statement.", "They put an electric prod up her rectum and electrocuted her from the inside out.", "Lady Gaga has considerable influence over people. Please let her know that while you love her music, you hope she’ll reconsider her actions toward animals.", "These photographs were also featured in a petition on the web site DailyPetitions.com and in an article on the web site DogsMakeLifeBetter.com. Both of these stories claimed that this fox was skinned alive and that the customer who bought its fur was none other than Lady Gaga:", "This is Kimi, a gorgeous white fox. He was just a baby when he was taken away from his family and put in a small, dirty cage in a fur farm in Finland. Months passed and Kimi was still confined to that tiny place, with no chance of escaping. His life was absolutely miserable.<", "Then, one day the order to have this poor baby skinned alive arrived. The customer: Lady Gaga. The pop icon was looking for something fashionable to wear and had a fox fur scarf in mind as an accessory. Kimi died in agony just so Lady Gaga could be in trend. The picture of the left shows what Kimi’s life was worth to the controversial singer: absolutely nothing.", "These photographs are both real. However, they are not related to one another.", "The photograph of Lady Gaga was taken in 2012. It stirred up considerable controversy at the time when animal rights groups such as PETA criticized the singer for wearing fur. Lady Gaga never confirmed whether the fox accessory was made of real or faux fur, but she did say that she \"always stayed away from skinned fur\" in a message posted to her web site (emphasis ours):", "To the fans. i want you to know that I care deeply about your feelings and views, and I will always support your philosophies about life. We’ve been having over-arching conversations about society, equality, and politics for the past five years, and we should continue. I do not however support violent, abusive, and childish campaigns for ANY CAUSE. Particularly one that I respect. “Animal Rights.” I am choosing not to comment on whether or not the furs I purchase are faux fur-pile or real because I would think it hypercritical not to acknowledge the python, ostrich, cow hide, leather, lamb, alligator, “kermit” and not to mention meat, that I have already worn. This should already put me in a category as one who appreciates and adores the beauty of animals in fashion, but am not a strict vegan. I have truly always stayed away from skinned fur, especially i have never been able to afford a nice one, but this does not mean my morals are rigid and that I won’t bend at the sight of an absolute art piece of a coat. I have no chains about this. You see a carcass, I see a museum pièce de résistance. But I am truly sorry to fans who are upset by this, its a fair and applaudable feeling about the health and safety of animals. I respect your views, please respect mine. And to campaigners, Save your flour to make bread for the children who are hungry. And Kim Kardashian is fabulous.", "While Lady Gaga dodges a direct answer on whether this particular coat was made from real fox fur, it was certainly not made from the animal pictured above.", "Two years after Lady Gaga was photographed with her fox fur, a baby fox named Kimi was scheduled to be slaughtered at a fur farm in Finland. The animal rights group Four Paws shared several photographs of this fox (including the one above) as part of a campaign to prevent Kimi being killed and turned into a clothing item.", "The Independent reported at the time:", "The campaign centres around a fox cub called Kimi, which currently lives on a fur farm in Finland but is likely to be slaughtered in November during the so-called “fur harvest”.", "An online petition to save the fox, set up by the animal welfare organisation has so far garnered over 125,000 signatures, while a further 35,000 hard copy signatures have also been collected by the group.", "FOUR PAWS UK Country Manager, Julie Sanders, said: “If the British public knew the horror of what goes on behind the scenes on Finnish fur farms that provide fur to companies like Burberry, they would be shocked. Our campaign to save Kimi aims to show them this by focusing in on the experiences of just one specific fox, Kimi, who is being farmed on one of these Finnish farms for his fur.”", "Burberry released a statement explaining that animal welfare was a key consideration when acquiring fur for their clothing items:", "“Animal welfare is a key consideration when sourcing animal-derived materials, including fur, and have an on-going programme of work to improve the traceability system so that we are able to link the individual fur skin to the farm where the animal comes from.”", "“We work closely with our suppliers, including SAGA, to improve animal welfare standards beyond legal compliance and to adopt third-party monitoring systems.”", "Although we aren't certain about Kimi's ultimate fate (the final entry on the Four Paws campaign was posted in December 2014 and stated that Kimi was still alive), the fur from this particular baby fox certainly wasn't used for a clothing item Lady Gaga wore in 2012.", "McGrath, Stephen.   \"Save Kimi: 'When I Grow Up, I’m Going to be a Fur Collar' -- Burberry Under Fire from Animal Rights Group.\"\r\n    The Independent.   19 October 2014.", "Rolling Stone.   \"Lady Gaga Responds to PETA Criticism for Wearing Fur.\"\r\n    16 August 2012.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]