["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Former first lady Michelle Obama speaks during the first night of the Democratic National Convention, Aug. 17, 2020. (Democratic National Convention via AP)", "During her closing speech on the first night of the virtual Democratic convention, former First Lady Michelle Obama emphasized the high electoral stakes in November by pointing to the narrow margins that vaulted Donald Trump into the White House in 2016.", "\"In one of the states that determined the outcome, the winning margin averaged out to just two votes per precinct — two votes,\" Obama said.", "She’s referring to Michigan, and her math is accurate.", "In the 2016 election, Michigan — one of three crucial states that Trump flipped from the Democrats on his way to victory — had 4,810 precincts.", "The final count in the presidential race had Trump with 2,279,543 votes in Michigan and his Democratic opponent, Hillary Clinton, with 2,268,839. That’s a winning margin for Trump of 10,704 votes.", "Michigan has 83 counties, of which Clinton won only eight. Trump won as much as 74% of the vote in Missaukee County, about 50 miles southeast of Traverse City, where just 7,000 people voted. For her part, Clinton’s best performance was in Washtenaw County, which includes the university town of Ann Arbor, with almost 68% of the roughly 188,000 votes cast.", "But on average, dividing 10,704 votes by 4,810 precincts leaves 2.23 votes per precinct.", "As it happened, each of three third party candidates — Gary Johnson, Jill Stein, and Darrell L. Castle — also won more votes than Trump’s margin over Clinton.", "Overall, Obama won 20 counties in Michigan, while Clinton won only eight; she lost 12 counties Barack Obama had won in 2012 while he was winning the state as a whole. A crucial shift came in working-class Macomb County, which Obama won by four points but Trump won by 11. Trump’s margin of victory in Macomb County was easily enough to hand the state to Trump by itself.", "Obama said, \"In one of the states that determined the outcome\" of the 2016 presidential race, \"the winning margin averaged out to just two votes per precinct — two votes.\"", "In Michigan, Trump’s winning margin averaged out to just over two votes per precinct. We rate the statement True.", "CNN, \"Transcript: Michelle Obama's DNC speech,\" Aug. 17, 2020", "Michigan Department of State, \"2016 Biennial Precinct Report,\" accessed Aug. 17, 2020", "Dave Leip’s Atlas of U.S. Presidential Elections, accessed Aug. 17, ,2020", "Almanac of American Politics 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]