["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Rep. Don Beyer, D-8th, says the U.S. must assure single moms earn the same pay as men", "Rep. Don Beyer says the U.S. needs to help young moms raising children on their own.", "\"A growing percentage of women are single mothers; more than half of women under 30 who give birth do so outside of marriage and consequently serve a significant economic role for that child,\" Beyer, D-8th, says on his congressional website.", "We wondered if it’s true that most women under 30 having babies are unwed.", "Tia Shuyler, Beyer’s spokeswoman, pointed us to a series of reports and news articles on births to single mothers. But none of the sources provided a definitive source for the claim, so we went to the Centers for Disease Control and Prevention, which keeps detailed records on births in the U.S. and mothers’ marital status.", "The proportion of babies born to unmarried mothers has generally risen during the last 75 years, according to CDC figures. In 1940, 3.8 percent of all births were to unmarried women. By 2009, 41 percent of all births were to unmarried moms.", "But Beyer’s statement required deeper research because it focused on women under 30. CDC records show that in 2005, 49 percent of babies born to women under 30 were born out of wedlock. They crossed 50 percent for the age group in 2006 and reached 54 percent in 2009. Amid the halting recovery from the Great Recession, the number has remained essentially flat.", "So the bottom line is that the proportion out-of-wedlock births -- both for all mothers and those under 30 -- has recently been stagnant, but historically has increased.", "Isabell Sawhill, a senior fellow at the Brookings Institution, offered a couple of reasons for the the long-term increases. One is that women have more opportunities to provide for themselves and their children outside of marriage and don’t feel the need to have a husband to support them, she said.", "\"Marriage is on the decline is the simple explanation,\" Sawhill said. \"Each generation is marrying less than the previous one. If you take the women under the age of 30, you are talking about the youngest generation, so the proportion having children outside of marriage is larger because they are the most recent generation.\"", "Social norms could also be playing a part, Sawhill said.", "\"It used to be if you had a baby outside of marriage, you were stigmatized,\" she said. \"That is no longer true. It’s so common now, it is quite accepted.\"", "The U.S. Census Bureau, in a 2013 report , also examined the proportion of unmarried moms under 30. It found about half of such mothers who gave birth in 2010 and 2011 were unwed.", "The younger the mother, the higher chance of her being single. Of mothers age 15 to 19 with a recent birth, 86.1 percent of them had their babies out of wedlock. Among women age 20 to 24 with a recent birth, 61.5 percent of them weren’t married, and 31.9 percent of mothers age 25-29 had their babies outside marriage.", "Many reports, including from The New York Times and The Urban Institute, have noted that for unmarried women under 30, their birth rate has been declining in recent years. Many analysts attribute the fall-off at least partly to the economy as some mothers put off having babies or decide not to have them at all.", "For mothers of all ages, the birth rate has been going down, but preliminary CDC figures for 2014 showed an uptick.", "Our ruling", "Beyer said \"more than half of women under 30 do so outside of marriage.\"", "Government figures back up his assertion. We rate his statement True.", "Rep. Don Beyer, \"Women’s economic empowerment,\"accessed June 15, 2015.", "Email from Tia Shuyler, spokeswoman for Rep. Don Beyer, June 16, 2015.", "Pew Research Center, \"Birth rate for unmarried women declining for the first time in decades,\" Aug. 13, 2014.", "The Urban Institute, \"Millennial childbearing and the recession,\" April 2015.", "The New York Times, \"Single motherhood, in decline over all, rises for women 35 and older,\" May 8, 2015.", "The New York Times, \"For women under 30, most births occur outside of marriage,\" Feb. 17, 2012.", "Interview with Isabel Sawhill, senior fellow at the Brookings Institution, Jan. 16, 2015.", "Interview with Steven Martin, senior research associate at the Urban Institute, July 18, 2015.", "Emails from Bill Albert, chief program officer for the National Campaign to Prevent Teen and Unplanned Pregnancy, June 19, 2015.", "Centers for Disease Control, \"Recent declines in nonmarital childbearing in the United States,\" accessed June 16, 2015.", "CDC Births, Births: Preliminary data for 2014, June 17, 2015.", "CDC Births, Births: Final data for 2013, June 15, 2015.", "Centers for Disease Control, Birth Data, accessed June 18, 2015.", "CDC final birth data reports, 2005-2013.", "Email from Krystal Cottman, spokeswoman for the National Center for Health Statistics at the CDC, June 16, 2015.", "U.S. Census Bureau, \"Social and economic characteristics of currently unmarried women with a recent birth: 2011,\" May 2013.", "Child Trends, \"Childbearing outside of marriage: Estimates and Trends in the United States,\" November 2011.", "Johns Hopkins University, \"Changing Fertility regimes and the transition to adulthood: Evidence from a recent cohort,\" 2012.", "Slate, \"For millennials, out-of-wedlock childbirth is the norm,\" June 23, 2014.", "PolitiFact, \"Rick Santorum says over 40 percent of children are born out of wedlock,\" Feb. 24, 2012.", "Richmond Times-Dispatch, \"Increase in births ‘tied to the economy,’\" June 18, 2015.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]