["Multiple Facebook posts shared tens of thousands of times claim that chewing betel quids can prevent infection from the novel coronavirus, which causes the disease Covid-19. The claim is false, health experts say; representatives for Myanmar’s Ministry of Health and Sport and the European Food Safety Authority both separately told AFP that the claim was not true.", "The claim was published here on Facebook on March 30, 2020. It has been shared 34,000 times.", "The Burmese-language post translates to English, in part, as: “Well, to all brothers who chew betel quid, you can be happy now. Slaked lime, Ca(OH)2, the alkali in betel quid, can destroy the fat layer of coronavirus and kill the virus because the virus is coated with a fat layer. If the virus enters the mouth of someone eating betel quid, it will die because of the slaked lime. According to statements (ed: the post didn’t mention which statements or who released them), the virus infection stopped in Wuhan, China after lime (ed: didn’t mention what kind of lime; slaked lime or hydraulic lime) was sprayed across the city. The current (Covid-19) positive patients are those who don’t eat betel quid and infection rates in Myanmar are low because of betel quid.”", "Betel quid, the main ingredients of which are betel leaf, areca nuts, slaked lime and tobacco, is a popular stimulant in Myanmar. But doctors have warned that chewing it regularly increases the risk of developing mouth cancer, as AFP reported here.", "The same posts were found here, here, here, here, and here on Facebook alongside a similar claim.", "The claim, however, is false.", "In response to the misleading posts, Dr. Khin Khin Gyi, a director at Myanmar's Centers for Disease Control and Prevention Unit, Health and Sport Ministry, told AFP the claim that chewing betel quid can prevent coronavirus infection is “absolutely false news”.", "During a phone conversation on September 22, 2020, Dr. Khin Khin Gyi said, “It’s completely false news. Slaked lime can’t kill the coronavirus.”", "“Betel quid consumers’ habit of spitting red saliva on the ground after chewing it “can be infectious”, he added.", "The European Food Safety Authority also refuted the claim about slaked lime, Ca(OH)2, and its purported benefits in preventing coronavirus infection.", "“There is no approved health claim in the EU for such an effect of calcium hydroxide in food supplements or added to foods,” a spokesperson for the European Food Safety Authority told AFP in an email on September 30.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]