["About this rating", "After his death in September 2017, Playboy magazine founder Hugh Hefner was criticized in both conservative and liberal circles for, among other things, wanting to be entombed next to actress Marilyn Monroe despite Monroe's displeasure at the way the magazine featured her in its first cover.", "A conservative web site, New Wave Feminists, garnered more than 94,000 shares on its Facebook page for a post highlighting Hefner's affinity for Monroe.", "Hefner, who died on 27 September 2017, was laid to rest in a crypt at the the Pierce Brothers Westwood Village Memorial Park cemetery in Los Angeles. He was reportedly interred next to Monroe, who was placed in the same cemetery in August 1962.", "Hefner told the Los Angeles Times in 2009 that he paid $75,000 to be interred next to Monroe:", "I'm a believer in things symbolic. Spending eternity next to Marilyn is too sweet to pass up.", "We contacted Playboy Enterprises seeking further comment but have not heard back at press time.", "Monroe was on the cover of the magazine's first issue in December 1953 and was also the centerfold. The latter picture, however, was taken during a 1949 nude photoshoot. In the biography Marilyn: Her Life in Her Own Words,  George Barris quotes her Monroe saying that she took photographer Tom Kelley up on his proposal to pay her $50 to shoot her in the nude \"when [she] really had no work and no money\":", "Out of desperation I called Tom Kelley and asked him, was he still willing to pay me fifty dollars for that calendar shoot posing in the nude? When he told me he would pay me that price, I said, \"I need that fifty dollars. You must promise never to tell anyone about my posing for you in the nude. I want you to promise me that you will take the pictures so that I wouldn't be recognizable in them.\"", "Monroe signed the release for the photographs using a different name, Mona Monroe. Hefner reportedly paid $500 to acquire the photographs.", "Barris further quotes Monroe:", "I never even received a thank-you from all those who made millions off a nude Marilyn photograph. I even had to buy a copy of the magazine to see myself in it ... I admitted it was me who posed for that nude calendar even when the Fox executives became nervous and believed this would cause the ruination of any films I would appear in and also the end of my movie career. Of course they were wrong. The fans, my public, cheered when I admitted it was me, and that calendar and that Playboy first-issue publicity helped my career.", "However, despite the association between Monroe and the magazine, Hefner admitted to CNN host Piers Morgan in February 2011 that the two had never met:", "She was actually in my brother's acting class in New York. But the reality is that I never met her. I talked to her once on the phone, but I never met her. She was gone, sadly, before I came out here.", "A claim to the contrary, based on a picture allegedly showing Hefner lighting a cigarette for Monroe, was debunked after proof surfaced that the photograph actually showed Monroe standing next to actor Laurence Olivier.", "Gottileb, Jeff. \"For Sale: Eternity With Marilyn Monroe.\"\r\nLos Angeles Times. 14 August 2009.", "Nyren, Erin. \"Hugh Hefner Reportedly Laid to Rest in Private Ceremony.\"\r\nVariety. 1 October 2017.", "Hincks, Joseph. \"Not Everyone Is Happy That Hugh Hefner Is Being Buried Next to Marilyn Monroe.\"\r\nTime. 28 September 2017.", "Mezzofiore, Gianluca. \"No, That Viral Picture Doesn't Show Hugh Hefner Lighting a Cigarette for Marilyn Monroe.\"\r\nMashable. 28 September 2017.", "Archive.org. \"Piers Morgan Tonight CNN June 19, 2011 2:00am-3:00am PDT.\"", "Izade, Elahi. \"Marilyn Monroe helped launch Hugh Hefner’s career. But they never even met.\"\r\nWashington Post. 28 September 2017.", "Cauterucci, Christina. \"How Hugh Hefner’s Incredibly Complicated Legacy Got Cast as Female Sexual Liberation.\"\r\nSlate. 28 September 2017.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]