["By Jessica McDonald", "Posted on June 8, 2020", "Q: Does vitamin D help protect against COVID-19?", "A: Some scientists have hypothesized vitamin D might be helpful, but there is no direct evidence that vitamin D can prevent COVID-19 or lessen disease severity. Nevertheless, it should be part of a healthy lifestyle.", "Could vitamin D help decrease the chance of covid 19?", "As the coronavirus has spread around the globe, some scientists have proposed that vitamin D could help with COVID-19, the disease caused by the virus.", "Former Centers for Disease Control and Prevention Director Dr. Tom Frieden, for example, published a March 23 column on Fox News’ website suggesting that vitamin D could reduce a person’s COVID-19 risk.", "“There are many crackpot claims about miracle cures floating around,” he wrote, “but the science supports the possibility – although not the proof – that Vitamin D may strengthen the immune system, particularly of people whose Vitamin D levels are low.”", "The idea stems in part from experiments that have found that the vitamin, which is synthesized in the skin after sun exposure and is found in select foods, is used by the immune system. Some research also suggests vitamin D supplements might protect against respiratory infections, especially if someone is deficient in the vitamin. And many of the people most affected by the coronavirus, such as the elderly and minority populations, tend to have lower vitamin D levels.", "But experts caution against overinterpreting preliminary correlations or hypothetical mechanisms. As Pennsylvania State University nutrition researcher A. Catharine Ross told us, associations are not the same as cause and effect, and the evidence either for or against vitamin D and COVID-19 is “extremely weak.”", "A rapid review from Oxford University’s Centre for Evidence-Based Medicine found “no clinical evidence” that vitamin D could prevent or treat COVID-19, and another review on the topic published by nearly two dozen nutrition experts in BMJ Nutrition, Prevention & Health recommended avoiding vitamin D deficiency, but warned against taking high doses of the vitamin.", "“As a key micronutrient,” the authors wrote, “vitamin D should be given particular focus—not as a ‘magic bullet’ to beat COVID-19, as the scientific evidence base is severely lacking at this time—but rather as part of a healthy lifestyle strategy to ensure that populations are nutritionally in the best possible place.”", "Thus, while it’s a good idea to get enough vitamin D — pandemic or not — it’s too early to say that a lack of vitamin D makes COVID-19 worse, or that supplementing with vitamin D provides any protection against the disease.", "Although called a vitamin, vitamin D acts as a hormone in the body, and is best known for building strong bones, which is done in large part by promoting absorption of calcium and phosphorus in the intestine.", "“It’s actually a prohormone, and of all the nutrients that we have, it’s the only nutrient where the main source is not diet,” said Susan Lanham-New, a vitamin D researcher at the University of Surrey in the U.K.", "Instead, she told us, most of a person’s vitamin D is made in the skin upon exposure to sunlight, which is why darker-skinned people are more likely to have lower levels of the vitamin, and why people who go outside less frequently, including those who are older or less healthy, are susceptible to deficiencies.", "For vitamin D to be used by the body, it must be converted into an active form, typically by the liver and kidney, according to a National Institutes of Health fact sheet. The nutrient is found naturally in only a few foods, such as eggs and oily fish, but is more widely available in the U.S. in food that has been fortified, including milk and cereals.", "While there is a debate about exactly how much vitamin D a person needs, and what constitutes a deficiency, Lanham-New said a commonly used metric for deficiency is a blood level below 25-30 nanomoles per liter. Too little vitamin D can lead to rickets in children or osteomalacia in adults — conditions in which bones become soft and deformed.", "More is not always better, however, since vitamin D is fat-soluble, and is stored in the body. “You can get what we call hypercalcemia if you take too much vitamin D,” Lanham-New said, referring to elevated levels of calcium in the blood that can be especially dangerous for those with kidney diseases.", "Beyond its role in bone health, vitamin D is also known to function in the immune system, which is a key reason why some think it’s plausible the nutrient might impact COVID-19.", "Lanham-New, for example, said that vitamin D receptors are present on immune cells, and some immune cells make enzymes that help convert the nutrient into an active form.", "“That very much provides the scientific rationale for the potential role of vitamin D in maintaining” the immune system, she said.", "Some experiments in cultured cells have shown that vitamin D can trigger the production of antimicrobial peptides, including in lung cells, that might act to fight off invading pathogens.", "Other lab experiments have found vitamin D might act to tamp down overactive immune responses by tilting those responses toward less inflammatory ones, including by reducing the production of certain pro-inflammatory cytokines, or signaling proteins.", "Some researchers have hypothesized that this mechanism might be relevant to the coronavirus, since some COVID-19 patients experience life-threatening surges of cytokines known as cytokine storms that can damage organs as immune cells rush into the lungs to clear the virus from the body.", "But while a lot of basic research points to vitamin D having a role in the immune system, it is less clear if these mechanisms are applicable in clinical practice. Studies assessing whether vitamin D can treat or prevent infectious diseases have generally been inconsistent.", "There is some evidence that vitamin D can protect against respiratory tract infections. In 2017, researchers at Queen Mary University of London published a meta-analysis in the journal BMJ that pooled individual patient data from 25 randomized controlled trials testing vitamin D supplementation in a variety of illnesses, including influenza, pneumonia, colds and ear infections.", "The authors identified a protective effect for those taking vitamin D supplements daily or weekly, with the greatest benefit going to those who had the lowest levels of the vitamin to start. Periodic large doses, or boluses, of vitamin D were not effective.", "An accompanying editorial, however, noted that the absolute risk of coming down with at least one respiratory infection when taking vitamin D supplements dropped by only 2 percentage points — from 42% to 40% — and that given differences between the studies that were analyzed, large randomized controlled trials were still needed.", "Because the coronavirus is so new, little rigorous research has been done specifically on vitamin D and COVID-19.", "Oxford’s rapid review, which was posted last month and reflected literature searches performed in April, did not identify any clinical evidence that vitamin D is beneficial for COVID-19. The report concluded that “well-masked randomized trials” were needed before specifically recommending the nutrient for COVID-19, but that Britons should already be taking vitamin D supplements anyway, per national guidance.", "Since then, a variety of published and unpublished studies investigating potential links between vitamin D and COVID-19 have appeared, but Dr. Joseph Lee, a general practitioner and co-author of the report, told us that he was not aware of any subsequent studies that would alter his group’s recommendation that “people should take vitamin D, but not because of COVID-19.”", "Lanham-New, who was the lead author of the BMJ Nutrition, Prevention & Health review, also said her conclusions had not changed.", "One U.K. study, published on May 6 in Aging Clinical and Experimental Research, identified a crude association between the average vitamin D level reported in 20 European countries and the number of per-capita COVID-19 cases and deaths in those nations.", "Another similar paper, appearing in the Irish Medical Journal, found an inverse relationship between the vitamin D levels in older people in different European countries, as reported in past studies, and a country’s COVID-19 mortality rate, with fish-loving Nordic countries generally faring better than those in southern Europe.", "But these so-called ecological epidemiology studies can only hint at any effect of vitamin D, since they’re simple correlations at the population level. “This is not a design suited to identifying causal effects,” Lee said, “and I would not consider them as evidence of a role for vitamin D in COVID-19.”", "Other reports also claim to identify links between lower levels of vitamin D and COVID-19 infection or disease severity in different cohorts of people, but most of these have not yet been vetted by other scientists through peer review.", "One unpublished report of 780 confirmed COVID-19 cases in Indonesia found that the majority of deaths occurred in patients with abnormally low vitamin D blood levels, and claimed to have found an association between vitamin D deficiency and COVID-19 mortality after controlling for other factors, such as other preexisting health conditions.", "But as Lanham-New noted in an interview, the paper “doesn’t in any way prove cause and effect.” Lee, too, said that while the authors attempted to control for other health conditions, the group did so in an odd way, lumping all of the conditions together. And even if the team had controlled for them individually, that doesn’t necessarily eliminate bias, so the relationship could reflect the fact that people who are in poorer health generally fare worse with COVID-19.", "“It is relatively easy to calculate associations, and that is what most of these papers have done,” Penn State’s Ross said. “But associations do not show cause and effect, and in fact, ‘reverse causation’ is not carefully considered.” The disease itself could cause a reduction in a person’s vitamin D levels, she said, noting that there are negative associations of serum vitamin D with diabetes, obesity and other infections. “I place little confidence on any of these studies,” she said.", "More credible, Ross said, were two analyses of U.K. biobank data, neither of which support the idea that less vitamin D leads to a higher risk of COVID-19 infection. Given concerns that the disproportionate number of coronavirus infections in blacks and South Asians in the U.K. could be due to lower vitamin D levels in darker-skinned people, the researchers checked to see if there was any connection between a person’s vitamin D levels, which had been measured in participants about a decade ago, and testing positive for COVID-19.", "While the published report affirmed that black and South Asian participants were several times more likely to test positive for COVID-19 than whites, there was no association with vitamin D. The authors concluded that vitamin D “is unlikely to be the underlying mechanism for the higher risk observed in black and minority ethnic individuals and vitamin D supplements are unlikely to provide an effective intervention.”", "The other analysis, which Lanham-New said has since been submitted to a journal with additional participant data, found no difference in vitamin D status among those who tested positive versus negative for COVID-19. She said additional work was planned once COVID-19 severity and mortality data became available.", "Another consideration when interpreting many observational studies, Lee said, is something called collider bias, which can sometimes result in spurious correlations when the people included in a dataset aren’t representative of the wider population. Some researchers have already noted that COVID-19 studies may be especially prone to collider bias, making it hard to identify risk factors and medications that work.", "Consider a study analyzing outcomes among people who are tested for COVID-19. Some people are likely getting tested because they are quite ill and have been admitted to the hospital, while others may be tested because they’re a health care worker or because they’re more privileged and have access to testing.", "In this scenario, Lee said, people with good levels of vitamin D will be less likely to test positive, compared to the sick people. “This selection will in itself induce an association between low vitamin D and COVID-19 positive tests or severity of disease,” he said, “even if it isn’t true in the general population.”", "In the end, Ross is skeptical that vitamin D will prove to be beneficial for COVID-19, although she hesitated to entirely discount the possibility, given how much is still unknown about the disease.", "“[I]t is hard for me to conceive that vitamin D has much chance of being as effective as other kinds of treatments, if at all,” she said. “We don’t know however.”", "Several randomized controlled trials are in the works, which may reveal a more concrete answer.", "Her recommendation, irrespective of COVID-19, is to consume vitamin D-rich foods or take a supplement to provide the recommended dietary amount, or RDA, of 600-800 International Units per day. This matches the Institute of Medicine’s national guideline, which Ross helped write, and which assumes minimal sun exposure.", "One cup of fortified milk, for example, contains 120 IUs of vitamin D, while a 3-ounce serving of cooked salmon provides 570 IUs.", "Lanham-New emphasized that excessive doses of vitamin D should not be used. But especially for those who have been cooped up indoors while social distancing, it may be a good idea to take regular supplements.", "“If you’re in self-isolation, definitely be taking a vitamin D supplement according to your government guidelines,” she said.", "Lee also pointed to following state or national vitamin D recommendations. “There is no reason to think it will help with COVID-19, but that might change when the trials report,” he said of vitamin D. “Our advice is to take vitamin D in accordance with local guidelines.”", "Editor’s note: FactCheck.org does not accept advertising. We rely on grants and individual donations from people like you. Please consider a donation. Credit card donations may be made through our “Donate” page. If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, 202 S. 36th St., Philadelphia, PA 19104.", "Frieden, Tom. “Former CDC Chief Dr. Tom Frieden: Coronavirus infection risk may be reduced by Vitamin D.” Fox News. 23 March 2020.", "“Vitamin D: Fact Sheet for Consumers.” NIH. Accessed 5 June 2020.", "Martineau, Adrian R., et. al. “Vitamin D supplementation to prevent acute respiratory tract infections: systematic review and meta-analysis of individual participant data.” BMJ. Vol. 356 (2017).", "Ross, A. Catharine. Professor of Nutrition and Physiology, Pennsylvania State University. Emails to FactCheck.org. 3 and 5 June 2020.", "Lee, Joseph, et. al. “Vitamin D: A rapid review of the evidence for treatment or prevention in COVID-19.” 1 May 2020.", "Johnson, Larry E. “Vitamin D Deficiency.” Merck Manual Consumer Version. Accessed 5 June 2020.", "Lanham-New, Susan A., et. al. “Vitamin D and SARS-CoV-2 virus/COVID-19 disease.” BMJ Nutrition, Prevention & Health. 13 May 2020.", "Lanham-New, Susan. Head of the Department of Nutritional Sciences, University of Surrey. Interview with FactCheck.org. 5 June 2020.", "Bischoff-Ferrari, Heike and Walter Willett. “Comment on the IOM Vitamin D and Calcium Recommendations.” The Nutrition Source, Harvard T.H. Chan School of Public Health. 25 Dec 2010.", "“Vitamin D: Fact Sheet for Health Professionals.” NIH. Accessed 5 June 2020.", "Kearns, Malcolm D., et. al. “Impact of vitamin D on infectious disease.” American Journal of the Medical Sciences. Vol. 349. Issue 3 (2015).", "Liu, Philip T., et al. “Toll-like receptor triggering of a vitamin D-mediated human antimicrobial response.” Science. Vol. 311. (2006).", "Hansdottir, Sif, et. al. “Respiratory epithelial cells convert inactive vitamin D to its active form: potential effects on host defense.” Journal of Immunology. Vol. 181. Issue 10 (2008).", "Olliver, Marie, et. al. “Immunomodulatory Effects of Vitamin D on Innate and Adaptive Immune Responses to Streptococcus pneumoniae.” The Journal of Infectious Diseases. Volume 208. Issue 9 (2013).", "Zhang, Yong, et. al. “Vitamin D inhibits monocyte/macrophage proinflammatory cytokine production by targeting MAPK phosphatase-1.” Journal of immunology. Vol. 188. Issue 5 (2012).", "Laird, E., et. al. “Vitamin D and Inflammation: Potential Implications for Severity of Covid-19.” Irish Medical Journal. Vol. 113. Issue 113 (2020).", "“Cytokine storm.” NCI Dictionary of Cancer Terms. Accessed 5 June 2020.", "Wu, Dayong, et. al. “Nutritional Modulation of Immune Function: Analysis of Evidence, Mechanisms, and Clinical Relevance.” Frontiers in Immunology. Vol. 9. Issue 3160 (2019).", "Bolland, Mark J. and Alison Avenell. “Do vitamin D supplements help prevent respiratory tract infections?” BMJ. Vol. 356 (2017).", "Lee, Joseph. General Practitioner and doctoral researcher, Nuffield Department of Primary Care Health Sciences, University of Oxford. Emails to FactCheck.org. 3 and 4 June 2020.", "Ilie, Petre Cristian, et. al. “The role of vitamin D in the prevention of coronavirus disease 2019 infection and mortality.” Aging Clinical and Experimental Research. 6 May 2020.", "Meltzer, David O., et. al. “Association of Vitamin D Deficiency and Treatment with COVID-19 Incidence.” medRxiv. 13 May 2020.", "Alipio, Mark. “Vitamin D Supplementation Could Possibly Improve Clinical Outcomes of Patients Infected with Coronavirus-2019 (COVID-19).” SSRN. 9 Apr 2020.", "Raharusun, Prabowo, et. al. “Patterns of COVID-19 Mortality and Vitamin D: An Indonesian Study.” SSRN. 26 Apr 2020.", "Hastie, Claire E et al. “Vitamin D concentrations and COVID-19 infection in UK Biobank.” Diabetes & metabolic syndrome, vol. 14,4 561-565. 7 May 2020", "Darling, Andrea L., et. al. “Vitamin D status, body mass index, ethnicity and COVID-19: Initial analysis of the first-reported UK Biobank COVID-19 positive cases (n 580) compared with negative controls (n 723).” medRxiv. 5 May 2020.", "“Collider bias.” Catalogue of Bias, Centre for Evidence-Based Medicine at the University of Oxford. Accessed 5 June 2020.", "Sharp, Gemma and Tim Morris. “Collider bias: why it’s difficult to find risk factors or effective medications for COVID-19 infection and severity.” IEUREKA! Blog, University of Bristol. 10 May 2020.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]