["The doctored image of a CNN broadcast appears in several Facebook posts in Nigeria, including on this page called “NG News Reporters”. The post has been shared more than 2,500 times since its publication on March 26, 2020.", "The screenshot shows CNN journalist Anderson Cooper and the US Senate’s top Democrat Chuck Schumer in a TV segment alongside an image of Buhari and Kyari, and a breaking news ticker reading: “Nigerian President Muahmmadu Buhari and Abba Kyari tested positive for coronavirus, Government hiding Muahmmadu Buhari’s real result (sic).”", "According to the post, CNN reported the Nigerian government hid Buhari’s COVID-19 test result after he tested positive for the virus alongside Kyari.", "Using social media monitoring tool CrowdTangle, AFP traced the story to a website called Akelicious.net. The web publication, archived here, was widely shared on Facebook, including here and here.", "Social media posts claiming various presidents tested positive for COVID-19 have been widely shared across the West African region. AFP recently debunked a similar claim that Ghanaian President Nana Akufo-Addo and a senior minister Yaw Osafo-Marfo tested positive for the virus.", "Visible text such as “Capitol Hill” and “8:07 PM ET” at the top right-hand corner of the viral television screenshot suggests Senator Schumer called into a CNN programme from Capitol Hill in Washington, D.C., United States.", "AFP ran a keyword search on Google for “Senate Minority Leader Chuck Schumer and Anderson Cooper” and found this March 18, 2020 report published on American news website Real Clear Politics.", "The news report was posted alongside a video clip of CNN’s Cooper featuring Schumer on a television programme. The physical appearances of the two men and other features on the TV screen such as “Capitol Hill” show the viral image was indeed shot on a CNN broadcast at around 8:00 PM Eastern Time on Wednesday, March 18, 2020.", "Comparing the time and date with the CNN program schedule, AFP confirmed that Senator Schumer was speaking on the “Anderson Cooper 360°” programme on CNN.", "However, while the image of the purported CNN broadcast was shot at 8:07 PM Eastern Time, the 73-second clip started at about 8:11 PM Eastern Time.", "AFP conducted another search on Twitter for “Anderson Cooper 360°” and found the TV show’s official Twitter account. The account’s tweet feed contains key interview excerpts from the show’s previous editions, including this longer version of Cooper’s interview with Senator Schumer. The senator was speaking on the impact of coronavirus on the US.", "Senate Minority Leader Chuck Schumer calls for a “Marshall Plan for our hospitals,” employment insurance and free medical treatment for anyone who contracts coronavirus. https://t.co/XyQLEGi8oN pic.twitter.com/I0Lkxvzh4s", "A comparison of the two images shows the viral image has been manipulated to add a CNN Breaking News ticker, while a preview of an oncoming CNN’s show was covered with an image of Buhari and Kyari.", "Kyari tested positive", "Kyari contracted COVID-19 after travelling to Germany but Buhari tested negative for the virus. The outcomes of their tests were widely covered in Nigerian media, including in this AFP report.", "There is no evidence that Buhari tested positive for the virus as claimed in the viral television screenshot.", "Nigeria reported the first confirmed case of the novel coronavirus in sub-Saharan Africa on February 27, 2020. Since then, the figure has risen steadily to at least 232 cases including five deaths, as of April 5, 2020.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]