["By Sydney Schaedel", "Posted on July 21, 2017", "Q: Were two U.S. senators charged with trying to impeach President Donald Trump under false pretenses?", "A: No. That story originated on a prolific satire website.", "Two U.S. senators did not go to jail for attempting to “begin impeachment charges” against President Donald Trump “under false pretenses.”", "That story was published on Worldpoliticsnow.com in May, and Facebook users recently flagged it as possible fake news. Other websites published the story as well, but it originated at thelastlineofdefense.org, a satirical website that we’ve written about before.", "America’s Last Line of Defense, May 17: Two Democrat senators made a huge mistake today when they decided to begin impeachment charges against our president under false pretenses. Under US Code Title 18 Subsection 410.91, knowingly perpetrating such an action is attempting a coup and therefore considered treason.", "Not just treason, either…High treason. If the senators, Matt McCrosky from Vermont and Leon Pillman from Rhode Island, were to sign a full confession, which they won’t, they could actually be executed for their crime. People think impeachment is something you can just do on a whim because a bunch of people say things like “He’s a tyrant” and “he hates America.” You may have even heard that he sides with not just Russia but with certain terrorist groups, too.", "America’s Last Line of Defense has a disclaimer that says: “We present fiction as fact and our sources don’t actually exist. Names that represent actual people and places are purely coincidental and all images should be considered altered and do not in any way depict reality.”", "Even without the disclaimer, the story includes several red flags.", "First, there are no U.S. senators named Matt McCrosky and Leon Pillman. Democratic Sens. Sheldon Whitehouse and Jack Reed represent Rhode Island, and independent Sen. Bernie Sanders and Democratic Sen. Patrick Leahy represent Vermont. The photo in the story published on thelastlineofdefense.org actually shows Jack Straw and Malcolm Rifkind, two former United Kingdom cabinet ministers.", "Plus, only the House of Representatives, not the Senate, can bring impeachment charges against the president, said Kermit Roosevelt, a University of Pennsylvania law professor.", "In an email to FactCheck.org, Roosevelt called the story “amazingly implausible.”", "“It would be bizarre for Congress to take the decision to impeach — its most powerful weapon against the president — and subject it to prosecution,” Roosevelt said. “Prosecutors work for the president, so Congress would be undercutting its authority in a very dramatic way. That’s one reason why there is no such law.”", "He added that “the Supreme Court has said that most questions about impeachment are committed to Congress and not susceptible to judicial resolution, so no court would decide whether the pretenses were false. And anything a member of Congress did in recommending impeachment would be protected by the speech and debate clause.”", "There also is no “U.S. Code Title 18 Subsection 410.91,” as the story says.", "Treason is defined in Article III, Section 3 of the U.S. Constitution, which says, “Treason against the United States, shall consist only in levying War against them, or in adhering to their Enemies, giving them Aid and Comfort.” That “can’t be broadened by statute,” Roosevelt explained. U.S. Code Title 18 Chapter 115 sets the penalty for treason, he said, but doesn’t otherwise change its constitutional definition.", "To date, only Democratic Rep. Brad Sherman of California has filed articles of impeachment against Trump for “high crimes and misdemeanors.”", "“It now seems likely that the President had something to hide when he tried to curtail the investigation of National Security Advisor Michael Flynn and the wider Russian probe,” Sherman said in a July 12 statement. “I believe his conversations with, and subsequent firing of, FBI Director James Comey constitute Obstruction of Justice.”", "Democratic Rep. Al Green of Texas is the only co-sponsor of the resolution to impeach Trump, a measure that is considered to be a long shot.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to help identify and label viral fake news stories flagged by readers on the social media network.", "“2 Senators Just Tried To Impeach Trump And Went To jail Instead.” Worldpoliticsnow.com. 23 May 2017.", "Stryker. “BREAKING: Bogus Impeachment Talk Leads To Treason Charges For Two Senators.” Thelastlineofdefense.org. 17 May 2017.", "“About Us.” Thelastlineofdefense.org. Accessed 19 Jul 2017.", "“List of current members of U.S. Congress.” Ballotpedia.org. Accessed 19 Jul 2017.", "U.S. Senate. Senators of the 115th Congress. Accessed 19 Jul 2017.", "Associated Press. “Former UK cabinet ministers deny lobbying charges.” Indianexpress.com. 24 Feb 2015.", "Roosevelt, Kermit, law professor at the University of Pennsylvania Law School. Email sent to FactCheck.org on 19 Jul 2017.", "U.S. House of Representatives. “Impeachment.” Accessed 19 Jul 2017.", "“18 U.S. Code Chapter 115 – TREASON, SEDITION, AND SUBVERSIVE ACTIVITIES.” Law.cornell.edu. Accessed 19 Jul 2017.", "Sherman, Brad. “Congressman Sherman Introduces Article of Impeachment: Obstruction of Justice.” Press release. 12 Jul 2017.", "DeBonis, Mike. “A House Democrat has filed the first articles of impeachment against President Trump.” Washingtonpost.com. 12 Jul 2017.", "FactCheck.org Rating:", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]