["Retired IAS officer Surya Pratap Singh posted a purported screengrab of an ABP News bulletin. “Rhea had eaten palak paneer curry,” reads the breaking news ticker in Hindi. “How can TV (channels) recognise the issue of unemployment when such important news needs to be aired?” wrote Singh.", "Journalist Swati Chaturvedi also tweeted the image and criticized the Indian media while dubbing the alleged reportage “cringeworthy”. It is noteworthy that she had taken down her tweet and issued a clarification before this report was published.", "On Facebook, a few more people shared the screengrab and took potshots at Indian media.", "The bulletin comes across as a satirical creation just by the first read. The bottom-most line in the image makes it evident that it’s not a screengrab of broadcast but a joke on the falling journalistic standards in broadcast news.", "Such screenshots are created from a meme-generator website. This website allows you to populate a template of a meme with a headline, ticker and an image of your choice. This particular meme was created on the meme-generator website ‘Break Your Own News’. Only the logo of ABP News was added to the template.", "After his initial tweet, Singh posted another where he said, “Even if it’s photoshopped, it (shows) what’s happening right now”.", "यदि ये फोटोशॉप भी है, लेकिन हो तो ये ही रहा है l", "— Surya Pratap Singh IAS Rtd. (@suryapsingh_IAS) September 7, 2020", "Chaturvedi also clarified, “Been told the ABP news SS is fake. Deleting it. Apologies”.", "Been told the ABP news SS is fake. Deleting it. Apologies", "— Swati Chaturvedi (@bainjal) September 7, 2020", "This is not the first instance when netizens fell for an image that was created on such meme-generator websites. Earlier, a similar screengrab that read, “Breaking News: Weed kills coronavirus”, had gone viral. Several people had shared it believing it to be true. Using the template now viral, an image was shared in the month of March, where it was falsely claimed, “Vladimir Putin has Dropped 800 tigers and Lions all over the Country to push people to stay Home”. It was also used to spread misinformation about the accused bishop in the Kerala nun rape case.", "Donate Now", "Priyanka Jha specialises in monitoring and researching mis/disinformation at Alt News. She also manages the Alt News Hindi portal.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]