["About this rating", "In late 2019, we received multiple inquiries from readers about the veracity of reports that the New Jersey-based, arts-and-crafts retail chain A.C. Moore was about to go out of business and had announced it would be closing all its stores. The New York Post, CBS News, and CNN were among the many national news outlets to report the development.", "Those reports were accurate. On Nov. 25, A.C. Moore's parent company published a press release that stated that:", "Nicole Crafts has decided to exit its retail operations by retaining the retail and real estate divisions of Gordon Brothers to close the A.C. Moore stores, as part of a broader strategic plan.", "Anthony Piperno, Chief Executive Officer of A.C. Moore said, \"For over 30 years, our stores have been servicing the creative community with a vast selection of art and craft materials, with one common focus, the customer.  Unfortunately, given the headwinds facing many retailers in today's environment, it made it very difficult for us to operate and compete on a National level.  During this process, we will continue to provide great customer experience, while still delivering quality and value on your favorite products.  Plans for closing specific A.C. Moore locations will be shared in the upcoming weeks on our website.  While we will stop accepting further online orders as of today, we will ship any previously placed orders in the ordinary course.\"", "The first A.C. Moore store was opened in Moorestown, New Jersey, in 1985 and the company grew to occupy more than 134 locations along the East coast by 2011, when another South Jersey arts-and-crafts distributor, Sbar's, acquired A.C. Moore through its affiliate, Nicole Crafts.", "According to the Nov. 25 press release, A.C. Moore again grew to occupy 145 stores and employ more than 5,000 people, but a hostile retail environment clearly took its toll on the chain, culminating in the 2019 decision to close the business.", "Michael's, the country's leading arts-and-crafts retailer, will take on the leases of around 40 locations previously home to A.C. Moore stores, according to the announcement, with details to follow.", "Manskar, Noah.  \"AC Moore Going Out of Business, Will Close All 145 Stores.\"\r\n  The New York Post.  26 November 2019.", "Valinsky, Jordan.  \"A.C. Moore is Closing All Of Its Stores.\"\r\n  CNN.  26 November 2019.", "Gibson, Kate.  \"Crafts Chain AC Moore Shutting Down; Some Stores to Reopen as Michaels.\"\r\n  CBS News.  26 November 2019.", "A.C. Moore/PR Newswire.com.  \"Nicole Crafts to Divest Out of Retail Operations.\"\r\n  25 November 2019.", "BusinessWire.com.  \"Sbar's Acquisition Corporation Successfully Completes Tender Offer for Shares of A.C. Moore Arts & Crafts, Inc.\"\r\n  17 November 2011.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]