["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Getting a raise as an elected official has to be a tough balancing act.", "This is especially the case in Nevada, where the state Constitution historically prohibited salary raises for any legislator or the state’s six executive officers, except through an act of the state Legislature. That meant even reasonable requests to update compensation could fall victim to political gamesmanship.", "It’s also why, on the same day that former Democratic attorney general and current Nevada Senate candidate Catherine Cortez Masto addressed a union-backed summit on raising the minimum wage earlier in January, the National Republican Senatorial Committee pounced.", "The advocacy group unloaded on the candidate for the \"shameless hypocrisy\" in accepting a pay raise in 2011 while other officials refused in order to support state workers with mandated furloughs and frozen pay.", "Here’s what the NRSC said in full:", "\"In addition to frozen salaries, workers dealt with furloughs that further cut into their take-home pay. Then-Attorney General Cortez Masto accepted a taxpayer-funded 6 percent pay raise, increasing her salary from $133,000 to $141,086 annually – even as other Nevada elected officials declined the salary hike.\"", "Because these allegations make Cortez Masto look oblivious to state workers who faced years of furloughs and frozen pay, we wanted to take a closer look at the NRSC’s claim.", "Making sense of the salary formula can be rather complex for each of Nevada’s six independently elected constitutional officers (governor, lieutenant governor, attorney general, secretary of state, treasurer and controller). Historically, Nevada’s Constitution required the part-time state Legislature to make any salary adjustment for the state’s six constitutional officers.", "Although the cost of living has slightly increased since Nevada became a state in 1864, any request to increase salaries often turned political, especially when legislative majorities and constitutional officers belonged to different parties.", "And so in 2005, lawmakers attempted to avoid that pitfall by including a clause to an otherwise routine salary increase bill for state executive officers that changed the process significantly. Under the new law, state employee pay increases over a four-year period would then be added as an equivalent salary increase for the six executive officers, applying for the next four-year term.", "This well-intentioned plan proceeded to backfire spectacularly.", "After state employees received a 2 percent salary increase in 2007 and a 4 percent increase in 2008, the economies of the nation and Nevada tanked. With unemployment rates hitting record highs and state lawmakers approving \"more than $1 billion in cuts to worker salaries and state programs\" to close the state’s gaping budget hole, legislators entered the 2011 session with a problem: an unwanted but legislatively mandated 6 percent pay raise.", "Lawmakers rejected an attempt to delay the mandatory raise, and because the state Constitution prevents meddling with the salaries of elected officials while in office, the six constitutional officers and the 63 members of the Legislature were essentially forced to take an untimely pay bump while most state employees were forced to take an unpaid furlough.", "This is where the NRSC allegations come into play. Gov. Brian Sandoval \"rejected\" the pay raise and returned it to the state, while Cortez Masto and then-Controller Kim Wallin (both Democrats) decided to accept the pay increase.", "But there is a huge caveat: Cortez Masto, along with the other five constitutional officers, donated a small portion of their salary both before and after 2011 back to the state as a show of support for state employees forced to take unpaid days off. Both Sandoval and Cortez Masto actually gave back money to the state; they just gave it back in different ways.", "According to information collected from TransparentNevada.com and records request from the state Controller’s office, PolitiFact Nevada put together this spreadsheet of salaries, donations and what percentage of salary was donated back to the state.", "As shown, it’s clear that as Attorney General, Cortez Masto didn’t \"pad her pockets\" while state workers suffered -- rather, she received essentially the same salary (not counting benefits) during her eight years in office when donations are subtracted out.", "And due to quirky provisions in Nevada law, the constitutional officers couldn’t outright reject the pay increase, meaning that the governor and other constitutional officers who \"rejected\" the pay increase had to find creative ways to re-distribute the new income, including cutting weekly checks to nonprofits, that made up the difference.", "In response to inquiries about the allegations, Nevada Democratic Party communications director Zach Hudson said in a statement that the facts were being distorted.", "\"The fact is that as Attorney General, when state workers were furloughed, Catherine Cortez Masto stood with them and voluntarily donated tens of thousands of dollars of her salary back to the taxpayers,\" he said in a statement.", "The NRSC cited two articles backing up their statement, an editorial in the Elko Daily Free Press and a story in the Las Vegas Sun that claimed that Masto and others \"are going to keep the 6 percent pay raise.\" That may have been what it seemed like at the time of the reports, but Cortez Masto did give an average of 6.3 percent of her salary back every year, which is comparable to others who \"rejected\" the pay increase.", "Our ruling", "The NRSC said Cortez Masto \"was happy to line her own pockets with taxpayer dollars when state employees were slammed with frozen salaries,\" but this is a highly misleading claim. The state increased Cortez Masto’s salary during a time of pay freezes for Nevada’s state workers. She was unable to legally reject the pay increase, so she donated $38,000 back to the state during her last four years in office. We rate the claim Mostly False.", "Email, Greg Blair, National Republican Senatorial Committee spokesman, Jan. 27, 2016", "Email, Zach Hudson, Nevada Democratic Party Communications Director, Jan. 20, 2016", "News story, \"Nevada’s constitutional officers split on accepting pay increase,\" Las Vegas Sun, January 6, 2011.", "News Story, \"Nevada elected officials to get pay raises Jan. 1\" Associated Press, Dec. 23, 2010", "News Story, \"Legislature finishes quietly\" Las Vegas Review-Journal, June 2, 2009", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]