["By Robert Farley", "Posted on March 30, 2020", "President Donald Trump continued his misleading attacks on Democratic New York Gov. Andrew Cuomo’s handling of the coronavirus pandemic as it ravages the state.", "Trump also repeated his misleading claim that “New York had a chance to get 16,000 ventilators a few years ago and they turned it down.” We wrote about that in our March 26 story “Trump’s Misleading Ventilator Counter-Punch at Cuomo.”", "New York has borne the brunt of much of the early explosion of the coronavirus pandemic in the U.S. Nearly 43% of the more than 156,000 confirmed cases nationwide were located in New York, as of the afternoon of March 30.", "During a “Fox & Friends” phone interview on March 30, Trump was asked about polls showing high approval for Cuomo’s handling of the pandemic, and speculation in an opinion piece in the New York Times about Cuomo’s presidential potential.", "“Well one of the reasons his numbers are high on handling it is because of the federal government, because we give him ships and we give him ventilators and we give him all of the things that we’re giving him,” Trump said. “One of the reasons he’s successful is because we’ve helped make him successful.”", "During the interview, Trump took several shots at the New York Democrat. The president claimed that despite Cuomo appealing to the federal government to provide more masks, ventilators and other equipment from federal emergency stockpiles, New York has not used the 4,000 ventilators the federal government has provided.", "As for the shortage of masks, during a press conference the night before, Trump suggested a spike in the number of masks being used at one New York hospital seemed suspicious, and he implored reporters to look into whether masks may be “going out the back door.”", "Trump’s claim about masks came after Edward Pesicka, president and CEO of Owens & Minor, said during the press conference that despite his company ramping up its production of masks, “One of the issues we’re struggling with is the demand increase.”", "Pesicka then cited “an anecdotal example of one hospital in New York that traditionally uses roughly 10- to 20,000 masks a week are now using 2- to 300,000 masks a week. So you multiply that times … the entire U.S., let alone the same demand outside of the U.S. That’s part of the issue we’re running into, is even with a significant ramp-up in supply, you know, there’s still that demand that is — that is much greater than that supply.”", "Trump said those figures were discussed in a private meeting prior to the press conference.", "Trump, March 29: That statement was made that they’ve been delivering for years, 10- to 20,000 masks. Okay, it’s a New York hospital. Very — it’s packed all the time. How do you go from 10 to 20, to 300,000? 10- to 20,000 masks to 300,000?", "Even though this is different, something is going on, and you ought to look into it as reporters. Where are the masks going? Are they going out the back door? How do you go from 10,000 to 300,000? And we have that in a lot of different places. So, somebody should probably look into that, because I just don’t see, from a practical standpoint, how that’s possible to go from that to that. And we have that happening in numerous places — not to that extent; that was the highest number I’ve heard. That’s the highest number you’ve seen, I would imagine, right?", "But this man makes them and delivers them to a lot of hospitals. He knows the system better than anybody. And I think you were more surprised than I was when you saw that number. So thank you very much. I hope I didn’t get any of your clients in trouble, but it could be that they are in trouble. So they have to look at that in New York.", "To be clear, in his public statement Pesicka did not speculate that the high demand for masks from the New York hospital in recent weeks was due to theft.", "Later in the press conference, Trump doubled down on the speculation, saying that with such a large increase in demand for masks at one hospital, “I think people should check that because there’s something going on, whether — it’s not — I don’t think it’s hoarding; I think it’s maybe worse than hoarding. But check it out. Check it out.”", "After the press conference, leading Democratic presidential contender Joe Biden dismissed Trump’s speculation as “ridiculous and completely false.”", "“Today’s conspiracy-mongering from our President is among the most reckless and ignorant moves he has made during this crisis, and there have been many,” Biden said in a statement. “Lives hang in the balance.”", "Also after the press conference, the Trump campaign pointed to news reports from March 6 in which Cuomo asked the state police to investigate reports from health care professionals that “there have been thefts of medical equipment and masks from hospitals, believe it or not. Not just people taking a couple or three, I mean just actual thefts of those products.”", "A CNBC story about Cuomo’s comments noted that the governor didn’t indicate how much supplies or equipment was missing.", "The Trump campaign also pointed to comments from an infectious disease physician and hospital epidemiologist at Tufts Medical Center in Boston, who, according to Modern Healthcare, “said her hospital has had thefts of respirator masks and other essential protective equipment in lobbies and other high-traffic areas.”", "But there is no indication of the scale of these thefts, and no evidence that they are driving the spiking demand for masks and other protective equipment at hospitals dealing with a steep increase in patients infected with COVID-19.", "The U.S. Department of Health and Human Services said in early March it had only about 1% of the masks that would be needed in a severe pandemic. An HHS spokesperson told CNBC that the U.S. had 42 million N95 and surgical masks in the federal stockpile, and that the U.S. would need about 3.5 billion to handle a severe pandemic.", "Kenneth E. Raske, president of the Greater New York Hospital Association, released a statement in response to Trump’s comments that Americans “deserve better than their President suggesting that PPE is ‘going out the back door’ of New York hospitals.”", "“New York’s healthcare workers are treating exploding numbers of COVID-19 patients around the clock – willingly and without complaint. My daughter, an ICU nurse at a New York City hospital, is one of them,” Raske said. “The only thing they ask for in return is adequate amounts of personal protective equipment. PPE is the single thing that separates them from being COVID-19 patients themselves.”", "We reached out to a spokesman at Owens & Minor to find out what hospital Pesicka was referring to, but we did not get a response. We also did not get a response from NYC Health + Hospitals, which runs the city’s public hospitals, about whether any of its hospitals were using as many masks as Pesicka cited.", "Dr. George L. Anesi, director of the Medical Critical Care Bioresponse Team at the University of Pennsylvania Perelman School of Medicine, where he has been leading the efforts to prepare for the COVID-19 pandemic, told us in an email that while he couldn’t comment on the appropriate use of masks at any particular hospital, “during the COVID-19 pandemic, it is reasonable for any hospital in a high-risk region, of which there are now many in the US, to see its mask use increase by an order of magnitude.”", "“Increased demand for and use of personal protective equipment (PPE), including masks, has occurred for a number of reasons,” said Anesi. “First, even before novel coronavirus arrived, the US was in the midst of an intense respiratory viral season,” from various non-novel coronavirus strains and other viruses. “Second, arrival of the novel coronavirus prompted the need for masks for the care of both patients with confirmed COVID-19 and, importantly, patients who might have COVID-19 but were awaiting evaluation or testing. With the exponential spread of the COVID-19 pandemic, essentially any patient with respiratory complaints has the potential to be infected, and requires the use of masks to protect staff, family members, and other patients.”", "“In any situation of increased demand or inadequate supply, there is always going to be some diversion, including from hospitals and from the public purchasing equipment most needed by frontline healthcare workers,” Anesi said. “Appropriate use by healthcare workers in this rapidly expanding pandemic is the dominant force currently.”", "In his public comments, Trump also questioned why thousands of ventilators sent by the federal government to New York were being held in storage, even as Cuomo pleads for more.", "At a press conference on March 29, Trump said that with thousands of ventilators sitting in storage in New York, “maybe they didn’t need them so badly.”", "Trump, March 29: We sent thousands of [ventilators] to New York. They were put into a warehouse — a New York warehouse — that happened to be located, interestingly, in Edison, New Jersey. They were given to New York, and we then went to other places, also giving thousands of ventilators. The people in New York never distributed the generators. We said, “Why didn’t you distribute them?” Now, you have to understand, they have New York people working in those warehouses. I knew they had them. So we said, “Why didn’t you distribute them?” I’m — I hope they’ve distributed them now. But maybe they didn’t need them so badly.", "Trump echoed that point in his “Fox & Friends” interview the next morning.", "Trump, March 30: And we delivered 4,000 ventilators to New York to their warehouse which happens to be located – which is interesting — in Edison, New Jersey. It was signed off, they were delivered, and they weren’t used. And we said a number of days later, “Why aren’t you using these ventilators?” I don’t know what happened, but we delivered thousands of them and we’ve delivered them to a lot of people. And, you know, there’s a whole question about that. I think New York should be fine, based on the numbers that we see, they should have more than enough. I mean, I’m hearing stories that they’re not used or they’re not used right.", "Cuomo has acknowledged that there are thousands of ventilators being held in storage, but he said that doesn’t mean they aren’t needed, or that New York doesn’t need more. Cuomo said they are being stockpiled ahead of anticipated demand in a couple weeks.", "In an interview on MSNBC’s “Morning Joe,” Cuomo said the president’s comments indicate Trump doesn’t understand “how to run a government, how to plan an operation.”", "“This virus has been ahead of us from day one,” Cuomo said. “We’ve been playing catch-up from day one. Still two, three, four weeks away depending on whose projection model you use. Prepare for the apex. Have the materials for the apex. That’s when the system is going to collapse. They sent 4,000 ventilators. I’m not using them today because I don’t need them today. I need to assemble them in a stockpile. A stockpile, by definition, is to be used at the high point.”", "Cuomo has said that based on projections from medical experts, New York is expected to need as many as 30,000 ventilators “at that high point of need.”", "“That’s what the numerical projections say,” Cuomo said on March 28. “So we’re planning for that quote, unquote worst case scenario which the models predict. Maybe we never get there, maybe we flatten the curve and we slow the infection rate so we never get to that point and that’s what we’re trying to do and we’re working on that day and night. But, if we can’t flatten the curve, you can’t slow the infection rate, you hit that apex, make sure you’re ready for the apex and that’s where the 30,000 ventilators come in.”", "In an interview on MSNBC’s “All In with Chris Hayes” on March 27, Cuomo said the data comes from a variety of sources, including the state health department.", "“So what I do is I just study the numbers and the science and the data and I follow the data,” Cuomo said. “We have McKinsey & Company [a global management consulting firm], we have and Weill-Cornell medical center [the biomedical research unit and medical school of Cornell University], I talked to the World Health Organization, look at the models of China, look at the models of South Korea, look at the models of Italy and look at the models of the numbers in my state.”", "In his March 30 interview on “Morning Joe,” Cuomo said, “The tsunami is coming.”", "“We know it is,” he said. “Now is the time to gather supplies, do the preparations because it’s too late the day before. If you have not done the work before the storm hits, it’s too late to do it once the storm hits. And the storm is coming. Stop the politics. Listen to the scientists and the pros and plan because otherwise … people will die who don’t need to die. That’s the bottom line. … The storm hits in two weeks, three weeks, this is what I’m going to need. If you don’t want to see a total collapse. And let’s focus on getting that.”", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]