["The photo was published here on Facebook on October 2, 2020.", "WarningGraphic Image", "Show", "Hide", "The post’s Hindi-language caption translates to English as: “Heart-wrenching photo from Rajasthan's Tonk district, where 13-year old Hindu girl Payal Jain was raped and then burnt alive by a Muslim man Rizwan Ansari who lives in the same district. Why is the Rajasthan government and media silent?”", "Tonk is a town in the west Indian state of Rajasthan.", "The same photo was also shared here, here and here on Facebook; and here and here on Twitter alongside a similar claim.", "The claim is false.", "In response to the misleading posts, a spokesperson for Tonk Police posted here on Twitter on October 3, 2020, saying there had been “no such incident” reported in their district.", "The Hindi-language post translates to English as, “No such incident has been reported in Tonk, the photo is not from Tonk. Police are taking action against those who are spreading these rumours.”", "A reverse image search on Google found several users posting a similar image on Twitter on October 1, 2020, alongside a claim that the photo relates to an incident in a town in central India.", "A subsequent Google search found several local Hindi language newspapers Navbharat Times and Bhaskar reporting about the incident.", "According to those media reports, the incident happened in Gandhwani village in the central Indian state of Madhya Pradesh on September 29, 2020.", "“The woman was murdered and her body was burnt by her boyfriend Govind and one of his friends, Sohan. Govind is absconding while we have managed to arrest Sohan. There is no communal angle,” investigating officer Aditya Pratap Singh told reporters in a video interview published by Asianetnews and SKPlivenews on October 4, 2020.", "A copy of the police report was published here on the Madhya Pradesh police website.", "Below is a screenshot of the relevant part of the police report:", "The complaint says the deceased woman was 30 years old. It states the accused has been charged under various sections of the Indian law, 302, 201 and 34; i.e. for ‘murder’, ‘causing disappearance of evidence of offense’ and ‘Acts done by several persons in furtherance of common intention’.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]