["After President Donald Trump announced he’d become one of the more than 7 million Americans diagnosed with COVID-19, critics are remembering how he responded to the coronavirus pandemic.", "“Trump’s mistake was getting tested,” Bob Cesca posted on Facebook on Oct. 2. “If he hadn’t been tested, he’d be fine now.”", "Facebook users responded to Cesca's sarcasm and implied reference to Trump's past commentary with roughly 100 comments, more than 3,000 shares and 1,100 likes and reactions.", "In 2020, misinformation is abundant and sarcasm is easily misunderstood so USA TODAY took a look at the claim to get ahead of any confusion.", "USA TODAY has contacted Cesca for comment.", "Fact check:Satirical post falsely claims COVID-19 is no worse than the flu and affects virtually no one", "Cesca is a weekly contributor to left-leaning websites Salon and The Banter and hosts his own liberal political podcast “The Bob Cesca Show.”", "He has repeatedly expressed his disapproval of Trump’s administration, pandemic response and handling of his own COVID-19 diagnosis on Twitter.", "Given Cesca’s very public politics, it's likely the post was intended to be satirical.", "Fact check: Video claiming to show bikers praying for Trump at Walter Reed is from a South Africa protest", "In July, USA TODAY debunked the claim that increased COVID-19 testing leads to increased infection rates after Trump spent months asserting as much.", "The president has repeatedly sought to explain increased infection rates across the country this summer as caused by increased testing.", "During a Aug. 3 interview with Axios on HBO, Trump repeatedly asserted that the number of reported COVID-19 cases in the U.S. was because of increased testing.", "\"You know there are those that say you can test too much,\" said Trump.", "USA TODAY concluded that the virus’ spread can be measured by the number of cases and by the testing positivity rate. Although increased testing will increase the number of confirmed, reported cases, it will not increase the positivity rate. The increased positivity rate indicates that the virus is spreading in the U.S.", "Cesca seems to be referencing Trump espousing this debunked claim to mock the president once he was diagnosed with COVID-19.", "Fact check:Trump could have been exposed to COVID-19 before Sept. 29 presidential debate", "A Facebook post that claims Trump would not have not fallen ill with COVID-19 if he hadn’t been tested is sarcastically referencing the debunked claim that increased testing causes increased cases of coronavirus infection. The satirical post came from a liberal political contributor who has publicly criticized Trump’s handling of the pandemic. We rate this claim SATIRE.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]