["By Eugene Kiely", "Posted on October 29, 2020", "In recent days, President Donald Trump has repeatedly and baselessly suggested that counting mail-in ballots after Election Day will result in fraud.", "The president, who has relentlessly attacked mail-in ballots as being rife with fraud, warned about post-Election Day vote counting during a campaign stop in West Salem, Wisconsin.", "Trump, Oct. 27: Was I right about the ballots? It’s messed up like you wouldn’t believe. Now they say, “We’d like to get the ballots and maybe get them within a few days of the election. And we’ll take 10 days to count them up.” Oh good. Let’s let the whole world wait while you count your ballots. And you know what happens while they’re counting them? They’re dumping more ballots in there. Okay? Where did they come from?", "A day earlier, he tweeted: “Big problems and discrepancies with Mail In Ballots all over the USA. Must have final total on November 3rd.”", "At a rally in Nevada on Oct. 28, Trump said he hopes that “the few states remaining that want to take a lot of time after Nov. 3 to count ballots … won’t be allowed by the various courts.”", "There is nothing unusual or untoward about counting mail-in ballots after an election. It happens every election.", "“Counting doesn’t ‘often’ go on past Election Day. It *always* does,” Rick Hasen, a professor of law and political science at the University of California, Irvine, said in an Oct. 28 tweet. “Results on election night are preliminary, even in states that do relatively quick counts. Electoral college votes are not even cast until mid December, and the Congress counts the votes in January.”", "The reason: Most states don’t start counting mail-in ballots until Election Day, and 22 states — including 12 won by Trump in 2016 — accept postmarked mail-in ballots after Election Day. (Over Trump’s objections, the U.S. Supreme Court let stand lower court rulings that allowed North Carolina to accept and count mail-in ballots up to nine days after Election Day and Pennsylvania up to three days.)", "The process is expected to take even longer in some states this year because concerns about the COVID-19 pandemic have resulted in a sharp increase in the use of mail-in ballots.", "As of Oct. 29, more than 80 million voters already have cast early ballots, including 52.4 million mail-in ballots, according to the U.S. Elections Project, an early-voting project maintained by Michael McDonald, a University of Florida political science professor.", "The 52.4 million mail-in ballots returned this year already dwarf the 33.4 million that were returned in 2016, and there are still nearly 38 million mail-in ballots that had been requested but not yet returned. (For the 2016 data, see page 25 of a U.S. Election Assistance Commission report on the 2016 election.)", "And, quite simply, “mail ballots tend to take a long time to process,” as stated in a March study that was coauthored by Charles Stewart, a political science professor at the Massachusetts Institute of Technology, and Edward B. Foley, a law professor at Moritz College of Law.", "That’s particularly true this year in two critical swing states — Pennsylvania and Michigan — where the election officials cannot start counting mail-in ballots until Election Day. Trump narrowly won both states in 2016, but trails Democratic presidential nominee Joe Biden in both this year in the polls.", "Pennsylvania cannot even begin pre-canvassing — opening envelopes and preparing the ballots to be counted — until Election Day, Pennsylvania Secretary of State Kathy Boockvar said at a virtual seminar held Oct. 20 by the Ash Center for Democratic Governance and Innovation at Harvard University.", "Boockvar said “all of the largest counties are planning to count 24/7 until the count is done,” but even then it would take until Nov. 6, three days after the election, for the “overwhelming majority of ballots” to be tallied.", "Michigan Secretary of State Jocelyn Benson also said it would take until Nov. 6 to tally up the votes. Some Michigan cities or townships — those with populations of 25,000 or more — can start pre-canvassing one day before the election, but that isn’t enough time to get the ballots counted by Election Day, she said.", "“In our August statewide primary, 1.6 million citizens voted early. It took about 40 hours statewide for our election officials, beginning at 7 a.m. on Election Day to open and tabulate each of those ballots,” Benson said. “Based on that, it’s going to take 80 hours to process and tabulate twice as many – 3.2 million.”", "A drawn out vote-counting process could be “especially problematic” in the days immediately following the Nov. 3 election, Stewart and Foley wrote in their March paper, because post-Election Day votes tend to favor the Democratic presidential candidate and Trump “has not resisted trumpeting ill-founded charges of election fraud.”", "In an interview, Stewart described Trump’s recent claim of “dumping” ballots after Election Day as “inaccurate.”", "“The phrase ‘dumping more ballots in there’ infers that ballots are added to a pile to be counted without knowing where they came from. Ballots are added to the count after the authenticity and eligibility of the voters has been verified,” Stewart told us in an email. “Sometimes ballots are added to the collection of existing ballots during the counting process, because they have arrived during the counting period, or they had been segregated for further verification. But, it is inaccurate (and inflammatory) to call it ‘dumping.’”", "In their analysis, Stewart and Foley looked at “the rise in the number of votes counted after Election Day (‘overtime votes’) and the growing tendency of these votes to disproportionately favor Democrats in presidential elections (the ‘blue shift.’)”", "In the last four presidential elections, the post-Election Day vote count “exhibited a ‘blue shift’ — 0.12 percentage points in favor of Kerry in 2004, 0.35 points in favor of Obama in 2008, 0.39 points in favor of Obama in 2012, and 0.30 points in favor of Clinton in 2016,” the report said.", "“The post-Election Day vote count generated a 0.12 percentage point shift in the national popular vote in favor of John Kerry in 2004, a 0.35 point shift for Barack Obama in 2008, and a 0.39 point shift for Obama in 2012, before Clinton’s 0.30 point gain in 2016.”", "But the authors dismissed “conspiratorial thinking” about why late-ballot tabulating has favored Democrats. The report said that the use of provisional and mail-in ballots has “grown substantially in number since 2000,” and they disproportionately consist of Democratic votes.", "Provisional ballots, which were mandated by the Help America Vote Act in 2002, allow voters to cast a ballot if their voter registration is challenged at the polling place. The Cooperative Congressional Election Study found that 60.1% of respondents who cast a provisional ballot identified as Democrats in 2016, Stewart and Foley say in their report.", "As for the use of mail-in ballots, Stewart told us that “Democratic campaigns have chosen to emphasize locking down their votes using absentees.”", "For example, Hillary Clinton, the Democratic presidential nominee in 2016, “received 81,736 overtime votes in Pennsylvania to Trump’s 57,792,” which “works out to a 58.6%-41.4% advantage for Clinton, or a 17.2 point margin,” Stewart’s report said.", "Despite the post-Election Day shift toward Clinton, Trump narrowly won Pennsylvania, and its 20 electoral votes. But it was so close that the Associated Press did not call the race until 1:36 a.m. the morning after Election Day.", "Pennsylvania “saw a blue shift in 2016, and I suspect we will … in 2020,” Stewart told us. But how much of a “blue shift” toward Biden won’t be known for a couple of days after the election.", "As we noted earlier, Pennsylvania’s secretary of state doesn’t expect to have the majority of votes counted until Friday. That’s because the state a year ago changed its law to allow registered voters for the first time to cast ballots by mail without a specific reason.", "There were only 186,664 absentee ballots cast by Pennsylvania voters in 2016, according to the EAC (Overview Table 2). But this year, 3.1 million Pennsylvania voters have requested mail-in ballots and nearly 2 million of those are registered Democrats, according to the U.S. Elections Project.", "As of Oct. 29, 1.4 million registered Democrats in Pennsylvania have returned their mail-in ballots, while only about 467,000 registered Republicans have done so, the U.S. Elections Project data show.", "In their report, Stewart and Foley write that a “key question going forward is whether the phenomenon of overtime votes will become normalized as part of the public’s understanding of the electoral process.”", "“The hard thing here is that in the past, initial counting took several days to complete, it’s just that no one noticed, and the number of ballots was relatively small,” Stewart told us.", "And this year? “It’s going to depend when specific states count specific ballots, and when they are reported,” Stewart said.", "Editor’s Note: Please consider a donation to FactCheck.org. We do not accept advertising. We rely on grants and individual donations from people like you. Credit card donations may be made through our “Donate” page. If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, 202 S. 36th St., Philadelphia, PA 19104.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here for more.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]