["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Defense attorneys Jerome Buting (left to right) and Dean Strang, along with prosecutors Thomas Fallon and Kenneth Kratz, during Steven Avery's murder trial in Chilton, Wis., in March 2007. (Milwaukee Journal Sentinel photo)", "The Netflix series Making A Murderer made rock stars of Wisconsin criminal defense attorneys Dean Strang and Jerome Buting, even though Steven Avery, their client and the central figure of the series, was found guilty of murder.", "The two are doing a speaking tour in North America, to be followed by one in Australia. Strang is getting a TV series. Buting is in demand, too -- and taking a whack at criminal justice in Wisconsin while he’s at it.", "While in Belfast to address a European bar association conference, Buting told the Irish Legal News in an April 11, 2016 article that Wisconsin is last in America when it comes to paying lawyers who represent poor defendants in criminal cases.", "\"We have a staffed indigent defense program statewide, but only about 60 percent of cases are handled by those salaried lawyers,\" Buting said, referring to Wisconsin public defenders, who are state employees.", "\"The remainder (of the cases) get appointed out to private attorneys on an hourly basis. The hourly basis is $40 an hour. It is now the lowest in the country, worse than the Deep South of America, which has historically been the least generous when it comes to this sort of thing.\"", "He added: \"It’s easy for politicians to demagogue and say ‘we’re going to cut this and cut that,' but what’s happened in Wisconsin should be a warning to Northern Ireland and other countries. I do think that not only lawyers but the public has to stand up to these attempts to try to cut the quality of defense for people accused of crimes.\"", "Leaving aside the question of whether pay affects quality, we found that Buting’s claim is mostly on target.", "The only caveat is that a complete comparison isn’t possible, given that 20 states don’t use set hourly rates like Wisconsin does.", "How the system works", "In Wisconsin, the first line of defense for people who are charged with a crime and can’t afford an attorney is a public defender.", "But because of heavy caseloads, and for other reasons, public defender offices throughout the state assign some of their cases to private attorneys who have agreed to take such appointments.", "As Buting said, Wisconsin pays those private attorneys $40 an hour. That amount has not changed since 1995.", "The $40 is for \"for time spent related to a case,\" in court or out of court, excluding travel. For travel time, the rate is $25 per hour, if the travel meets certain distance requirements.", "Other states", "To back his claim about where Wisconsin ranks, Buting cited a 2013 report from the National Association of Criminal Defense Lawyers.", "The report said 30 states, including Wisconsin, Iowa and Indiana, had established a statewide pay rate for private attorneys who handle criminal cases, with the average being about $65 per hour.", "Among those 30 states, the report said, \"Wisconsin has the lowest rate in the nation at $40 an hour.\"", "So, Buting is essentially on track.", "The report also noted, however, that 20 states don’t set hourly rates. In those states, the pay for the private attorneys is generally either set by a judge on a case-by-case basis, or through a contract between the state and the attorney. But even within some states, there are variations. In Illinois, Cook County (which includes Chicago) pays $40 per hour for in-court and $30 for out-of-court work, while all other counties establish their own rates.", "In other words, the report doesn’t provide an hourly breakdown for all 50 states.", "Randy Kraft, spokesman for the State Public Defender in Wisconsin, told us his office in fall 2015 essentially updated the National Association of Criminal Defense Lawyers report by checking the laws in all 50 states and found no other state hourly rate had slipped below Wisconsin’s.", "Our rating", "Buting says Wisconsin pays criminal defense lawyers who represent the indigent $40 per hour, \"the lowest in the country.\"", "According to the latest available data, Wisconsin’s rate was lowest among the 30 states that set hourly rates. But it’s worth noting that the effective hourly rates for the other states couldn’t be determined, because they use different systems.", "For a statement that is accurate but needs additional information, our rating is Mostly True.", "Irish Legal News, \"Wisconsin is a warning against Northern Ireland legal aid cuts, says a Making a Murderer lawyer,\" April 11, 2016", "Email, attorney Jerome Buting, April 13, 2016", "PolitiFact Wisconsin, \"Former Wisconsin Supreme Court candidate Marla Stephens says the state pays plumbers, others ‘much, much more’ than public defense attorneys (Mostly True),\" March 20, 2011", "Interview, Wisconsin State Public Defender Randy Kraft spokesman, April 18, 2016", "National Association of Criminal Defense Lawyers, \"Gideon at 50: A three-part examination of indigent defense in America,\" March 2013", "Wisconsin Legislative Fiscal Bureau, state budget memo, May 5, 2015", "Email, National Association of Criminal Defense Lawyers public affairs and communications assistant Ezra Dunkle-Polier, April 18, 2015", "Wisconsin Legislature, public defender statute, 977.08(4m)(c)", "Sixth Amendment Center, \"Justice shortchanged: Assigned counsel compensation in Wisconsin,\" May 2015", "Interview, Wisconsin attorney and former National Association of Criminal Defense Lawyers board member Anthony Cotton, April 19, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]