["Social media has been brimming with claims that the Muslim regiment of the Indian Army had refused to fight in India’s 1965 war with Pakistan. Several users have been using the viral message to question the ‘loyalty’ of Muslim candidates to be appointed to the posts of IAS and IPS officers. Twitter user @FansYati shared this message on September 15. His tweet had been liked 2,400 times and received 998 retweets at the time of writing. (archived link to the tweet)", "मुस्लिम रेजिमेंट जिसने भारत पाक युद्ध के समय लडने से मना कर दिया था. क्या आपको लगता है ये IAS/IPS बनकर देश सेवा कर सकते हैं ???", "— विराथू यति नरसिंहानन्द सरस्वती जी महाराज समर्थक 🔃 (@FansYati) September 15, 2020", "Another Twitter user @DK_Dube also posted the same tweet.", "The claim has gone viral on both Twitter and Facebook and is also being circulated in the form of a video. It was also the subject of a tweet by BJP’s national media panellist Yasshveer Raghav in October 2017. Alt News noticed that this claim has been doing the rounds online since 2017.", "कम लोगों को ही पता है कि 65 के युद्ध मे मुस्लिम रेजिमेंट ने पाक से युध्द लड़ने से मना कर दिया था जिसके बाद मुस्लिम रेजिमेंट समाप्त कर दी गई", "— Yasshveer Raghav (@iyashveerraghav) October 26, 2017", "After performing a keyword search, we found a list of all the regiments of the Indian Army in an ABP News report from June 22, 2020. There is no Muslim regiment on the list. Apart from this, we also came across a list of the Indian Army’s caste-based regiments in an article by Jagran Josh dated July 15, 2020. There is no mention of a Muslim regiment here either.", "A Times of India report dated November 30, 2017 also states that there was never a Muslim regiment in the Indian Army. This report was penned by Lieutenant General (Retd.) Syed Ata Hasnain.", "BBC News Hindi recently published a fact-check report on the viral claim. Major General (Retd.) Shashi Asthana was quoted as saying, “There was never any regiment in the army known as the Muslim Regiment. These regiments were either formed in the British period based on race and ethnicity or these were groups which functioned as a princely army, such as the Jammu and Kashmir Light Infantry Regiment. This regiment was an army of the princely state of Jammu and Kashmir.”", "Lieutenant General (Retd) Syed Ata Hasnain was also quoted in the report. He said, “This is propaganda and the Indian Army has never had a Muslim regiment for the last 200 years. Apart from regiments like the Sikh, Punjab, and Garhwal in the British Indian Army, there were also the Baloch and Frontier Force regiments. After the partition, the Baloch and Frontier regiments moved to Pakistan and the Punjab regiment exists in both Pakistan and India.”", "The BBC’s piece discusses the 1965 war against Pakistan mentioned in the viral claim — “The 1965 India-Pakistan war which was cited in the fake claims of the Muslim regiment putting down their weapons is in fact the same battle where Quartermaster general Abdul Hamid destroyed more than four Pakistani tanks and was posthumously awarded the Paramvir Chakra, the country’s top military award.”", "A Muslim regiment in the Indian Army has therefore never existed. Regiments with caste-based names came into existence long ago and their names have not been changed after Independence. However, this does not mean that only Jats are recruited in the Jat regiment and Rajputs in the Rajput regiment. People of all castes and religions are included in all regiments. The religion or caste of these soldiers has nothing to do with their regiment.", "Alt News also reached out to Major Navdeep. “There was never a Muslim regiment in the Indian Army. The Indian Army is an apolitical, secular institution where all the soldiers live and fight together under a shared national flag,” he said.", "The first part of the viral message makes the false claim about the ‘Muslim’ regiment allegedly laying down their arms. The second part moves away from the army and to the IAS/IPS posts. Recently, right-wing media outlet Sudarshan News launched a television series to falsely portray how people belonging to the Muslim community want to occupy Indian government posts in large numbers and carry out ‘UPSC jihad’. After the first episode was aired, Alt News published a fact-check report on the misleading narratives used by the channel bolstered by misinformation, false claims, and communalism.", "The Supreme Court halted the broadcast of the series after the fourth episode was aired and the matter is still being heard in the top court.", "Donate Now", "Kinjal Parmar holds a Bachelor of Science in Microbiology. However, her keen interest in journalism, drove her to pursue journalism from the Indian Institute of Mass Communication. At Alt News since 2019, she focuses on authentication of information which includes visual verification, media misreports, examining mis/disinformation across social media. She is the lead video producer at Alt News and manages social media accounts for the organization.", "A purported video of a Muslim man beating a temple priest with a bat is…", "A picture depicting the Pakistani flag apparently bigger in size and apparently placed higher than…", "Amid the ongoing war between Israel and Hamas, a video of a fleet of cars…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "A clip featuring Pakistan men’s Cricket team captain Babar Azam is viral on social media…"]