["The Employ Milwaukee Workforce Development location at 2342 North 27th Street, Milwaukee on Thursday, March 19, 2020 (MIKE DE SISTI / MILWAUKEE JOURNAL SENTINEL)", "Evers has the authority to launch the project by issuing a request for proposals.", "But the funds available to him aren’t close to covering the full project cost, estimated at up to $90 million.", "The project will need to be funded over a series of years, which means the Legislature must appropriate funds in the biennial budgets.", "Wisconsin’s beleaguered unemployment system is the latest battleground in the ongoing showdown between Democratic Gov. Tony Evers and the Republican-run Legislature.", "The system continues to stagger beneath the weight of pandemic-driven job losses, with thousands of Wisconsinites forced to wait months for benefits to be processed. Evers and his administration have drawn widespread criticism for the system, which also spurred the governor to effectively fire the head of the state’s workforce development agency.", "Evers has also leveled blame at Republicans, noting no substantive action was taken to upgrade a system long known to be insufficient during the eight-year stretch where the GOP controlled both the Legislature and governor’s mansion.", "The governor tried to push the issue forward with a special session on unemployment Jan. 19, but the Legislature convened and adjourned the session within seconds — as they have many other sessions Evers has called in an attempt to initiate action in one of the least active Legislatures in the country.", "Republicans have said such a step isn’t needed.", "\"It took us all of five minutes to understand that (Evers) has the authority and the revenue necessary to complete this task now,\" Assembly Majority Leaders Jim Steineke said in a Jan. 17, 2021, appearance on WKOW TV’s Capitol City Sunday program. \"He doesn’t need legislative approval. So if he’s just looking for us to put a stamp of approval on, hey governor, you got it, go ahead. The Legislature agrees with you, move forward. You don’t have to wait for us to pass it.\"", "Steineke later said Evers \"has all the flexibility to find the money necessary to complete what he wants to complete on this.\"", "Are Steineke and Republicans right that Evers has both the authority and revenue to address the unemployment system on his own?", "Let’s take a closer look.", "The task being debated here isn’t a small one.", "Evers’ office has estimated an overhaul of the state’s unemployment system would take 10 years to complete and cost $90 million. A Jan. 13, 2021, memo from the state’s nonpartisan Legislative Fiscal Bureau estimates the cost at between $48 million and $70 million.", "This comes as the unemployment system continues to see claims far above historical norms, fueling continued delays in processing payments.", "This will be the second attempt at such an upgrade, after an effort under Gov. Jim Doyle failed at great taxpayer expense. That unemployment system update was abandoned in 2007 after racking up a tab of $24 million.", "The Doyle project was funded by technology fees and one-time federal funds, but neither of those is available now. So Evers has said he plans to fund this upgrade through the state’s master lease program.", "The program, which dates back to 1991, is a way for agencies to finance the cost of IT projects over a number of years when projects are too large to allow lump-sum payment. From 2014 to 2020, $142 million was approved through this program for 28 different IT projects across state government, according to a September 2020 report on the master lease program from the nonpartisan Legislative Audit Bureau.", "State agencies can apply for this funding through the state Department of Administration, which decides whether to approve the applications and then obtains the necessary loans. The Legislature is not involved in the approval process, but it is involved in setting aside money that is used to make those lease payments.", "More on that in a bit.", "Steineke spokeswoman Alesha Emmert said Evers has the authority to begin the upgrade process by issuing a request for proposal, as his administration has done with many other upgrades without legislative approval.", "Britt Cudaback, a spokeswoman for Evers, acknowledged the governor has the authority to start the process, but she argued it’s irrelevant without ongoing funding.", "\"Funding a (request for proposal) … is meaningless if there’s no commitment from the Legislature to fund the rest of the project,\" Cudaback said in an email. \"Given the substantial cost for the overall project of $90 million, (Evers’) goal is to ensure funds will be there for the master lease payments in future biennia.\"", "Addressing the revenue question, the only specific funding source Emmert identified is a procurement appropriations fund overseen by the Department of Administration that had a $4 million balance at the end of the 2020 fiscal year. But that is far from sufficient in the context of a project that could cost $90 million. And even that fund isn’t accessible, as Emmert asserts.", "The funds are allocated to the Department of Administration to fund its role procuring items for agencies, not for transferring to other agencies to directly fund purchases, Cudaback said. In addition, the balance is projected to be only $2 million by the end of the 2021 fiscal year.", "Most notably, that fund was not listed among the potential funding sources in a list compiled by the fiscal bureau. State Rep. Mark Born, R-Beaver Dam, asked the agency to identify potential ways to pay for the unemployment upgrades.", "The resulting memo identified nine funding sources that could be allowable under statute. Seven of those had a balance of $25,000 or less, one had a liability of $85 million and one had a balance around $15 million. That fund, per statute, is to be used for the \"payment of costs associated with program integrity activities,\" and is currently used for fraud investigation, worker classification enforcement, identify verification and criminal prosecutions, among other things.", "Even if the entirety of that investigation fund were co-opted from its current use, it would fund just a fraction of expected cost.", "Whatever the mechanism, it’s clear funds will need to be set aside across multiple years. And the way to approve such ongoing funding is through the budget — which must pass the Legislature.", "The fiscal bureau memo pointed out the need for legislative involvement in the project. In response to a question about whether the Joint Finance Committee could move appropriations from another agency to fund the first payments toward the upgrade (it can), the memo noted this:", "\"If the Committee (did the transfer), it would be incumbent on the Legislature during the budget process to approve monies in subsequent biennia sufficient to fulfill the annual master lease costs over its term.\"", "That Legislative role was echoed in the 2020 audit. It suggested the Legislature consider getting involved in the master lease approval process since it is responsible for appropriating the needed money.", "\"Master lease payments must be made from funds that have been appropriated to state agencies,\" the audit said. \"Therefore, the Legislature could consider modifying statutes to require (the Department of Administration) to obtain its approval before approving applications for master lease funding above a specified amount or for specified projects, such as large, high-risk IT projects.\"", "Steineke’s claim about Evers’ power is particularly unusual since it contradicts his party’s usual view on financial oversight.", "Republicans argued explicitly against the idea of Evers allocating funding unilaterally in recent days. Assembly Speaker Robin Vos addressed the matter while defending a COVID-19 bill that would give the Republican-controlled finance committee oversight of how federal aid is spent in Wisconsin.", "\"It’s not something that’s all that abnormal,\" Vos, R-Rochester, said on PBS Wisconsin’s Here & Now program Jan. 29, 2021. \"It should mean the Legislature, the ones that are supposed to appropriate money, have the ability to oversee it just like we do with every other dollar that comes into the state treasury.\"", "Steineke said Evers \"has the authority and revenue necessary\" to upgrade the state unemployment system without the Legislature.", "Evers has the authority and funding to begin the process by seeking out proposals, yes. But it’s an empty authority when  no sources under Evers’ control that come close to funding the full project were known at the time of this claim.", "Steineke’s claim related to revenue simply isn’t true. Both sides acknowledge a master lease would be a logical way forward, and that requires ongoing funding over the course of multiple state budgets — which has to be approved by the Legislature.", "We define Mostly False as a statement contains an element of truth but ignores critical facts that would give a different impression.", "That fits here.", "Editor’s note:", "After Steineke made his statement, a new potential funding option emerged based on a long-unused section of state statute. A state law dating back to at least the 1940s — and unused anytime in recent history — would allow the state to impose a tax of up to 0.2% on all employer payrolls to collect funds needed to administer the state unemployment insurance program. This could be done without any legislative action and theoretically generate more than $60 million per year at its maximum level.", "However, the existence of this option was not publicly known when Steineke made his claim, and therefore was not part of his claim or the supporting evidence provided by his staff. The state Department of Workforce Development raised this as an option at a Jan. 21 meeting, four days after the statement being rated here. We rate claims based on what is known at the time (that’s one of the Principles of PolitiFact). As such, that does not affect the rating for this item.", "The story was also updated to clarify that the Wisconsin unemployment system did undergo some upgrades over the last decades, just nothing of substance to address the issues that came to a head amid the pandemic.", "WKOW, Capital City Sunday: Securing the Capitol, corporate donations cut off, ongoing COVID bill stalemate, Jan. 17, 2021", "Email exchange with Alesha Emmert, spokeswoman for Rep. Jim Steineke, Jan. 21, 2021", "Email exchange with Britt Cudaback, spokeswoman or Gov. Tony Evers, Jan. 26., 2021", "Legislative Fiscal Bureau, memo to Rep. Mark Born, Jan. 13, 2021", "Legislative Audit Bureau, Master Lease Program report, September 2020", "PBS Wisconsin, Vos on Mask Mandate, COVID Bill, Jan. 29, 2021", "Milwaukee Journal Sentinel,'I don't know what to do': With weekly unemployment claims rising, Wisconsinites are still waiting for answers, Jan. 15, 2021", "Milwaukee Journal Sentinel, Republicans shoot down Evers' plan to begin overhauling unemployment system, Jan. 13, 2021", "Milwaukee Journal Sentinel, Gov. Tony Evers asks Wisconsin DWD leader to resign over unemployment backlog, Sept. 18, 2020", "U.S. Department of Labor, Unemployment Insurance Weekly Claims Data, accessed Feb. 2, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]