["“The Nigeria Minister of Information and Culture, Lai Mohammed has stated that the presidency will support Democratic candidate Joe Biden with $600m as a pay back to Trump who supported terrorists in Nigeria (sic),” reads this Facebook post from September 25, 2020.", "It also alleges that Mohammed made the remarks at an event in the capital city Abuja where he purportedly urged “NIGERIA media to start from the first week of October to campaign for Joe Biden (sic)”.", "Foreign affairs ministry spokesman Ferdinand Nwoye told AFP Fact Check there was no government plan to back Biden. “To the best of my knowledge, there is nothing like that,” he said.", "There is also no public evidence that Mohammed, the minister of information, made the statements in Abuja. Local journalists at major newspapers, who would typically receive such news, told AFP Fact Check the minister had issued no press statement expressing support for Biden in America’s election on November 3, 2020.", "Obinna Chima, the group business editor of THISDAY Newspapers, said he did not get any message about government support for Biden, nor had he heard Mohammed say as much.", "Taiwo George, who edits Nigerian newspaper TheCable, called the report “fake news”.", "“It’s less than a month until the US presidential election and fake news about the election is booming. People should not just jump at anything they see on social media,” he said.", "AFP Fact Check contacted Mohammed’s office and will update this report with any official comments.", "This type of misinformation is common in Nigeria in the lead-up to US elections.", "In 2016, posts were circulating claiming that President Muhammadu Buhari donated $500 million to Hillary Clinton’s presidential campaign. Local media in Nigeria fact-checked the claim and found it to be false.", "According to the US Federal Election Commission (FEC), foreign governments are not allowed to donate to any candidate in any elections.", "“Foreign nationals are prohibited from making contributions, donations or expenditures in connection with any election — federal, state or local. Also, foreign nationals may not donate to any party committee building fund or fund electioneering communications,” the commission’s website reads.", "“Foreign governments, foreign political parties, foreign corporations, foreign associations, foreign partnerships and individuals with foreign citizenship” are considered foreign nationals.", "There is also no official record of Trump endorsing the Indigenous People of Biafra separatists in Nigeria, as claimed in the false posts. AFP Fact Check debunked a similar claim involving the US president in January 2019.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]