["California Gov. Jerry Brown speaks after the state Legislature passed a gas tax increase in April 2017. Ben Adler / Capital Public Radio", "Drivers in California will start paying a higher gas tax this fall, as part of a bill signed by Gov. Jerry Brown to raise money for the state’s deteriorating roads and bridges.", "But when that tax hike kicks in, how much revenue will go to road projects?", "Republican State Assemblywoman Melissa Melendez claimed in a press release and on Twitter on May 11, 2017 that a large chunk will be siphoned off for anything but roads.", "\"Governor Brown and his fellow Democrats are already diverting funding to their own pet projects,\" she said in the press release. \"In this budget proposal, they are diverting 30 percent of funding from the gas tax to non-road related projects like building parks and job training for felons. That’s money from the very gas tax the Democrats promised would go solely to fixing our decrepit roads and providing relief for traffic congestion.\"", "The gas tax increase is part of a larger transportation funding legislation signed by Brown in April 2017. In common speech, some politicians simply call this \"the gas tax.\"", "It includes an initial 12 cent per gallon gas tax increase that starts in November; a diesel tax hike; and a new \"transportation improvement fee\" ranging from $25 to $175 per year, depending on the value of one’s vehicle. We wrote about how this new tax will affect the state's already high gas tax rate here and gas prices here.", "It passed the Legislature with the help of Democrats and one Republican state senator. Melendez, who represents Riverside County, strongly opposed it.", "There’s no doubt roads are the main focus of the funding package. The measure was even called The Road Repair and Accountability Act of 2017.", "We decided to examine two key parts of Melendez’s claim: Did Brown’s budget ‘divert’ 30 percent of the transportation funding? And was this money being siphoned off for ‘non-road’ related projects?", "We buckled up for a fact check.", "Our research", "Melendez’s spokesman Sam Spencer showed us a chart in the governor’s revised May budget that he said backs up the claim.", "It shows proposals for spending $2.8 billion of the new transportation revenue in the next fiscal year on various programs. Local streets and roads would get $445 million; bridges and culverts would receive $400 million and congested corridors would get $250 million.", "Spencer highlighted other categories he said \"are clearly not programs intended to fix our crumbling roads.\"", "Those, Spencer said, include rail, transit, active transportation such as bikeways and pedestrian paths, parks and recreation, food and agriculture, university research and workforce development programs.", "Brown’s budget calls for spending $818.7 million on those.", "That’s about 29 percent of the overall $2.8 billion in new funding from the transportation package. It just about matches Melendez’s claim that 30 percent of the new revenue is being set aside for what appear to be non-road projects.", "Assemblywoman Melissa Melendez's office said this chart from the governor's May budget backs up the claim.", "Response from Brown Administration", "We asked the governor’s staff about Melendez’s claim and about the categories that seem to have little to do with roads.", "Malcolm Dougherty, director of the California Department of Transportation, took issue with Melendez’s characterization that the budget \"diverts\" any money from its intended purpose.", "\"The dollars are being used exactly the way SB 1 presented them,\" Dougherty said, referring to the number of the Senate transportation funding bill that was signed into law. \"The funding package was always intended to include transit and rail.\"", "Transit, rail and active transportation programs represent about one-quarter of the proposed new spending.", "Paul Golaszewski, who researches transportation funding at the nonpartisan California Legislative Analyst’s Office, agreed the governor’s budget \"adheres to SB1.\"", "He also noted that in future years, the share of money devoted purely to road projects, increases under the state’s funding plans.", "Why parks and job training?", "But that still leaves the question of why parks, universities, workforce and farm programs are getting any gas tax money. And whether those categories have anything to do with road projects.", "Dougherty, the Caltrans director, said that before SB1 was signed, existing laws required some gas tax revenue go to state parks and food and agriculture programs. Parks collect a portion of the tax on gasoline sales for off-road vehicles using the parks.", "Likewise, Dougherty said, food and agriculture programs get a slice of gas tax revenue when farmers purchase fuel for their vehicles, also under an existing law. Both laws remain in place after SB1.", "Dougherty added that the revenue for the parks and workforce training, the two categories cited by Melendez in her statement, represent less than 3 percent of the transportation revenue.", "The University of California and California State University systems will get a combined $7 million of the new revenue for what Dougherty called \"transportation related research.\"", "Finally, he said, the state’s workforce development board will get $5 million to prepare workers for jobs created by the transportation spending.", "Melendez’s spokesman pointed to a state workforce board budget document that proposes using that money for \"pre-apprenticeship training programs, focused on formerly incarcerated, women and minorities.\"", "SB 1 calls for the workforce board to create those programs. It also authorized the money for the universities.", "Our ruling", "California state Assemblywoman Melissa Melendez recently claimed Gov. Jerry Brown’s budget is \"diverting 30 percent of funding from the gas tax to non-road related projects like building parks and job training for felons.\"", "There’s some truth to her claim: The governor’s May budget shows about 30 percent of the revenue from this transportation measure goes to categories that won’t directly improve roads for cars and trucks, as dictated by the law Brown signed in April.", "Most of that 30 percent goes to bicycle, transit and rail projects. Melendez, however, cherry-picked two programs -- parks and workforce training -- that represent less than 3 percent of the overall funding. Melendez’s statement also ignores the fact that roads will see an increased share of the overall funding in future years.", "Additionally, it’s misleading and simply not accurate for Melendez to say this money is being ‘diverted’ when Brown’s budget proposes to spend the money exactly as outlined in the bill he signed and the Legislature passed a month earlier.", "There should be no surprise, at this point, that the measure required funding for transit programs, railways and bicycle and pedestrian paths. The smaller spending on parks, universities and workforce development may raise eyebrows, but was also authorized by SB 1.", "Melendez’s overall statement contains an element of truth but ignores critical facts that would give a different impression.", "We rate her claim Mostly False.", "MOSTLY FALSE – The statement contains some element of truth but ignores critical facts that would give a different impression.", "Click here for more on the six PolitiFact ratings and how we select facts to check.", "Assemblywoman Melissa Melendez, press release and tweet, May 11, 2017", "Interview, Sam Spencer, spokesman for Assemblywoman Melissa Melendez, May 16, 2017", "Interview, Malcolm Dougherty, director of the California Department of Transportation, May 18, 2017", "Interview, Paul Golaszewski, fiscal and policy analyst, California Legislative Analyst’s Office, May 18, 2017", "Senate Bill No. 1, The Road Repair and Accountability Act of 2017, accessed May 2017", "Brown Administration, 2017-18 May Revision to the Governor's Budget, accessed May 2017", "Sacramento Bee, California gas tax increase is now law. What it costs you and what it fixes, April 28, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]