["About this rating", "Former U.S. Secretary of State John Kerry and his wife, Teresa Heinz Kerry, have owned and made use of multiple homes, cars, a yacht, and a private jet over the years.", "Because Kerry signed a prenuptial agreement with his wife, who is heiress to the Heinz ketchup fortune, it's misleading to say all of the property they use belongs to Kerry. Most of the homes and the jet belong to his wife. It also appears that the meme being shared on social media exaggerates the number of homes and yachts owned by the couple.", "In late November and early December 2020, social media users shared posts claiming that former U.S. Secretary of State John Kerry, who has been selected by President-elect Joe Biden to serve as climate envoy in his administration, owns multiple cars, yachts, homes, and a private jet.", "The source of this claim appears to be a \"copypasta\" meme circulating on social media platforms, meaning that people are copying and pasting text and sharing it without any accompanying supporting evidence. The intent of the posts appeared to be criticism of Kerry's lifestyle, which leaves a larger carbon footprint than the average person's.", "Here is an example, with the Facebook user's name cropped out for privacy:", "The text of the post reads, \"John Kerry as climate czar? Only Democrats could pick a guy with 6 houses, 12 cars, 2 yachts and a private jet to tell you that YOU should take the bus, don't eat meat, use electric cars and not fart to stop pollution.\"", "The block of text appears to be based on past news stories, many of them published in the lead-up to the 2004 presidential election, in which Kerry was the Democratic challenger to Republican incumbent President George W. Bush. Kerry's bid for the White House was unsuccessful, as Bush won a second term. But his campaign resulted in media scrutiny of his finances, namely wealth in his marriage that belongs mostly to his wife, Heinz ketchup heiress Teresa Heinz Kerry, with whom Kerry signed a prenuptial agreement.", "As we reported in 2004, the couple owned five homes at the time, with a combined value of roughly $29 million. She bought four of those before her marriage, and the couple jointly owned one. In 2017 the couple sold the home in Nantucket, which belonged to his wife's family, and purchased one in Martha's Vineyard.", "The couple did make use of a luxury yacht, which brought Kerry scrutiny and criticism during the 2004 election cycle over reports that he docked it in Rhode Island to avoid paying higher taxes in Massachusetts. They sold it in 2017. Kerry has also made use of a private jet, but that, too, belongs to his wife.", "The matter of the Kerrys' cars also came up in 2004, when news outlets reported that he owned multiple vehicles. At the time, he was criticized for calling on people to buy American-made products while his wife drove a German-made car.", "It is true that Kerry has made use of multiple homes, vehicles, a private jet and a yacht over the course of years, though much of the property belongs to his wife. It does appear, however, that the meme exaggerated the number of homes and yachts they have owned.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]