["The claim was published alongside a photo of Om Birla and his daughter Anjali on Facebook here on January 7, 2021.", "The post’s Hindi caption translates to English as: “Om Birla’s daughter cleared IAS in the first attempt. She didn’t undertake any exam. 90 seats kept for back door entry (reserve list) for the country's most prestigious examination are being used for officials with power instead of poor, hard-working, people from a rural background and deserving candidates.”", "The IAS exam, also known as the Civil Services Examination, is a highly competitive testing process for candidates seeking to join the Indian Administrative Services (IAS), the administrative branch of the Indian government. The test is administered by the Union Public Service Commission (UPSC) every year.", "The photo and the claim were also published on Facebook here, here and here.", "The claim, however, is false.", "Anjali Birla’s name does appear on the list of reserve candidates from the 2019 examinations published on the UPSC website here.", "Anjali Birla’s roll number — 0851876, as seen above — appears on the IAS’ list of 2019 preliminary exam takers here and main exam takers here.", "Anjali Birla also refuted the false claim, calling it “baseless criticism” in an Instagram post on January 8, 2021.", "“Rumours have always been fun to hear but I haven’t come across such a baseless, mindless criticism,” she said.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]