["About this rating", "A viral forwarded e-mail that has been circulating since at least 2006, asserting that Muslims can't be \"good Americans\" because they worship \"the moon God of Arabia,\" has recently and falsely been linked to former GOP presidential candidate and retired neurosurgeon Dr. Ben Carson:", "Can a good Muslim be a good American?", "This question was forwarded to a friend who worked in Saudi Arabia for 20 years.", "The following is his reply:", "Theologically - no. . . . Because his allegiance is to Allah, The moon god of Arabia.", "Religiously - no. . . . Because no other religion is accepted by His Allah except Islam (Quran, 2:256) (Koran)", "Scripturally - no. . . . Because his allegiance is to the five Pillars of Islam and the Quran (Koran).", "Geographically - no. . . . Because his allegiance is to Mecca, to which he turns in prayer five times a day.", "Socially - no. . . . Because his allegiance to Islam forbids him to make friends with Christians or Jews.", "Politically - no. . . . Because he must submit to the mullahs (spiritual leaders), who teach annihilation of Israel and destruction of America, the great Satan.", "Domestically - no. . . . Because he is instructed to marry four women and beat and scourge his wife when she disobeys him (Quran 4:34)", "Intellectually - no. . . . Because he cannot accept the American Constitution since it is based on Biblical principles and he believes the Bible to be corrupt.", "Philosophically - no. . . . Because Islam, Muhammad, and the Quran do not allow freedom of   religion and expression. Democracy and Islam cannot co-exist. Every Muslim government is either dictatorial or autocratic.", "Spiritually - no. . . . Because when we declare 'one nation under God,' the Christian's God is loving and kind, while Allah is NEVER referred to as Heavenly father, nor is he ever called love in The Quran's 99 excellent names.", "Therefore after much study and deliberation ... perhaps we should be very suspicious of ALL MUSLIMS in this country. They obviously cannot be both 'good' Muslims and 'good' Americans.", "Call it what you wish . . . it's still the truth.", "You had better believe it.", "The more who understand this, the better it will be for our country and our future. The religious war is bigger than we know or understand ...", "Dr. Carson landed the public eye after announcing his candidacy in May 2015, Carson and proving popular in early GOP presidential polls and debates.  But his campaign ran out of steam, and in March 2016 officially dropped out of the race.  Along the way, he generated controversy with a statement regarding his opinions on Islam when he told NBC News that he didn't believe the tenets of the religion were consistent with the Constitution and he would not \"advocate\" for a Muslim president:", "I would not advocate that we put a Muslim in charge of this nation. I absolutely would not agree with that.", "But the message about Muslims' supposed inability to be \"good Americans\" has been circulating since at least 2006, nearly a decade before Carson walked into the national political spotlight, when it was posted to our own message board.", "The claim that Muslims worship a \"moon god\" has been promoted by Christian pastor Robert Morey, among others, and has been debunked by others as well.", "Like Christianity and Judaism, Islam is an Abrahamic religion founded on the same core texts and traditions. \"Allah\" is the Arabic word for \"God.\"", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]