["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "An old photo of actors Kurt Russell and Goldie Hawn is resurfacing claiming that Russell \"supports Trump.\" The photo, posted on May 9, 2016, to the Facebook page \"Florida Firefighters for TRUMP,\" shows Russell and Hawn walking down the sidewalk, holding hands and wearing shirts with American flags and \"Trump 2016.\"", "Russell’s shirt shows a photo of Trump holding a gun and references the Islamic State of Iraq and Syria, more commonly known as ISIS. \"We’re Gonna Knock the Hell Outta ISIS,\" the shirt reads.", "The caption with the photo also names \"Stephen (The Bull) McCaffrey,\" a reference to the 1991 film \"Backdraft\" in which Russell plays a Chicago firefighter.", "This story was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.) The Facebook page that posted the photo did not immediately respond to a message asking for evidence for its claim.", "An image search shows the photo is doctored.", "The photo was taken of the couple years ago while Hawn and Russell were out in Los Angeles, according to a September 2015 PopSugar article. They can be seen walking together, holding hands and wearing the same outfits the altered photo shows them in — only without American flags or references to Trump or ISIS on their white shirts.", "It’s not the first time Russell has been tied to Trump in viral social media posts. An image recently circulated on Facebook with a quote from Russell praising Trump. We rated that Pants on Fire.", "An altered photo attempts to depict Russell and Hawn as Trump supporters, by adding \"Trump 2016,\" American flags and more to their shirts. An image search quickly shows those aren’t the original outfits the couple was wearing.", "We rate this claim Pants on Fire!", "Florida Firefighters for Trump’s Facebook post, May 9, 2016", "PopSugar, \"Kurt Russell and Goldie Hawn Show Us All What True Love Looks Like,\" Sept. 12, 2015", "PolitiFact, \"No, Kurt Russell did not Tweet that Trump is ‘relentless,’ ‘dedicated,’ ‘determined’ and ‘brave,’\" Nov. 6, 2018", "IMDB, \"Backdraft,\" accessed Nov. 6, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]