["President Donald Trump speaks during a press briefing with the coronavirus task force. (AP Photo/Evan Vucci)", "In January, Trump said there were no worries about a pandemic.", "In late February, he said the virus was “very much under control.”", "Trump did activate federal measures to contain the spread in late January.", "In the early days of the coronavirus crisis, President Donald Trump aimed to reassure the public. Now, he has called for a 15-day push to shut down transmission.", "\"By making shared sacrifices and temporary changes, we can protect the health of our people and we can protect our economy,\" Trump said in a March 17 press conference.", "When a reporter asked if there had been a shift in tone, Trump shot back.", "\"I've always known this is a real, this is a pandemic,\" Trump said. \"I've felt it was a pandemic long before it was called a pandemic.\"", "Trump re-emphasized that point in a tweet the next morning.", "\"I always treated the Chinese Virus very seriously, and have done a very good job from the beginning, including my very early decision to close the ‘borders’ from China,\" Trump tweeted March 18.", "I always treated the Chinese Virus very seriously, and have done a very good job from the beginning, including my very early decision to close the “borders” from China - against the wishes of almost all. Many lives were saved. The Fake News new narrative is disgraceful & false!", "Trump and his administration acted to keep the virus out of the United States, but his words in public downplayed the threat for many weeks.", "On Jan. 20, about three weeks after China first reported the new virus, the World Health Organization reported cases in China, Japan, Thailand and South Korea.", "The Centers for Disease Control and Prevention activated its emergency response center on Jan. 21. On Jan. 29, the White House formed the Coronavirus Task Force, headed by Secretary of Health and Human Services Alex Azar and coordinated by the National Security Council.", "On Jan. 30, Trump effectively banned all non-Americans from entering the country if they had been in China in the previous two weeks. Americans could come back, but they would be quarantined. Azar declared a public health emergency.", "The same day, WHO declared a global health emergency. It was the fifth time WHO issued such a warning since 2005.", "Fears of a pandemic were in the air by mid January. The federal response came as Trump painted a more comforting picture.", "On Jan. 22, in an interview with CNBC, Trump was asked, \"Are there worries about a pandemic at this point?\"", "\"No,\" Trump replied. \"Not at all. We have it totally under control. It’s one person coming in from China, and we have it under control. It’s going to be just fine.\"", "Two days later, he gave the sense that the virus would be kept in China.", "\"China has been working very hard to contain the Coronavirus,\" Trump tweeted Jan. 24. \"The United States greatly appreciates their efforts and transparency. It will all work out well.\"", "China has been working very hard to contain the Coronavirus. The United States greatly appreciates their efforts and transparency. It will all work out well. In particular, on behalf of the American People, I want to thank President Xi!", "Trump maintained that upbeat tone at a Jan. 30 rally in Iowa.", "\"We think we have it very well under control,\" he said. \"We have very little problem in this country at this moment — five. And those people are all recuperating successfully.\"", "In a Feb. 2 interview with Fox News host Sean Hannity, Trump repeated the idea that transmission was unlikely.", "\"We pretty much shut it down coming in from China,\" he said. \"We’re going to see what happens, but we did shut it down.\"", "Trump also suggested that warmer weather in April would beat back the virus. As late as Feb. 24 and Feb. 25, Trump continued to paint a picture of a virus corralled.", "He tweeted that the virus was \"very much under control in the USA,\" and added \"Stock Market starting to look very good to me!\"", "In India, he said \"we have very few people with it,\" and they were getting better.", "This was at a time when WHO had reported 76,000 cases worldwide.", "A pandemic is when a new disease spreads worldwide. On March 11, WHO formally declared the coronavirus to be a pandemic.", "Trump said that he’s \"always known this is a real, this is a pandemic. I've felt it was a pandemic long before it was called a pandemic.\"", "Until late February, Trump spoke as though the U.S. problem was limited and well under control. That description is at odds with the nature of a pandemic.", "We can’t know what was in Trump’s mind when he aimed to reassure the public, but his words did not fit with the threat of a pandemic.", "Trump’s claim that he was always aware of it being a pandemic is contradicted by his many early comments. His statement now is not accurate. We rate this claim Pants on Fire!", "White House, Daily Coronavirus Pandemic Briefing, March 17, 2020", "Donald Trump, Tweet, March 18, 2020", "CNBC, PRESIDENT DONALD TRUMP SITS DOWN WITH CNBC’S JOE KERNEN AT THE WORLD ECONOMIC FORUM IN DAVOS, SWITZERLAND, Jan. 22, 2020", "Donald Trump, Tweet, Jan. 24, 2020", "Donald Trump, Tweet, Jan. 27, 2020", "Donald Trump, Political Rally in Des Moines, Iowa, Jan. 30, 2020", "Fox News, Coronavirus: President Trump said US authorities 'shut it down.' Here's what that means, Feb. 3, 2020", "White House, Remarks by President Trump to National Border Patrol Council Members, Feb. 14, 2020", "Donald Trump, Tweet, Feb. 24, 2020", "White House, Remarks by President Trump in Press Conference, India, Feb. 25, 2020", "White House, Statement from the Press Secretary Regarding the President’s Coronavirus Task Force, Jan. 29, 2020", "Centers for Disease Control and Prevention, Situation summary, March 17, 202", "World Health Organization, Situation report, Jan. 21, 2020", "World Health Organization, Statement on the second meeting of the International Health Regulations (2005) Emergency Committee regarding the outbreak of novel coronavirus, Jan. 30, 2020", "World Health Organization, What is a pandemic?, Feb. 24, 2010", "World Health Organization, WHO Director-General's opening remarks at the media briefing on COVID-19, March 11, 2020", "New York Times, Coronavirus Outbreak Sours Japan on Chinese Tourist Boom, Jan. 24, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]