["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A Portillo's restaurant is poised to open in the Milwaukee suburb of Brookfield in July 2016. (Michael Sears/Milwaukee Journal Sentinel)", "On the day he announced his run for governor of Wisconsin, Democrat and political newcomer Andy Gronik attacked Republican Gov. Scott Walker in an interview on WTMJ-AM in Milwaukee.", "The afternoon drive-time host, John Mercure, asked Gronik on July 11, 2017 how he would pay for his proposal to provide free college to needy students who have good grades, and how much Gronik’s idea would cost.", "The suburban Milwaukee businessman responded by making statistical claims criticizing Walker’s record on jobs, including this one:", "\"We are 50th out of 50 states -- so we're dead last in creating new businesses in the state of Wisconsin for three years in a row.\"", "That would be a strong counter to Walker’s frequent boasts about how the state’s unemployment rate has dropped during his time as governor. It’s also a claim Gronik made in two other interviews.", "Let’s see if he’s right.", "Counting isn’t necessarily simple", "It’s worth noting at the top that even a simple count of new businesses isn’t necessarily simple.", "While running for governor in 2010, Walker promised to create 10,000 new businesses during his first term. Near the end of the term, the number of registered business entities had risen by more than 25,000. But we found the count of registered businesses is a general economic indicator with severe limitations.", "The count includes not only new ventures that bring new jobs, but thousands of entities with no workers on the payroll at all -- and little if any prospect of hires to come. Those include hundreds of nonprofits such as Scout troops and thousands of limited-liability companies set up by real-estate investors solely to hold ownership of property or properties.", "As we’ll see, Gronik’s claim also has issues.", "Gronik’s evidence", "To back Gronik’s claim, his campaign referred us to a May 2017 news article in the Milwaukee Journal Sentinel on the 2017 Kauffman Index of Startup Activity. The index is produced by the Ewing Marion Kauffman Foundation, one of the country’s leading entrepreneurship advocacy and research organizations.", "Wisconsin did, in fact, rank last among the 50 states in 2015, 2016 and 2017 in startup activity, according to the index.", "But the Kauffman index is not simply a count of new business creations, which is what Gronik’s claim is about -- it is a combination of three measures that Kauffman thinks are important in assessing startup activity.", "One measure is the number of startup firms less than a year old that employed at least one person for every 1,000 such businesses in the state. The other two measures are the percentage of adults who become entrepreneurs and the percentage of new entrepreneurs who started businesses primarily because they saw a market opportunity, rather than because they were unemployed.", "Wisconsin ranked last because its overall index for the three measures (-3.65) was the lowest -- significantly below Alabama, the 49th-ranked state, at -2.69. Nevada ranked No. 1, at 3.22.", "We found two more narrowly tailored federal data sets that help evaluate Gronik’s statement.", "BLS rankings", "When we posed Gronik’s statement to the U.S. Bureau of Labor Statistics, the agency suggested we look at its data on \"establishment births\" -- the number of new businesses created in a particular year -- as a percentage of all business establishments in each state.", "Wisconsin does better on this measure, ranking near the middle.", "The most recent figures show that for the first three quarters of 2016, new establishments accounted for 6.7 percent of all business establishments in Wisconsin, a rank of 29th, according to our calculations. It ranked 34th in 2015 and 32nd in 2014.", "Census rankings", "We were also directed to U.S. Census Bureau data on new businesses that had employees. But it is less useful, given that the latest data is for 2014.", "For 2014, Wisconsin ranked 44th when considering the percentage of firms in the state that were created during that year. A firm is defined as a business that has one or more establishments. Viewed another way, Wisconsin ranked 46th for the percentage of establishments that were opened in 2014. An establishment is a single location where business is done.", "(The BLS data is collected from administrative records and cover a wider spectrum of business establishments. The Census data is collected using a survey and covers a more limited set of businesses.)", "Our rating", "Gronik said Wisconsin is \"dead last in creating new businesses\" for \"three years in a row.\"", "He’s correct when citing the 2015, 2016 and 2017 rankings from the respected nonprofit Kauffman Index on Startup Activity. But that index, while it takes into account what portion of a state’s businesses were created in a given year, also considers two other variables. So, it supports Gronik’s statement only to a point.", "Conversely, Wisconsin ranked between 29th and 34th for 2014 through 2016, according to the latest figures from the federal Bureau of Labor Statistics. Those rankings are based strictly on the percentage of a state’s business establishments that were created in each year.", "Gronik’s statement is partially accurate -- Half True.", "WTMJ-AM/Soundcloud, Andy Gronik  interview, July 11, 2017", "Email, Andy Gronk campaign, July 17, 2017", "Email, Scott Walker campaign, July 17, 2017", "Email, Kauffman Foundation senior research analyst and program officer Arnobio Morelix, July 19, 2017", "PolitiFact Wisconsin, \"Mary Burke says Wisconsin second to last in business formation,\" Oct. 20, 2013", "Milwaukee Journal Sentinel, \"For third straight year, Wisconsin ranks last in business startup activity,\" May 18, 2017", "Kauffman Foundation, \"The 2017 Kauffman Index of Startup Activity: State Trends (Table 4),\" May 2017", "Kauffman Foundation, \"The 2016 Kauffman Index of Startup Activity: State Trends (Table 4),\" August 2016", "Kauffman Foundation, \"The 2015 Kauffman Index of Startup Activity: State Trends (Table 1),\" June 2015", "Milwaukee Journal Sentinel, \"New census data shows state's 2012 start-up rate third lowest in U.S.,\" Sept. 26, 2014", "PolitiFact Wisconsin, \"Different measuring sticks size this one up differently,\" Sept. 25, 2014", "Email, U.S. Census Bureau media relations representative Daniel Velez, July 18, 2017", "U.S. Census Bureau, Business Dynamics Statistics’ Active Establishments -- Firm Age by State for 2014, accessed July 18, 2017", "Interview, U.S. Bureau of Labor Statistics press officer Gary Steinberg, July 18, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]