["The video has been viewed more than 6,000 times since it was posted on Twitter here on February 27, 2021.", "“Stephen Chow was filmed going to the hospital to visit Ng Man-tat,” the Chinese-language tweet reads.", "The video also features superimposed simplified Chinese text that translates as: “Stephen Chow showed up at hospital to visit Ng Man-tat”.", "The post circulated the same day that Ng Man-tat, a well-known actor with whom Chow often collaborated, died of cancer in a Hong Kong hospital.", "The video, as well as screenshots from the footage, were also viewed tens of thousands of times alongside similar claims on Facebook here, here and here and on Weibo here, here and here.", "The claim, however, is false.", "A Google keyword search found several photos that correspond to the video that were published by the Hong Kong China News Agency (CNA) here November 26, 2020, several months before Ng’s death.", "The photos are credited to CNA and are under a traditional Chinese headline that translates as: “Photos: Stephen Chow left Hong Kong’s High Court after testifying in court”.", "“On the afternoon of November 26, Hong Kong well-known film star Stephen Chow (the person with hat) left Hong Kong's High Court after testifying in court,” the photos' caption reads.", "“Stephen Chow was asked by his ex-girlfriend Alice Yu to pay back more than HK$70 million. The case was renewed in Hong Kong's High Court on the same day.”", "Below are screenshot comparisons between the footage shared in the misleading posts (L) and the CNA photos (R), with corresponding dress and building features circled in red:", "Chow’s November 2020 court appearance was also reported by Hong Kong Open TV here and Hong Kong newspaper The Standard here.", "Chow did not respond to requests for comment from AFP.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]