["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A 2017 story is getting renewed attention as social media users reshare a NewsPunch.com post claiming movie stars and studios were snubbing actress Nicole Kidman after she voiced her support for President Donald Trump.", "\"Nicole Kidman ‘blacklisted’ from Hollywood for vowing to support president,\" reads the headline.", "\"Nicole Kidman has had contracts cancelled by two Hollywood studios and has been warned by ‘famous liberal celebrities’ to ‘steer clear of the Oscars,’ according to a source at Creative Artists Agency in Los Angeles,\" the story says. \"Why all the hate? Because on January 10th, Nicole Kidman, a Hollywood A-lister, dared to go against the Hollywood agenda and told an interviewer that ‘we need to support whoever is the president.’\"", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "It’s true that Kidman said Americans should support then-President-elect Donald Trump.", "In a Jan. 10, 2017, interview with Victoria Derbyshire on BBC Two, Derbyshire says that Kidman has dual citizenship and voted in the U.S. elections and then asks what Kidman thinks of Trump.", "\"I’m always reticent to start sort of commenting politically, I’ve never done it in terms of America or Australia, I’m issue-based,\" she said, before adding, \"He’s now elected and we as a country need to support whosever the president because that’s what the country’s based on. And however that happened, he’s there and let’s go.\"", "Kidman then pivoted to discussing her commitment to \"women’s issues\" and fundraising for breast and ovarian cancer.", "As the Washington Post reported at the time, Kidman was quickly criticized on social media. The newspaper also noted that Kidman’s comments were in stark contrast to those of many other celebrities, including Meryl Streep, who had recently given a speech critical of Trump while accepting a Golden Globe award.", "Others, including Kelly Osbourne, advocated for giving Trump a chance.", "\"We have to give him a chance,\" Osbourne then said. \"And we do it by spreading love, not hate.\"", "Several days after Kidman’s BBC Two interview, Kidman clarified that her comments were about her belief in democracy, and that she wasn’t endorsing Trump, the Associated Press reported.", "\"I was trying to stress that I believe in democracy and the American Constitution, and it was that simple,\" she told Access Hollywood.", "But we couldn’t find any credible evidence that Kidman has been blacklisted from Hollywood. She attended the 2017 Academy Awards, where she was a nominee for best supporting actress, and since her comments, she’s appeared in movies including: \"Boy Erased,\" \"Aquaman,\" and \"The Goldfinch.\" She’s also been an executive producer on several projects.", "She’s also starred in the HBO show \"Big Little Lies\" alongside Meryl Streep. In September, USA Today reported that it was Streep who convinced Kidman to take the role of ex-\"Fox & Friends\" host Gretchen Carlson in \"Bombshell,\" which is in theaters now.", "If evidence emerges that Kidman was blacklisted from Hollywood because of her support for Trump, we’ll reconsider our rating. Evidence available now indicates it’s False.", "NewsPunch.com, Nicole Kidman ‘blacklisted’ from Hollywood for vowing to support president, Jan. 22, 2017", "BBC Two, Nicole Kidman: I wish I’d had more children, Jan. 10, 2017", "The Washington Post, Nicole Kidman on Trump: ‘We as a country need to support whoever’s the president, Jan. 13, 2017", "The Associated Press, Nicole Kidman: Comments about Trump support weren’t endorsement, Jan. 15, 2017", "USA Today, Meryl Streep convinced Nicole Kidman to star in ‘Bombshell’ about ‘dubious’ Fox News, Sept. 10, 2019", "Hollywood Reporter, Nicole Kidman is wearing Armani Prive at the 2017 Oscars, Feb. 26, 2017", "IMDB, Nicole Kidman, visited Jan. 10, 2020", "Lead Stories, Fake news: Nicole Kidman NOT blacklist after calling for Americans to support Trump, Jan. 7, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]