["Former Florida Gov. Jeb Bush speaks in Detroit on Feb. 4, 2015.", "A key part of former Gov. Jeb Bush’s talking points as he explores a presidential bid is to call for giving every child access to a great public education, regardless of where they live. Bush has talked for years about the gains of minority students in Florida.", "\"Florida’s Hispanic kids are the best of any Hispanic group of Hispanic students in the United States -- in fact, two grade levels ahead of the average in the United States,\" Bush said during a speech at the Detroit Economic Club on Feb. 4", "We decided to fact-check if Hispanic students in Florida perform \"the best\" of any Hispanic population in the United States. Let’s hit the books.", "Florida’s Hispanic students", "A spokeswoman for Bush told PolitiFact that Bush was referring to fourth grade reading scores from The National Assessment of Educational Progress, or NAEP.", "Many educational experts consider the annual NAEP, dubbed \"the nation’s report card,\" to be the best state-by-state measure of education systems. Sponsored by the U.S. Education Department, the exam is given to a sample of fourth, eighth and 12th grade students every two years in reading and math.", "For 2013, the NAEP showed that Florida’s Hispanic fourth-graders ranked the first state in the nation for highest average reading score. (The Education Department considers Florida’s score statistically tied with a handful of other states.) So Bush chose a statistic that puts Florida’s Hispanic students in the most favorable light.", "While Bush can point to the NAEP reading results for fourth graders and argue Florida’s students are \"the best,\" that title doesn’t hold up on all NAEP measurements. For example, Florida’s Hispanic fourth graders were fourth among states for math, and eighth graders ranked lower in both reading and math.", "Is there a valid reason for Bush to zero in on fourth-grade reading?", "\"Reading scores in fourth grade are widely considered to be an important metric because early literacy has been linked to subsequent educational outcomes,\" said Sterling C. Lloyd, senior research associate at Education Week Research Center. \"For instance, according to research studies, students who are struggling to read in third grade are at greater risk of dropping out of high school. It’s thought of as an early warning sign predicting risk of dropping out.\"", "But it’s helpful to consider NAEP scores in other grades and subjects, as well as high school graduation rates, to \"provide a more comprehensive view of educational results than a single metric,\" Lloyd said.", "For example, with respect to eighth grade NAEP reading, Florida’s scores for Hispanic students were 12th nationally (out of 46 states and D.C.). For eighth grade math, Florida ranked 20th.", "Another expert took issue with the definition of \"Hispanic.\" Richard Rothstein, an education research associate at the Economic Policy Institute, previously told us that it’s a meaningless category for educational purposes.", "\"Florida’s ‘Hispanics’ are not comparable to ‘Hispanics’ in other states because Florida’s include a larger proportion of middle-class Cubans, and a smaller proportion of lower-class Mexicans. Without knowing anything else, you would expect middle-class Cubans to perform at a higher level than lower-class Mexicans, because of the literacy levels at home, if for no other reason.\"", "University of Iowa Professor David Bills said we would need to know more about the family background of Hispanics in different states to reach any conclusions about why Florida outperforms other states.", "\"If there is anything we know for certain about test scores, it’s that the effects of families trump the effects of schools,\" he said.  \"My guess is that they’re more likely to have well-educated parents than are Hispanic kids from California or Wisconsin, which score much lower. I think in a properly conducted study, we would learn that Florida’s fourth grade Hispanics do pretty well more because they come from social backgrounds that facilitate their doing well, and less because of things happening inside schools.\"", "Our ruling", "Bush said, \"Florida’s Hispanic kids are the best of any Hispanic group of Hispanics students in the United States.\"", "Bush’s statement was too broad and he didn’t explain what measurement he used to reach that conclusion -- which was fourth grade reading scores. On NAEP, a respected source of testing data, Florida’s Hispanic fourth graders ranked statistically tied for first among states in 2013.", "But that's not the case for fourth grade math. Nor does the trend continue when looking at eighth grade test scores.", "Bush's claim is partially accurate. We rate it Half True.", "National Assessment for Educational Progress, State comparisons in reading and math, 2013", "Foundation for Excellence in Education, \"Governor Jeb Bush urges education reforms to close Hispanic achievement gap,\" Sept. 17, 2014", "Florida Department of Education press release, \"Nation’s report card shows Florida student progress,\" Nov. 7, 2013", "PolitiFact Florida, \"Florida interim education commissioner gives props to state’s graduation rates improvements,\" 2013", "Tampa Bay Times, \"Jeb Bush in Detroit to issue attack in Washington, call for ‘a new vision,\" Feb. 4, 2015", "Interview, Cheryl Etters, Florida Department of Education spokeswoman, Feb. 4, 2015", "Interview, Kristy Campbell, spokeswoman for former Gov. Jeb Bush, Feb. 5, 2015", "Interview, Sterling C. Lloyd, Senior Research Associate, Education Week Research Center, Feb. 5, 2015", "Interview, Robert Balfanz, an education expert at Johns Hopkins University and one of the authors of Building a Grad Nation, Feb. 5, 2015", "Interview, David Bills, University of Iowa education professor, Feb. 5, 2015", "Interview, David Thomas, U.S. Department of Education spokesman, Feb. 5, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]