["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "North Carolina Governor Roy Cooper says half of the tax breaks proposed by the House and Senate would go to the \"wealthiest 1 percent.\"", "North Carolina’s U.S. senators, Richard Burr and Thom Tillis, are among the most vocal proponents of GOP plans to change the federal tax code.", "The Tar Heel State’s top Democrat, meanwhile, is among the plans’ most high-profile detractors.", "Gov. Roy Cooper recently criticized House and Senate efforts to cut taxes, saying they overwhelmingly favor groups that need help the least – large corporations and millionaires. While Tillis recently pointed to North Carolina as a positive example for change, Cooper highlighted what he said were the negative consequences of the state tax code and said Congress’ efforts seem \"eerily familiar\" in his state. The tax reform efforts in NC and in Washington have divided local Republicans and Democrats.", "\"Unfortunately, decisions made by the Republican state legislature have left too many middle class families out of our state’s economic growth,\" Cooper wrote in a Nov. 30 op-ed published on Medium.com. \"Those decisions rigged the system to let those at the top reap most of the rewards.\"", "Congressional Republicans, he said, are charting the same course.", "\"In total, it is estimated that half of the tax breaks in this proposal would go to the wealthiest 1 percent,\" Cooper wrote. \"The Joint Committee on Taxation shows that, on average, taxpayers earning $75,000 or less would end up paying more in taxes.\"", "PolitiFact’s recent fact-check of Tillis shows that Cooper is partly right about taxpayers who earn less than $75,000 a year, but he left out the fact that most Americans would get a tax cut initially. Experts say that, by 2027, the Senate plan will leave them paying more in taxes, barring further changes in law.", "There are two tax plans being considered right now: a Senate plan and a House plan. PolitiFact recently published an explanation of both here. Unlike Tillis, Cooper didn’t single out one of the plans. Instead he spoke generally about how \"this proposal\" would affect the wealthiest Americans.", "The plan changes by year", "PolitiFact reached out to Cooper for clarification. Ford Porter, his spokesman, cited analyses of each plan by the nonpartisan Urban Institute-Brookings Institution Tax Policy Center.", "The Tax Policy Center (let’s call it the TPC) found that the Senate plan gives 61.8 percent of the tax cuts to the top 1 percent \"once the cuts are phased-in,\" Porter said.", "\"Their analysis of the House bill showed 47 percent (of the cuts) going to the top 1 percent,\" he added.", "Porter is right. But key words to consider are \"once the cuts are phased in.\"", "The report shows that estimates don’t bear out Cooper’s claim until 2027, because that’s when many of the deductions for lower-income Americans are phased-out.", "In 2019, the center says the top 1 percent would get 17.6 percent of the Senate plan’s total federal tax change, a share that would rise to 22 percent in 2025.", "Porter acknowledges that distinction in his email. But Cooper’s op-ed failed to elaborate on his claim, which isn’t true if examined in the years prior to 2027.", "Change, in dollars", "What does that look like in financial terms? The Tax Foundation is a conservative-leaning nonprofit organization that examines the link between tax policies and the economy.", "The foundation found that, under the Senate plan, the bottom 80 percent of taxpayers would initially keep 1.1 to 1.9 percent more of their income. America’s wealthiest – the one-percenters – would initially keep about 7.5 percent more of their money because of cuts to the corporate tax rate, as well as the income tax rate.", "By 2027, things change for the bottom 80 percent of taxpayers. The foundation estimates they’ll keep just 0.3 to 0.4 percent more. The top 1 percent, however, would keep 4.5 percent more compared to today’s rates.", "The TPC has a similar analysis. The center says that in 2019, the Senate plan would cut taxes by an average of $900 for taxpayers earning between $50,000 and $87,000 a year. The average tax cut for the top 1 percent would be $34,000.", "The House bill similarly phases-out deductions for lower-income Americans, said Joe Rosenberg, senior research associate for the TPC. In the House bill, for example, \"there’s a $300 child and family credit that expires after five years at the end of 2022. That would be for a family of four, that would be a $1,200 tax credit,\" Rosenberg said.", "By 2027, the analysis says those middle-income taxpayers would get cuts of less than 0.1 percent while the average \"one-percenters\" would still enjoy taxes that are 1.4 percent lower than they are right now.", "Our ruling", "Cooper said half of the tax breaks in Senate Republicans’ proposal would go to the wealthiest 1 percent of Americans. If key changes in the plan remain temporary, Cooper’s claim would come to fruition, but not for 10 years. Cooper’s op-ed doesn’t explain that change. On balance, we rate his claim Half True.", "Op-ed by North Carolina Gov. Roy Cooper, \"Washington’s tax scheme looks eerily familiar,\" published Nov. 30 on Medium.com.", "Email correspondence with Ford Porter, spokesman for NC Gov. Roy Cooper.", "Fact check by PolitiFact, \"Sen. Tillis says plan won't raise taxes on Americans earning $30K-$70K a year,\" Nov. 30, 2017. Fact check comparing the Senate and House tax plans, \"The House and Senate tax bills, explained,\" Nov. 27, 2017. Fact check, \"Sen. Thune: Individual mandate fine falls mainly on people making under $50,000,\" Nov. 17, 2017.", "A report published Nov. 20, 2017 by the Urban Institute-Brookings Institution Tax Policy Center.", "Phone interview with Joe Rosenberg, senior research associate for the Tax Policy Center.", "A report published Nov. 10, 2017 by The Tax Foundation.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]