["Two photographs of JNSU president Aishe Ghosh have been juxtaposed together to portray that she plastered different arms at different times. Thus suggesting that her injuries are fake. Ghosh was injured during violence in Jawaharlal Nehru University (JNU) where masked goons attacked students on January 5-6. Shefali Vaidya was among those who made the allegation but later took it down.", "RSS-affiliated ABVP’s national organising secretary Ashish Chauhan also shared the images. His tweet, now deleted, was retweeted by Dr Vijay Chauthaiwale, in-charge of BJP’s foreign affairs department.", "Aishe Ghosh’s left arm is plastered, not the right. The photograph used to portray plaster on her right arm has been mirrored. Alt News found a similar image as the viral one where Ghosh can be seen at the same location. This was tweeted by Hindustan Times on January 7.", "#JNUViolence | JNU student leader Aishe Ghosh, injured in Sunday mob attack, booked for destroying varsity propertyhttps://t.co/uYwD1xgXeA#JNUAttack pic.twitter.com/xef5pea7eO", "— HT Delhi (@htdelhi) January 7, 2020", "A comparison of the viral image with the one above evidently proves that the former has been mirrored. The similarities in both pictures are as follows:", "The viral image is from the press conference addressed by Aishe Ghosh on January 6. A video of the event also shows her left arm plastered.", "Furthermore, multiple other photographs of the JNUSU president reported in the media show that her left arm is plastered.", "Delhi: DMK MP Kanimozhi meets Jawaharlal Nehru University Students’ Union President Aishe Ghosh in the campus. #JNUViolence pic.twitter.com/VJm7Ocyoyg", "— ANI (@ANI) January 8, 2020", "DMK MP @KanimozhiDMK met JNUSU Prez Aishe Ghosh, enquires about health.#JNUAttacks #AisheGhosh pic.twitter.com/rdvBy3T3Lm", "— Puthiya Thalaimurai (@PTTVEnglish) January 8, 2020", "One Rajesh Salunke who identifies himself as a “student activist” of ABVP raised suspicions about Ghosh’s injury.", "Twitter user Sanjana Reddy (@Saffron_Kanya)’s post drew over 250 retweets.", "Rosy (@rose_k01) followed by BJ IT cell head Amit Malviya and BJP Delhi spokesperson Tajinder Pal Singh Bagga also tweeted the images.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]