["About this rating", "On 28 February 2016, the entertainment web site HeavierMetal.net published a fake news article claiming that musician Rob Zombie had been kicked out of the 88th Academy Awards ceremony:", "Multiple people began reporting a man who was believed to have bypassed security and made it onto the highly secure red carpet during the pre-show. This feat is nearly impossible as the Oscars is one of the highest profile events of the year.", "While the man casually strolled down the red carpet, a security team rushed in to take the intruder down and remove him from the event. As he was tackled, a pack of Marlboro cigarettes fell from the man’s pocket — bouncing off of the ground. He didn’t appear to resist any of the efforts of the security team, but could be heard screaming “dig through the ditches and burn through the witches — I slam in the back of my dragula!”", "Almost immediately, people nearby began speculating that the man was possessed.", "There’s only one problem, it was actually Rob Zombie — a noted film director and legendary musician in the hard rock and heavy metal world.", "This story is a work of fiction. While we could not find a specific disclaimer on the page identifying HeavierMetal.net as an entertainment web site, no other media outlets have reported on Rob Zombie's alleged altercation with Oscar security.  As the Oscars were aired (or streamed) live and heavily covered by local, national, and international media, an event as spectacular as a full-body tackle on the red carpet, Rob Zombie or no, would have received immediate and widespread attention.", "Also, the photo included with the article is a composite of two different images. The original photo featured Jennifer Lawrence on the red carpet at the Oscars in 2013:", "The photo of Rob Zombie was taken at Wacken 2015 in Germany.", "On 1 March 2016, the author of the piece posted the following on his personal Facebook page, confirming that HeavierMetal.net is, indeed, a satire site:", "I'm baffled that Snopes put this up on their site hahaha. This isn't a rumor, it's satire -- along with every other story on this site. Still pretty cool though!", "Posted by Brian Storm on Tuesday, March 1, 2016", "This isn't the first time a \"Rob Zombie mistaken for homeless man\" type story has been mistaken for actual news. In October 2015, the page RockFeed.net published a similar piece, but in that version the rock star was supposedly arrested at his own music show.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]