["Former Gov. Charlie Crist continued his attacks on Gov. Rick Scott’s education funding record in a TV ad set at St. Petersburg High School, Crist’s alma mater.", "\"This isn’t just a doorway to a school. It was my doorway as a public school kid to opportunity. And I want to make sure every child has that same chance for a better life,\" Crist says in the ad. \"But Rick Scott's education cuts are closing that door on Florida's kids, spending almost $200 less per student than when I was governor and cutting Bright Futures scholarships in half.\"", "Here we will fact-check whether Scott cut Bright Futures scholarships in half.", "Bright Futures funding and scholarships", "Launched in 1997, Bright Futures is the higher education scholarship program funded by the Lottery and designed to keep high-achieving students at Florida schools.", "The program’s costs spiraled up from an initial price tag of $70 million in 1997 to $437 million in 2011. Those rising costs led the Legislature to rein in the program.", "In 2010, Crist’s last year as governor, the Legislature reduced Bright Futures scholarships by $1 dollar for every credit hour. The law also raised SAT/ACT requirements incrementally over a few years, which was expected to lead to a drop in the number of students who would qualify. For example, the Legislature raised the minimum SAT requirement for Florida Medallion Scholars -- one subset of Bright Futures -- from 970 in 2010-11 to 1050 in 2013-14.", "So that means that the Legislature and Crist reduced the number of eligible students in the future, after Scott took over as governor. When Scott took over, he and the Legislature continued on that same path -- but made it even harder for students to qualify.", "In 2011, Scott’s first year as governor, the Legislature decided to further raise test scores for 2013-14 graduates. For example, those Medallion Scholars would now have to score 1170 on their SAT by 2013-14.", "When Crist says that under Scott the scholarships were cut in \"half,\" it’s possible for viewers to mistakenly believe that refers to total dollars spent, or the amount of individual scholarships. Instead, what the ad is referring to is the number of scholarships distributed.", "The text on the screen shows that it refers to a May 2014 Sun-Sentinel editorial criticizing Bright Futures cuts, and this is what the Crist campaign pointed us to regarding the ad. As the requirements rose, not surprisingly the number of students who obtained the scholarship has dropped.", "Due to the tougher standards, \"the number of new Bright Futures scholarship students will be cut almost in half – from 41,107 last fall to 21,340 this fall,\" the editorial board wrote.", "That number for this fall is based on an estimate from the state regarding how many students will qualify. After schools verify that scholarship recipients enrolled in eligible courses, the schools submit for reimbursement to the state -- and that’s when we learn the actual number of scholarships that were used.", "Here are recent years’ numbers on Bright Futures. The spending picture is not settled for the current and future fiscal years, so we have included an estimate for 2013-14 and 2014-15.", "Budget Year", "Initial students disbursed", "Total number of students served", "Amount of money disbursed", "Average award per student", "2007-08", "50,499", "159,170", "$379.8 million", "$2,387", "2008-09", "52,497", "169,366", "$429 million", "$2,533", "2009-10", "53,520", "177,612", "$423.5 million", "$2,385", "2010-11", "53,800", "179,076", "$423.3 million", "$2,364", "2011-12", "51,751", "174,047", "$333.8 million", "$1,918", "2012-13", "44,846", "162,980", "$312.1 million", "$1,915", "2013-14 estimated", "41,107", "154,160", "$309.4 million", "$2,007", "2014-15 estimated", "21,340", "127,573", "$266.2 million", "$2,087", "Source: Florida Department of Education", "We think there are three main issues with the accuracy of the ad:", "• The ad could create the false impression that the amount of money per scholarship (or total money) was cut in half, when it’s actually referring to the number of scholarships.", "• The number of scholarships dropping by a half is based on the state’s estimate of how many will qualify this fall. But we don’t yet know the final number.", "• Though the ad points the finger at Scott, Crist also oversaw changes to Bright Futures that reduced the number of eligible students during Scott’s administration.", "Our ruling", "A Crist TV ad says Scott cut Bright Futures scholarships \"in half.\"", "Viewers could mistakenly think that Scott cut the dollar amount of scholarships in half -- but he didn’t. Instead, Crist’s campaign zeroed in on the number of scholarships that were distributed last year compared to an estimate for the upcoming school year.", "While the ad blames Scott, under Crist the Legislature also raised the standards to reduce the number of scholarships awarded. Scott and the Legislature later raised the standards again, which is projected to reduce the number more.", "The statement is partially accurate but leaves out important details. We rate it Half True.", "Former Gov. Charlie Crist campaign, \"Doorway\" TV ad, July 23, 2014", "Sun-Sentinel editorial, \"Bright Futures’ broken promise,\" May 12, 2014", "Florida Department of Education, Florida Bright Futures Scholarship Program, accessed March 20, 2014", "Florida Department of Education, Florida student scholarships and grant programs, 1997-2012", "Florida Office of Economic and Demographic Research, Bright Futures consensus estimate, March 5, 2014", "Florida College Access Network policy brief, \"College affordability adrift: Florida’s Bright Futures program faces $347 million in cuts by 2017-18,\" April 2014", "Miami Herald’s Naked Politics blog, \"Feds investigate Florida Bright Futures scholarships,\" March 24, 2014", "PolitiFact, \"Rick Scott presided over Bright Futures cut, Democratic PAC says,\" April 1, 2014", "Miami Herald, \"Change to Bright Futures scholarships hits poor, minorities,\" April 6, 2013", "Miami Herald, \"Feds investigate Florida’s Bright Futures scholarships,\" March 22, 2014", "PolitiFact, \"Scott says all 4-year state colleges offer $10,000 degrees,\" March 4, 2014", "PolitiFact, \"Rick Scott presided over Bright Futures cut, Democratic PAC says,\" April 1, 2014", "Interview, Cheryl Etters, spokeswoman Florida Department of Education, July 23, 2014", "Interview, Greg Blair, spokesman Gov. Rick Scott campaign, July 23, 2014", "Interview, Kevin Cate, spokesman former Gov. Charlie Crist campaign, July 23, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]