["“These vaccine trials have already started and deaths are already occurring as a result,” a woman says in the video viewed more than 20,000 times on YouTube since it was posted on April 10, 2020.", "Extracts have been shared thousands of times on Facebook, including here and here.", "The woman claims that two children died in Dubreka, a town in western Guinea, after being vaccinated by French doctors. She shows an extract from a TV news report that she uses to support the claim.", "\"Why are the governments allowing our children, our mothers, our babies to be vaccinated, to be used as experimental lab rats or guinea pigs?” she says.", "She refers to two leading French scientists who sparked controversy last month after discussing the idea of testing a vaccine for coronavirus in Africa on television.", "AFP Fact Check ran a reverse image search on the TV news report featured in the YouTube video and traced it to a news article (in French) from March 2019. “Guinea: a vaccination campaign goes wrong”, the headline reads.", "The news article features the TV report in full, with the logo \"Gangan News\" in the bottom-left corner. A Google search found references to Guinean TV channel Gangan RTV. We searched the broadcaster’s Facebook page and found the original report (in French) posted on March 18, 2019 -- months before the start of the novel coronavirus pandemic.", "According to the report, three teenage girls were taken to hospital after taking pills given out by health workers, stirring panic among locals who barricaded roads in protest.", "A man interviewed (35 seconds in) says that “all the children who took the pill fell ill and two of them died.” However, a local government representative (2 minutes in) says there were no deaths.", "\"There's been a lot of disinformation around this. People have been talking about deaths. To my knowledge, at this time, we haven't had a single death,\" Almamy Aly Camara, secretary-general of local communities in Dubreka, told the Gangan News reporter.", "AFP Fact Check ran a Google search for the words “children vaccine Dubréka” (in French) from March 2019 and found several news reports on the incident.", "According to local newspaper Le Journal de Conakry (in French), several children “fainted” and some “fell unconscious” after taking medicine distributed at a school. The article quoted the head of Guinea’s national healthcare security agency (ANSS), Sakoba Keita, who rejected “rumours” that children had been taken to hospital after taking the drug.", "“According to my sources, there have not been any cases of people being hospitalised after taking this drug”, he said. “There are a lot of rumours going round. Our staff are currently on the ground finding these cases of fainting. We want to find out where this propaganda is coming from.”", "He said the children had been given anti-parasite drugs as part of a national campaign “that’s been going on for more than 15 years in Guinea without any problems like this.”", "Several other news articles claim children “fainted”, “fell unconscious”, “vomited” or even “fell into a coma”, but none of them refer to children dying from the pill.", "AFP searched the Guinean health ministry’s website and found a press release from March 19, 2019, which confirms the children were given praziquantel, a drug to treat schistosomiasis, a parasite transmitted by freshwater snails in Africa, Asia and Latin America.", "The World Health Organization recommends praziquantel as a safe and effective treatment for schistosomiasis. Common side effects include nausea, vomiting, malaise, headache and dizziness.", "The health ministry said it had been distributing praziquantel in villages for more than 15 years.", "In a press conference (in French) on March 20, 2019, Guinea’s then-Health Minister Édouard Niankoye Lama recognised a “lack of information” about the correct way to take the drug, which he said should be taken after meals.", "The health ministry’s head of epidemiology, Timothée Guilavogui told Guinean TV that the children may have fallen ill after taking the drug on an empty stomach.", "“This is a well-known drug. We know the side effects. Perhaps some children hadn’t eaten anything on the morning they took it. It’s recommended to eat well before taking these pills,” he said.", "There is currently no specific treatment or cure for COVID-19. More than 100 candidate vaccines are being developed in various countries.", "AFP Fact Check previously debunked claims that children in Senegal died from a COVID-19 vaccine.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]