["About this rating", "Albert Watkins, Angeli's attorney, told Snopes that his client was willing to testify in Trump's impeachment trial related to the insurrection. Additionally, he told The Associated Press that Angeli was previously \"horrendously smitten\" by the president but currently felt betrayed by him.", "No substantial evidence proved that Angeli would testify against the president and try to help Senators who want to convict him.", "If Angeli testifies at the impeachment trial, the nature of his comments remained unknown at the time of this writing.", "Weeks after the U.S. Capitol insurrection, reports surfaced claiming that a highly visible member of the right-wing mob — the self-described \"QAnon digital soldier\" who was photographed shirtless, wearing horns and furs on his head — was abandoning former President Donald Trump as a demagogue.", "For example, a Jan. 29 Vice headline read: \"The 'QAnon Shaman' just Flipped On Trump.\"", "The assertion had some truth to it. In an interview with The Associated Press, the lawyer representing the man — Jacob Chansley or \"Jake Angeli\" of Arizona — said his client's attitude toward the president had changed since the deadly siege, and he was willing to testify in Trump's historic second impeachment.", "That trial by the U.S. Senate was set to begin the week of Feb. 8 and would either convict or acquit the former president of inciting his supporters to break into the Capitol on Jan. 6 to try to halt a ceremonial vote to affirm the outcome of the 2020 presidential election.", "The attorney, Albert Watkins, said he wants senators to hear the perspective of someone who was incited by Trump, according to the Jan. 30 story. The Associated Press continued:", "Watkins said his client was previously 'horrendously smitten' by Mr. Trump but now feels let down after Mr. Trump's refusal to grant Chansley and others who participated in the insurrection a pardon. 'He felt like he was betrayed by the president,' Watkins said.", "Here is a full list of the people Trump pardoned or commuted during his final hours in office.", "We reached out to Watkins to determine the legitimacy of the news story. In an email, we sent him a link to The Associated Press reporting, asked him if it was indeed accurate, and, if so, inquired why or under what circumstances his party decided to offer Angeli's testimony. He responded in an email message to Snopes:", "\"My client is available if called upon to testify. No statement to the contrary has been made.\"", "In other words, it was true to claim that Angeli — who was arrested and charged on Jan. 9 for insurrection-related crimes including civil disorder, obstruction of an official proceeding, and disorderly conduct — was willing to testify in Trump's Senate impeachment trial, which may determine whether Trump can run for political office in the future.", "However, the nature of Angeli's testimony, should he be asked to speak during the trial, remained unknown as of this writing.", "\"The words of Trump supporters who are accused of participating in the riot may end up being used against him in his impeachment trial,\" The Associated Press reported, though no evidence existed to determine whether Angeli would indeed share his experience to help senators convict the former president.", "In sum, while it was true that Angeli was willing to testify at Trump's second impeachment trial, it was not known whether he was preparing to make a statement that would help or hurt the efforts of senators who believe the former president is guilty of inciting the insurrection. For those reasons, we rate this claim a \"mixture\" of truthful, false, and undetermined information.", "Jessica Lee is Snopes' Senior Assignments Editor with expertise in investigative storytelling, media literacy advocacy and digital audience engagement.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]