["This meme has been shared more than 1,000 times since it was posted to Facebook on December 16, 2019.", "The caption of the Facebook post states: \"Until we change the people on both sides we won't see better outcomes, anyone else interested?\"", "The text superimposed at the top of the meme reads : “Why changes to Legislation is so difficult.\"", "The meme has included eight images taken inside the Australian House of Representatives chamber alongside captions that purport to describe the corresponding policy debates shown in the photo.", "The photos that claim to show debates on PTSD (post-traumatic stress disorder) in emergency services, mental health stigma, workers compensation, PFAS contamination, cancer legislation for firefighters and suicide figures in Australia feature sparse attendance.", "While in the two images captioned \"Debating MP's Pay\" and \"Debating MP's Allowances\", the chamber appears to be full.", "Below is a screenshot of the misleading post:", "Other Facebook posts featuring the meme can be found here and here.", "The claim is misleading; the photographs are miscaptioned. An independent body, not the MPs, sets pay and allowances for Australia's politicians.", "Using both Google and Yandex reverse image searches, AFP matched all of the photos in the misleading posts with their corresponding parliamentary sessions and compiled a list of accurate descriptions:", "Misleading caption: Debating PTSD in Emergency Services\nAccurate description: Voting on the Marriage Amendment Bill in the House of Representatives on December 7, 2017, which led to the legalisation of same-sex marriage in Australia.", "Below is a screenshot comparison of the image in the misleading post (L) and the photo from the Australian Associated Press (AAP) (R):", "Misleading caption: Debating Mental Health Stigma\nAccurate description: MPs Russell Broadbent and Bob Katter at the Marriage Amendment Bill vote on December 7, 2017.", "Below is a screenshot comparison of the image in the misleading post (L) and the photo from ABC Australia (R):", "Misleading caption: Debating Workers Compensation\nAccurate description: Former Australian Prime Minister Malcolm Turnbull introducing a bill on September 14, 2016, which paved the way for a plebiscite on same-sex marriage in Australia.", "Below is a screenshot comparison of the image in the misleading post (L) and the photo from AAP (R):", "Misleading caption: Debating PFAS Contamination\nAccurate description: A file photo of the House of Representatives from Wikimedia Commons, an online repository of free-use images and other media.", "Notably, the Mace, which is the symbol of the authority of the House of Representatives and the Speaker of the House of Representatives, is not present in the photo. It sits on the central table when the House of Representatives is officially meeting and the Speaker or a deputy is present.", "Below is a screenshot comparison of the image in the misleading post (L) and the photo uploaded to Wikimedia Commons (R):", "Misleading caption: Debating Cancer Legislation for Firefighters\nAccurate description: An image from a parliamentary vote that made headlines on May 30, 2012, after the then leader of the Liberal Party Tony Abbott attempted to leave the chamber, the Sydney Morning Herald reported here on the same day.", "Below is a screenshot comparison of the image in the misleading post (L) and a still captured at the 9:06:18 mark of this May 30, 2012, recording from parliament (R):", "Misleading caption: Debating Suicide Figures in Australia\nAccurate description: An image from parliamentary proceedings on February 12, 2014. The session was in the news after a Liberal MP accidentally voted with the opposition, the Sydney Morning Herald reported here on February 13, 2014.", "Below is a screenshot comparison of the image in the misleading post (L) and a still captured at the 18:14:30 mark of ​this February 12, 2014, recording from parliament (R):", "Misleading caption: Debating MP’s Pay\nAccurate description: Members of the House of Representatives stand during the opening of the 44th Parliament in Canberra on November 12, 2013, according to the caption of this AFP photo.", "Below is a screenshot comparison of the image in the misleading post (L) and the AFP photo (R):", "Misleading caption: Debating MP’s Allowances\nAccurate description: The photo appears here on the Parliamentary Education Office(PEO)'s website. A PEO spokesperson told AFP via email the photo was taken on November 22, 2016, following a vote at approximately 3 pm.", "Below is a screenshot comparison of the image in the misleading post (L) and the photo from parliament (R):", "In addition, as noted in this AFP Fact Check report, an independent body called the Remuneration Tribunal, but not the politicians themselves, is responsible for setting the pay and allowances for federal parliamentarians in Australia.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]