["About this rating", "Although it sounds suspiciously like a movie plot and outlandish enough for some readers to ask if the story is true, a Los Angeles County man has been charged with illegally importing king cobras concealed in potato chip cans, according to federal prosecutors.", "Rodrigo Franco, 34, was charged with importing three of the venomous reptiles along with three albino Chinese soft-shelled turtles and arrested on 25 July 2017. The snakes were each about two feet long and were seized by federal agents before they were delivered to Franco's apartment in Monterey Park, a city in east Los Angeles County.", "According to charging documents provided by the U.S. Attorney's Office, United States Customs and Border Protection agents discovered the snakes during an inspection on 2 March 2017. The snakes were seized by wildlife officials and have been turned over to the San Diego Zoo for care — but one has since died, said Thom Mrozek, spokesman for the U.S. Attorney's Office, Central District of California.", "The package containing the turtles was delivered to Franco's residence, where federal agents executed a search warrant and found the package. In the apartment, investigators also found a live baby crocodile, three alligator snapping turtles and five diamond backed terrapins. All creatures are protected under international laws banning trade of endangered species. Investigators also found a non-protected musk turtles and several species of fresh water fish.", "According to federal prosecutors, Franco mailed six protected turtles — desert box turtles, three-toed box turtles and ornate box turtles from the U.S. to Hong Kong on the same day the package was received. The shipment to Asia was intercepted by U.S. wildlife officials.", "Investigators also recovered Franco's iPhone and messages sent via the app WhatsApp in with which he allegedly communicated with a person named \"Ji Anji\" in Hong Kong, establishing a relationship in which they would send reptiles to each other in exchange for money and more reptiles. Franco told investigators he had received previous shipments totally 20 king cobras from Hong Kong but that they had died, according to court documents. He allegedly used the name \"Carlos Sandoval\" for those transactions.", "Snakes are a common theme in urban legends, whether they are the subject of stories detailing oversized beasts, monsters falling from the sky on innocent family barbecues, or deadly reptiles lying in wait. Sometimes, like in this case, weird stories involving snakes are true — as evidenced by live snakes housed at the San Diego Zoo confiscated by authorities, and criminal charges leveled against a resident living in Los Angeles County.", "If convicted, Franco could face up to 20 years in federal prison.", "Chappell, Bill.   \"King Cobras In A Can: Deadly Snakes Arrive In U.S., Shipped As Potato Chips.\"\r\n     NPR.   26 July 2017.", "Gutierrez-Jaime, Nisha.   \"Monterey Park Man Arrested After Allegedly Smuggling King Cobras in Potato Chip Canisters From Hong Kong.\"\r\n     KTLA.   25 July 2017.", "Alvarado, Monsy.   \"King Cobras, lizards Seized in Express Mail Package at JFK Airport.\"\r\n     The Record.   12 July 2017.", "Dinham, Paddy.   \"There's a Snake in My Boots! Terrifying Moment a Huge King COBRA Is Found Slithering Inside a House Near the Terrified Resident's Shoe Boxes.\"\r\n    Mail Online.   21 June 2017.", "DiPentima, Ryan.   \"VIDEO: King Cobra Drinks From Man’s Water Bottle.\"\r\n     Palm Beach Post.   30 March 2017.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]