["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Democratic presidential candidates former Vice President Joe Biden, left, and Sen. Bernie Sanders, I-Vt., speak during a Democratic presidential primary debate Thursday, Dec. 19, 2019, in Los Angeles. (AP)", "Sen. Bernie Sanders argues that former Vice President Joe Biden sided with a Republican effort to cut Social Security.", "\"In 2018, Biden lauded Paul Ryan for proposing cuts to Social Security and Medicare,\" wrote the Sanders campaign in a Jan. 7 newsletter. The night before on CNN, Sanders had attacked Biden’s record on Social Security and Medicare.", "Ryan is a former Republican House speaker who proposed sweeping changes to Social Security that were never enacted.", "We found that the Sanders campaign newsletter distorts what Biden said about Ryan’s plan.", "The Sanders campaign pointed to a speech Biden gave to the Brookings Institution in April 2018. Biden’s overall message was that \"folks in the middle class are in trouble\" and that the tax code \"is widely skewed toward taking care of those at the very top.\"", "Biden argued that tax cuts were creating more debt, putting middle class programs at risk.", "The Sanders campaign plucked out what Biden said about Ryan, but ignored the complete passage which showed that Biden wanted Social Security and Medicare protected, and to accomplish that goal would require making changes to the tax code. The thrust of his point about the tax code was that he was saying it does too much to help the uber rich.", "This is what Biden said about Ryan:", "\"Paul Ryan was correct when he did the tax code. What’s the first thing he decided we had to go after?\" Biden said, with a slight smirk. Biden then leaned into the microphone and said in a deep menacing voice: \"Social Security and Medicare.\"", "Biden continued: \"Now, we need to do something about Social Security and Medicare.\" He then sarcastically whispered: \"That’s the only way you can find room to pay for it.\"", "The Biden campaign said that he was mocking Ryan.", "To understand Biden’s tone, you have to actually watch and listen to his words. The snippet of written text, which the Sanders’ campaign newsletter used, doesn’t relay Biden’s full point.", "The Sanders campaign omits what Biden said next (our emphasis is in bold):", "\"Now, I don’t know a whole lot of people in the top one-tenth of 1 percent or the top 1 percent who are relying on Social Security when they retire. I don’t know a lot of them. Maybe you guys do. So we need a pro-growth, progressive tax code that treats workers as job creators, as well, not just investors; that gets rid of unprotective loopholes like stepped-up basis; and it raises enough revenue to make sure that the Social Security and Medicare can stay, it still needs adjustments, but can stay; and pay for the things we all acknowledge will grow the country.\"", "We sent Biden’s speech to Marc Goldwein, senior vice president for the Committee for a Responsible Federal Budget.", "\"The 2018 speech is very clearly Biden saying the opposite of what the Sanders campaign is claiming. He’s saying that Paul Ryan is going to cut taxes so that he can complain about the deficit and demand a need to cut Social Security.\"", "Biden was previously critical of Social Security and Medicare proposals by Republican presidential nominee Mitt Romney and Ryan, his running mate in 2012.", "RELATED FACT-CHECK: Biden said Romney and Ryan support \"massive cuts in Social Security for future generations\"", "During the 2020 campaign, Biden promised to \"prevent cuts to American retirees.\"", "The reality is that if nothing changes, the $1 trillion-a-year Social Security program is on track to run out of reserves by about 2035.", "RELATED STORY: Social Security: A critical program with an uncertain future", "A Sanders campaign newsletter said, \"In 2018, Biden lauded Paul Ryan for proposing cuts to Social Security and Medicare.\"", "That stems from a speech Biden gave in 2018 in which he spoke about Ryan. Biden appeared to be mocking Ryan, not praising him.", "The Sanders campaign omitted what Biden said next: the importance of protecting Social Security and Medicare and to change the tax code, which he said benefitted the mega rich. Overall, the point of Biden’s speech was to criticize tax cuts for the rich and call for more help to the middle class.", "The Sanders campaign plucked out part of what Biden said but omitted the full context of his comments.", "We rate this statement False.", "BernNotice, Bernie slams Biden for trying to cut Social Security, Jan. 7, 2020", "Joe Biden, Transcript of speech at Brookings Institution, April 18, 2018", "C-SPAN, Joe Biden speech at Brookings Institution, April 18, 2018", "Sen. Bernie Sanders, Tweet of his CNN interview, Jan. 6, 2020", "David Sirota, Tweet, Jan. 2, 2020", "Joe Biden, Campaign website, 2020", "Newsweek, Bernie Sanders says Biden’s record means he cannot defeat Trump: you think that’s gonna play well in Michigan or Wisconsin? Jan. 7, 2020", "Washington Post, Ryan says Republicans to target welfare, Medicare, Medicaid spending in 2018, Dec. 6, 2017", "The Banter, David Sirota And The Bernie Left Are Now Smearing Joe Biden Over Social Security Cuts, Jan. 2, 2020", "The Week, Joe Biden doesn't get it, Jan. 7, 2019", "Meet the Press, Transcript, April 29, 2007", "ABC News, Biden Proposed Social Security Freeze in 1984, Oct. 11, 2012", "Congressional Record, Jan. 31, 1995", "Huffington Post, Joe Biden’s Biggest 2020 Problem Is Joe Biden, March 5, 2019", "Politico, GOP: Enact chained CPI now, April 10, 2013", "PolitiFact, Biden says Romney and Ryan support \"massive cuts in Social Security for future generations,\" Sept. 5, 2012", "PolitiFact, Radio ad from Barack Obama says Paul Ryan \"tried to change the whole game\" on Social Security, Aug. 28, 2012", "PolitiFact, Joe Biden says Mitt Romney, Paul Ryan would 'eliminate the guarantee of Medicare,' Oct. 11, 2012", "PolitiFact, Social Security: A critical program with an uncertain future, Dec. 26, 2019", "Email interview, Marc Goldwein, Committee for a Responsible Federal Budget senior vice president, Jan. 8 2020", "Email interview, Mike Gwin, Joe Biden campaign spokesman, Jan. 8, 2020", "Email interview,  Mike Casca, Bernie Sanders campaign spokesman, Jan. 9, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]