["About this rating", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "Controversial and outright false claims made by Chinese Virologist Dr. Li-Meng-Yan, a former post-doctoral student at Hong Kong University, reignited viral internet rumors surrounding the origins of SARS-CoV-2, the coronavirus responsible for COVID-19 and the 2020 pandemic.", "Yan appeared as a featured guest on the Sept. 15, 2020, episode of Fox News talk show \"Tucker Carlson Tonight,\" during which she claimed that she had evidence to suggest that the virus was intentionally manufactured and released by the Chinese Communist Party.", "\"I can present solid scientific evidence to our audience that this virus, SARS-CoV-2 virus, is actually not from nature,\" she told the television host. \"It is a man-made virus created in the lab based on the China … the very unique bat coronavirus, which cannot affect people, but after the modification becomes a very harmful virus.\"", "Yan did claim that SARS-CoV-2 was made in a lab, but the suggestion is false, misleading, and based on a non-peer-reviewed report that was published in two separate studies on Sept. 14 and Oct. 8 in the preprint server Zenodo, which means that the research had not gone through rigorous editorial critically evaluated by scientific experts with an extra degree of scrutiny. Research that has not been peer-reviewed is akin to a blog — anyone can publish one online with little expertise. A reviewed study, on the other hand, is on par with a well-vetted, expertly researched textbook. To facilitate the quick spread of new scientific information in the midst of the pandemic, prepublication research has become more common in order to facilitate the quick dissemination of important information, particularly as peer-reviewed research can take a long time to publish.", "Despite its erroneous claims, the study had been downloaded more than half of a million times and received more than 700,000 views as of this writing.", "Since SARS-CoV-2 was first discovered in January 2020 and subsequently declared a pandemic the following month, conspiracy theorists have peddled notions that the virus was made in a lab and intentionally released as a biological weapon despite rigorous scientific research proving otherwise. According to one expert:", "\"This particular conspiracy around deliberate release form a laboratory has been doing the rounds throughout the pandemic. It has been rebutted several times already. Ultimately, it could be damaging to public health if reported uncritically without looking at the wider evidence. If people are exposed to and then believe conspiracy theories, this will likely have a negative impact on efforts to keep COVID-19 cases low and thus there will be more death and illness than there needs to be,” said Dr. Michael Head, senior research fellow in global health at the University of Southampton, in a statement.", "And Yan’s account of the origins of the virus is no different. The controversial doctor first made headlines in July 2020 when she told Fox News in an exclusive interview that she believed the Chinese government failed to tell the world about the virus' origins at its onset, ignoring her research and potentially putting lives at risk. At the time, Hong Kong University (HKU) issued a news release confirming that Yan had previously been affiliated as a post-doctoral fellow but that she had since left the institution. The news release continued:", "While HKU respects freedom of expression, Dr Yan’s past or present opinions and views do not represent those of the University.", "HKU notes that the content of the said news report does not accord with the key facts as we understand them. Specifically, Dr Yan never conducted any research on human-to-human transmission of the novel coronavirus at HKU during December 2019 and January 2020, her central assertion of the said interview.", "We further observe that what she might have emphasized in the reported interview has no scientific basis but resembles hearsay.", "HKU does not act on hearsay and we will not further comment on this matter.", "Snopes contacted HKU for further comment but did not receive a response at the time of publication. Emails sent from our team to the address listed on Yan’s report also went unanswered.", "In a September 2020 interview with the hosts of the British talk show \"Loose Women,\" Yan claimed that she had been chosen to do a “secret investigation” while studying a cluster of SARS-related viruses in December 2019 when she found out that the Chinese government was manufacturing a virus to use as a bioweapon. After confronting her supervisor, she claimed, she was allegedly forced to flee to the U.S. for her own safety. The story was reiterated in an interview with Tucker Carlson the following day when she directly blamed the Chinese Communist Party for manufacturing the virus.", "In less than a week after airing, the interview had been viewed more than 2.2 million times.", "Several media publications reported that Yan’s Twitter account was suspended as of Sept. 21, 2020. The first known mention of the suspension was on Tucker Carlson Tonight, however, Twitter declined to comment on the alleged suspension in an email sent to Snopes, and the platform did not flag the virologist’s interview. A video of the interview is also still available on Facebook and Instagram, however, both platforms flagged the video for its misleading content.", "The report was primarily authored by Yan and three other researchers who listed an affiliation with the Rule of Law Society on the cover page. The society is a political organization — not a research institution — that was founded by exiled Chinese billionaire Guo Wengui, who fled China in 2014 in advance of corruption charges, and Steve Bannon, an American businessman and political strategist who previously oversaw the far-right publication Breitbart News, and was recently arrested in connection to the “We Build The Wall” fraud scam.", "Dr. Andrew Preston, a biologist at the University of Bath, highlighted in a statement that the authors’ affiliation with a politically based organization rather than with a research institution was a conflict of interest and added that the “preprint report cannot be given any credibility in its current form,” given its unsubstantiated claims that have not been peer-reviewed.", "“The report is not based on an objective interpretation of the SARS-CoV2 genome. The interpretations made are not supported by data, are unsubstantiated and the interpretations are largely stated but not explained,” Preston said. The scientists continued that the report does not appear to start with an open hypothesis about the origin of SARS-CoV2. The language of the report is reminiscent of a conspiracy theory.”", "Yan’s primary argument is that the genetic structure of SARS-CoV-2 provided evidence that the virus was manufactured by researchers with the Chinese Communist Party by targeting select parts of the viral genome, a feat that would be nearly impossible, said Craig Wilen, assistant professor of laboratory medicine and immunology at the Yale School of Medicine, in an interview with Snopes. But first, it’s important to understand how a virus is sequenced and what researchers know about SARS-CoV-2.", "When a new virus is discovered, scientists around the world will work as quickly as possible to create a genetic map by sequencing every genome held within the virus. At the onset of the 2020 pandemic, researchers quickly transcribed the genetic makeup of the virus and uploaded what was known about the 30,000 base-pair genomes into a global database for future study. When mapped, the virus was found to contain roughly 30,000 nucleotides, which form the basis of each structural unit of DNA.", "Once a map of the base pair is determined, synthesizing a virus in a lab is not unheard of. In fact, many commercial companies hold repositories of \"chunks\" of genomic material, but in order to manufacture a virus such as SARS-CoV-2, a scientist would need to take the 30,000 base-pair genome, make that into ribonucleic acid (RNA), and then turn that RNA into a virus. Wilen said that expert virology labs could, in theory, manipulate SARS-CoV, the virus responsible for the 2002 SARS pandemic, or MERS-CoV, the virus that caused the 2014 MERS pandemic, to hypothetically manufacture a new virus, but would first need to know what each of those individual nucleotides is responsible for, and how to manipulate them to become harmful and infectious to humans — an enormous feat that is beyond the scope of many viral labs and research.", "“Being off by one could destroy the entire virus. As much as the world has studied this virus now, we have no idea what properties those 30,000 base pairs, which of those are important for infection, which of those make it spread asymptomatically, which of those cause disease,” Wilen said. “So, we are totally ignorant in terms of the biology in terms of being able to come up with the sequence de novo to then make it.”", "Wilen likened the manufacturing of a virus to taking one of Shakespeare’s sonnets, determining how many words it contains, then chopping up a dictionary and subsequently trying to build a sonnet from those chopped-up words.", "“Yes, you would get something that is the right length of a sonnet, but almost certainly it’s going to be incoherent and not useful,” he said.", "In her report, Yan argued that two strains of bat coronavirus were shown to be 89% similar to SARS-CoV-2, which seems at first glance to be quite a bit. Coronaviruses are a large family of closely related viruses that naturally circulate in a number of different species, including bats, camels, pangolins, and rodents. A huge amount of genetic diversity of coronaviruses occurs naturally in the environment, and when it comes to human pandemic coronaviruses, all three have exhibited cross-species transmission from a nonhuman host.", "In actuality, 89% of genetic similarity is very low. Previous research found that the human genome is almost 99% identical to chimpanzees and bonobos, yet there are very obvious differences between the two species. In terms of Yan’s genetic mapping, 89% would suggest that there are roughly 3,300 nucleotides not shared between the two viruses and, if SARS-CoV-2 was manufactured in a lab, researchers would have had to pinpoint the cause and effect of each of those nucleotides in order to make it both infectious and harmful to humans.", "Yan further argued that SARS-CoV-2 is like “Frankenstein,” if the beast were a cow with a ”deer’s head, rabbit ears, and also has monkey’s hands,” which in her logic, suggested that the virus cannot be natural. Wilen said that although this comparison was hyperbolic, it’s not necessarily incorrect — viruses undergo several evolutionary changes throughout their short life cycle, but that doesn’t mean that they were manufactured in a lab. Coronaviruses’ ability to evolve from animal to human transmission is due, in part, to its unique life cycle. Viruses tend to have a 12-hour life cycle while humans, on the other hand, have an average life expectancy of 79 years. Because of this quick lifespan, viruses undergo rapid evolutionary changes in an incredibly short amount of time.", "Coronaviruses can mutate in two ways, the first of which occurs during replication. Viruses are capable of replicating once they have infected a host, and it is through that replication process that an error can sometimes occur, and one of the tens-of-thousands of nucleotides may mutate. This mutation can change the function of a particular protein, and though such errors are often harmless or have no physical consequence to the virus, sometimes a mutation can result in the virus being unable to replicate or lose its infectiousness.", "The other way coronaviruses can mutate is through a process known as genetic recombination. This occurs when viruses of two different, but closely related, strains simultaneously infect the same host cell and interact while they are replicating to create a viral progeny (new virus) from two “parent viruses” that contains genes from both. Recombination is seen in other viruses and happens often. A study published in the April 2020 issue of the scientific journal Infection, Genetics and Evolution found that the SARS-CoV-2 genome can be more than 95% similar to another coronavirus (RaTG3) that was isolated from bats, while a study published in Nature in March found that pangolin coronavirus genomes were between 85.5% and 92.4% similar. Ironically, the similarities between multiple coronavirus samples taken from the wild and SARS-CoV-2 actually argue in favor of natural evolution by way of recombination.", "“In the wild, these viruses are circulated all over the place. Animals are getting infected with multiple coronaviruses that are genetically similar, and that facilitates this recombination happening in the wild. It’s easy to make it happen in the lab, but it absolutely happens in the wild. This is a good way to make big, functional changes in viruses,” Wilen said.", "Rawnsley, Adam and Lachlan Markay.   \"Steve Bannon is Behind Bogus Study That China Created COVID.\"\r\n    Daily Beast.   16 Sept. 2020.", "\"Research Shows COVID-19 Was Not Manufactured in a Lab.\"\r\n    The Associated Press.   16 Sept. 2020.", "Alonzo, Isaiah.   \"Chinese Whistleblower Li-Meng Yan Gets Twitter Ban After Publishing ‘Man-Made COVID-19’ Report – Finds Support from US Army Doctor.\"\r\n    Tech Times.   15 Sept. 2020", "Hilgers, Lauren.   \"The Mystery of the Exiled Billionaire Whistle-Blower.\"\r\n    The New York Times Magazine.   10 Jan. 2018", "T. Nhx.   \"Fact Check: COVID-19 Whilseblower Li-Meng Yan Releases Paper with Other Scientist ‘Suggesting Sophisticated Laboratory Modification.’\"\r\n    Tech Times.   16 Sept. 2020", "Lam Tsan-Yuk, Tommy, et al.   \"Identifying SARS-CoV-2-Related Coronaviruses in Malayan Pangolins.\"\r\n    Nature.   26 March 2020", "Paraskevis, D. et al.   \"Full-Genome Evolutionary Analysis of the Novel Coronavirus (2019-nCoV) Rejects the Hypothesis of Emergence as a Result of a Recent Recombination Event.\"\r\n    Infection, Genetics and Evolution.   April 2020.", "Prufer, Kay, et al.   \"The Bonobo Genome Compared with the Chimpanzees and Human Genomes.\"\r\n    Nature.   13 June 2012.", "\"New Genome Comparison Finds Chimps, Humans Very Similar at the DNA Level.\"\r\n    NIH News.   31 Aug. 2005.", "Crump, James.   \"Chinese Virologist Who Claimed Coronavirus Was Created in a Lab and Fled to US Has Been Suspended by Twitter.\"\r\n    Independent.   16 Sept. 2020.", "Chakraborty, Barnini and Alex Diaz.   \"Exclusive: Chinese Virologist Accuses Beijing of Coronavirus Cover-up, Flees Hong Kong: ‘I Know How They Treat Whistleblowers.’\"\r\n    Fox News.   10 July 2020.", "Anderson, Kristian G. et al.   \"The Proximinal Origin of SARS-CoV-2.\"\r\n    Nature Medicine.   17 March 2020.", "Update [Oct. 30, 2020]: This article was updated to include a link to a second non-peer-reviewed report that was published by Yan in the preprint server Zenodo.", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]