["About this rating", "In mid-2020, U.S. news analysts were grappling with covering the COVID-19 coronavirus pandemic, widespread protests over the police-custody death of George Floyd, an upcoming presidential election, and the interrelated political and economic turmoil attendant with all of these events.", "One of the more controversial attempts by a news outlet to interrelate some of these phenomena was reflected in a purported screen shot of Fox News Channel graphic that supposedly charted stock market performance following events involving the beating and killing of black men:", "This chart -- which tracked gains made by the S&P 500 index after the assassination of Martin Luther King, Jr. in 1968; the acquittal of Los Angeles police officers in the beating of Rodney King in 1991; the police shooting of 18-year-old Michael Brown in Ferguson, Missouri, in 2014; and the death of George Floyd while in Minneapolis police custody in May 2020 -- was indeed displayed during Fox News' \"Special Report with Bret Baier\" on June 5, 2020, as part of a segment featuring Fox Business reporter Susan Li.", "As reported by the Associated Press, the backlash to Fox News Channel's use of the chart prompted an apology from that network:", "The graphic that aired to illustrate market reactions to historic periods of civil unrest “should have never aired on television without full context. We apologize for the insensitivity of the image and take this issue seriously,” the cable channel said in a statement.", "[The following day], on Fox’s “America’s News HQ” telecast, anchor and senior correspondent Eric Shawn said the graphic should not have been used.", "“Last night, Fox News Channel aired an infographic attempting to show the stock market on occasion gained ground in the midst of turmoil, civil unrest and even tragedy,” Shawn said. “In trying to make that point, the program ‘Special Report’ failed to explain the context of the times we are living in and should not have used that graphic.”", "Fox's \"inane and insensitive graphic\" prompted condemnations from political figures on social media, including the following tweets from former Republican National Committee chair Michael Steele and Rep. Bobby L. Rush of Illinois:", "Associated Press.   \"Fox News: Black Deaths, Stock Market Graphic Was Insensitive.\"\r\n    6 June 2020.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]