["“Fb is banning Trump from advertising for president so let’s do it for him!!!! TRUMP 2020 !!” claims an August 9, 2020 post shared 385,000 times.", "More examples of the post are available on Facebook here, here and here. Social media analysis tool CrowdTangle showed shares of the posts peaked on the opening day of the Republican National Convention.", "The Facebook ad library, available here, shows more than 5,000 results for “Issues, Election or Politics” ads from “Donald J. Trump.”", "Facebook’s database indicates that the Trump Make America Great Again Committee and Donald J. Trump for President, Inc. have spent more than $68 million on election ads, with more than $4 million spent in the week ending August 25.", "A Facebook spokeswoman confirmed: “We are not banning the President.”", "Social media giants have faced attacks for allegedly using their dominance to stifle conservative views -- a claim made by President Donald Trump.", "Facebook has also been accused of failing to curb hateful content promoting violence, including posts from Trump.", "Content from politicians is exempt from Facebook’s third-party fact-checking program, of which AFP Fact Check is part.", "AFP Fact Check has debunked other false claims about Facebook banning content here and here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]