["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "President Barack Obama spoke with employees Calvin Anderson (blue hat) and Ted Korber at a GE gas engines plant in Waukesha, Wis., on Jan. 30, 2014.", "After giving his fifth State of the Union address, President Barack Obama hit the road. One of his first stops was a GE gas engines plant in Waukesha, a city about 20 miles west of Milwaukee.", "In both the House chamber and on the factory floor, the president insisted that over the past four years, corporate profits and stock prices soared while wages fluttered.", "In the State of the Union, Obama claimed that \"average wages have barely budged.\" PolitiFact National rated his statement True, finding the average had risen no more than 1.7 percent above inflation from 2008 to 2012.", "In Waukesha on Jan. 30, 2014, the president alluded to a slightly different statistic and was more bold.", "He said:", "\"Because the truth is -- and you know this in your own lives, and you see it in your neighborhoods among your friends and family -- even though the economy has been growing for four years, even though corporate profits have been doing very well, stock prices have soared, most folks' wages haven't gone up in over a decade.\"", "We wondered: Even taking inflation into account, is it true the majority of Americans haven’t seen their wages increase in more than 10 years?", "Obama’s evidence", "Income inequality was a big topic in the weeks leading up to the State of the Union. So, one thing to make clear upfront is that in his Wisconsin remarks, the president singled out wages -- the paycheck you get from your job. That’s a narrower category than income, which can include money taken in from other sources such as investments or government benefits.", "When we asked for evidence to back the president’s wages claim, a White House spokesman cited a database from the U.S. Bureau of Labor Statistics. It shows the median weekly earnings for full-time workers in the final quarter of each year from 1999 through 2013.", "The median wage means half of workers earned more than that amount and half earned less.", "From the database, we assembled the following table. The wage figures are adjusted for inflation.", "Year", "Weekly wages, 4th quarter of each year", "1999", "$335", "2000", "334", "2001", "340", "2002", "336", "2003", "337", "2004", "337", "2005", "332", "2006", "337", "2007", "332", "2008", "340", "2009", "344", "2010", "341", "2011", "335", "2012", "334", "2013", "334", "So, the inflation-adjusted median wage during the final quarter of 2013 was $334 --  $1 lower than during the final quarter of 1999, more than a decade earlier.", "However, the table also shows that the median wage went up in some years and down in others during the period cited by the president. It was as high as $344 and as low as $332.", "Outside experts", "We put Obama’s claim and the database to four experts: economist Aparna Mathur of the conservative American Enterprise Institute; economist Eugene Steuerle of the Urban Institute, who served as a deputy assistant Treasury secretary under President Ronald Reagan; Michael Tanner, senior fellow of the libertarian Cato Institute; and Wisconsin Taxpayers Alliance research director Dale Knapp.", "They agreed that it’s not possible to track the wages of actual individuals over a period of more than a decade, and so it can’t be known whether most of them had a higher wage in 2013 than in 2009.", "But the experts also agreed the median wage figure cited by The White House is the best available.", "As Steuerle told us: \"Looking at the median tells us what is happening across the economy, but not what is happening to each individual worker over time.\"", "Two other points, neither of which bears directly on the accuracy of Obama’s wage claim:", "Mathur said the broader measure of income gives a better picture of the standard of living of low- and moderate-income people, since it includes assistance such as the earned income tax credit, food stamps and Medicaid.", "And Tanner said total compensation, including things such as health and retirement benefits, has risen in recent years even if wages haven’t.", "Our rating", "Obama said: \"Most folks’ wages haven’t gone up in over a decade.\"", "It’s not possible to know, considering all Americans, whether most of them saw a wage increase in the period cited by the president. But he cites the best-available figure, which shows the  median weekly wage, adjusted for inflation, was $1 less at the end of 2013 than it was in 1999.", "We rate the president’s statement Mostly True.", "Follow us on Twitter and Facebook.", "Milwaukee Journal Sentinel, transcript of President Barack Obama’s remarks, Jan. 30, 2014", "PolitiFact National, \"In State of the Union, Obama says average wages have 'barely budged' over past 4 years,\" Jan. 28, 2014", "Email interview, White House regional communications director Keith Maley, Jan. 31, 2014", "U.S. Bureau of Labor Statistics, database of median weekly earnings of wage and salary workers", "Interview, American Enterprise Institute economist Aparna Mathur, Feb. 18, 2014", "Interview, Urban Institute economist Eugene Steuerle, Feb. 18, 2014", "Email interview, Cato Institute senior fellow Michael Tanner, Feb. 19, 2014", "Email interview, Wisconsin Taxpayers Alliance research director Dale Knapp, Feb. 18, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]