["About this rating", "On 23 May 2018, the Your News Wire web site published an article reporting that the head offices of the CNN news network (along with those of MSNBC and the Associated Press) had been raided by the FCC on that grounds that those news outlets were \"violating press guidelines\":", "The CNN head office in Atlanta, Georgia, was raided by Federal Communications Commission (FCC) agents Tuesday in an operation related to the “violation of press guidelines” including “publishing and promotion of blatantly false information designed to deceive the American public,” according to reports.", "The FCC arrived unannounced and seized documents and hard drives as part of their investigation, including all of the “source data” the network has used for their stories.", "MSNBC and the Associated Press are also reported to have been raided by the FCC for violating press guidelines, including the “printing of blatant lies“, the “publishing and promotion of stories which require immediate retractions while not promoting the retractions“, according to a source within one of networks.", "None of this was true. Not only did such raids not take place, but the Federal Communications Commission (FCC) has no standing to carry out any such activity. The FCC's regulatory authority concerning journalism extends only to \"over-the-air broadcasters who transmit their programs via the publicly owned spectrum,\" not to cable television, satellite television, printed material, or the Internet. Thus the FCC has no power to enforce any supposed \"press guidelines\" against cable and satellite news networks such as CNN and MSNBC (or a news agency such as the Associated Press).", "Moreover, the FCC's ability to enforce broadcast journalism standards regarding falsification of news is generally limited to imposing monetary fines or revoking/denying licenses to radio and television stations, not to conducting law enforcement-style raids of news organizations' headquarters and seizing their equipment and source material. (Such an activity would certainly be condemned as infringing on the First Amendment rights of the press.)", "The falsity of this report is part and parcel for Your News Wire, which is a clickbait-driven fake news site.", "Dmitry, Baxter.   \"CNN Raided by FCC for Deceiving American Public.\"\r\n    Your News Wire.   23 May 2018.", "Federal Communications Commission.   \"Complaints About Broadcast Journalism.\"\r\n    Accessed 23 May 2018.", "Koerner, Brendan.   \"Can the FCC Regulate HBO?\"\r\n    Slate.   12 February 2004.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]