["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A Facebook post claims to offer a cost comparison on different matters of national interest: the special counsel’s investigation into Russian meddling in the 2016 presidential election, the Benghazi probe, President Donald Trump’s golf outings, and the fiscal impact of the Republican tax law.", "The clear goal of the meme, based on the items and costs associated, is to discredit Republicans and Trump. Here’s the cost breakdown, according to the meme posted on Facebook Dec. 9:", "\"Cost of Mueller’s investigation: $3,200,000", "Benghazi ‘investigation’: $7,000,000", "Trump’s golfing trips: $83,000,000", "New debt from Republican tax bill: $1,500,000,000,000\"", "The meme adds: \"Dear Republicans, please spare us your selective outrage about the cost of the Trump-Russia investigation.\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The meme includes accurate information, but leaves out critical facts and details.", "Special Counsel Robert Mueller is investigating Russia’s interference in the 2016 elections and whether Trump’s campaign supported those efforts. Trump has repeatedly denied any collusion with Russia.", "It’s unclear when the meme began circulating, but it was shared on Facebook as recently as Dec. 9, 2018.", "The investigation’s first spending report came in December 2017 and showed that from May 2017 through the end of September 2017, Mueller’s office incurred $3.2 million in direct spending, and $3.5 million in indirect spending, totaling $6.7 million.", "If the meme relied only on that report, then it omitted from its tally indirect spending costs. Also, the spending didn’t stop there.", "Mueller’s office released additional spending reports in May 2018 and again in December 2018.", "The latest information released Dec. 14 shows that since the investigation started in May 2017 through Sept. 30, 2018, direct spending reached $12.3 million and indirect spending $12.9 million, totaling $25.2 million.", "That’s notably higher than the $3.2 million claimed by the meme.", "Lawmakers in May 2014 began investigating the 2012 terrorist attack on a U.S. diplomatic compound in Benghazi, Libya, that left four Americans dead.", "Led mostly by Republicans, critics saw the congressional investigations as a political move against Hillary Clinton, who served as secretary of state when the attack happened. The investigations concluded in 2016, costing about $7 million. The investigations did not suggest that Clinton was personally responsible for or could have prevented the attack.", "This claim in the meme is more in line with the facts than the claim about the Mueller probe.", "Trump routinely criticized his predecessor, Barack Obama, for the time he spent golfing. Trump as president has been a regular on the golf course, and that has motivated observers to track his trips to the golf course. (We have our own Trump golf tracker.)", "The meme’s source for $83 million is unclear. But Sophie Germain, self-described as a data junkie, runs the website trumpgolfcount.com, which updates its tally after Trump visits \"a location whose primary offering is golf (i.e., a ‘golf club’).\" The site relies on White House press pool reports.", "According to trumpgolfcount.com, Trump has made 154 daytime visits to golf clubs since his inauguration, \"with evidence of playing golf on at least 70 visits,\" and that has cost taxpayers $84 million. (The site’s last recorded outing was Nov. 25, 2018.)", "It says its cost estimates are based on:", "• Flights to Trump properties;", "• Coast Guard protection for Mar-a-Lago (a Trump property in Florida);", "• Trump's stay at his club and rental of luxury vehicles in Turnberry, Scotland, in July 2018; and", "• \"An additional $6.4 million per year, prorated per day at a rate based on money reimbursed so far, allocated to Palm Beach and Bedminster for ‘extraordinary law enforcement personnel costs’.\"", "While the site has been cited by multiple outlets, our fact-checking friends at the Washington Post found that some of its estimates, particularly the cost of Air Force One flights, may be too high. The Washington Post Fact Checker also questioned whether it’s fair to attribute all costs of presidential travel and support to a golf outing, since that logistical support follows the president wherever he goes.", "The Washington Post’s July 2018 fact-check also cautioned against the site’s then-use of a precise dollar figure for the cost of Trump’s golf outings, since it’s not known exactly how many times Trump has golfed or the precise costs.", "Trumpgolfcount.com addressed the fact-check on its website, saying: \"At the time his article was published, our cost estimate was $72,251,706, but (Washington Post’s Glenn) Kessler correctly pointed out that since our estimates have a great deal of uncertainty, they shouldn't be stated to the exact dollar. We've updated our site accordingly, and our total cost is now rounded to the nearest million.\"", "The meme suggests that it’s known how much Trump’s golfing trips cost, but that figure is uncertain.", "President Donald Trump in December 2017 signed into law a new tax bill that included significant tax cuts for corporations as well as temporary tax cuts for individuals.", "The changes in the tax law are projected to increase the federal deficit by at least $1.5 trillion over 10 years. The deficit is the difference between annual government spending and government revenue. Debt is the total amount the government owes.", "We rated as False a claim by Larry Kudlow, top economic adviser to President Donald Trump, that \"the entire $1.5 trillion tax cut is virtually paid for by higher revenues and better nominal GDP.\"", "A Facebook meme says, \"Cost of Mueller’s investigation: $3,200,000; Benghazi \"investigation\": $7,000,000; Trump’s golfing trips: $83,000,000; New debt from Republican tax bill: $1,500,000,000,000.\"", "The meme includes a mix of information that’s accurate with information that is incomplete and questionable.", "On balance, we rate the claim Half True.", "Facebook post comparing costs for Mueller investigation, Trump golfing, GOP tax bill and Benghazi probe, Dec. 9, 2018", "PolitiFact, How much is the Mueller investigation costing? (updated), Dec. 14, 2018; Clinton: 7 Benghazi probes so far, Oct. 12, 2015; Mike Pence's inaccurate claim about Clinton's Benghazi role and response, July 21, 2016; Who plays more golf: Donald Trump or Barack Obama?, updated May 18, 2018; Trump economic chief Larry Kudlow wrong about CBO report on tax cuts, July 31, 2018", "New York Times, House Benghazi Report Finds No New Evidence of Wrongdoing by Hillary Clinton, June 28, 2016", "PBS News Hour, Two years, $7 million, 800 pages later, GOP Benghazi report lands with a thud, June 28, 2016", "Trumpgolfcount.com, Main Page, How much does AF1 travel really cost?", "Washington Post Fact Checker, Have U.S. taxpayers spent $72 million on Trump’s golf outings?, July 27, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]