["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Czech Republic's President Milos Zeman speaks during the 71st session of the United Nations General Assembly, Wednesday, Sept. 21, 2016, at U.N. headquarters. (AP)", "An article sounding alarm bells about \"Islamic Extremism\" and migrants said that a new law designed to combat terrorism in the Czech Republic allows citizens to carry guns.", "\"Breaking: Czech Republic arms citizens. You can now shoot terrorists on sight,\" said an April 27 headline on patriotnetwork.one, a website that posts multiple anti-Muslim articles.", "Facebook users flagged the post as being potentially fabricated, as part of the social network’s efforts to combat online hoaxes.", "The story celebrated what it described as a new gun policy in the Czech Republic.", "\"Millions of patriotic men and women are PROUD to stand with the Czech Republic, fearing that if we don’t take action, Islam will soon overtake our nation,\" patriotnetwork.one wrote.", "While the story said that this is \"breaking\" news, it actually refers to news developments several months ago. In fact, the same story appeared on multiple websites and Facebook in June 2017.", "While patriotnetwork.one portrayed the law as a done deal, it was only approved by one chamber of the government and so has not actually become law.", "In 2015, Czech president Milos Zeman called for an international military effort against terrorism and the Islamic State group.", "Speaking at a Holocaust commemoration forum in Prague, Zeman said such military action would prevent what he called a \"super Holocaust,\" in which hundreds of millions would die.", "Zeman said in 2016 interview that Czechs should obtain guns to protect themselves against terrorists.", "''If it is necessary, people will have to be ready for a situation where they will have to use those guns,'' he said. ''My wife has just got a gun license and has a proper revolver. So I hope she will protect me from terrorists.''", "In June 2017, the lower chamber passed an amendment to the constitution related to the carrying of firearms.", "Kieran Williams, an expert in the politics of Central and Eastern Europe at Drake University, told PolitiFact that the measure would have amended a 1998 act in order to create a constitutional right to keep and bear arms to assist the state against threats to national security. The original act made it a duty to help if called upon by the state.", "\"Czechs have long had statutory rights to keep and bear arms, and to use force in self-defense,\" he said. \"This constitutional bill was a response to a European Union directive to tighten up possession of certain categories of weapons after the terror attacks in Paris, Brussels and elsewhere; gun advocates hoped to minimize the impact of that directive on the Czech Republic by creating this new constitutional right.\"", "The amendment passed the lower chamber in June. But it was rejected by the Senate in December when it fell short of the needed three-fifths majority. (Our Czech fact-checking friends at demagog.cz pointed us to the Senate vote.)", "Patriotnetwork.one makes no direct mention of the Senate, although it drew some information from a 2017 Sputniknews article that did mention that the bill still had to be approved by the Senate. The Patriotnetwork.one story is about the Czech Republic, but one of the photos the website used of an angry man appears to be the same as a 2015 photo of a man in a Budapest railway station.", "The patriotnetwork.one website tries to stir up fear about Muslims, migrants and terrorism in the Czech Republic while ignoring some facts.", "For starters, the Muslim population in the country of more than 10 million is tiny. The Muslim population was less than 4,000 in the 2011 census, but participants weren’t required to fill out information about their religion. That could be an undercount, but even other estimates aren’t much higher at 22,000.", "The Czech Republic has taken very few migrants in recent years and \"has no recent history of terrorism and generally has a declining rate of violent crime,\" WIlliams said.", "Sean Hanley, a senior lecturer at the UCL School of Slavonic and East European Studies in London, said most migrants entering the Czech Republic wanted to access the country to get to other countries such as Germany.", "There were only 1,525 requests for asylum in the Czech Republic in 2015 and at the peak of the 2014-15 crisis around 1,500 migrants were detained by the Czech authorities for entering the country illegally.  Very small numbers of migrants and refugees entered compared with Hungary or Croatia.", "\"This is an entirely unrealistic ‘threat’ but it taps into and gives a focus to the fears and insecurities of small, mono-ethnic post-communist country in an uncertain world,\" he said.", "Hanley said it \"was one of the more bizarre legislative initiatives in the political history of the Czech Republic\" and occurred amid a backdrop of anti-refugee hysteria.", "Patriotnetwork.one said in a headline \"Breaking: Czech Republic arms citizens. You can now shoot terrorists on sight.\"", "First, this isn’t breaking news -- it refers to a proposed amendment in 2017 to create a constitutional right to keep and bear arms to assist the state against threats to national security.", "While the amendment passed the lower chamber in June 2017, it failed in the Senate in December 2017.", "We rate this claim False.", "Patriotnetwork.one, \"Breaking: Czech Republic arms citizens. You can now shoot terrorists on sight,\" April 27, 2018", "AP, \"Czech president wants international action against terrorism,\" Jan. 27, 2015", "The Guardian, \"Milos Zeman: the hardline Czech leader fanning hostility to refugees,\" Sept. 14, 2016", "The Guardian, \"Hungary closes main Budapest station to refugees,\" Sept. 1, 2015", "Washington Post, \"Czech government tells its citizens how to fight terrorists: Shoot them yourselves,\" Jan. 7, 2017", "Global Legal Monitor, \"Czech Republic: Draft Law on Putting Rights of Gun Owners in Constitution,\" Sept. 5, 2017", "Washington Post blog by Eugene Volokh, \"Czech parliament's lower house passes right of citizens to keep and bear arms 'to participate in the security of the Czech Republic,'\" June 29, 2017", "Sputnik News, \"Open Season: Ordinary Czechs Get Right to Shoot Terrorists on Sight,\" June 29, 2017", "New York Times, \"Czech Man Is Charged With Attempted Terrorism,\" Aug. 2, 2016", "Reuters, \"Czech lower house backs putting gun rights in constitution,\" June 28, 2017", "BBC, \"Czech parliament moves to legalise firearm ownership,\" June 29, 2017", "Demagog.cz", "Senat.cz, Dec. 6, 2017", "Eurozpravy.cz, \"Muslimové v Česku? Kniha vyvrací mýtus, který koluje ve společnosti,\" Dec. 9, 2016", "Blisty.cz, \"Czech Republic: Anti-refugee hysteria makes a young woman report a chimney sweep to the police,\" Sept. 16, 2015", "Novinky.cz, \"Za první dva měsíce získalo v ČR azyl osm lidí,\" April 4, 2018", "Radio Praha, \"Czech Republic takes legal action over EU firearms directive,\" 2017", "Intellinews - Czech Republic Today, \"Czech parliament passes ‘Wild West bill,’\" (Accessed in Nexis) June 29, 2017", "CTK National News Wire, \"Czech Senate rejects EU's arms regulation unrelated to terrorism,\" (Accessed in Nexis) Dec. 6, 2017", "CTK National News Wire, \"Czechs Muslim form varied, ethnically diverse group,\" Dec. 9, 2016", "Interview, Kieran Williams, comparativist and specialist in the politics of Central and Eastern Europe at Drake University, May 1, 2018", "Interview, Sean Hanley, Senior Lecturer in Comparative Central and East European Politics School of Slavonic and East European Studies UCL, May 1, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]