["By Lori Robertson", "Posted on July 12, 2019", "Former Vice President Joe Biden defended his support decades ago for a controversial crime bill, saying in a speech in South Carolina, “There’s another part of my long record that’s being grossly misrepresented: the 1994 crime bill.”", "We’ll go through Biden’s points about what was in the bill and what he supported or opposed.", "Biden spoke about the bill in a speech in Sumter on July 6 in which he addressed his earlier remarks a few weeks ago about working with “some civility” in the 1970s with two segregationist southern Democrats to get “things done” even though “we didn’t agree on much of anything.” Biden, who is leading the national polls for the 2020 Democratic presidential nomination, apologized in his Sumter speech, saying, “I’m sorry for any of the pain or misconception” his remarks “may have caused anybody.”", "He also made extensive remarks about the 1994 crime bill, which Biden, as chairman of the Senate Judiciary Committee, largely wrote and shepherded through the legislative process. The Violent Crime Control and Law Enforcement Act of 1994 received bipartisan support at the time but has been criticized for some of its provisions, such as mandatory minimum sentencing, and its impact on mass incarceration. (When we looked at claims in 2016 from both sides on the law’s role in mass incarceration, we found the trend of increasing imprisonment began well before 1994, but experts told us the 1994 law exacerbated the issue.)", "The legislation was aimed at addressing rising crime in the country and contained a host of policing and crime prevention provisions — including “three-strikes” mandatory life sentences for repeat violent offenders, funding for community policing and prisons, an assault weapons ban and the Violence Against Women Act. It authorized $30.2 billion, according to a Congressional Research Service report on federal crime measures. It increased federal crimes subject to the death penalty and enabled juveniles to be tried as adults for violent and firearm-involved federal crimes.", "Here are the points Biden made about the crime law in his South Carolina speech and how they stack up to the facts:", "Biden: In the 1980s and 1990s violent crime was out of control. The crime bill was designed to deal with that problem. That’s why it was supported overwhelmingly by the Democratic Party, by African American leaders all across the nation, including a majority of the black caucus in the Congress.", "The bill was aimed at reducing violent crime, which had been rising. The violent crime rate had been on a general trend upward in the decades leading up to the 1994 bill, peaking in 1991, as this chart shows. After dropping in the first part of the 1980s, the violent crime rate, according to the FBI’s Uniform Crime Reporting Statistics, increased by 39 percent from 1983 to 1993, the year before the crime bill was passed.", "And it was supported by the Democratic Party. The Senate initially passed the bill by a 95-4 vote; the final conference report vote was 61-38, with just two Democrats voting no. The House passed the final bill 235-195, with nearly three times as many Democrats supporting it as opposing it.", "It’s also true that a majority of the Congressional Black Caucus supported the legislation, though then-President Bill Clinton had to meet with the CBC to garner enough votes to get the bill over the finish line. The Baltimore Sun reported on Aug. 18, 1994, that at least three members of the caucus had switched their votes after meeting with Clinton at the White House. Before that meeting, “10 of the 38 black Democrats in the House voted against him when the crime bill, in an embarrassing setback for the administration, failed on a procedural motion. They were protesting the application of the death penalty to 60 more crimes,” the Sun reported.", "Nearly 40 African American religious leaders released a statement supporting the bill, saying: “While we do not agree with every provision in the crime bill, we do believe and emphatically support the bill’s goal to save our communities, and most importantly, our children.” And 10 African American mayors wrote to the chairman of the CBC, Rep. Kweisi Mfume, pledging their support for the bill, even if it lacked a racial justice provision the White House was prepared to give up to get more votes for the legislation. That provision would have allowed defendants to appeal a death sentence by submitting data that suggested a racial bias in death sentencing in a jurisdiction. “We cannot afford to lose the opportunities this bill provides to the people of our cities,” the mayors wrote, according to the Los Angeles Times on July 15, 1994.", "Biden: [The crime bill] worked in some areas. But it failed in others. … The violent crime rate was cut in half in America.", "The violent crime rate has been nearly cut in half — down 46% — from 1994 to 2017, but Biden’s suggestion that the 1994 legislation should be credited is misleading. We looked into a similar claim from Bill Clinton in 2016 and found experts pointed to other factors for most of that crime decrease.", "For instance, a 2005 report from the Government Accountability Office estimated that funding for Community Oriented Policing Services, which resulted in tens of thousands of additional police officers, “contributed to a 1.3 percent decline in the overall crime rate [from 1993 to 2000] and a 2.5 percent decline in the violent crime rate from the 1993 levels.” But the GAO concluded that other factors were responsible for the majority of the drop in crime during that period. The total decrease in violent crime was 32% from 1993 to 2000.", "John Worrall, a professor of criminology at the University of Texas at Dallas, told us “the jury is very much still out” on what caused the decrease. “Criminologists and economists are in no agreement as to the causes of the crime declines we’ve seen. Could be economic, demographic, a civilizing effect, possibly because of abortion or lead paint, tougher sentences, etc., etc. A dozen or more explanations have been offered and no one agrees.”", "Experts with the Brennan Center for Justice wrote in 2016 that the bill “likely helped” in the large decrease in crime “not by locking people up, but by putting more cops on the street, studies show.” The authors said, “Research also indicates smarter policing tactics, like the ones funded by the bill, and social and economic factors — like an aging population and decreased alcohol consumption — played a role in the crime decline as well.”", "Biden: But it was opposed by Republicans, people like Mitch McConnell, not because they thought it was too tough, because they thought it was too soft. They felt it dedicated too much money to things like prevention. … Remember they had those prisoners dancing in tutus saying Biden wants to have after-school programs, Biden wants to have prevention programs.", "McConnell, now the Senate majority leader, did vote against the final version of the bill in August 1994, as did all but eight Republican senators. However, months earlier, in November 1993, the original bill had garnered near universal support in the Senate, with McConnell on the “yes” ledger.", "Why did McConnell switch his vote by the time the House-Senate conference bill had been negotiated? Biden has a point that Republicans thought the bill had grown too “soft”; they objected to additional spending in the final bill, calling it “pork.” McConnell told CNN on Aug. 15, 1994, 10 days before the final Senate vote: “The Kentucky Fraternal Order of Police this weekend came out against this crime bill. … [B]ecause they thought it was porked up, that it was going to be a bill basically about social workers and not police officers.”", "McConnell said spending in the bill had gone from about $22 billion in the original Senate version to $33 billion in the conference report. He said after-school programs were “a worthwhile expenditure” but objected to spending on a midnight basketball league program, which became a talking point for critics of the bill. (The final bill provided $377 million over five years to states and localities to be used for various education and community prevention efforts, including midnight sports leagues that included job training and other educational aspects.)", "In an Aug. 23, 1994, letter to Sen. Bob Dole, then the Republican leader, 41 senators said they wanted a “tough crime bill” but the conference report “earmarks billions of dollars for wasteful social programs” and “fails to include a number of important tough-on-crime proposals adopted by the Senate last November.”", "Biden’s reference to the “prisoners dancing in tutus” is to a 1994 campaign ad for James Inhofe, who went on to win the Senate seat for Oklahoma in that race. The ad mocked Inhofe’s Democratic opponent, Rep. Dave McCurdy, for supporting Clinton’s (not “Biden’s”) crime bill that included “dance lessons” and “midnight basketball.”", "Biden: I also wrote into that law, drug courts. Anyone arrested for a drug problem because they’re addicted should be going into, diverted into a drug court, not into a prison system.", "The crime law created the Drug Court Discretionary Grant program, which provides grants to states and localities for drug courts, an alternative to the traditional judicial system for nonviolent offenders with addiction issues with the goal of reducing recidivism and drug abuse.", "“Broadly, these specialized court programs are designed to divert some individuals away from traditional criminal justice sanctions such as incarceration,” a March 2018 CRS report explains. “Many drug courts offer a treatment and social service alternative for those who otherwise may have faced traditional criminal sanctions for their offenses. In some drug courts, individuals that have been arrested are diverted from local courts into special judge-involved programs; these courts are often viewed as ‘second chance’ courts. Other drug court programs offer reentry assistance after an offender has served his or her sentence.”", "The 1994 law provided $1 billion for drug courts over six years.", "Biden: It included my Violence Against Women Act, which I wrote. It included strengthening the Brady Bill on background checks, eliminated assault weapons.", "Yes, the bill included the Violence Against Women Act, which increased federal penalties for repeat sex offenders and provided grants for victim services among other measures, provided funding for the Brady Handgun Violence Prevention Act, and included a ban on some semi-automatic weapons that was in place for 10 years.", "Biden: They [Republicans] didn’t like the fact that we removed mandatory minimums for first-time offenders.", "The final legislation included a so-called “safety valve” provision that limited the use of mandatory minimum federal sentences for some drug offenses. A defendant could qualify to be exempt from those mandatory sentences if he or she met certain criteria, including: that the defendant didn’t use violence or possess a gun or dangerous weapon during the act, no one was killed or seriously injured, and the defendant wasn’t “an organizer, leader, manager, or supervisor of others in the offense.”", "Biden: The bill also included things I didn’t like. I didn’t support the provision the president wanted in called three strikes and you’re out. Didn’t support it then, don’t support it now.", "There’s evidence supporting Biden’s contention that he didn’t back the final legislation’s three-strikes provision, but he did vote in favor of one version, a Republican amendment that was added to the Senate legislation. Biden is on record at the time as saying he supported a three-strikes provision for “serious [violent] felonies against a person,” but he was against including nonviolent offenses and expressed concern that minor crimes could get swept up in the measure.", "The provision in the final bill said anyone with at least two prior convictions for serious violent felonies, or one of those being a drug distribution or trafficking offense, who then committed a federal serious violent felony would be sentenced to life in prison without the possibility of parole.", "During debate over the Senate bill in November 1993, Republican Sen. Trent Lott proposed a three-strikes amendment that ended up passing 91-1. Lott’s amendment applied to a third violent felony involving physical force against another person. In a floor speech on Nov. 8, 1993, before that vote, Biden said, “One of the things that I found out is when you pass these minimum mandatory bills you sometimes end up in your net taking in people who you would never intend by the scope of the law when you write it to take in.”", "Biden objected to Lott’s definition of “violent felony” as a crime that included the use or threat of physical force against someone punishable by more than one year imprisonment. Biden said that meant the provision could apply to someone who gets into a fistfight in a national park, making their assault a federal felony. He said he had no problem with the provision applying to “a three-time rapist.”", "In response to Biden’s comments, Lott modified his amendment to apply to violent felonies punishable by more than five years imprisonment. “This is the language basically that was recommended by the Senator from Delaware to get at those most violent crimes and criminals,” Lott said.", "Biden, though, asked if the stipulation could be 10 years or more “so that we do not end up inadvertently sweeping into our net people that a federal judge would be required to put in jail for life–the drunken brawler who gets in his third fight and he happens to do it in Yellowstone Park while he is there.” He also expressed concern that any crime committed on an Indian reservation would be on federal property.", "By early 1994, Biden was quoted as saying the three-strikes proposal was “wacko.” When asked about that comment, in light of his support of Lott’s amendment, by NBC’s Katie Couric on the “Today Show” on Feb. 1, 1994, Biden said he was referring to other provisions that included nonviolent crimes.", "“So, what we should focus on are three strikes, meaning serious felonies against a person that are violent. We should take those predators off the street,” he said, adding that even if the Lott amendment remained in the final bill it would have a “minuscule” impact since the third crime has to be a federal one, and most crimes are state crimes.", "Biden also suggested limiting the provision to crimes punishable by a decade of prison time or more, according to the Associated Press, which reported on Feb. 23, 1994, that Biden had said “screwy amendments” had been added on the Senate floor. The AP reported: “‘Let’s not take a really solid proposal and because of a half-dozen screwy proposals, trash the whole thing,’ Biden said, urging the House panel to help him rid the bill of those amendments.”", "In his 1994 State of the Union address, President Bill Clinton had endorsed the three-strikes idea, which was supported and ultimately adopted by many states. One DOJ-funded research report published in 2000 found that, with the exception of California, the state and federal three-strikes laws had “virtually no impact on the courts, local jails or state prisons. Nor does there appear to be an impact on crime rates.” The report said this type of legislation was “carefully crafted to be largely symbolic,” but also that courts and prosecutors had minimized the impact.", "Biden: I didn’t support any mandatory minimums.", "There’s some evidence that Biden didn’t support mandatory minimums in the 1994 crime bill, but it’s worth noting he had supported them several years earlier, when he co-sponsored the Anti-Drug Abuse Act of 1986. That act set mandatory minimums for crack cocaine offenses, with much harsher sentences compared with powder cocaine.", "But in 1993 at an event hosted by the U.S. Sentencing Commission, Biden said, according to an October 1993 article in the ABA Journal, “I think we’ve had all the mandatory minimums that we need. We don’t need the ones that we have.”", "“But quite frankly, I don’t think I will prevail. … I’ve watched how the process works. I am not at all hopeful there will be [enough] senators prepared to vote with me.”", "The article noted there had been a “change in the winds blowing about mandatory minimum sentencing” from those on both sides of the aisle. It said Biden was among those who had changed. “Two years ago, Biden was cooperating with the Bush administration to support mandatory minimum sentences in federal anti-crime legislation.”", "The 1994 crime law called for a review of the cocaine sentencing policies by the U.S. Sentencing Commission, which determined that the sentencing gap between crack and powder cocaine was too large — a defendant would need to possess 100 times more powder cocaine than crack to be subject to the same sentence — and that the policies resulted in a racial disparity.", "In 2008, Biden said the 100-to-1 ratio was “arbitrary, unnecessary, and unjust,” and acknowledged that legislation he helped draft was “part of the problem that I have been trying to solve since then.”", "The sentencing gap was reduced in 2010 by the Fair Sentencing Act.", "Biden: I didn’t support more money to build state prisons. I was against it. We should be building rehab centers and not prisons.", "Biden did support $6 billion in funding for state prison construction, but not the $10 billion that was part of the final bill. His campaign says the $4 billion difference is what he means when he says he “didn’t support more money to build state prisons.”", "The prison funding also came with strings: It went to states that had “truth-in-sentencing” laws requiring that people convicted of violent crimes serve at least 85 percent of their sentences. According to the Department of Justice, 11 states adopted such laws in 1995 and three years later, 27 states and Washington, D.C., met the criteria for the prison construction grants.", "This is one of the measures experts have cited in saying the 1994 legislation contributed to already increasing incarceration. “Although incarceration was already rising steadily before the crime bill, several of its provisions helped increase incarceration even further,” experts with the Brennan Center said in 2016, citing the increase in federal crimes subject to the death penalty, the three-strikes provision and the incentive for states to make sure convicts served the vast majority of their sentences.", "The authors said: “On their own, states passed three-strikes laws, enacted mandatory minimums, eliminated parole, and removed judicial discretion in sentencing. By dangling bonus dollars, the crime bill encouraged states to remain on their tough-on-crime course.”", "— by Lori Robertson, with Eugene Kiely", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]