["The posts, like this one here, shared more than 8,000 times on Facebook, begin with the following warning emphasised in uppercase letters: “GAS EXPLOSION ALERT!!! STOP SHAKING YOUR GAS CYLINDER!!!”.", "Other examples of the post can be found here, here, here and here on Facebook, as well as on this website. The post ends with an appeal to “save a life today by sharing this information”.", "A similar version also appears here on Twitter (screenshot below), although the claim about the dangers of shaking a gas cylinder has been omitted.", "NoTICE❗\n\n\t\tYou don't have to shake the gas cylinder to know the level of it's content.\n\t\tJust wet a side of the cylinder with water, after a while the used top part will be dry while the lower part with gas will remain wet.\n\t\tThe wet portion tells you the amount of gas left.\n\n\t\tSHARE! pic.twitter.com/8O6hEg36hF", "The claim goes further by suggesting the safest way to test for residual gas is to pour water over the cylinder.", "“After a while, the used top part will be dry while the lower part with gas will remain wet. The wet portion tells you the amount of gas left.”", "AFP asked Liquefied Petroleum Gas Safety Association of Southern Africa if the claim had any merit.", "After carrying out the experiment, the association said their test found that hot water poured over a cylinder adhered to the portion of the bottle still containing gas.", "“We have tried this out ourselves and there seems to be some truth to this,” spokeswoman Gaahele Mokgoro said in an email.", "David Tyler, a safety specialist at the Paris-based World LPG Association, said the method was a “crude but indicative way” of determining the remaining level of gas left in the cylinder.", "An explanation of how this is possible can be found on this blog here, while the video below also offers a quick guide.", "Both Mokgoro and Tyler agreed it was pointless to shake a bottle to determine the amount of gas, but that doing so would not cause an explosion.", "“LPG cylinders are designed to withstand robust treatment as they travel through the distribution channel,” said Tyler. “I think shaking is unnecessary but not dangerous.”", "Mokgoro agreed that \"cylinders do not explode from mere shaking\", but nonetheless advocated caution.", "\"There are consumers that are purchasing their cylinders from illegal dealers who do not have permission from the cylinder brand owners to fill that cylinder, so we may never know what condition their cylinder is.\"", "That said, if proper safety practices are followed - as this website explains here - gas cylinders themselves are perfectly safe to use.", "Mokgoro said the best way to know how much gas was left in the bottle was to weigh it and subtract the number from the gross mass, which is usually stamped somewhere on the bottle.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]