["About this rating", "Celiac disease experts theorize that some plastic straw alternatives, particularly those made of wheat straw or pasta, may contain gluten or gluten byproducts.", "There is no direct evidence to confirm paper straws contain gluten.", "Embracing plastic straw alternatives may require second thoughts for some individuals diagnosed with celiac disease. A claim that appeared in a meme in early 2021 warned that traces of gluten may be found in some plastic straw alternatives and could prove damaging to those with gluten intolerance and sensitivities.", "The graphic in question urged social media users to bring their own straws or opt for those made out of bamboo or hay — or none at all.", "We found this claim to be true.", "Celiac disease is a hereditary and serious autoimmune disease affecting about 1 in 100 people around the world. In those diagnosed with the condition, gluten — a protein found in wheat, rye, and barley — triggers an immune response that attacks the small intestine and damages the villi, small finger-like projections that line the organ. When the villi are damaged, this inhibits their ability to properly absorb nutrients and can result in adverse consequences to general health and growth.", "In early 2021, many companies and individuals around the world continued the transition from plastic straws to those made of more environmentally friendly material, including stainless steel, glass, silicone, and paper. According to the Celiac Kids Connection of Boston Children’s Hospital, some of these alternative straws may also contain gluten, such as those made from straw or pasta.", "Some plastic-free straws are produced from wheat straw, the stalk that is left over after the grain, which contains gluten, is harvested. Though there is the potential for cross-contamination of gluten, experts note that many brands of straw-based straws are made from the stem of the plant (gluten is found in the seeds of cereal grains), and most have tested below gluten levels recommended by the U.S. Food and Drug Administration for those with gluten intolerance.", "Beyond Celiac, a nonprofit organization raising awareness of the disease, was among the first to address the claim head-on in a Facebook post dated Aug. 29, 2019, that said that the caution seemed plausible, though not necessarily “evidence-based”:", "Thanks to everyone who has taken us to task on this. Wheat paste or other \"edible\" adhesives seem plausible for straws, and we felt the caution was warranted. As always, we strive to be evidence-based and needed to do more research before issuing the cautionary note. Some restaurants *do* use actual pasta for straws, so if nothing else, we want people to be aware of hidden sources of gluten where you might not imagine to find it. We will continue to try to get to the bottom of the paper straw issue.", "And other advocacy groups have joined the call to action. Gluten Intolerance Group (GIG) noted that for those who are sensitive to gluten, anything that goes into the mouth should be evaluated for gluten content.", "“Alternatives to plastic like glass or stainless steel are of course safely gluten-free, but some straws are made to be biodegradable and may include ingredients such as bamboo, corn starch, wheat straw, or sugar cane,” wrote the advocacy group.", "When ordering a drink, it is recommended that an individual ask what the straw is made of and whether it is gluten-free.", "“So, it makes sense to be cautious and ask questions,” wrote GIG. “If in doubt, simply enjoy your drink without the straw.\"", "Update [Feb. 5, 2021]: The claim rating was updated from \"True\" to \"Mixture.\"", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]