["About this rating", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "On July 16, 2020, as the U.S. recorded its single highest number of COVID-19 cases since the coronavirus health crisis began, U.S. President Donald Trump spoke at an event held on the South Lawn of the White House, ostensibly on the subject of \"Rolling Back Regulations to Help All Americans.\" During his talk, according to a meme, Trump allegedly tackled the subject of energy-efficiency standards which have supposedly resulted in home appliances that do not function properly due to requirements aimed at conserving the amount of water and power they consume:", "This was an accurate reproduction of a portion of Trump's talk, according to a White House transcript of the event:", "We’re bringing back consumer choice in home appliances so that you can buy washers and dryers, showerheads and faucets. So showerheads — you take a shower, the water doesn’t come out. You want to wash your hands, the water doesn’t come out. So what do you do? You just stand there longer or you take a shower longer? Because my hair — I don’t know about you, but it has to be perfect. Perfect.", "Dishwashers — you didn’t have any water, so you — the people that do the dishes — you press it, and it goes again, and you do it again and again. So you might as well give them the water because you’ll end up using less water. So we made it so dishwashers now have a lot more water. And in many places — in most places of the country, water is not a problem. They don’t know what to do with it. It’s called “rain.” They don’t have a problem.", "This was far from the first time the president had riffed on poorly functioning appliances. In December 2019, as Trump spoke in the Roosevelt Room of the White House amidst an impeachment inquiry, he digressed into railing about toilets and other bathroom fixtures that allegedly frustrate their users due to the use of low-flow technology. CNN reported:", "The President claimed Americans are flushing their toilets \"10 times, 15 times, as opposed to once\" and argued that they are having difficulty with washing their hands in what appeared to be a tangent about low-flow sinks and toilets.", "\"We have a situation where we're looking very strongly at sinks and showers and other elements of bathrooms where you turn the faucet on -- and in areas where there's tremendous amounts of water, where the water rushes out to sea because you could never handle it, and you don't get any water,\" the President said during a roundtable with small business leaders about deregulatory actions.", "\"You turn on the faucet and you don't get any water. They take a shower and water comes dripping out. Just dripping out, very quietly dripping out,\" the President continued, lowering his voice as he spoke about the drips. \"People are flushing toilets 10 times, 15 times, as opposed to once.\"", "It wasn't entirely clear what he was talking about, but it appeared to have to do with bathroom fixtures with low-flow appliances. He said the Environmental Protection Agency was looking into the issue on his suggestion.", "\"They end up using more water. So (the) EPA is looking at that very strongly at my suggestion,\" Trump said, though he did not give details on what suggestions, if any, he made.", "NPR quoted the Pacific Institute, a non-profit research institute with a focus on global and regional freshwater issues, as asserting that Trump's statements did not comport with reality:", "Peter Gleick with the Pacific Institute in Oakland considers this all to be Trumpian nostalgia for a time when showers were strong, toilets used 4 gallons a flush and lightbulbs burned your hands when you touched them.", "Gleick said these newer household items are part of an \"efficiency revolution,\" doing the same tasks with less and halting the upward trajectory of water and energy consumption in America. And, yes, a dishwasher cycle takes longer, and incandescent bulbs are cheaper to buy upfront.", "But in the long run, \"They're much more expensive, because they use a huge amount of energy, which we pay for over time and they burn out 20 times faster,\" Gleick said.", "Based on the way Trump talks about efficient lightbulbs, it seems his complaint is with compact fluorescent bulbs, which were the only low-energy bulbs widely available 10 years ago. But today, store shelves are full of LED bulbs with warmer-looking light and even longer life spans. Gleick suspects Trump's toilet complaints are outdated as well, because low-flow toilet technology has come a long way in recent years.", "\"Some people got bad toilets, but that was 15 and 20 years ago,\" Gleick said. \"And now the new toilets not only use a tiny fraction of the water the old toilets used to use, but the truth is they flush better — and if you have a bad toilet that doesn't flush, well, that's because you have a bad toilet.\"", "A video of the portion of the speech reproduced in the above meme can be viewed here:", "Picheta, Rob et al.   \"Trump Claims Americans Have to Flush the Toilet '10 Times, 15 Times, As Opposed to Once.'\"\r\n    CNN.   7 December 2019.", "Keith, Tamara.   \"Trump vs. Toilets (And Showers, Dishwashers and Lightbulbs).\"\r\n    NPR.   27 December 2019.", "WhiteHouse.gov.   \"Remarks by President Trump on Rolling Back Regulations to Help All Americans.\"\r\n    16 July 2020.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]