["An Austin Democrat critical of the all-Republican Texas Supreme Court for upholding the legality of the Texas school finance system asserted that unless lawmakers act, per-student spending will lag what it totaled more than a dozen years ago.", "In a press release circulated May 13, 2016, the date of the court’s decision, state Rep. Celia Israel urged Gov. Greg Abbott to call a special legislative session to \"fully fund public education.\"", "Israel went on: \"When adjusted for inflation, per-student spending has remained relatively flat over the past 16 years. Despite that trend, Texas schools in 2017 will receive $381 less per student than they did in 2003.\"", "Is all of that so?", "Israel cites Center for Public Policy Priorities", "To our inquiry, Israel’s chief of staff, Jennie Kennedy, said by email that Israel relied on an April 2016 report by the Austin-based Center for Public Policy Priorities, a liberal think tank that advocates lawmakers on issues affecting low-income Texans.", "We turned to the report, \"The Texas School Finance Challenge and What to Do About It,\" which has a nearly identical spending claim, stating: \"When adjusted for inflation, per-student spending has remained relatively flat over the past 16 years. Despite that relatively flat spending trend per student, Texas schools in 2017 will receive $381 less per student than they did in 2003.\"", "Over the years, a chart in the report indicates, total per-student spending was relatively flat, ranging from a 2013 inflation-adjusted low of $9,813 per student to a 2009 high of $11,621. From 2002 through 2017, the chart suggests annual average per-student spending of nearly $10,479 -- meaning $273 less than what was spent in 2003 and $108 more than expected spending in 2017.", "And, as Israel said, the $10,371 in expected spending in 2017 would run $381 less than the shown $10,752 in per-student spending in 2003.", "Indeed, per the chart, that 2017 spending will run behind per-student spending in 10 of the 14 years from 2003 through 2016--though it’s poised to outpace spending in four of the presented years.", "We realized too you can reach a smaller long-term spending difference--or even an increase--by focusing on a different timeframe. For instance, according to the chart, the expected 2017 spending will lag per-student spending in 2004 by (just) $97--and the expected spending will outrun school spending in 2005 by $111 per student, also exceeding per-student spending in 2012 through 2014--by margins of $262 per student (2014) to $558 (2013). Finally, the shown 2017 spending will run just $4 per student behind $10,375 in spending in 2015 though it’s pegged to be down $69 per student from spending in 2016.", "SOURCE: Report, \"The Texas School Finance Challenge and What to Do About It,\" Center for Public Policy Priorities, April 20, 2016", "We asked the center to show its work; spokesman Oliver Bernstein emailed us the related spreadsheet, which initially prompted us to notice that the presented figures represent 2015 dollars.", "State spending up?", "Also, the spreadsheet shows, the center broke out annual changes in local, state and federal spending, also adjusted for inflation.", "Seemingly dramatic: Some $4,236 per student in school expenditures by state government in 2017 stands to outpace comparable spending in 2003--by $254. In contrast, local spending will be down nearly $600 a student and federal aid will be about $60 per student less than what it was, according to the sheet.", "What gives? By email, a center analyst, Eva DeLuna Castro, reminded us the uptick in state spending reflects a legislative decision in 2006 to pay down local school property taxes with state aid; that move fuels a continuing cost to the state of $14 billion every two years.", "In the report, a note below the chart says the center reached its figures by analyzing data from the Legislative Budget Board, which advises lawmakers on budget issues, and Texas Education Agency. So we asked those agencies about the center’s conclusions.", "Legislative Budget Board analysis", "By email, TEA spokeswoman DeEtta Culbertson said the agency doesn’t make such spending comparisons.", "But a board staff spokesman, R.J. DeSilva, told us by email that its own inflation-adjusted analysis indicates that in 2017 dollars, Texas schools will have $10,111 in total per-student aid in 2017--up $33 from $10,078 in per-student spending in 2003. DeSilva emailed a chart showing the figures as well as that 3.9 million students attended Texas schools in 2003 with a little more than 5 million expected in 2017.", "DeSilva wrote: \"The source of the statement you're checking may be using different data points such as measures of inflation or constant dollar year.\"", "We knew that was right about the dollar year.", "And when we asked, DeLuna Castro confirmed by email that the center had employed a federal inflation index, the Implicit Price Deflator for state/local government from the Bureau of Economic Analysis. In the center’s view, DeLuna Castro said, that index better reflects costs to school districts than the general Consumer Price Index applied in the board-provided analysis. \"Why it’s different: Governments are more likely to face the rising costs of health care (teacher health insurance premiums, for example) and of road construction that the CPI doesn’t capture,\" DeLuna Castro wrote.", "How about it, budget board; wrong inflation index? To the contrary, DeSilva said by email there's no consensus about using the IPD rather than CPI when analyzing education spending. \"The CPI is well-known,\" DeSilva wrote, and the board uniformly employs it to analyze state spending in all areas.", "Finally, DeLuna Castro emailed us her run at adjusting per-student spending figures by using the CPI to account for inflation. By this approach, public school spending in 2017 stands to outpace per-student spending in 2003 by $148 per student, per the spreadsheet DeLuna Castro shared, though the 2017 spending looks to trail per-student expenditures in 2006-08, 2012, 2015 and 2016.", "Our ruling", "Israel said: \"When adjusted for inflation, per student spending has remained relatively flat over the past 16 years. Despite that trend, Texas schools in 2017 will receive $381 less per student than they did in 2003.\"", "Per-student funding has held relatively flat, data shows. But the \"$381 less\" conclusion rests on cherry-picking a timeframe and relying on an inflation index not favored by the main agency that advises lawmakers on budget issues. Try a different timeframe and/or the CPI and you can get contrary results--even, in some instances, greater spending in 2017.", "We rate this statement Half True.", "HALF TRUE – The statement is partially accurate but leaves out important details or takes things out of context.Click here for more on the six PolitiFact ratings and how we select facts to check.", "Texas Supreme Court majority opinions in school finance case, \"Morath v. the Texas Taxpayer and Student Fairness Coalition,\" May 13, 2016", "Email (excerpted), Jennie Kennedy, chief of staff, Rep. Celia Israel, May 16, 2016", "Report, \"The Texas School Finance Challenge and What to Do About It,\" Center for Public Policy Priorities, April 20, 2016", "Emails, Oliver Bernstein, communications director, Eva DeLuna Castro, program director, Invest in Texas, Center for Public Policy Priorities, May 16-20, 2016", "Spreadsheet showing center calculations for per-student spending comparisons (received by email from Oliver Bernstein, communications director, CPPP, May 16, 2016)", "Emails, R.J. DeSilva, communications officer, Legislative Budget Board, May 17-18, 2016", "Document, \"Total Public Education Funding, 2003 vs. 2017,\" Legislative Budget Board, May 17, 2016 (received by email from R.J. DeSilva)", "Email (excerpted), Celia Israel, May 19, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]