["The video was shared here on YouTube on December 25, 2020. It has been viewed more than 140,000 times.", "The video’s title reads: \"SHOCKING: President Duterte VISITED the WAKE of GREGORIO FAMILY\".", "The post circulated after the fatal shooting of Sonya Gregorio and her son Frank by police officer Jonel Nuezca in the northern Philippines in December 2020. CNN reported on the case in a report published here on December 21, 2020.", "In the opening 12 seconds of the footage, it shows an image that purports to show Duterte visiting the wake. The video then shows other images of Nuezca and purported visuals from the shooting incident.", "At the video's one-minute 51-second mark, a voiceover narrates: \"Based on reports that are spreading, President Duterte supposedly visited the Gregorio family wake to offer condolences.\"", "The video was also shared on Facebook here, here and here; and in blogs here, here and here alongside a similar claim.", "The claim is false.", "Combined reverse image and keyword searches on Google traced the original photo of the wake to this Facebook post published by the Philippine National Police (PNP) on December 22, 2020. The original photo shows police Chief Debold Sinas, not Duterte, visiting the Gregorio wake.", "The post is captioned in part: “PNP Chief, Police General Debold M Sinas, with PRO3 Regional Director, Police Brig Gen, Valeriano De Leon (left) extends his personal condolences to Mr. Florentino Gregorio (3rd from right), patriarch of the orphaned family of the late Mrs. Sonya Gregorio and son Frank who both died in a shooting incident involving an off-duty policeman in Paniqui, Tarlac.”", "The PNP’s photo had been digitally altered to insert an image of Duterte. The image of Duterte was originally published by the presidential communications office here on January 6, 2020 in an unrelated press release.", "Its caption reads: “President Rodrigo Roa Duterte greets some members of the House of Representatives in attendance during the ceremonial signing of the General Appropriations Act (GAA) of 2020.”", "Below is a set of screenshot comparisons showing the doctored photo (L) with its corresponding sources indicated within blue frames (R):", "A spokesperson for the presidential communications office told AFP Duterte had not attended the wake, in a text sent by Viber messaging app on January 22, 2021.", "Philippine fact-checking initiative FactRakers also debunked the misleading claim here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]