["About this rating", "On 28 September 2016 the partisan and unreliable web site Occupy Democrats published an item titled \"Springsteen Was Criticized for Bashing Trump. His Response Is Perfect,\" claiming the above-reproduced rude tweet had been issued by musician Bruce Springsteen:", "Bruce Springsteen doubled down on his remarks against Trump, following controversial comments he made in his interview with Rolling Stone. The rock legend and American icon ripped into the Republican nominee, making it absolutely clear that Springsteen doesn’t care what Trump supporters think about his opinion on the candidate[.]", "Occupy Democrats referenced a September 2016 Rolling Stone interview with Springsteen, during which the singer was asked for his opinion on the \"Trump phenomenon.\" Springsteen responded by referring to the Republican presidential candidate as a \"moron\":", "Well, you know, the republic is under siege by a moron, basically. The whole thing is tragic. Without overstating it, it's a tragedy for our democracy. When you start talking about elections being rigged, you're pushing people beyond democratic governance. And it's a very, very dangerous thing to do. Once you let those genies out of the bottle, they don't go back in so easy, if they go back in at all. The ideas he's moving to the mainstream are all very dangerous ideas – white nationalism and the alt-right movement. The outrageous things that he's done – not immediately disavowing David Duke? These are things that are obviously beyond the pale for any previous political candidate. It would sink your candidacy immediately.", "Springsteen was also asked whether he had a \"lack of enthusiasm\" for Hillary Clinton, to which he replied:", "No. I like Hillary. I think she would be a very, very good president.", "However, the tweet attributed to Springsteen was a fake. Directly next to all tweets on the @Boss1949 account (connected with the misspelled name \"Bruce Spingsteen\") is a short bio indicating the true nature of the Twitter account:", "Not a famous rock star. And DEFINITELY not Bruce Springsteen. Nuh-uh. (satire)", "The real Bruce Springsteen uses the Twitter account, @Springsteen, devoted almost entirely to performance-related content:", "Bruce's Springteen's autobiography #BornToRun is available now! Get your copy wherever books are sold: https://t.co/tXO7K9SvMr pic.twitter.com/1kGjapCkEh", "— Bruce Springsteen (@springsteen) September 27, 2016", "The account belonging to the real Bruce Springsteen did not comment on the viral fake tweet, and as of 29 September 2016 Occupy Democrats hadn't retracted their inaccurate claim.", "The satirical @Boss1949 Twitter account appears to have been suspended as of this writing.", "Hiatt, Brian.   \"Bruce Springsteen Calls Donald Trump a 'Moron.'\"\r\n    Rolling Stone.   23 September 2016.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]