["About this rating", "On 6 September 2016, the New Yorker web site reprised a 2013 satire by humorist Andy Borowitz in which he imagined a G20 summit of world leaders abruptly broken up by President Obama's telling Russian leader Vladimir Putin that everyone else thinks he's a \"jackass.\" And worse:", "“Look, I’m not just talking about Snowden and Syria,” Mr. Obama said. “What about Pussy Riot? What about your anti-gay laws? Total jackass moves, my friend.”", "As Mr. Putin narrowed his eyes in frosty silence, Mr. Obama seemed to warm to his topic.", "“If you think I’m the only one who feels this way, you’re kidding yourself,” Mr. Obama said, jabbing his finger in the direction of the Russian President’s face. “Ask Angela Merkel. Ask David Cameron. Ask the Turkish guy. Every last one of them thinks you’re a dick.”", "This piece carried particular resonance when it was recirculated in September 2016, as President Obama had just called off a scheduled meeting with Philippines President Rodrigo Duterte on his way back from the G20 summit in China after Duterte publicly referred to him as a \"son of a bitch.\"", "However, the reference to David Cameron ought to have been a dead giveaway that the piece was both fictional and dated (because Cameron resigned after the Brexit vote in June 2016), but as has become common with Borowitz's work, many Internet readers failed to recognize it as humor when it was shared with them via social media. (A mitigating factor in this case is that the article was copied and reposted on various political blogs and web sites without a disclaimer labeling it as satire.)", "Previously, a Borowitz piece premised on the notion that GOP presidential candidate Donald Trump's running mate, Mike Pence, attempted to escape from the campaign bus but was \"recaptured\" and returned to Trump's side went viral and was similarly mistaken for fact by at least a few readers.", "For what it's worth, Borowitz's bio on the New Yorker web site clearly identifies his column as satirical:", "Andy Borowitz is a New York Times best-selling author and a comedian who has written for The New Yorker since 1998. In 2001, he created the Borowitz Report, a satirical news column that has millions of readers around the world, for which he won the first-ever National Press Club award for humor. The Borowitz Report was acquired by The New Yorker in 2012.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]