["About this rating", "The viral video is authentic, was posted to Facebook on the day of the coup, and shows physical education teacher Khing Hnin Wai dancing and exercising near the site of Myanmar's parliament, while police and military vehicles travel in the direction of parliament behind her.", "We have not yet definitively determined exactly when the footage was recorded or exactly what activities are shown in the background.", "In the aftermath of a military coup in Myanmar in February 2021, news reports and social media posts claimed to show an extraordinary piece of footage — a woman conducting her regular aerobics class outdoors in the capital city of Naypyidaw, while in the background a convoy of military and police vehicles advance up the road towards the country's parliament.", "On Feb. 1, Aditya Raj Kaul posted the clip, along with the following description:", "\"A woman did her regular aerobics class out in open without realizing that a coup was taking place in #Myanmar. A Military convoy reaching the parliament can be seen behind the woman as she performs aerobics. Incredible!\"", "That particular clip was originally posted to Twitter by Àngel Marrades, whose Spanish-language description also garnered thousands of shares.", "On the morning of Feb. 1 (the evening of Jan. 31 in the United States), generals supportive of the political opposition deposed and detained controversial leader Aung San Suu Kyi, along with several of her allies, and installed a military regime they said would last for one year.", "So the video footage, which was first posted to Facebook on Feb. 1, appeared to show vehicles heading towards the parliament and therefore the early moments of the coup.", "That's how it was reported by several news outlets including The Guardian, Los Angeles Times, and the New York Post, among others.", "Those descriptions contained a degree of accuracy. The video is authentic, and there is no compelling reason to think the footage does not show what it seems to show — the early moments of a military coup inadvertently recorded. However, evidence is lacking in relation to certain key factual considerations, such as when the video was recorded and what exactly the convoy was doing when driving towards the parliament. Taking those factors into account, we are issuing a rating of \"Mixture.\"", "The video is real. The woman shown in it, a physical education teacher named Khing Hnin Wai, posted it to her Facebook account at 3 p.m. local time on Feb. 1 (3:30 a.m. Eastern Standard Time). It can be viewed in full here.", "Her exact location is the Royal Lotus Roundabout, around 1.9 miles (3 kilometers) east of the buildings that house the Assembly of the Union, Myanmar's national legislature, in the capital city of Naypyidaw.", "The location can be found on Google Maps here. The following street view photographs, taken in August 2018, approximately replicate the angle from which the video in question was shot and the reverse angle, which shows the portion of the roundabout on which Khing Hnin Wai stood and danced:", "At first glance, the video may have appeared to have been created using a green screen backdrop because of the way in which Khing Hnin Wai's shadow cuts off abruptly, as shown below:", "However, that apparent visual anomaly makes sense once the viewer understands that she was standing on a raised platform with several sets of steps behind her, leading down to the road itself.", "Over the past several months, Khing Hnin Wai has posted multiple videos of herself dancing and exercising in the exact same location, further underscoring the authenticity of the footage posted on Feb. 1:", "In November 2020, she posted an exercise video, this time recorded from the reverse angle, meaning it showed the distinctive lotus sculpture at the center of the Royal Lotus Roundabout, further demonstrating that this was the habitual location for her aerobics videos.", "Khing Hnin Wai posted the video to Facebook on the day of the coup and wrote about it in a way that clearly indicates it was also recorded that day. According to a translation by Agence France Presse, she wrote on Facebook: \"Before I heard the news (of the coup) in the morning, the video I made for the aerobic dance competition has become an unforgettable memory.\"", "Though there is no compelling reason to suggest otherwise, we have not yet been able to verify that the footage was recorded on Feb. 1. If it was, then it's likely the activities shown in the background were indeed related in some way to the coup, which the U.K.'s Channel 4 News reported began with pre-dawn raids.", "However, on Facebook, Khing Hnin Wai herself noted that it isn't unusual for an \"official convoy\" to appear in Naypyidaw, which is the site of virtually all national governmental, military, and diplomatic headquarters of note in the country.", "As a result, we cannot rule out the possibility that the footage — although authentic — was recorded before Feb. 1, and therefore showed activities that were not related to that day's military coup.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]