["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Sen. Cory Booker D-N.J., questions Homeland Security Secretary Kirstjen Nielsen during a hearing before the Senate Judiciary Committee on Capitol Hill, Tuesday, Jan. 16, 2018, in Washington. (AP)", "U.S. Sen. Cory Booker, D-N.J., said in an interview on CNN that President Donald Trump’s reported comments describing Haiti as a \"s---hole\" present a \"moral moment\" for our country and caused pain for Haitians and other minorities.", "Booker then pivoted to talk about minorities being victims of crimes by white nationalist groups:", "\"In American history since 9/11, we've had 85 major attacks in our country, 73 percent of them have been by white nationalist hate groups against minorities, against Muslims, against others,\" Booker said Jan. 16.", "We fact-checked Booker’s numbers and found that he cited a valid government report.  However, he took a statistic in the report and flubbed how it was labeled.", "Booker’s spokesman said he was citing numbers from an April 2017 report by the U.S. Government Accountability Office, \"Countering Violent Terrorism.\"", "The report draws on data from the U.S. Extremist Crime Database that is maintained by the University of Maryland National Consortium for the Study of Terrorism and Responses to Terrorism.", "The GAO report examined terrorist violence from Sept. 12, 2001 -- the day after the 9/11 terror attacks -- through Dec. 31, 2016. It found 85 deadly attacks in the United States by violent extremists.", "Among those incidents, far-right violent extremist groups were responsible for 62 incidents (73 percent) while radical Islamist violent extremists were responsible for 23 incidents (27 percent).", "Booker used the term \"white nationalists,\" but that’s not exactly the same thing as far-right extremist groups.  Far-right extremist groups are motivated by ideologies seeking an idealized future favoring a particular group. They include white supremacists and anti-government militias, among others.", "The GAO report (see page 29) shows that a subset of far-right incidents -- about 38 incidents -- were committed specifically by white supremacists. That means that about 45 percent of the 85 incidents were committed by white supremacists while Booker had said that 73 percent of the incidents were committed by white nationalist hate groups.", "We sent our findings to Booker’s spokesman Jeff Giertz to show that the GAO report showed a smaller percentage committed by white supremacists than the figure cited by Booker.", "Giertz pointed to additional perpetrators who were not identified as white supremacists in the table, but other sources such as news accounts or court records showed they held white supremacist or racist views. For example, the GAO labeled the murderers of minority victims in an Arizona incident as \"far right violent extremists\" but an Arizona Supreme Court ruling stated that they participated in a militia that focused on \"uplifting\" the white race and fostered negative views of minority groups.", "William Parkin, who helps direct the U.S. Extremist Crime Database, said that they break down incidents into categories based on the primary ideological motivation of the act. There could be secondary or mixed motives.", "\"That being said, there is a fluidity between varying far-right extremist ideologies,\" said Parkin, a Seattle University criminal justice assistant professor. \"At the individual level, it would not be uncommon for those who identify as being white supremacists to also be anti-government, and vice versa.\"", "We will note that pinpointing what percent of attacks were committed by any particular label of perpetrator is not an exact science, and that the numbers can change depending upon definitions.", "Another source of data on such attacks is the New America Foundation, which found that about 70 percent of deadly attacks are by people motivated by far right views since Sept. 11. However, that includes individuals motivated by views other than white nationalism including more general anti-government views and anti-abortion views.", "\"Overall, though the definition of the ideologies is a bit too specific in Booker’s comment, it does convey the larger difference in number of deadly attacks from the far right as opposed to other motives though it is important to note that jihadists have killed more people despite carrying out fewer attacks,\" said David Sterman, New America analyst.", "Booker said, \"In American history since 9/11, we've had 85 major attacks in our country, 73 percent of them have been by white nationalist hate groups.\"", "Booker cited a GAO report that analyzed violent incidents. While Booker said that 73 percent were by \"white nationalist hate groups,\" the report said that 73 percent were by a broader category of \"far right wing violent extremist groups.\"", "The same report shows about 45 percent of incidents were committed by white supremacists. The number could rise if we counted additional perpetrators who sympathized with white supremacist ideals but were not labeled as white supremacists by the GAO.", "We rate this claim Half True.", "CNN, Cuomo Prime Time, Jan. 16, 2018", "CNN, \"Booker slams DHS secretary's 'amnesia' on Trump's reported 'shithole' comment,\" Jan. 17, 2018", "U.S. Government Accountability Office, \"Countering violent extremism,\" April 2017", "START, Introducing the United States Extremist Crime Database (ECDB), Nov. 20, 2013", "The Conversation, \"Did far-right extremist violence really spike in 2017?\" Jan. 4, 2018", "New America Foundation, \"What is the threat to the United States today?\" Accessed Jan. 17, 2018", "Columbia Journalism Review, \"The key difference between ‘nationalists’ and ‘supremacists,’\" Aug. 14, 2017", "Washington Post The Fix, \"Is Richard Spencer a white nationalist or a white supremacist? It depends on the news source,\" Oct. 19, 2017", "Findlaw.com, \"STATE of Arizona, Appellee, v. Steve Alan BOGGS, Appellant,\" June 16, 2008", "PolitiFact, \"Who carries out more terror attacks on U.S. soil: Right wing or Islamic extremists?\" Aug. 31, 2017", "PolitiFact, \"A look at the data on domestic terrorism and who’s behind it,\" August 16, 2017", "Interview, David Sterman, New America policy analyst, Jan. 17, 2018", "Interview, Jeff Giertz, US Sen. Cory Booker (D-NJ) spokesman, Jan. 17, 2018", "Interview, Diana Maurer, Director, Homeland Security and Justice Issues at the Government Accountability Office, Jan. 17, 2018", "Interview, Joshua Freilich, creator and co-director of the United States Extremist Crime Database, Jan. 17, 2018", "Interview, William Parkin, Seattle University assistant professor Department of Criminal Justice who also directs the United States Extremist Crime Database, Jan. 17, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]