["About this rating", "On 9 December 2018, BeBest.website published an article reporting that President Trump had instructed his acting secretary of state to nullify any oaths of office that were taken on a Quran:", "President Trump is taking his oath of office very seriously by ensuring that all oaths of office in America are administered legally. According to the White House Director of Information and Propaganda, Art Tubolls, says the problem is widespread:", "“There are people from illegitimate religions popping up all over Congress and at the state level. They want to take their oaths on the Moon God book like Obama did in 2008. The problem is, the Constantinople Clause says that Christianity must be observed for oaths ‘lest they have no meaning.’ This isn’t about church and state. This is about assigning Christian morals and ideals where appropriate in our Christian society. If you can’t take an oath on a bible, you can’t serve this country. Period.”", "This report was not a genuine news story. BeBest.website is part of the \"Last Line of Defense\" network of junk news web sites and does not publish factual stories. The website carries multiple disclaimers labeling its content as satire, such as the site tag line \"information you probably shouldn't trust to be best,\" the article label \"Xenophobic Satire for Geriatric Taters,\" and a definition of the word \"satire\" in the site's footer.", "The text of the article also included a number of red flags. For instance, no position of \"White House Director of Information and Propaganda\" exists in the United States government, nor does a \"Constantinople Clause\" appear in the United States constitution.", "While this article is clearly a bit of fiction, the general idea behind it, that Muslims should be banned from holding government positions, has been argued by real world politicians.   However, Article VI of the constitution explicitly states that \"no religious Test shall ever be required as a Qualification to any Office or public Trust under the United States.\"", "Moreover, as we've noted in previous articles on the subject, religious texts aren't actually required or used during the swearing-in of state legislators and members of the U.S. Congress -- they're merely props utilized in ceremonial photographs taken afterwards.", "Rosefield, Hannah.   \"A Brief History of Oaths and Books.\"\r\n    The New Yorker. 20 June 2014.", "Northwood, Stephanie.   \"Kyrsten Sinema Uses Constitution, Not Bible, To Take Oath of Office.\"\r\n    Mic.   9 January 2013.", "Bromwich, Jonah.   \"You Don’t Need to Take an Oath on a Bible, Or Any Religious Text.\"\r\n    The New York Times.   13 December 2017.", "BeBest.Website.   \"BREAKING: Trump Instructs Acting Secretary of State to Nullify Oaths Taken on Qurans.\"\r\n    9 December 2018.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]