["About this rating", "A photograph shows Alix Idrache, a Haitian immigrant, during his graduation from West Point Military Academy in 2016.", "Some viral versions of Idrache's story contain slightly embellished details.", "A photograph of a West Point cadet with tears streaming down his face is often shared on social media along with an emotional message about the pictured person, a Haitian immigrant named Alix Idrache:", "Here's an example of the text that frequently accompanies this image:", "This West Point graduate is Alex Idrache. He grew up in a slum in Haiti, and he tells the story of how U.S. soldiers were deployed to his neighborhood following the earthquake there several years ago. He says their presence was the first experience of \"hope\" he recalls in his childhood.", "He remembers looking at his dad and asking him who the people were that were helping. His dad looked at him and said, \"They are American soldiers.\" He looked back at his father and said, \"One day, I will be an American soldier.\" His father knew the situation in Haiti was unworkable and tried for several years to obtain a visa to come to the United States. After being denied for several years, he was finally granted a spot in Baltimore. He purchased a ticket on a boat for his family and left Haiti. They arrived and Alex, remembering his dream in the slum several years prior, looked for a way to join the U.S. Army. He found a national guard program that allowed him to join the Army in exchange for citizenship. He didn't hesitate.", "Despite his severe lack of formal education, he graduated as an honor graduate. From a slum in Port au Prince to soldier!", "Although this West Point cadet's name is often misspelled in these viral social media posts (his name is Alix, not Alex), this is a genuine image of Idrache during his graduation from the U.S. Military Academy at West Point, and the accompanying text is generally accurate. While Idrache was truly inspired to join the U.S. military after encountering soldiers in Haiti, the anecdote about Idrache telling his father that \"one day, I will be an American soldier\" appears to be an embellished retelling of this West Point cadet's personal history.", "The above-displayed photograph was taken in May 2016 by Staff Sgt. Vito T. Bryant. The image is available via Defense.gov under the title \"Tears of Joy\" and was originally shared to West Point's Instagram page with the caption: \"No greater feeling than that of accomplishment!\"", "The emotional image struck a chord with social media users and quickly went viral. National outlets such as The Washington Post, Baltimore Sun, Fox News, and CNN all published stories about Idrache in the days after the image's publication. In a since-deleted comment (it appears that Idrache's social media pages are no longer active), Idrache expressed gratitude for the support he received on social media, writing:", "I want to thank everyone for your kind and thoughtful comments on this picture. SSG Bryant captured a moment that I will never forget. At this moment, I was overwhelmed with emotions. Three things came to mind and led to those tears. The first is where I started. I am from Haiti and never did I imagine that such honor would be one day bestowed on me. The second is where I am. Men and women who have preserved the very essence of the human condition stood in that position and took the same oath. Men who preserved the Union is a dark period of this country's history. Men who scaled the face of adversity and liberated Europe from fascism and nazism. Women like CPT Griest, LT Haver, MAJ Jaster who rewrote the narrative and challenged the status quo to prove themselves worthy of being called Rangers. The third is my future. Shortly after leave, I will report to FT. Rucker to start flight school. Knowing that one day I will be a pilot is humbling beyond words. I could not help but be flooded with emotions knowing that I will be leading these men and women who are willing to give their all to preserve what we value as the American way of life. To me, that is the greatest honor. Once again, thank you.", "Idrache talked more about his childhood in Haiti and his inspiration to join the military in an article published on the U.S. Army's official website in May 2016. Idrache said that he was fascinated by the U.S. soldiers (and the technology they used) during humanitarian missions conducted in Haiti during his childhood.", "Sgt. Ryan Noyes writes:", "In seven years [Idrache] went from speaking basic English in a working class neighborhood in Port-au-Prince to graduating from one of the most prestigious military and educational institutions in the United States.", "In his youth, Idrache witnessed U.S. forces conducting humanitarian missions in Haiti. Always fascinated with cutting edge technology and military hardware sported by U.S. forces, he remarked that it was the Chinook that blew his mind. In Haiti, becoming a pilot can seem an outlandish dream.", "\"People where I'm from don't grow up to be pilots right? Like they don't dream of flying a helicopter, that's not something you do,\" added Alix. \"You don't just say I'm going to be a pilot and make it happen. There're no aviation, there're no helicopters, no flight schools. There're none of that.\"", "[...]", "He recalled the first time he filled out branch preferences, \"I asked myself what is one thing I could never be if I didn't come to West Point-and that's a pilot.\"", "We have not been able to find any record of the conversation between Idrache and his father included in the viral Facebook posts, but the West Point graduate did credit his father for helping him on his journey:", "It's a story that's almost too good to be true. How did he achieve a congressional appointment, or learn English, or enlist in the military practically before his bags were unpacked in 2009. What drove him into West Point, and what drove him to the top of his class?", "Alix credited his father, Dieujuste, for playing the primary role in his academic success. To care for his own family, Dieujuste dropped out of school at 14, leaving his countryside home to find work in Port-au-Prince, and, like any parent, the father of this young lieutenant wanted his children to have the opportunities that he didn't.", "\"My dad always said, 'education is the only gift I can always give you, because I don't have any anything material to give.'\"", "And so it goes that a young Alix Idrache, would spend his teenage years as a book worm, driven by a father's encouragement to use education and high marks as a ticket to a better life.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]