["“The question of Almajiris’ lack of primary or basic education are all local government problems.”", "“When this administration came in, Boko Haram was holding 17 local governments in the northeast... they are not holding any local government now.”", "“Nigeria earned US$383 billion from oil revenues in the four years preceding our government [but] there were no savings.”", "“Every country in the world that wants to undergo serious development borrows money. Our debt-to-GDP ratio of about 20% is one of the lowest in the world.”", "“We have 21 million unemployed young men and women.”", "“...We have not had it so bad in this country.”", "“Capital expenditure in 2016 was N1.2 trillion and 2017 was N1.5 trillion.”", "“We now have 90 million people living in extreme poverty.”", "Please complete this form to receive the HTML sharing code.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "For democracy to function, public figures need to be held to account for what they say. The claims they make need to be checked, openly and impartially. Africa Check is an independent, non-partisan organisation which assesses claims made in the public arena using journalistic skills and evidence drawn from the latest online tools, readers, public sources and experts, sorting fact from fiction and publishing the results.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "© 2023 - Africa Check - All rights reserved.", "We will never charge you for verified, reliable information. Help us keep it that way by supporting our work.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "Support independent fact-checking in Africa."]