["About this rating", "On 7 December 2016, conspiracy web site SuperStation95 published a post reporting that 86-year-old astronaut Buzz Aldrin (who had just been evacuated from the South Pole due to health concerns) had mysteriously and alarmingly tweeted a photograph of a mountain along with a chilling comment:", "His words: \"We are all in danger. It is evil itself.\" and showed a photograph of a pyramid located at the South Pole as show here.", "Mr. Aldrin seems to be referring to this object, as seen in an serial photo from Google Earth ... As has been reported by worldwide media, US Secretary of State John Kerry recently traveled to the South Pole, allegedly to become better informed about \"Climate Change.\" Kerry was the highest ranking US government official ever to visit the South Pole, and his visit struck many as unusual. Few saw any purpose whatsoever to sending America's top Diplomat to the farthest reaches of the earth to see ... ice.", "Now, with Buzz Aldrin's tweet, and its strange deletion, folks are wondering if sending America's top Diplomat to no-man's land, perhaps had something to do with Diplomacy after all. Is there some entity there with which we need Diplomatic contact? ... If so, why did Buzz Aldrin warn that we are all in danger? Why did he call it \"Evil itself?\"", "The blog post, which was a pparently inspired by a 6 December 2016 thread on the conspiracy forum  Before It's News, cited two tweets as a first and second source for the photograph. One included an embedded video which referenced the SuperStation95 post as its source, making it useless as supporting confirmation:", "What did Buzz Aldrin mean and WHY did he delete this tweet?", "\"We are all in danger. It is evil itself.” pic.twitter.com/tYb9IFCfZk", "— slone (@slone) December 7, 2016", "Buzz Aldrin Warns \"it is evil itself\"https://t.co/i0mqoHnh5y", "— Christopher Horn (@NightHorn) December 9, 2016", "Images of the purported tweet circulated widely after 7 December 2016, but there were a number of visual cues the graphic was altered:", "For contrast, here's a screenshot taken of a then-recent tweet sent via Aldrin's @TheRealBuzz account:", "The first tweet did not have a date, share count, number of replies, number of favorites, or number of retweets; all could be used to determine whether Twitter's archive backed the claims made by the sites. Additional irregularities existed in the background display of Aldrin's account: The suspect tweet didn't display in the same manner it did in our screenshot. Aldrin's account data was oddly arranged, and his blue verification checkmark was missing.", "SuperStation95 did not provide a date, time, or sturdy source for the screenshot of the tweet. Using Twitter's \"advanced search\" tool, we were able to determine that no retweets or \"modified tweets\" (a form of copying and pasting a retweet) existed anywhere on Twitter. The first verbal mention of the purported tweet appeared on 8 December 2016, one day after the blog post linked above.", "It wasn't just skeptics questioning the authenticity of the claim. YouTube's SecureTeam (the  self-described \"number one source for breaking news and exposure of the alien phenomenon\") examined the claim, quickly dismissing it as a forgery:", "After appearing in late 2015, Superstation95 began using what were often legitimate tragedies or unfortunate events (such as Buzz Aldrin's evacuation from Antarctica in December 2016) with falsified and often frightening details. Among the most prominent were claims that a large group of Muslim men had fired randomly upon campers and hikers in California, Fukushima radiation caused severe mutations in ocean-dwelling creatures, cargo ships mysteriously ground to a halt signaling nothing short of an imminent global economic catastrophe, a deadly Las Vegas strip car crash involved a driver shouting \"Allahu Akbar,\" the San Bernardino shooting was provoked by pork served at a holiday party shortly before the massacre, the Earth's \"magnetosphere\" inexplicably collapsed for two hours, a (nonexistent) suicide note left by a genuinely deceased ICE agent revealed impending FEMA camp implementation and mass enslavement, and that articles about the Orlando shooting appeared on Google News hours before the attack. Although the pieces sometimes contained details of real-life events, the claims were always willfully distorted to peddle a false and upsetting conclusion.", "Superstation95's opportunistic leveraging of tragedy has never borne out as the real thing, despite the innumerable grandiose claims made since the site's inception. However, despite them, no one has yet gone to FEMA camp, the global economy has not melted down, the magnetosphere caused no space-based catastrophes, and no hikers were reported injured or dead as a result of roving Muslim shooters.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]