["The image was shared here on Facebook on May 25, 2020, alongside another image of what appears to show baby bats on a leaf.", "The Indonesian-language post translates to English as: “Please allow me to share info .. One family in India died, ate using a banana leaf contaminated by a bat virus, be careful now it’s a trend to eat together by putting dishes and rice on a banana leaf, ... it's good to wash the banana leaf with clean water then burn it on the fire to kill the bacteria that exist before use it..\n\tJust info”.", "The novel coronavirus, which causes the disease COVID-19, is believed to have originated in bats, according to a study by Hong Kong microbiologists. Bats are also recognized as a reservoir host of several other viruses that can infect humans, including rabies, Nipah and Hendra viruses, according to this medical journal article published on the US National Library of Medicine’s website.", "The two photos were also shared more than 6,500 times after they were posted alongside similar claims on Facebook here, here, here and here.", "The claim, however, is false.", "A reverse image and keyword searches on Google found a similar picture was published in this report by Deccan Herald, an English-language Indian newspaper, published on September 18, 2017.", "The article's headline reads: “Six members of a family die in suicide pact.”", "The first two paragraphs of the report read: “Six members of a family including two women and two children committed suicide in Mamillagadda of Suryapet town in Telangana by consuming pesticide.", "“According to Suryapet police, the family resorted to the extreme step after moneylenders started pestering them for the money lent to their elder son Suresh. Suresh who ran an unsuccessful computer hardware business has disappeared a week ago unable to repay the hefty loans.”", "Mamillagadda is an area in the town of Suryapet, in Telangana state, southern India.", "Below is a screenshot comparison of the first picture in the misleading post (L) and the Deccan Herald’s photo (R):", "The Hindu also published another similar photo in this article on September 19, 2017, headlined: “Six of family commit suicide.”", "The second photo in the misleading posts was published in a print titled “Peters Tent-making Bats roosting Costa Rica”, sold here at posterazzi.com, a US-based website which sells posters and prints online.", "Below is a screenshot comparison of the second image in the misleading post (L) and the fine art print at posterazzi.com (R):", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]