["A video of a group of men in red-white uniforms dumping products into a truck is viral on social media. It is being claimed that Kuwaitis are throwing away these products in the light of calls for a boycott of French products by several Muslim-majority countries.", "Facebook page ‘S D VIDEO Production Youtube කුවේට්’ has posted the video with the same claim. At the time of writing this article, it has been viewed more than 12,000 times. (archive link)", "කුවේට් සියළුම ප්‍රංශ නිෂ්පාදන කුණු කසළ බවට විසිකර දමයි.👌 Kuwait Put All France Products In Garbage👌", "කුවේට් සියළුම ප්‍රංශ නිෂ්පාදන කුණු කසළ බවට විසිකර දමයි.👌", "Kuwait Put All France Products In Garbage👌", "Posted by S D VIDEO Production Youtube කුවේට් on Tuesday, 3 November 2020", "A post by Facebook page फ़ेसबुक पेज ‘কেনে চলর By-FarHan’ had garnered close to 73,000 views before it was deleted. The video is viral on Twitter and Facebook.", "Alt News performed a reverse search on one of the keyframes of the video extracted with the help of digital verification tool InVid and found that the video is from Saudi Arabia’s Al Ahsa municipality. A report by Arabic website Al Marsd published on May 14, 2020 included this video. According to the report, the Ministry of Trade destroyed large quantities of cheese spoilt due to poor storage. The Ministry also denied the rumours circulating at the time that these products contained carcinogenic substances.", "Saudi Arabian media portal Anti Rumor Authority had also put out a tweet debunking this rumour. The Twitter bio of Anti Rumor Authority says that it is a network “to address rumours and contain them so that they do not constitute harm to society.”", "مايتداول عن مصادرة منتجات إماراتية من الأجبان في السعودية غير مطابقة للمواصفات ومسرطنة غير صحيح, والفيديو الحقيقي لمصادرة وإتلاف منتجات اجبان بسبب ظهور علامات التلف بسبب سوء التخزين كما أكدت ذلك وزارة التجارة.https://t.co/51W1OcObWq#تأكد_لوطنك pic.twitter.com/X8yFRA2S5D", "— هيئة مكافحة الإشاعات (@No_Rumors) May 14, 2020", "UAE’s English newspaper Gulf News reported, “Abdul Rahman Mohammed Al Hussain, official spokesperson of the Ministry of Commerce and Investment and General Supervisor of Marketing and Communication, said competent authorities confiscated and destroyed 1,628 rotten cheese products in Al Ahsa, the largest governorate in the kingdom’s eastern region.”", "Donate Now", "Kinjal Parmar holds a Bachelor of Science in Microbiology. However, her keen interest in journalism, drove her to pursue journalism from the Indian Institute of Mass Communication. At Alt News since 2019, she focuses on authentication of information which includes visual verification, media misreports, examining mis/disinformation across social media. She is the lead video producer at Alt News and manages social media accounts for the organization.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]