["When former Rhode Island Gov. Lincoln Chafee announced he was joining the 2016 Democratic primary race, some people scratched their heads when he said switching to the metric system would be one of his goals as president.", "Of the world’s major countries, only the United States, Liberia and Myanmar don’t use metric units as their primary measurement systems. Instead, America uses U.S. customary units. CNN anchor Dana Bash asked Chafee about his desire to have the country use meters instead of feet and kilometers instead of miles in a June 7 interview.", "Noting that he lived in Canada while they converted to the metric system in the 1970s, Chafee said this discussion has been going on for a while in the United States.", "\"I know many in the scientific community, the health care community that deal internationally, the business community, are saying this is way overdue,\" he said. \"(Former President) Ronald Reagan talked about it. Others have talked about it.\"", "It’s amazing how often politicians use Reagan’s name as a way to advance their cause. In this case, we wondered if Chafee’s claim measures up.", "Falling short", "In 1975, Former President Gerald Ford signed the Metric Conversion Act, which created the United States Metric Board, charged with leading the planning and educational efforts for switching over to the metric system. (Check out this delightful cartoon about converting to the metric system from 1975.)", "So when Reagan took office in 1981, a government-backed push for metric conversion -- also known as metrication -- was already well underway. However, the Metric Board had limited effectiveness in that there was no mandatory conversion timeline, and the board included some members who actually opposed conversion.", "In 1982, Reagan effectively dismantled the metrication effort by stripping funding from the Metric Board. The group morphed into the Office of Metric Programs, under the Department of Commerce, with much less responsibility and less than a fifth of the budget.", "That year’s federal budget also cut a $2 million Department of Education program for metric education, according to the New York Times.", "The Reagan administration justified the Metric Board cut as part of a general reduction in federal spending, rather than opposition to conversion -- preferring to leave conversion to the private sector. Reagan’s budget proposal said, \"The board has accomplished its mission to familiarize the public with the metric system. Voluntary metrication will continue through market adjustments.''", "The U.S. Metric Association, a current group dedicated to metric conversion, dug into this issue with Reagan Library materials. They found more than one piece of correspondence indicating that Reagan’s action against the Metric Board did \"not imply a lack of support for voluntary metrication.\"", "It’s worth noting that Frank Mankiewicz, a former Democratic strategist and National Public Radio president, took at least partial credit for killing the Metric Board -- having convinced a top Reagan adviser that metrication could damage the country.", "We looked through newspaper archives with LexisNexis and found that for nearly the rest of the Reagan administration, there was very little talk of metric conversion, at least in Washington. (Other than in 1985, when the U.S. ambassador to Canada resigned in part because he called the Canadian metrication process \"rubbish.\")", "But in 1988, his last year in office, Reagan signed into law an omnibus trade bill that included a slight amendment to the 1975 Metric Conversion Act. Tucked into the 1,000-page bill was a declaration that the metric system was \"the preferred system of weights and measures for United States trade and commerce\" and called for federal agencies to switch to the metric system wherever practical by 1992.", "While supporters of metrication saw this as a win because it had a timeline for implementation and a directive for federal agencies, unlike the earlier legislation, some believed the bill was without teeth because it allowed agencies an economic out from conversion, according to news reports from the time.", "It’s unclear how much influence Reagan had over this amendment to the Metric Conversion Act because it went over with little fanfare, and we were unable to track down any relevant White House statement.", "Reagan’s successor, President George H.W. Bush, further solidified that directive with an executive order in 1991.", "All in all, the Reagan administration seemed ambivalent toward metrication, at best.", "Today, not all, but many federal agencies -- including the military -- use metric units almost exclusively, according to a statement from the National Institute of Standards and Technology.", "Many metric experts estimate that the United States is 50 percent metric, said U.S. Metric Association President Don Hillger, a meteorologist at Colorado State University. While most Americans use customary units in their homes, those in science and heavy industry typically use the metric system.", "He added that there is no longer a standard yard or pound because U.S. customary units are defined by their metric equivalents.", "\"So we really are on the metric standard in the U.S.,\" Hillger said. \"It’s just that we continue to use non-metric units that no other major country uses anymore.\"", "Our ruling", "Chafee said, \"Reagan talked about\" converting to the metric system.", "The issue of metrication rose at the very beginning and at the very end of Reagan’s presidency. However, Chafee’s statement implies that Reagan had more than a passing interest in the issue, but that doesn’t seem to be the case.", "The metrication process started before Reagan took office. He slowed the process to a standstill by taking away funding. He was silent on the issue for the next six years until he signed a law that directed federal agencies to make a more concerted effort to transition to metric units when practical -- though it’s unclear how much influence Reagan’s White House had on that tiny aspect of a 1,000-page omnibus bill.", "Without this additional context, Chafee’s claim is off by a few yards. Or meters. We rate the claim Half True.", "CNN, State of the Union, June 7, 2015", "U.S. Metric Association, \"Executive Order 12770,\" Dec. 6, 2005", "USMA, \"History of The United States Metric Board,\" June 11, 2013", "USMA, \"Metric Conversion Act of 1975,\" Dec. 28, 2009", "USMA, Metric Today, Vol. 45, September 2010", "Metrication Matters, \"A chronological history of the modern metric system,\" 2008", "National Institute of Standards and Technology, Supporting American Choices on Measurement, 2013", "Washington Post, \"Nofziger: A Friend With Whom It Was a Pleasure to Disagree,\" March 29, 2006", "Associated Press, \"Push for Conversion to Metrics Fades,\" Aug. 14, 1982", "Associated Press, \"Movement To Metric Slow, But Steady,\" Dec. 26, 1985", "Associated Press, \"Obscure Clause In Trade Bill Aims To Make America 'Measure Up,’\" Aug. 24, 1988", "New York Times, \"Experts to Study Crawl Toward Metric System,\" April 25, 1983", "LexisNexis archive search, conducted June 7, 2015", "Bloomsbury Publishing, Whatever Happened to the Metric System?: How America Kept Its Feet, August 2014", "Email interview, USMA President Don Hillger, June 7, 2015", "Email interview, Chafee spokeswoman Debbie Rich, June 7, 2015", "Email interview, University of Georgia history professor Stephen Mihm, June 7, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]