["About this rating", "Lyft announced free rides for \"underserved communities\" to be distributed via certain non-profit partners. Uber offered $14 off a round-trip to and from the polling station via one of its non-profit partners, and $10 off a one-way trip to the polling station for other users, discounts that would constitute a cost-free journey if the value of the journey was lower than the discount.", "Neither company offered entirely free rides in a wholesale, blanketed way. Lyft only committed to offering free rides to \"underserved communities\" with 50 percent discounts for other voters. The discount offered by Uber would not amount to a free ride if the cost of the journey exceeded the value of the discount.", "Voter turnout, voter suppression, and voter fraud became the subjects of intensified scrutiny, debate, and speculation in the autumn of 2018, as the 6 November midterm elections drew nearer.", "Against this background, many activists and social media users endeavored to share helpful information with their fellow citizens, including advice about voter registration, casting a provisional ballot, and getting to their local polling places.", "In the final days of October, Facebook users shared a boilerplate message that asserted the popular transportation companies Uber and Lyft were offering voters \"free rides\" to polling stations around the country: \"Please spread the word that both Uber and Lyft offer free rides to polling places on Nov 6th.\"", "Such viral posts were accompanied by multiple news reports, some of which declared in their headlines that the companies would be offering \"free rides,\" while others stipulated that \"free or discounted rides\" were on offer, alluding to the more complicated reality of the situation.", "'Terms and conditions apply'", "It's true that Lyft has announced a plan to offer free rides to polling places, but not to anyone and everyone who wants one. In a 23 August press release, Lyft stated that they would be working with certain voter registration non-profits to arrange free transportation \"for underserved communities,\" while they would work with other groups to distribute 50 percent discount codes to other would-be voters:", "Across the country, we’ll give away 50% off promo codes with our partners that encourage voter turnout. We’re thrilled to be working with Vote.org, Nonprofit Vote, TurboVote and more to help distribute codes to those who need them. We’ll also have a product integration to help passengers find their polling location.", "For underserved communities, we’ll provide rides free of cost through nonpartisan, nonprofit partners, including Voto Latino, local Urban League affiliates, and the National Federation of the Blind.", "We asked Lyft for details on how its plan would work, how would-be voters could go about obtaining a free or discounted ride, how the company and its respective partners would determine which voters qualify for a free or discounted ride, and whether the initiative also applied to early voting. Lyft did not respond to our questions.", "For their part, Uber has also not maintained they would be offering \"free rides\" in an indiscriminate way, although their initial announcement about their election initiative perhaps lacked specificity in that respect. In a 4 October press release, the company announced that: \"To help the millions of Americans who cite transportation barriers as the reason they don’t vote, we’ll be partnering with #VoteTogether and Democracy Works to provide free rides to the polls.\"", "In an update on 24 October, Uber provided further information on the initiative, and a spokesperson for the company confirmed to us the following details:", "These discounts will undoubtedly be very helpful and convenient for many users of the Uber app, and if the cost of a journey is lower than the value of the discount, many voters will end up paying nothing for their Uber trips to polling stations and in effect enjoy :free rides.\"", "However, it's clear that the claim made in the viral Facebook post, that \"Uber and Lyft offer free rides to polling places on Nov 6th\" was a significant oversimplification of what each company was actually offering, and the conditions and requirements associated with those offers.", "KYW-TV.   \"Uber, Lyft Offering Free Rides to the Polls on Election Day.\"\r\n    KYW-TV.   15 October 2018.", "Dobush, Grace.   \"Uber Joins Lyft in Giving Free Rides to the Polls on Election Day.\"\r\n    Fortune.   5 October 2018.", "Grothaus, Michael.   \"Uber and Lyft Are Offering Free Rides to the Polls on Election Day.\"\r\n    Fast Company.   5 October 2018.", "Allen, Taylor.   \"Lyft, Uber Offers Discounted or Free Rides to Get to Polls on Election Day.\"\r\n    WHYY-TV.   11 October 2018.", "Barden, David.   \"Uber and Lyft Plan to Offer Free and Discounted Rides on Election Day.\"\r\n    The Huffington Post.   15 October 2018.", "Lyft.   \"The Ride to Vote: Use Lyft to Exercise Your Rights.\"\r\n    23 August 2018.", "Khosrowshahi, Dara.   \"Uber Drives the Vote.\"\r\n    Uber.  4 October 2018.", "Burr, Danielle.   \"Update on Uber Drives the Vote.\"\r\n    Uber.   24 October 2018.", "Hegeman, Roxana.   \"Iconic Dodge City Moves Its Only Polling Place Outside Town.\"\r\n    Associated Press.   18 October 2018.", "Cruz, Caitlin.   \"Voting for Dodge City, Kansas Residents Will Be Easier Thanks to Lyft & Voto Latino.\"\r\n    Bustle.   22 October 2018.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]