["The claim was published on Facebook here on June 21, 2020.", "The Urdu-language post translates to English as: “Breaking news: Pakistan cricket national team fast bowler Mohammad Irfan died after a brief illness. He was suffering from stomach infection. PCB confirmed.”", "The same claim was also made on Facebook here and on Twitter here.", "The claim is false.", "“I haven't died,” Irfan told AFP by phone on June 21.", "In a tweet posted on the same day, Irfan also urged social media users to stop spreading “baseless fake news” about his death.", "“This has disturbed my family & friends beyond words, and I have been receiving endless calls on this. Please refrain from such things. There was no accident and we are well,” he added on Twitter.", "Some social media outlets have been spreading a baseless fake news about my death in a car accident. This has disturbed my family & friends beyond words, and I have been receiving endless calls on this. Please refrain from such things. There was no accident and we are well.", "AFP also reported on the death hoax here.", "Rumours of Irfan’s death circulated after the Pakistan Cricket Board (PCB) announced the death of a former deaf national cricketer by the same name. The PCB announced the passing of the other Mohammad Irfan on Twitter here on June 21.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]