["The image was published on July 2, 2019, in this Facebook post where it has been shared more than 1,800 times.", "Below is a screenshot of the misleading Facebook post:", "The Indonesian-language text in the white box below the cartoon translates to English as: “A caricature in French media about Indonesia’s 2019 presidential election, which took the lives of 700 polling officers.”", "Hundreds of polling officers in Indonesia died after the country’s parliamentary and presidential elections on April 17, 2019. Incumbent Joko Widodo won the presidential vote.", "Out of six million election workers, a total of 486 Indonesian polling officers died after Indonesia’s presidential election on April 17, 2019, according to a General Elections Commission (KPU) tally on May 16, 2019.", "The KPU statement was included in this report published on May 16, 2019 by Indonesian news site Kompas.", "The cartoon has been shared on Facebook here, here and here alongside a similar claim.", "The claim is false; the image was created by a Syrian cartoonist Ali Ferzat, also known as Ali Farzat, who is critical of the Syrian regime and other Arab dictatorships.", "A reverse image search on Google found the image published on his official website here, indexed under “Arab regimes”.", "The cartoon was also published in this profile of the cartoonist by Danish news outlet Information on December 10, 2012.", "The headline states: “If there is anything dictators fear, it is being ridiculed.”", "The image was also published in this photo gallery of Ferzat’s work by Sky News Arabia on April 11, 2012.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]