["On March 10, West Bengal Chief Minister Mamata Banerjee suffered injuries to her left leg while campaigning in Nandigram and was rushed to Kolkata for treatment. CM Banerjee said that she was pushed by four or five people while BJP leader Arjun Singh claimed she is lying for sympathy. On March 12, she left the hospital in a wheelchair.", "Several Twitter users have posted an image of CM Banerjee walking away from a wheelchair thus, insinuating she faked her injury.", "The image was shared with English (“From Plaster to Bandage to Walking. What a Actor.!!!”), Hindi (“और इसतरह शाम होते होते मोमता ताई व्हीलचेयर से उठकर चल पडी।संघी भक्तों का खौफ़।”) and Telugu (“#బెంగాల్‌లో మిరాకిల్.. ఉన్నట్టుండి వీల్ ఛైర్‌లోంచి లేచిన మమతా బెనర్జీ..”) captions.", "This slideshow requires JavaScript.", "The viral photograph has been manufactured using CM Banerjee’s 2012 image available on Reuters blog. According to the photo credits, it was clicked by B Mathur on June 13, 2012. This was superimposed on CM Banerjee’s recent photograph in a wheelchair published in Hindustan Times on March 14.", "The collage below shows the two images used to create the morphed image.", "On March 14, ABP News reported that Chief Minister Mamata Banerjee begun her padayatra in a wheelchair. The video can be watched below.", "“The Election Commission has concluded on Sunday [March 14] that the incident in Nandigram which caused injuries to West Bengal chief minister Mamata Banerjee was an accident and not a planned attack, according to sources in the poll body,” reported The Wire.", "Shortly after West Bengal Chief Minister Mamata Banerjee suffered a leg injury, a morphed image was shared on social media with the false claim that she got up from her wheelchair and walked after her hospital release.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]