["About this rating", "Some social media users have claimed U.S. Rep. Elijah Cummings was in Italy in late July 2019, dining at a fancy restaurant in Venice with other lawmakers. The claim went viral even though it's untrue — the following tweet and others like it remaineded live on Twitter despite spreading misinformation:", "Here’s Nancy Pelosi, the Squad and Elijah Cummings (just out of the picture) having an extremely expensive lunch at the renowned Harry Cipriani in Venice, right near their 5 star hotel, while their constituents are living in squalor. Inequality??: pic.twitter.com/0hpGG4YoHO", "— MARK SIMONE (@MarkSimoneNY) July 29, 2019", "Cummings, a Democratic congressman who chairs the House Oversight Committee and has long represented Baltimore, was indeed \"out of the picture\" -- because he was thousands of miles away from Italy.", "Pelosi's office released a list of 13 members of Congress who accompanied her on the trip, which was described as a delegation to visit the U.S. Army Africa headquarters in Italy, and then to Ghana to meet Ghanian President Nana Akufo-Addo and Ghana's speaker of Parliament Mike Oquaye, among others. The American legislators also planned to \"pay respects at Cape Coast and Elmina Castles and the 'Door of No Return,' to observe the 400th Anniversary of the First Enslaved Africans Landing in America.\"", "The legislators who accompanied Pelosi included \"Majority Whip James Clyburn, Chairwoman of the Congressional Black Caucus Karen Bass, Co-Chair of the Democratic Steering and Policy Committee Congresswoman Barbara Lee and icon of the Congress, John Lewis.\" The list did not include Cummings.", "Cummings has been the target of ongoing attacks from U.S. President Donald Trump and his supporters, which began when Trump angrily reacted to Cummings' criticism of his administration's treatment of migrant children in U.S.-Mexico border-detention facilities. Trump took to Twitter to attack the district Cummings represents, which includes Baltimore:", ".... As proven last week during a Congressional tour, the Border is clean, efficient & well run, just very crowded. Cumming District is a disgusting, rat and rodent infested mess. If he spent more time in Baltimore, maybe he could help clean up this very dangerous & filthy place", "— Donald J. Trump (@realDonaldTrump) July 27, 2019", "The false rumor that Cummings was in Italy along with other Democratic leaders was spread by a number of social media users with large followings, including Matt Gaetz, a Republican member of Congress from Florida:", "Honest question the media should ask @SpeakerPelosi & @RepCummings - Did you have a fake impeachment presser and then fly off to Venice?\ncc: @juliegraceb @mkraju @DailyCaller @brookefoxnews @npfandos @jeremyherb", "— Matt Gaetz (@mattgaetz) July 27, 2019", "This isn't the first time Gaetz spread misinformation online. In October 2018, he helped launch a false, anti-Semitic rumor that billionaire philanthropist George Soros had paid Central American migrants to travel in a caravan to the U.S. That rumor spread widely, and shortly afterwards, Soros received a bomb in his mailbox. No one was injured in the incident.", "Cummings was not traveling with Speaker Pelosi's delegation to Italy and Ghana in late July 2019, so we rate this claim \"false.\"", "Associated Press.   \"Rep. Cummings Not on Trip to Italy.\"\r\n    31 July 2019.", "Speaker.gov.   \"Pelosi Leads Delegation to Ghana and U.S. Army Africa Headquarters.\"\r\n    26 July 2019.", "Rothschild, Mike.   \"No, Ilhan Omar, Nancy Pelosi, And El Chapo’s Wife Aren’t Conspiring in Italy.\"\r\n    The Daily Dot.   31 July 2019.", "Rashbaum, William K. et al.   \"Explosive Device Is Found in Mailbox at Soros’s Home in N.Y. Suburb.\"\r\n    The New York Times.   22 October 2018.", "McCoy, Kevin.   \"Pipe Bomb Suspect Cesar Sayoc Expected to Plead Guilty in Spree Aimed at Trump Critics, Including Obama, Biden and Clinton.\"\r\n    USA Today.   16 March 2019.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]