["About this rating", "In early 2018, far right web sites turned their attention to a years-old episode of a long-running German soap opera, claiming that a conversation about Islam between a fictional woman and her son was evidence that the government of German Chancellor Angela Merkel was using propaganda to persuade Germans to convert to Islam, or accept Islam within German society.", "The show caused a quite a stir in those circles. \"Germany is brainwashing children to become Muslim for more than a decade,\" read a headline of one such article, on the Voice of Europe web site. \"German state TV is working to prepare the German people for their future,\" wrote Robert Spencer for Jihad Watch. The Vlad Tepes blog wondered aloud whether the scene constituted \"brutal German state propaganda to encourage children to be Muslims.\"", "Paul Joseph Watson, editor-at-large for the conspiracy theorist web site Infowars, incorrectly placed the soap opera episode as taking place after Germany's 2017 federal elections in a YouTube video. And on 12 January 2018, the right-wing German web site Politikstube sparked the wave of interest in the video clip, writing: \"Unbelievable what force-fed television brings about: 'From today on we call God Allah.'\"", "It was immediately picked up and augmented with heavily charged and offensive commentary by Politikstube. The subtitles in this video are accurate, apart from the offensive translation of the Shahada (the declaration of Muslim faith), which is recited in Arabic and means \"There is no God but God. Mohammed is the messenger of God\":", "The source of all this concern is a scene from Episode 1084 of the highly popular and long-running weekly soap opera Lindenstrasse, which is broadcast by Germany's main publicly owned television channel Das Erste, roughly equivalent to the UK's BBC One channel.", "In the episode, entitled \"Islam,\" Lisa Hoffmeister is engaged to be married to her Turkish fiancé Murat Dagdelen, who is a secular, moderate Muslim. Convinced that she must convert to Islam in order to be accepted by Murat's family, Lisa has done some research and sits down to explain what she understands to be the nature of Islam and conversion to her son, whom she had during a previous relationship. During the scene, Lisa performs the Shahada and encourages her son to pray to Allah and \"follow his rules.\"", "We discussed the episode with Michael Meisheit, a screenwriter and novelist who wrote for Lindenstrasse for 20 years, and who scripted the episode in question.", "Speaking to us by Skype from his home in Berlin, Meisheit told us that Lisa has a \"long history of really problematic issues\" in the show. As a child, she was abused and neglected, spent time in an orphanage, and once even killed someone in self-defense. Though not a villain, she is, in the writer's words, \"the girl who's always doing strange stuff\" and doesn't have a firm grasp on social boundaries.", "Along the way, she meets Murat Dagdelen, a Turkish man who is the first character to truly love and accept her. In response, Lisa becomes \"over-engaged\" in trying to \"fit in\" with Murat and his family, who are Muslim, albeit to varying degrees of devoutness. Meisheit told us that Murat is not a particularly committed Muslim, but Lisa is convinced that before marrying him, she herself must become a Muslim, in order to fit in with his family.", "In Episode 1084, Lisa suggests to Murat that she accompany him to the mosque, which he himself does not regularly attend. Confused, Murat tells Lisa \"But you're not even Muslim.\"", "\"That's all that is needed to trigger that kind of character,\" Meisheit says. \"'Why am I not a Muslim? How hard can that be?' Then she looks it up on the internet, and the result is that scene [the conversation with her son.]\"", "In response to Lisa's zealousness, those around her (including Murat and his family) tell her to \"take it slow\" and ease off in her conversion to Islam. \"If you criticize this scene alone,\" Meisheit says, \"you're taking it very much out of context. You could very well say the opposite about that scene.\"", "So rather than being \"propaganda\" designed to \"brainwash\" German children and adults to convert to Islam, the subplot of Lisa's conversion to Islam and the scene showing her conversation with her son were deliberately written to show someone with a history of personal problems overdoing her conversion to Islam in an unnecessary and somewhat desperate effort to \"fit in\" with her fiancé's family, who love her anyway.", "Meisheit says he deliberately wrote the scene \"to show she is overreacting for personal reasons, not religious reasons,\" and that this behavior is \"very typical for that character.\"", "In later episodes, Lisa takes to wearing a Muslim headscarf, but ultimately relents in her zealousness after Murat's aunt — who is a secular Muslim like Murat himself — takes her aside and tells her that her efforts are appreciated but unnecessary, and that Murat's family loves and accepts her as she is.", "When the episode first aired in Germany in 2006, there was no public outcry or negative reaction, Meisheit told us. As the person who wrote the episode, and the scene involving Lisa's son, he says he finds the uproar, a full twelve years later, to be \"bizarre, knowing what the scene really was.\" He added:", "For me it's a textbook example of taking something out of context.", "The accusation of \"brainwashing\" by the German state is also unfounded in a second important way. Lindenstrasse is shot and produced in Cologne by Westdeutscher Rundfunk (WRD), one of several regional public television channels that form the ARD consortium, which broadcasts content on a national level on Das Erste — Germany's biggest publicly-owned national television channel.", "So it is true to say that Lindenstrasse is both made and shown by a public broadcaster. However, the German federal government does not control the content of the show. This was confirmed to us by WDR's Goetz Schmedes, the commissioning editor of Lindenstrasse.", "The characters, plots and story arcs are all created by the show's writers and producers, Meisheit told us. When he wrote Episode 1084, including the conversation between Lisa and her son, he did so without interference from executives at WRD or ARD, or from the German government. \"Nobody told me to do that,\" he said.", "The claim that the scene constitutes pro-Islam propaganda on the part of the German government is false on two grounds. Firstly, because the scene was deliberately written to demonstrate a character's troubling overzealousness in matters of the heart, something that critics at Jihad Watch, Voice of Europe and elsewhere, failed to grasp. Secondly, it is false because the German government does not have that kind of power or influence over the content of a soap opera, even one on a publicly-owned television channel.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]