["The image was shared in this post on Facebook on July 24, 2018. The post has been shared more than 700 times.", "Below is a screenshot of the misleading post:", "The caption states: \"Major General Fatima Hemminger, commander of the Twelfth Air Force, United States Air Force. Fatima is the first female commander of the Twelfth Air Force, which is an air combat wing of the branch. She is also the first Muslim major general in the USAF, as well as the highest ranking hijabi Muslim within the Air Force.\"", "The same image was shared here and here on Facebook with a similar claim.", "It was also shared here and here on Twitter with a similar claim, and here on Instagram.", "The claim is false; the image has been doctored from an original photo of a different woman, who is a US Air Force major general.", "A reverse image search on Google found the original photo published here on the United States Air Force website.", "Below is a screenshot of the original photo:", "The caption of the photo states: “Maj. Gen. Linda S. Hemminger met with female leaders in Omaha at the Ten Dinner Aug. 14 in the Patriot's Club at Offutt Air Force Base, Neb. General Hemminger is mobilization assistant to the deputy surgeon general of the Air Force. (U.S. Air Force photo/Lance Cheung)”.", "Linda Hemminger was a Major General in the United States Air Force and retired on June 15, 2009, according to this biography published on the US Air Force database.", "A keyword search for ‘Fatima Hemminger’ on the US Air Force website here only shows results for Linda Hemminger.", "According to US Air Force website here, Major General Andrew Croft is currently the commander of the US Air Force Twelfth Air Force unit.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]