["“Chinese army is now helping Myanmar Coup Military in Myanmar,” reads a tweet posted on February 26, 2021. “We don’t want chinese military here”.", "The tweet features photos of men in military uniform with red badges on their sleeves, which have been circled.", "A fourth picture shows a similar-looking red badge on a web page purporting to show Chinese army badges.", "Myanmar's military has sought to quash a mass uprising that was triggered after it seized power on February 1, 2021, AFP has reported here.", "At least 38 people died on March 3, according to the United Nations, in the deadliest day of the junta's crackdown against demonstrators.", "The photos circulated widely on social media, including on Facebook here and here; on Twitter here and here; and on discussion forums here and here.", "However, the claim is false.", "A digital investigation by AFP found that the soldiers' badges in the photos are not Chinese, but in fact represent Myanmar’s military, the Tatmadaw Armoured Operation Command, according to Enacademic encyclopedia.", "The shape of the Tatmadaw Armoured Operation Command badge can be seen in the photo magnified below by AFP.", "The same badge can be found here in an article about a meeting of senior Burmese military officials on May 31, 2018.", "Scholars in Myanmar also pointed out that the photos showed Burmese military badges rather than Chinese ones.", "Fact check: Chinese soldiers have NOT been spotted in Yangon. These badges are from the Tatmadaw’s Armoured Operation Command, which deploys tanks and armored personnel carriers. Please do not spread unverified rumors pic.twitter.com/VE7oL0RMLz", "Furthermore, a keyword search on Google found the red and yellow badge purporting to represent the Chinese army is in fact a South Sudanese military badge.", "The badge can be seen in various photos of South Sudanese military officials, including in this AFP photo, this report from Sudans Post and this photo from Reuters news agency.", "The badge can also be found on this encyclopedia of military insignia.", "Below is a screenshot comparison of the Burmese military badge (L) and South Sudanese military badge (R):", "Chinese military insignia are actually green with a red five-pointed star and a golden wheat symbol, according to the official website of the Chinese People’s Liberation Army.", "The same badge can be identified in these two AFP archive photos here and here.", "There have been no credible reports of Chinese military drafted to help the junta in Myanmar after the February coup.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]