["Donald Trump’s first TV ad of the general election depicts Hillary Clinton’s immigration plan as dangerous for America.", "\"In Hillary Clinton’s America, the system stays rigged against Americans. Syrian refugees flood in. Illegal immigrants convicted of committing crimes get to stay,\" states the ad. \"Collecting Social Security benefits, skipping the line. Our border open. It’s more of the same, but worse. Donald Trump’s America is secure. Terrorists and dangerous criminals: kept out. The border: secured. Our families: safe. Change that makes America safe again.\"", "The narration is accompanied by sinister music and footage of men being apprehended by border agents while other shadowy men walk freely on public streets.", "We have previously fact-checked Trump’s claim that Clinton wants \"totally open borders\" and ruled that False. He is correct that she wants to allow more Syrian refugees in the United States.", "This fact-check will focus on whether Clinton supports allowing illegal immigrants convicted of crimes to stay in the country.", "There is some truth to his claim, but Trump’s scary ad omits an important part of the story.", "Clinton’s immigration plan: Deport violent criminals", "Clinton has not vowed to deport every undocumented immigrant convicted of a crime. But the ad creates a misleading impression that she will let every criminal stay, regardless of the crime.", "Clinton has repeatedly called for focusing deportations on violent criminals.", "Clinton campaign spokesman Joshua Schwerin pointed to Clinton’s comments about her deportation priorities in a March debate in Miami, the National Immigrant Integration Conference and on her website.", "When pressed to explain her position during the debate, Clinton said she wants to limit deportations to \"violent criminals, terrorists, and anyone who threatens our safety.\"", "Clinton has proposed being more lenient than Obama:", "\"So I do not have the same policy as the current administration does. I think it's important that we move to our comprehensive immigration reform, but at the same time, stop the raids, stop the round-ups, stop the deporting of people who are living here doing their lives, doing their jobs, and that's my priority.\"", "She said violent criminals and those who plan terrorist attacks or threaten us are \"a relatively small universe.\"", "We asked for more details about the types of crimes that would be included on her deportation list and did not get a reply from the campaign.", "But it’s fair to read into her statements that some criminals who committed lower-level crimes would be allowed to stay. That approach is similar to the current policy under the Obama administration. In 2014, a memo from the Homeland Security Department stated that the government would focus first on threats to national security, border security and public safety, including those involved or suspected of terrorism or felons. The second level of priority was for undocumented immigrants convicted of three or more misdemeanors (not including minor traffic offenses).", "That policy means that an estimated 87 percent of the undocumented population is not a priority for enforcement, according to the Migration Policy Institute, a think tank that examines immigration trends.", "\"We do not know enough details about Mrs. Clinton’s plans to characterize who would get to stay or would be a priority for removal,\" said Michelle Mittelstadt, spokeswoman for the institute.", "Alex Nowrasteh, an immigration expert at the libertarian Cato Institute, said it’s clear that Clinton favors legalization for many undocumented immigrants but not for violent offenders.", "\"Looking at Hillary’s statements, it’s clear that Trump’s ad is misleading,\" he said. \"Many, but not all, unlawful immigrants committed criminal offenses, but they are usually not violent or property crimes. Instead those were crimes in the immigration statutes.\"", "The Trump campaign provided PolitiFact with information related to additional positions Clinton has taken that relate to undocumented immigrants who have committed crimes:", "2013 immigration bill: Clinton supported the immigration bill that passed the Senate but never reached a vote in the House. The bill said that undocumented immigrants could apply for Registered Provisional Immigrant (RPI) status, which allowed them to stay in the country if they met certain criteria including that they had not been convicted of a felony or three or more misdemeanors. This fits in with Clinton’s plan to focus on violent criminals.", "Sanctuary cities: These policies generally refer to places where local law enforcement officers aren’t required to alert federal authorities to residents who may be in the country illegally. During her first race for president, Clinton said she would not crack down on sanctuary cities and argued that without such policies, people will hide from police and not report crimes. But Clinton doesn’t appear to want sanctuary cities to protect suspected murderers. In 2015, Clinton criticized the city of San Francisco for releasing a man from jail who later was charged with murdering a woman and had previously been deported many times. However, her campaign reiterated Clinton’s view that she believes sanctuary cities can help further public safety.", "Trump’s campaign also noted that thousands of undocumented immigrants who have been ordered removed and have criminal convictions remain in the country under Obama. We don’t know how the pace of criminal removals would differ under Clinton if she were elected.", "But the fact that Clinton has criticized the Obama administration for deportation has raised concerns among those who want to see stricter enforcement.", "\"She has promised to expand upon Obama’s immigration policies,\" said David Ray, spokesman for the Federation for American Immigration Reform, which promotes more restrictive immigration laws.", "Our ruling", "Trump says \"In Hillary Clinton’s America ... illegal immigrants convicted of committing crimes get to stay.\"", "The tone of the ad is to scare voters into thinking that Clinton would welcome convicted criminals to remain in the country illegally, and that’s an exaggeration.", "Clinton has said that she will deport \"violent criminals\" as well as anyone who threatens our safety. She hasn’t been more specific about the types of crimes that would or would not lead to deportation.", "We rate this claim Half True.", "National Border Patrol Union, Statement on Hillary Clinton’s immigration policies, July 28, 2016", "Congress.gov, S. 744, 2013", "Numbers USA, \"Law Officers Write Congress To Warn Gang Of 8 Legislation Will Endanger Public Safety,\" May 9, 2013", "Migration Policy Institute, \"Understanding the Potential Impact of Executive Action on Immigration Enforcement,\" July 2015", "Washington Post/Univision, Transcript of Miami debate annotated, March 9, 2016", "Hillary Clinton, Speech, Jan. 31, 2016", "Hillary Clinton, Website, Accessed Aug. 19, 2016", "Center for Immigration Studies, \"The Non-Departed: 925,000 Aliens Ordered Removed Are Still Here,\" June 30, 2016", "U.S. Department of Homeland Security, Memo, Nov. 20, 2014", "U.S. Immigration and Customs Enforcement, \"ICE enforcement and removal operations,\" Dec. 22, 2015", "NBC, \"Clinton Campaign: Sanctuary Cities Can Help Public Safety,\" July 9, 2015", "Washington Times, \"Number of sanctuary cities grows to 340; thousands of illegals released to commit new crimes,\" Oct. 8, 2015", "Washington Post The Fact Checker, \"Trump’s false claim that undocumented immigrants collect Social Security benefits,\" Aug. 20, 2016", "Miami Herald Naked Politics blog, \"Donald Trump's first TV ad in Florida focuses on immigration,\" Aug. 19, 2016", "PolitiFact, \"Donald Trump says Hillary Clinton would create 'totally open borders,'\" June 23, 2016", "PolitiFact, \"Donald Trump says Hillary Clinton wants to let 500 percent more Syrians into the U.S.,\" June 13, 2016", "PolitiFact, \"Trump: Nearly '180,000 illegal immigrants' have criminal records but haven't been deported,\" July 22, 2016", "Washington Post The Plum Line, \"Trump’s new ad inadvertently reveals the core absurdity of his whole campaign,\" Aug. 19, 2016", "Donald Trump campaign press releases", "Interview, Josh Schwerin, Hillary Clinton campaign spokesman, Aug. 19, 2016", "Interview, Alex Nowrasteh, immigration policy analyst Cato Institute, Aug. 22, 2016", "Interview, Michelle Mittelstadt, Migration Policy Institute spokeswoman, Aug. 22, 2016", "Interview, David Ray, spokesman for the Federation for American Immigration Reform, Aug. 22, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]