["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A man receives the first round of the Pfizer COVID vaccination in Mississippi. (AP Photo/Rogelio V. Solis)", "The committee overseeing Wisconsin’s vaccine rollout on Jan. 12, 2021 in a draft document initially recommended a plan that would deliver vaccine shots to people 70 and older regardless of their occupation or health condition in the next phase -- 1B-- of distribution.", "The second phase plan also included teachers and child care providers, firefighters and police officers, health care workers who don't treat COVID-19 patients and mink farmers due to the high risk of COVID-19 outbreaks among mink.", "The panel also recommended including people in shared housing facilities, like prisons — sparking outrage among some Republican lawmakers.", "On Jan. 19, 2021, the state Department of Health Services in a news release announced those 65 and older would be eligible for COVID-19 vaccinations.", "The vaccine committee did not send its recommendations for the next group to be eligible to DHS, which included congregate living settings and incarcerated individuals, until Jan. 21, 2021.", "People age 65 and up are now receiving vaccinations. Incarcerated persons will not be eligible for vaccination until March 1", "The distribution of coronavirus vaccines in Wisconsin has been fraught with concerns about why the state started off lagging its peers and over just who was at the front of the vaccination line.", "And who was second. And third.", "Now that the dust has cleared a bit, we wanted to go back and examine what was a common theme, especially among Republicans. That is, that prison inmates should not be near the top of the list.", "For instance, on Jan. 12, 2021, when a document containing recommendations from a state committee was released, state Rep. Mark Born, R-Beaver Dam, tweeted:", "\"The committee that advises @GovEvers and his department tasked with leading during this pandemic is recommending allowing prisoners to receive the vaccine before 65 year old grandma?\"", "Is it true that a state committee recommended providing inmates with COVID-19 vaccines ahead of the state’s elderly?", "At issue here is where various groups fall on the priority list for the distribution of limited COVID vaccines. It’s up to each state to establish its own list, though most started with front-line health care workers and nursing home residents.", "Republicans pushed a bill that would make the vaccine available to anyone in the state that wants it by mid-March and bar Gov. Tony Evers and his administration from prioritizing prisoners in any way as they set priorities.", "Health officials say there are many reasons for putting inmates near the top of the list, including the fact prisons have been the site of deadly outbreaks and because the state -- and its taxpayers -- have a legal obligation to assure inmates receive adequate health care. If they do not, taxpayers could be on the hook for lawsuits over unfair or inadequate treatment.", "In any case, in Wisconsin, the committee group charged with providing advice on the vaccine priority list is the Vaccine Distribution Subcommittee of the Wisconsin State Disaster Medical Advisory Committee.", "Its aim is to provide the best advice from a medical perspective, not taking into account political considerations. Its advice is also just that -- advice. The group does not have the final say in the matter. The panel collects public input on who should be prioritized in the rollout, and gives recommendations to the state Department of Health Services on how to manage each phase of the distribution.", "When asked to provide backup for Born’s claim, his office pointed to a document released by the advisory committee on Jan. 12, 2021 -- the same day of the tweet.", "That document noted: \"Current supplies of vaccine limit the ability to provide vaccine to all who wish to be vaccinated; therefore, rationing of available vaccine will be necessary until production and distribution increases to amounts sufficient to meet all needs.\"", "At the time, the group was looking past health-care personnel and residents of long-term care facilities -- Priority 1A -- and was offering guidance for the next group, Priority 1B.", "The group recommended vaccines be available for anyone 70 or older, noting \"the evidence of deaths in that group in Wisconsin, where 71% of deaths and hospitalization are in those 70 and above.\"", "It also called for including staff and residents in what are termed \"congregate living facilities.\" That category includes homeless shelters, group homes and -- yes -- correctional facilities.", "It should be noted, the recommendation was not simply to immunize inmates in the 1B group, but also correctional workers, since the virus can be passed between individuals, and even move into a prison from the community via staff members coming to work.", "This is a good place to pause and note two things:", "First, our ratings are based on the information known at the time. It’s impossible for people to predict the future and, indeed, things changed after the recommendation was made. Ultimately, the state reduced the age guidelines for the general population in group 1B to 65 and older.", "Second, it was subtle, but Born’s tweet mentioned two groups: Not only the advisory committee, but the \"department tasked with leading during this pandemic.\" That would be the Department of Health Services. The tweet said both were recommending inmates come before \"65 year old Grandma.\"", "That’s where the claim runs into a problem.", "First, the document produced by the advisory committee -- and provided to us by Born’s office as backup -- includes this label: \"Draft -- for discussion only.\"", "While the committee was recommending that \"congregate facilities\" be included in Priority 1B, as the Milwaukee Journal Sentinel reported on Jan. 14, 2021, but according to Department of Health Services spokeswoman Elizabeth Goodsitt, the panel did not submit its recommendations to the department until Jan. 21, and they were not accepted until Jan. 25.", "\"You’ll also note the eligibility groups are listed in priority order— congregate living settings are the last eligibility group listed for priority group 1B, after education and childcare, public facing essential workers, among others,\" Goodsitt wrote in an email to PolitiFact Wisconsin.", "Another piece of information arguing against the idea the department itself backed the inmates-before-Grandma approach, is that on Jan. 19, DHS announced those 65 and older -- not 70 and older as the panel suggested -- would be eligible for vaccinations starting Jan. 25.", "What’s more, even now, a month later, congregate living facilities are not yet eligible.", "The next phase, which includes teachers, grocers, and anyone living in shared housing such as prisons, among other groups, is to begin March 1.", "Born tweeted \"The committee that advises @GovEvers and his department tasked with leading during this pandemic is recommending allowing prisoners to receive the vaccine before 65 year old grandma?\"", "The panel did draw its line for Phase 1B at 70 year olds and included those in \"congregate living facilities\" -- a group that includes prison inmates. But the recommendations were not sent to the full department until days later. By that time, the department had lowered the age threshold to 65, and started that group before prisons.", "It’s unclear if blowback to the idea of inmates-before-Grandma prompted the department to take a different approach, as Republicans argue. But it is clear the department had not taken a public position at the time.", "Our definition of Half True is \"The statement is partially accurate but leaves out important details or takes things out of context.\"", "That fits here.", "PolitiFact Wisconsin, Milwaukee Journal Sentinel, \"Yes, Wisconsin vaccine rollout among slowest in Midwest,\" Jan. 20, 2021.", "Wisconsin Department of Health Services \"Department of Health Services announces police and fire are eligible for COVID-19 vaccine,\" Jan. 11, 2021.", "Milwaukee Journal Sentinel \"Wisconsin moves to top of nation in daily COVID-19 vaccinations as plans for community clinics ramp up,\" Feb. 8, 2021", "Twitter, state Rep. Mark Born, Jan, 12, 2021.", "Milwaukee Journal Sentinel, \"Wisconsin residents 65 and older could be in next phase of COVID-19 vaccinations,\" Jan. 14, 2021.", "Milwaukee Journal Sentinel, \"Republicans propose making vaccine available to everyone by mid-March, bar prioritizing prisoners,\" Jan. 21, 2021.", "Milwaukee Journal Sentinel, \"Wisconsin has decided who’s next in line for the COVID-19 vaccine -- but they may have to wait till March because of low supply,\" Jan 26, 2021.", "Email, Elizabeth Goodsitt, Wisconsin Department of Health Services, Feb. 2, 2021, Feb. 4, 2021, Feb. 5, 2021.", "Email exchange, Rep. Born’s staff, Jan. 22, 2021 and Feb. 4, 2021", "Wisconsin Department of Health Services \"Department of Health Services announces police and fire are eligible for COVID-19 vaccine,\" Jan. 11, 2021.", "Milwaukee Journal Sentinel \"Wisconsin moves to top of nation in daily COVID-19 vaccinations as plans for community clinics ramp up,\" Feb. 8, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]