["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "When it comes to protecting the middle class, U.S. Rep. Steve Rothman makes it sound like U.S. Rep. Bill Pascrell isn’t the fighter he claims to be.\n\nAs the two Democrats prepare to face off in the June 5 primary to represent a newly drawn congressional district in northern New Jersey, Rothman criticized Pascrell in a recent YouTube video for voting \"to eliminate all estate taxes for billionaires.\"\n\n\"The people of the district really are looking for a progressive Democrat, and they’re looking for somebody who will fight for them,\" said Rothman, speaking from the Plaza Diner in Bergen County during the video posted April 18 by NorthJersey.com.\n\n\"So when people in the middle class wanted their representative to fight for them and not give away the store to the super rich in America, Bill Pascrell voted to eliminate all estate taxes for billionaires, and I voted no.\"\n\nPolitiFact New Jersey found that Rothman’s claim does not have much truth behind it, and it’s deeply misleading.\n\nPascrell voted in June 2000 for a bill to gradually repeal the federal estate tax. But after President Bill Clinton vetoed the legislation, the congressman reversed his position and rejected the bill about three months later.\n\nPascrell also opposed subsequent efforts to eliminate the estate tax on at least seven occasions during the administration of President George W. Bush. The estate tax is levied against the transfer of wealth following a person’s death.\n\nPaul Swibinski, a senior advisor to the Rothman campaign, argued the claim is accurate: \"The fact that Bill Pascrell flip flopped and voted both for and against eliminating the estate tax proves that he is not a consistent, reliable supporter of progressive issues.\"\n\nFirst, let’s explain Pascrell’s yes vote in 2000.\n\nIn June 2000, Pascrell voted in favor of the Death Tax Elimination Act of 2000, which would have repealed the estate tax by Jan. 1, 2010. Rothman voted against the bill.\n\nThe House failed to override Clinton’s veto in September 2000, when Pascrell and Rothman both voted against the bill and overriding the president’s veto.\n\nPascrell spokesman Sean Darcy told us the congressman originally supported the estate tax repeal in 2000 because at that time, the tax \"put an undue burden on middle class taxpayers like small business owners.\" At the time of the override vote, Pascrell noted on the House floor that Clinton would work out a solution to ease the burden on the middle class, Darcy said in an e-mail.\n\nDarcy added: \"True to form, while Bill Pascrell has been fighting for middle class taxpayers on the Ways and Means Committee and the floor of the House, Steve Rothman was nowhere to be found.\"\n\nFrom that point on, the two congressmen continued to oppose estate tax repeal efforts.\n\nIn April 2001, Pascrell and Rothman voted against the Death Tax Elimination Act of 2001, a measure to gradually repeal the estate tax. Provisions of that bill were included in the Economic Growth and Tax Relief Reconciliation Act of 2001, which Pascrell and Rothman opposed in May 2001.\n\nSigned into law in June 2001, that legislation repealed the estate tax for individuals who die in 2010, and then reinstated it in 2011.\n\nOn at least five occasions between 2002 and 2007, the two congressmen voted against permanently repealing the estate tax.\n\nThe existing regulations were part of a tax cut deal reached in late 2010 by President Barack Obama and Congress, with Pascrell’s and Rothman’s support.\n\nOur ruling\n\nIn a video posted April 18 on YouTube, Rothman claimed \"Bill Pascrell voted to eliminate all estate taxes for billionaires, and I voted no.\"\n\nPascrell did vote in June 2000 for a bill to gradually repeal the estate tax, but after Clinton vetoed the legislation, the congressman reversed his position and rejected the bill in September 2000. In subsequent years, Pascrell voted against repealing the estate tax on at least seven occasions.\n\nSince Rothman’s claim \"ignores critical facts that would give a different impression,\" his statement is Mostly False.", "To comment on this ruling, go to NJ.com.", "Fighting on the home front for Congress, a video posted on YouTube on April 18, 2012\n\nWashington Post News Service, Clinton Wins Battle To Keep Estate Tax; House GOP Fails To Override Veto Of Repeal Bill, Sept. 8, 2000\n\nKnight Ridder, Lawmakers who changed votes on estate taxes, Sept. 8, 2000\n\nThe Record, GOP, Green Candidates Brand Pascrell As Evasive, Sept. 21, 2000\n\nThe Star-Ledger, How They Voted, June 25, 2006\n\nThe Star-Ledger, How They Voted, Oct. 14, 2007\n\nCNN, Obama slams GOP, calls tax deal politically realistic, Dec. 7, 2010\n\nCongressman Bill Pascrell’s website, Rep. Pascrell Calls On Republicans In Congress To Stand For More Than The Nation’s Wealthiest Taxpayers, Dec. 14, 2010\n\nTHOMAS, Library of Congress, accessed April 24-27, 2012\n\nMSNBC, House votes to end estate tax permanently, April 13, 2005\n\nInternal Revenue Service, The Estate Tax: Ninety Years and Counting, accessed April 24, 2012\n\nCongressional Research Service, An Overview of Tax Provisions Expiring in 2012, April 17, 2012\n\nCongressional Research Service, Federal Estate, Gift, and Generation-skipping Taxes: A Description of Current Law, Jan. 29, 2003\n\nInternal Revenue Service, Introduction to Estate and Gift Taxes, October 2011\n\nJoint Committee on Taxation, Technical Explanation of the Revenue Provisions Contained in the \"Tax Relief, Unemployment Insurance Reauthorization, and Job Creation Act of 2010\" Scheduled for Consideration by the United States Senate, Dec. 10, 2010\n\nJoint Committee on Taxation, Technical Explanation Of The \"Tax Relief Guarantee Act Of 2002,\" An Amendment In The Nature Of A Substitute To H.R.586, April 17, 2002\n\nE-mail interview with Paul Swibinski, a senior advisor to Congressman Steve Rothman’s campaign, April 24 and 26, 2012\n\nE-mail interview with Sean Darcy, spokesman for Congressman Bill Pascrell’s campaign, April 26-27, 2012", "Internal Revenue Service, Frequently Asked Questions on New Tax Rules for Executors, accessed April 27, 2012\n\nThe Tax Policy Briefing Book, Wealth Transfer Taxes, accessed April 27, 2012", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]