["The video was published in a Facebook post here on November 1, 2019.", "It has been viewed more than one million times.", "The one-minute footage shows a group of people playing musical instruments in front of a crowd on a street.", "Below is a screenshot of the misleading post:", "The Indonesian-language post’s caption translates to English as: “Mashallah...in Germany, which is a country in Europe, they show respect during the time of adhan...in Indonesia during the time of adhan, we still play music or watch TV with loud sound in shopping malls or at home...it is sad.”", "“Mashallah” is an Arabic phrase which means this is what God wills. It is also used to express praise.", "“Adhan” refers to the Islamic call to prayer recited five times a day at the beginning of the five daily hours of prayer.", "The video was also shared here on Facebook and here on YouTube with a similar claim.", "The footage was also uploaded with a similar claim in Malaysian language here, here and here, where it has been shared more than 13,000 times.", "The same video was also uploaded here on YouTube alongside an Indonesian-language claim that it happened in the United States.", "All claims are false; the video shows a French band pausing its performance in the Turkish city of Istanbul after hearing a call to prayer from a nearby mosque.", "The video in the misleading posts contains a watermark logo for Turkish newspaper Yeni Safak. Keywords searches for the original video on the newspaper’s website found this August 9, 2019, video headlined: “French Musician pause performance to honour Muslim call to prayer in Istanbul.”", "The caption of the one-minute video reads: “A French music band consisting of 18-members, Poil O’Brass Band’, stopped playing music after hearing the Islamic call to prayer (Adhan) in Istanbul.”", "Poil O’Brass Band is a French music band. Here is its official website and here is its Twitter account.", "Below is a screenshot of the video on Yeni Safak’s website:", "Yeni Safak’s Twitter account also uploaded the original video here on August 9, 2019.", "Paris'ten gelen 18 kişilik 'Poil O'Brass Band' adlı sokak müziği grubu, İstiklal Caddesi'nde müzikseverlerin karşısına çıktı. Caddeden geçen vatandaşların ilgiyle dinlediği grup, ezan okunmaya başlayınca performansına ara verdi. https://t.co/z7kLE9pkGt pic.twitter.com/xGcYxiO4eo", "The Turkish-language tweet translates to English as: “18 people from French street music band ‘Poil O’Brass Band’, plays in front of music lovers in Istiklal Street. Citizens who passed by the street happily listened to the group. When the adhan started, the performance was given a break.”", "Below is a screenshot comparison of the video in the misleading post (L) and the video published on Yeni Safak’s website (R):", "The video was filmed on Istiklal Street, Istanbul. It corresponds with this location on Google Street View.", "At the 34 second mark of the video, the camera moved to this angle of the street.", "Below is a screenshot comparison of the video in the misleading posts from that particular angle (L) and a scene from Google Street View (R); AFP has circled the corresponding features in red.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]