["About this rating", "In June 2020, some social media users attempted to exaggerate the extent of property damage that occurred during nationwide protests against police brutality and racial injustice by sharing an image that supposedly showed graffiti on the statue of U.S. President Abraham Lincoln at the Lincoln Memorial:", "This not a genuine photograph and turns out to be a poorly manipulated image that was apparently created to cast protesters in a negative light.", "The above-displayed image has been circulating on social media since at least June 5, 2020. However, photographs from Getty Images and The Associated Press show that this statue was not damaged or grafittied during these protests.", "Below is a photograph of the Lincoln Memorial taken on June 6. While it would be hypothetically possible for the statue to be cleaned in a day (if, that is, it was ever defaced in the first place), the above-displayed image claims that the head of the statue was damaged. As we can see in the following photograph, that simply isn't the case:", "WASHINGTON, DC - JUNE 06: Jim McComb wear a \"Make Racism Wrong Again\" hat while visiting the Lincoln Memorial during a protest against police brutality and racism on June 6, 2020 in Washington, DC. This is the 12th day of protests with people descending on the city to peacefully demonstrate in the wake of the death of George Floyd, a black man who was killed in police custody in Minneapolis on May 25. (Photo by Win McNamee/Getty Images)", "While the top image is undoubtedly fake, there were some instances of monuments or statues being graffitied during these protests. The National Park Service sent out a series of images supposedly showing this damage:", "In fact, the picture on the top left of the National Park Service's tweet does show graffiti (\"yall not tired yet\") on the steps leading up to the Lincoln Memorial. But this marking was quickly cleaned up by federal workers, according to The Blaze, and in the following days, the Lincoln Memorial was heavily protected by members of the National Guard.", "For comparison's sake, here's a fake photograph circulating on social media purporting to show the damage done by protesters (left), and a genuine marking left on the steps of the Lincoln Memorial after a protest (right):", "Dumas, Breck.   \"Troops Guard Lincoln Memorial from Further Vandalism Amid Riots.\"\r\n    The Blaze.   31 May 2020.", "LeBlanc, Paul.   \"Famed DC Monuments Defaced After Night of Unrest.\"\r\n    CNN.   31 May 2020.", "Gearty, Robert.   \"Vandals Target Historic Monuments Amid George Floyd Protests.\"\r\n    Fox News.   7 June 2020.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]