["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "If Newark Mayor Cory Booker declines to run for the state’s highest office, a former state legislator predicts a decisive -- possibly even historic -- re-election victory for Gov. Chris Christie \n\nRaymond Bateman, a former Republican state senator and assemblyman who lost a bid for governor in 1977, said in a recent column that Booker seems like the only Democrat capable of foiling Christie’s prospects for a second term.\n\n\"Unless Booker gets into the race, 2013 reminds me of 1985. That was the year Tom Kean made history with the largest-ever New Jersey gubernatorial victory,\" Bateman wrote in a Nov. 23 column published in The Asbury Park Press. \"Kean, who barely won (by 1,797 votes) in 1981, destroyed his 1985 opponent, Peter Shapiro, winning by a majority of more than 750,000 votes, the largest winning margin for a gubernatorial candidate in Jersey history.\" \n\n\"In any case,\" Bateman wrote later in his column, \"2013 should see a political barn-burning election in New Jersey that I believe will produce a Kean-like victory for Christie if, in fact, he runs.\"\n\nThis week Christie announced he will seek a second term. Potential Democratic rivals -- including Booker -- have not formally declared their intentions. \n\nThe outcome of any matchup wouldn’t be determined until next year, but until then PolitiFact New Jersey wondered whether Bateman’s comparison was rooted in fact. Did Kean, a Republican, rebound from a close election to a historically decisive re-election bid?\n\nThe data -- whether it’s broken down by total votes or percentages -- shows that’s true.\n\nMore than 1.37 million New Jerseyans cast their vote for Kean that year, while Shapiro, the Democratic candidate and a former Essex County executive, won about 578,000 votes.\n\nSo Kean won by more than 790,000 votes, according to election data published in the state’s legislative manual. \n\nNo other governor in New Jersey’s history has won election by a larger margin. \n\nIn all, Kean won more than 69 percent of the vote, carrying every one of New Jersey’s 21 counties and all but three municipalities.\n\nIt’s worth noting that  Kean’s sweeping victory came four years after he narrowly won office. In 1981 Kean defeated Democrat Jim Florio by fewer than 1,800 votes, which represented less than one twelfth of one percent of the total vote.\n\nNo other gubernatorial race was closer as a percentage of the total vote, though in 1880 the Democratic candidate won by only 651 votes. That accounted for about one-quarter of one percent of the total vote. \n\nOur ruling\n\nBateman said that in the 1985 general election Kean had \"the largest winning margin for a gubernatorial candidate in Jersey history.\"\n\nKean trounced his opponent that year. \n\nThe former Republican governor won more than 1.37 million votes, compared with the roughly 578,000 ballots cast for his Democratic rival. \n\nThat means Kean won by more than 790,000 votes. That’s the largest margin of victory for a gubernatorial election in New Jersey’s history.\n\nWe rate this statement True. \n\nTo comment on this ruling, go to NJ.com.", "The Asbury Park Press, BATEMAN: Can anyone beat Christie?, Nov. 23, 2012\n\nInterview with Raymond Bateman, Nov. 27, 2012\n\nFitzgerald’s Legislative Manual. State of New Jersey: 2011, pgs. 520-523\n\nFitzgerald’s Legislative Manual. State of New Jersey: 1986, pgs. 450-456\n\nNew Jersey Division of Elections, NJ Election Information and Results Archive, accessed Nov. 26, 2012\n\nThe Star-Ledger, Cory Booker says Gov. Christie's bid for re-election has no bearing on decision to run, Nov. 27, 2012\n\nThe Star-Ledger, Gov. Christie files papers to seek re-election next year, Nov. 26, 2012", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]