["About this rating", "In December 2020, some social media users encountered a message claiming that Cadbury was giving away hampers (or baskets) filled with chocolate to celebrate its 70th anniversary. This was not a genuine message from the famous confectionary company, however. It was just another social media scam.", "Here's an example of one such message that circulated on WhatsApp:", "A similar scam circulated on Facebook. That message claimed that everyone who shared and commented on the post would get a \"Cadbury Hamper delivered to their door\" in celebration of the company's 126th anniversary.", "This type of scam is common on social media. Users are asked to share and comment on the content in order to ensure that it gets spread to as many people as possible, and then users are asked to provide personal information, such as email addresses or even credit card numbers, under the guise of completing a \"survey\" or some other questionnaire.", "We've had many occasions to alert readers to this kind of fraud:", "These types of viral “coupon” scams often involve websites and social media pages set up to mimic those of legitimate companies. Users who respond to those fake offers are required to share a website link or social media post in order to spread the scam more widely and lure in additional victims. Then those users are presented with a “survey” that extracts personal information such as email addresses, telephone numbers, dates of birth, and even sometimes credit card numbers. Finally, those who want to claim their “free” gift cards or coupons eventually learn they must first sign up to purchase a number of costly goods, services, or subscriptions.", "This Cadbury scam has been circulating in various forms on social media since at least 2018. The company addressed these fraudulent posts in a November 2020 message on Facebook:", "We’ve been made aware of a circulating post on social media, claiming to offer consumers a hamper of free Cadbury products. We can confirm that this has not been generated by us & would urge you to not interact or share personal information through the post. Your security is our priority & we’re working with the relevant organisations to ensure this is resolved.", "The Better Business Bureau offers consumers several general tips to avoid getting scammed:", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]