["About this rating", "A story from 1995 resurfaced around Veterans Day 2019, reporting that then-private citizen and real estate mogul Donald Trump had \"saved\" the Veterans Day parade that year in New York City when organizers ran out of money.", "On Nov. 6, 2019, for example, the Daily Caller News Foundation website published a story bearing the headline, \"The 1995 NYC Veterans Day Parade Had $1.21 In The Bank. Then Donald Trump Stepped In.\" A meme circulating on Facebook similarly described Trump's intervention:\nThis claim apparently originated with Trump himself, or at least it was touted on his campaign website in the lead-up to the 2016 presidential election. The website at the time stated:", "Mr. Trump has long been a devoted supporter of veteran causes. In 1995, the fiftieth anniversary of World War II, only 100 spectators watched New York City’s Veteran Day Parade. It was an insult to all veterans. Approached by Mayor Rudy Giuliani and the chief of New York City’s FBI office, Mr. Trump agreed to lead as Grand Marshall a second parade later that year. Mr. Trump made a $1 million matching donation to finance the Nation’s Day Parade. On Saturday, November 11th, over 1.4 million watched as Mr. Trump marched down Fifth Avenue with more than 25,000 veterans, some dressed in their vintage uniforms. A month later, Mr. Trump was honored in the Pentagon during a lunch with the Secretary of Defense and the entire Joint Chiefs of Staff.", "First off, Trump's website contained some confusing pieces of misinformation: The Veterans Day parade in New York City went by the name the \"Nation's Parade.\" The poorly attended parade \"with only 100 spectators\" occurred in 1994, not 1995 (The New York Times reported police did not give a crowd estimate). Only one Veteran's Day parade took place in the city in 1995 — the Nation's Parade on Nov. 11. That event was slated by the U.S. Defense Department as representing \"the official close of the 50th anniversary of World War II.\"", "We contacted the United War Veterans of New York (UWNY), which organized the Nation's Parade in 1995, to ask about claims that Trump's intervention saved the event from cancellation, and we were referred by spokesman Pat Smith to a Nov. 10, 1995, New York Times article about the event. Smith told us that Trump did make a financial contribution toward the parade, but also said UWNY is a small, volunteer-staffed group that doesn't keep records that could answer questions in detail about an event that occurred more than two decades ago.", "The 1995 Times article reported that Trump did make a financial contribution, but that he tried to make it in exchange for being named the parade's grand marshal even though he is not a veteran. The Times reported Trump gave $200,000, not $1 million:", "By mid-August, organizers had a bank account of exactly $1.21. A request to airlines to donate blankets for aging veterans was turned down because logos might not be visible on television. Then Donald Trump, a nonveteran, agreed to throw in $200,000 as well as raise money from his friends, in exchange for being named grand marshal.", "Since then, money has come in, though not enough to meet the original budget, which was reduced from $2.9 million to $2.4 million. Fireworks were just one of many cuts.", "In May 2016, CNN spoke to Vincent McGowan, the president emeritus of UWNY who organized the parade in 1995. McGowan said that Trump's contribution was \"somewhere between $325,000 and $375,000,\" but McGowan also said Trump's donation did save the event. McGowan also said Trump was never the grand marshal because that honor was only given to military veterans.", "In a follow-up story, the Times in 1995 reported that organizers had agreed to make Trump the parade's grand marshal, a move that had angered some veterans, while others expressed appreciation for his \"crucial\" financial assistance:", "Also in the reviewing stand was the developer Donald Trump, who provided the only note of controversy in an otherwise positive day. Many veterans were angry that organizers had agreed to name Mr. Trump, who is not a veteran, as grand marshal in exchange for his contribution of $200,000 and help in raising additional funds.", "Another story, dated Nov. 11, 1995, from the news service UPI, reported that Trump contributed $200,000 and raised another $300,000 for the parade, which was viewed by parade Director Tom Fox as having been key:", "Police estimated 500,000 people attended the largest military parade ever held in New York. Organizers, who placed the turnout at closer to a million, said the parade would not have been a success if it hadn't been for real estate developer Donald Trump, who contributed $200,000 and raised another $300,000.", "\"Donald Trump saved the parade,\" said parade director Tom Fox, himself a Vietnam veteran. \"We had asked for donations from 200 corporations, and none of them came through,\" he said.", "\"This donation is the single most important thing I've ever done,\" said a beaming Trump. \"This is more important than all of my buildings and my casinos. This is my way of saying thank you to all the men and women in the armed services who have made it possible for me to become a success. Without them freedom and liberty would be gone.\"", "In sum, we are rating this claim \"True\" because two individuals involved with the planning of the 1995 parade stated on two separate occasions that Trump's efforts and donation did indeed enable the event to take place. Still unclear are the origins of other sources of funding.", "Martin, Douglas. \"Veterans Day Parade Tries for a Comeback.\"\r\n  The New York Times. 10 November 1995.", "Fitzpatrick, David and Curt Devine. \"Trump Will Give $1 Million to Marine Charity, but There Are Other Discrepancies.\"\r\n  CNN. 25 May 2016.", "McFadden, Robert D. \"On Parade To the Beat of History.\"\r\n  The New York Times. 12 November 1995.", "UPI. \"More Than 500,000 Watch Nation's Parade.\"\r\n  11 November 1995.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]