["The photo was published on Facebook here on December 8, 2020. It shows flooding around Lahore’s Minar-e-Pakistan monument. The post has been shared 220 times.", "The post’s Urdu-language caption translates to English as: “Minar-e-Pakistan (Tower of Pakistan) ground has been flooded. The government has set records of intolerance. Government has reached the extremes of its cowardice. Mr Niazi (PM Imran Khan) do whatever you want to do, the rally will be definitely held and it will be befitting.”", "The post circulated days before the Pakistan Democratic Movement (PDM), a major coalition of opposition political parties, held a rally at the Minar-e-Pakistan monument on December 13, 2020, as Pakistani newspaper Dawn reported here and here.", "The photo has been shared more than 1,200 times after it was published alongside a similar claim on Facebook here, here, here and here; and on Twitter here, here, here and here.", "The claim, however, is false.", "A Google reverse image search found the same photo was published on July 17, 2019, here by Pakistan’s largest English-language newspaper, The News.", "The report, headlined “Massive rain batters, drowns Lahore,” states that heavy rain flooded the city over a 17-hour period.", "Below is a screenshot comparison of the photo published in the newspaper in July 2019 (L) and the photo in misleading post (R):", "An opposition rally was held at the same venue on Dec 13, 2020, this AFP photo shows. No flooding was reported on that day.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]