["By Angelo Fichera", "Posted on March 25, 2020 | Updated on April 1, 2020", "Members of Congress are working toward passing a bipartisan, nearly $2 trillion stimulus package to bolster the economy in response to the novel coronavirus pandemic. It would include direct payments to Americans, loans for small businesses, support for hospitals and more.", "But online, some on social media are using various memes and posts to spread a falsehood that House Democrats are also trying to slip in $25 million to increase their own pay.", "That’s wrong.", "A number of the posts specifically refer to a $25 million funding allocation for the House referenced in a version of the package proposed by House Democrats on March 23.", "That House proposal included $25 million for “Salaries and Expenses” for the chamber — which would be “allocated in accordance with a spend plan submitted to the Committee on Appropriations of the House of Representatives by the Chief Administrative Officer and approved by such Committee.”", "But the bill never said it was for legislators’ salaries. Nor does the version of the stimulus package being worked out in the Republican-controlled Senate — the Coronavirus Aid, Relief, and Economic Security Act, or CARES Act — which similarly outlines $25 million for the House.", "A spokesman for the House Appropriations Committee called the pay-raise claims circulating online “absurd and inaccurate.”", "“The funding is to support the House’s capability to telework, including for the purchase of equipment and improvements to the network,” Evan Hollander told us in an email. “It will also provide for reimbursement costs for the staff of the House Child Care Center and covers the costs of the House food service contracts. In addition, it will support the Sergeant-At-Arms on continuity of operations matters.”", "He added: “Moreover, Member salaries are funded through the Treasury pursuant to the Constitution and are not funded through appropriations.”", "Also, as we said, the $25 million funding for the House is included in the Senate version of the package, according to draft legislation posted March 25 by the Senate Appropriations Committee. The measure — which includes $93 million for the legislative branch collectively, including $10 million for the Republican-controlled Senate — has been agreed to in principle by congressional leaders and the White House.", "A document posted by the Senate Appropriations Committee breaking down emergency appropriations in the package describes the $25 million allocated for the House in the same way Hollander does.", "It’s important to note, as we’ve explained before, that the 1989 Ethics Reform Act established an automatic adjustment formula to decide annual changes to lawmakers’ salaries.", "That automatic adjustment formula is “based on changes in private sector wages and salaries as measured by the Employment Cost Index,” according to the Congressional Research Service. The percentage increase cannot surpass that for federal employees who fall under the “General Schedule” classification. It automatically goes into effect unless Congress statutorily denies it, which it has done every year since 2009.", "Democrats had considered in mid-2019 ending that decade-long hiatus and allowing the automatic pay increase to go through, but backed away from the idea following a backlash from within the party.", "Update, April 1: The president signed the $2 trillion stimulus package into law on March 27. Adults with an adjusted gross income of $75,000 or less will receive $1,200 (married couples with an adjusted gross income of $150,000 or less will receive $2,400, plus $500 per child). The payment amount will scale down by income, phasing out at $99,000 for single individuals and $198,000 for couples without children.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "“$340 Billion Surge in Emergency Funding to Combat Coronavirus Outbreak.” Senate Appropriations Committee. 25 Mar 2020.", "Ferris, Sarah, Heather Caygle and Laura Barrón-López. “Dems to yank bill to raise congressional pay after backlash.” Politico. 10 Jun 2019.", "Hollander, Evan. Spokesman, House Appropriations Committee. Email to FactCheck.org. 25 Mar 2020.", "“Salaries of Members of Congress: Recent Actions and Historical Tables.” Congressional Research Service. 17 May 2019.", "U.S. House. “H.R.6379, Take Responsibility for Workers and Families Act.” (as introduced 23 Mar 2020)", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]