["The video was published on Twitter here on February 12, 2020.", "It has been viewed more than 200,000 times.", "The nine-second footage shows a group of apartment blocks. In the clip’s audio, a person can be heard shouting: “Good morning my neighbours! Hey fuck you! Yes, yes, fuck you too”.", "The post’s caption reads:  “Meanwhile in Wuhan, China. Residents are quarantined..", "“Guy A: Good morning my neighbors\n\tGuy B: Hey, fuck you!\n\tGUY A: Yeah, fuck you too!”", "The tweet caption ends with a #Coronavius hashtag.", "Below is a screenshot of the misleading tweet:", "The Chinese city of Wuhan remains on lockdown after the oubreak of the novel coronavirus which has killed nearly 1,800 people and infected more than 70,000 in China, as reported by AFP here on February 17, 2020.", "The same video was shared here, here and here on Twitter with a similar claim.", "The video was also shared here on YouTube with a similar claim.", "The claim is false; the video was filmed in Shanghai and the audio has been edited to include the dialogue.", "A building in the background of the footage displays simplified Chinese characters which translate to English as “affiliated Putuo hospital”.", "The location shown in the misleading video was can be seen here on Baidu Maps next to the Putuo Hospital, Shanghai University of Traditional Chinese Medicine, also known as the Central Hospital of Putuo, Shanghai.", "Below is a screenshot of a photo from the hospital page on Baidu Maps, which shows the same building with Chinese characters on the top:", "AFP found this identical video on the Chinese app Douyin based on the Douyin ID seen in the top left-hand corner of the video in the misleading posts.", "Douyin is the Chinese version of mobile video app TikTok.", "The original video, published on February 3, 2020, can be seen with a green location tag in the bottom left-hand corner which states “Shanghai”. The sound bar at the bottom side states the user who posted the video has used a background sound created by another Douyin user called 汉哥的故事 (American flag emoji).", "Below is a screenshot of the original video on Douyin’s mobile version, with the location tag and background sound bar circled in red:", "The audio in the clip directly corresponds with the audio of this scene in the 1988 film Coming to America.", "In the film scene, lead actor Eddie Murphy can be heard saying: “Good morning my neighbours! Yes, yes, fuck you too!”", "As of February 4, 2020, Shanghai’s city government ruled that mandatory quarantine would only be implemented for people who have travelled from key epidemic areas including Wuhan.", "The ruling was published here on Chinese State Council Information Office’s website.", "It translates in part as: “For those who come to or back to Shanghai from key places such as Hubei province, according to related regulation, shall strictly follow the order to stay at home or centralized isolation sites for 14 days, also report to communities consciously and accept their management. If no abnormal situation happens during the time, they would be allowed to work normally after that.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]