["“80% of the nuns in this Kentucky convent got COVID 2 days after vaccine,” reads the headline of an article published on February 25, 2021 by Life Site News, a website originally founded by a Canadian national anti-abortion organization.", "“Earlier this month, 35 nuns in a northern Kentucky convent received an mRNA-developed COVID-19 vaccine. Just two days later, two died and twenty six others tested positive for the virus,” the article says.", "Other articles similarly sought to raise concerns about Covid-19 vaccination, but events at the monastery are not evidence that immunization is ineffective against the disease.", "The articles are part of a trend of misleading claims about Covid-19 vaccines spreading across the internet as countries around the world seek to immunize their populations against the disease, despite assurances from health authorities that the shots are safe and effective.", "In early February 2021, local media reported that two nuns at St Walburg Monastery had died of Covid-19, while 28 more were diagnosed with the virus. A third member of the community died of complications from the virus on February 10, the monastery announced.", "The Life Site News article did not mention the third death despite being published more than two weeks later.", "St Walburg’s sub-prioress, Sister Nancy Kordenbrok, confirmed that three nuns died of Covid-19.", "“The sisters were already sick before” being vaccinated, she told AFP by phone.", "According to her, “one sister was tested at the direction of her doctor before we received the vaccine. Her results were positive and that led to our being tested.”", "Results came back positive for 29 of the community’s 35 members.", "Kordenbrok said the first member of the congregation to test positive had been outside of the monastery for medical care unrelated to Covid-19. Her results came back after everyone had received a first shot of the Moderna vaccine.", "Those who did not test positive then got their second vaccine dose last week, Kordenbrok said, while the others will have to wait until symptoms subside, as is recommended by the Centers for Disease Control and Prevention (CDC).", "Steve Feagins, health director for the Hamilton County Public Health agency, in nearby Ohio, said by email that it is not uncommon for people to test positive for Covid-19 after vaccination, since it can take multiple days for the virus to cause symptoms.", "And Martha Sharan, a spokeswoman for the CDC’s Division of Healthcare Quality Promotion, said in an email that “vaccination does not cause Covid, it’s not a live vaccine,” meaning that Covid-19 vaccines authorized in the United States do not use a living, “weakened form of the germ that causes a disease,” according to the CDC’s website.", "For her part, Sister Kordenbrok said that she and her community deplored the inaccurate claims surrounding events at the monastery, and that she trusts Covid-19 vaccination process.", "“I think the vaccine has been tested enough and is safe,” she said.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]