["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "U.S. President Donald Trump speaks at a campaign rally at Atlantic Aviation in Moon Township, Pa., Saturday, March 10, 2018. (AP Photo/Carolyn Kaster)", "President Donald Trump floated the idea of imposing the death penalty on drug dealers in the United States during his Pennsylvania rally, saying China and Singapore do it and they don’t have a drug problem.", "\"The only way to solve the drug problem is through toughness,\" Trump said March 10 while stumping for Republican congressional candidate Rick Saccone. \"When you catch a drug dealer … you got to put him away for a long time.\"", "Trump shared conversations he had with leaders of China and Singapore.", "\"When I was in China and other places, by the way, I said, Mr. President, do you have a drug problem? ‘No, no, no, we do not.’ I said, Huh. Big country, 1.4 billion people, right. Not much of a drug problem. I said what do you attribute that to? ‘Well, the death penalty.’\"", "On Singapore, \"I said, Mr. President, what happens with your drugs? ‘No. We don't have a problem, President.’ I said, really why? ‘We have a zero tolerance.’ And he is not playing games … So what do you mean no problem? ‘We have a zero tolerance policy.’ What does that mean? ‘That means if we catch a drug dealer, death penalty.’ \"", "PolitiFact decided to fact-check whether China and Singapore have the death penalty for drug dealers as Trump claimed. (We will set aside for now whether these countries have \"no\" drug problems as a result, as Trump claimed the leaders said.)", "We found those countries do have the death penalty for individuals who traffic, smuggle or transport certain drugs. The White House did not comment on the record, but in the context of Trump’s speech, it appears these are the individuals he was referring to when speaking about \"drug dealers\" — not just individuals who may sell drugs on the streets.", "Nonetheless, China and Singapore have also been called out as human rights abusers for these practices, and drug policy and law experts expressed skepticism about the death penalty being a deterrent for drug trafficking in the United States.", "Chinese law says that individuals who smuggle, traffic, transport or manufacture drugs and meet certain conditions are to be punished with 15 years of fixed-term imprisonment, life imprisonment or death sentence, and confiscation of their properties.", "The law mentions certain amounts of opium, heroin, methylaniline and \"other narcotic drugs of large quantities.\"", "Human rights groups and experts say data on death sentences and executions in China is unreliable and unknown. That information is kept as a state secret. Amnesty International estimates thousands of people are executed and sentenced to death each year.", "Given data limitations, it's difficult to assess the efficacy of its policy against drug offenders.", "Singapore’s Misuse of Drugs Act calls for the death penalty for individuals convicted of trafficking specified amounts of opium, cocaine, cannabis, and other substances. The law said the word \"traffic\" means to sell, give, administer, transport, send, deliver or distribute.", "Individuals possessing certain amounts of specified drugs are also presumed to have it for the purpose of trafficking, unless proven otherwise. Recent law revisions give courts discretion not to impose the death penalty in certain circumstances.", "A March 2010 study on executions, deterrence and homicide in Hong Kong and Singapore said there are \"no decent indicators\" available regarding drug use over time in Singapore, and if the data exists, \"they are a government secret.\"", "Singapore’s minister for foreign affairs, Vivian Balakrishnan, at a September 2016 United Nations meeting said his country regarded drug trafficking \"as a most serious crime,\" and that the death penalty kept major drug syndicates away from Singapore.", "Singapore had eight executions for drugs from 2015 to 2017, according to a March 2018 report from Harm Reduction International.", "Drug policy and law experts said attempts at similar laws in the United States would face constitutional obstacles.", "They pointed to a high bar for the death penalty established in the 2008 U.S. Supreme Court case Kennedy vs. Louisiana, which addressed whether states violate the Eighth Amendment's ban on cruel and unusual punishment by imposing the death sentence for the crime of child rape. The court’s opinion said \"the death penalty should not be expanded to instances where the victim’s life was not taken.\"", "However, the court said its concern was limited to crimes against individual persons and did not address offenses against the State, such as treason, espionage, terrorism, and drug kingpin activity. Congress in 1994 enacted a law allowing the imposition of the death penalty for drug kingpins even if no death occurred.", "\"If the death penalty is unconstitutional to impose against a child rapist, it is hard to imagine a court upholding its imposition against a person for selling drugs,\" said Alex Kreit, a law professor and co-director of the Center for Criminal Law and Policy at Thomas Jefferson School of Law.", "Experts also questioned how effective the death penalty would be as a deterrent for drug offenders.", "\"The likelihood of getting caught, prosecuted, convicted, and sentenced to death — especially at the federal level with only three executions since 1964 — is tiny,\" said Matthew Robinson, a professor of criminal justice at Appalachian State University.", "Trump said China and Singapore impose the death penalty on drug dealers.", "Chinese law says that individuals who smuggle, traffic, transport or manufacture drugs and meet certain conditions can receive a death sentence. Singapore’s Misuse of Drugs Act also calls for the death penalty for individuals convicted of trafficking specified amounts of opium, cocaine, cannabis, and other substances.", "We rate Trump’s claim True.", "C-SPAN, President Trump in Moon Township, Pennsylvania, March 10, 2018", "Congressional Executive Commission on China, Criminal Law of the People's Republic of China", "Permanent Mission of the People's Republic of China to the United Nations and other International Organizations in Vienna, Criminal Law of the People's Republic of China", "FIDH (International Federation for Human Rights), The Death Penalty For Drug Crimes in Asia Report, October 2015", "Amnesty International, Death Penalty: World’s biggest executioner China must come clean about ‘grotesque’ level of capital punishment, April 11, 2017", "Singapore Statutes Online, MISUSE OF DRUGS ACT (CHAPTER 185)", "Singapore Ministry of Foreign Affairs, MFA Press Release: Transcript of Minister Vivian Balakrishnan's Intervention at the High-Level Side Event at UNGA - \"Moving Away from the Death Penalty: Victims and the Death Penalty\", 21 Sep 2016, Sept. 22, 2018", "Oyez.org, Kennedy v. Louisiana", "Cornell University Law School, KENNEDY v. LOUISIANA (No. 07-343)", "U.S. Department of Justice, Violent Crime Control and Law Enforcement Act of 1994, Fact Sheet, Oct. 24, 1994", "U.S. Justice Department, 69. The Federal Death Penalty Act Of 1994", "Death Penalty Information Center, Death Penalty for Offenses Other Than Murder", "HeinOnline, 24 Vt. L. Rev. 1 (1999-2000) The Death Penalty for Drug Kingpins: Constitutional and International Implications", "Journal of Empirical Legal Studies, Executions, Deterrence, and Homicide:", "A Tale of Two Cities, March 2010", "Email interview, Alex Kreit, a professor and co-director of the Center for Criminal Law and Policy at Thomas Jefferson School of Law, March 13, 2018", "Email interview, Matthew Robinson, a professor of criminal justice at Appalachian State University, March 12, 2018", "Email interview, John J. Donohue III, law professor at Stanford Law School, March 12, 2018", "Email interview, Franklin Zimring, professor at University of California, Berkeley Law School, March 12, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]