["About this rating", "In mid-2016 an odd rumor began traversing \"fun facts\" sites and groups, holding that the yolks of flamingo eggs are bright pink:", "The claim made simultaneous appearances on Reddit, Facebook, and countless blogs devoted to unbelievable facts or tidbits of trivia, but an initial red flag regarding the claim appeared when we reverse-searched the image depicted above and found it was clearly a doctored stock photograph of a standard, boring yellow-yolked egg:", "The finding was disappointing, as surely the sight of a cracked egg with a bright pink yolk would be noteworthy enough to warrant photographic capture at one point or another, but none was to be found. We also located a YouTube video of abandoned flamingo nests showing cracked eggs, and although the footage showed no freshly broken eggs, it did capture remnants of flamingo egg yolks (seen at approximately the one-minute mark) that were standard yolk color if not a tad deeper:", "We contacted Flamingo Gardens in Fort Lauderdale to ask whether it was true that flamingo egg yolks are pink. A resident flamingo expert there told us that wasn't the case, that flamingo yolks were not dissimilar in color to chicken egg yolks.", "We also contacted Flamingo expert Caitlin Kight, author of the 2015 book Flamingo about the rumor, who in turn consulted with University of Exeter animal researcher Paul Rose.  Rose confirmed that flamingo \"yolks aren't literally pink\" — the yolks can vary in color from \"bright orange\" to \"reddish,\" he vouchsafed, but photographs showing them to be bright pink are completely unrealistic.", "In the ordinary course of development, flamingos do not start out their lives as pink — they gain that distinctive coloring through their diet as they mature:", "Smithsonian magazine, among others, offers an explanation for the gradual development of flamingo pigmentation:", "Pop quiz: Why are flamingos pink?", "If you answered that it’s because of what they eat — namely shrimp — you’re right. But there’s more to the story than you might think.", "Flamingos are born with gray plumage. They get their rosy hue pink by ingesting a type of organic pigment called a carotenoid. They obtain this through their main food source, brine shrimp, which feast on microscopic algae that naturally produce carotenoids. Enzymes in the flamingos’ liver break down the compounds into pink and orange pigment molecules, which are then deposited into the birds’ feathers, legs and beaks. If flamingos didn’t feed on brine shrimp, their blushing plumage would eventually fade.", "Bradford, Alina.   \"Flamingo Facts: Food Turns Feathers Pink.\"\r\n    LiveScience.   18 September 2014.", "Koren, Marina.   \"For Some Species, You Really Are What You Eat.\"\r\n    Smithsonian.com.   24 April 2013.", "The University of Exeter.   \"The Curious World of Flamingos.\"\r\n    April 2014.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]