["By Lori Robertson", "Posted on June 21, 2019", "In launching his reelection campaign, President Donald Trump repeated a claim about new auto plants that he made a year-and-a-half ago. It’s still not true, and it fits a pattern of Trump falsely boasting of unexpected or unusual gains in the auto industry.", "Trump said of the U.S. auto industry in his June 18 rally in Orlando: “Many, many plants are now under construction in Michigan and Ohio, Pennsylvania, North Carolina, South Carolina, Florida. They hadn’t built one in decades and now they’re all over the place.” It’s not true that the auto industry hasn’t built a new plant “in decades.” As for the “many, many plants … now under construction,” Bernard Swiecki, director of the Automotive Communities Partnership at the Center for Automotive Research, told us he knew of only two new assembly plants under construction or newly announced —  a Toyota/Mazda joint venture plant in Alabama (announced in January 2018) and a Fiat Chrysler Automobiles (FCA) plant in Michigan (announced in February).", "Swiecki sent us a list of the 12 assembly plants that have been announced in North America since 2009. Four of those were in the U.S., while eight went to Mexico and none to Canada.", "CAR, a research group based in Michigan that receives some of its funding from the government, tracks auto industry investments in North America.", "On Jan. 30, 2018, in his State of the Union speech, Trump similarly claimed: “Many car companies are now building and expanding plants in the United States — something we haven’t seen for decades.” At the time, we wrote that two new auto assembly plants had been announced in the nine years before Trump took office, as Kristin Dziczek, vice president of CAR’s industry, labor & economics group, told us.", "In 2015, Volvo announced its first U.S. plant in Berkeley County, South Carolina — one of the states Trump mentioned in his June 18 rally. Volvo says on its website that it broke ground on the plant on Sept. 25, 2015.", "Also that year, Mercedes-Benz announced it, too, would open an assembly plant in South Carolina. It celebrated the groundbreaking in July 2016.", "In 2008 (therefore not included in Swiecki’s 2009-present tally), Volkswagen announced it had chosen Chattanooga, Tennessee, for a new midsize sedan assembly plant. Production began in April 2011, the company said in a 2018 press release celebrating the 10-year anniversary of its decision to set up shop in Chattanooga. Since then, Volkswagen has continued to expand and invest in that facility. In 2014, it announced it would produce the midsize SUV Atlas there, beginning production in December 2016. In 2018 and 2019, it said it would make further investments in the facility to produce a five-passenger SUV and manufacture electric vehicles, respectively.", "Most investments in recent years, Dziczek told us in January 2018, have been for “expansion and retooling of existing facilities,” such as BMW’s expansion of its South Carolina facility in 2016. The company announced a further expansion of that plant in 2017.", "We asked the White House press office for a list of the auto plants “now under construction in Michigan and Ohio, Pennsylvania, North Carolina, South Carolina, Florida,” as Trump claimed this week. We have not received one. Our fact-checking colleagues at the Washington Post made a similar query this month of the Trump campaign, but also didn’t get any information.", "It’s worth noting that since Trump took office, GM has announced the closure of up to five plants in North America. In May, it announced it was in negotiations to sell one of those plants, in Lordstown, Ohio, to an electric vehicle company and would make investments in other facilities in the state.", "If the president instead means new automaker investments, which would include expansions and retooling of existing plants and other facilities, not only construction of new plants, he would still be wrong to say such investments haven’t happened in “decades.” In fact, the CAR 2018 “Book of Deals,” which tracks announced investments, includes the following chart, showing that automaker investments have occurred every year from 2009 to 2018. The yearly investment amounts for 2010, 2011 and 2015 in the United States outpace the money auto companies have invested in 2017 or 2018, during Trump’s time in office. Swiecki noted that 2011 and 2015 were United Automobile Workers negotiation years, as is 2019. So, CAR expects “a spike” of investment announcements beginning later this summer, he said.", "Chart source: Center for Automotive Research, “Book of Deals Update 2018”", "Swiecki also mentioned supplier plants, noting that they “come and go as suppliers lose sourcing contracts and are replaced by others,” resulting in a constant “churn.” The president’s statements don’t indicate he is speaking of suppliers, but if so, that also wouldn’t support his claim. Because of the churn, Swiecki said, “new plants under construction don’t necessarily represent growth.”", "The investments the automakers have made over the years may be reflected in the near steady job growth since 2010 in motor vehicle and parts manufacturing, as this chart from the Bureau of Labor Statistics shows. After dropping during the 2007-2009 Great Recession, auto manufacturing jobs have been climbing.", "Trump, however, also has claimed that auto jobs were declining before he became president — a false assertion that fits the president’s pattern of claiming an abrupt reversal in the industry under his tenure. For instance, in March 2017, he promised, “We’re going to put our auto industry back to work,” suggesting that auto jobs had been trending down. And two years later, at a March rally in Michigan, Trump claimed a victory: “Before I took the oath of office the United States automobile industry was decimated and it was going down. …  And just in the last very short period of time we have added another 6,000 vehicle manufacturing and auto parts jobs in Michigan alone.” In fact, auto industry jobs were not “going down” before he took office.", "Over Trump’s 29 months as president, the number of vehicle and parts manufacturing jobs has gone up by 42,100, or 4.4 percent, according to the most recent figures from the Bureau of Labor Statistics. Over the previous 29 months, the job growth was 73,500, or 8.3 percent. So far, the trend of job growth in the industry has continued under Trump, at a slightly slower pace.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]