["About this rating", "On 18 January 2019, a Facebook user employed the platform's feature that creates large-font statuses with brightly-colored backgrounds to report a unverified yet widely-shared claim:", "The meme didn't include any source or details related to its claim that two dozen children were sent home from St. Jude -- a research hospital based in Memphis, Tennessee, that focuses on children's catastrophic diseases, particularly leukemia and other cancers -- and we could find no information to back it up. No news stories published within a week of the meme's posting indicated that 24 children had been sent home from the hospital cancer-free. We contacted St. Jude about the claim and received following statement in response:", "\"While we appreciate the promotion of the work we do at St. Jude to treat pediatric cancer and other life-threatening diseases, the idea of a cure is complicated. More than 80 percent of children with cancer become long-term survivors, meaning they survive five years past their cancer diagnosis. Each year, St. Jude treats more than 7,000 children with cancer.\"", "St. Jude Children's Research Hospital is named after St. Jude Thaddeus, the patron saint of hope and impossible causes. It specializes in pediatric cancer and is renowned for treating patients free of cost thanks to donor support. According to the hospital's literature, its medical staff treats 7,500 patients annually, and St. Jude has 78 beds for children requiring in-patient treatment. We found no St. Jude press release boasting about 24 children all being released cancer-free in one week, a news event that the hospital, which is funded by charitable donations, almost certainly would have made public.", "It's unclear what message the meme maker was trying to send. However the false notion that a cure for cancer exists but is being suppressed by the pharmaceutical industry is a popular and persistent conspiracy theory.", "Berezow, Alex.   \"Proof There's No FDA-Big Pharma Conspiracy Suppressing Cancer Cures.\"\r\n    American Council on Science and Health.   11 June 2016.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]