["About this rating", "According to senior church figures, Pope Francis called for a debate about the possibility of allowing some already-married older men to be ordained as priests — in limited circumstances.", "Francis has not explicitly, definitively expressed support for even the very limited proposals in question; he has not called for broad marriage rights for Catholic priests in general.", "In November 2017, reports appeared that Pope Francis had requested marriage rights for Catholic priests. The article spread widely once again in April 2018.", "A representative article's headline reads: \"Pope Francis requests Roman Catholic priests be given the right to get married.\" However, the rather broad implications of this statement are contrasted with the more conditional, limited description presented in the article itself:", "The request applies to priests in Brazil, and is on the agenda for an upcoming synod (church council) in the Amazon region. The controversial move would address the critical shortage of men joining the priesthood — but is likely to drive divisions through the church by enraging conservative factions.", "In reality, Pope Francis has not made any public statement calling for or requesting broad marriage rights for all Catholic priests. Rather, others within the church hierarchy have reported that Francis has responded favorably to requests from bishops and cardinals that the church consider the possibility that already-married older men might, in limited circumstances, be ordained as Catholic priests — but only in Brazil, and only as a possible solution to the practical problem of a shortage in priests in Amazonian regions.", "In December 2016, the National Catholic Reporter reported comments made by the theologian Leonardo Boff, who claimed that Brazilian bishops, facing a severe shortage of priests, had requested that Pope Francis allow married, older men to be ordained as priests:", "Pope Francis may soon fulfill the Brazilian bishops' special request to allow married priests to resume their priestly ministry, liberation theologian Leonardo Boff said in a Dec. 25 interview in the German daily Kölner Stadt-Anzeiger.", "\"The Brazilian bishops, especially the pope's close friend Cardinal Claudio Hummes, have expressly requested Pope Francis to enable married priests in Brazil to return to their pastoral ministry,\" Boff said. \"I have recently heard that the pope wants to fulfil this request — as an experimental, preliminary phase for the moment confined to Brazil.\"", "With its 140 million Catholics, Brazil needs at least 100,000 priests but it only has 18,000, which is a \"catastrophe,\" Boff said. \"No wonder the faithful are going over to the evangelical churches or to the Pentecostals in droves, as they are filling the personnel vacuum. If the many thousands of priests who have married are once again allowed to practice their ministry, that would be a first step to improving the situation but at the same time also an impulse for the church to free itself of the fetters of celibacy.\"", "A year later, the issue made news once again, after Brazilian cardinal Claudio Hummes told the Italian newspaper Il Messaggero that Francis had agreed to propose a debate on allowing married men to be ordained in the Amazonian region at an October 2019 meeting of bishops.", "In November 2017, the Catholic News Agency reported:", "Pope Francis has reportedly said he will allow for debate as to whether married men could be ordained to the priesthood in the region during a 2019 Synod of Bishops focusing on the Church in the Amazon basin.", "His comments came in response to a question on the matter from Cardinal Claudio Hummes, the president of the Episcopal Commission for the Amazon, according to the newspaper Il Messaggero.", "The comments have been broadly interpreted in media outlets to mean that Pope Francis is considering opening the door for priests throughout the Roman Catholic Church to get married. However, the Pope’s comments in response to Cardinal Hummes were specifically about whether “viri probati” or “proven men” could be ordained to the priesthood. Such men, who have displayed virtue and prudence, are thought by some to be a possible solution to a shortage of priestly vocations in Brazil.", "In an interview with German newspaper Die Zeit in March 2017, Pope Francis himself had already left open the possibility that the principle of \"viri probati\" might be implemented in certain remote areas. In comments translated by the Associated Press, Francis said:", "We must consider if viri probati is a possibility. Then we must determine what tasks they can perform, for example, in remote communities.", "Pongratz-Lippitt, Christa.  \"Brazil May Soon Have Married Priests, Says Leonardo Boff.\"\r\n  National Catholic Reporter.  30 December 2016.", "Frank, Joachim.  \"Leonardo Boff im Interview: 'Papst Franziskus ist Einer von Uns.\"\r\n  Kölner-Stadt-Anzeiger.  25 December 2016.", "Rezac, Mary.  \"Despite Reports, Pope Francis Isn't Opening the Door to All Married Priests.\"\r\n  Catholic News Agency/EWTN News.  5 November 2017.", "Giansoldati, Franca.  \"I Vescovi Brasiliani: Aprire ai Preti Sposati.\"\r\n  Il Messaggero.  2 November 2017.", "Associated Press.  \"Pope Open to Studying Ordination of Married Men as Priests.\"\r\n  Associated Press.  9 March 2017.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]