["About this rating", "In late February 2021, millions of social media users watched or shared a roughly 30-second video clip that supposedly depicted heavy snowfall in the Arabian Desert featuring three camels lying calmly in the snow.", "Viewers framed the footage as an authentic recording of weather in the area of Saudi Arabia's northwestern city of Tabuk on Feb. 18, according to the original video (screenshot below) and Google's Arabic-to-English translation of its caption on Twitter.", "They were correct. According to news reports citing meteorologists and a statement by an embassy official, the video indeed captured heavy snowfall in the mountainous area.", "For example, Arab News, a Saudi-based, English-language daily newspaper, said snow covered Tabuk's mountains on Feb. 18 after plunging overnight temperatures, and officials issued extreme-weather warnings for the city and other regions across Saudi Arabia.", "\"There is no one denying climate change, but it’s also not that rare for this region — Tabuk, in northwestern Saudi Arabia — to experience snow,\" said Fahad Nazar, the spokesperson for Saudi Arabian embassy in Washington, D.C., according to the news outlet. \"Contrary to popular perception, not every region in the Kingdom is warm year-round.\"", "Additionally, an English news story by Alarabiya News, a Dubai-based television news outlet, reported similar information around the same time:", "Residents and visitors have begun flocking to the northwestern city of Tabuk in Saudi Arabia which began to experience snowfall in the early hours of Thursday, with much more expected over the weekend. [...]", "Snow blanketed parts of the Kingdom’s northern cities earlier last month. The last time the Kingdom experienced as much snowfall came in 2018, when locals and tourists took to fun snow activities like riding sleighs and snowball fights.", "The official Twitter accounts for Al Arabiya English and Arab News shared the above-mentioned viral video of the camels in the snow.", "Jessica Lee is Snopes' Senior Assignments Editor with expertise in investigative storytelling, media literacy advocacy and digital audience engagement.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]