["Families affected by pre-existing conditions attend a news conference on Capitol Hill in Washington, Tuesday, June 26, 2018. (AP Photo/Andrew Harnik)", "A popular feature of Obamacare is its ban on insurance companies denying coverage to people with pre-existing conditions.", "With health care shaping up as a major issue in the midterms, Democrats are now painting Republicans as opponents of this popular protection.", "\"Protections for pre-existing conditions are a matter of life or death,\" said Sen. Jon Tester, D-Mont., in a Facebook ad that featured a Montanan with a pre-existing condition. \"I’ve fought to protect coverage for pre-existing conditions, but Matt Rosendale supports plans that don’t have to cover them.\"", "It turns out Rosendale has backed such plans.", "President Donald Trump and Republican lawmakers’ rejiggering of the health care market has led to an increase of cheaper plans with fewer benefits.", "In August, the Trump administration issued a rule to permit insurance companies to extend the lifespan of short-term insurance plans.", "These so-called \"short-term, limited-duration\" plans, which were originally designed to fill temporary gaps in coverage for up to three months, are exempt from the pre-existing coverage rule. Under Trump, temporary plans can now last up to 364 days, and may be renewed up to three times.", "Republican lawmakers, meanwhile, voted to remove a tax penalty that Affordable Care Act applied to Americans who chose not to carry comprehensive coverage. The penalty drops off starting in 2019.", "These two measures opened the door for consumers to drop coverage altogether, or to buy \"short term\" plans, without penalty, that may be renewable up to three years and do not have to cover pre-existing conditions.", "Absent the pre-existing coverage provision, insurers have more leeway in crafting this class of insurance policy. Companies on the short-term market may choose not to insure, or not to renew, an applicant due to health conditions. Or they may charge higher premiums based on health status, gender or other factors.", "\"Carriers offering short-term or limited duration plans may say that they will cover someone that has pre-existing conditions,\" said Katherine Hempstead, a senior advisor at the Robert Wood Johnson Foundation. \"But then they will actually waive coverage for any health services related to those conditions.\"", "Insurance companies may also investigate a policyholder’s claim of illness or injury and make a retroactive finding that their ailment stemmed from a pre-existing condition, and therefore excluded from coverage.", "Proponents of short-term insurance point to its significantly lower cost, relative to ACA-compliant plans.", "\"Due to these limitations in coverage, short-term policies, not surprisingly, cost less than ACA-compliant major medical health insurance policies,\" the Kaiser Family Foundation wrote in April analysis. \"It is not uncommon to find the cheapest short-term policy priced at 20 percent or less of the premium for the lowest cost (Obamacare)-compliant plan.\"", "The Tester campaign pointed us to multiple instances in which Rosendale celebrated Trump’s expansion of short-term plans.", "\"We are now getting ready to open up a lot of opportunities in 2019, thankfully, because President Trump signed an executive order extending the duration of short-term plans from 90 to 364 days,\" Rosendale told Breitbart News Tonight in August. \"Again, these are plans that don't have to have all of the Obamacare mandates, which most people don't want.\"", "In that same interview, Rosendale hastened to add that he wants to make sure people with pre-existing conditions and others are able to gain coverage.", "We emailed the Rosendale campaign, which sent us links to news and opinion pieces that related to the candidate’s ideas about health care affordability and price transparency. But they did not specifically address how Rosendale would ensure people with pre-existing conditions are not denied coverage.", "An editorial in Montana’s largest newspaper, the Billings Gazette, took Rosendale to task for claiming to support protections for those with pre-existing conditions while endorsing short-term plans.", "The newspaper cited a study that estimated that a quarter of non-elderly Montana adults have a pre-existing condition that could disqualify them from coverage plans that do not comply with Obamacare.", "\"As the state’s insurance commissioner, Rosendale should know that the policies he supports do opposite of what he promised,\" the editorial read. \"He promotes the short-term policies that can reject Montanans who have pre-existing health conditions.\"", "Tester said, \"Matt Rosendale supports plans that don’t have to cover (pre-existing conditions).\"", "Rosendale supports short-term plans that do not have to cover pre-existing conditions, and he welcomed their expansion under Trump.", "We rate this True.", "Jon Tester Facebook ad, Oct. 10, 2018", "Dept. of Health and Human Services, \"Trump Administration Delivers on Promise of More Affordable Health Insurance Options,\" Aug. 1, 2018", "Kaiser Family Foundation, \"Understanding Short-Term Limited Duration Health Insurance,\" April 23, 2018", "Matt Rosendal interview with Breitbart News Tonight, Aug. 15, 2018", "Billings Gazette, \"What insurance rates don’t tell us,\" Aug. 16, 2018", "Email interview with Chris Meagher, spokesman for Jon Tester campaign, Oct. 25, 2018", "Email interview with Shane Scanlon, spokesman for Matt Rosendale campaign, Oct. 25, 2018", "Email interview with Katherine Hempstead, a senior advisor at the Robert Wood Johnson Foundation, Aug. 29, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]