["The grilling Chuck Hagel, the nominee for Secretary of Defense, will receive from the U.S. Senate boils down to this : How much does he love Israel and hate Iran?\n\nPoliticians and foreign policy observers have been poring over Hagel’s votes and statements about the Middle East in reaction to President Barack Obama’s Jan. 7 nomination of Hagel, a Republican and former senator from Nebraska, to replace retiring Leon Panetta.\n\nU.S. Rep. Ileana Ros-Lehtinen, R-Miami, a member of the House foreign affairs committee who chairs a subcommittee on the Middle East, issued a statement Jan. 8 in which she said Hagel supported legislation that would have provided a lifeline to Fidel Castro, opposed sanctions on Iran and criticized Israel. We zeroed in on this part of her statement about Iran:\n\n\"He opposed sanctions against Iran, which has brazenly pursued the development of a nuclear weapon in open defiance of the international community as well as called for the destruction of one of our vital allies, Israel.\"\n\nHagel’s stance on sanctions against Iran has sparked much discussion in recent weeks so we wanted to check Ros-Lehtinen’s statement that Hagel \"opposed sanctions against Iran.\"\n\nA conservative group, the Emergency Committee for Israel, made a similar claim about Hagel in an attack ad in December. (We already fact-checked a different claim in the ad on whether Hagel ruled out military action against Iran. We rated the statement Mostly False.)\n\nHagel voted both for and against sanctions\n\nHagel, a decorated Vietnam war veteran, won his first Senate seat in 1996 and retired in 2008 with an expertise in foreign affairs.\n\nFor some politicians, sanctioning an unpopular foe such as Iran is a no-brainer. But Hagel had a nuanced view of sanctions that can’t easily be summarized in a soundbite.\n\nSpokespersons for Ros-Lehtinen sent us a list of Hagel’s votes and actions that they said showed he opposed sanctions. Hagel’s office at The Atlantic Council, a think tank that promotes transatlantic cooperation and international security, distributed a fact-sheet about his foreign policy views which shows the opposite, that he supported sanctions against Iran.\n\nWe found that both documents -- though they cherry-pick to support their viewpoints -- are partially accurate, because Hagel took votes both for and against sanctions against Iran.\n\nHagel consistently raised concern about Iran’s nuclear capabilities, but expressed doubt that sanctions would halt Iran, repeatedly calling for the United States to hold discussions with Iran. He also sometimes argued that sanctions cost the United States billions in lost revenue.\n\nBut he also left open the door for multilateral sanctions as a foreign policy tool.\n\nTo illustrate his views on sanctions, we will look at a few examples:\n\nHagel was one of two \"no\" votes in the Senate in 2001 to amend and extend for five years the Iran and Libya Sanctions Act of 1996. In a banking committee, his amendment for a two-year renewal, supported by the White House, was rejected.\n\nThe bill allowed the president to penalize companies that invested heavily in Iran’s energy sector. Some said the law was toothless since President Bill Clinton had waived it for some foreign firms in the past.\n\nHagel said in a speech that year that \"unilateral sanctions hardly ever work\" and that sanctions only work in the short term if they are multilateral and administered by the U.N.\n\nIn 2007, Hagel did not join the 72 Senate co-sponsors on The Iran Counter-Proliferation Act to amend the Iran Sanctions Act of 1996, which subjects Iran to economic sanctions unless the country dismantled its nuclear enrichment-related program. That bill never got a vote.\n\nThat same year, the Senate voted 76-22 for an amendment to label the Iranian Revolutionary Guard Corp. a terrorist group, leading to sanctions. Hagel voted no.\n\nIn an interview with the Lincoln Journal Star, Hagel said he feared the administration could use that vote as cover for an attack.\n\n\"I voted against that resolution for that very reason,\" he said. \"It's a very dangerous resolution.\"\n\nIn 2008, Hagel was one of two \"no\" votes on a banking committee to oppose the Comprehensive Iran Sanctions, Accountability and Divestment Act. \n\nNow, let’s look at examples when Hagel supported sanctions:\n\nIn 1998, Hagel voted along with the 90-4 majority in favor of the Iran Missile Proliferation Sanctions Act.\n\nThe New York Times wrote that President Clinton vetoed it because he said it would reduce his flexibility in dealing with foreign policy.\n\nIn 2000, Hagel was part of the Senate’s unanimous vote in favor of the Iran Nonproliferation Act. The bill directed the president to report to Congress on foreign persons who transferred goods or provided assistance related to Iran’s efforts to acquire nuclear weapons.\n\nIn 2006, the Senate passed by unanimous consent the Iran Freedom Support Act (sponsored by Ros-Lehtinen) to keep sanctions in effect. Under unanimous consent, all senators get a chance to object; none of the senators objected.\n\nWhen Obama nominated him, Hagel defended his stance on Iran in an interview with a Nebraska newspaper:\n\n\"I have not supported unilateral sanctions because, when it is us alone, they don't work and they just isolate the United States,\" he said. \"United Nations sanctions are working. When we just decree something, that doesn't work.\"\n\nWe asked Duke University political science professor Peter Feaver, who worked for the National Security Council in 1993-94 and 2005-07, if there would be reason to oppose some Iran sanctions and support others.\n\n\"Critics of unilateral sanctions say they let other countries free-ride on our tough policies -- better to get multilateral sanctions where everyone joins in,\" he told PolitiFact in an email. \"Proponents of unilateral sanctions say that they work to leverage multilateral sanctions, toughening them up beyond the lowest-common-denominator approach that typically characterize multilateral sanctions.  \n\n\"Also, some forms of unilateral sanctions -- particularly the financial levers that were used against Iran -- can overcome the free-rider problem because they forbid access to the U.S. financial system, which most countries desperately want access to. The record shows that the tough imposition of unilateral sanctions did help lead to tougher multilateral sanctions, so while Hagel's concerns were reasonable, the backers had a strong, indeed a stronger, case.\"\n\nA Congressional Research Service paper in December 2012 said that while sanctions on Iran have failed to halt its nuclear weapon program \"a broad international  coalition has imposed progressively strict sanctions on Iran’s oil export lifeline, adversely affecting Iran’s economy to the point where key Iran leaders are considering the need for a nuclear compromise.\"\n\nOur ruling\n\nRos-Lehtinen said that Hagel \"opposed sanctions against Iran, which has brazenly pursued the development of a nuclear weapon in open defiance of the international community as well as called for the destruction of one of our vital allies, Israel.\"\n\nHagel did vote against a sanction bill in 2001, didn’t join 72 colleagues in co-sponsoring a sanction bill in 2007, voted against an amendment in 2007 that would have labeled an Iranian group terrorists and voted \"no\" in committee in 2008. But he voted in favor of sanction bills in 1998 and 2000, and another such bill passed by unanimous consent while he was in the Senate in 2006. Hagel often said unilateral sanctions don’t work, but he showed more support for multilateral sanctions.\n\nWhen Ros-Lehtinen said Hagel \"opposed sanctions against Iran\" she oversimplified his lengthy history of votes and comments. We rate this claim Half True.", "U.S. Rep. Ileana Ros-Lehtinen, \"With Hagel nominated as secretary of defense, Ros-Lehtinen says his views concerning Iran, Israel and Cuba run contrary to U.S.national interests,\" Jan. 8, 2013\n\nU.S. Rep. Ileana Ros-Lehtinen, Hagel’s record on Iran sanctions, Jan. 9, 2013\n\nAtlantic Council, Hagel fact sheet, Dec. 19, 2012\n\nPolitiFact, \"Pro-Israel group depicts Obama and Hagel disagreeing on Iran,\" Jan. 8, 2013  \n\nU.S. Library of Congress, Iran and Libya Sanctions Act, Senate vote July 25, 2001\n\nU.S. Library of Congress, Iran Counter-Proliferation Act, Introduced March 22, 2007\n\nU.S. Library of Congress, Comprehensive Iran sanctions, accountability and divestment act, Introduced Aug. 1, 2008\n\nU.S.  Library of Congress, Iran Missile Proliferation Sanctions Act, Vetoed by the President June 23, 1998\n\nU.S. Library of Congress, Iran Nonproliferation Act, Senate vote Feb. 24, 2000\n\nU.S. Library of Congress, Iran Freedom Support Act, Passed Senate Sept. 30, 2006\n\nU.S.  Library of Congress, Senate Amendment 3017, Sept. 26, 2007\n\nNew York Sun, \"Hagar the horrible,\" Oct. 2004\n\nForeign Policy, \"Chuck Hagel does not like sanctions,\" Dec. 17, 2012\n\nABC News, \"Iran sanctions: Chuck Hagel versus Obama, Biden and Kerry,\" Jan. 9, 2013\n\nDalje.com, \"U.S. Senate panel approves Iran sanctions,\"  July 17, 2008\n\nHuffington Post, \"Dems blame Senate GOP for blocking Iran sanctions  bill,\" Oct. 3, 2008\n\nThe Atlantic Council, Chuck Hagel, Accessed Jan. 8, 2013\n\nLos Angeles Times, \"Chuck Hagel’s nomination as defense secretary to come Monday,\" Jan. 6, 2013\n\nLos Angeles Times, \"Obama likely to nominate Chuck Hagel for defense secretary,\"Jan. 4, 2013\n\nMother Jones, \"Hagel’s half-courageous stand on the Iraq war,\"Jan. 7, 2013\n\nReuters, \"Chuck Hagel forged bond with Obama on Iraq,\"Jan. 6, 2013\n\nForeign Policy, \"Is Chuck Hagel toast?\" Dec. 24, 2012\n\nWashington Post,  \"Chuck Hagel’s ambiguous stance on dealing with Iran,\" Dec. 13, 2012\n\nWashington Post, \"Iran becomes issue in Democratic contest,\" Oct. 25, 2007\n\nCouncil on Foreign Relations, \"A conversation with Senator Chuck Hagel on the Middle-East and U.S. Foreign Policy,\"Nov. 15, 2005\n\nCouncil on Foreign Relations, \"A conversation with Senator Chuck Hagel,\" May 8, 2007\n\nAtlantic Council, \"Chuck Hagel delivers speech for J Street First National Conference,\"Oct. 27, 2009\n\nAl-Monitor, \"Hagel praises Obama on Syria, chides GOP on Iran,\" March 2012\n\nCNN, Transcript of interview with Sen. Chuck Hagel, Accessed in Nexis, April 2, 2006\n\nWashington Post, \"Attacking Iran may trigger terrorism,\"April 1, 2006\n\nWashington Post op-ed,\"Iran talk: What’s in a war?\"Sept. 28, 2012\n\nNew York Times, \"U.S. backs off sanctions seeing poor effect abroad,\" Accessed in Nexis, July 31, 1998\n\nCQ, \"Senate banking approves renewal of sanctions,\" Accessed in Nexis, July 18, 2001\n\nCQ, \"Clinton olive branch to Iran draws mixed reaction on the Hill,\" Accessed in Nexis, March 17, 2000\n\nAP, \"Albright beckons Iran to work with the United States,\" Accessed in Nexis, March 17,  2000\n\nFederal News Service, Transcript of Sen. Chuck Hagel speech at Brookings, Accessed in Nexis, May 24, 2001\n\nAP,  \"Hagel calls for end to sanctions against Iran, Libya,\" Accessed in Nexis, June 28, 2001\n\nOmaha World-Herald,  \"Hagel carves niche as ‘internationalist,\" Accessed in Nexis, Aug. 8, 1999\n\nOmaha World-Herald, \"Sanctions aimed at Iran,Libya should be dropped, Hagel says,\" Accessed in Nexis, June 28, 2001\n\nLincoln Journal Star, \"Sen. Hagel urges direct talks not war with Iran,\" Nov. 9, 2007\n\nBrookings, \"Hagel speech: Memo to the candidates,\" June 26, 2008\n\nCongressional Research Service,  \"Iran sanctions,\" Dec. 7, 2012\n\nFederal News Service transcript, Hearing of the International  Economic Policy, Export and Trade Promotions subcommittee  of the Senate foreign relations committee, Accessed in Nexis, March 25, 1998\n\nFactcheck.org, \"Haggling over Hagel’s record,\" Jan.  10, 2013\n\nAbout the Atlantic Council, Accessed Jan. 10, 2013\n\nGOP, Chuck Hagel’s world, Jan. 7, 2013\n\nInterview, Alex Cruz, spokesman for U.S. Rep. Ileana Ros-Lehtinen, Jan. 9, 2013\n\nInterview,  Danielle Pletka, vice president of foreign and defense policy studies at the American Enterprise Institute, Jan. 9, 2013\n\nInterview, Peter Feaver, Duke University political science professor, Jan. 10, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]