["With the caption “retweet indicates someone is fighting for Pakistan in India”, Minister of State for Micro, Small and Medium Enterprises Giriraj Singh, on October 25, tweeted a screenshot of Rahul Gandhi’s tweet on former CBI Director Alok Verma. Gandhi’s tweet was retweeted by a Twitter account “Pakistan Defence” and the language used by Giriraj Singh in his tweet attempted to imply that the Congress President is supported by Pakistan’s Defence wing. His tweet was liked over 1,500 times and retweeted 810 times at the time of writing this article.", "Retweet indicates that someone is fighting for Pakistan in India. pic.twitter.com/5mcEPznqtK", "— Shandilya Giriraj Singh (@girirajsinghbjp) October 25, 2018", "Anurag Dixit also made the identical claim, with his tweet drawing over 1,000 retweets. Dixit is followed by top leaders of the BJP, including Prime Minister Narendra Modi.", "Allies of @RahulGandhi are retweeting him. Indeed a proud moment. pic.twitter.com/wNfCdy1fud", "— Anurag Dixit (@bhootnath) October 25, 2018", "Several others who are followed by the office of Railway Minister Piyush Goyal also circulated that the Pakistani Defense wing retweeted Rahul Gandhi’s tweet.", "Within hours of the aforestated tweets, it was pointed out that the account which retweeted Rahul Gandhi’s tweet wasn’t the official handle of the Defense Ministry of Pakistan. However, none of those who made the claim took down their tweets.", "There are several clues that indicated that the Twitter account “Pakistan Defence” (@defencedotpk), which retweeted Rahul Gandhi, has nothing to do with Pakistan’s Defence Wing:", "Numerous unofficial/parody accounts are active on social media and it is common to fall for them. Alt News had earlier reported how parody accounts of several news organisations fooled individuals on the internet. In June this year, a parody account of Warren Buffet escaped the noticed of The Economic Times which published one of its tweets on the daily. Several social media users had also fallen for a parody handle dedicated to Tripura CM Biplab Deb.", "However, a cabinet minister posting the screenshot of a retweet by the Twitter handle of an online forum to imply that Rahul Gandhi is “fighting for Pakistan in India” cannot be ignored as a mere slight. Despite several social media users pointing out the falseness of the retweet, Giriraj Singh and others are yet to take down their tweets and issue a clarification.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]