["About this rating", "On 25 June 2018, the propaganda Facebook page \"redpillfactory\" (which uses the page name \"Make Britain Great Again\") posted a photograph which supposedly showed \"US Democrat party supporters [sic]\" protesting in the United States.", "The image was posted in an apparent attempt to mock American \"libtards.\" We have censored it, but it may still be considered unsafe for work:", "Meet the libtards who said Trump fans are crazy! US Democrat party supporters protest.", "This image was not taken in the United States and is not a protest against American or British politics. The photograph instead comes from Buenos Aires, Argentina in May 2017, and it shows a \"flash mob\" that appeared outside Argentina's Casa Rosada (also known as the \"Pink House,\" the country's presidential palace) to protest ongoing violence against women:", "Feminist demonstrators have taken part in a naked flash mob protesting gender-based violence in Argentina’s capital of Buenos Aires.", "Displaying a banner that read \"Femicide is Genocide,\" dozens of women demonstrated on Tuesday in front of three buildings that represent the country’s democratic institutions: the parliament, the presidential palace, Casa Rosada, and Argentina’s highest court.", "Femicide, the act of killing a women specifically because of her gender, is a serious issue in many countries, as is feminicide — the act of killing a woman specifically because she is a woman, but with the additional layer of the state's tacit or stated approval. The National Registry of Femicides published by Argentina's Supreme Court reports that there were 254 femicides in 2016:", "The number and viciousness of femicides — or the killing of women simply because they are women — in Argentina is so extreme that many officials have called it a national emergency. According to the Supreme Court’s Women’s Office, which currently provides the only official national statistics on femicides, there were 254 such killings last year, up from 235 in 2015, and 225 in 2014. This year is likely to exceed that: Activists have already recorded 133 femicides between January and May.", "This photograph is genuine, but it was not taken in the United States and has nothing directly to do with American politics.", "Zabludovsky, Karla.   \"This Woman Devoted Her Life To Keeping Women Safe. And Then A Man Killed Her.\"\r\n    Buzzfeed.   29 October 2017.", "Henao, Luis.   \"Argentina Group to Fight Violence Against Women.\"\r\n    Associated Press.   24 June 2017.", "Persio, Sofia.   \"Naked Flash Mob in Argentina Demonstrates Against Sexism and Gender-Based Violence.\"\r\n    Newsweek.   31 May 2017.", "Human Rights Watch.   \"World Report 2018: Argentina.\"\r\n    Retrieved 25 June 2018.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]