["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "False flag theories persist as the man suspected of sending explosives to critics of President Donald Trump faces federal charges. News reports have described the 56-year-old as a registered Republican. But bloggers peddling a narrative that suggests liberals are behind the pipe bomb plot argue that until recently, Sayoc belonged to the Democratic Party.", "\"A lifelong Democrat recently registered as a Republican, covered his van with Trump stickers and began sending bombs that didn’t explode to Democrats,\" reads a post that appeared on Facebook on Oct. 26. \"And you have to ask why Americans find that suspicious?\"", "This story was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "According to the Florida Department of State, Sayoc registered with the Republican Party of Florida on March 4, 2016, less than two weeks before Trump won the Florida Republican presidential primary.", "But records from the Miami-Dade County Elections Department show that on two occasions in October 2012 — Oct. 9 and Oct. 26 — Sayoc initiated, but didn’t complete, new voter registration applications. Both times, he checked the box next to \"Republican Party\" as his party affiliation.", "On Oct. 9, 2012, he checked the box that said his was a \"new registration,\" but it appears he left blank the answer to a question about whether he’d ever been \"adjudicated mentally incapacitated with respect to voting.\" On Oct. 26, 2012, he didn’t check any of the boxes indicating the reason behind his registration application (i.e. new registration, address change, name change, party change, etc.) Near the top of that form, someone scribbled, \"INCOMP,\" indicating it was incomplete. As provided to PolitiFact in response to a public records request, copies of both Sayoc’s 2012 applications show blank space in the section that asks for a Florida driver’s license, identification number or the last four digits of the applicant’s Social Security number.", "Florida election code states that if any of these pieces of information are not included in a voter registration application, the registration is considered incomplete.", "Sayoc’s application to vote remained incomplete until March 4, 2016, according to the department, when he provided his information in full, updated his mailing address and once again reported that his party affiliation was Republican. Also on the 2016 form, the box next to \"new registration\" is checked as the reason behind the application. The box next to \"party change\" is blank.", "Though Sayoc successfully registered to vote before Trump won the March 15 Florida presidential primary, his application still apparently came too late to be eligible to vote in that election. In Florida, the deadline to register in order to participate in an upcoming election is 29 days before the election.", "But Sayoc’s voting record seems to indicate that, after that, he was motivated to get his vote out: He went on to cast a ballot early three times — in the 2016 August primary, the 2016 general election and the August 2018 primary.", "Friends and other people who know Sayoc have said that he never showed an interest in politics until Trump came on the political scene, The Washington Post reported on Oct. 27. He started sharing pictures of himself at campaign events on Facebook. Ronald Lowy, a lawyer who represented Sayoc in a fraud case, told the paper Sayoc had \"no interest in politics… and along came the presidential campaign of Donald Trump, who welcomed all extremists, all outsiders, all outliers, and he felt that somebody was finally talking to him.\"", "\"He registered as a Republican to vote in Florida — Lowy said he believes it was for the first time in Sayoc’s life — in 2016,\" the story says.", "An Oct 26 post on Facebook states that, \"A lifelong Democrat recently registered as a Republican, covered his van with Trump stickers and began sending bombs that didn’t explode to Democrats. And you have to ask why Americans find that suspicious?\"", "We found no evidence that Sayoc was a \"lifelong Democrat.\" And while it’s true that state records show that Sayoc registered to vote relatively recently, in 2016, an application from 2012 shows that Sayoc then considered himself a member of the Republican Party.", "We rate this claim False.", "Facebook post, Oct. 26, 2018", "The Washington Post, \"Who is Cesar Sayoc? What we know about the suspect mail bomber arrested in Florida,\" Oct. 26, 2018", "Criminal complaint against Cesar Altieri Sayoc, Oct. 26, 2018", "Florida Department of State, Voter Information Lookup for Cesar Sayoc, accessed Nov. 4, 2018", "Politico, \"Donald Trump wins Florida Republican primary,\" March 15, 2018", "North Carolina State Board of Elections & Ethics Enforcement, Voter Search, accessed Nov. 4, 2018", "The Washington Post, \"Who is Cesar Sayoc? What we know about the suspect mail bomber arrested in Florida,\" Oct. 26, 2018", "Tampa Bay Times, \"Bombing suspect is registered to vote in Miami-Dade, voted in August GOP primary, 2016 election,\" Oct. 26, 2018", "Miami-Dade County Elections Department’s public voter records for Cesar Sayoc, Jr., including  voting history, and registration applications from Oct. 9, 2012, Oct. 26, 2012 and March 4, 2016, obtained Oct. 26, 2018", "The Florida Election Code, Florida Department of State, accessed Nov. 4, 2018", "The Washington Post, \"‘He felt that somebody was finally talking to him’: How the package-bomb suspect found inspiration in Trump,\" Oct. 27, 2018", "Email correspondence with Suzy Trutie, deputy supervisor, Miami-Dade County Elections Department, Oct. 26, 2018", "Sayoc did not turn up in a search of registered and removed or denied voters in North Carolina, where he attended Brevard College.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]