["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "This “breaking news” image is from an online news generator and not based on any real news coverage.", "There is still no vaccine or medical treatment for the 2019 Novel Coronavirus.", "The Novel Coronavirus has been surrounded by panic and misinformation since its discovery in December 2019. The most recent false claim is that cocaine is the cure.", "Images of breaking news stories claiming that cocaine is the newest remedy to coronavirus are being reposted on Twitter and Facebook. One Facebook post from Jan. 30 included an image of a bag of cocaine in the background of a news banner that says \"Cocaine kills corona virus\" and \"Scientists is shocked to discover that this drug can fight the virus.\" No, this grammatically challenged image was not from a real breaking news alert. This image is made by an online news generator. There is still no cure for the coronavirus.", "This post was flagged by Facebook as part of efforts to combat false news and information on its News Feed. (Read more about our partnership with Facebook.)", "The breaking news format of this social media claim came from a website that allows you to create your own breaking news stories by uploading your own image and headline into a generator. The waterstamp \"breakyourownnews.com\" in the top right corner is blurred out in the Facebook post. In the original image of the bag of cocaine, which can be found on multiple stock image sites, there was no blurry white spot in the corner.", "This breaking news image is fabricated. If there were a cure for the Novel Coronavirus, we wouldn’t count on it being a stimulant like cocaine. Cocaine is a highly addictive drug that can lead to long-term respiratory problems and movement disorders like Parkinson’s disease, according to the National Institutes of Health.", "In 2017 there were a total of 13,942 drug overdose deaths in the United States that involved cocaine. There have been 1,016 deaths reported worldwide from the coronavirus as of Feb. 10, none in the United States.", "We wouldn’t recommend trying a highly addictive drug in hopes of fighting off a viral disease. We rate this Pants on Fire!", "Tweet, Feb. 3, 2020", "Facebook post, Jan. 30, 2020", "The Breaking News Generator, visited on Feb. 7, 2020", "iStock by Getty Images, April 3, 2018", "Bigstock, visited on Feb. 7, 2020", "Adobe Stock, visited on Feb. 7, 2020", "CDC, Prevention, Treatment of Novel Coronavirus, Feb. 3, 2020", "NIH, Cocaine, July 2018", "CDC, Drug Overdose Deaths Involving Cocaine and Psychostimulants with Abuse Potential, May 3, 2019", "The New York Times, A Grim Landmark as Official Death Toll in China Tops 1,000, Feb. 10, 2020", "CDC, 2019 Novel Coronavirus(2019-nCoV) in the US, Feb. 10, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]