["By Eugene Kiely, Lori Robertson, Robert Farley, Brooks Jackson and D'Angelo Gore", "Posted on January 9, 2019 | Updated on January 10, 2019", "In a national address, President Donald Trump called on Congress to provide $5.7 billion for a border wall to address what he called a “crisis” on the border. The president made some false and misleading claims, and provided some facts without context:", "Trump, who campaigned on a promise to build a wall along the Southwest border, delivered a nationally televised address to urge Congress to end the budget stalemate and provide his administration with $5.7 billion in border security funds.", "The president, who spoke as the partial government shutdown entered its 18th day, repeatedly used the word “crisis” to describe the border situation. What are the facts?", "It’s true that in recent months the number of people caught trying to cross the U.S.-Mexico border illegally has risen, and was actually higher in November (the most recent month for which the U.S. Customs and Border Protection has published figures) than it was when Trump was sworn in.", "But the total remains far below what it was several years ago, before President George W. Bush doubled the number of Border Patrol agents.", "During the first 11 months of last year, the average monthly number of apprehensions was not much above what it was in Barack Obama’s last year in office, and it was less than one-third of what it had been in 2000, before the big surge in the number of agents at the border. (Our apprehension numbers come from U.S. Border Patrol historical figures, updated with the most recent figures from the website of its parent, U.S. Customs and Border Protection.)", "Trump made the misleading claim that: “Every day, Customs and Border Patrol agents encounter thousands of illegal immigrants trying to enter our country.”", "In October and November, Border Patrol made 102,857 apprehensions at the Southwest border, according to data from Customs and Border Protection. That works out to roughly 1,700 apprehensions each day.", "Trump may get to “thousands” per day by including 20,371 additional people who presented themselves at ports of entry on the Southwest border but were deemed “inadmissible” to the U.S. Those individuals, however, sought to enter the country legally, not illegally.", "Furthermore, in fiscal year 2018, Border Patrol made 396,579 apprehensions at the Southwest border, or just under 1,100 each day. Including inadmissible individuals who lawfully tried to enter through a port of entry only increases the figure to over 1,400 per day.", "Trump suggested that 20,000 children were illegally brought into the country last month by “vicious coyotes and ruthless gangs,” but there’s no evidence of that in the available statistics.", "Trump, Jan. 8: Last month, 20,000 migrant children were illegally brought into the United States, a dramatic increase. These children are used as human pawns by vicious coyotes and ruthless gangs.", "The data from Customs and Border Protection show that 25,172 family units were apprehended by the Border Patrol in November. “Family units” are individuals, including children and parents or legal guardians, that were caught with a family member.", "We wrote about the issue of adults trafficking children to the border in June, when Department of Homeland Security Secretary Kirstjen Nielsen claimed there had been a “314 percent increase” in such fraudulent cases over the previous five months. That sounded like a large increase, but not so much when the raw numbers were revealed.", "DHS confirmed to us that there were 191 suspected fraudulent cases in the first five months of fiscal 2018. That was 0.61 percent of the total family unit apprehensions in that time period.", "Similarly, the Washington Post reported in November that CBP had separated 170 such fraudulent “families” between April 19 and Sept. 30 last year. In September alone, there were 16,658 family units apprehended, so the 170 figure is a small fraction of the families stopped trying to illegally cross the border.", "As for parents traveling with children overall, those numbers have increased in recent years. We only have data going back to fiscal 2013, when 14,855 people apprehended on the Southwest border were part of a “family unit.” The number jumped significantly in fiscal 2014 to 68,445. For fiscal 2018, 107,212 family units were apprehended.", "Update, Jan. 10: DHS spokeswoman Katie Waldman told the Washington Post Fact Checker that 19,313 children were apprehended on the Southwest border in December, a number that includes both those traveling in a family unit and unaccompanied children. So, if that’s the number the president is using, it refers to all children, not only those the administration suspects aren’t traveling with a legitimate parent or guardian. But, as we explained, the suspected cases of fraudulent child-parent relationships have been a tiny fraction of all family unit apprehensions.", "Trump said “the border wall would very quickly pay for itself” by stopping the flow of illegal drugs. “The cost of illegal drugs exceeds $500 billion a year — vastly more than the $5.7 billion we have requested from Congress,” Trump said.", "The president overstated the economic cost of illegal drugs.", "In a 2017 report, the White House Council of Economic Advisers estimated “the economic cost of the opioid crisis was $504.0 billion” in 2015 — but it is not all “illegal drugs,” as the president said. That figure “includes individuals who abuse prescription painkillers such as OxyContin and Vicodin and individuals who abuse heroin or other illicit opioids,” the report said. The Centers for Disease Control and Prevention has said that prescription drugs were involved in more than 35 percent of all opioid overdose deaths in 2017.", "More to the point, Trump falsely claims that the wall would pay for itself by stopping the flow of illegal drugs. As we have written more than once, the majority of illicit drugs is smuggled through legal ports of entry.", "In its most recent National Drug Threat Assessment, the Drug Enforcement Administration said the Southwest border “remains the primary entry point for heroin into the United States,” and “the majority of the flow” enters through private vehicles and tractor-trailers at legal ports of entry.", "Stephen D. Morris, a Middle Tennessee State University political science professor whose research has largely focused on Mexico, told us for a story last year that “the wall will not do very much to stop drugs.”", "Trump continued to claim that he is staying true to his campaign pledge that Mexico would pay for the border wall, insisting that Mexico will pay “indirectly” through a new international trade agreement. But that’s spin.", "Trump, Jan. 8: The wall will also be paid for, indirectly, by the great new trade deal we have made with Mexico.", "The United States-Mexico-Canada Agreement was signed on Nov. 30 by the leaders of all three countries, but it still must be ratified by Congress. Even if it is, though, there is nothing in it specifying that Mexico will pay for any border wall.", "The president’s argument is that Mexico will pay “indirectly” because of benefits that accrue to the U.S. through the new trade agreement. But economists told us that while the trade agreement is arguably a slightly more advantageous deal for the U.S. than its predecessor, the North American Free Trade Agreement, it won’t generate enough additional federal revenues to pay for the border wall, and shouldn’t be construed as Mexican payments, anyway.", "“Even if we accept conceptually the argument that government revenue attributable to the revised trade agreement constitutes ‘Mexico paying for the wall,’ there are no plausible assumptions of USMCA’s impact that would see government revenue increase by $25 billion,” said Geoffrey Gertz, a fellow in the Global Economy and Development program at the Brookings Institution and a research associate at the Global Economic Governance Programme at the University of Oxford.", "Kent Smetters, a professor of business economics and public policy at the University of Pennsylvania’s Wharton School, agreed.", "“Relative to NAFTA, the Mexican government would not nearly lose enough tariff revenue that could be constituted as paying for the wall, at least the wall as previously envisioned by the Administration; nor would the U.S. government revenue increase enough based on a dynamic score,” said Smetters, who was an economist at the Congressional Budget Office in the 1990s. “In fact, the additional revenue to U.S. relative to NAFTA would, optimistically, not cover annual maintenance and improvements of the wall much less the original build.”", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]