["President Donald Trump speaks during a news conference in the Rose Garden of the White House, July 14, 2020, in Washington. (AP/Evan Vucci)", "Biden opposes using public dollars to pay for private school tuition.", "Biden’s education policies include support for charter schools and public school choice.", "On President Donald Trump’s list of \"really bad\" ideas in the Biden-Sanders unity platform, one involved school choice.", "\"There is nothing that the African American community wants more than school choice,\" Trump said in a July 14 Rose Garden speech. \"Joe Biden wants to end school choice.\"", "Does he?", "The Biden campaign says he’s fine with school choice, just not the variety Trump has in mind.", "We reached out to the Trump campaign and the White House and didn’t hear back.", "For many Republican leaders, school choice is synonymous with vouchers to help families pay for tuition at private schools. Read that way, Trump has a point. But even Michigan, which ranks among the top states for charter school enrollment and has active school choice programs, has no voucher program.", "So school choice is not a yes-no deal. There’s a range of policies that runs from telling parents and kids they can only go to schools in their designated area to giving them private school vouchers. In between those two poles are several options that include charter and specialized magnet schools. Biden’s policy falls somewhere in the middle.", "The unity platform emerged from discussions between advisers to the Biden and Bernie Sanders campaigns seeking to bridge differences between Democratic Party factions before the general election campaign heats up. The 110-page list of recommendations never mentions the term \"school choice.\"", "It does recommend ending one federally funded program that exists only in the District of Columbia. It’s called the Opportunity Scholarship Program, and in 2019, 1,732 students in the program used taxpayer-funded vouchers to go to private schools. About 80% of the students were Black and 42% came from households that receive food stamps or welfare. The yearly cost is about $20 million.", "The unity platform (page 83) says the program \"has consistently failed to demonstrate academic effectiveness.\"", "The latest federal study largely backs that up. It found that after three years, \"those offered scholarships were doing no better academically, but also no worse than otherwise similar peers.\"", "The value of the program is a matter of debate. Created in 2004 when Republicans held power, its funding tends to drop during Democratic administrations.", "The unity platform presses for other changes that target charter schools. It opposes for-profit and low-performing charters, and it would give local school districts a powerful say over the use of federal funds to open new charter schools or expand existing ones.", "The Biden campaign said he’s firmly against using public money for private K-12 schools. Here’s the full statement we received:", "\"Joe Biden opposes the Trump/(Betsy) DeVos conception of ‘school choice,’ which is private school vouchers that would destroy our public schools. He's also against for-profit and low-performing charter schools, and believes in holding all charter schools accountable. He does not oppose districts letting parents choose to send their children to public magnet schools, high-performing public charters or traditional public schools.\"", "As part of a broader education policy outlined on his website, Biden calls for nearly tripling the Title 1 funding for aid to schools serving lower income neighborhoods and raising teacher pay.", "The Trump-Pence 2020 website claims that Biden said \"that if he’s elected, charter schools are gone.\" The campaign links to a comment Biden made at a December 2019 forum on public schools. Biden was attacking Education Secretary Betsy DeVos’ policy on student sexual assault accusations. At the very end of condemning that policy on assaults, he said, \"If I’m president, Betsy DeVos’ whole notion from charter schools to this are gone.\"", "Biden didn’t otherwise discuss charter schools or school choice broadly.", "EdChoice, an advocacy group that aims \"to advance educational freedom and choice,\" lists a number of practices that fall under the school choice umbrella. In addition to vouchers, that list includes charter schools, specialized magnet schools (for example, for math and science or the arts) and allowing students to choose which public school they want to attend.", "Biden’s platform includes all of those elements except vouchers.", "\"There are several ways to have choice,\" said Andre Perry at Brookings, a Washington policy research center. \"He doesn’t want public dollars to go to private schools. That still leaves room for choice.\"", "Corey DeAngelis, an adjunct scholar at the libertarian Cato Institute and director of school choice at the Reason Foundation, says Trump's accusation about Biden seeking to end school choice is ambiguous.", "\"Did Trump mean all school choice, private school choice, or school choice for some families?\" DeAngelis said. \"It would have been more accurate for him to say something like ‘Biden wants to end some forms of school choice,’ or ‘Biden wants to limit school choice.’\"", "For school reform researcher Thomas Toch, director of FutureEd at Georgetown University's McCourt School of Public Policy, Biden sits somewhere to the right of some Democratic party activists.", "\"He has not embraced the progressive wing's strong opposition to any type of school choice,\" Toch said. \"He’s for choice, but not all forms of it. There are many centrist Democrats who are in the same position.\"", "One final point about the D.C. Opportunity Scholarship voucher program that Biden opposes:", "Washington, D.C., has a lottery program that assigns interested students to the nonprofit charter or traditional public school of their choice. Not every student gets to go where they want, but the latest report on the scholarship program suggested that \"the OSP’s lack of effectiveness might be related to D.C. families’ already-widespread access to school choice.\"", "Trump said that Biden wants to end school choice.", "Biden wants to end voucher programs that use public money to pay for private school tuition. He also opposes for-profit and low-performing charter schools.", "But he supports good charter schools and allowing students to pick among public schools. Those also qualify as school choice options.", "Trump’s sweeping accusation goes too far. We rate this Mostly False.", "White House, Remarks by President Trump in Press Conference, July 14, 2020", "Joe Biden for President, BIDEN-SANDERS UNITY TASK FORCE RECOMMENDATIONS, July 8, 2020", "Statement on school choice policy, Press office, Biden for President, July 16, 2020", "Joe Biden for President, Education, accessed July 16, 2020", "Schott Foundation for Public Education, Joe Biden on Public Education, Dec. 14, 2019", "Trump Pence 2020, HEARTLESS: JOE BIDEN WOULD FORCE STUDENTS INTO FAILING SCHOOLS, July 13, 2020", "EdChoice, Types of School Choice, accessed July 16, 2020", "U.S. Education Department, District of Columbia Opportunity Scholarship Program, accessed July 16, 2020", "Serving Our Children, The D.C. Opportunity Scholarship Program, accessed July 16, 2020", "Institute of Education Sciences, Evaluation of the DC Opportunity Scholarship Program, May 2019", "National Alliance for Charter Schools, A growing movement, January 2019", "CATO Institute, School Choice Works — for a Third of the Cost, May 16, 2019", "Washington Post, The weakness in D.C.’s voucher program, Sept. 1, 2017", "District of Columbia Public Schools, Lottery results 2020-2021, accessed July 16, 2020", "District of Columbia Public Schools, SY20-21 District of Columbia Public Schools Enrollment and Lottery Handbook, January 2020", "Obama for President, BARACK OBAMA AND JOE BIDEN’S PLAN FOR LIFETIME SUCCESS THROUGH EDUCATION: 2008, accessed July 16, 2020", "Interview, Andre Perry, fellow, Metropolitan Policy Program, Brookings Institution, July 16, 2020", "Interview, Thomas Toch, director, FutureEd, Georgetown University's McCourt School of Public Policy, July 17, 2020", "Email exchange, Jon Valant, senior fellow, Brown Center on Education Policy, Brookings Institution, July 16, 2020", "Email exchange, Corey DeAngelis, director of School Choice, Reason Foundation, July 16, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]