["About this rating", "New England Patriots quarterback Tom Brady now has enough Super Bowl rings to cover every finger of one hand. But he did not show off his middle digit to NFL commissioner Roger Goodell.", "An image circulated online in the wake of the Patriots' NFL championship game win on 5 February 2017 depicts Brady holding the Super Bowl MVP trophy alongside Goodell, with the quarterback's middle finger extended in such a way that he is seemingly \"flipping the bird\" in plain sight to an unaware Goodell.", "In reality, the footage of the actual trophy presentation shows Brady standing alongside Goodell with two fingers extended, as seen below:", "Patriots fans have reportedly held a grudge against Goodell since the league launched an investigation in January 2015 into rumors that the team had used under-inflated balls during their AFC championship game victory that year against the Indianapolis Colts, a controversy that was quickly dubbed \"Deflategate.\"", "The league imposed a four-game suspension on Brady in May 2015, a decision Goodell upheld on 28 July 2015, prompting a lawsuit on the quarterback's behalf by the NFL Players Association.", "Federal judge Richard M. Berman vacated the suspension in a 3 September 2015 ruling. However, a federal appeals court reinstated the suspension in a 25 April 2016 ruling.", "On 15 July 2016, two days after the appeals court denied his request for another hearing, Brady announced on his Facebook page that he would serve his suspension for the first four games of the 2016 season.", "Patriots.com.   \"Roger Goodell Presents Tom Brady with Super Bowl MVP Trophy.\" \r\n    6 February 2017.", "Rosenthal, Greg.   \"Roger Goodell Upholds Tom Brady Suspension.\" \r\n    NFL.com.   28 July 2015.", "Dzen, Gary.   \"Judge Vacates Tom Brady’s Deflategate Suspension.\" \r\n    Boston.com.   3 September 2015.", "Orr, Conor.   \"Tom Brady's Four-Game Suspension Reinstated by Court.\" \r\n    NFL.com.   25 April 2016.", "Golen, Jimmy.   \"Brady to Drop Appeal, Serve 4-game 'Deflategate' Suspension.\" \r\n    Associated Press.   15 July 2016.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]