["By Eugene Kiely", "Posted on March 2, 2017", "Sen. Claire McCaskill called on Attorney General Jeff Sessions to resign for failing to disclose during his Senate confirmation hearing that as a senator he met twice with the Russian ambassador in 2016. As a point of contrast, McCaskill said, she had “no call from, or meeting with, the Russian ambassador. Ever.” As a point of fact, that turned out to be false.", "Within a few hours, McCaskill acknowledged in a tweet that she did meet with Sergey Kislyak, the Russian ambassador to the United States, four years ago on the issue of international adoptions with other senators.", "McCaskill’s false Russian claim was in response to a March 1 Washington Post article on two meetings that Sessions, then a senator from Alabama, had with Kislyak in 2016. At the time, Sessions was a high-profile surrogate for Donald Trump’s campaign. “One of the meetings was a private conversation between Sessions and Russian Ambassador Sergey Kislyak that took place in September in the senator’s office, at the height of what U.S. intelligence officials say was a Russian cyber campaign to upend the U.S. presidential race,” the Post reported.", "The Justice Department, which is headed by Sessions, is now investigating alleged contacts between Russians and the Trump campaign.", "Sarah Isgur Flores, a Justice Department spokeswoman, told the Post that Sessions met with Kislyak not as a campaign surrogate, but as a member of the Senate Armed Services Committee. “He was asked during the hearing about communications between Russia and the Trump campaign — not about meetings he took as a senator and a member of the Armed Services Committee,” Flores said.", "The morning after the story broke, McCaskill issued a statement calling on Sessions to resign and accusing him of misleading the Senate Judiciary Committee during his confirmation hearing when he told the senators, “I did not have communications with the Russians.” McCaskill, who sits on the Armed Services Committee, tried to cast suspicion on Sessions’ meeting with Kislyak by noting that as a committee member she never met with the Russian ambassador.", "McCaskill, March 2: It’s clear Attorney General Sessions misled the Senate — the question is, why? I’ve been on the Senate Armed Services Committee for 10 years, and in that time, have had no call from, or meeting with, the Russian ambassador. Ever. That’s because ambassadors call members of Foreign Relations Committee. Attorney General Sessions should resign.", "Around 7 a.m., McCaskill also tweeted about Sessions’ meeting with Kislyak and included her claim that she never met with the Russian ambassador.", "I've been on the Armed Services Com for 10 years.No call or meeting w/Russian ambassador. Ever. Ambassadors call members of Foreign Rel Com.", "— Claire McCaskill (@clairecmc) March 2, 2017", "It was quickly pointed out by some that McCaskill, in fact, did meet with Kislyak.", "Charles C.W. Cooke, editor of the National Review Online, tweeted images of two McCaskill tweets about the Russian ambassador. In 2013, McCaskill tweeted that she was “off to meeting w/Russian ambassador” on international adoptions, and in 2015 she said she had “calls with British, Russian, and German Ambassadors” in regards to the Iran nuclear deal.", "Claire McCaskill says she’s had “no call or meeting w/Russian ambassador. Ever.” But she tweeted about two. It’s easy to forget. pic.twitter.com/kavd29WOg5", "— Charles C. W. Cooke (@charlescwcooke) March 2, 2017", "Shortly after 10:30 a.m., McCaskill posted two tweets that acknowledged her meeting with Kislyak. But she added, “Never met one on one w/him.”", "Again, As senior member of Armed Serv, never received call or request from Russian Amb for meeting. Never met one on one w/him.", "— Claire McCaskill (@clairecmc) March 2, 2017", "4 years ago went to meeting of many Senators about international adoptions. Russian Amb also attended.", "— Claire McCaskill (@clairecmc) March 2, 2017", "McCaskill sought to draw a distinction between her meeting with Kislyak as part of a group of senators, and Sessions’ private meeting with the ambassador. (Sessions later in a press conference said that two of his staffers were in the meeting with him.)", "“The context here is that Attorney General Sessions met one-on-one with the Russian ambassador in the midst of a Russian cyber campaign against the U.S., and then misled the Judiciary Committee under oath about that meeting,” McCaskill’s spokeswoman, Sarah Feldman, told us in an email. “He then tried to excuse it by saying it was part of the normal course of his Armed Services Committee work. Claire has never met one-on-one with the ambassador, and never received a call from him. She did attend a group meeting about adoptions with other Senators, and had a brief proactive call with the ambassador amid calls to several other parties to the Iran nuclear deal. Attorney General Sessions, on the other hand, misled the Senate under oath.”", "Sessions has denied that he misled the senators, and we will deal with that in a separate story.", "As for McCaskill, she said that she never met with the Russian ambassador. That’s clearly false, and she cannot blame the 140-character limit on Twitter. She said the same thing in her press release.", "FactCheck.org Rating:", "Read More", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]