["About this rating", "On 24 January 2013, a man named Stephen Gorham Paddock passed away at the age of 71 in Colorado Springs, Colorado. More than 4 years later, after a man of a similar name shot and killed more than 50 people in Las Vegas, the first man's obituary was dragged around the internet as proof of a nonsensical conspiracy theory:", "This 2013 obituary for Stephen Gorham Paddock is real. However, it has nothing to do with the mass shooting in Las Vegas.", "Although conspiracy theorists correctly noted that the individual who passed away in 2013 and the gunman who opened fire on a group of concertgoers in Las Vegas had similar names, they failed to explain how this was proof of a conspiracy or what exactly the conspiracy theory entailed. Were they the same person? Did the 2013 Paddock fake his death? Did the Las Vegas shooter steal his identity? Although basic logic prevented us from completely wrapping our head around this theory, the main claim appears to be that the Las Vegas shooting was a false flag event since the shooter has been dead since 2013:", "Unsurprisingly, there are a few holes in this theory.", "For one, the man who passed away in 2013 and the Las Vegas gunmen don't actually share the same name. The 2013 obituary was written for a man named Stephen Gorham Paddock, whereas police identified the gunman as Stephen Craig Paddock. The family information contained within this obituary also doesn't match what is known about the Las Vegas shooter. Gorham's brothers, for instance, were listed as Bob and Rick, but the shooter's brother's name is Eric.", "Those spreading this conspiracy theory seem to be under the impression that there can only be one \"Stephen Paddock\" on the planet at a time. Although we can't say with certainty just how popular this name is, we can safely say that multiple people have to deal with the unfortunate circumstance of sharing a name with a killer. A brief search on Facebook, for instance, revealed dozens of people with similar names:", "In fact, the viral obituary noted that the deceased's father was also named Stephen Paddock. The Las Vegas shooter's father, on the other hand, was named Benjamin.", "Berkes, Howard.   \"Gambling, Guns Were Mainstay Of Vegas Shooter's Life.\"\r\n    NPR. 2 October 2017.", "Phillips, Dave.   \"Las Vegas Gunman’s Criminal Father Vanished From Sons’ Lives.\"\r\n    New York Times.   2 October 2017.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]