["The recent agricultural reforms face protests from farmers across the nation who fear that the legislation will not ensure Minimum Support Price (MSP) on agricultural produce. On September 24, the official account of the Indian National Congress (INC) tweeted a 46-second video questioning Prime Minister Modi’s policies and broken promises.", "सपने कुछ यूं दिखाये थे, वादों के पूरा हो जाने का, विश्वास जादूगर के जादू सा लगा था। प्रधानमंत्री ने झूठे वादों से, देश के हर वर्ग को ठगा था।। pic.twitter.com/1MrNklHzhi", "— Congress (@INCIndia) September 24, 2020", "That same day, Congress tweeted a graphic that showed an image of women from rural India. The tweet said, “The government gets revenue from the market. With that revenue, the government carries development work in rural areas. The BJP government is threatening the development of rural India by shutting down the mandi system.” This was shared by other Twitter users as well.", "सरकार को मंडी से राजस्व मिलता है, उस राजस्व से सरकार ग्रामीण क्षेत्रों में विकास कार्य करवाती है। भाजपा सरकार मंडी प्रणाली को बंद करके ग्रामीण भारत के विकास को खतरे में डाल रही है।#DeshKiBaat pic.twitter.com/lJunnOJ8Q5", "— Congress (@INCIndia) September 24, 2020", "On September 25, Priyanka Gandhi, general secretary of the All India Congress Committee in charge of eastern Uttar Pradesh, tweeted a picture of a farmer and wrote, “Before the BJP’s agriculture bill, MSP = Minimum Support Price for Farmers. After the bill is passed, MSP = Maximum Support in Profit for Capitalists. Where will the farmer go?”. Her tweet gained over 3,000 retweets. This image was posted by several other users on Twitter.", "भाजपा के कृषि बिल के पहले-", "MSP = किसानों के लिए न्यूनतम समर्थन मूल्य (Minimum Support Price)", "बिल पास हो जाने के बाद-", "MSP = पूंजीपतियों के लिए मैक्सिमम सपोर्ट इन प्रॉफिट (Maximum Support in Profit)", "किसान कहां जाएगा? pic.twitter.com/EKWMzWIYRg", "— Priyanka Gandhi Vadra (@priyankagandhi) September 24, 2020", "While the images used in these posts were clearly representational in nature, some of them were shot during UPA rule. This was also pointed out by numerous social media users. A simple reverse-image search reveals that multiple images from Congress posts were taken prior to 2014.", "At the 30-second mark in the video uploaded by Congress, the audio sarcastically states that the Ganga river has been cleaned by the BJP. The corresponding image was found on Getty Images, uploaded in 2013. Its caption reads, “Devotees cross the polluted waters of the Ganga River to take a holy dip at Sangam in Allahabad on April 14, 2013.” At the time, the Samajwadi Party formed the Uttar Pradesh government and the Congress was ruling at the center.", "This slideshow requires JavaScript.", "Similarly, the image used by Congress in a graphic on the farm bill affecting rural women was published in a 2012 article by The Economist.", "A similar pattern was observed in Priyanka Gandhi’s tweet. The image of a farmer was published by The Hindu in their article in 2013. This is a PTI image. However, this article was updated in 2016. In order to verify that the image was published in 2013 and not added later in 2016, Alt News accessed the archived link of the article on Wayback Machine. This confirmed that the image was indeed published in 2013.", "Therefore, Congress used pictures from the time the party was in power to depict the plight of farmers under the Modi government. The party could have used recent images of the ongoing farmer protests but ironically posted photographs taken prior to 2014.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]