["About this rating", "On 11 July 2018, the official Twitter account for The Late Show with Stephen Colbert shared a video purportedly showing how a German news program covered President Donald Trump's participation in a NATO summit — with a presenter hysterically laughing at Trump's assertion that Germany was a \"captive\" of Russia:", "Earlier at the #NATO summit Trump said Germany is ‘a captive of Russia.’ German news has a response. #LSSC pic.twitter.com/ypjDqgKxzW", "— The Late Show (@colbertlateshow) July 12, 2018", "This footage is several years old and has nothing to do with President Trump or German news coverage of a NATO summit.  Colbert's late-night television show satirically inserted an image of President Trump and German chancellor Angela Merkel into the video and created fictitious captions for humorous effect.", "This footage has been circulating online since at least 2010 and is actually a clip from the Austrian show \"Burgenland Aktuell\" on the former Burgenland cable TV (BKF) channel. The presenter, Nadja Ebinger, was talking about an Easter decorating custom called Eierkratzen or \"egg scratching\", which Der Tagesspiegel explained as follows (translated via Google):", "Egg scratching is an old custom for decorating Easter eggs. It is still prevalent in Slavic countries and also in Burgenland [east Austria], in Switzerland, and in Lusatia [between Germany and Poland]. It is a special scratching technique in which dyed Easter eggs are decorated by carefully inscribing them. Croatians in Burgenland are especially known for this traditional art.", "The German word \"eier\" is literally translated to \"egg,\" but it is also slang for \"balls\" or \"testicles.\" Although Ebinger's report was about the tradition of \"Eierkratzen\" involving Easter eggs, she broke into a fit of giggles when she realized that she was also inadvertently offering a presentation on \"scratching testicles.\"", "Die Presse translated a portion of Ebinger's report as follows:", "Actually, the presenter says something about the dying tradition of egg scratching in the Croatian-speaking community of Stinatz (Burgenland). But she can no longer [maintain a straight face] and begins to laugh: \"Egg scratching is part of the identity of the Croatian community and is nationally known and valued, but this cultural heritage is being threatened with extinction because only a few women dominate the technique of egg scratching. If you are looking for active egg scratchers, the choice is very small. \"", "Here's how the original clip from \"Burgenland Aktuell\" looked before its alteration:", "Tag Esspiegel.   \"Die lachende Moderatorin und die Eierkratzerinnen.\"\r\n    23 October 2013.", "Wallner, Anna-Maria.   \"Ein TV-Hoppala aus dem Burgenland im US-Fernsehen.\"\r\n    Die Presse.   12 July 2018.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]