["Several social media users have posted an image of Prime Minister Narendra Modi greeting a woman and claimed that she is Priti Adani, wife of billionaire industrialist Gautam Adani.", "This image has been shared by Twitter user @TufaniShilpa (archived link) and @anilpricha (archived link). Similarly, Twitter user @sujitsingh____ (archived link) also posted the image but sans any claim.", "अदानी की बीबी की चरण वंदना करते हुए मोदीजी की फोटु 😜😜😜😜#जयभीम pic.twitter.com/WThIdyLU9k", "— शिल्पा अंबेडकर (@TufaniShilpa) December 16, 2020", "National vice-chairman of Kisan Congress Surendra Solanki also asserted that the woman (on the right) is Priti Adani.", "इस बेरहम सरकार और सर्दी के बीच जहां किसान घनघोर ठंढ़ मे प्रतिदिन दम तोड़ रहे है। वही मोदी जी की जिद्द नतमस्तक हो कर अपने माल्किन प्रिती अडानी और नीता अंबानी के लिये तटस्थ है। @LambaAlka @HansrajMeena @_garrywalia @gurdasmaan @capt_amarinder @sherryontopp @diljitdosanjh pic.twitter.com/a3DSlASaVe", "— Ch Surender Solanki (@SurenderAICC) December 17, 2020", "It was further posted by Facebook page Plitical guruji and other users.", "This slideshow requires JavaScript.", "The image has been shared by Telugu speaking users as well.", "After a reverse image search on TinEye, we found that One India Hindi published this image in 2018. As per the article, the image was clicked in 2015. The woman in the image is Deepika Mondol, chief functionary officer (CFO) at Delhi-based NGO Divyajyoti Cultural Organisation and Social Welfare Society (DCOWS).", "A 2018 article by Amar Ujala also confirms the same. This article shows Modol’s picture with other prominent personalities like APJ Abdul Kalam, Amitabh Bachchan, Jaya Bachchan, Rajinikanth, Shahrukh Khan and Vidya Balan.", "NGO Foundation directory also lists Mondol as CFO of DCOWS. The NGO’s parent organisation is PaulFoundation.", "Using the number mentioned on NGO Foundation directory, we spoke with Samar Mondol, Deepika’s husband. “I’m aware that my wife’s picture with PM Modi is being circulated with a false claim. I can’t recollect which year this image was clicked. However, it is probably from a DCOWS event,” he said.", "Thus, an image of PM Modi and Deepika Mondol was shared with the false claim that the woman is Priti Adani.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]