["About this rating", "On 1 May 2019, the Facebook page \"Country n Garden\" shared an image that supposedly showed a turtle with unique markings on its shell resembling a spelling of the word \"God\":", "This Facebook post was captioned: \"Hey Look! The Artist signed His Name\"", "Instances of pareidolia, the phenomena of people's seeing words or objects in a seemingly random pattern, are certainly open to interpretation. While many viewers may recognize the word \"God\" on this turtle's shell, others may see \"Goid,\" \"Goo\" or nothing at all. Regardless of how one interprets the markings on the shell, this photograph of a turtle is an unaltered one.", "In July 2018, this same picture racked up more than 230,000 shares after it was posted to Facebook. A few months later, it generated another 200,000 shares. And every time this image goes viral, viewers seem divided on whether it is genuine.", "Although we've encountered a number of digitally altered images purporting to show strange cases of pareidolia, this photograph documents real markings on a turtle's shell", "We have been unable to determine when or where the above-displayed photograph was taken, but we did manage to find a second photograph of this unique-looking turtle from a credible source: a veterinary clinic in Ohio.", "In May 2013, the Oxford Veterinary Hospital posted a photograph of this turtle on Facebook:", "Here's a side-by-side comparison of the two photographs:", "It's unclear if this turtle's markings are supposed to indicate that the creature IS god, was created by God, or somehow escaped the pages of Terry Pratchett's Discworld series. Regardless, these photographs are genuine.", "Zimmermann, Kim.   \"Pareidolia: Seeing Faces in Unusual Places.\"\r\n    Live Science.   11 December 2012.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]