["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Stacey Abrams on Nov. 16 ended her bid to become governor of Georgia after a week and a half of counting votes. It was a tight race to the end between Abrams, a Democrat, and Brian Kemp, a Republican who resigned as Georgia’s Secretary of State only after the election.", "Despite the narrow voting margins, one thing was clear early on: The Democrat easily won Fulton County with more than 72 percent of the votes.", "But on Nov. 11, a story that appeared in Big League Politics reported that \"a vast amount of provisional ballots submitted in the Democrat stronghold were rejected for being duplicate ballots.\" Fulton County includes the city of Atlanta, which serves as the county seat.", "\"Bombshell\" the headline says. \"Fulton County numbers show massive duplicate ballots, rejected ballots, non-citizens trying to vote.\"", "This story was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Big League Politics, a website founded by Breitbart alum, did not immediately respond to a request for more information about the story.", "Out of the ballots cast, were massive numbers of them duplicates, rejects or plain illegal?", "No. According to the Georgia Secretary of State’s official election results, 425,139 people voted in Fulton County. That’s about 60 percent of all 703,177 registered voters there. That means that less than half of one percent of all ballots were rejected.", "Of 3,549 provisional ballots the county received, 1,994 were accepted and 1,555 were rejected. Ballots were rejected because 581 voters weren’t registered, 972 were voting in the wrong county and two weren’t citizens. The number of noncitizens who cast a ballot—two—represents about 0.0005 percent of the vote.", "Embedded in the story is what appears to be a Nov. 8 \"provisional ballot recap notice\" from the Fulton County Department of Registration and Elections. The notice reports that of the 3,722 provisional ballots it received, 355 were accepted, 1,811 were duplicates, 1,556 were rejected. The reasons for rejecting the ballots, according to the notice, included three cases of \"not a citizen,\" 581 \"not registered,\" and 972 \"out of county.\"", "A spokeswoman for Fulton County sent PolitiFact slightly different numbers on Nov. 15. Of 3,549 provisional ballots the county received, 1,994 were accepted and 1,555 were rejected. Ballots were rejected because 581 voters weren’t registered, 972 were voting in the wrong county and two weren’t citizens.", "The county did not respond to a request for a final count of the provisional ballots accepted and rejected.", "Is this a bombshell? No.", "First, let’s look at what provisional ballots are. They’re designed to ensure that voters aren’t excluded from the voting process due to an administrative error. If a voter’s eligibility is unclear—if their name isn’t on the voter rolls or they don’t have the required ID, for example—election officials must offer them a provisional ballot instead of a regular one. Officials later determine whether the voter was eligible to vote and whether that ballot should be counted.", "How the provisional ballots were handled in Georgia alarmed Democrats. Abrams sued to stop counties from tossing out some absentee and provisional ballots, and her campaign asked that officials count provisional ballots of voters who have moved but whose voter registration records still reflect their former addresses, according to the Post.", "How states deal with provisional ballots—and the number that are issued and rejected—varies greatly, according to the National Conference of State Legislatures. On Nov. 13, a federal judge ruled that Georgia must take steps to ensure provisional ballots aren’t improperly rejected, the Associated Press reported.", "Next, let’s look at the duplicate ballots. Election officials in Georgia can create duplicate ballots if, for example, the ballot is torn, bent or otherwise defective and can’t be processed by the tabulating machine. If a voter selects more than one person for the same office, officials must only omit that invalid vote and can create a duplicate ballot that excludes it.", "In the case of Fulton County, \"duplicate ballots\" are provisional ballots that were cast by voters voting in a precinct that is not their assigned registered precinct.", "\"They are called duplicates because we have to duplicate the assigned registered precinct’s ballot to record their vote correctly,\" spokeswoman April Majors said in an email to PolitiFact.", "While it’s true that Fulton County did have some rejected and duplicated ballots—and a few cases of non-citizens trying to vote, according to reports—this story suggests something nefarious in the gubernatorial election. Without context, describing \"massive duplicate ballots\" wrongly suggests Fulton County was the site of voter fraud. The headline also misleads readers to believe that a huge number of voters were non-citizens. The county found that was the case in only two instances.", "We rate this statement Mostly False.", "Big League Politics, \"Bombshell: Fulton County numbers show massive duplicate ballots, rejected ballots, non-citizens trying to vote,\" Nov. 11, 2018", "The Washington Post, \"Stacey Abrams, still hoping to force a runoff in Georgia’s governor’s race, files new lawsuit,\" Nov. 11, 2018", "The New York Times, \"Alternative Narrative Emerges in Conservative Media as Russia Inquiry Widens,\" Nov. 3, 2017", "The Atlanta Journal-Constitution, \"Stacey Abrams easily won Fulton. But how did every neighborhood lean?\" Nov. 9, 2018", "The Atlanta Journal-Constitution, \"Georgia Election: Kemp’s lead shrinks, Abrams to file new lawsuit,\" Nov. 10, 2018", "The Washington Post, \"Federal judge delays certification of Georgia election results, citing concerns over provisional ballots,\" Nov. 13, 2018", "The Associated Press, \"Judge orders Georgia to protect provisional ballots in Abrams-Kemp race,\" Nov. 13, 2018", "National Conference of State Legislatures, Provisional ballots, Oct. 15, 2018", "2010 Georgia Code, Title 21: Elections", "Minnesota Post, \"Recount’s next big issue: duplicate ballots,\" Dec. 17, 2008", "Email correspondence with April Majors, Fulton County public affairs manager, Nov. 15, 2018", "Georgia Secretary of State official election results, visited Nov. 20, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]