["About this rating", "Executive Order No. 20-65 meant that, from Nov. 18 to Dec. 2, 2020, Oregonians were prohibited from having an in-home gathering of more than six people from more than two households, with violations punishable by a fine, jail time, or both.", "Possessing cocaine and other controlled substances remains a violation of Oregon law, and would remain so even after the Drug Addiction Treatment and Recovery Act comes into effect, the act will remove prison sentences as a penalty for low-level possession of drugs including cocaine, but retain prison sentences for drug possession in other circumstances, and the changes to penalties for low-level drug possession will not come into effect until February 2021, and therefore won't coincide with the temporary Thanksgiving restrictions on gatherings.", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "In November 2020, amid rising COVID-19 cases and deaths in several states, governors and local officials throughout the country imposed new restrictions on commerce and gatherings in an effort to mitigate against a likely increase in infections during the Thanksgiving holiday.", "In Oregon, Gov. Kate Brown ordered that gatherings of family and friends must be limited to no more than six people from no more than two households, saying:", "The virus is spreading in the community and, every day, it is infecting more and more Oregonians. This situation is dangerous and our hospitals have been sounding the alarms. If we want to give Oregon a fighting chance, we must take further measures to flatten the curve and save lives. I know this is hard, and we are weary. But, we are trying to stop this ferocious virus from quickly spreading far and wide. And in Oregon, we actually can do this.", "Several observers — primarily right-leaning commentators, those opposed to lockdown measures, and COVID-19 denialists — virulently opposed Thanksgiving crackdowns such as the two-week \"freeze\" imposed by Brown.", "On Nov. 20, Ryan Fournier, right-wing activist and co-founder of Students for Trump, tweeted:", "\"If you have 6 or more people over for Thanksgiving in Oregon, you can get up to a $1,250 fine or jail time... Meanwhile crack is legal.\"", "His claim was further promoted when Elizabeth Johnston, a Christian conservative activist and blogger, turned it into a meme and posted it to her Facebook page on Nov. 23:", "Fournier's description of Thanksgiving restrictions in Oregon was accurate, but his claim that \"meanwhile crack is legal\" was not. Overall, this led us to issue a rating of \"Mixture.\"", "\"A $1,250 fine or jail time\"", "On Nov. 17, 2020, Brown signed Executive Order No. 20-65, entitled \"Temporary Freeze to Address Surge in COVID-19 Cases in Oregon.\" The document can be read in full here. The preamble sets out what it describes as \"a very dangerous situation\" in the state, with regard to rising COVID-19 cases:", "...Right now, in Oregon, like the rest of the country, new cases of COVID-19 are spiking at an alarming rate, as we enter cold and flu season, as the weather turns and grows colder, and as Oregonians spend more time indoors. We have gone from seeing around 200-300 cases a day in September, to over 1,000 cases a day in mid-November... This is a very dangerous situation.", "...The cycle of this virus is such that if we are seeing case rates topping 800-1,000 per day now, that means our hospitals are headed for very dark days ahead. Actions taken now will prevent lives from being lost — not just from COVID-19, but from other diseases or accidents that lead people to need hospital-level care, which they would not be able to get if hospital beds and hospital staff are fully occupied with COVID-19 patients.", "The situation is dire, and requires an urgent, immediate, and decisive response to quell the current surge in COVID-19 infections, before it is too late.", "The temporary freeze came into effect on Nov. 18, and was scheduled to end on Dec. 2, meaning its provisions would be in place during the holiday period, and on Thanksgiving itself, which is Nov. 26.", "Among several measures, Executive Order 65 imposed enhanced restrictions on household gatherings, noting that \"Gatherings present particular risks for the spread of COVID-19, as sustained contact with others in large or small groups presents an increased risk of spreading the disease...\"", "Paragraph 3(a) stipulates that: \"At home and social gatherings...are limited to a maximum of 6 people, from not more than two households.\"", "On the question of enforcement of the executive order's provisions, Paragraph 11(b) stipulates that:", "In addition to any other penalty that may be imposed under applicable laws, any person, business, or entity found to be in violation of this Executive Order...is subject to the penalties described in ORS [Oregon Revised Statutes] 401.990, in particular, that any person knowingly violating this executive order shall, upon conviction thereof, be guilty of a Class C misdemeanor, which is punishable by 30 days in jail or a fine of $1,250 or both. [Emphasis is added].", "Therefore, Fournier was correct in stating that \"If you have 6 or more people over for Thanksgiving in Oregon, you can get up to a $1,250 fine or jail time\" based on the provisions of Brown's executive order and existing Oregon law.", "\"Meanwhile crack is legal\"", "We presume this component of Fournier's claim to be a reference to Measure 110, a ballot measure passed by Oregon voters as part of the 2020 general election, which implements legislation entitled the \"Drug Addiction Treatment and Recovery Act.\" That document can be read in full here.", "The preamble to the act sets out its rationale, including the following principles:", "In summary, the act explicitly states that its purpose is \"to make health assessment, treatment and recovery services for drug addiction available to all those who need and want access to those services and to adopt a health approach to drug addiction by removing criminal penalties for low-level drug possession.\"", "Among the many provisions contained in the act was the decriminalization — not legalization — of possessing relatively small amounts of various controlled substances, including cocaine. The act does not change Oregon's existing penalties for manufacturing or delivering controlled substances, which are set out in Chapter 475, Section 752 of the Oregon Revised Statutes.", "The act does not render drug possession legal in Oregon, so Fournier's claim that \"crack is legal\" in the state is significantly flawed. What the law does do is to create a new category of offense — a \"Class E violation\" — for which the penalty is a $100 fine or a health assessment at one of several addiction recovery centers, which the act also creates.", "The legislation does not distinguish between the powdered or rock (that is, crack) forms of cocaine, and stipulates that possession of cocaine is a Class E violation, unless the individual found in possession has a prior felony conviction, or two or more prior drug-related convictions, in which case it is a Class C felony, punishable by up to five years in prison, a fine of up to $125,000, or both.", "If the individual is found in possession of two or more grams of \"a mixture or substance containing a detectable amount of cocaine,\" their offense is categorized as a Class A misdemeanor, for which the punishment is up to 364 days in prison, or a fine of up to $6,250, or both. Before the implementation of the new act, existing law treats low-level cocaine possession (that is, less than two grams) as a Class A misdemeanor.", "Possession of cocaine, in any form and in any amount, remains a violation of Oregon law, under the ballot measure passed by voters in November 2020. So Fournier's claim that \"crack is legal\" is inaccurate on that count.", "However, once the law comes into effect, individuals convicted of possessing less than two grams of cocaine will, in most circumstances, be offered the choice of paying a $100 fine or undergoing treatment. By adding the new \"Class E violation\" to Chapter 153, Section 18 of the Oregon Revised Statutes, the legislation will ensure that the punishment for such low-level possession of cocaine cannot involve any term of imprisonment.", "In certain circumstances and for amounts greater than two grams, cocaine possession not only remains illegal, but also remains punishable by imprisonment in Oregon, meaning Fournier's claim was also misleading on that score.", "And finally, Fournier's juxtaposition of the Thanksgiving gathering restrictions with Oregon's laws on cocaine possession (of which he asserts \"Meanwhile, crack is legal\") failed to take into account the fact that the act created by voters' passing of Measure 110 will not take effect (Section 25) until \"30 days after the day on which it is enacted or approved,\" under Oregon's constitution (Article IV, Section 1.4d). Furthermore, the part of the act that removes prison sentences for low-level drug possession will not take effect until Feb. 1, 2021.", "In other words, cocaine possession will not be legal in Oregon under the legislation passed by voters in November, because that's not what the legislation effectuates. And what the legislation does effectuate — removing prison sentences for low-level drug possession — won't go into operation for another two months after Thanksgiving, anyway.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]