["The quote says: “You will continue to suffer if you have an emotional reaction to everything that is said to you. True power is sitting back and observing everything with logic. If words control you that means everyone else can control you. Breathe and allow things to pass.”", "The quote has been shared on Facebook with various images of Lee here, here and here.", "The posts attributing the quote to Buffett look like this on Facebook and this on Instagram.", "However, the quote does not come from either famous man.", "Fans of Lee are regularly treated to quotes from the late film star in meme formats on his official Twitter and Instagram accounts, but this quote has never been featured. Quotes shared by official Lee accounts always include a small yellow image of Lee performing a flying kick.", "Sydnie Wilson, Director of Licensing for the Bruce Lee Foundation told AFP by email: “I do not have proof to provide that Bruce Lee said this himself.”", "Wilson said that this episode of a podcast put together by Shannon Lee included similar sentiments to the message, but not the exact quote.", "This screenshots of tweets purporting to come from Buffett were actually shared from the Twitter account @WarrenBuffettHQ. This is an imposter account which has been suspended by Twitter.", "The “Oracle of Omaha” has a verified Twitter account @WarrenBuffett, but a search of that account does not find the quote. The quote is also not found when searching archived versions of Buffett’s official Twitter account using the Wayback Machine, an internet archiving tool.", "On Instagram, the post spelled the billionaire investor’s name incorrectly, with only one T.", "Buffett’s assistant Debbie Bosanek also told AFP by email: “The quote in that fake Facebook screenshot is not something that Warren Buffett has ever said.”", "Though people regularly share this quote as if it was said by Lee or Buffett, it’s also regularly shared without attribution, including here and here.", "The Quote Investigator, a blog that answers questions about the origins of quotes online, also found no evidence that Lee or Buffett were the source of the quote.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]