["About this rating", "On April 23, 2020, Elisa Granato became one of the first people to take part in a trial for a potential COVID-19 vaccine at Oxford University. The following day, false reports started to circulate on social media that claimed she had died from the vaccination.", "One such article published to a website called News NT claimed:", "Elisa Granato, the first volunteer who availed herself in Oxford for a jab in the first Europe human trial of a vaccine to protect against the coronavirus pandemic, has died.", "She died two days after the vaccine was administered, authorities have said and added that an investigation into the cause of the death has been initiated.", "This is not a genuine news article. While Granato truly took part in a vaccine trial for COVID-19, she has not died. Her tweets are protected, but she did update her profile to explain that she is \"100% alive\":", "The University of Oxford News Office confirmed to Reuters that Granato was \"alive and well,\" while the U.K.'s Department of Health and Social Care called the reports of Granato's death \"completely untrue\" on Twitter:", "BBC News reporter Fergus Walsh also confirmed that Granato was alive, writing on Twitter: \"Fake news has been circulating on social media that the first volunteer in the Oxford vaccine trial has died. This is not true! I spent several minutes this morning chatting with Elisa Granato via Skype. She is very much alive and told me she is feeling 'absolutely fine.'\"", "Ferguson shared a video of his call with Granato on April 26, the day after she supposedly died from the vaccine:", "Oxford University also posted an update on its page dedicated to the COVID-19 vaccine trial, explaining that \"false reports about the progress of the trial\" had been circulating on social media. The university cautioned readers this likely would not be the last time a false rumor would circulate about the vaccine trial and urged people to get updates about the trial directly from the source:", "The university wrote:", "We are aware there have been and will be rumours and false reports about the progress of the trial. We urge people not to give these any credibility and not to circulate them. We will not be offering a running commentary about the trial but all official updates will appear on this site.", "Granato was one of more than 800 people who volunteered to take part in Europe's first human trial of a coronavirus vaccine. The BBC reported that half of the volunteers were administered a potential COVID-19 vaccine, while the other half received a control vaccine that protects against meningitis. Granato, as well as the other volunteers, will not know which vaccine they received.", "Granato told the BBC: \"I'm a scientist, so I wanted to try to support the scientific process wherever I can.\"", "Reuters.   \"False Claim: The First Volunteer in a UK Coronavirus Vaccine Trial Has Died.\"\r\n    26 April 2020.", "Walsh, Fergus.   \"Coronavirus: First Patients Injected in UK Vaccine Trial.\"        BBC.   23 April 2020.", "Alami, James.   \"First volunteer in UK coronavirus vaccine trial has died.\"\r\n   News NT.   25 April 2020.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]