["About this rating", "On 30 March 2016, several photographs purportedly showing Democratic presidential candidate Bernie Sanders driving an expensive sports car were posted to the 4Chan web site:", "WTF", "BERNIE", "IS THIS WHERE MY CAMPAIGN DONATIONS ARE GOING BECAUSE THAT WAS MY DAUGHTER'S COLLEGE FUND", "BLACKS ARE EXPERIENCING INSTITUIONALIZED RACISM ON A DAILY BASIS AND YOU'RE OUT HERE FLOSSIN", "BERNIIIIEEEEE", "Although many forum users were skeptical that the man in the car was indeed Sanders, one user attempted to add credibility to the photographs by claiming that he saw the Democratic presidential candidate driving what appeared to be an expensive Audi R8 behind some of his own campaign vehicles in photographs dated 17 March 2016:", "It's real. This car was following Bernie's campaign vehicles.", "The images purportedly showing \"Bernie's campaign vehicles\" actually capture the tour bus and SUV of a pro-Sanders group called \"Black Men for Bernie.\" Although the tour bus and SUV photographs are real, the Audi that Sanders was purportedly driving didn't appear in any of the images showing the \"Black Men for Bernie\" cars.", "It's possible that these photographs were taken at different times and in different locations. The claims are highly questionable, though, as it is extremely unlikely that Bernie Sanders would be driving himself in a vehicle trailing his own campaign bus (especially without Secret Service protection in tow), even more so as Sanders was stumping in Arizona that day and was not scheduled to appear with \"Black Men for Bernie.\"", "It was difficult to tell what highway the red car was seen driving on, of course, and none of the available photographs appeared to include any license plate information.  It was clear, however, that the terrain shown did not even vaguely resemble Flagstaff, Arizona, where Sanders was that day.  Here's a photo of Flagstaff for comparison:", "As 4Chan users struggled to find evidence that the man in the red car was in fact Bernie Sanders, another user posted an image of Sanders purportedly standing next to the car in question:", "This particular photograph of Bernie Sanders was real, but it didn't show an Audi R8. It was taken from Sanders' official government page and depicted the senator standing next to a Tesla electric vehicle at a charging station.", "The claim that presidential candidate Bernie Sanders spent campaign donations on a sports car worth $172,000 wasn't based on any factual information or documented evidence, but instead on nothing more than a blurry photograph of a man who bore a passing resemblance to the Democratic presidential candidate driving a car that looked like it might have been an expensive Audi R8, in an area that didn't look anything like Arizona on a day when Sanders was stumping in that state.  Even if Sanders actually was the one driving the car, it was unclear how commenters would know that he owned it and how he had paid for it simply from a series of grainy photographs.", "Sanders' transportation choices were a hot topic in 2016. Although the Democratic candidate frequently flew coach before he began his Presidential campaign, Sanders later opted for charter flights, likely due to his heightened profile, increase in travel demands, and Secret Service protection.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]