["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "North Carolina Gov. Roy Cooper speaks with Joe Biden at the RDU International Airport on Oct. 19, 2020.", "Add North Carolina’s governor to the list of politicians accused of hiding from the public.", "During campaign season, Republicans on several occasions accused Democrats of hiding in their basements amid the coronavirus pandemic. That trend continued the Sunday after Christmas, when the North Carolina GOP tweeted about Gov. Roy Cooper.", "\"Democrat Governor @RoyCooperNC has not left the Governor's Mansion since the start of the #COVID19 crisis,\" the party tweeted on Dec. 27.", "Compared to similar claims and barbs, this particular tweet stood out.", "For one, North Carolina’s gubernatorial race is over. Incumbent Cooper defeated Republican Dan Forest by about 250,000 votes — or about 4 percentage points — over a month ago. Second, the North Carolina Republican Party’s claim is very specific.", "So is it true that Cooper hasn’t left the Governor’s Mansion in Raleigh since March, when the pandemic started?", "No. There are numerous examples of Cooper leaving the executive mansion.", "On Dec. 21, less than a week before the NC GOP’s tweet, Cooper visited Duke Hospital to see health care workers receive COVID-19 vaccinations. He did the same at UNC Hospital in Chapel Hill on Dec. 17.", "Earlier this month, he toured a factory in Pittsboro that makes personal protective equipment. And in November, he toured a face shield production line.", "Cooper met with residents in August, when he visited Windsor in Bertie County after the town was hit by a tornado.", "He has held multiple press conferences about the coronavirus pandemic from the Emergency Management building across town from the executive mansion.", "Cooper also made a couple of high-profile appearances on the campaign trail in October, debating Forest at a studio in Research Triangle Park and greeting Joe Biden at RDU-International Airport.", "We know the NC GOP is aware of Cooper’s trip to the airport because it issued a press release about his conversation with Biden.", "The list of trips in this fact-check is not comprehensive. So why did the NC GOP tweet that Cooper hasn’t left his house?", "Party spokesman Tim Wigginton told PolitiFact NC that the tweet is not meant to be taken literally.", "\"The tweet is meant metaphorically,\" Wigginton said, adding that it’s meant to critique the frequency of Cooper’s visits with business owners. He accused Cooper of living \"in a bubble … instead of meeting with people devastated by his orders.\"", "The NC GOP’s tweet gave no indication that the party was calling on Cooper to meet with business owners.", "The NC GOP tweeted that Cooper \"has not left the Governor's Mansion since the start of the (COVID-19) crisis.\"", "That’s not only false, the party knows it’s false. Cooper has left the mansion numerous times since March, and made many public appearances. We rate this claim Pants on Fire.", "Tweet by the North Carolina Republican Party on Dec. 27, 2020.", "Video, \"Governor Cooper Duke Health Tour,\" uploaded to YouTube by the North Carolina Governor’s Office on Dec. 21, 2020.", "Statement and video, \"Governor Cooper Visits UNC Health As Frontline Health Care Workers Receive COVID-19 Vaccine,\" released by the North Carolina Governor’s Office on Dec. 17, 2020.", "Videos by WRAL, \"Governor 'deeply concerned' about spike in NC's virus metrics,\" uploaded Dec. 3, 2020; \"Cooper tours face-shield production line, discusses pandemic,\" uploaded Nov. 19, 2020; \"Pandemic dominates debate between Cooper, Forest,\" uploaded Oct. 14, 2020; \"Gov. Cooper greets Joe Biden as he lands at RDU,\" uploaded Oct. 19, 2020; \"Governor visits Windsor in wake of fatal tornado,\" uploaded Aug. 5, 2020.", "Statement by the North Carolina Republican Party, \"On Hot Mic: Cooper Tells Biden That Cunningham’s Scandal Is ‘Frustrating,’\" released Oct. 19, 2020.", "Email correspondence with Tim Wigginton, spokesman for the North Carolina GOP.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]