["In a historic shift to the left, Arizona backed Democratic challenger Joe Biden for president, making his win a target for conspiracy theories on social media.", "The controversy \"SharpieGate\" gained national attention after a video went viral of a woman claiming she witnessed poll workers deliberately handing out Sharpies at polling locations to invalidate votes.", "\"Arizona Secretary of State threw out my vote for Trump Bc I voted with a sharpie! I WAS HANDED A SHARPIE AND TOLD TO USE IT TO FILL OUT THE BALLOT!\" reads one Facebook post with over 500 shares, accompanied with a screenshot of the users alleged canceled ballot.", "Other versions of the claim show an image of a ballot with Sharpie ink leaking through the paper.", "USA TODAY reached out to the users for comment.", "Fact check: Trump ballots were not thrown out as claimed by fake poll worker", "Elections departments across Arizona have confirmed that the claim is unfounded and that processes are in place to ensure ballots are counted, regardless of what kind of writing implement is used to fill them out.", "The Arizona Republic reported that the Maricopa County Elections Department says voters are able to use black or blue ink, or Sharpies to fill out ballots. The county's new tabulation machines, which were tested many times, will count votes cast with these types of pens.", "Maricopa County also explained in a Twitter video that the new tabulation machine only reads the ovals, so bleed-throughs are not a problem and that the new ballot style has off-centered columns, so bleed-throughs won't impact counting.", "The county said it preferred Sharpies at voting centers because they dry much quicker, while ballpoint ink can smudge onto optical readers or other ballots which can create issues.", "A Maricopa County sheriff's deputy was sent to investigate a polling place in Queen Creek on Tuesday and found that a woman was handing voters ballpoint pens with a flyer urging them not to use Sharpies. The woman was told to stop and agreed to leave; a spokeswoman told the Arizona Republic that new optical reading equipment was brought to the voting site to ensure ballots were being read correctly.", "Pima County tweeted on Wednesday that the felt-tip pen ballot controversy on social media is \"false.\" It also confirmed that Arizona ballot tabulating machines can read ballots that were marked with a felt tip pen, but that it is discouraged because the ink can bleed through.", "\"All ballots in which voter intent can be discerned will be counted. That's also in the manual. No ballots will be discarded because of the method used to color in the ovals,\" Pima County tweeted.", "While voters are able to use ballpoint pen in black or blue ink or permanent felt-tip marker, the Maricopa County Recorder warns against using red or red-adjacent ink because the tabulation equipment can't read it.", "Fact check:Image does not show massive wall in front of White House", "According to the state's electionsprocedures manual, if a felt-tip pen mark does bleed through, the ballot will likely get sent for duplication. An election worker will fill out a new ballot using the voter's choices that will be read properly by tabulation machines.", "The manual states that the process is overseen by a Ballot Duplication Board comprised of at least two members of different political parties.", "\"The Ballot Duplication Board duplicates ballots that cannot be read by the tabulation machine but on which the voter has nonetheless clearly indicated their intent to vote on a particular race or ballot measure,\" the 2019 manual states.", "\"This may include crumpled or otherwise damaged ballots, ballots with smudged ink, or ballots which are marked in the wrong color of ink or with a device that cannot be read by the tabulation machine. If voter intent is not clear and Ballot Duplication Board members do not agree on the voter intent for a particular ballot, that ballot should be referred to the Snag Board or officer in charge of elections for resolution prior to duplicating the ballot.\"", "Arizona Secretary of State Katie Hobbs told Fox 10 that ballots marked with Sharpie pens would be counted.", "\"A trained, employed polling place worker is not going to give you a pen to mark your ballot that is going to invalidate your ballot,\" Hobbs said.", "Hobbs also took to Twitter to clarify that voters who received an early ballot but chose to vote in-person instead will see their early ballot status as \"Canceled\" on their ballot status update. She said, \"this is because the early ballot is canceled so the ballot cast-in person can be counted.\"", "U.S. Rep. Paul Gosar, R-Ariz., said he asked the Arizona Attorney General's Office to look into the concerns and the office wrote a letter to the Maricopa County Elections Department about the situation.", "Fact check:Video misrepresents timing and severity of Scranton ballot-scanning machine outage", "There is no evidence that tabulating machines in Arizona cannot read ballots filled out with a Sharpie. The Maricopa County Elections Department confirmed that Sharpies are preferred for filling out ballots. Arizona Secretary of State Katie Hobbs has also confirmed that ballots marked with Sharpie pens would be counted. We rate this claim as FALSE.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]