["About this rating", "Sometimes, people just don't assimilate accurate information, even when it's virtually handed to them, because they remain focused on something that is untrue yet so alarming or sensational that it commands their attention and drowns out consideration of contradictory facts.", "Case in point: the following meme, which was widely circulated via social media in mid-2020 during the COVID-19 pandemic:", "The meme's allusions to presidential candidate Joe Biden, vaccines, secret patents, and the furtive tracking of citizens pushed so many conspiracy theory buttons that many viewers missed the statement at the bottom of the meme that said \"none of this is true.\"", "As the bottom portion of the meme text states, the person referenced here is William A. Mitchell — a real scientist, but not one involved with the development of vaccines. Mitchell was a food scientist, the person responsible for developing such well known tasty treats as Cool Whip topping, Pop Rocks candy, and Tang powdered drinks.", "Mitchell retired in 1976, and died in 2004, so clearly he had nothing to do with patenting a vaccine — or anything else — in 2012.", "The point of someone compiling this memetic factual tomfoolery is stated at the bottom of the graphic: a warning to viewers to \"Stop getting your news from memes and calling it research!\"", "We note, for the record, that even the meme's deliberate attempt at presenting misinformation was wrong, whether intentionally or otherwise. Although the photograph used in the meme appears on a web page about Mitchell, it's actually a picture of Oswald Theodore Avery, a Canadian-American physician and medical researcher.", "Matchar, Emily.   \"The Scientist Behind Some of Our Favorite Junk Foods.\"\r\n    Smithsonian.   19 July 2019.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]