["• Many observers say the payroll tax break makes life harder for employers, because it’s unclear where things will stand next year after the election.", "President Donald Trump’s weekend order to give millions of workers a break on payroll taxes caught many people by surprise, and created a range of reactions, criticism and questions.", "One Facebook post said the order doesn’t help workers, it helps employers.", "\"Let me splain how ‘no payroll taxes’ helps you, it doesn’t. It helps employers & defunds years of Social Security you already paid,\" the post said.", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "It’s actually hard to see how Trump’s action helps employers, as the Facebook post claims. Many observers say it makes life harder for employers, because it’s unclear where things will stand next year after the election. Payroll taxes flow through employers. If they simply let workers keep the money, they could need to pay back the amount deferred in fairly short order, depending on the next president and Congress.", "\"They would be risking their decision to defer based on a very uncertain political outcome this fall and thus potentially face a significant payment to the Trust Funds early next year,\" said William Hoagland, senior vice president of the Bipartisan Policy Center, a Washington think tank.", "Right after Trump announced his move, the business magazine Inc. published an article that echoed Hoagland’s point, telling businesses \"the prudent thing is to hold tight and not change withholdings.\"", "Economist Eugene Steuerle at the Urban-Brookings Tax Policy Center said a future Congress would be \"unlikely\" to force workers to pay back the amount deferred.", "\"When it comes to individuals, it’s almost impossible to recoup the money,\" Steuerle said. \"Many people have almost no savings at all.\"", "Again, no one knows for sure what will happen in 2021.", "A Facebook post claims, \"Let me splain how ‘no payroll taxes’ helps you, it doesn’t. It helps employers & defunds years of Social Security you already paid.\"", "Many observers say it makes life harder for employers, because it’s unclear where things will stand next year after the election. Payroll taxes flow through employers. If they simply let workers keep the money, employers would need to pay back the amount deferred in fairly short order, depending on the next president and Congress.", "We rate this post Half True.", "White House, Memorandum on Deferring Payroll Tax Obligations in Light of the Ongoing COVID-19 Disaster, Aug. 8, 2020", "White House, Remarks by President Trump in Press Briefing, Aug. 8, 2020", "Fox News, Fox News Sunday, Aug. 9, 2020", "CNN, State of the Union, Aug. 9, 2020", "Jenna Ellis, tweet, Aug. 8, 2020", "Congressional Budget Office, The federal budget in 2019, April 2020", "Social Security Administration, 2020 Annual Report of the Board of Trustees of the Federal Old-Age and Survivors Insurance and Federal Disability Insurance Trust Funds, April 22, 2020", "U.S. Bureau of Labor Statistics, USUAL WEEKLY EARNINGS OF WAGE AND SALARY WORKERS, July 17, 2020", "Internal Revenue Service, Deferral of employment tax deposits and payments through December 31, 2020, July 30, 2020", "Inc., Why Businesses Should Ignore Trump's Payroll Tax Holiday, Aug. 9, 2020", "Forbes, White House Walks Back ‘Permanent’ Payroll Tax Cut Amid Social Security Concerns, Aug. 9, 2020", "Bloomberg, Trump’s Payroll Tax Action Creates Political, Business Risks, Aug. 9, 2020", "Kiplinger, What Trump's Payroll Tax Cut Will Mean for You, Aug. 10, 2020", "Email exchange, William Hoagland, senior vice president, Bipartisan Policy Center, Aug. 10, 2020", "Email exchange, Eugene Steuerle, economist and cofounder, Urban-Brookings Tax Policy Center., Aug. 10, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]