["Among GOP primary voters, the name Ronald Reagan is sacred. So, it's not surprising that each Republican candidate for president has done his best to claim Reagan's mantle and position himself as heir to his legacy.", "Rudy Giuliani, the only GOP candidate who says he supports abortion rights, might have the hardest time making that sale, since Reagan's legacy is so wrapped up in his socially conservative views. Even so, Giuliani has made much of the past statements of former Massachusetts Gov. Mitt Romney, who has admitted he did not always support the Gipper.", "The Romney admission in question, like much else Romney has tried to bury in his past, came in a 1994 Senate debate when Romney faced Edward Kennedy. The topic was economics. Kennedy said: \"And under your economic program, under the program of Mr. Reagan and Mr. Bush, we saw the growth in terms of the unemployment, the growth in the number of children living in poverty, the growth in terms of those children out of wedlock.\"", "Romney responded: \"I was an independent during the time of Reagan-Bush. I'm not trying to return to Reagan-Bush.\"", "Romney has since gone out of his way to distance himself from such remarks, repeatedly referencing Reagan in glowing terms on the campaign trail this year and acknowledging his own conversion to social conservatism on hot-button issues like abortion and gay rights.", "\"Now, I wasn't always a Ronald Reagan conservative,\" Romney told a meeting of conservative activists in January. \"Neither was Ronald Reagan, by the way.\"", "We find Giuliani correctly characterizes his rival's past statements and find the claim to be True.", "Boston Globe, \"Romney reaches for Reagan touch,\" by Scott Helman, Nov. 25, 2006", "Senate debate 1994,\n\n\"The real Romney?,\"\n\nRomney vs. Kennedy", "Associated Press, \"Romney says he was 'wrong' for moderate stands in 1994 Sen. race,\" by Glen Johnson, Jan. 11, 2007", "Boston Globe, \"Romney urges Ga. gathering to look at record,\" by Scott Helman, Jan. 7, 2007", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]