["A video where a man, speaking in Marathi, warns about possible terrorist attacks by Pakistan’s intelligence agency ISI in several Indian cities is viral on social media. It is being claimed that this person is the Mumbai police commissioner. Actor Jaywant Wadkar was among those who shared the clip.", "Mumbai Police commissioner 👆🏻 Total Mumbai under terrorist attack. Please be careful. All railway stations. All bars and cinema halls. Auditoriums. All public places. Please forward to all groups. Jay Hind. Jay Maharashtra.", "Posted by Jaywant Wadkar on Sunday, 11 August 2019", "The video has been massively circulated on Facebook. A few Twitter users have also shared it using the caption – “Mumbai Police commissioner. Total Mumbai under terrorist attack. Please be careful. All railway stations. All bars and cinema halls. Auditoriums. All public places. Please forward to all groups. Jay Hind. Jay Maharashtra.”", "Alt News has received several verification requests on its mobile app as well.", "The current police commissioner of Mumbai is Sanjay Barve, and he looks visibly different from the man in the video.", "The person starring in the video is a man named Hemant Mahajan. We found his identity upon reverse-searching one of the frames of the video on Yandex. Mahajan is a retired Brigadier of the Indian army and comments on national security issues.", "He has a YouTube channel and has appeared as a guest on several TV news channels. In many of his videos, he can be seen seated in front of the same background as in the viral video.", "A Twitter user had uploaded the same video widespread on social media and identified Mahajan.", "This is Brigedear Hemant Mahajan (Fauz) pic.twitter.com/GfkzXKk6jV", "— manoj joshi (@mjoshi50) August 11, 2019", "In conclusion, the man in the video, alerting people of terrorist attacks, is not the commissioner of Mumbai police but a retired army officer Hemant Mahajan.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]