["About this rating", "On 9 March 2017, the web site The Last Line of Defense reported that President Obama had been evicted from the Washington, D.C., mansion he was renting for damaging the dwelling:", "Former president and Kenyan traitor Barack Obama and his family have been evicted from the Washington DC mansion they leased to stay close enough to the Trump administration to interfere. The mansion, a 200-year-old historical landmark on the outskirts of town, was costing the taxpayers $20K per month.", "Jules Vernon, the man who owns the home and held the lease, told reporters from the local Fox news affiliate:", "“I appreciate that he was the president and thank him for his service and all, but that house is a historical landmark and we demand that our renters keep it in pristine condition. That guy and his family not only put holes in the walls to hang pictures, causing tens of thousands of dollars in damage to the original plaster, he refused to smoke outside. The smell of cigarettes in the house was the last straw. It’s inexcusable.”", "Although the article was aggregated by several other sites of dubious reputation, there was no truth to it. The story originated with The Last Line of Defense (The Resistance), an openly fake news site outfit whose disclaimer notes that its content is fabricated and ought not to be taken seriously:", "The Resistance may include information from sources that may or may not be reliable and facts that don’t necessarily exist. All articles should be considered satirical and any and all quotes attributed to actual people complete and total baloney. Pictures that represent actual people should be considered altered and not in any way real.", "Before reporting President Obama was evicted from his post-White House mansion the site falsely asserted seniors were eligible for a sizable federal bonus, that Saturday Night Live was cancelled due to low ratings, that the Obamas were getting divorced, and George Soros was arrested for \"hate crimes\" against America.", "Stryker.   \"Obama Evicted from His DC Mansion for Breaking One Major Clause in His Lease.\"\r\n    The Last Line of Defense.   9 March 2017.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]