["The so-called \"gun show loophole,\" which says private individuals can sell their guns without conducting a federal background check, has come under increased scrutiny in recent years.", "Speaking at a community center on Chicago’s South Side following the city’s most violent weekend this year, Democratic U.S. Sen. Tammy Duckworth added another wrinkle to that criticism by highlighting an implication of the law that hasn’t received as much attention.", "\"If you are a gun store owner and you decide to go out of business—you retire, you don’t want to do this anymore for whatever reason—you right now are allowed to convert your entire gun store inventory to ‘personal use,’\" Duckworth said. \"And once it is a personal use weapon, you can sell it without background checks.\"", "The first-term Illinois senator made the comment while expressing her support for federal legislation that would require universal background checks for gun purchases, a policy which polls show more than 80 percent of Americans support.", "The federal government places few restrictions on private sales by people who aren’t legally considered gun dealers. But could a former gun store owner really sell off the remainder of his or her inventory—a veritable arsenal, potentially—without running afoul of the law?", "The short answer: Yes, generally speaking. PolitiFact Rhode Island rated as True a similar claim in 2013. The more interesting question is why.", "Former gun dealers who no longer are licensed to sell guns have the same legal right to sell guns as any other private citizen.", "The federal rules for private sellers state they can’t give or sell a firearm to someone they know or reasonably believe is prohibited from owning a gun. They also can’t sell or transport firearms across state lines. But that’s pretty much it—although 19 states have instituted their own background check requirements beyond federal law.", "Illinois, for instance, requires all firearm purchasers to obtain a state permit, which can only be issued after a background check.", "But when a federally licensed gun dealer sells a gun in any state, the buyer must go through a background check.", "And the law says anyone who repeatedly buys and sells guns \"with the principal motive of making a profit\" must obtain such a license from the federal Bureau of Alcohol, Tobacco, Firearms and Explosives, or ATF. That’s different than occasionally buying and selling guns to enhance or liquidate a collection.", "So how do guns from a retailer’s business inventory wind up in their personal collection?", "Federal rules permit licensed dealers to transfer firearms out of their business inventory and into their personal collection—whether they are planning on leaving the trade or not. If they maintain their license, those weapons must sit in their collection for a year before they can be sold in a private, potentially background check-free transaction.", "If they let their license lapse or it is revoked, they become just like any other private individual, meaning their property and sales no longer fall under the ATF’s purview—unless, of course, they cross the line by buying and selling in a way that resembles doing business.", "According to Mark Jones, project director for the National Law Enforcement Partnership to Prevent Gun Violence and a former ATF agent, the burden of proof for that crime is high.", "\"It’s a pretty big mountain to climb to go after an FFL (federal firearm licensee) and prove that they’re actually criminally culpable or to go after someone who’s not an FFL but who’s dealing without a license,\" said Jones.", "A particularly striking case from 2006 illustrates that point.", "Sanford Abrams, a Maryland gun store owner and National Rifle Association board member, had his license revoked for a litany of violations, including that he couldn’t account for more than a quarter of his inventory. Between 1996 and 2000, 483 guns that were used in crimes were traced back to Abrams’ store, according to a report from the Brady Center.", "Yet Abrams maintained he could continue selling off his inventory as part of his personal collection. And in June 2006, the ATF affirmed that he could do so because he would only be acting as a dealer if he repeatedly purchased and resold firearms.", "Duckworth said former firearms dealers can transfer guns from their inventory into their personal collections, and then sell those guns without background checks.", "Federal law permits gun dealers to transfer inventory to their personal collections, and private gun sales under federal law do not require background checks. Many states, including Illinois, have added their own requirements, though.", "A former dealer—and any other private individual—could still get into trouble by continuing to buy and sell with profit as their main motive rather than enhancing or liquidating their collection. But there’s no definitive legal yardstick—such as the number of guns sold—for determining compliance.", "Duckworth’s statement is accurate and there’s nothing significant missing. That’s our definition for a statement that’s True.", "\"PolitiFact Sheet: 3 things to know about the 'gun show loophole,'\" PolitiFact, Jan. 7, 2016", "\"Bobby Rush chides Rahm Emanuel after weekend of gun violence: ‘Be real,’\" Chicago Sun-Times, Aug. 7, 2018", "\"Chicago’s most violent weekend this year prompts plea for help from mayor, cops,\" Chicago Sun-Times, Aug. 6, 2018", "Email and phone interview: Ben Garmisa, Duckworth spokesman, Aug. 21-23, 2018", "\"Do 90% of Americans support background checks for all gun sales?,\" PolitiFact Wisconsin, Oct. 3, 2017", "\"Obama: Violent felons can buy guns online without background checks,\" PolitiFact, Jan. 5, 2016", "Report, Gifford Law Center to Prevent Gun Violence, accessed Aug. 22, 2018", "Report, Bureau of Alcohol, Tobacco, Firearms and Explosives, Jan. 2016", "FAQ, Bureau of Alcohol, Tobacco, Firearms and Explosives, accessed Aug. 21, 2018", "Email and phone interview: Regina Milledge-Brown, Bureau of Alcohol, Tobacco, Firearms and Explosives spokeswoman, Aug. 24, 2018", "Phone interview: Mark Jones, project director for the National Law Enforcement Partnership, Aug. 22, 2018", "\"Gun Seller's Case Reveals Hurdles Of Enforcement,\" Washington Post, July 23, 2006", "Report, Brady Center to Prevent Gun Violence, June 2006", "Phone interview: Gabriel Chin, professor at UC Davis School of Law, Aug. 22, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]