["By Vanessa Schipani", "Posted on August 29, 2016", "Sen. John McCain’s primary opponent implied that if reelected, McCain may not live long enough to fulfill another six-year term. Actually, the odds are in his favor.", "Kelli Ward, a doctor and former Arizona state senator, noted that McCain would be 86 years old in 2022. “The life expectancy of the American male is not 86,” she said. “It’s less.” It’s true that the life expectancy is 76.28 years for American males at birth in 2013, but it’s actually 88.2 years for an average male who has made it to 80 years old.", "Ward made her claim during an interview with Politico in Phoenix.", "Politico, Aug. 25. “I’m a doctor. The life expectancy of the American male is not 86. It’s less,” Ward said in an interview here.", "The same day, Ward also told MSNBC anchor Chuck Todd, “John McCain has fallen down on the job. He’s gotten weak. He’s gotten old. … He’s going to be 80 on Monday and I want to give him the best birthday present ever: the gift of retirement.”", "Today is, indeed, McCain’s 80th birthday. And the Arizona Senate primary is tomorrow, Aug. 30.", "Whether or not McCain — the 2008 Republican presidential nominee and currently the eighth oldest senator — has “fallen down on the job” because of his age is a matter of opinion. But, according to the Social Security Administration, a man McCain’s age will live an average of 88.2 years — beyond the end of another six-year Senate term.", "Life expectancy at birth is less than at age 80 because it factors in mortality rates for all age groups, including infants who die at birth, which brings the average down for the population as a whole. Conversely, life expectancy calculations for an 80-year-old only consider mortality rates for individuals who’ve already made it to that age.", "For comparison, the life expectancy at birth in Western Europe in the Middle Ages was between 25 and 35 years old. But individuals who reached the age of 25 might have expected to make it on average to at least their early 50s, according to “Miracle Cures,” a book on medieval pilgrims by Robert A. Scott, a sociologist and associate director emeritus of the Center for Advanced Study in the Behavioral Sciences at Stanford University.", "In the Middle Ages, many children died before the age of 5 due to poor nutrition and sanitary conditions, says Scott. In 2014, more than 23,000 infants under the age of 1 died from causes ranging from injuries (e.g. suffocation) to complications during pregnancy, according to the Centers for Disease Control and Prevention. These 23,000 deaths are factored into life expectancy for Americans.", "When we contacted Ward’s campaign for comment, Stephen Sebastian, Ward’s spokesman, pointed us to a USA Today article from October 2014, which said the average male life expectancy in the U.S. is 76.4 years.", "This is “less than age 80,” Sebastian told us by email. “The reason [Ward] quoted age 86 is because Senate terms are 6 years each, and if McCain is re-elected at age 80, he would be 86 at the end of that sixth six year term,” he added.", "But as the USA Today article itself states, 76.4 years is the life expectancy estimate for males born in 2012. The article goes on to explain that for a male who was 65 years old in 2012, the average life expectancy is 82.9 years.", "“Life expectancy” looks at the average length of life within populations. “Lifespan,” on the other hand, is the number of years a particular person lives. Thus, while the average 80-year-old alive today is predicted to live to 88.2, some individuals may have shorter or longer lifespans, depending on both environmental and genetic factors.", "In fact, a study in mice published in Nature in 2013 found that genetic mutations inherited from one’s mother can speed up the process of aging and may influence lifespan. While later studies have supported this finding, the mechanism explaining this correlation has yet to be uncovered.", "Given this research, it’s worth pointing out that McCain’s mother is still living and is 104 years old.", "Sebastian told us Ward didn’t make a claim concerning the life expectancy of an 80-year-old male, but about the life expectancy of the American male in general. We agree; she didn’t.", "But in discussing the average American male’s life expectancy at birth, along with McCain’s age and longstanding position in the Senate, Ward misleadingly compared apples to oranges. The life expectancy of an 80-year-old American male, which is 88.2 years, is a better indicator of McCain’s lifespan than that of an American male born today.", "Editor’s Note: SciCheck is made possible by a grant from the Stanton Foundation.", "https://www.sharethefacts.co/share/425d681e-ef15-4949-84a1-9a86a0769ec3", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]