["About this rating", "A video posted in early June 2020 showing protesters and rioters vandalizing a car, and throwing what appear to be rocks, bricks and trash, claims that the protesters were vandalizing the Texas Children's Hospital in Houston. The video was viewed more than 28,000 times, and the same user posted a video of the scene taken from a different angle a few days later. According to The Associated Press, this video was filmed on May 29.", "The protests were supposedly in response to the death of George Floyd, a Black man who died on May 25, during a violent encounter with a white Minneapolis police officer. Similar scenes from the protest made their way to Twitter.", "However, news reports from the incident, in addition to a statement from the hospital confirm that these protesters were not vandalizing the children's hospital.", "In a statement to Snopes, Texas Children's Hospital confirmed that this video does not show people destroying their hospital:", "The location in this video is not Texas Children’s Hospital. We have not experienced any damage to our hospital as a result of the protests against the death of George Floyd and the injustices our communities of color continue to experience. Texas Children’s was founded to serve all children — regardless of their race, religion, creed or ability to pay. These are the principles that guide us each and every day.", "KHOU learned that the protest in the video was actually taking place in a different part of Houston -- at the corner of Walker and Austin streets downtown.", "Another online outlet, the Citizen Free Press, claimed that \"[Black Lives Matter] antifa\" terrorized a child and her father as they were leaving the hospital.", "While the video does show a child sitting on a man's shoulders and crying as they walk to a car, as we determined earlier, they were not at the children's hospital. An individual had been jumping on the same car before the father and daughter were seen moving toward it. But in the video, people can be seen gathering around the man and the girl, apparently clearing a path so they can approach and get into the car. It is not clear why the girl was crying, and she appeared to have been crying before they approached the protesters and throughout the video.", "Houston Police tweeted a few days after the video was filmed that they were not aware of any significant property damage, and had a low number of arrests that week considering how many people were protesting:", "A lot is undetermined about this video, including why the girl was crying and whether antifa was involved, but we do know that it did not take place at the Texas Children's Hospital in Houston. Therefore, we rate this viral video as \"Miscaptioned.\"", "Lajka, Arijeta.   \"Video Does Not Show Children’s Hospital in Houston Being Destroyed.\"\r\n   The Associated Press.   8 June 2020.", "Whitfield, Stephanie.   \"VERIFY: Texas Children's Hospital Was Not Vandalized by Rioters.\"\r\n   KHOU-11.   8 June 2020.", "Nur Nasreen Ibrahim is a reporter with experience working in television, international news coverage, fact checking, and creative writing.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]