["About this rating", "An \"alternative health\" website published a story on 9 December 2016, accusing a California lawmaker of facilitating government seizure of children through a new state Senate bill. The piece claims that state Sen. Richard Pan (D) placed families in danger when he introduced state Senate Bill 18 on 5 December 2016:", "This bill would declare the intent of the Legislature to expand and codify the Bill of Rights for Children and Youth of California to establish a comprehensive framework that governs the rights of all children and youth in California, outlines the research-based essential needs of California’s children, and establishes standards relating to the health, safety, well-being, early childhood and educational opportunities, and familial supports necessary for all children to succeed. The bill would declare the intent of the Legislature, by January 1, 2022, to enact legislation for the purpose of ensuring that the Bill of Rights for Children and Youth of California, in its totality, is applied evenly, equitably, and appropriately to all children and youth across the state.", "While the story ran the proposal verbatim, it did not identify any specific language in the bill authorizing officials to remove children from their households. Instead it claimed — without sources — that \"many across the state\" are already ripping the bill. (It also heavily suggested that Pan was a \"whipping boy\" for the pharmaceutical industry.)", "The lawmaker, a pediatrician and faculty member at the University of California-Davis, has been targeted by opponents of mandatory school vaccination programs since co-authoring a different measure, Senate Bill 277, in February 2015.", "As his spokesperson, Shannan Martinez, said in a statement:", "This is a personal vendetta they have against Dr. Pan.", "They don’t want to understand the bill and instead choose to make up lies about the legislation and the Senator.", "The irony is that they oppose an effort to empower parents and ensure children and families get the support they need to succeed.", "The vaccination bill, which was filed in response to a measles outbreak at Disneyland in 2014, eliminated  \"personal belief\" exemptions for public and private school students across the state. It was enacted on 30 June 2015, meaning that students would be required to be vaccinated unless they were granted a medical exemption.", "Pan reported getting threats via email and by phone after the bill was signed, enough so that he required additional security. A recall petition against him needing 35,926 signatures later failed after not getting a single signature.", "Gutierrez, Melody. \"Death threats made to office of state vaccine bill author.\" San Francisco Chronicle. 17 April 2015.", "White, Jeremy B. \"Richard Pan recall effort falls short on vaccine issue.\" Sacramento Bee. 4 January 2016.", "California legislative information. \"SB-18 Bill of Rights for Children and Youth in California.\" http://leginfo.legislature.ca.gov. 5 December 2016.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]