["About this rating", "As recently as November 2018, a photograph of World War II Army Air Forces veteran Delbert Storm holding a sign asking for help in locating surviving members of the 384th Bomb Squadron continued to be shared online, along with some version of the message “help this vet”:", "According to a story posted on the blog of a woman whose father served with the 384th, Storm’s daughter originally posted the photograph in 2015. Evidently, the Internet delivered, Storm's request went viral, and he was able to reconnect with some veterans who served in similar roles during the war, thanks to Facebook:", "The picture found its way to the 384th Bomb Group’s Facebook page -- many, many times. The picture is still being shared on Facebook, and still being shared with the Group’s Facebook page. (You can all stop now -- he found us) ... While Delbert Storm has found his group, I don’t know if he has actually found any survivors that he actually served with on a mission or any of those that were in his original crew.", "Although the picture continues to be shared, Storm passed away on 2 April 2017. According to his granddaughter, “the Army Air Corp was the time in his life he talked about most.” A staff sergeant, Storm was a ball turret gunner, a dangerous position that he was quoted as describing as “the job that no one else wanted.” He survived 35 missions over a four-month period in 1944:", "Delbert survived four-plus months of one of the most dangerous places to be in a B-17 -- the ball turret, which hung from the belly of the plane. He completed his thirty-fifth mission on December 11, 1944 and earned his ticket home.", "Storm received the Air Medal with Clusters thanks to his service with the 384th, whose motto was “Keep the Show on the Road.\"", "Bryan, Cindy Farrar.   \"Delbert Storm Finds His Group.”\r\n    The Arrowhead Club.   6 January 2016.", "Arkansas Democrat Gazette.   \"Delbert Storm, Bella Vista, AR, 1922 - 2017.”\r\n   6 April 2017.", "Bryan, Cindy Farrar.   \"Rest in Peace, Delbert Storm.”\r\n    The Arrowhead Club.   12 April 2017.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]