["About this rating", "On 13 January 2016 the military satire site Duffel Blog published an article titled \"Pentagon Spends $10 Million On Powerball Tickets With Hopes Of Bolstering F-35 Program,\" initially asserting:", "The Department of Defense announced today that it has purchased five million Powerball tickets at a cost of $2 per ticket, with an aim of providing a funding windfall to the F-35 Joint Strike Fighter program.", "“This is a minor fiscal gamble, but the Pentagon is always willing to lay out a few extra bucks in order to ensure we continue to have the most advanced military in the world,” said Secretary of Defense Ashton Carter, flashing a giddy smile. “Daddy needs a new pair of shoes, and a dozen new F-35s for the Navy’s Pacific Fleet.”", "Satirical elements of the piece were far more apparent as the article continued:", "A reporter brought to Carter’s attention that the jackpot only totals $1.5 billion dollar jackpot if the Pentagon elects to take the annuity paid out over 29 years, and the alternative lump sum payment would amount to less than $900 million.", "“Well, shit,” said Carter. “There’s no sense in taking a 29-year annuity when the F-35 will be obsolete by that time and on the auction block to Iran and Saudi Arabia. But the lump sum payment would still buy three or four F-35s today, I believe.”", "The reporter then pointed out the IRS would take almost half of the lump sum payout, leaving the Pentagon with around $500 million. They also noted the Navy’s F-35C variant costs $337 million per unit, leaving the Pentagon able to buy less than two F-35s for the Navy.", "“I don’t understand why you guys would even question this,” said a visibly frustrated Carter. “That would still be two more F-35s than we had previously, with a capital expenditure of only ten million dollars in Powerball tickets. That’s a steal.”", "Duffel Blog's \"About\" page is written in a similar style, subtly referencing the fact that its content isn't meant to be taken seriously. However, unlike most self-described \"satire\" sites, Duffel Blog aimed to amuse, not confuse, readers:", "Since 1797, Duffel Blog has been serving the men and women of the American military with insightful commentary and hard-hitting journalism. While other agencies have sometimes run from possibly scandalous stories, Duffel Blog has been known to be edgy and ahead of its time, almost as if they could see into the future. After reporting on President John Adams’ $200 per week cocaine habit in March 1799, Duffel Blog was named The American Military’s Most-Trusted News Source by the Columbia Journalism Review and the nickname stuck.", "Duffel Blog is sometimes referred to as “The military version of The Onion,” but this is a popular misconception. The misnomer was cleared up in May 2012 when DB staff successfully conducted an airborne assault on the offices of The Onion News Network so that others would know “The Onion was actually the civilian version of Duffel Blog.”", "Most readers familiar with Duffel Blog are aware of its humorous intent. However, the content is written with a specific brand of humor (military) in mind. As such, occasional Duffel Blog pieces cause confusion on social media among civilians and others over whose heads the pointed jabs can sail. Previous instances in which Duffel Blog material confounded social media users included articles claiming that West Point posthumously revoked the diplomas of confederate soldiers, that the Army instituted a \"mandatory divorce\" policy to \"improve readiness,\" that Ariana Grande joined ISIS, and that the USS Gabrielle Giffords was to be the Navy's first \"gun-free\" warship.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]