["By Eugene Kiely and Lori Robertson", "Posted on August 22, 2018 | Updated on June 7, 2021", "For many months, President Donald Trump, his White House staff and his personal attorneys, Michael Cohen and Rudy Giuliani, repeatedly made false, misleading and contradictory statements about illegal payments that were made during the 2016 campaign to silence two women who claimed to have extramarital affairs with Trump.", "The string of falsehoods and misrepresentations was exposed on Aug. 21, when Cohen admitted that he arranged — “at the direction of” Trump — payments totaling $280,000 to the women.", "Cohen admitted to paying $130,000 in hush money to porn star Stormy Daniels, whose real name is Stephanie Clifford, and to receiving $420,000 from the Trump Organization to reimburse him for the payment, plus expenses and a bonus.", "In addition, Cohen admitted to “causing” another corporation — believed to be American Media Inc., owner of the National Enquirer — to pay $150,000 to Playboy model Karen McDougal. In exchange, AMI received the rights to her story of an extramarital affair with Trump with the express purpose of killing McDougal’s story and preventing it from influencing the election, according to the plea agreement.", "Cohen pleaded guilty to two campaign finance law violations. Under federal law, individuals such as Cohen cannot make a contribution that exceeds $2,700 per election, and corporations, such as the Trump Organization and AMI, cannot make campaign contributions.", "Below are two timelines that record the false, misleading and contradictory statements made by Trump, Cohen, Giuliani and others about the payments to Daniels and McDougal.", "The timelines show, for example:", "We start with the $130,000 payment to Daniels, a story that was first reported by the Wall Street Journal at the start of this year.", "Jan. 12 — The Wall Street Journal writes that Michael Cohen arranged a $130,000 payment to Stormy Daniels. The White House, Cohen and Daniels — in a statement put out by Cohen on behalf of Daniels — all deny the affair and/or hush money.", "“These are old, recycled reports, which were published and strongly denied prior to the election,” the White House says in a statement to the Journal.", "“Rumors that I have received hush money from Donald Trump are completely false,” Daniels says in a statement released by Cohen. “If indeed I did have a relationship with Donald Trump, trust me, you wouldn’t be reading about it in the news, you would be reading about it in my book.” (Daniels would later deny that she signed the statement.)", "“These rumors have circulated time and again since 2011. President Trump once again vehemently denies any such occurrence, as has Ms. Daniels,” Cohen tells the Washington Post.", "Jan. 18 — Deputy Press Secretary Raj Shah aboard Air Force One tells the press that questions about the payment to Daniels were “answered during the campaign.”", "Reporter: This is an issue that hasn’t really gotten much attention amidst everything else, but nonetheless, this woman named Stephanie Clifford, goes by the name “Stormy Daniels,” she says that she had an affair with the president. She spoke on record about it to a magazine. They say that she took a polygraph test. What is the president’s response to her allegations?", "Shah: This allegation was asked and answered during the campaign, and I’ll point you to those comments.", "Reporter: Was there some kind of settlement, some kind of hush money that was paid?", "Shah: Like I said, this matter was asked and answered during the campaign, and anything else could be directed to Michael Cohen.", "Jan. 30 — Appearing on “Jimmy Kimmel Live!,” Daniels denies signing a statement put out by Cohen on Jan. 12 in which she said she did not receive “hush money” from Trump. “That does not look like my signature does it,” Daniels says. “I do not know where it came from.”", "Feb. 13 — Cohen issues a statement to the New York Times claiming that he paid Daniels and falsely saying he was not reimbursed by the Trump Organization.", "“Neither the Trump Organization nor the Trump campaign was a party to the transaction with Ms. Clifford, and neither reimbursed me for the payment, either directly or indirectly,” Cohen’s statement says. “The payment to Ms. Clifford was lawful, and was not a campaign contribution or a campaign expenditure by anyone.”", "March 7 – At a press briefing, a reporter asks White House Press Secretary Sarah Sanders “did the president approve of the payment” to Daniels, and Sanders says that the president “made very well clear that none of these allegations are true.”", "Reporter: Sarah, you’ve said repeatedly that we’ve addressed our feelings on that situation, in regards to the Stormy Daniels payment. But specifically, can I ask, did the president approve of the payment that was made in October of 2016 by his longtime lawyer and advisor, Michael Cohen?", "Sanders: Look, the president has addressed these directly and made very well clear that none of these allegations are true. This case has already been won in arbitration. And anything beyond that, I would refer you to the president’s outside counsel.", "Reporter: When did the president address, specifically, the cash payment that was made in October of 2016 to —", "Sanders: The president has denied the allegations against him. And, again, this case has already been won in arbitration. Anything beyond that, I would refer you to outside counsel.", "Reporter: But did he know about that payment at the time, though?", "Sanders: Jeff, I’ve addressed this as far as I can go.", "Reporter: I’m not talking about the actual allegations, but about the payment. Did he know about the payment at the time?", "Sanders: Not that I’m aware of. And, again, anything beyond what I’ve already given you, I would refer you to the president’s outside counsel.", "March 26 — A day after Daniels appeared on CBS’ “60 Minutes” to discuss her alleged affair with Trump, the White House deputy press secretary says that “the president strongly, clearly, and has consistently denied these underlying claims.”", "Reporter: Thanks, Raj. One more for you just on the Stormy Daniels incident. I’m sure my colleagues have more questions on that. Could you state, categorically, that the president, his campaign, and the Trump Organization did not violate federal law — specifically, election law — regarding that payment?", "Shah: Well, I can speak for only the White House, and I can say, categorically, and obviously, the White House didn’t engage in any wrongdoing. The campaign or Mr. Cohen —", "Reporter: (Inaudible question.)", "Shah: Yeah. The campaign or Mr. Cohen can address anything with respect to their actions. With respect to that interview, I will say the president strongly, clearly, and has consistently denied these underlying claims. And the only person who’s been inconsistent is the one making the claims.", "April 5 — In a brief exchange with reporters on Air Force One, Trump denies knowing about the payment to Daniels:", "Reporter: Mr. President, did you know about the $130,000 payment to Stormy Daniels?", "Trump: No. No. What else?", "Reporter: Then why did Michael Cohen make those if there was no truth to her allegations?", "Trump: Well, you’ll have to ask Michael Cohen. Michael is my attorney. And you’ll have to ask Michael Cohen.", "Reporter: Do you know where he got the money to make that payment?", "Trump: No, I don’t know. No.", "April 9 — The FBI executes a search warrant at Cohen’s home, office and hotel room.", "April 26 — In an interview on “Fox & Friends,” Trump says Cohen — whom he refers to as a “good guy” — handles a “tiny, tiny little fraction” of his overall legal work. Trump says Cohen represented him on the “crazy Stormy Daniels deal,” but the president goes on to falsely claim that Cohen did “absolutely nothing wrong” because the payment wasn’t made by campaign funds. (In a previous story, we explain why it could still be a campaign violation even if campaign funds were not used. Federal law states that a personal loan or “anything of value made by any person for the purpose of influencing any election for Federal office is a contribution,” whether or not it is repaid.)", "Steve Doocy: Mr. President, how much of your legal work was handled by Michael Cohen?", "Trump: Well, as a percentage of my overall legal work a tiny, tiny little fraction. But Michael would represent me and represents me on some things — he represents me, like with this crazy Stormy Daniels deal. He represented me and you know from what I see he did absolutely nothing wrong. There were no campaign funds going into this — which would have been a problem.", "May 2 — In an interview with Fox News’ Sean Hannity, Giuliani discloses for the first time that Trump repaid Cohen, but makes the false claim that the payment was “perfectly legal” because campaign funds weren’t used. He also claims the president “didn’t know about the specifics” of the payment.", "Giuliani: That money was not campaign money. Sorry, I’m giving you a fact now that you don’t know. It’s not campaign money. No campaign finance violation.", "Hannity: They funneled the payment through [Cohen’s] law firm.", "Giuliani: Funneled it through the law firm and the president repaid it.", "Hannity: Oh, I didn’t know he did. There’s no campaign finance law?", "Giuliani: Zero.", "Hannity later in the interview asks if Trump knew about the payment.", "Hannity: Do you, the president didn’t know about this?", "Giuliani: He didn’t know about the specifics of it, as far as I know, but he did know about the general arrangement that Michael would take care of things like this. Like I take care of things like this for my clients. I don’t burden them with every single thing that comes along.", "(Giuliani’s full remarks about the $130,000 payment begin at the 11-minute mark of the video.)", "After the Hannity interview, Giuliani falsely tells the Washington Post later that night that Trump reimbursed Cohen through a $35,000 monthly retainer, beginning in January or February 2017. “The repayments took place over a period of time, probably in 2017, probably all paid back by the end of 2017,” Giuliani says. (Giuliani’s claim about the legal retainer is false. In announcing the plea agreement with Cohen, the Department of Justice would later say, “In truth and in fact, there was no such retainer agreement, and the monthly invoices COHEN submitted were not in connection with any legal services he had provided in 2017.”)", "May 3 — Trump tweets that the payment to Daniels had “nothing to do with the campaign,” (contrary to Cohen’s subsequent guilty plea statement), and falsely claims Cohen “received a monthly retainer.”", "Mr. Cohen, an attorney, received a monthly retainer, not from the campaign and having nothing to do with the campaign, from which he entered into, through reimbursement, a private contract between two parties, known as a non-disclosure agreement, or NDA. These agreements are…..", "— Donald J. Trump (@realDonaldTrump) May 3, 2018", "…very common among celebrities and people of wealth. In this case it is in full force and effect and will be used in Arbitration for damages against Ms. Clifford (Daniels). The agreement was used to stop the false and extortionist accusations made by her about an affair,……", "— Donald J. Trump (@realDonaldTrump) May 3, 2018", "…despite already having signed a detailed letter admitting that there was no affair. Prior to its violation by Ms. Clifford and her attorney, this was a private agreement. Money from the campaign, or campaign contributions, played no roll in this transaction.", "— Donald J. Trump (@realDonaldTrump) May 3, 2018", "Sanders, the White House press secretary, is asked at a press briefing why Trump “was not truthful with the American people” when the president on April 5 denied knowing anything about the Daniels payment or where the money came from. Sanders says that “the president didn’t know at the time, but eventually learned” about the payment.", "Reporter: And secondly, on another topic in the news today. Can you explain why the president, when he spoke — when he answered questions from reporters a few weeks ago about the $130,000 payment from Michael Cohen to Stormy Daniels, why the president was not truthful with the American people and with the people in this room?", "Sanders: As Mayor Giuliani stated — and I’ll refer you back to his comments — this was information that the president didn’t know at the time, but eventually learned.", "May 4 — In remarks to reporters, Trump falsely denies that he changed his story about payments made to Stormy Daniels. Specifically, he tells reporters to “go take a look at what we said” on April 5 — which is when the president denied knowing anything about the payment or where the money came from.", "Reporter: Mr. President, why did you change your story on Stormy Daniels?", "Trump: I’m not changing any stories. All I’m telling you is that this country is right now running so smooth. And to be bringing up that kind of crap, and to be bringing up witch hunts all the time — that’s all you want to talk about. You’re going to see —", "Reporter: But you said —", "Trump: Excuse me —", "Reporter: on Air Force One that you did not know (inaudible).", "Trump: No, but you have to — excuse me. You take a look at what I said. You go back and take a look. You’ll see what I said.", "Reporter: You said, “No,” when I asked you, “Did you know about the payment?”", "Trump: Excuse me, you go take a look at what we said. But this is a witch hunt like nobody has ever seen before. And what they should do is look at the other side, where terribly bad things have happened, where terribly bad things have been done.", "Aug. 21 — Cohen admits in open court that he made a $130,000 payment to Daniels “at the direction” of Trump without mentioning Daniels or Trump by name. He pleads guilty to campaign finance violations, telling the judge that illegal payments were made to two women “for the purpose of influencing the election.” Cohen’s attorney would later confirm that the payments were made to Daniels and McDougal at Trump’s direction.", "Cohen: With and at the direction of the same candidate, I arranged to make a payment to a second individual to keep the individual from disclosing the information. I used a company under my control to make a payment of $130,000 later repaid to me by the candidate. I participated in this conduct for the purpose of influencing the election.", "Aug. 22 — Trump tweets that Cohen has decided to “make up stories in order to get a ‘deal’” with federal prosecutors. He falsely claims that the two campaign finance violations “are not a crime.” Cohen admitted to paying or causing payments totaling $280,000 to keep two women silent during the campaign and being repaid for one of the payments by the Trump Organization. Under federal law, individuals such as Cohen cannot make a contribution that exceeds $2,700 per election, and corporations, such as the Trump Organization, cannot make campaign contributions.", "In an excerpt of an interview with Fox News, “Fox & Friends” co-host Ainsley Earhardt asks the president if he knew about the payments to Daniels and McDougal. “Later on I knew. Later on,” he says, without saying exactly when. He goes on, again, to falsely claim that there was no campaign finance law violation because the payments were not made by the campaign.", "Nov. 4, 2016 — The Wall Street Journal publishes a story saying, “The company that owns the National Enquirer, a backer of Donald Trump, agreed to pay $150,000 to a former Playboy centerfold model for her story of an affair a decade ago with the Republican presidential nominee, but then didn’t publish it, according to documents reviewed by The Wall Street Journal and people familiar with the matter.” The Journal reports that Karen McDougal signed the agreement with American Media Inc. in August 2016.", "Trump campaign spokeswoman Hope Hicks tells the Journal: “We have no knowledge of any of this.” She says, according to the newspaper, that the claim of an affair between McDougal and Trump was “totally untrue.”", "AMI, whose chairman and CEO, David J. Pecker, is friends with Trump, denies that this was an instance of “catch and kill” — paying for the exclusive rights to a story with no intention of publishing it. “AMI has not paid people to kill damaging stories about Mr. Trump,” the company says in a statement to the Journal.", "Feb. 16, 2018 — The New Yorker publishes a story on McDougal’s alleged affair with Trump in 2006 and 2007 and the contract with AMI. A White House spokesperson tells the magazine: “This is an old story that is just more fake news. The President says he never had a relationship with McDougal.”", "July 23 — In a press briefing, a reporter asks if the president still denied that he had a relationship with McDougal. Press Secretary Sarah Sanders says, “Once again, the president maintains that he’s done nothing wrong, and I would refer you to Rudy Giuliani for all questions on that matter.”", "July 24 — CNN obtains an audio recording from Cohen’s attorney, Lanny Davis, of Cohen and Trump discussing the payment to McDougal in September 2016. “I need to open up a company for the transfer of all of that info regarding our friend David [Pecker],” Cohen says in the recording. The two men discuss arranging a payment. “We’ll have to pay,” Cohen says, and Trump seems to say, “pay with cash,” though the recording is muddled.", "Aug. 21 — Cohen pleads guilty to tax evasion and campaign finance violations in federal court. Cohen says in court: “On or about the summer of 2016, in coordination with, and at the direction of, a candidate for federal office, I and the CEO of a media company at the request of the candidate worked together to keep an individual with information that would be harmful to the candidate and to the campaign from publicly disclosing this information … under which she received compensation of $150,000.”", "The Department of Justice press release on the plea says that in August 2015 Cohen and “one or more members of the [Trump] campaign” were involved in an offer by “the Chairman and Chief Executive of Corporation-1, a media company that  owns, among other things, a popular tabloid magazine” to “help deal with negative stories about Individual-1’s relationships with women by, among other things, assisting the campaign in identifying such stories so they could be purchased and their publication avoided.”", "The press release says that in June 2016 “Woman-1,” who is McDougal, attempted to sell her story of an affair. “At COHEN’s urging and subject to COHEN’s promise that Corporation-1 would be reimbursed, Editor-1 ultimately began negotiating for the purchase of the story,” the DOJ release says. The agreement with McDougal was struck on Aug. 5, 2016.", "Update, June 7: A360 Media, LLC, the successor to AMI, agreed to pay a $187,500 fine to the Federal Election Commission to settle a complaint filed by Common Cause. The FEC said it “found reason to believe that respondents David J. Pecker and American Media, Inc. knowingly and willfully violated” a campaign finance law that prohibits a “corporate in-kind contribution.” The FEC said it did not have the votes “to find reason to believe” that others named in the complaint, including Trump, violated the law.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]