["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "HBO's John Oliver talked about food waste and the regulatory conditions that he argues leads to it in the July 19 episode of \"Last Week Tonight\" on HBO. (Screenshot)", "Ever wonder about the accuracy of your milk carton’s expiration date? Or exactly how late is too late to eat that apple?", "So did comedian John Oliver. He used the July 19 episode of his HBO show Last Week Tonight to discuss the issue of food waste, zooming in on little-known regulatory gaps that he argued cause mass confusion over the meaning and purpose of date labels on food.", "\"With the exception of baby formula,\" Oliver said, \"the federal government does not require any food to carry an expiration date, and state laws vary widely.\"", "And of the 50 states, he went on, nine don’t require any labels at all.", "The confusing issue has been well documented over several decades, though we doubt it’s ever been the target of an 18-minute monologue in a late-night comedy show.", "We wanted to see if Oliver had it right.", "Chaotic laws, confusing labels", "Oliver was right in saying, with the exception of infant formula, the federal government does not require any food to carry an expiration date.", "Experts say it would be almost impossible to set up an effective umbrella regulation for labeling foods with expiration dates. The diversity of climates and crops in the United States means it’s hard to judge the pace at which different foods deteriorate in different places. A piece of fruit left out in the hot, humid fields of Georgia might spoil faster than the same piece of fruit left out in the cool, dry mountains of Colorado.", "In the absence of an overarching federal statute, a jumble of laws at the state level dictate which foods require date labels.", "The comedian’s research team got the bulk of its data from a 2013 report compiled by the Natural Resources Defense Council, an environmental think tank, and the Harvard Food Law and Policy Clinic. The study found that most states have laws that require date labels on some foods.", "Oliver cites the report’s finding that nine states don’t require any date labels, including New York, Idaho and Alabama. Of those nine, seven states don’t have regulations that govern the labels that manufacturers voluntarily place on products.", "These inconsistencies can make it hard to do business across state lines, said Emily Broad Leib, the study’s lead author and director of the Harvard Food Law and Policy Clinic. Laws in Montana and Pennsylvania require milk to be sold 12 and 17 days after pasteurization, respectively, but don’t allow the milk to be donated if it goes unsold in that time.", "\"Without federal guidance,\" Leib said, \"some state laws require that (unspoiled) food be thrown away.\"", "The Montana law prompted some out-of-state dairy farmers to argue that the law unfairly protects in-state producers.", "Label it what you want", "The regulatory gap also leads to confusion about what food labels actually mean. As a news clip in Oliver’s segment illustrates, one might see the same product labeled \"sell by\" or \"use by,\" or it may have no label at all.", "Most retailers and manufacturers use a labeling system referred to as \"open dating.\" Though it might sound like a relationship status, \"open dating\" simply means that a calendar date is displayed on a product instead of a code that only makes sense to the producer.", "Perhaps surprisingly, the dates on these labels aren’t regulated. This means it’s entirely up to the manufacturer to decide what date to print on the labels in all 50 states. (The strictest federal regulation of this kind applies to poultry, but it allows the use of a packing date instead of a sell-by date.)", "The purpose of manufacturers’ date labels isn’t to ensure safety, but quality, according to the USDA.", "Oliver suggests that because manufacturers are free to determine their own best-by dates, they may have a financial incentive to falsify them. But one expert said he wasn’t convinced manufacturers try to help out their bottom lines by making it seem like food perishes faster than reality.", "Quality standards almost always consider safety, said Keith Schneider, a food microbiologist at the University of Florida’s Institute of Food and Agricultural Sciences. Keeping a customer happy means also keeping them safe.", "\"These dates are usually based on lab tests and historical precedents,\" he said.", "Most of all, he said, manufacturers want to build brand loyalty by consistently guaranteeing fresh, safe food, so they are often overly conservative with sell-by and use-by dates.", "Leib said it would be difficult to prove a producer manipulates its dates to boost profits, \"but it would be perfectly easy to falsify that information.\" Still, manufacturers have an interest in ensuring quality, and many times smaller companies don’t have the money to test their products and apply accurate sell-by dates.", "\"Sometimes,\" she said, \"dates are just made up.\"", "Our rating", "Oliver said, \"With the exception of baby formula, the federal government does not require any food to carry an expiration date, and state laws vary widely.\"", "While Oliver’s underlying argument for more regulation can be debated, he’s right to say that the federal government doesn’t require expiration dates on food, and state laws filling in that gap are inconsistent.", "We rate his statement True.", "A previous version of this story misstated the name of the Natural Resources Defense Council.", "Last Week Tonight with John Oliver, \"Season 2, Episode 21,\" Jul. 19, 2015", "The New York Times, \"Freshness of Milk Products,\" March 10, 1982", "CBS News, \"Confusion about food labels leads to waste, possible illnesses,\" June 24, 2014", "U.S. Department of Agriculture, \"Food Product Dating,\" Mar. 24, 2015", "Harvard Food Policy and Law Clinic & Natural Resource Defense Council, \"The Dating Game: How Confusing Food Date Labels Lead to Food Waste in America,\" September 2013", "Phone interview with Emily Broad Leib, director of Harvard Food Law and Policy Clinic, July 23, 2015", "The Missoulian, \"Judge rules Montana’s milk ‘sell-by’ date can stand,\" August 9, 2013", "Phone interview with Keith Schneider, food microbiologist and professor of food science and human nutrition, University of Florida, July 22, 2015", "U.S. Food & Drug Administration, \"Food Labeling Guide,\" January 2013", "Email interview with Tobe Becker, HBO spokeswoman, July 22, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]