["About this rating", "On 8 November 2017, a user who was perhaps looking to make light of the ongoing police brutality protests in the sports world published a faux-historical post on the prank web site BreakingNews247.net:", "Archival photos reveal several white baseball players kneeling during the national anthem in protest of the lynching of innocent negroes and Jim Crow laws. The practice was quickly ended when the players realized that most of their fans were either KKK members or sympathizers.", "If this one-paragraph \"story\" weren't obviously fallacious enough on its own, the site contains a disclaimer for readers: \"This website is an entertainment website, news are created by users. These are humourous news, fantasy, fictional, that should not be seriously taken or as a source of information.\"", "The photograph used in the story is legitimate insofar as it is real and not manipulated, but it appears to be a completely unrelated one lifted from a site promoting the biography of New York Yankees pitcher Vernon \"Lefty\" Gomez. Gomez can be seen kneeling on the left-hand side of the picture, joined by his fellow hurlers on the 1936 Yankees staff.  (Not until 1947 would the first black player even take part in major league baseball, when Jackie Robinson joined the Brooklyn Dodgers. If white baseball players had been protesting on behalf of \"negroes\" back in 1936, the most obvious subject of protest would have been against the latter's exclusion from the major leagues.)", "Moreover, this photograph was clearly taken well before game time and not during the playing of the national anthem, as evidenced by the paucity of spectators in the stands and the absence of any visible attendees (player or fan) standing at attention or placing their hands over their hearts.  And the playing of \"The Star-Spangled Banner\" before the start of regular-season baseball games was not the standard in 1936 -- that practice didn't become a regular feature until several years later, after the start of World War II.", "In modern times, former pro football player Colin Kaepernick originated the demonstrations against extrajudicial killings on the part of police in 2016, when he began kneeling during the playing of the national anthem before San Francisco 49ers games. But only one Major League Baseball player, Oakland Athletics catcher Bruce Maxwell, has followed suit.", "BreakingNews247.net is a prank news site that, like others of its ilk, allows anyone to create a headline and story that looks (at least at first glance) like an actual news article.", "Woo, Jeremy.   \"Athletics' Bruce Maxwell Becomes First MLB Player to Kneel for National Anthem.\"\r\n    Sports Illustrated.   23 September 2017.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]