["Defense Secretary Chuck Hagel takes questions as he briefs reporters about part of a budget deal that curbs annual pension increases for military retirees under age 62.", "House Budget Committee Chairman Paul Ryan has drawn some praise -- but also fire, especially from veterans -- for co-brokering a federal budget deal that includes smaller pension payments for younger military retirees.", "The two-year agreement reached by Ryan and U.S. Sen. Patty Murray, D-Wash., became law in December 2013.", "To help reduce the deficit, pensions for those who retire from the military before age 62 won’t be as large. Those younger retirees will receive annual cost-of-living adjustments (COLAs) to their pensions that are 1 percent lower than the rate of inflation (full COLAs will continue to be given to  military retirees who are over 62).", "In defending the move, Ryan made a claim about military pensions that we want to check.", "\"Civilian public employees have a 401(k) with the match, a defined-benefit pension and health care. They don't have (pension) COLAs at all if they retire before the age of 62. And they do contribute some to their pensions, and now we're having (newly hired employees) contribute more,\" the Janesville Republican told the Milwaukee Journal Sentinel editorial board Dec. 19, 2013.", "\"The military doesn't contribute toward their pension. They don't have a paycheck – payroll deduction -- toward their pensions. And they do have a COLA before they're 62.\"", "With more public employees -- notably state and local government workers in Wisconsin -- contributing more toward the cost of their benefits, we wondered if Ryan was right.", "Do members of the military contribute nothing toward their pensions?", "Evolution of military pensions", "Military pensions have expanded in scope since the first national pension law was passed in 1776, in the early stages of the Revolutionary War. At that time, pensions were strictly for those \"losing a limb in any engagement, or being so disabled in the service of the United States as to render him incapable of earning a livelihood.\"", "Over the next several decades, pensions were awarded to Revolutionary War veterans based on need and later they became full pay for life, regardless of need.", "In 1948, 20 years was established as the minimum requirement for voluntary retirement for the Army and Air Force, putting those services on par with the Navy. Since 1986, military pensions have been \"inflation protected,\" with annual cost-of-living adjustments tied to the Consumer Price Index.", "The military retirement system now provides some $52 billion per year in pension payments to more than 2 million military retirees and their survivors.", "(By the way, pensions for civilian federal employees were created in 1920. Social Security was created in 1935.)", "At the individual level, members of the military are guaranteed a specific monthly pension payment after 20 or more years of service. However, it is essentially an all-or-nothing proposition: Those who serve at least 20 years are fully vested, but those who leave the military earlier usually receive no retirement benefits. Only 17 percent of those who serve in the military end up getting a retirement benefit, according to the Defense Business Board and the House Budget Committee.", "But, as Ryan indicated in his comments, military retirees begin receiving their monthly pension payments immediately, regardless of age. So, many begin drawing military pensions in their early to mid-40s, often while working in another career. Other public-sector employees, and those in the private sector, typically do not begin receiving an annuity until age 55, 60, or 65.", "Pension contributions", "So, what about contributions toward pensions? In other words, where does the money for the military retirement checks come from?", "A Congressional Budget Office report and a Department of Defense report cited by Ryan press secretary Kevin Seifert say members of the military make no contribution toward their pensions.", "So does a report we found from the nonpartisan Congressional Research Service. And, Andrew Biggs, a public employee retirement expert at the American Enterprise Institute, told us the same.", "That contrasts with all other federal employees (including civilian employees in the military). They contribute a portion of their pay toward pensions; the rates mainly depend on when they were hired.", "Here’s a breakdown of pension contributions, according to data we collected from the Congressional Research Service, the federal Office of Personnel Management and the National Active and Retired Federal Employees Association, which advocates for pay and benefits for federal employees.", "Type of federal employee", "Percentage of pay contributed by employee", "Percentage of pay contributed by employer", "Military personnel", "0", "41.8", "Civilian, hired before 1984*", "7", "19**", "Civilian, hired 1984-2012", "0.8", "11.9", "Civilian, hired in 2013", "3.1", "9.6", "Civilian, hired in 2014", "4.4", "9.6", "*Generally do not pay into or receive Social Security; employees hired after 1984 pay 6.2% toward Social Security.", "**An aggregate figure. For most federal employees, the government contributes 12.7%; the employer and employee percentages are higher for law enforcement officers and certain other types of federal employees.", "Our rating", "Ryan said members of the military don’t \"contribute toward their pension.\"", "Civilian federal employees contribute a portion of their pay toward their pensions, but members of the military don’t.", "We rate Ryan’s statement True.", "Milwaukee Journal Sentinel, U.S. Rep. Paul Ryan editorial board interview (quote at 0:40), Dec. 19, 2013", "Email interview, U.S. Rep. Paul Ryan spokesman Kevin Seifert, Dec. 30, 2013", "PolitiFact National,  \"Santorum says when his grandfather came to the U.S. in 1925, ‘there were no government benefits,’\" March 26, 2012", "Department of Defense, \"Statistical report on the military retirement system,\" May 2013", "Department of Defense, \"Valuation of the Military Retirement System,\" December 2008", "Congressional Budget Office, cost of military pay and benefits report, November 2012", "Jackson Hewitt Tax Service, \"Pensions\"", "Congressional Research Service, \"Military Retirement Reform: A Review of Proposals and Options for Congress,\" Nov. 17, 2011", "Congressional Research Service, \"Federal Employees’ Retirement System: Benefits and Financing,\" Dec. 20, 2013", "Defense Business Board, \"Modernizing the Military Retirement System,\" July 2011", "Email interview, American Enterprise Institute resident scholar Andrew Biggs, Jan. 3, 2014", "Washington Post, \"Younger military veterans are angered by budget cuts to their pension benefits,\" Dec. 31, 2013", "House Budget Committee, \"Setting the record straight -- the bipartisan budget agreement,\" Dec. 10, 2013", "House Budget Committee, \"The need to reform military compensation,\" Dec. 10, 2013", "Email interview, National Active and Retired Federal Employees Association legislative director Jessica Klement, Jan. 7, 2014", "U.S. Office of Personnel Management, \"CSRS information\"", "Federal Register, Office of Personnel Management notice, June 3, 2011", "Government Executive, \"Senate passes budget bill cutting pension benefits for new feds,\" Dec. 18, 2013", "Email interview, Department of Defense spokesman Nate Christensen, Jan. 10, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]