["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "In this Sept. 18, 2015 photo, Sparks fly as a welder works on a frame for a school bus at Blue Bird Corporation's manufacturing facility in Fort Valley, Ga. Blue Bird Corporation. (AP Photo/David Goldman)", "It’s no secret that Adam Putnam, Republican candidate for governor, is a fan of technical and vocational training. But what is a secret, according to Putnam, is how much money people make after getting the training.", "\"Nobody is telling our students that welders are coming out of their tech schools at $28 an hour,\" Putnam said at the Florida Family Policy Council forum in Orlando on May 5. \"They're not telling them that pipefitters are making six figures while their friends are getting a degree in European art history with $70,000 in student loan debt.\"", "Putnam isn’t the first Florida politician to talk up technical training and throw shade at students majoring in philosophy or anthropology (looking at you, Marco Rubio and Rick Scott).", "Was Putnam correct about how much welders and pipefitters make after graduating from technical schools? The answer depends on the type of school a student attends and the chosen industry after graduation.", "The more training you get, the more money you can make. And getting to the $28 an hour and six-figures mark that Putnam references usually applies to people who get additional certifications.", "You may not realize this, but as a nonprofit news organization, we depend on — and answer to — you. Your support directly impacts our abilility to provide objective, factual reporting reporting on issues that matter.\n\nDonate now to our Spring Campaign and go on the record as saying facts matter!", "Putnam said welders coming out of technical school make $28 an hour. Putnam spokeswoman Amanda Bevis pointed to several welder job postings in Florida that offer $17 to $30, or $27 to $35 an hour, depending on experience.", "Reaching the top end of the salary range, however, requires additional training and certifications. It isn’t the typical salary for someone paid right out of 12 to 15 months or the typical training at trade schools.", "According to the Bureau of Labor Statistics, the median wage for welders, cutters, solderers and brazers is $40,240 — about $19 an hour.", "The top 10 percent of welders earn $63,170, which is roughly $30.37.", "Debbie Hoy, program adviser at Erwin Technical College in Hillsborough County, said prospective welders who complete their program can make anywhere between $12 an hour up to $20 an hour right away.", "And at Manatee Technical College, a person who completed welding school can expect to make $15 to $20 starting out, said Gary Martin, a welding instructor. Once in the field, he said, there is the potential to make $28 an hour after completing additional certifications. For example, a welder can complete an education certification or engineering certification.", "Jack Jarrell, the business manager of Iron Workers Local 397 Union in Tampa, said if a person completes four years of training with the union, they can make up to $32 an hour. (Benefits not included, the pay is around $24.50 an hour).", "Going the union route is different than the technical schooling Putnam referred to. Still, Jarrell emphasized that the pay rate really depends on the industry someone enters after training, as some industries can afford to pay people more.", "\"If you are building trailers in Perry, Fla., ($28/an hour) ain’t happening,\" Jarrell said. \"But if you are working for a Tropicana factory, yeah I could see that.\"", "Are pipefitters making six-figures, as Putnam said?", "Pipefitters install, assemble and maintain pipes that carry various fluids, solids and/or gases. Welder and pipefitters are two separate careers, though some welders may be pipefitters and vice versa.", "Like welding, there are a wide range of career options for pipefitters and different avenues to become a professional. Careers include plumber, boilermaker and steamfitter.", "According to the Bureau of Labor Statistics, the median wage for plumbers, pipefitters and steamfitters is $52,590, or $25.28 per hour. The top 10 percent of workers earned more than $91,810.", "While the top-earner estimate is just shy of the six-figure amount Putnam referenced, the industry professionals said they had anecdotal examples of a pipefitter making at least $100,000.", "Again, it depends on the industry, level of certification and the amount of ovettime a person works.", "Martin said someone who completes the advanced program at Manatee Technical College, which is geared toward pipefitting, can expect to make $22 an hour starting out. But, it’s possible they can make up to $120,000 a year.", "Putnam said \"welders are coming out of their tech schools at $28 an hour\" and \"pipefitters are making six figures.\"", "It’s unlikely someone just starting out as a welder or pipefitter will make as much as Putnam said. That said, people who work in the industry say it’s possible to make that much depending on the industry you choose and the amount of training you get.", "Putnam's figures are overstated for young workers in those fields. We rate this claim Half True.", "Email exchanges, Amanda Bevis, spokeswoman for Adam Putnam, May 7-8, 2018", "Email exchanges, Karen Smith, spokeswoman for the Florida Department of Economic Opportunity, May 7-8, 2018", "Email exchanges, Roque Corona, Digital Marketing Specialist for American Welding Society, May 7-8, 2018", "Interview, Jack Jarrell, the business manager of Iron Workers Local 397 Union, May 8, 2018", "Interview, Debbie Hoy, the program adviser at Erwin Technical College in Hillsborough County, May 8, 2018", "Interview, Jim Taylor, the business agent at Local Union 725 , May 8, 2018", "Interview, Gary Martin, welding instructor at Manatee Technical College, May 8, 2018", "Bureau of Labor Statistics, Occupational Employment and Wages, May 2017, Welders, Cutters, Solderers, and Brazers, accessed May 8", "Bureau of Labor Statistics, Plumbers, Pipefitters, and Steamfitters, accessed May 8", "PolitiFact Florida, Marco Rubio said wrongly that welders make more money than philosophers, Nov. 11, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]