["A massive fire broke out at the office of the Income Tax Department in Mumbai on June 1. The inferno damaged the Scindia House building at the Ballard Estate area of South Mumbai, causing destruction of property, although no casualties were reported. Even as firefighters sought to tame the blaze, reports began to emerge that crucial files related to Nirav Modi and Mehul Choksi, accused in the 11,000 crore PNB scam, have been gutted. These reports were carried by mainstream news outlets. On the evening of June 1, Zee News on its channel reported that it is feared that files related to Nirav Modi and disgraced former IPL czar Lalit Modi have been destroyed in the fire. A caption for the story said, मुंबई आग का नीरव-ललित मोदी कनेक्शन!(Nirav-Lalit Modi connection to Mumbai fire- translated).", "The Tribune, in an article quoted ‘sources’ to claim that the fire at the IT office building has destroyed files pertaining to Nirav Modi and his uncle Mehul Choksi who are currently absconding. Indiatimes which is owned by the Times of India group reported that files related to the disgraced diamantaire have been feared gutted. Republic TV too joined the bandwagon reporting on the destruction of the files in the blaze, adding that sensitive files related to the Essar group have also been gutted. Mumbai Mirror which is also owned by the Bennett Coleman group reported this development in an article of June 2, mentioning that it was feared the documents have been lost in the fire. Lallantop, a popular website also reported about the loss of the files. The news expectedly circulated widely on social media platforms.", "The Tribune had published two articles, of which one was used by the Congress party in a tweet of June 3 calling it a ‘rather convenient turn of events’. This tweet has been retweeted close to a thousand times by now.", "In a rather convenient turn of events, a fire burned papers that the Income Tax Department had on Nirav Modi , the man who was photographed with PM Modi before he went on the run after pulling off the largest banking fraud in India. https://t.co/ps72fm9AFt", "— Congress (@INCIndia) June 3, 2018", "This article tweeted by the Congress party can no longer be found, although the other article by The Tribune of June 4 is still online. Lawyer Prashant Bhushan tweeted on the blaze, saying “How brazen can they get!”. It has been retweeted over 3000 times.", "Oh my God! Fire In Mumbai’s IT Department Building, Files Of Nirav Modi, Choksi & Mallya Feared Gutted. First they are allowed to escape. Then they get rid of CBI offr investigating this. Now this fire to get rid of the documents. How brazen can they get!https://t.co/g6iQZa3XJB", "— Prashant Bhushan (@pbhushan1) June 3, 2018", "The Income Tax Department has rubbished these reports published and broadcast by mainstream media organisations. In a tweet on the evening of June 3, the department clarified that “News reports appearing in some sections of media alleging that records/documents relating to investigation of Nirav Modi/Mehul Choksi have been destroyed in the Scindia House fire in ITOffice,Mumbai are completely false and misdirected”.", "News reports appearing in some sections of media alleging that records/documents relating to investigation of Nirav Modi/Mehul Choksi have been destroyed in the Scindia House fire in ITOffice,Mumbai are completely false & misdirected @PMOIndia @FinMinIndia @arunjaitley @adhia03", "— Income Tax India (@IncomeTaxIndia) June 3, 2018", "This clarification by the Income Tax Department was subsequently reported by multiple news organisations.", "Alt News found out that correspondent with The Pioneer, J. Gopikrishnan was the among the first to raise suspicion over the files having been destroyed in the blaze. Gopikrishnan tweeted on the evening of June 1,", "Income Tax Investigation Wing’s files on Nirav Modi, Mehul Choksi and Upendra Rai burned? 🤔🤔🤔🤔 https://t.co/BsVIxv6zU9", "— J Gopikrishnan (@jgopikrishnan70) June 1, 2018", "Zee News was the first to pick it up from here, broadcasting a report on the same day, which has been posted in this article above. Now that the IT Department has unequivocally stated that the reports are not true, it emerges that sections of mainstream media jumped the gun, reporting an incident of immense sensationalist value which had no basis in fact.", "The Tribune has reported this story attributing it to ‘sources’.", "Zee News, on its broadcast, kept referring to ‘reports’ that had emerged with regard to the destruction of files in the blaze.", "Republic TV too published this news ‘according to reports’.", "The Mumbai Mirror story speculated that the files have been destroyed.", "Indiatimes on the other hand made no reference to where this news had emerged from.", "In each of these cases, the reports were carried by these publications without independent verification of the facts. The news was either vaguely attributed to ‘sources’ or there was no reference to the origin of the news. While source-based reporting is a tactic regularly adopted by journalists, in this particular instance, reference to ‘sources’ could not withstand scrutiny as the report was promptly debunked.", "The tardy pace of investigation of high-profile cases in general and the low rate of conviction has convinced many citizens of possible foul play at the highest echelons when it comes to investigation of such cases. While these suspicions may be justified, in this particular case they have been fuelled by media reports which, in the pursuit of sensationalism and speed, often side-step basic verification as was observed here wherein a speculative tweet by a journalist was enough for multiple media houses to report incorrectly.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]