["By Jessica McDonald", "Posted on December 21, 2018", "At a town hall event on Dec. 11, Rep.-elect Mark Green of Tennessee inaccurately claimed that vaccine preservatives might cause autism. He also repeated an unsubstantiated claim that the Centers for Disease Control and Prevention “fraudulently managed” data that showed a link between vaccinations and autism.", "Both of these statements are bogus:", "According to the Tennessean, which first reported the story, Green’s vaccine claims came in response to a question from a woman asking about possible cuts in Medicaid funding. She said she was the parent of a young adult with autism.", "Here is more of Green’s reply.", "Green, Dec. 11: Let me say this about autism. I have committed to people in my community, up in Montgomery County, to stand on the CDC’s desk and get the real data on vaccines. Because there is some concern that the rise in autism is the result of the preservatives that are in our vaccines.\n\nSo, as a physician, I can make that argument and I can look at it academically and make the argument against CDC, if they really want to engage me on it. But it appears some of that data has been — it appears some of that data has been, honestly, maybe fraudulently managed. So we’ve got to go up there and stand against that and make sure we get that fixed, that issue addressed.", "Green is a former Army special operations flight surgeon and a 1999 graduate of Wright State University’s Boonshoft School of Medicine in Dayton, Ohio. Green, who is a Republican, previously served as a state senator and was elected this fall to represent Tennessee’s 7th Congressional District.", "When asked to provide evidence for either claim, Green’s representatives provided a statement that reads, “Recent comments I made at a town hall regarding vaccines has [sic] been misconstrued. I want to reiterate my wife and I vaccinated our children, and we believe, and advise others they should have their children vaccinated.”", "No one, however, replied to our follow-up inquiry asking how Green felt his comments had been misconstrued.", "Green’s suggestion that vaccine preservatives could be behind the “rise in autism” is not backed by science.", "As the CDC says on its website, “there is no link between vaccines and autism,” and “vaccine ingredients do not cause autism.” And in fact, as we have written before, it is not necessarily clear that there has been a rise in autism. There certainly have been more reported cases in recent years, but during that time the definition expanded and awareness increased.", "The vaccine preservative that has gained the most attention for a purported link to autism is a mercury-containing chemical called thimerosal, which is added to multidose vaccine vials to cut down on contamination.", "Although the phrase “mercury-containing” might sound scary, thimerosal has a stellar safety record. Not only is the amount of mercury in a vaccine extremely small, but it’s also a type known as ethylmercury. This type of mercury is different from methylmercury, which is the form that accumulates in fish and is toxic to people. Ethylmercury is broken down in the body much more quickly, so it poses less of a risk.", "The thimerosal in vaccines is only thought to be dangerous if a person has an allergy to the chemical, and that’s rare. The side effects are minor: a little bit of redness and swelling at a vaccine injection site.", "Numerous studies specifically have looked at thimerosal and autism. In 2004, the Institute of Medicine, which is now known as the Health and Medicine Division of the National Academies, reviewed the evidence and rejected a causal relationship between thimerosal-containing vaccines and autism. A 2006 study of nearly 28,000 children in Canada found pervasive developmental disorders were actually more common in the kids who received thimerosal-free vaccines — and concluded that the amount of thimerosal exposure was “unrelated” to the increasing reports of such disorders.", "The CDC also published nine investigations between 2003 and 2012 that failed to find a connection between thimerosal and autism. Two of these studies observed that autism rates continued to increase in countries such as Denmark and Sweden even when thimerosal was decreased or removed from vaccines.", "Indeed, despite a lack of serious safety concerns, the United States decided to begin removing thimerosal from childhood vaccines in 1999, and today all vaccines for children ages 6 and younger are available without thimerosal. This, however, was not done because of concerns about autism. As the CDC explains, “This was done as part of a broader national effort to reduce all types of mercury exposure in children before studies were conducted that determined that thimerosal was not harmful. It was done as a precaution.” And consistent with the data in other countries, reported autism rates in America have continued to rise despite thimerosal removal.", "Thimerosal, notably, never appeared in measles, mumps and rubella, or MMR vaccines, which were the first vaccines postulated to cause autism. A suggested link between MMR vaccines and autism was made in a now-retracted 1998 Lancet paper that reported results on 12 children. Years later, it became clear that none of the cases had been described accurately and unnecessary medical procedures had been performed on the kids, among other problems. The lead author, UK gastroenterologist Andrew Wakefield, later lost his medical licence because of dishonesty and unethical behavior, much of it related to his work on the Lancet paper.", "As for other vaccine preservatives, the CDC also states on its website that “no links have been found between any vaccine ingredients and ASD,” referring to autism spectrum disorder.", "Green also claimed that some of the agency’s data had been “maybe fraudulently managed.” At the town hall meeting, and in response to our inquiry, Green did not explain why he thought this was the case. But in a statement to the Tennessean, Green said he was referencing certain instances that had been brought up in Congress, such as when Florida Rep. Bill Posey argued in 2015 that the CDC had not reported a vaccine-autism connection in one of its studies.", "The study, which was published in the journal Pediatrics in 2004, was a case-control study of kids living in the Atlanta area. The objective was to look at how old children were when they received their first MMR vaccine, and whether there was a difference between kids with and without autism. If vaccines were contributing to autism, then one might expect to see more autism cases in kids who received the vaccine earlier.", "To make comparisons, the study identified 624 children with autism and then matched each “case” child with several “control” children who did not have autism, but were otherwise similar — they were the same gender, approximate age and in many instances went to the same school. The researchers then analyzed the vaccination records for all the children to find out whether there were associations between a vaccination time point and autism. If any associations were found, they would simply be associations, not proof of causality.", "The children were about the same age when they received their first MMR shot, regardless of whether they had autism. Most children — around 70 percent — got their first vaccines before 18 months, in line with recommendations to do so between 12 and 15 months. The researchers did not find associations between the vaccine and autism at either 18 or 24 months, which is when atypical development usually becomes apparent. There was a small association between the MMR vaccine and autism at 36 months, but this was not statistically significant when researchers looked at a subset of the kids and were able to control for other factors. The researchers suspected the association at 36 months was the result of children with autism entering preschool education programs, which start around the age of 3 and require proof of immunization to enroll.", "In total, the data were not consistent with the idea that vaccines were causing autism.", "On the House floor, Rep. Posey shared a story about a CDC scientist, William Thompson, who was a co-author on the 2004 paper. Posey said Thompson had “worked with a whistleblower attorney” to provide his office with documents related to the study. Posey also read from a statement Thompson made in September 2014, which said that he and his co-workers deliberately did not report a statistically significant “race effect” for vaccines and autism for the entire set of children, and that he felt they “intentionally withheld controversial findings from the final draft of the Pediatrics paper.”", "In the statement, Thompson also said the authors “scheduled a meeting to destroy documents related to the study” and later discarded hard copy documents in a “huge garbage can,” but because he thought it might have been illegal, he had saved hard copies and associated computer files.", "Anti-vaccination groups, citing Thompson’s criticism of the CDC paper, accused the agency of suppressing information linking vaccines to autism — specifically data they claimed indicated that African American males were at increased risk for autism when receiving the MMR vaccine before 36 months.", "None of these claims, however, stands up to scrutiny. There were legitimate scientific reasons not to evaluate race in the entire group of kids, and as we’ll explain, there was still a breakdown by race in the CDC paper. And contrary to what was implied, none of the important study data were destroyed.", "The data are still available by request from the CDC. Thompson said as much in his full September 2014 statement, which Posey released to journalists. After explaining the dumping of hard copy documents, Thompson added, “All the associated MMR-Autism Study computer files have been retained on the Immunization Safety Office computer servers since the inception of the study and they continue to reside there today.”", "A person affiliated with an anti-vaccination group even published a reanalysis of the data in 2014, noting that he obtained the data directly from the CDC. The reanalysis has been retracted, but it’s proof that nothing untoward happened to the data in this study.", "As for the Pediatrics study, it reports associations by race for the subset of children with available birth certificate information (see table 5). A little over half of each group of kids — those with and without autism — had birth certificates. The only positive association is for African Americans at the 36 month time point, but it is not statistically significant.", "The study does not give a breakdown by race for the entire group of kids. But there’s a perfectly good reason for this.", "As the CDC explains in a 2015 statement, birth certificate information allows researchers to control for possible autism risk factors, such as birth weight and the mother’s age and education. “This information was not available for the children without birth certificates; hence [the] CDC study did not present data by race on black, white, or other race children from the whole study sample,” the statement reads.", "Controlling for these other factors, or confounders, means scientists are more likely to arrive at a valid result — and not be led astray by a connection that happens to be there by coincidence.", "Sean Hennessy, a professor of epidemiology and biostatistics at the University of Pennsylvania, told us in a phone interview that the CDC’s explanation is a “compelling argument.” He acknowledged that we can’t know whether the reasoning provided is the real reason, but scientifically, “their rationale for presenting the race subgroup analysis in the birth certificate cohort does make sense.”", "The CDC did not respond to repeated requests for comment for this story. Thompson, who still works for the CDC, but not for the immunization program, said he was not allowed to speak about the topic, but that he stood by his previous statements.", "In the full statement shared with Posey, Thompson alleged that he and his co-authors did not follow the original study protocol, which he claimed included a plan to assess race in the full sample, and that the group decided later not to report those findings. But the final analysis plan that Thompson shared with Posey does not say the authors planned to report results by race in the full sample. In fact, it says nothing at all about reporting results by race.", "The plan only mentions using race as a possible confounder to adjust the results in the entire sample (see page 8). A confounder in this case is a characteristic that influences both vaccination and autism, thereby distorting the results as to whether there’s a link between vaccination and autism. Using race as a confounder, Hennessy said, is not the same as reporting results by race, which would mean doing an analysis to see if there is an association between MMR vaccination and autism in certain races. Because the protocol does not stipulate doing any such analyses, any reporting by race in the study is a bonus.", "As we alluded to earlier, a year before Rep. Posey shared Thompson’s story on the House floor, chemical engineer and Simpson University biology professor Brian Hooker published a supposed reanalysis of the CDC data in the journal Translational Neurodegeneration. Hooker claimed to have identified a 3.36-fold increased risk of autism among African American boys who received the MMR vaccine prior to the age of 3. But Hooker, who was not trained as an epidemiologist, made grave errors in his analysis, including doing cohort comparisons even though the data were from a case-control study — a no-no in epidemiology.", "Just a few months following publication, the article was retracted due to “undeclared competing interests on the part of the author which compromised the peer review process” and because “post-publication peer review raised concerns about the validity of the methods and statistical analysis.” Hooker has a son with autism, and at the time of publication, had a pending court case claiming that his son was harmed by vaccines. The paper was also funded by Focus Autism, an anti-vaccine group now known as Focus for Health, where Hooker served on the board. (Hooker published another reanalysis of the CDC data this year in a publication that is not indexed on PubMed, which is maintained by the National Center for Biotechnology Information at the National Library of Medicine.)", "Notably, Hooker had been in contact with Thompson for nearly a year prior to his paper’s publication in Translational Neurodegeneration. But with the release of that paper, Hooker produced a video with Andrew Wakefield that compared the CDC’s actions on the Pediatrics paper to the Tuskegee syphilis experiments. The video featured audio recordings of Thompson that Hooker made without Thompson’s permission. In an Aug. 27, 2014, press release, Thompson said he was not “given any choice regarding whether my name would be made public or my voice would be put on the Internet.”", "There is no credible indication that the CDC mishandled its data, and even if concerns about this one paper were valid, it wouldn’t change the preponderance of other evidence disputing a connection between vaccines and autism.", "As the agency reminded the public in its 2015 statement, “Additional studies and a more recent rigorous review by the Institute of Medicine have found that MMR vaccine does not increase the risk of autism.”", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]