["About this rating", "Football fans have grown accustomed to some of the biggest musicians in the world stepping up to the stage for the halftime show of the Super Bowl. In recent years, football's biggest game has featured superstars such as Jennifer Lopez, Justin Timberlake, and Lady Gaga.", "But back in 1967, when the Green Bay Packers took on the Kansas City Chiefs during Super Bowl I, the halftime show looked a little different. At that event, fans were treated to the spectacle of 300 pigeons, performances from the University of Arizona and Grambling State University marching bands, and a flying demonstration from the Bell Air Rocket Men. According to comedian Larry Fine's autobiography \"Stroke of Luck,\" fans also witnessed a legendary performance from The Three Stooges.", "Fine writes in his book that The Three Stooges \"killed\" it with their renditions of \"Niagara Falls\" and \"Ah-Ha! Ma-Ha!\" before the show went a little off the rails when he saw a fan flirting with his wife Mabel in the stands. According to Fine, he was fined $42.50 after he was filmed flipping the bird at the stands.", "Here's an excerpt from \"Stroke of Luck\" as recounted by San Diego Reader:", "\"We made a boat-load of money when the Columbia shorts were sold to television in the '50's. Moe got a call from Fred Friendly over at CBS asking if the Stooges wanted to perform during the half-time show for something called the Super Bowl. Pudd'nhead Joe thought it was an invitation to put in a personal appearance at the opening of a new septic tank store, but Moe said it was a football game. What do I know from football? A bunch of burly hot dogs chasing a ball up and down a field is too violent for me. I prefer playing the ponies.", "\"The knuckleheads in the audience went wild as The Stooges took to the field. We killed! After our classic 'Niagara Falls' and 'Ah-Ha! Ma-Ha!' routines we broke into a toe-tapping rendition of 'We're Coming to Your House.' During the third chorus, I noticed some thick-necked Bronco Nagurski talking to my Mabel in the stands. He must have thought she was an eligible receiver, because by the looks of things, a football wasn't the only inflated orb he was making a pass at. I shook my fist and shouted, 'I'm warning you! Stop trying to steal my wife, you horse thief.'", "\"The crowd thought it was part of the act, but I wasn't joking. Blinded by jealousy -- my Mabel is a looker, and can she cook -- I didn't realize the camera was on me when I flipped the pigskin-palooka the 'Italian salute.' Hoo-boy, did I get in Dutch with the top brass at CBS. Not only did I have to pay a fine of $42.50, which was a lot of money in those days, the network banned me from appearing on 'Family Affair.' I'd like to think that had I landed the role of 'Uncle Bill,' poor misguided Buffy would still be alive to this day.\"", "This anecdote, like much of Fine's book, put the emphasis on humor over facts.", "We found several old newspaper articles about the first Super Bowl halftime show, but none of them mentioned anything about Larry Fine or The Three Stooges. We also searched through archival photographs from the Associated Press, Life Magazine, and Getty Images, but couldn't find any that featured The Three Stooges at the first Super Bowl.", "Here's how the halftime festivities were described in an article published in the The Daily Record-Gazette a few days before football's big game:", "Mon, Jan 9, 1967 – 7 · The Daily Record-Gazette (Banning, California) · Newspapers.com", "We also searched the archives for any mention of Fine's getting fined $42.50 for flipping the bird at a fan during Super Bowl I, but again came up empty-handed. We also found no mention of The Three Stooges in any of the modern accounts of the NFL's first Super Bowl that we examined.", "In addition to there being no record of a Three Stooges performance, we found a few other reasons to be skeptical of Fine's story. For one, Fred Friendly, the CBS executive who reportedly called up Fine to offer him the Super Bowl gig, left CBS in 1966, the year before the first Super Bowl. Friendly was also the president of CBS News, not the network's sports division, and it also seems strange that a network president and not, say, a booking agent, would have called Fine to talk about the Super Bowl.", "Fine's book \"Stroke of Luck\" has also been described as \"riddled with errors.\" Fine wrote the book with the help of author James Carone in 1970 after suffering debilitating stroke that ended his acting career. The book was self-published and didn't have a proper editor. While it certainly contains a number of humorous anecdotes, it isn't exactly a historical record. Steve Cox, the author of the Larry Fine biography \"One Fine Stooge,\" said that \"Stroke of Luck\" was a \"disastrous little book\" and that he didn't take \"everything [Carone] said as fact\":", "It’s funny how things you do in previous years affect projects much later on. This is one example. When I was a teenager and doing some Stooges research, I located an older man named James Carone, who had published with Larry a book of his Stooges memories.", "It was supposed to be Larry’s autobiography but ended up being a book about Larry written by Carone. All in all, it was a mess. It was a disastrous little book called Stroke of Luck. Larry was really pinned to the ground with the project and embarrassed by the book when it was published. It does remain, however, the first book published on the team.", "Partnering with Larry Fine’s brother (Morris “Moe” Feinberg), I’d purchased the last surviving copies of this book from Carone’s collection and got to know Carone in his last years. He was an old guy and liked to talk about the old days, not just about Larry Fine.", "Carone was kind of a blowhard, so I didn’t take everything he said as fact. I knew Carone had really ripped Larry off, but he proclaimed to have made no profits from the book. If he did make any profits, they were minimal. The book was a small-time effort.", "Regardless, he produced a sub-par book for Larry and because of that, Larry wished to write another book to clean things up. It took decades, but that project, which Larry began in 1973, came to fruition with One Fine Stooge. Larry came up with that title, by the way.", "While Fine did write in his autobiography that The Three Stooges performed at the first Super Bowl, this doesn't appear to be the case. It's possible that Fine was remembering a different halftime performance — although, likely not at the Super Bowl. We found no record of The Three Stooges performing at the Super Bowl in '68, '69, or '70; and by '71, Fine was no longer able to perform — or it's possible that he simply made up the story for a laugh. Regardless, The Three Stooges did not perform at Super Bowl I.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]