["This Facebook post was published on March 1, 2020.", "It contains a long post in Indonesian language and three photos showing Indonesian Foreign Affairs Minister Retno Marsudi, people in a group photo, and an aircraft.", "Below is a screenshot of the misleading post:", "The first two paragraphs of the post’s caption translate to English as: “Foreign Affairs Minister Retno Marsudi advises all Indonesian citizens abroad to stay alert because of the coronavirus in China. President Jokowi told Retno Marsudi, the foreign minister, to bring home Indonesian citizens who want to return home [and provide] 1,000 free tickets.", "“Promptly report yourself to PT Angkasa Pura through the following number because the tickets are limited, only 1,000 tickets. Those who report fast will return home free of charge.”", "The misleading post includes a phone number which it says it belongs to a person in charge of the free tickets from PT Angkasa Pura.", "Jokowi is the nickname of Indonesian President Joko Widodo.", "PT Angkasa Pura is Indonesia’s state-owned airport operator.", "The novel coronavirus, officially known as COVID-19, was first detected in the Chinese city of Wuhan in late 2019. The virus has killed more than 3,825 and infected more than 110,000 people in more than 100 countries, AFP reported on March 9, 2020.", "The claim in the misleading post was first published on Facebook on February 26, 2020, here, where it was shared more than 1,300 times before it was removed. The same claim was also shared here and here.", "The claim is false; the Indonesian Foreign Ministry dismissed it as a “hoax” on the agency's official Facebook page here on March 2, 2020.", "The ministry’s Facebook post includes a screenshot of one of the misleading posts with the word “HOAX” in red stamped on it.", "The text on the blue box translates to English as: \n\t“#MOFAFriends\n\tBEWARE OF FRAUDULENT HOAX", "“Stay alert and be careful with circulating information that uses the name of the Foreign Affairs Ministry and the Foreign Affairs Minister, Retno L. Marsudi", "“FACTCHECK\n\tThe Foreign Affairs Minister and the Foreign Affairs Ministry have never promised ‘free international tickets’ as mentioned in the following hoax.”", "The ministry’s spokesman, Teuku Faizasyah, also told AFP via WhatsApp on March 3, 2020, that the claim is a “hoax” and warned there could be “a fraudulent motivation behind it.”", "PT Angkasa Pura also refuted the misleading claim in a post published on its official Facebook page here on March 1, 2020, saying the company was never involved in selling tickets to passengers.", "The post’s Indonesian-language caption translates to English as: “BEWARE OF HOAX", "“Beware of a hoax that says that Angkasa Pura I provides 1,000 free tickets to Indonesian nationals abroad due to coronavirus.", "“Angkasa Pura I as an airport operator has never involved in the selling of airline tickets to passengers or collaborating with travel agents.", "“We ask Indonesian nationals to always be mindful and do not send personal identities and transfer a certain amount of money to irresponsible parties.\n\tThank you.”", "The photos in the misleading posts also do not support the claim.", "The photo of Foreign Minister Retno was previously published on October 25, 2019 here on the website of the Indonesian Embassy in Tripoli, Libya. The photo was posted in a congratulatory message marking Retno's re-appointment as foreign minister in the 2019-2024 cabinet.", "The second image that shows people posing in a group photo was previously published without a caption here on January 12, 2018. The photo was used as a cover photo on the Facebook page of the airport authority of Manado, a city in the eastern Indonesia province of North Sulawesi.", "The third photo that shows an airplane was published here on image-sharing website Pixabay and was taken by a photographer named Peter Herrmann.", "The claim has been debunked by other Indonesian media outlets, for example by Liputan6.com, Vivanews.com and Jawa Pos.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]