["About this rating", "On 11 December 2018, one day after UK prime minister Theresa May announced the postponement of a critical vote in Parliament on the Brexit deal she negotiated with the European Union, a report surfaced on the Internet saying she was also canceling the next general election.", "According to the website News Thump, May decided to cancel the election because she can't win it:", "Theresa May has taken the unprecedented step of cancelling the next general election after deciding that she does not have sufficient support to win the vote.", "Having previously been confident that she could secure victory in the 2022 election, it has become clear over the last few days that the nation thinks she’s an incompetent leading the nation into an inevitable humiliation.", "A Whitehall insider told us, “We have looked at the numbers, and we have heard what the voting public is saying, and the chances of Theresa being returned as PM are so infinitesimally small that we have decided to call the whole thing off ...", "The justification was similar to the one she gave for delaying the Brexit vote: in the case of the latter, the agreement faced strong opposition in Parliament and appeared headed for certain defeat. May said she intended to resume negotiations with the EU to land a better deal.", "However, unlike the postponed Brexit vote, the claimed cancellation of the next UK general election was fiction, not fact. The prime minister made no such announcement. The source of the claim, News Thump, calls itself \"a satirical and spoof news website\" based in the United Kingdom. A disclaimer on the site reads:", "We are not afraid to skip a few steps like checking facts or corroborating sources, and we never let the truth ruin a funny story (it’s much easier just to make everything up). So, for clarification -- If you read a story on here, then you are NOT supposed to believe it. It has been completely made up purely for entertainment purposes.", "News Thump has also published stories reporting that an emotional Elon Musk begged friends to \"Stop me before I tweet again,\" and that a cloud of smoke seen billowing from Trump Tower in early 2018 was the president's pants going up in flames.", "Castle, Stephen.   \"Facing Defeat, Theresa May Delays Brexit Vote in Parliament.\"\r\n   The New York Times.   10 December 2018.", "News Thump.   \"Theresa May Cancels Next General Election Because She Doesn't Think She'll Win.\"\r\n    11 December 2018.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]