["The photo was published on Facebook here on November 29, 2020.", "The post’s Hindi and English-language caption translates to English as: “Farmers want article 370 and 35A to restored in Kashmir. Only the pawn has changed, but the planning is absolutely the same as it was at the Shaheen Bagh.”", "The misleading post was shared as farmers in India demonstrate against new agricultural laws and block key highways on the outskirts of the capital. Here is an AFP report on the issue.", "Article 370 and 35A refer to the special arrangement in the Indian constitution that granted semi-autonomous status to India’s northern state of Jammu and Kashmir since independence in 1947. The constitutional arrangement was revoked by the Indian government on August 5, 2019, triggering country-wide protest, as reported here by AFP.", "Shaheen Bagh refers to an area in the Indian capital of Delhi where hundreds of women have staged a sit-in protest since late 2019, following the passing of the Citizenship Amendment Act (CAA). The law, which grants citizenship to non-Muslim immigrants from Afghanistan, Bangladesh and Pakistan, was criticized as anti-Muslim and sparked nationwide protests, as reported by AFP here.", "The photo was also shared alongside identical claims on Facebook here, here, here and here and on Twitter here, here, here and here.", "The claim is false.", "A reverse image search on Google found the same photo was posted here on the Facebook page of Shiromani Akali Dal Amritsar on August 8, 2019.", "Shiromani Akali Dal (Amritsar) is a splinter group of Sikh-dominated political party Shiromani Akali Dal (SAD) led by Simranjit Singh Mann, who has vocally supported decades-old demand of Khalistan -- a separate country for Sikhs -- and opposed the abrogation of Article 370, as reported here, here and here.", "The group held protest demonstrations in the north Indian cities of Amritsar and Srinagar against abrogation of Article 370, as reported here and here  from August to September 2019.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]