["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Rep. Mike Honda, D-Calif., posted this graphic on Medium. We checked its accuracy.", "In a Medium post titled, \"It’s Time for the Senate to Do Its Job,\" Rep. Mike Honda, D-Calif., urged senators to hold a vote on President Barack Obama’s Supreme Court nominee, Merrick Garland.", "Virtually since the moment it was announced that Justice Antonin Scalia had died, Democrats and Republicans have clashed over when he should be replaced. Senate Republicans have so far held firm in saying they will not vote on the nomination until the public weighs in after Election Day 2016.", "Democrats counter that this is out of step with Senate norms, and they have created a graphic to make that case. \"Let’s give President Obama’s #SCOTUSnominee a fair hearing and timely vote,\" the graphic says.", "At the top of Honda’s March 16 Medium post is a graphic created by the House Democratic Caucus.", "Under the title, \"6 justices confirmed in presidential election years since 1912,\" the graphic shows photographs of all six justices who fit that description. Is it accurate?", "Of the six examples cited in the graphic going back to 1912, five were both nominated and confirmed during a presidential election year. They are summarized in the following chart. (We’ve corrected the spelling of Clarke’s name, which is incorrect in the Democrats’ graphic).", "The sixth case involves a future justice who was nominated prior to an election year but was confirmed during one. Associate Justice Anthony Kennedy, who’s still on the court, was confirmed in February 1988, but President Ronald Reagan, a Republican, had nominated him in November 1987 to succeed the retiring Louis Powell.", "It’s worth noting that in June 1968, five months before the presidential election, Democratic President Lyndon Johnson made two nominations, though there was not technically a vacancy, and neither were approved.", "Johnson nominated Abe Fortas, who was a sitting justice, to succeed Earl Warren as chief justice, after Warren indicated he wanted to retire. Fortas hit strong opposition in the Senate Judiciary Committee and in the face of a filibuster, he asked that his name be withdrawn. (The hearings uncovered questionable speaking fees Fortas received, and he resigned from the court in 1969.)", "Johnson had also nominated Homer Thornberry to take Fortas’ place on the court. But that nomination, too, was withdrawn, since Fortas was never elevated.", "Finally, in October 1956, Republican President Dwight Eisenhower did something even more extraordinary than making a nomination less than a month before election day. He put William Brennan directly on the court with a \"recess appointment\" to replace Sherman Minton. He then formally nominated Brennan in January 1957.", "Our ruling", "The graphic Honda used said that \"six justices\" on the U.S. Supreme Court have been \"confirmed in presidential election years since 1912.\" That is correct, so we rate the statement True.", "Mike Honda, \"It’s Time for the Senate to Do Its Job,\" March 16, 2016", "PolitiFact Wisconsin, \"Urging vote on Merrick Garland, congresswoman says 6 justices have been OK'd in presidential years,\" March 17, 2016", "Email interview with Russell Wheeler, judicial scholar at the Brookings Institution and former deputy director of the Federal Judicial Center, March 17, 2016", "Email interview with Paul Kincaid, spokesman for Mike Honda, March 17, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]