["A Facebook post, archived here, features a photo of a young girl with a caption claiming it shows Okonjo-Iweala, who recently became the director-general of the WTO.", "“Don't undermine any child especially the girl child. Give them equal training. This girl here resumes work today as the DG, WORLD TRADE ORGANIZATION ...she's Dr Ngozi Okonjo Iweala (sic)”, the caption reads.", "Another post shared more than 1,000 times includes the same image alongside two others, claiming they all show Okonjo-Iweala as a child. This particular post also lists several other claims, including that Okonjo-Iweala wanted to study geography as a child but chose economics instead because Harvard University did not offer geography as a course of study.", "The post was first shared on Twitter and retweeted more than 700 times. It has since appeared on multiple pages on Facebook (see here, here, here, and here).", "By running multiple reverse image searches, AFP Fact Check located the photo of the young girl on Pinterest here and here. The earliest version of the image online appears to be from a street photography blog called Freshwallstreet. The 2014 blog post credits Allen Coleman as the photographer.", "AFP Fact Check contacted Coleman, a Ghanian photographer, who confirmed he had shot the image.", "“It was part of a series of portraits called ‘EYES’; it was more centered on the stories left in thoughts that were exposed by our eyes. Fear. Interest. Curiosity”, he wrote in an Instagram message.", "Although Coleman could not remember the exact date, he said the photo was taken sometime between 2013 and 2015.", "“No. That’s not her,” he added when asked if the photo was of Okonjo-Iweala.", "AFP Fact Check also ran an analysis of the image using the open-source tool InVID WeVerify. The metadata showed that the image was taken on July 28, 2014, and edited a few days later. It was then uploaded to the blog. This corroborates Coleman’s claim.", "As Okonjo-Iweala was born on June 13, 1954, she was 60 years old in 2014. Thus, the photograph could not be of the WTO Director-General as a child.", "The claims about Okonjo-Iweala’s initial interest in geography are largely true. In a 2013 interview in Forbes Africa, Okonjo-Iweala said, “I didn’t go to Harvard thinking I would do economics, as I thought it would be dead boring. But because they didn’t have geography as a core subject, economics was the closest subject that I could do to satisfy my curiosity”.", "Okonjo-Iweala holds a bachelor's degree in Economics from Harvard University and a Ph.D. in Regional Economics and Development from the Massachusetts Institute of Technology (MIT).", "As the post suggests, Okonjo-Iweala has expressed support for the education of young girls.", "“All studies have shown that when mothers are educated, when girls are educated, the chances of their children getting immunized and getting healthier rises significantly,\" she said in an interview with the New Humanitarian. “Education is very, very important.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]