["The video was published here on Facebook on October 27, 2020. It has been shared more than 3,200 times.", "The Thai-language caption translates to English as: “Molave has reached Vietnam. Thailand prepare, are you ready?”", "Typhoon Molave hit several parts of southeast Asia in October 2020. It made landfall in central Vietnam on October 28, causing widespread flooding and damage in its path, according to this AFP report.", "The same video was also shared here, here, here, here, and here on Facebook, alongside a similar claim.", "The claim is false; all of the clips in the video pre-date Typhoon Molave.", "Reverse image searches on Google found most of the videos have circulated online in reports about Typhoon Mangkhut striking parts of China, Hong Kong and Macau in September 2018.", "Typhoon Mangkhut was 2018's strongest storm, leaving a trail of destruction as it passed through the Philippines, Macau, Hong Kong and parts of China, AFP reported here.", "First video", "The first clip was found published here on YouTube on September 16, 2018. The title reads: “Mangkhut ravages Macau”.", "Cantonese can be heard being spoken in the clip. The footage was captured next to a market on Avenida Horta e Costa in Macau.", "Below is a screenshot comparison of the first video in the misleading post (L) and the 2018 YouTube video (R):", "Second video", "The second video was also found published here on YouTube dated January 22, 2017. The title reads: “Tons of birds flying in Houston TX”.", "Below is a screenshot comparison of the second video in the misleading post (L) and the 2017 YouTube video (R):", "This video was also uploaded here on the YouTube channel of the UK’s Daily Mail newspaper with a similar description on March 8, 2018.", "Third video", "A video identical to the third clip in the misleading posts was published here on Bilibili, a Shanghai-based video sharing website, on September 16, 2018.", "Below is a screenshot comparison of the third video in the misleading post (L) and the 2018 Bilibili video (R):", "This clip was captured in Hong Kong, as shown here on Google Maps.", "AFP Fact Check wrote this report about the clip after it also circulated in false social media posts about a typhoon in Japan.", "Fourth video", "UK-based newspaper Metro published the fourth clip in the misleading posts here on September 16, 2018.", "The report is titled: “Video: Father and son getting swept away by typhoon Mangkhut”. The caption reads: “Father and son getting swept away by typhoon Mangkhut in Hong Kong”.", "Below is a screenshot comparison of the fourth video in misleading post (L) and the video in the Metro’s 2018 report (R):", "The same clip was also published here by Taiwanese broadcaster SET News on September 9, 2018 in a report about Typhoon Mangkhut.", "Fifth video", "The fifth clip was found in this September 17, 2018 report published by UK newspaper The Evening Standard. It is titled: “Typhoon Mangkhut video: The shocking moment a hotel lobby in China is instantly flooded”.", "Below is a screenshot comparison of the fifth video in the misleading post (L) and the video in the 2018 Evening Standard report (R):", "The same clip was published by US tabloid newspaper the New York Post in this video report about Typhoon Mangkhut flooding the Sheraton Dameisha Resort in the southern Chinese city of Shenzhen.", "The video corresponds with interior shots of the Sheraton Dameisha Resort in the southern Chinese city of Shenzhen tagged at the hotel's location on Google Maps.", "Sixth video", "The sixth video in the misleading posts was published in this September 20, 2018 article about Typhoon Mangkhut in Hong Kong by the Taiwan-based news website KKNews.cc.", "Below is a screenshot comparison of the sixth video in the misleading post (L) and the video in the KKNews report (R):", "Seventh video", "AFP found the seventh clip in the misleading posts published here in an article by Hong Kong-based newspaper South China Morning Post on September 16, 2018.", "The report's headline reads: “TYPHOON MANGKHUT: World’s most powerful storm of 2018 rips through Hong Kong”.", "Below is a screenshot comparison of the seventh video in the misleading post (L) and the South China Morning Post video (R):", "The construction site collapsed on a road in the suburb of Tai Kok Tsui, Hong Kong Free Press reported here. The same location can be seen here on Google Maps.", "Eighth video", "A longer version of the eighth clip in the misleading posts was found published here in an article by the UK-based media company Newsflare on September 16, 2018.", "It reads in part: “Typhoon Mangkhut made landfall in southern Guangdong Province, bringing the wind of up to 100mph.", "“In the video, a huge tree in Shenzhen is seen being uprooted. In the same city, a crane is seen collapsing.”", "Below is a screenshot comparison of the eighth video in the misleading post (L) and the Newsflare video (R):", "Ninth video", "An identical clip to the ninth video in the misleading posts was found published in this September 17, 2018 report by the Turkish news website Beyazgazete.", "The article’s Turkish headline translates to English as: “Mangkhut Typhoon hits China - Figures: 4 Dead 200 Injured.”", "Below is a screenshot comparison of the ninth video in the misleading post (L) and the video on Beyazgazete (R):", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]