["About this rating", "Voting in the 2020 U.S. Election may be over, but the misinformation keeps on ticking. Never stop fact-checking. Follow our post-election coverage here.", "On Nov. 1, 2020, former acting Director of National Intelligence Richard Grennell and conservative radio host Mark Levin shared a photograph that supposedly showed Democratic presidential candidate Joe Biden on a plane while not wearing a mask during the COVID-19 pandemic:", "The picture on the left truly shows Biden on a plane without a mask. However, this photograph was taken in November 2019, long before COVID-19 was widely spread in the United States, and long before face masks were widely recommended by public health officials in order to slow the spread of the disease.", "The picture was taken by Biden campaign photographer Adam Schultz, and shows the former vice president on a plane talking with Remi Yamamoto, Biden's traveling national press secretary. This photograph was featured in an October 2020 profile by Vogue about Yamamoto, where it was captioned:", "Yamamoto and Biden huddle on a flight to South Carolina in November 2019. Photo: Adam Schultz/Biden for President", "The first COVID-19 related lockdowns in the United States occurred in the second half of March 2020. The Centers for Disease Control and Prevention (CDC) didn't issue guidelines recommending the use of face masks in public to slow the spread of COVID-19 until the following month.", "This is not the first time that an old picture of Biden without a mask has circulated along with the accusation that the candidate was acting hypocritically by urging supporters to wear masks but refusing to do so himself. A photograph of Biden and his running mate Kamala Harris from March 2019 — long before the start of the COVID-19 pandemic — was circulated on social media in August 2020 with a similar accusation.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]