["By Angelo Fichera", "Posted on May 8, 2018", "Q: Did Clint Eastwood announce he’s leaving his estate to President Donald Trump’s reelection campaign?", "A: No. That story originated on a self-described satirical website.", "Actor and filmmaker Clint Eastwood has not declared plans to leave his estate to President Donald Trump’s 2020 reelection campaign, contrary to what an online story claims.", "The  story was posted by politicslive.net on May 1, and was rightly flagged by some Facebook users as potentially false. It originated  days earlier on the website Daily World Update, which publishes fictitious stories that it  labels  satire. But its stories are often republished elsewhere and treated as fact. Politicslive.net does not include a disclaimer about the story being satire, for example.", "The fictitious report claims that Eastwood (who’s 87, not 89, as the story says) has been told by doctors to “get his affairs in order” because he is near death. It also features a number of supposed statements made by Eastwood that we could not locate anywhere other than the made-up story. Likewise, we could find no credible reports stating that Eastwood’s health is declining.", "“Eastwood is donating his Northern California ranch, 40K acres of grazing land in Nevada and more than $7 million in cash and other assets to Trump’s 2020 campaign,” the story continues. “The campaign has said they will be delighted to accept the donation and will use the ranch as a command center for the entire Pacific Northwest.”", "On Facebook, some suspected the story to be false. “I’m calling Fake News on this one,” one user wrote. But others welcomed the false news, indicating that they believed it. “What a great American, God bless you and your family,” another user commented.", "Eastwood, a self-described libertarian who spoke at the 2012 Republican National Convention, did express support for Trump in an Esquire interview ahead of the 2016 election (though he noted he hadn’t “endorsed anybody”).", "When he was pressed by the interviewer to choose between Trump or rival Hillary Clinton, Eastwood responded: “That’s a tough one, isn’t it? I’d have to go for Trump … you know, ’cause she’s declared that she’s gonna follow in Obama’s footsteps. There’s been just too much funny business on both sides of the aisle.”", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk false stories flagged by readers on the social media network.", "“About.” Daily World Update. Accessed 7 May 2018.", "“Clint Eastwood – Biography.” IMDb. Accessed 7 May 2018.", "“Clint Eastwood Leaves His Estate To The Trump 2020 Campaign.” Daily World Update. 27 Apr 2018.", "“Clint Eastwood Leaves His Estate To The Trump 2020 Campaign.” Politicslive.net. 1 May 2018.", "Hainey, Michael. “Clint and Scott Eastwood: No Holds Barred in Their First Interview Together.” Esquire. 3 Aug 2016.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]