["About this rating", "Boebert has repeatedly posed for photographs with or alongside AR-15 style guns. Information contained in a Boulder police affidavit suggests that the suspected assailant in a March 2021 mass shooting owned, carried, and used an AR-15 style weapon, or a variant thereof. However...", "Definitive determinations on the weapon or weapons used to kill the 10 people who died in the Boulder shooting will likely only be possible after ballistics testing and autopsies are conducted.", "In March 2021, as Americans responded with horror to yet another mass shooting, this time at a grocery store in Boulder, Colorado, the popular left-leaning Facebook page Occupy Democrats highlighted what it presented as rank hypocrisy on the part of controversial first-term Republican Congresswoman Lauren Boebert, a strident supporter of gun rights.", "The meme, posted on March 22, contained a photograph of Boebert and the following text:", "BREAKING NEWS:", "Lauren Boebert sends \"prayers\" to the victims of today's shooting in Boulder, Colorado.", "Boebert fetishizes guns and regularly poses for photos with AR-15 rifles, the same one used to murder 10 of her fellow Coloradoans today.", "WHAT DO YOU SAY TO BOEBERT?", "On March 23, Boulder police announced that they had arrested 21-year-old Colorado man Ahmad Al Aliwi Alissa, and charged him with 10 counts of murder in connection with a shooting rampage at the King Soopers grocery store on Table Mesa Drive in Boulder, on March 22.", "The description of Boebert \"fetishizing\" guns is a highly subjective one, and well beyond the scope of this fact check. However the meme accurately described Boebert's remarks in the aftermath of the March 2021 shooting, as well as her past record of posing for photographs holding or alongside AR-15 style guns.", "Initial information provided to Snopes by Boulder police indicates that the suspected shooter owned, carried and used an AR-15 style gun, or a variant thereof, but a definitive determination of the weapon used to kill each of the 10 individuals who died in the shooting will likely not be possible until ballistics testing and autopsies have been conducted. As a result, we are issuing a rating of \"Mixture.\" If relevant information becomes available, we will update this fact check accordingly.", "On March 22, Boebert did indeed offer her prayers to those affected by the shooting, including the victims. So that component of the Occupy Democrats meme was accurate. In one tweet she wrote:", "My prayers are with the shoppers, employees, first responders & others affected by the shooting in Boulder. May God be with them. While we are still awaiting important information and details in this case, random public shootings & senseless acts of violence are never ok.", "And in another she wrote:", "As we continue to hear the news coming out of Boulder, I’m praying for the police, first responders, and those affected by this tragedy. May God be with us as we make sense of this senseless violence, and may we unify and not divide during this time.", "It would perhaps be a stretch to say that Boebert regularly poses for photos with AR-15 rifles, but she has done so several times in recent years, and certainly more frequently than most Congress members and congressional candidates, and appears to have no aversion to appearing armed with, or next to, semi-automatic rifles.", "At a Feb. 18, 2021, virtual hearing of the House Natural Resources Committee, Boebert appeared sitting in front of a book case that visibly contained a handgun and three rifles, two of them similar in appearance to the AR-15:", "Democratic committee member Rep. Jared Huffman of California mocked Boebert, saying she had a \"shrine to [her] gun fetish as [her] Zoom background.\"", "In January 2020, while campaigning for the 3rd Congressional District seat she ultimately won, Boebert posed next to Alamosa County Sheriff Robert Jackson, holding an AR-15 style rifle, in a photograph she posted to her Instagram account:", "Boebert first came to prominence in 2014, when she opened Shooters Grill, a gun-themed restaurant in Rifle, Colorado, which attracted the attention of local and national news media due to its policy of encouraging customers and staff to carry licensed firearms. Over the years, she has posed with AR-15 style guns on a few occasions, as part of efforts to promote the restaurant.", "In 2015, for example, Boebert was filmed firing an AR-15 style rifle on a shooting range, as part of a short online video about Shooters, produced by Barcroft Media:", "And in July 2019, Boebert posed at a gun show in Colorado, brandishing what appeared to be AR-15 style rifles, in photographs posted to the Instagram account of her restaurant:", "According to several details contained in a Boulder police arrest affidavit, provided to Snopes by the Boulder County District Attorney's office, the preponderance of evidence so far indicates that the suspected shooter owned, was armed with, and used an AR-15 style rifle, or a variant thereof, during the March 22 attack at King Soopers.", "The affidavit, written by Boulder police Detective Sarah Cantu and based on reports by various law enforcement officers and investigators, contains the following relevant information:", "The police affidavit in question states that Alissa had recently purchased a firearm which is a variant of an AR-15, several witnesses observed that the alleged assailant carried an AR-15 style gun, and a Boulder police officer reported that at one point Alissa shot at him with what he said appeared to be an \"assault rifle.\" (An AR-15 is a semi-automatic rifle, as distinct from an assault rifle, which allows the user to switch into fully automatic mode, but it's easy to see how an AR-15 or AR-15 variant could be mistaken for an assault rifle).", "However, definitive clarification as to the exact weapon or weapons used to kill the 10 individuals who lost their lives in the King Soopers attack will likely not be available until ballistics testing and autopsies have been conducted, and their results made public. If further pertinent information becomes available, we will update this fact check accordingly. Until then, this component of the Occupy Democrats meme remains unproven, and we are therefore issuing a rating of \"Mixture.\"", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]