["A March 23 post (archived here) showing the screenshot has been shared some 1,500 times. “The truth hurts that is why this post was removed. Here it is again,” it reads. It then shows the screenshot of the supposed message from Eskom, which reads:", "“There has been a rising pressure from social media asking us to switch off Soweto as most of the residents there get their electricity free. Unfortunately the matter is not that simple. After 1994, we promised them free electricity and they are our people. Without Soweto we will lose Gauteng province.”", "However, it soon becomes clear that the message did not come from Eskom’s official Facebook page.", "In the screenshot, the name of the page posting the message is “Eskom Electricity”.", "The power utility’s official page has a different name -- the rather more wordy “Eskom Hld SOC Ltd”.", "A Facebook search for “Eskom” returns numerous page results which all bear the company logo. The fact that the page named “Eskom Hld SOC Ltd” has 123,000 “likes” -- far more than the others -- is the first indication that this page is the most likely to be genuine, although this alone is not proof.", "It’s sometimes difficult to know whether a social media page purporting to represent a company or organisation is genuine or not, as people often create parody accounts or replica pages designed to look like the real thing.", "If you have any doubt about the veracity of a supposedly “official” social media page, it’s best to see if it’s linked to from the company or organisation’s website -- as is the case with Eskom’s Facebook page.", "That link on Eskom's website redirects to the Facebook page Eskom Hld SOC Ltd.", "We weren’t able to find the post seen in the screenshot -- it’s possible that it has been deleted.", "But the same text appeared in a post by an Eskom parody page on March 19 which was shared 6,400 times. “Ek'sdom” means “I’m stupid” in Afrikaans.", "More than half of the reactions to that post were “hahas”, indicating that when posted by this account with a comedy name, most people did not take it seriously. But by the time the same message was screenshot and shared on March 23 under the name “Eskom Electricity”, more of the reactions took the form of an “angry” or “amazed” face, suggesting that by this point it was less obviously a parody post.", "The screenshot may not have really come from Eskom, but it touches on genuine tensions over the question of electricity supply to residents in Soweto, South Africa’s most populous township.", "Some social media users have complained that Soweto residents are not paying their fair share for electricity, contributing to deep financial problems at the power utility.", "Non Paying Soweto should be the one feeling the pinch of #Loadshedding #Eskom", "Soweto residents gonn come on twitter talmbout “oh wow lights are out” like they didn’t single handedly put the whole country in debt LOL\n\n\t\tYou niggas don’t even know your meter number Cos you ain’t paid for shit a day in your life!", "Those Soweto residents must be plunged into darkness until they pay like the rest of us.", "Eskom afraid of Soweto residents. Just switch their shit off", "As reported by AFP, Eskom re-imposed highly unpopular rotational power rationing, known as load-shedding, last month due to chronic supply and maintenance problems.", "For many critics of the ruling ANC, the Eskom blackouts have come to symbolise the price that South Africans are paying for alleged state corruption and mismanagement.", "The power utility, which generates more than 90 percent of the country's energy, is buried under a debt bill of 420 billion rand ($30 billion). Last month Finance Minister Tito Mboweni announced a $1.6 billion-a-year bailout for the company.", "Contributing to these debts are large amounts owed to Eskom by its clients -- including in Soweto.", "Large numbers of residents in South Africa’s most populous township have for years defaulted on their electricity bills.", "To put things into perspective, in January it emerged that by the end of September 2018 Soweto owed Eskom R17 billion ($1.2 billion) -- equal to the amount owed by all of South Africa’s municipalities combined, as tweeted at the time by energy analyst Chris Yelland.", "At @NERSA_ZA public hearings yesterday, Thys Möller, GM for customer services at @Eskom_SA, said municipal debt rose by 80% in past 18 months, reaching R17bn by the end of Sep 2018. Soweto debt, including interest charges, also rose to R17bn during the same period.", "Some Soweto residents say they are too poor to pay, while others cite vague promises made by ANC politicians to provide free electricity after the end of Apartheid in 1994. In recent years, attempts to install pre-paid electricity meters -- which would make it easier for Eskom to get paid for the electricity it supplies -- have repeatedly met with defiant street protests.", "The Facebook post alludes to frustration among some in South Africa that large numbers of clients in Soweto have managed to stay connected to the grid, even after refusing to pay their bills.", "Eskom spokesman Khulu Phasiwe told AFP that there was widespread misunderstanding about the power situation in Soweto.", "“Eskom had, in the recent past, been disconnecting the power supply to municipalities that were defaulting and people were asking, ‘Why don’t you do the same in Soweto?’” Phasiwe said.", "“Many people think that we are not doing anything about Soweto but the reality is that actually we have interrupted power to individual households in Soweto that are not paying.”", "In Soweto, Eskom directly supplies 180,000 individual households -- unlike in other areas where the power is supplied via municipal authorities, Phasiwe said.", "“So the municipality in other words, is a direct customer of Eskom. If you want to disconnect that area because of non-payment, then you have one central point to got to to disconnect which is that municipality,” added Phasiwe.", "In Soweto, it’s not as simple as pulling the plug on a single client.", "Phasiwe said a customer services report indicated that more than 17,000 households in Soweto had had their power interrupted due to non-payment over the past few months.", "“When you have an individual household defaulting and everyone else in their street has lights, clearly that person will quietly go and make the payment and they will have the lights back on. That is what is happening in Soweto, we are not treating Soweto any differently from other sets of customers that we have.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]