["On Jan. 6, hundreds of supporters of President Donald Trump stormed the U.S. Capitol in an attack that forced lawmakers to flee their chambers and left five dead.", "Since the riot, users on Facebook and Twitter have leveled accusations that U.S. Rep. Lauren Boebert, R-Colo., provided assistance to the insurrectionists.", "One Facebook user posted on Jan. 13 a photo of Boebert and about dozen other people, at least four of whom appear to be making a white supremacist hand gesture.", "\"Congresswoman Lauren Boebert took this group on a guided tour of the Capitol one day before the insurrection. Three of the people participated and knew exactly where to go,\" reads the text below the photo, a tweet from the account of Frank Giugliano. The tweet has since been deleted.", "Another user shared the same photo and text caption, writing, \"The mental giant is now under investigation for her involvement. Note their hand sign identifying them as racists.\"", "USA TODAY reached out to the Facebook users for comment.", "Most of the information in the post is false. Boebert didn't post the photo on Instagram on Jan. 5 — nor was it taken at the U.S. Capitol.", "The photo was taken in December 2019 at the Colorado State Capitol in Denver. Boebert was posing with members of American Patriots III% and Bikers For Trump after a rally against red flag laws, according to the Colorado Times Recorder.", "Boebert has said she didn't take any of the individuals on a tour of the U.S. Capitol.", "\"Unfortunately, due to COVID-19, I have not given any Capitol tours except to show my children around where I’ll be working while I’m away from home,\" she told KUSA.", "According to a news release from Boebert's office, it is \"categorically false\" to say she gave tours to \"insurrectionists\" and she \"did not conspire with criminals that attacked the U.S. Capitol.\"", "It's true that Boebert has been criticized for her activity on Twitter midway through the riot at the Capitol.", "At 2:17 p.m., she wrote, \"We were locked in the House Chambers.\" At 2:18 p.m., she added, \"The Speaker has been removed from the chambers.\"", "Based on the tweet, multiple Democrats have accused her of intentionally providing insurrectionists with the location of House Speaker Nancy Pelosi, and called for her resignation, per the Boston Globe.", "Boebert hit back at such accusations in a statement on Jan. 11", "\"They accuse me of live-tweeting the Speaker’s presence after she had been safely removed from the Capitol, as if I was revealing some big secret, when in fact this removal was also being broadcast on TV,\" she wrote.", "Based on our research, the claim that Rep. Lauren Boebert took a photo with rioters before a tour of the U.S. Capitol on Jan. 5 is FALSE. The photo was from a rally at the Colorado Capitol in December 2019. Boebert also said she didn't take any of the individuals on a tour of the U.S. Capitol. She said she has been unable to give tours due to COVID-19.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook."]