["The photo was published in this Facebook post on September 18, 2019.", "It has been shared more than 730 times.", "The blurry photo shows Philippine legislator Grace Poe's US passport.", "The post's caption claims the photo proves Poe is “not a Filipino citizen” and is ineligible to hold public office.", "The post’s Tagalog language caption translates to English as: “GRACE POE? This is proof that she is not a Filipino Citizen, how many elections have passed and it seems she’s just allowed and free to hold government posts. As far as I know, being a Dual Citizen limits one’s eligibility to own property or hold a post in government.”", "Below is a screenshot of the misleading Facebook post:", "A similar Facebook post was published here on September 16, 2019, contains images of what it claims are Poe’s US and Philippine passports.", "Below is a screenshot of the misleading Facebook post:", "The Tagalog language text above the photos translates to English as: “This is the CITIZENSHIP OF FAKE SENATOR.”", "The text below states: “Hiding your real identity is not only pretentious and opportunist act but fooling and duping other people. Actually, you’re the Plan B of the Oligarchs/yellow pols/CPP-NPA and CIA leaning yellow politicians for they knew Roxas and Robredo can’t win…”", "“Yellow” is a pejorative term for members of the opposition Liberal Party.", "“CPP-NPA” refers to the Communist Party of the Philippines-New People’s Army.", "“CIA” refers to the US Central Intelligence Agency.", "“Roxas” refers to former senator Mar Roxas, “Robredo” to vice president Leni Robredo, both members of the Liberal Party.", "The claim in the Facebook posts is false; the photo of the passport has been taken from an old news report.", "A reverse image search on Google traced found the blurry photos of the passport were published in this May 17, 2015 article by the English-language newspaper, The Manila Times.", "Below is a screenshot of the article:", "Poe, already a senator, was then running for president, as reported here by AFP.", "The Manila Times article states Poe’s US passport was issued in December 2011, and her Philippine passport was issued on May 16, 2014.", "The Philippine Supreme Court on March 8, 2016 ruled she was qualified to run for president.", "The court said she was issued a Philippine passport on April 4, 1988, and renewed it on April 5, 1993 and May 19, 1998.", "It added she became a naturalized American citizen on Oct. 18, 2001, obtained a US passport on Dec. 19, 2001, renounced her American citizenship Oct. 20, 2010 and stopped using her US passport.", "It further said she obtained a Philippine diplomatic passport on Dec. 19, 2013.", "Below are screenshots from the court decision:", "Here is an AFP story about the Supreme Court decision allowing Poe’s 2016 presidential run.", "Poe topped the 2013 Philippine Senate race, lost to Rodrigo Duterte when she ran for president in 2016, and was reelected senator in 2019 placing second.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]