["By Angelo Fichera", "Posted on January 29, 2019", "There is no evidence to support social media posts attributing a quote about Nancy Pelosi to former President Ronald Reagan.", "When reclaiming her role as speaker of the House, Democratic Rep. Nancy Pelosi invoked Republican President Ronald Reagan.", "“He said, ‘If we ever close the door to new Americans, our leadership role in the world will soon be lost,'” she recalled Jan. 3, citing remarks he made in 1989.", "Weeks later, social media users spread a different quote attributed to Reagan — this one about Pelosi.", "“Nancy Pelosi is extremely evil, she comes from the Baltimore democrat corruption machine the D’Alesandro family, both her father Tom D’Alesandro and her brother Tommy D’Alesandro were mayors of Baltimore, a well oiled corrupt democrat family,” the supposed quote reads.", "We could find no proof that Reagan made such a remark, which was shared in a popular Facebook meme and on Twitter. Searches for that text show no trace of that quote’s existence prior to the social media posts.", "Melissa Giller, chief marketing officer at the Ronald Reagan Presidential Foundation and Institute, pointed us to the Reagan Presidential Library website, which, among other things, includes statements, speeches and papers from the 40th president’s administration.", "“I’ve searched every speech President Reagan gave,” she told FactCheck.org in an email. “He never once mentioned Nancy Pelosi.”", "Pelosi was a freshman congresswoman during Reagan’s second term; she was first elected to Congress in 1987.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on the social media network.", "U.S. Congressional Record – House. 3 Jan 2019: H6.", "Giller, Melissa. Chief marketing officer, Ronald Reagan Presidential Foundation and Institute. Email sent to FactCheck.org. 28 Jan 2019.", "“Pelosi, Nancy.” Biographical Directory of the United States Congress. Accessed 28 Jan 2019.", "“Remarks at the Presentation Ceremony for the Presidential Medal of Freedom.” Ronald Reagan Presidential Library & Museum. 19 Jan 1989.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]