["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A bogus story that said House minority leader Nancy Pelosi, D.-Calif, suffered \"a psychotic break from reality\" appeared to have come from a website run by a well-known fake news operator and liberal troll.", "The headline on a June 14, 2017, post on FreedomCrossroads.us declared, \"Nancy Pelosi suffers breakdown, taken from Capitol Hill on a stretcher.\" Facebook users flagged the post as potentially being fabricated as part of the social media site’s efforts to fight fake news.", "The brief post said that Pelosi \"was transferred via ambulance to Bethesda\" and quoted the unmistakably fake Rear-Admiral Thomas Phillip McCrakken, the alleged head of psychiatry, as saying Pelosi may not recover.", "There is absolutely no proof this incident happened, of course, and a Pelosi spokesman had no comment. The image used at the top of the story is taken from NBC footage recorded after a shooting at the Capitol on March 28, 2016.", "But FreedomCrossroads.us had a familiar feel to it — it shared a design template with TheLastLineOfDefense.org, a parody site responsible for literally hundreds of fake news stories popping up across the Internet.", "That site was run by a man named Christopher Blair, who has told us he was a self-described liberal troll living in Maine. He said his aim was to trick conservatives with absurd and fictional news stories that exposed how gullible they were.", "A Whois lookup showed that FreedomCrossroads.us is registered to Blair, and lists information PolitiFact had previously used to contact him. The site was registered on Aug. 18, 2016. Its posts are archived back to March 21, 2017.", "We tried to reach Blair to verify he was the site’s owner but didn’t get any response. The Pelosi post is credited to an author called \"Truth Dealer,\" who is crosslisted as Alan Whitemor.", "FreedomCrossroads.us said on its page footer that the site made up its stories. \"Here we gather a boatload of bullhonkey, works of pure satirical fiction, to give the fist-shakers of the world a reason to hate,\" it reads.", "Pelosi did not have any kind of breakdown. The story came from a parody website run by a prolific troll.", "We rate this one Pants On Fire!", "Correction, Oct. 2, 2017: This story originally misspelled Alan Whitmore's name.", "FreedomCrossroads.us, \"Nancy Pelosi Suffers Breakdown, Taken From Capitol Hill On A Stretcher,\" June 14, 2017", "NBCUniversal Archives, ambulance footage, March 28, 2016", "CNN, \"Capitol shooting: Suspect in custody,\" March 28, 2016", "PolitiFact, \"If you're fooled by fake news, this man probably wrote it,\" May 31, 2017", "Interview with Drew Hammill, Pelosi spokesman, June 14, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]