["About this rating", "On 16 January 2018 YourNewsWire.com — a regular disseminator of hoaxes and fake news — regurgitated another round of \"Illuminati\" conspiracy theories by stacking them under a fake story about singer Beyoncé.", "Its article pushed the claim that the Texas native had boasted that her stardom was the result not of her work, but her family lineage:", "Revealing that a \"DNA test kit\" given to her by Gwyneth Paltrow’s 13-year-old daughter Apple Martin \"opened up a whole new world to me\" and \"created my obsession with tracing my family tree\", Beyonce told close friends and associates on Jay-Z's Family Feud video shoot that her family is \"closely related\" to the Bush family, Rockefeller dynasty and \"the Queen of England.\"", "\"We are related to the Rockefellers on my Mom's side. I thought that was something but we are also not-so-distant cousins of the British Royal Family,” Beyonce boasted.", "Like virtually everything else on YourNewsWire.com, this statement is a fabrication. While the story states that its account is based on \"reports,\" it does not link to any report that could corroborate its account. Even if it were true, the concept of the Illuminati, a shadowy group of people who purportedly control the world, has been roundly debunked time and again and being related to (for example) the Bush family and the Rockefellers would not be the same as confessing membership in that group.", "There is, however, a social connection between Beyoncé and Gwyneth Paltrow; their daughter have celebrated birthdays together. Also, Paltrow's ex-husband, Chris Martin of Coldplay, backed up Beyoncé during her halftime performance at Super Bowl 50 in February 2016. Conservatives have openly resented the former Destiny's Child singer for incorporating a tribute to the Black Lives Matter movement.", "It is perhaps worth noting that Your News Wire once also ran a story about Beyoncé claiming that she had demonstrated her reptilian shapeshifting powers at Serena Williams' wedding, and indeed seems to be convinced that many celebrities are casually changing form at random, saying so in a series of articles that are so similar that it seems that only a few names and details have been changed. Naturally, each article offers up \"proof\" in the forms of links to pages that don't exist, then immediately claims that the articles (or images, or hashtags) that showed that evidence have all mysteriously disappeared.", "Hautman, Nicholas. \"Beyonce's Daughter, Blue, Joins Gwyneth Paltrow’s Daughter, Apple, for Birthday Brunch.\"\r\nUs Magazine. 15 May 2016.", "Zaru, Deena. \"Beyonce Gets Political at Super Bowl, Pays Tribute to 'Black Lives Matter.'\"\r\nCNN.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]