["Following the deadly mass shootings in El Paso, Texas, and Dayton, Ohio, in early August, President Donald Trump visited two hospitals to meet with victims of the attacks and to thank the first responders and hospital staff treating them.", "But after his Aug. 7 visit to Miami Valley Hospital in Dayton, internet users started to share a false rumor that a viral photo of Trump smiling with a group of nurses was staged, and that the nurses were actually paid actors.", "Several Facebook posts say that media members were not permitted access during the visit and that the women arrived at the hospital a few hours before Trump. While it is true that reporters were not permitted to enter the hospital while Trump was visiting, the rest of the claim is false.", "One of the posts shares a Twitter screenshot from someone named Farid Ghalili that reads:", "\"I got a text from a friend who knows a nurse at the hospital told her that many of the women who were at the hospital wearing nurse uniforms did not work at the hospital. They showed up a couple of hrs before Trump arrived. This was staged. That’s why no reporters were allowed.\"", "Another post includes the now-viral image of the nurses smiling and embracing Trump claimed:", "\"No media allowed. The nurses report that the women in this picture don’t work at their hospital. ‘Why is he surrounded by mostly women all touching him. No media access...this is so propaganda bullshit from an installed Russian operative.’ Various News agencies are researching this photo and the people that were posed or paid to be in it. The one woman on the far right in scrubs was at his rallies. There may be others that were viewed at his rallies as well. Notice all the badges are turned backwards.\"", "Some commenters expressed skepticism of the photo’s authenticity by questioning why those photographed appeared in different colored scrubs.", "The posts, both from Aug. 8, were flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "We reached out to the user at the Farid Ghalili Twitter account, @faridghalili, about his claim that he received a text from a friend about the photo being staged. Ghalili responded to PolitiFact in a direct message, saying that the text he mentioned came from an ex-hospital employee he knows who lives in Ohio. He said the person told Ghalili that neither his friend nor his friend’s source wanted to talk to reporters. \"I belive (sic) a good investigative reporter can check and coraborate (sic) this,\" Ghalili told us. \"But so far from what I have heard the hospital staff and nurses are not talking about it.\"", "Well, we did our own reporting. The photo is real and the women in it are employees at the hospital.", "Sharon D. Howard, communications director at Miami Valley Hospital, confirmed to PolitiFact that the women in the photo are employed at the hospital.", "\"They are employees at the hospital. The pictures from the visit include our nurses, our staff, first responders and our patients,\" Howard said. \"(And) the color of the scrubs can differ depending on what unit you work in.\"", "We rate this claim False.", "Facebook post, Aug. 8, 2019", "White House Pool reports, Subject: Out of town pool report #4 - Dayton, Aug. 7, 2019", "CNBC, Trump visits Dayton, Ohio after mass shooting that shocked country, Aug. 7, 2019", "Snopes, Did Trump Hire ‘Fake Nurses’ to Pose With Him During His Visit to Dayton?, Aug. 9, 2019", "NPR, White House White House Restricts Press Corps' Access During Trump's Visits To El Paso And Dayton, Aug. 8, 2019", "Buzzfeed News, Injured Victims At An El Paso Hospital Refused To Meet Trump During His Visit, Aug. 8, 2019", "WHIO 7, Baby boom at Miami Valley Hospital — 11 nurses pregnant at same time, April 24, 2019", "White House Flickr, Accessed Aug. 14, 2019", "Phone Interview with Sharon D. Howard, communications director at Miami Valley Hospital, Aug. 14, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]