["The second of a two-part debate offered a new crop of spin.", "By Eugene Kiely, Brooks Jackson, Lori Robertson, Robert Farley, Jessica McDonald, Saranac Hale Spencer, Angelo Fichera and D'Angelo Gore", "Posted on June 28, 2019 | Updated on July 3, 2019", "The second group of 10 Democratic presidential candidates made false and misleading claims about immigration, gun control legislation and the environment, and repeated familiar talking points on taxes, health care and poverty.", "Night two of the primary election debates, on June 27, was again hosted by NBC, MSNBC and Telemundo.", "Former Vice President Joe Biden falsely claimed President Trump “immediately discontinued” an aid program to Central America, and implied that’s the cause of surging immigration across the U.S.-Mexico border.", "In fact, the Obama-era aid program was reduced only about 23 percent during Trump’s first two years, while illegal border crossings surged to more than triple the levels than before the Obama aid program commenced. Trump has already relented on a recent threat to cut off the aid entirely.", "Biden: I’m the guy that got a bipartisan agreement … to spend $740 million to deal with the [border] problem, and that was to go to the root cause of why people are leaving in the first place. It was working.", "We saw, as you know, a net decrease in the number of children who were coming. The crisis was abated. And along came this president, and he said — he immediately discontinued that.", "Biden was referring to the “U.S. Strategy for Engagement in Central America,” which began under Obama in fiscal year 2016 at a level of $750 million, according to a June 12 report by the Congressional Research Service, an arm of the Library of Congress. (See Table 5, page 13.)", "Appropriations for the program had already decreased to just under $685 million by fiscal year 2017, which began Oct. 1, 2016, before Trump was elected and nearly four months before he took office.", "From there, appropriations fell further to an estimated $527.6 million in the current fiscal year, according to the CRS report. That’s a reduction of just under 23 percent.", "Trump’s budget request for fiscal 2020, which begins Oct. 1, calls for a further cut to $445 million — which would represent a cumulative reduction in annual appropriation levels of 35 percent since the last fiscal year that began under Obama.", "In March, however, Trump told reporters, “I’ve ended payments to Guatemala, to Honduras, and to El Salvador. No money goes there anymore.” He directed the State Department to withhold appropriated aid funds. But that was a response to — not a cause of — the renewed surge in immigration.", "At the time Trump spoke, March apprehensions of immigrants illegally attempting to cross the U.S.-Mexico border were surging to 92,840, more than triple the level of March 2015, prior to the aid program to which Biden referred. Far from being “abated,” the “crisis” of which Biden spoke had come back with a vengeance.", "Trump has since relented on his threat. On June 18 — after widespread criticism — his administration said it would go ahead with $432 million in projects and grants that had been previously approved — out of the $615 million in aid that Trump had ordered to be frozen.", "Two candidates, former Colorado Gov. John Hickenlooper and Sen. Bernie Sanders, mentioned time frames in their discussions of climate change that could use some additional context.", "Hickenlooper, who studied to be a geologist, and is a two-term former governor of Colorado, said in response to a question about climate change, “I share the sense of urgency. I’m a scientist, so I recognize that we’re within 10 or 12 years of actually, you know, suffering irreversible damage.”", "Sanders later said, “The scientists tell us we are 12 years before there is irreparable damage to this planet.”", "The 12-year figure is frequently mentioned by the press and politicians, and is extrapolated from a 2018 special report from the Intergovernmental Panel on Climate Change, which found that global warming “is likely to reach 1.5°C between 2030 and 2052 if it continues to increase at the current rate.” The world has already warmed about 1 degree Celsius.", "The report also concluded that to stave off warming beyond 1.5 degrees Celsius above pre-industrial levels — and avoid the many climate change effects — the world would have to cut carbon dioxide emissions by 45% from 2010 levels by 2030 and be net-zero by 2050.", "In 2018, that statement was taken by many to mean there were only 12 years left to do something about climate change. But many scientists have since come forward to say that’s the wrong way of thinking about it.", "Myles Allen, an author of the IPCC report and the leader of the ECI Climate Research Programme at the University of Oxford, explained in a Conversation story he wrote in April that the IPCC’s timing is only a best estimate.", "“Please stop saying something globally bad is going to happen in 2030,” he wrote. “Bad stuff is already happening and every half a degree of warming matters, but the IPCC does not draw a ‘planetary boundary’ at 1.5°C beyond which lie climate dragons.”", "Kristie L. Ebi, director of the Center for Health and the Global Environment at the University of Washington in Seattle, told the AP, “This has been a persistent source of confusion,” adding, “The report never said we only have 12 years left.”", "And Kate Marvel, a NASA climate scientist, told Axios in January, “12 years isn’t a deadline, and climate change isn’t a cliff we fall off — it’s a slope we slide down.” She added, “We don’t have 12 years to prevent climate change — we have no time. It’s already here. And even under a business-as-usual scenario, the world isn’t going to end in exactly twelve years.”", "Sanders repeated the same misleading claim about the Republican tax law that he and other Democrats have recited since the law passed at the end of 2017.", "Sanders said during the debate, “83% of your tax benefits go to the 1%.”", "But that won’t be true until 2027, when most of the individual income tax changes will have expired.", "We’ve written about this claim before — when Sanders said it during a CNN town hall and when Democratic Sen. Sherrod Brown of Ohio and House Minority Leader Nancy Pelosi said it shortly after the law passed.", "Sen. Kamala Harris also partly echoed the claim during the debate, saying that she would repeal the “tax bill that benefits the top 1% and the biggest corporations in this country.”", "Most of the individual income tax provisions expire after 2025, which will shift most of the tax benefits to the top 1%. An analysis by the Tax Policy Center found that the top 1% of income earners would get 20.5% of the tax cut benefits in 2018. That percentage would go up to 25.3% in 2025 and then jump to 82.8% in 2027.", "Before the law was passed, Republicans said that they expected a future Congress to extend the individual income tax cuts, instead of allowing taxes for many to increase. They structured the law that way so they could pass their tax bill through budget reconciliation, a process requiring only a majority vote in the Senate, which meant that Republican lawmakers could not add more than $1.5 trillion to the deficit over 10 years. Also, they couldn’t have a bill that added to the deficit beyond that 10-year window.", "So, while it will be true that 83% of the tax cut benefits will go to the top 1% of income earners in 2027 if Congress doesn’t act before then, it is misleading to give that statistic without context.", "Pushing back against President Trump’s claims that the economy is doing great, Sen. Kamala Harris said, “Well yeah, people in America are working — they’re working two and three jobs.” The percentage of American workers who hold multiple jobs is virtually unchanged from when Trump took office, according to the Bureau of Labor Statistics.", "Harris: I’m meeting people who are working two and three jobs — you know this president walks around talking about and flouting his great economy right — my great economy, my great economy … You ask him how are you measuring the greatness of this economy of yours? And they point to the jobless numbers and the unemployment numbers. Well yeah people in America are working — they’re working two and three jobs.", "According to the Bureau of Labor Statistics, there were 7,855,000 people who held multiple jobs in May, or 5 percent of all those who are employed. That percentage has remained virtually unchanged during Trump’s presidency — it was 4.9 percent in January 2017 when he took office. In fact, the percentage of the employed working multiple jobs has hovered around 5 percent since late 2009, and it’s lower than the roughly 6 percent of workers who held multiple jobs during the late 1990s.", "Looking deeper into the 7,855,000 who held multiple jobs in May, the majority — 4.4 million — were people with full-time jobs who had a secondary part-time job, according to a BLS news release (See Table A-18). Another nearly 2 million had two part-time jobs, and about 325,000 held two full-time jobs.", "We looked into a similar claim last July when then-congressional candidate Alexandria Ocasio-Cortez wrongly claimed that the low U.S. unemployment rate was “because everyone has two jobs.” The number of people holding more than one job has no bearing on the unemployment rate.", "In one of the most contentious moments of the debate, Harris confronted Biden on two race-related issues: Biden’s past opposition to school busing and his recent comments about working with “some civility” in the 1970s with two segregationist southern Democrats, Sens. James Eastland of Mississippi and Herman Talmadge of Georgia.", "Harris, who is black, accurately noted that Biden “worked with them to oppose busing,” and told the story of her own school integration experience as an elementary student. As we have written, Berkeley public schools in California began busing students to fully integrate the school district in 1968, and Harris began attending Thousands Oaks Elementary School in 1970.", "Biden, who was first elected to the Senate in 1972, accused Harris of “a mischaracterization of my position across the board.” In telling her personal story, Harris left out a key detail: It was the local school district’s decision to integrate its schools.", "The former vice president said he opposed busing “ordered by the Department of Education,” or what critics called “forced busing,” in the 1970s. “You would have been able to go to school the same exact way because it was a local decision made by your city council,” Biden said. In fact, Harris was attending an integrated school before Biden even joined the Senate.", "But Harris did not mischaracterize Biden’s comments about Eastland and Talmadge, so she did not mischaracterize his position “across the board.”", "Harris said “it was hurtful to hear you talk about the reputations of two United States senators who built their reputations and career on the segregation of race in this country.” Biden responded by saying, “I did not praise racists.” Harris didn’t say he did. She said he talked about their reputations, and Biden did say that he was able to work with them in a civil way to get things done in the Senate, despite their political and personal differences.", "At a June 18 fundraiser in New York, Biden described Talmadge as “one of the meanest guys I ever knew,” and said Eastland referred to him as “son” instead of senator, which he took as a sign of disrespect.", "But, in comparison to the current political climate in Washington, Biden went on to say: “At least there was some civility. We got things done. We didn’t agree on much of anything. We got things done. We got it finished. But today, you look at the other side and you’re the enemy. Not the opposition, the enemy. We don’t talk to each other anymore.”", "Rep. Eric Swalwell, trying to distinguish himself from the other candidates on gun issues, said he was “the only person on stage who has voted and passed background checks.”", "That’s clearly false. Biden, for example, was in the Senate in 1993 and voted for the Brady Handgun Violence Prevention Act, which became law. It requires federally licensed firearms dealers to conduct background checks on most gun transfers to prospective buyers.", "Swalwell’s campaign explained that the California congressman meant he “was the only person on stage who has voted for and passed universal background checks.”", "That’s true, but still misleading.", "Swalwell did vote for the Bipartisan Background Checks Act that passed the Democratic-controlled House by a vote of 240-190 in February. The legislation, according to the Congressional Research Service, expands background check requirements by prohibiting a firearm transfer between unlicensed individuals “unless a licensed gun dealer, manufacturer, or importer first takes possession of the firearm to conduct a background check.”", "However, four other people on the debate stage — Sanders, Harris, Sen. Michael Bennet and Sen. Kirsten Gillibrand — are all co-sponsors of the Background Check Expansion Act, which would “expand federal background checks to all gun sales,” according to lawmakers who reintroduced the bill in January. (Sens. Elizabeth Warren and Cory Booker, who were in the previous night’s debate, are also co-sponsors.)", "But because the Senate is currently controlled by Republicans, that bill has virtually no chance at passing in the chamber.", "After being asked about his concerns about “embracing socialism,” Hickenlooper misrepresented the Green New Deal, objecting to a provision in the legislation that doesn’t exist.", "“I admire the sense of urgency and how important it is to do climate change — I’m a scientist,” he said, “but we can’t promise every American a government job.”", "The Green New Deal, which we’ve written about before, is a nonbinding resolution that aims to tackle climate change while ensuring job security, health care and protecting vulnerable communities.", "The Green New Deal doesn’t promise every American a position in the government. Instead, it guarantees “a job with a family-sustaining wage, adequate family and medical leave, paid vacations, and retirement security to all people of the United States.”", "The resolution was introduced into both chambers of Congress in February, and is most closely associated with New York freshman congresswoman Alexandria Ocasio-Cortez. In March, the resolution did not advance in the Senate, after nearly all Democrats voted “present.”", "Sanders claimed that Trump tried to “throw 32 million people off their health care that they have,” a figure that includes people who would choose to no longer purchase insurance if Congress repealed the Affordable Care Act without replacing it. As we’ve written before, it’s misleading to say 32 million would all be thrown off.", "Trump supported a partial repeal-and-replace bill in the Republican-backed American Health Care Act, which wasn’t expected to have as big of an impact on the uninsured. But he also backed an immediate repeal of the ACA, with a replacement at a “later date.”", "In 2017 the Congressional Budget Office estimated the Obamacare Repeal Reconciliation Act of 2017, a bill that would fit that description,  would increase the number of uninsured by 32 million people over 10 years. But not all of them would be thrown off their insurance. CBO said: “In the nongroup market, some people would choose not to have insurance partly because they choose to be covered by insurance under current law to avoid paying the penalty.”", "The ACA imposed a tax penalty, known as the mandate, on those without health insurance, but the Republican tax law repealed that penalty as of Jan. 1 of this year. It’s worth noting that in May 2018, the CBO revised downward its estimate of the impact of repealing the mandate.", "In his closing statement, Sanders said he suspects “people all over the country who are watching this debate are saying these are good people, they have great ideas, but how come nothing really changes?”", "He then posed several questions, including, “How come we have the highest rate of childhood poverty?”", "That’s an unchanging — and false — Sanders claim. We debunked it twice during his 2016 presidential run.", "A 2017 report by the United Nations Children’s Fund, or UNICEF, did note that the United States is above average when it comes to the “relative child poverty” rate — which “shows the proportion of each nation’s children living in a household where disposable income is less than 60% of the national median.”", "But the report did not indicate the U.S. had the “highest” rate. The country ranked No. 7 out of 41 rich countries, behind Romania, Israel, Turkey and others.", "The U.S. Census Bureau pegged the 2017 poverty rate for those under age 18 at 17.5 percent (see Table 3), which is the lowest it’s been since 2006.", "The bureau also calculates the Supplemental Poverty Measure, which accounts for government programs that assist low-income families and are not considered in the official poverty measure. The SPM rate for children in 2017 was 15.6 percent.", "Update, July 3: We amended our story to note that Sen. Kamala Harris began attending Thousand Oaks Elementary School, a public school in Berkeley, California, in 1970, according to her campaign. We previously reported, based on information from her Senate office, that she began there in 1969.", "Meyer, Peter J. “U.S. Strategy for Engagement in Central America: Policy Issues for Congress.” Congressional Research Service. 12 Jun 2019.", "Brennan, Margaret and Grace Segers. “Trump directs State Department to cut off aid to El Salvador, Guatemala and Honduras.” CBS News. 30 Mar 2019.", "U.S. Customs and Border Protection. “Southwest Border Migration FY 2019.” Undated website accessed 28 Jun 2019.", "Lee, Matthew. “US restores some aid to El Salvador, Honduras, Guatemala.” The Associated Press. 18 Jun 2019.", "Smith, Allan and Doha Madani. “Biden doubles down on segregationist comments, says critics like Cory Booker ‘should apologize’ to him.” NBC News. 19 Jun 2019.", "Spencer, Saranac Hale. “Sen. Harris Didn’t ‘Lie’ About Integration.” FactCheck.org. 13 Jul 2018.", "U.S. Congress. “Joseph Robinette Jr.” Biographical Directory of the U.S. Congress. Undated. Accessed 28 Jun 2019.", "Sokol, Jason. “How a Young Joe Biden Turned Liberals Against Integration.” Politico Magazine. 4 Aug 2015.", "Bobic, Igor. “Democrats Slam Joe Biden Over Comments Invoking Segregationist Senators.” HuffPost. 19 Jun 2019.", "Congressional Budget Office. Cost Estimate: H.R. 1628 Obamacare Repeal Reconciliation Act of 2017. 19 Jul 2017.", "Congressional Budget Office. Federal Subsidies for Health Insurance Coverage for People Under Age 65: 2018 to 2028. May 2018.", "U.S. Bureau of Labor Statistics. Multiple Jobholders. Retrieved from FRED, Federal Reserve Bank of St. Louis on 28 Jun 2019.", "U.S. Bureau of Labor Statistics. Multiple Jobholders as a Percent of Employed. Retrieved from FRED, Federal Reserve Bank of St. Louis on 28 Jun 2019.", "Bureau of Labor Statistics. News release: The Employment Situation — May 2019. 7 Jun 2019.", "Berman, Corey and Farley, Robert. “Ocasio-Cortez Wrong on Cause of Low Unemployment.” FactCheck.org. 18 Jul 2018.", "UNICEF. “Innocenti Report Card 14 Children in the Developed World.” Jun 2017.", "U.S. Census Bureau. “Income and Poverty in the United States: 2017.” 12 Sep 2018.", "U.S. Census Bureau. “Historical Poverty Tables: People and Families – 1959 to 2017.” Accessed 28 Jun 2019.", "U.S. Census Bureau. “The Supplemental Poverty Measure: 2017.” 12 Sep 2018.", "U.S House. “H.Res.109, Recognizing the duty of the Federal Government to create a Green New Deal.” (as introduced 7 Feb 2019).", "Davis, Susan. “Senate Blocks Green New Deal, But Climate Change Emerges As Key 2020 Issue.” NPR. 26 Mar 2019.", "McDonald, Jessica. “The Facts on the ‘Green New Deal’.” FactCheck.org. 15 Feb 2019.", "Freedman, Andrew. “Climate scientists refute 12-year deadline to curb global warming.” Axios. 22 Jan 2019.", "Allen, Myles. “Why protesters should be wary of ‘12 years to climate breakdown’ rhetoric.” The Conversation. 18 Apr 2019.", "Woodward, Calvin et. al. “AP FACT CHECK: O’Rourke on climate, Trump on ‘no collusion’.” Associated Press. 16 Mar 2019.", "IPCC, 2018: Summary for Policymakers. Global warming of 1.5°C. An IPCC Special Report on the impacts of global warming of 1.5°C above pre-industrial levels and related global greenhouse gas emission pathways, in the context of strengthening the global response to the threat of climate change, sustainable development, and efforts to eradicate poverty. World Meteorological Organization, Geneva, Switzerland.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]