["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Fiscal conservatives have dreamed of abolishing the Department of Education since President Jimmy Carter created it in 1980. Ronald Reagan ran that year against Carter, pledging to kill it. After he failed to follow through, leading Republicans sponsored legislation to do the job in 1995, arguing that states should oversee education policy. But they couldn't persuade enough of their colleagues to go along.", "For a budget hawk like Ron Paul, that failure is particularly galling, especially considering the GOP controlled the House from 1995 through 2006, the Senate for most of those years and the presidency starting in 2001. During that time, the Education Department has lived on — and enjoyed sizable budget increases.", "At a debate in Iowa on Dec. 12, 2007,\n\nDes Moines Register\n\neditor Carolyn Washburn gave Paul an opening to raise the issue: \"What's the biggest obstacle standing in the way of improving education in the United States? And how would you address it?\"", "The \"federal government,\" Paul said, adding that — to his dismay — \"It used to be the policy of the Republican Party to get rid of the Department of Education. We finally get in charge and a chance to do something so we double the size of the Department of Education.\"", "In fact, Paul understates the shift. The size of the Education Department nearly quadrupled between 1994 and 2006, increasing from $27-billion to $100-billion. Even when adjusting for inflation — the 1994 budget rises to $36.8-billion when calculated in 2006 dollars — the increase is huge: nearly triple (172 percent).", "Much of the increase came as a result of the 2001 education law known as the No Child Left Behind Act. In return for implementing a regimen of student testing and teacher accountability, states received an infusion of federal funds.", "We should point out that federal funding contributes a small portion to education funding for grades K-12. Even under the No Child law, states and localities contribute 83 percent of K-12 education funding. The federal contribution is 8 percent; private sources provide 9 percent, according to Education Department calculations.", "The $100-billion budget in 2006 was by far the largest ever, and something of an anomaly. It marked a substantial increase from the 2005 funding level of $71.5-billion. In 2007, the budget fell to $67.4-billion, a 75 percent increase over 1994 levels in inflation-adjusted terms — big but not quite double.", "The bump in 2006 was the result of a massive increase in mandatory spending related to student loan processing and to a one-time infusion of $4.3-billion to cover shortfalls in funding for grants to university students. Student loans make up the bulk of the mandatory spending, meaning that federal law compels the department to cover the cost of guaranteeing and directly making loans to students no matter how the cost fluctuates due to interest rates or the number of student applications. Most other programs — including No Child Left Behind funding — are considered discretionary, meaning the amounts get decided each year.", "But whether the spending is mandatory or discretionary, Paul, a libertarian who does not believe the federal government has a role to play in education policy, says it's better left to the states. Many of his Republican colleagues, as evidenced by the $73-billion increase in funding the Education Department enjoyed while they controlled Congress and the White House, apparently do not agree. Paul's statement, therefore, is True.", "The Chronicle of Higher Education, \"Congress Considers Abolishing the Education Department,\" by Jim Zook, July 7, 1995", "Interview with Jesse Benton, Ron Paul campaign spokesman, Dec. 16, 2007", "U.S. Department of Education,\n\nBudget History Tables", "U.S. Department of Education,\n\nFiscal 2007 Budget Summary and Background Information", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]