["About this rating", "A gunman killed nine people in Dayton, Ohio, in a mass shooting on Aug. 4, 2019. One of the victims, Logan Turner, quickly became the target of an online hoax.", "Turner had just turned 30 and was out with friends in the Oregon District, a nightlife spot in Dayton, when he and eight others fell victim to the second of two deadly mass shootings in a single weekend in the U.S. The Dayton massacre occurred the day after a mass shooting in El Paso, Texas, which claimed 22 lives.", "Shortly after the Ohio tragedy, a Facebook user going by the name \"Jerry Jerry\" posted a political message supportive of President Donald Trump while claiming to be Turner's brother. \"Jerry Jerry\" also launched a GoFundMe online crowdfunding campaign, which is no longer active.\n\nPer an obituary published by the funeral home handling Turner's memorial services, Turner is not survived by a brother or any family member by the name of \"Jerry.\"", "GoFundMe suspended the campaign launched by \"Jerry Jerry,\" citing the need for further information about the creator's connection to Turner's family. \"When a campaign is created, we work the campaign organizers to ensure the money is transferred to the right place,\" GoFundMe spokeswoman Meghan Scripture told us in an email.", "The \"Jerry Jerry\" Facebook page that created the post above is also no longer in use; Facebook did not respond to our questions about whether the platform took any action against the user.", "The questionable Facebook page and GoFundMe fundraiser got a signal boost when pro-Trump internet personality Jack Posobiec posted them to his Facebook page, stating that \"Jerry Jerry\" was a \"friend\" of his social media moderator. The posts on Posobiec's profile have since been deleted, but screenshots have continued to circulate.\n\nWhen reached for comment via Twitter, Posobiec acknowledged that his social media moderator, Meredith Wynne-Morton, had made a mistake by sharing the posts, and that \"Jerry Jerry\" was not her personal \"friend\" but just a Facebook profile she had accepted a friend request from. Posobiec sent us screenshots in which he informed his Facebook fans that Wynne-Morton \"takes full responsibility\" for \"being suckered.\"", "Posobiec has been a prominent figure in high-profile public misinformation campaigns in the past. He helped boost Pizzagate, a conspiracy theory holding that prominent Democratic figures like Hillary Clinton were operating a pedophile ring out of the basement of a Washington, D.C., pizza restaurant that doesn't have a basement. He also helped promote another discredited conspiracy theory that claimed it was Democratic National Committee staffer Seth Rich, and not Russian hackers, that leaked stolen emails from the DNC. U.S. intelligence agencies have concluded the DNC was hacked by the Russian government.", "U.S. federal authorities are investigating three mass shootings that took place in the span of one week. Three people were killed in a massacre at a garlic festival in Gilroy, California, on July 28, one week before 22 were slain in the rampage at a Walmart in El Paso (both of those incidents are being investigated as acts of domestic terror). Authorities are still investigating the motive for the Dayton attack.", "Filby, Max. \"Dayton Shooting Victims: Logan Turner Remembered as 'Smart and Sweet.'\"\r\n  Dayton Daily News. 4 August 2019.", "CBS News. \"Death Toll in El Paso Shooting Rises to 22 as Investigators Put Together Timeline of Accused Shooter's Movements.\"\r\n  5 August 2019.", "Fisher, Marc. \"Pizzagate: From Rumor, to Hashtag, to Gunfire in D.C.\"\r\n  The Washington Post. 6 December 2016.", "Lytvynenko, Jane. \"Pro-Trump Media Figure and Conspiracy Theory Peddler Jack Posobiec Is Out at The Rebel.\"\r\n  BuzzFeed News. 29 May 2017.", "Anderson Funeral Home. Obituary for Logan Michael Turner.", "Knight, Cameron and John Bacon. \"FBI Launches Investigation Into Dayton Shooter's Motive, 'Violent Ideologies.'\"\r\n  USA Today. 6 August 2019.", "Dobuzinskis, Alex. \"FBI Opens Domestic Terror Investigation Into Gilroy, Calif., Mass Shooting.\"\r\n  Reuters. 6 August 2019.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]