["The photo was shared in this Facebook post on June 25, 2016.", "Below is a screenshot of the misleading post:", "The Indonesian language caption translates to English as: “200,000 rupiah bills. They have been officially circulated. It is an obligation to share so people know..”.", "The same photo was shared here and here on Facebook with a similar claim.", "The claim is false; the photo shows gift vouchers issued by Polo Ralph Lauren Indonesia.", "Reverse image searches on Google and Yandex found the image actually shows gift vouchers issued by Polo Ralph Lauren Indonesia. A photo of the same vouchers can be seen in this listing on Indonesian marketplace Bukalapak.", "Below is a screenshot of the vouchers on Bukalapak, with the ‘Polo Ralph Lauren Indonesia’ name and logo circled in red:", "The same logo can be seen here on the Polo Ralph Lauren Indonesia website.", "Polo Ralph Lauren Indonesia told AFP on in an email on June 20, 2019, that the purported money in the misleading posts was actually company gift vouchers that were issued in February 2016.", "“The purported Rp 200,000 bills that are being talked about are actually discount vouchers to purchase our products within a specific period and at specific locations.", "“We made the design to look like the money generally used in Indonesia, but all the materials in the design DO NOT CONTAIN ANY ELEMENTS THAT HAVE THE COPYRIGHTS OF THE INDONESIAN NATIONAL BANKNOTES,” Polo Ralph Lauren Indonesia told AFP in a written statement.", "Below is an image comparing the photo in the misleading Facebook post (top) and Indonesian banknotes of various denominations as shown in the website of Bank Indonesia, the country’s central bank (bottom):", "The image in the misleading Facebook post has been circulating online at least since the first quarter of 2016. The Indonesian central bank, Bank Indonesia, tweeted on April 28, 2016, that the bank had not issued the vouchers seen in the misleading posts.", "1. Terkait informasi yg beredar mengenai uang pecahan Rp200.000, Bank Indonesia menyatakan bahwa informasi tersebut tidak benar", "Translated to English, the three first tweets of the Twitter thread read:\n\t“1. With regard to the information about the Rp 200,000 bill that has been circulating, Bank Indonesia states that the information is not true.", "“2. At the moment, the largest rupiah denomination 100,000 rupiah.", "“3. For any new bill issued, Bank Indonesia will release an official statement in the mass media and website bi.go.id.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]