["The video was published on Twitter here on January 14, 2020 by Tarek Fatah, a prominent Pakistani-Canadian author. The tweet, which has since been deleted, was liked more than 6,300 times and retweeted more than 2,600 times.", "The post’s caption reads: “Pakistani mother slams the door shut in the face of Polio workers. Screams at the two female volunteers: \"I will never ever allow my children to take these drops. Never never will my kids drink these drops. Never.\"\"", "Below is a screenshot of the misleading tweet:", "The video was viewed more than 200,000 times after it was shared on Facebook here, here and here; and on YouTube here and here with a similar claim.", "The claim is false; the video does not show a real-life incident. It shows a scene from 2018 Pakistani film Load Wedding. The full film was published on YouTube here on February 27, 2019.", "The video in the misleading posts shows a scene that corresponds with the full film from the 34-minute 26-second mark to the 35-minute 18-second mark.", "Below are screenshots comparing keyframes from the movie (L) and the misleading footage, which was filmed from a slightly different angle (R):", "The actress who played the vaccinator, Mehwish Hayat, also said the footage in the misleading posts shows a scene from her film.", "In a tweet replying to Fatah’s misleading Twitter post, Hayat stated: “Thank u for giving ur 2 cents on this but pls first verify the source b4 posting next time. It’s a scene frm my movie”loadwedding”,the polio worker is me & that woman an actress.Through the film we were raising awareness of the issue.Glad 2 see our performances were so convincing.”", "Thank u for giving ur 2 cents on this but pls first verify the source b4 posting next time. It’s a scene frm my movie”loadwedding”,the polio worker is me & that woman an actress.Through the film we were raising awareness of the issue.Glad 2 see our performances were so convincing https://t.co/ididoJJcxL", "Misinformation about the polio vaccine has circulated for years in Pakistan. AFP has previously debunked misleading claims about the vaccine here, here and here.", "Pakistan remains one of just three countries to have not totally eradicated the disease. The country recorded 136 cases of polio last year, a sharp increase from the 12 cases in 2018, according to Pakistani authorities and the World Health Organization, AFP reported here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]