["A screenshot from Erika Harold's campaign ad.", "Complaining about corruption and high property taxes is the low-hanging fruit of election politics in Illinois, and Republican attorney general candidate Erika Harold hits on both in a recent ad targeting her Democratic opponent, state Sen. Kwame Raoul of Chicago.", "The TV spot starts off with Harold stating, \"In Illinois, politicians have turned corruption into an art form.\"", "\"I’m Erika Harold and this scheme is one of the worst: Mike Madigan and Kwame Raoul team up to raise property taxes,\" she continues, as a picture of the Democratic House Speaker and Raoul flashes on-screen with text characterizing their collaboration as a \"scheme.\"", "\"In Chicago, Madigan’s business does property tax appeals for the powerful,\" she goes on to say. \"Higher taxes, higher profits. And Kwame Raoul? His top donor gets massive tax breaks from the county, while you get higher taxes. I’m Erika Harold. As attorney general, I’ll make the politicians pay for their corruption—not you.\"", "Harold’s ad contains a hodgepodge of accusations and innuendo, including that reference to Madigan’s property tax business to which Raoul has no connection. Yet it’s all framed around a central implication that Raoul and Madigan somehow participated in a corrupt \"scheme\" to line their pockets by hiking property taxes.", "That makes her statement about the two teaming up to raise property taxes much more provocative. So we decided to give it a closer look.", "Harold’s ad refers to a 2014 bill sponsored by Raoul in the Senate and Madigan in the House that sought to get two of Chicago’s ailing pension funds for city workers back on financial track.", "The measure was aimed at facilitating a plan of Mayor Rahm Emanuel’s to reduce a multibillion-dollar pension shortfall by cutting city worker retirement benefits and requiring both workers and the city to increase contributions into the municipal and laborers’ pension funds.", "Then-Gov. Pat Quinn, as well as lawmakers from both parties, quickly objected to language in the bill Quinn said would \"gouge\" city property owners. Within days, Raoul, Madigan and Emanuel pulled that language.", "The watered-down bill eventually passed and was signed into law by Quinn, though it was later struck down as unconstitutional by the Illinois Supreme Court.", "Harold campaign spokesman Aaron DeGroot acknowledged Raoul and Madigan carried the bill at Emanuel’s request and that they removed the property tax provision before its passage. Even so, DeGroot said the context was immaterial.", "\"The reason they all sought the property tax is irrelevant,\" DeGroot wrote in an email. \"We never claim property taxes were raised as a result of the legislation. We do say, though, that Raoul and Madigan endorsed a property tax increase. That is true. The additional context or final result does not make that fact any less true.\"", "Without that context, however, Harold’s accusations amount to cleverly misleading wordplay. By stating that Raoul and Madigan teamed up \"to\" raise property taxes, she erroneously implies that raising taxes was the proposal’s central aim.", "What’s more, among those speaking in favor of the bill on the day it passed in the House was the chamber’s Republican leader, Jim Durkin. \"Doing nothing is not an option,\" he said, later adding \"I don’t want to see the city of Chicago fall in line with Detroit.\"", "\"The sponsors were acting in response to the city’s request to change the state law,\" said Amanda Kass, associate director of the Government Finance Research Center at the University of Illinois-Chicago. \"Everybody recognized the city’s contributions were too low.\"", "There’s another reason context is critical in making sense of Harold’s property-tax claim: the on-screen text reiterating that Raoul and Madigan’s proposal was a \"scheme\" right after she’d called it \"one of the worst\" in the sordid history of public corruption in Illinois.", "Framing the bill that way suggests Raoul used his public office for personal gain. There is no evidence for such a claim, and Harold’s campaign did not attempt to support it when we asked for proof.", "Instead, DeGroot argued Raoul is complicit in what he described as Illinois’ \"inherently corrupt\" property tax system, contending he’s not only supported property tax increases but has also \"been silent on reform.\"", "As for the allegation about Raoul’s top donor benefitting from lucrative tax breaks, that was a reference to Neil Bluhm, chairman of Rivers Casino in Des Plaines as well as the finance chair of Raoul’s campaign.", "In making the charge, Harold’s ad cites a 2016 investigation by the Better Government Association that showed how Rivers had received lucrative property tax breaks after appeals filed with Cook County Assessor Joe Berrios.", "The article made no reference to Raoul, and DeGroot did not say the Democrat was involved with the Rivers tax break.", "\"We say Raoul’s top donor was the recipient of a million-dollar tax break,\" DeGroot wrote. \"Nothing more.\"", "Harold says \"Mike Madigan and Kwame Raoul team up to raise property taxes.\"", "Her statement contains an element of truth in that Raoul and Madigan did sponsor legislation in 2014 that initially contained a proposal from Emanuel for a new property tax levy for several ailing pension funds.", "But the tax component was not the primary aim of the bill, which also sought to shore up the funds by cutting city worker retirement benefits and requiring both workers and the city to put more money into them. That tax language didn’t even make it into the final version of the bill.", "Yet Harold’s claim spuriously suggests Raoul teamed up with Madigan for the express purpose of hiking taxes, leaving out all mitigating context. We rate it Mostly False.", "\"Emanuel, Madigan pension blitzkrieg stalls,\" Chicago Tribune, April 2, 2014", "Senate Bill 1922, Illinois General Assembly", "\"Chicago Revises Pension Overhaul to Sway Lawmakers,\" Bond Buyer, April 7, 2014", "\"Gov. Quinn signs partial Chicago pension overhaul,\" April 10, 2014", "\"Illinois Supreme Court ruling forces city to find new fix for 2 pension funds,\" Chicago Tribune, March 24, 2016", "Email interview: Aaron DeGroot, Harold spokesman, Sept. 12-13, 2018", "Legislative transcripts, Illinois General Assembly, April 4, 2014", "Phone interview: Amanda Kass, associate director of the Government Finance Research Center at the University of Illinois Chicago, Sept. 13, 2018", "\"Rivers Casino’s Jackpot: $1 Million Property Tax Break,\" Better Government Association, May 8, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]