["“All the reasons not to take an experimental mRNA injection never before used on humans,” reads the caption of a February 21, 2021 video that has been viewed more than 195,000 times on Instagram as of March 5, 2021.", "More than 878,000 Covid-19 cases and 22,000 deaths have been recorded in Canada. As of early March, almost four percent of Canadians have received at least one dose of vaccine against Covid-19.", "The video was posted by Chris Saccoccia, known on social media as Chris Sky. Saccoccia was charged in October 2020 with violating the Quarantine Act, which requires isolation after foreign travel. He has regularly participated in protests against anti-Covid measures in Ontario.", "In the video, he makes several false claims, which AFP examines below:", "Saccoccia claims: “The Canadian Covid vaccine is the only vaccine in history with mRNA technology. That’s not a vaccine, that’s artificial DNA they inject into your body to reprogram your own body’s DNA to produce so-called antibodies to the coronavirus. It’s never been used before in humans, it’s never passed animal trials because it killed all the animals.”", "Several Covid-19 vaccines are being administered or are in trials around the world. In December, the Pfizer-BioNTech shot using mRNA technology was authorized in Canada, followed by Moderna’s mRNA vaccine. Both are 94-95 percent effective.", "Although the Covid-19 vaccines are the first using the cutting-edge messenger ribonucleic acid (mRNA) technology to be authorized and distributed globally, research on using mRNA technology for vaccines started in the early 1990s and included promising tests on animals.", "“mRNA vaccines have elicited potent immunity against infectious disease targets in animal models of influenza virus, Zika virus, rabies virus and others, especially in recent years,” said an article published on January 12, 2018 on Nature’s website.", "Alison Thompson, associate professor at the Leslie Dan Faculty of Pharmacy with the University of Toronto, told AFP in an email that “while the Pfizer and Moderna vaccines are indeed the first successful mRNA vaccines, the technology has been used for decades.”", "Thompson also rejected the claim that the shots alter human genetic makeup, saying: “The technology does not reprogram our DNA.”", "An mRNA vaccine does not contain any protein from the virus itself, but rather the genetic instructions for the body to synthesize a viral protein so that the immune system learns how to defend itself.", "It differs from regular vaccines in that instead of confronting the immune system with part of a virus in a weakened or deactivated form to build antibodies, it introduces a “blueprint” of the spike protein, part of the virus that the body can then recognize and fight when confronted by it later.", "Kelly McNagny, a professor in the Department of Medical Genetics at the University of British Columbia, agreed that the claim is false.", "He added in an email that the product has been subjected to plenty of animal testing, “and it is indeed a vaccine. It is not reprogramming anything but merely generating an antibody and T cell response to a foreign protein as all vaccines do.”", "The mRNA Covid-19 vaccines have been shown to be safe and effective in clinical trials, according to Matthew Miller, associate professor with the Department of Biochemistry & Biomedical Science at McMaster University, who explained that “mRNA is the code for proteins. It does not alter the DNA of your cells. Indeed, your cells naturally make mRNA from DNA.”", "He said that “these vaccines have an excellent safety profile as demonstrated by Phase I through III clinical trials in humans.”", "University of Toronto’s Thompson added that “there are unprecedented resources” being spent internationally to monitor any potential concerns over safety and effectiveness of the vaccines.", "“Given the many millions of doses that have been given so far, we would know by now if there were serious safety issues. What remains to be seen is how effective these vaccines are in the long-term,” she said.", "More than 279 million doses of the Covid-19 vaccines have been administered around the world so far.", "AFP previously debunked a similar claim here.", "Saccoccia further claims: “They tell you you’re still contagious after you vaccinate so you’re going to have to still wear a mask. So you’re going to take a vaccine that makes you contagious to your friends and family when you otherwise weren’t?”", "Experts say that even if people get the shot they could still contract the disease and infect others, so the mask is a precaution against possible asymptomatic transmission, while also helping to protect the vaccine recipient until the body’s immune response kicks in.", "But McMaster University’s Miller said it is false to claim that vaccination makes you “more contagious than individuals who become infected but are not vaccinated.”", "Miller explained that, after vaccination, it takes about two weeks for a person to generate immunity that will protect against infection.", "“Thus, it is important to maintain public health precautions, like masking, especially in the first couple of weeks after a vaccine is administered,” Miller said.", "A Johns Hopkins University website answering frequently asked questions about vaccines states that masks still need to be worn and physical distancing practiced even after inoculation.", "“The vaccine is not 100 percent effective and we still do not know if someone who was vaccinated can develop asymptomatic infection and transmit the virus,” Johns Hopkins says.", "University of British Columbia’s McNagny confirmed that the recommendation to continue wearing a mask is in part “to ensure that you have had time to generate a protective response to the vaccine.”", "Calling the claim that the Covid-19 vaccine will make you contagious “totally false,” he said that it “will definitely not make you more contagious and will likely make you far less contagious if you should happen to have an exposure to the virus.”", "Studies are ongoing to confirm whether Covid-19 vaccines reduce transmission, but experts caution that these are more difficult to conduct than research that only addresses whether the vaccine protects against infection.", "Saccoccia references the US Centers for Disease Control and Prevention’s Vaccine Adverse Event Reporting System (VAERS) to claim: “As of February 12, the CDC reporting thing called VAERS... had over 1869 hospitilizations and 921 deaths associated with the Covid vaccine so far in the United States alone.”", "The VAERS website accepts reports on a largely voluntary basis from health care providers, vaccine manufacturers and the public. It says the reports may contain inaccurate or incomplete information and “alone cannot be used to determine if a vaccine caused or contributed to an adverse event or illness.”", "Contacted by AFP for a previous investigation, CDC spokesman Curtis Gill said: “VAERS does not determine if reports of death were caused by Covid-19 vaccine.”", "Some of the “adverse events” reported could be true adverse reactions to the vaccine, while others might be coincidental and not linked to getting the shot, Gill noted.", "The CDC says on its website that “to date, VAERS has not detected patterns in cause of death that would indicate a safety problem with Covid-19 vaccines.”", "Roderick Slavcev, associate professor at the University of Waterloo’s School of Pharmacy, said that when you track millions of vaccinated individuals, deaths are inevitable. But he agreed with the CDC conclusion that “these deaths have in no way indicated a pattern or safety concern linked to vaccine administration.”", "No vaccine is 100 percent safe and effective, said Thompson of the University of Toronto, who added that the Covid-19 shots seem to be as reliable as most other vaccines.", "“And most certainly the health risk from Covid-19 is much greater than it is from any vaccine currently approved for use,” Thompson said.", "Since the beginning of the pandemic, AFP Fact Check has debunked numerous inaccurate claims about the coronavirus, which causes Covid-19, here.", "The pandemic has killed more than 2.5 million people around the globe.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]