["Old photos circulating online are being used out of context to claim that Democratic presidential nominee Joe Biden and Michigan Gov. Gretchen Whitmer were recently seen ignoring public health guidance.", "“Apparently these pictures were taken at the DAC last night. I see Whitmer in the background. No mask wearing and no social distancing. So whats going on here? Didn’t the Governor mandate mask wearing in public at all times and staying 6ft apart?” reads a Sept. 10 Facebook post that has been shared over 5,000 times.", "Other users posted similar versions of the claim, sharing a screenshot of the same photo with the caption, “While OUR children are being mandated to wear a mask while playing outdoor sports these hypocrites are at the Detroit Athletic Club maskless!”", "USA TODAY reached out to both users for comment.", "The photo was initially shared on Sept. 9 to Instagram by Dennis Archer Jr., son of a former Detroit Mayor Dennis Archer.", "\"It was good to catch up with dear friend @joebiden and @vdarcher earlier this year (pre Covid) #letsgo #2020,\" Archer wrote.", "Fact check:False claim that Trump wearing neural stimulator device in resurfaced photo from 2016", "The photos being shared are authentic, however, they are not current. They are from a fundraising event that took place before a campaign rally on March 9 at the Detroit Athletic Club.", "“Before the rally, Biden attended a $1,000-per-person fundraiser at the Detroit Athletic Club, hosted by some of Michigan's biggest political names: former Gov. Jim Blanchard, Detroit Mayor Mike Duggan and Detroit businessman Dennis Archer Jr.,” the Detroit Free Press reported.", "The Detroit Athletic Club took to Facebook to clear up the misinformation.", "“There is a photo circulating showing an event at the DAC. The photo is from a private event prior to the shutdown in March,” reads a Sept. 11 Facebook post. “There have not been events of more than 10 people inside the DAC since reopening and we continue to follow and enforce all social distancing and mask rules.”", "Shortly after Archer posted the photo, he noted in his comment section that the photo is a \"pre-Covid shot, in support of the Vice President.\"", "Fact check: Biden has his own climate change plan", "On March 9, masks were only recommended for people who had COVID-19 symptoms, health workers and caretakers, according to a web archive from the Centers for Disease Control and Prevention.", "\"We really do not think this is the time for Americans to be going out and getting masks.  Masks are really important for those at highest risk in the health care setting and we want to make sure that we save enough masks for our health care workers on the front lines who will need to continue to be able to do their work and take care of all of us,\" Nancy Messonnier, director of the National Center for Immunization and Respiratory Diseases at the CDC, told reporters in a call on March 10.", "On Sept. 9, the date users claim Biden and Whitmer were seen maskless, Biden is seen in a video from C-SPAN wearing a face-covering as he meets with T-shirt vendors in Michigan.", "A photo from the Associated Press on Sept. 9 also shows Biden wearing a mask as he spoke with steelworkers in a backyard of a home in Detroit.", "Whitmer has also since been seen wearing a face covering and recently denounced the Michigan Supreme Court's decision that ruled she did not have authority to extend COVID-19 executive orders, according to the Detroit Free Press.", "A similar claim using out-of-context photos from a campaign rally in March of Biden, Whitmer and others appeared in August and was debunked by USA TODAY.", "PSA: Get these in your inbox: We're fact checking the news and sending it to your inbox. Sign up to get that here.", "We rate this claim as FALSE, based on our research. The photos of Biden and Whitmer not wearing masks are genuine, however, they were taken at a fundraising event on March 9, before masks were recommended by public health officials, not in September. Both have since been seen wearing a mask in public.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]