["Democrats have ripped apart the GOP plan to replace the Affordable Care Act, arguing that it will take away insurance from millions of Americans.", "Kathleen Sebelius defended President Barack Obama’s health care law, which she helped implement, in a March 12 interview on Meet the Press. The former head of Health and Human Services pointed to the experience of one of the main insurers in Florida, Blue Cross Blue Shield, which is headed by CEO Pat Geraghty, as a success story.", "\"Florida has not been a welcoming state to this law. Pat Geraghty ended up 2016 open enrollment with 1 million members in the Florida marketplace and as a company in the black. He said, ‘Of course this works. We can make it work. We can go forward.’ \"", "We decided to fact-check Sebelius’ claim about the number of Floridians who enrolled through the federal health care law in spite of Republican efforts against it, including from Gov. Rick Scott, who campaigned on a promise to repeal it.", "Florida Blue enrollment", "Blue Cross Blue Shield operates under the name Florida Blue in the Sunshine State.", "The insurer’s enrollment rose in recent years through the Affordable Care Act, said Paul Kluding, a company spokesman.", "At the end of the open enrollment season on Jan. 31, 2017, Florida Blue had 940,000 ACA members -- an increase from 715,000 in 2016. Florida Blue anticipated an increase because some other insurers, such as UnitedHealthCare and Aetna, exited the marketplace where consumers can shop for policies.", "\"The number fluctuates throughout the year, but historically the enrollment numbers actually increase within the few months following the open enrollment close date, so that number will probably rise slightly over the next couple of months,\" Kluding said.", "Florida Blue sells plans in all Florida counties and is the largest insurer participating in the federal marketplace in Florida.", "With all insurers combined, about 1.7 million Floridians enrolled through the federal health care law for 2017. So Florida Blue is the largest insurer on the marketplace.", "Sebelius and Geraghty both attended an annual health care conference at the University of Miami on March 3. At the conference, Kluding said, Geraghty told Sebelius \"that the company is now serving approximately 1 million individual members, and that Florida Blue has operated this ACA business profitably.\"", "Florida Blue made a small profit in the ACA market -- a single-digit positive margin, Kluding said.", "Sebelius’ number about Florida Blue enrollment was close to the actual figure. But she is cherry-picking an example of an insurer that had success in a particular state.", "Michael Tanner, a health policy expert at the libertarian Cato Institute, said that there are vast differences in how insurers fared in various states.", "While Florida Blue may have done well, it’s counterpart in North Carolina \"did terribly,\" he said.", "In North Carolina, Blue Cross lost $405 million on medical expenses for ACA customers in 2014 and 2015 but stayed in the marketplace for 2017.", "The majority of Blue Cross insurers in the states are non-profits, making comparisons to other providers difficult.", "\"It's a little bit apples and oranges to compare Blues to other insurers -- they have a special non- profit status, and they are not taxed the same way. They have the largest market shares and historically being the insurer of last resort, their pool didn’t change as radically as a lot of other insurance companies did,\" Tanner said.", "While Florida Blue has seen rising enrollment, some other insurers have scaled back offering plans on the exchange in Florida or have exited the market entirely. (Half of the insurers doing business in Florida offer plans on the exchange.)", "UnitedHealthCare and Aetna exited the individual market, although Aetna is still writing off-exchange plans, said Amy Bogner, a spokeswoman for the Florida Office of Insurance Regulation. Humana withdrew from 31 of the 38 counties in the individual market in Florida and canceled all off-exchange business.", "In August, Aetna CEO Mark Bertolini blamed a pre-tax loss of more than $430 million since January 2014 for the decision.", "Our ruling", "Sebelius said Blue Cross Blue Shield ended \"2016 open enrollment with 1 million members in the Florida marketplace.\"", "Her number is close. Florida Blue said 940,000 people enrolled as of Jan. 31, and the insurer expects the number to rise. It's also important to note that some other insurers have scaled back or dropped out of offering plans on the exchange.", "We rate this statement Mostly True.", "Florida Health Insurance Market Report, Oct 2016", "Florida Office of Insurance Regulation, Individual PPACA Market Monthly Premiums for Plan Year 2017", "Florida Blue CEO Pat Geraghty op-ed, \"Continue to close Americans' gap in health insurance,\" Dec. 5, 2017", "University of Miami School of Business Administration, Election Impact on Health Care Sectors, March 3, 2017", "University of Miami School of Business Administration, \"The Business of Health Care: Going Global - Keynote Speaker: Patrick Geraghty,\" March 2016", "Sun Sentinel, \"Billing, enrollment problems still plaguing Florida Blue customers,\" Feb. 16,. 2017", "PolitiFact, \"7 takeaways from the GOP health care plan to replace Obamacare,\" March 7, 2017", "PolitiFact, \"Donald Trump: One-third of counties have only one insurer on Affordable Care Act exchanges,\" March 13, 2017", "Interview, Paul Kluding, Florida Blue spokesman, March 14, 2017", "Interview, Michael Tanner, Cato Institute senior fellow, March 14, 2017", "Interview, Amy Bogner, Florida Office of Insurance Regulation spokeswoman March 14, 2017", "Interview, Brad Kemp, Sebelius Resources Chief Operating Officer, March 14, 2017", "Interview, Audrey S. Brown, Florida Association of Health Plans, Inc. CEO, March 14, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]