["About this rating", "On 14 December 2016, the Facebook page \"Deplorables Inc.\" posted a video which they claimed showed \"Muslim migrants\" destroying a Christmas tree in Italy:", "Reports at that time did not identify the religious views of any of the vandals, writing only that the group consisted of about a dozen boys in hoodies. Napoli Repubblica reported that the boys were attempting to steal the tree in what has become a \"sad Christmas tradition.\"", "In past years, the tree was used for bonfires nearby:", "The band, made up of a dozen boys, hooded probably not to be identified by the surveillance cameras, went into action at one o'clock last night. In less than five minutes they stripped the tree of lights and the star to make it lighter and can pull down more easily. Once the tree came down, the 'commando' was going to drag it out of the tunnel where the use of two soldiers on duty in the vicinity has put to flight the young.", "In the past it happened many times that the tree was stolen only to be found in the neighboring Spanish Quarter where it is cut into pieces and used for the feast of St. Anthony Abbot, when there is the custom of lighting bonfires (the so-called stones of St. Anthony).", "We found no reports of anybody being identified or arrested for the incident. The contemporary articles we did find made no mention of religious motivations and merely identified the vandals as young pranksters.", "This is not the only video to circulate in late 2016 alongside the false claim that it showed Muslims tearing down a Christmas tree. Similar hoaxes appeared in November about Muslims tearing down a Christmas tree in Egypt.", "Matthews, Jeff.   \"The Wishing Tree.\"\r\n    Naples: Life, Death And Miracles.   December 2002.", "Napoli.repubblica.it.   \"Napoli, assalto all'albero di Natale in Galleria Umberto. L'esercito sventa il furto.\"\r\n    7 December 2015.", "Loiacono, Francesco.   \"Napoli, vandali distruggono l’Albero di Natale nella Galleria Umberto I (VIDEO).\"\r\n    Napoli.it.   7 December 2015.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]