["The image was published here on Facebook on July 6, 2020. It has been shared more than 280 times. It shows a group of soldiers sitting in an inflatable raft.", "The photo was published in a Facebook group that supports Taiwanese opposition political party Kuomintang. The group has almost 50,000 members.", "The traditional Chinese-language caption translates as: “Lives were lost during a military drill in the sea / wow / switching to troop inspection at a swimming pool? Ms Tsai [Ing-wen] is stupid”.", "The claim circulated online just days after a boat capsized during a military exercise off the coast of Kaohsiung in southern Taiwan on July 3, 2020. At least two soldiers were killed in the accident, Taiwanese newspapers Taiwan News and Taipei Times reported here and here.", "The image was also shared on Facebook here, here and here alongside a similar claim.", "The image, however, has been shared in a misleading context.", "A reverse image search on Google found this September 9, 2016, video published on YouTube by Taiwanese broadcaster CTV.", "A similar scene, captured from a different angle, can be seen at around the two-minute 22-second mark of the CTV video.", "Below is a screenshot comparison between the image in the misleading post (L) and the CTV video at its two-minute 20-second mark (R) with similar features circled in red by AFP:", "The headline of the CTV video translates to English as: “President Tsai Ing-wen travelled to Kinmen Islands for the first time to visit the army / Sea Dragon Frogman showed off their skills │CTV News 20160910”.", "The caption of the video states in part: “It is mid-autumn festival next week, so this morning President Tsai Ing-wen took the opportunity to visit and thank the Army 101st Amphibious Reconnaissance Battalion, most commonly known as the Sea Dragon Frogman of the Republic of China.”", "Tsai’s visit to the army was also reported by Taiwanese broadcaster CTS here in September 2016.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]