["• The video shows real clips of Dr. Anthony Fauci, but misleading voiceovers have been added.", "• Some confusion stems from Fauci’s distinction between the disease, COVID-19, and the SARS-CoV-2 virus, which causes the disease.", "• Research shows that the COVID-19 vaccines are effective at protecting people from getting the disease, but it is still unclear whether or not the vaccines will prevent people from becoming infected with the SARS-CoV-2 virus and transmitting it to others.", "Social media users are claiming that a viral video posted on Instagram shows Dr. Anthony Fauci saying that vaccines don’t protect people from COVID-19.", "The video — which was edited to add voiceover commentary — shows CNN’s Chris Cuomo interviewing Fauci, the director of the National Institute of Allergies and Infectious Diseases.", "The interview occurred on Dec. 10, after a panel of experts recommended the authorization of Pfizer’s COVID-19 vaccine. Cuomo asked Fauci to explain why people would still need to wear masks after they were vaccinated against COVID-19. The Instagram post excerpts a clip from the conversation:", "\"Just because you’re protected,\" Fauci is seen saying in the post, \"so-called protected by the vaccine, you still need to remember that you could be prevented from getting clinical disease and still have the virus that is in your nasopharynx, because you can get infected. We’re not sure, at this point, that the vaccine prevents you against getting infected.\"", "At that point in the Instagram video, a voice cuts in to emphasize what it appears Fauci is saying:", "Voiceover: \"We’re not sure at this point that the vaccine prevents you against getting infected.\"", "Fauci: \"We know for sure it’s very, very good, 94, 95%, in protecting you against clinically recognizable disease.\"", "Voiceover: \"Clinically recognizable disease? But not COVID?\"", "Fauci: \"And almost 100% at protecting you for severe disease.\"", "Voiceover: \"And almost 100% from severe disease? Well then what does he call covid if that’s not serious?\"", "The video has been viewed more than 380,000 times on Instagram. The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Fauci was being very scientifically precise with his words, but there was nothing nefarious behind his statement.", "According to CNN’s transcript, Fauci’s full response to Cuomo’s question about the continued need to wear masks was:", "\"Well, the answer is unless you get the overwhelming majority of the country vaccinated, and protected, and get that umbrella of what we call herd immunity, there's still a lot of virus out there.", "\"So just because you're protected, so-called protected, by the vaccine, you should need to remember that you could be prevented from getting clinical disease, and still have the virus that is in your nasopharynx because you could get infected.", "\"We're not sure, at this point, that the vaccine protects you against getting infected. We know for sure it's very, very good, 94%, 95% in protecting you against clinically recognizable disease, and almost 100% in protecting you for severe disease.", "\"But until you have virus that is so low in society, we, as a nation, need to continue, to wear the mask, to keep the physical distance, to avoid crowds. We're not through with this just because we're starting a vaccine program.", "\"Even though you, as an individual, might have gotten vaccinated, it is not over by any means. We still have a long way to go, and we've got to get as many people as possible vaccinated, of all groups.\"", "When Fauci said this in December, research on the COVID-19 vaccines showed that the vaccines prevent people from developing the disease COVID-19. But research was — and is — still underway to determine whether or not the vaccines stop people from being infected with the virus and transmitting it to others.", "The confusion about Fauci’s statements stems from the distinction between the disease caused by the virus and the virus itself.", "COVID-19 is the World Health Organization’s official name for the coronavirus disease. Severe acute respiratory syndrome coronavirus 2, or SARS-CoV-2, is the WHO’s official name for the virus that causes COVID-19. Both names have been used when discussing the pandemic since they were announced in February 2020.", "Help shape our fact-checking! Take PolitiFact’s reader survey now >>", "In recent months, the U.S. Food and Drug Administration has issued emergency use authorization for three vaccines that, in the FDA’s own words, are \"for the prevention of coronavirus disease 2019 (COVID-19) caused by severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2).\"", "First on Dec. 11, just days after this Fauci interview, the FDA cleared the Pfizer vaccine for distribution and use in the U.S. On Dec. 18, the FDA cleared the Moderna vaccine for distribution and use. Finally, the Johnson & Johnson vaccine became the third vaccine cleared for distribution and use in the U.S. on Feb. 27.", "The CDC reports that after two doses, the Pfizer vaccine is 95% effective \"in preventing COVID-19\" and the Moderna vaccine is 94.1% effective.", "The one-dose Johnson & Johnson vaccine, which was tested \"during a more complicated phase of the pandemic\" when variants had emerged, is also effective at preventing COVID-19, according to the Washington Post.", "\"It was more than 80% effective at preventing severe illness, including in areas of the world where concerning variants are circulating, but only 66% protective overall when moderate cases were included,\" the story said.", "It is important to note, however, that further research is needed to determine if any of the vaccines in use prevent people from being infected with the virus, therefore slowing transmission.", "Many vaccines do not prevent against infection or transmission, but they do keep people from getting seriously ill and having to go to the hospital.", "\"In general, most vaccines do not completely prevent infection but do prevent the infection from spreading within the body and from causing disease,\" reads a Johns Hopkins FAQ about vaccines. \"Many vaccines can also prevent transmission, potentially leading to herd protection whereby unvaccinated people are protected from infection by the vaccinated people around them because they have less chance of exposure to the virus.\"", "Some preliminary research indicates the COVID-19 vaccines have some ability to reduce infection and transmission, but real world research into this complex topic is still underway.", "\"We are still learning whether or not the current Covid-19 vaccines prevent transmission of SARS-CoV-2,\" the Johns Hopkins FAQ continues. \"It is likely they reduce the risk of virus transmission but probably not completely in everyone.\"", "This means vaccinated people might not develop the \"clinically recognizable\" COVID-19 disease Fauci was referring to, but they could become infected with the virus and spread it if they do not continue to wear masks and avoid crowds, for example.", "A viral video suggests that Fauci said vaccines don't protect against COVID-19. In reality, Fauci was making a distinction between contracting the disease COVID-19 and becoming infected with the virus that causes COVID-19.", "While research shows that the vaccines authorized for use are effective at protecting people from COVID-19, it is still unclear whether or not the vaccines will prevent people from becoming infected with the SARS-CoV-2 virus.", "We rate this claim False.", "Instagram post, March 4, 2021", "FactCheck.org, \"Video Misinterprets Fauci’s Comments on COVID-19 Vaccine,\" Jan. 26, 2021", "Associated Press, \"Video misrepresents Fauci’s comments on vaccine effectiveness,\" March 5, 2021", "U.S. Centers for Disease Control and Prevention, \"Frequently Asked Questions about COVID-19 Vaccination,\" accessed March 7, 2021", "U.S. Centers for Disease Control and Prevention, \"COVID-19 Frequently Asked Questions,\" accessed March 7, 2021", "World Health Organization, \"Naming the coronavirus disease (COVID-19) and the virus that causes it,\" accessed March 7, 2021", "U.S. Centers for Disease Control and Prevention, \"Pfizer-BioNTech COVID-19 Vaccine Questions,\" accessed March 7, 2021", "U.S. Centers for Disease Control and Prevention, \"Moderna COVID-19 Vaccine Questions,\" accessed March 7, 2021", "U.S. Centers for Disease Control and Prevention, \"Janssen COVID-19 Vaccine (Johnson & Johnson) Questions,\" accessed March 7, 2021", "BBC Future, \"Can you still transmit Covid-19 after vaccination?\" Feb. 3, 2021", "Nature, \"Can COVID vaccines stop transmission? Scientists race to find answers\" Feb. 19, 2021", "CNN Cuomo Prime Time transcript, \"Aired December 10, 2020 - 21:00 ET,\" accessed March 7, 2021", "U.S. Food and Drug Administration, \"Pfizer-BioNTech COVID-19 Vaccine,\" accessed March 7, 2021", "U.S. Food and Drug Administration, \"Moderna COVID-19 Vaccine,\" accessed March 7, 2021", "U.S. Food and Drug Administration, \"Janssen COVID-19 Vaccine,\" accessed March 7, 2021", "Washington Post, \"FDA review confirms safety, efficacy of single-shot Johnson & Johnson coronavirus vaccine, especially against severe cases,\" Feb. 24, 2021", "National Center for Biotechnology Information, \"Pathogen transmission from vaccinated hosts can cause dose-dependent reduction in virulence,\" March 18, 2020", "Johns Hopkins University & Medicine, \"Vaccines FAQ,\" accessed March 7, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]