["About this rating", "In November 2020, Ticketmaster proposed new safety measures that would help facilitate the reopening of live events. Event organizers would be responsible for choosing which protocols to implement, among them requiring proof of a negative COVID-19 test.", "Under the proposal, Ticketmaster itself would not require event attendees to provide test results or proof of vaccination.", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "Ticketmaster is making plans for a post-pandemic world that once again involves concerts, sporting events, and large gatherings of people — but these congregations may have a different look to them.", "That’s because in November 2020, the world’s largest ticketing marketer announced a future plan that might require event attendees \"to verify that they have already been vaccinated (which would provide approximately one year of COVID-19 protection) or test negative for coronavirus approximately 24 to 72 hours prior to the concert,\" according to an exclusive interview published in Billboard.", "But there are important caveats to note about this proposed policy that has been widely and incorrectly reported, according to Ticketmaster. Namely, requiring proof of vaccination or negative COVID-19 test is a suggestion being floated around to event organizers and not a mandate from Ticketmaster.", "Snopes contacted the entertainment company and was directed to an FAQ page that described current COVID screening requirements.", "“We have noticed there has been some misreporting around safety protocols. To clarify, there is absolutely no requirement from Ticketmaster mandating vaccines/testing,” wrote Ticketmaster.", "“In short, we are not forcing anyone to do anything. Just exploring the ability to enhance our existing digital ticket capabilities to offer solutions for event organizers that could include testing and vaccine information with 3rd party health providers. Just a tool in the box for those that may want to use.”", "In widely circulated news articles (see examples here, here, and here), some publications reported that the three-part phase would require that concert attendees receive a negative COVID-19 test within a 72-hour window, as well as require that attendees verify they had received a COVID-19 vaccination, once one is available.", "The plan, which was reportedly still in development, would use a combination of Ticketmaster's digital ticketing app and a third-party health information company to verify testing and vaccination data from qualified healthcare providers, such as Labcorp and the CVS Minute Clinic.", "But the ticketing service said in a Nov. 12 statement that there is “absolutely no requirement from Ticketmaster mandating vaccines/testing for future events.”", "Ticketmaster does not have the power to set policies around safety or entry requirements — both of which would be up to the discretion of the event organizer based on preference and local health guidelines. Ticketmaster said that it is currently exploring a number of safety features for event organizers to use, including social distanced seating, contactless entry, and a variety of other measures introduced in its SmartEvent policy — but the decision of what features to employ will ultimately be held in the hands of the event organizers.", "SmartEvent technology is a proposed policy to help event organizers adapt to COVID-19 safety measures. Image courtesy of Ticketmaster.", "Ticketmaster went on to say the following:", "We are trying to prepare for potential possibilities in the future. It has become more common for people to take a COVID test before activities like traveling and seeing loved ones. If this is something that event organizers or venues choose to ask fans to do in the future (either for their own preferences or due to local health requirements), we want to be prepared.", "One idea to keep the event entry process as simple and convenient as possible is to find a way for fans to link their digital ticket to their negative test results, vaccine status, health declaration or any other info that is determined to greenlight access. This would allow fans to enter an event with one scan of their ticket, rather than entering and then having to wait in another line to show their health verification.", "While we have no control whether or not these factors will come into play in the future, if there’s one thing we’ve learned, it’s to prep for as many scenarios as possible.", "But at the time of writing, these measures are ideas and have not been implemented. If event organizers wish to at some point incorporate personal healthcare data into its event planning protocols, Ticketmaster said that all health information would have to be legally stored in a healthcare provider with HIPPA-compliance.", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]