["About this rating", "On 13 September 2017, YourNewsWire.com posted a story regarding a state legislative bill in California that contradicted itself within the first two paragraphs:", "California Governor Jerry Brown is expected to give a green light to a bill allowing HIV positive people to knowingly expose their blood to others.", "The bill, SB 239, will reduce the penalties for knowingly exposing someone to HIV without telling them, allowing HIV positive people to donate their blood to others. Lawmakers claim the current felony charge for the crime is 'discriminatory.'", "The measure, which was approved by the state Senate on 11 September 2017, does indeed reduce the penalties for HIV-positive people who knowingly expose others to the virus or donate blood. But as the state legislature's website stated, doing so is still illegal:", "The bill would instead make the intentional transmission of an infectious or communicable disease, as defined, a misdemeanor punishable by imprisonment in a county jail for not more than 6 months if certain circumstances apply, including that the defendant knows he or she or a 3rd party is afflicted with the disease, that the defendant acts with the specific intent to transmit or cause an afflicted 3rd party to transmit the disease to another person, that the defendant or the afflicted 3rd party engages in conduct that poses a substantial risk of transmission, as defined, that the defendant or the afflicted 3rd party transmits the disease to the other person, and if the exposure occurs through interaction with the defendant and not a 3rd party, that the person exposed to the disease during voluntary interaction with the defendant did not know that the defendant was afflicted with the disease.", "The bill would also make it a misdemeanor to attempt to intentionally transmit an infectious and communicable disease, as specified, punishable by imprisonment in a county jail for not more than 90 days. This bill would make willful exposure to an infectious or communicable disease, as defined, a misdemeanor punishable by imprisonment in a county jail for not more than 6 months, and would prohibit a health officer, or a health officer’s designee, from issuing a maximum of 2 instructions to a defendant that would result in a violation of this provision. The bill would impose various requirements upon the court in order to prevent the public disclosure of the identifying characteristics, as defined, of the complaining witness and the defendant. By creating new crimes, the bill would impose a state-mandated local program.", "Brown signed the bill into law on 6 October 2017. Before then, knowingly exposing a person to the virus via sexual contact was a felony punishable by either three, five, or eight years in prison. It was also a felony for an HIV-positive person to knowingly \"donate blood, tissue, or, under specified circumstances, semen or breast milk.\"", "Democratic state Sen. Scott Wiener, who introduced the bill, told us in an e-mail on 18 September 2017:", "Sexual assault will remain a felony, regardless of HIV status. So if someone with HIV sexually assaults someone, that will be continue to be a felony. In addition, SB 239 does not repeal the HIV-related sentencing enhancement for sexual assaults.", "The goal of the bill, Wiener said, was to end HIV infections:", "SB 239 will make it more likely that people will get tested for HIV and seek treatment, by removing stigma. Criminalizing health conditions harms public health. Criminalizing HIV makes it less likely people will get tested. If an HIV infection occurs, we need to make sure that people have access to healthcare.", "The bill passed in the state Senate by a margin of 24-12 (with four lawmakers abstaining) four days after the state assembly approved it in a 52-19 vote (with eight members abstaining). One of the bill's critics, Republican Sen. Joel Anderson said:", "I'm of the mind that if you purposefully inflict another with a disease that alters their lifestyle the rest of their life, puts them on a regiment of medications to maintain any kind of normalcy, it should be a felony. It's absolutely crazy to me that we should go light on this.", "However, a 28 June 2017 editorial by two Alameda County Public Health Department officials argued that intentional exposure to the virus is rare. J. Phoenix Smith (interim head of the department's HIV care unit) and Nicholas J. Moss (director of its HIV STD Section) wrote:", "Of note, a careful examination of hundreds cases revealed only two cases of actual intentional HIV transmission — nationwide, over more than 30 years.", "Wiener and the bill's sponsor in the Assembly, Democratic lawmaker Todd Gloria, said in a statement that the bill is supported by several LGBTQ and HIV-related advocacy groups, including the Center for HIV Law & Policy, the National Alliance of State and Territorial AIDS Directors, and the San Francisco AIDS Foundation among others.", "But another HIV activist, Deondre B. Moore, said in a March 2017 post for the group HIV Equal that the bill should be revised. In his piece, Moore reveals that a partner infected him with the virus after lying to him about testing negative. While he does not feel having HIV is a \"death sentence,\" he said, his peace of mind was stolen by his former partner's behavior:", "No one deserves a pass. It’s one thing to be positive and be in control of your health by engaging in care and maintaining an undetectable viral load. It’s another thing to just not care and intentionally aim to infect others with HIV. Something should be done and justice should always be served. I believe that SB 239 should be revised to note that, a person with a proven undetectable viral load should not be penalized or have to face consequences for having unprotected sex and not disclosing their status. However, a person who is positive and is proven to be intentionally infecting or aiming to infect others should face felony charges and brought to justice.", "When asked for a response to Moore's remarks, Wiener told us:", "Mr. Moore's view are highly out of step with the overwhelming view in the HIV advocacy community. SB 239 is supported by a massive public health coalition, including almost every HIV advocacy organization, including the Black Coalition on AIDS, Positive Women’s Network, APLA Health, the San Francisco AIDS Foundation and many others.", "McGreevey, Patrick. \"California Lawmakers Vote to Reduce Penalty for Knowingly Exposing Sexual Partners to HIV.\"\r\nLos Angeles Times. 11 September 2017.", "Moore, Deondre B. \"California SB 239: My Take on HIV Transmission Penalties.\"\r\nHIV Equal. 21 March 2017.", "McGreevey, Patrick.  \"Knowingly Exposing Others to HIV Will No Longer Be a Felony In California.\"\r\nLos Angeles Times.  6 October 2017.", "Update [11 October 2017]: Updated to note that Gov. Jerry Brown signed the bill into law on 6 October 2017.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]