["About this rating", "A frequent political talking point — when issues of tax law and corporate governance are concerned — is the lack of income taxes Amazon pays to the federal government. In 2018, Snopes rated “True” the claim that the online retailer had paid no such taxes in the 2017 tax year. Readers raised the same question for the 2018 tax year, and once again our rating is \"True.\"", "Though Amazon’s actual U.S. tax filings are not public, a broad overview of their overall tax burden can be found in their SEC 10-K filing. In 2018, the company made over $200 billion in sales, but paid no money to the U.S. government in the form of income tax (in fact, the government actually owed the company some $129 million as noted in parentheses in the chart below):", "However, the company did pay taxes abroad and at the state level: \"Amazon pays all the taxes we are required to pay in the U.S. and every country where we operate, including paying $2.6 billion in corporate tax and reporting $3.4 billion in tax expense over the last three years,\" an Amazon spokesperson told Yahoo Finance in February 2019.", "As we discussed in our previous Amazon tax fact check, the methods employed to make that extremely reduced tax burden a reality are only vaguely described by the company, but the process involves taking as many tax credits as possible under the law. \"We have tax benefits relating to excess stock-based compensation deductions and accelerated depreciation deductions that are being utilized to reduce our U.S. taxable income,\" the company wrote in their SEC filing.", "Stock-based compensation refers to the fact that publicly traded corporations, like Amazon, can list the stock options they grant to employees as a business cost in their accounting, and if an option-receiving employee makes over $1 million a year in salary, the profits from the sale of those stocks can then be counted as a federal income tax deduction for the corporation.", "With respect to the other tax credits or deductions? \"It’s hard to know exactly what they’re doing,\" Steve Wamhoff, director of federal tax policy for the non-partisan Institute for Taxation and Economic Policy, told Yahoo. \"Their public documents ... don’t lay out their tax strategy. So it’s unclear exactly which breaks [Amazon is taking advantage of].\"", "Regardless, it is factually true that Amazon paid nothing in federal income tax in 2018.", "United States Securities and Exchange Commission.   “Amazon.com, Inc. 10-K”\r\n    2018.", "Myers, Kristin.   “Amazon Will Pay $0 in Taxes on $11,200,000,000 in Profit for 2018.”\r\n    Yahoo Finance.   16 February 2019.", "Banerji, Gunjan.   “Potential Loser in Tax Overhaul: Executive Stock Options.”\r\n    The Wall Street Journal.   19 December 2017.", "Correction [20 November 2019]: An earlier version misstated the volume of sales Amazon had in 2018.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]