["About this rating", "If there were an internet survival guide, right at the top in bold letters would be the words: \"Never, under any circumstances, be photographed holding a sheet of paper.\" Image doctoring pranks have become so ubiquitous that the internet-savvy have become suspicious even of genuine photographs of people holding papers or signs. Such was the case in February 2018, when an image surfaced of President Trump meeting with survivors of a deadly high school shooting in Parkland, Florida:", "Trump's crib notes during the WH gun violence listening session: \"5. I hear you\" pic.twitter.com/XRI0X78b5U", "— David Mack (@davidmackau) February 21, 2018", "As people mocked Trump for seemingly needing to be reminded of how to express empathy toward the survivors, others questioned whether the image had been doctored. The image is real, as are the notes in the President's hand.", "This is a genuine photograph of President Trump holding crib notes during the listening session with Parkland survivors on 21 February 2018. Associated Press photographer Carolyn Kaster took the photograph, which is accompanied by the following caption:", "President Donald Trump holds notes during a listening session with high school students and teachers in the State Dining Room of the White House in Washington, Wednesday, Feb. 21, 2018. Trump heard the stories of students and parents affected by school shootings, following last week's deadly shooting in Florida.", "The Associated Press published least two other photographs of Trump holding these notes. Getty Images also captured at least two more images of the notes . The full card is not viewable in any of the photographs but we've managed to piece together the five notes Trump used during the talking session:", "1.) “What would you most want me to know about your experience.”", "2.) “What can we do to make you feel safe?”", "3.) “Do you see [hidden] something effective?”", "4.) Resources? Ideas?", "5.) I hear you.", "In the following video, Trump glances over the notes at the 3:12 mark:", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]