["About this rating", "It might surprise many modern Americans to learn that for the first several decades of its existence, the U.S. Congress did not pay salaries to its members. From the inception of the U.S. Congress in 1789 until 1855 (with the exception of one brief period), members of the Senate and House received no salaries and were paid only on a per diem basis while Congress was in session (initially at a rate of $6 per day).", "Why did members of Congress not initially receive salaries? According to one viral \"Did you know?\" meme, it was because our eminently wise Founding Fathers deemed it so as a clever means of preventing the legislators from raising their own pay and thereby economically elevating themselves above the Americans they were supposed to represent:", "A simple reading of the U.S. Constitution — the same document that established the U.S. Congress in the first place — demonstrates this claim to be false, however.", "Article I, Section 6 plainly states that \"The Senators and Representatives shall receive a Compensation for their Services, to be ascertained by Law, and paid out of the Treasury of the United States.\" First of all, that section did not specify that legislators be paid on a per diem basis rather than a salaried basis (or any other basis); it simply stated that they were to receive compensation in some manner to be determined by law. Second, since members of Congress were to be compensated in a manner \"ascertained by Law,\" and Congress is the body that creates the laws of the United States, it was in fact left to Congress to determine how much, and in what manner, they should be compensated for their services:", "Article I, Section 6 states, “The Senators and Representatives shall receive a Compensation for their Services, to be ascertained by Law, and paid out of the Treasury of the United States.”", "[T]he clause requires that pay be “ascertained by Law.” This means Congress must set its own pay. It also means that either the House or Senate could not change its salary via a simple resolution, which does not go to either the other chamber or the President for approval. Nor could the two chambers together adopt a concurrent resolution, which does not go to the President for a signature. A change in salary must be done via a bill or joint resolution, both of which are presented to the President for a signature. Thus, the President could veto a bill changing Members’ salaries if he thought it inappropriate. Congress’ ability to raise (or lower) its own salary is circumscribed by the checks and balances of the normal legislative process.", "Indeed, as noted in a 1908 history of Congressional Salary Legislation, the question of establishing salaries for various federal officials (including members of Congress) was one of the issues that confronted the very first Congress of the United States back in 1789:", "When the first Congress of the United States convened in New York in 1789, the question of salaries to be voted for the various Federal officials proved one of the most perplexing of the many difficult problems which confronted the uninitiated. Before the question was brought to an issue, many of the more impecunious members had been reduced to the embarrassing necessity of negotiating loans from their friends. At length, a committee of the House of Representatives was named to frame a report and prepare recommendations upon the salaries for the President, Vice-President and members of Congress.", "Congress itself, and not the \"Founding Fathers,\" therefore decided to pay members of Congress via per diems rather than salaries.", "\"But why did Congress do that?\" is an obvious follow-up question, and the answer to that question is because per diem pay for U.S. Congress members had been established by precedent.", "In the 18th century, being a legislator (whether at the local, state, or federal level) was generally not a full-time job. Legislative bodies were not in session year-round: They typically met only for a few months out of the year, and sometimes they convened only infrequently, irregularly, or when specifically called into session rather than on a fixed schedule. And just because a body was in session didn't necessarily mean all of its members were in attendance — most legislators had other occupations and livelihoods that they had to take time out from in order to serve. Therefore, per diem compensation for actual service was the standard of the time:", "At length, a committee of the House of Representatives was named to frame a report and prepare recommendations upon the salaries for the President, Vice-President and members of Congress.", "Under the [Articles of] Confederation, each State paid its own representatives in Congress and instructed and recalled them at pleasure. The compensation in all cases was based on the per diem theory and ranged from four dollars, paid by the smaller, to eight dollars provided by the more affluent, States.", "Invoking the law of averages, the committee ascertained that the various States had paid their members approximately six dollars and a half per diem for actual service. They, therefore, reported a bill providing for payment at six dollars per diem.", "As for the claim that the intent of the per diem system was to ensure that members of Congress were \"subject to the same economic and financial conditions as the rest of the nation,\" we note that at the time the $6 per diem compensation schedule was established, that rate of pay was considered by many critics to be extravagant:", "The committee reported in favor of six dollars a day for Senators and Representatives and double that amount for the Speaker of the House. The flood-gates of oratory were opened wide. The press ridiculed and stormed by turns. Amendments of every manner and description were offered. The opponents ... frantically declared that the members of Congress would riot in profligacy, supporting indecent theatres, imbibing costly wines, and by their example of extravagance prevent other States from joining the Union.", "It should also be noted that when the very first Congress of the United States approved 12 amendments to the Constitution in 1789, only 10 of those proposed amendments were ratified by the states and became enshrined in U.S. history as the Bill of Rights. One of the two rejected amendments sought to forbid Congress from giving itself pay raises (by requiring that any pay increases apply only to subsequent Congresses). That amendment, now the 27th, was not finally ratified until over 200 years later.", "Bomboy, Scott.   \"How a C-Grade College Term Paper Led to a Constitutional Amendment.\"\r\n    Constitution Daily.   7 May 2019.", "TeachingHistory.org.   \"James Madison's Failed Amendments.\"\r\n    Accessed 20 August 2019.", "Congressional Research Service.   \"Salaries of Members of Congress: Recent Actions and Historical Tables.\"\r\n    17 May 2019.", "Strand, Mark and Tim Lang.   \"Who Decides How Much Congress Gets Paid?\"\r\n    Congressional Institute.   26 February 2019.", "Fuller, Hubert Bruce.   \"Congressional Salary Legislation.\"\r\n    The North American Review.   October 1908   (pp. 539-551).", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]