["The photo was posted on Facebook on March 14, 2021.", "The post's Hindi-language caption translates to English as: “Salute to the miracle. Is she Mamata Banerjee or the black magic of Bengal? She broke her leg, cried a lot, did so much drama and today she got off the wheelchair and walked into her car herself.”", "Banerjee, incumbent chief minister of West Bengal, sustained a leg injury on March 10, 2021 while campaigning for an upcoming election in the eastern Indian state.", "She fell out of her car due to an altercation in the crowd that had gathered around, local newspaper The Indian Express reported.", "Voting kicks off March 27 in West Bengal, home to more than 90 million people and which Banerjee has ruled for a decade, AFP reported.", "An identical image was also shared alongside similar claims on Facebook here, here, here and here; and on Twitter here, here, here and here.", "Comments to the post indicate people were misled and thought the photo was genuine.", "One Facebook user called Banerjee a “terrible liar” while another described the whole episode as a “drama”.", "However, the claim is misleading.", "A reverse image search on Google found the photo was originally posted on March 14, 2021 by a Twitter account that publishes satirical content.", "But no one is looking at DIDI....\n\t\tAgar achcha photoshopper hota toh sab DIDI ki traf dekhtay.... pic.twitter.com/vojz6biFc6", "“I photoshop pics for PUN (sic),” the owner of the Twitter account indicated in their bio.", "“Didi would have been fine today if there were a good photoshopper,” the caption of the Twitter photo states in Hindi.", "Banerjee is popularly addressed as Didi - elder sister in Hindi and Bangla  - by the local media and her supporters.", "Digitally altered photo", "The Twitter photo was digitally altered to combine two images of Banerjee that were taken before and after her leg injury.", "The first original image that shows Banerjee walking appears in a report published by the English-language newspaper Hindustan Times on June 7, 2012. The photo caption reads: \"West Bengal CM Mamata Banerjee lashed out at Union home minister P Chidambaram on Friday for his comment on the rising political violence in Bengal, the day before.\"", "The other original image that shows her coming out of a hospital in a wheelchair appears in a more recent Hindustan Times report on March 12, 2021, after her campaign mishap. Its photo caption reads: \"West Bengal chief minister Mamata Banerjee is wheeled out after being discharged from the SSKM Hospital in Kolkata on Friday. (ANI PHOTO).\"", "Below is a screenshot comparison showing the doctored photo (L) and their corresponding source photos from Hindustan Times(R):", "Video reports aired by local media organisations NDTV and ABP News show Banerjee was in a wheelchair following her leg injury in March 2021.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]