["Cuyahoga County Executive Ed FitzGerald highlighted the work of his administration and the importance of investing in the future when he launched his campaign for governor in April.", "The Lakewood Democrat put both elements together in his kickoff speechby talking about education.", "\"Just last night, ladies and gentlemen,\" he said, \"we passed a program to guarantee a college savings account for every single child who enters kindergarten in this county -- the first county in the United States to do so. The first one.\"", "PolitiFact Ohio was surprised by the statement, because we had looked previouslyat the College Savings Account Program.", "Advanced by FitzGeraldin November and approved by the County Council in April, the program will establish a $100 college-savings account for every new kindergarten student who lives in Cuyahoga County.", "We knew the program was similarto San Francisco's Kindergarten to College initiative -- and previous coverage indicated FitzGerald knew it. San Francisco's effort was developed with the Corporation for Enterprise Development, which said about a dozen other communities nationwide have set up savings account programs for children.", "We asked FitzGerald's campaign how he backed up the statement that Cuyahoga was \"the first county in the United States to do so.\"", "They cited one of the Truth-O-Meter's guiding principles, that words matter.", "FitzGerald specifically said Cuyahoga County's program guarantees a college savings account \"for every single child who enters kindergarten in this county.\"", "By \"every single child,\" he meant that the program covers children entering kindergarten in public, private and parochial schools -- about 15,000 pupils a year.", "San Francisco's program, created in 2010, is similar but more restricted. It does not cover every child. The consolidated city-county program establishes a $50 savings account only for children entering kindergarten in public schools -- about 4,500 pupils a year.", "The Corporation for Enterprise Development, the Washington nonprofit that promotes saving and protecting assets and led the development of child savings programs, said no other program nationwide is on the scale established in Cuyahoga County. The county program is the nation's largest.", "FitzGerald said that the Cuyahoga County College Savings Account Program is the first county program in the nation \"to guarantee a college savings account for every single child who enters kindergarten.\"", "The statement is accurate. Though additional information gives a fuller picture, it is not needed for accuracy, even in the context of a political speech. The statement was not misleading.", "We rate it True.", "Yahoo Screen, WEWS, \"Ed FitzGerald announces run for Ohio governor,\" April 24, 2013", "The Plain Dealer, \"Ed FitzGerald kicks off his long-planned bid for governor by banking on his Cuyahoga County base,\" April 24, 2013", "PolitiFact, \"Cuyahoga County Council approves college savings program,\" April 24, 2013", "The Plain Dealer, \"Cuyahoga County wants to set up college savings accounts for all kindergartners,\" Nov. 30, 2012", "Phone interview with Meredith Tucker, FitzGerald campaign, May 30, 2013", "San Francisco Office of Financial Empowerment, \"Kindergarten to College\"", "The Sallie Mae Fund, \"Kindergarten to College San Francisco\"", "Corporation for Enterprise Development, \"CSA Program Models,\" May 29, 2013", "The Plain Dealer, \"College Savings Program will begin this fall for Cuyahoga County children entering kindergarten,\" April 4, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]