["The 21-second video was published in this Facebook post on August 11.", "It was viewed more than 127,000 times and shared more than 6,800 times before it was removed.", "It shows Turkish President Recep Tayyip Erdogan speaking from a podium flanked by Turkish national flags.", "Below is a screenshot of the misleading Facebook post:", "The Urdu language caption translates to English as: “Pakistan's greatest enemy is Imran himself: Erdogan.”", "The Urdu language subtitles translate to English as: \"Kashmir has been sold out but we will not leave our Muslim brothers alone; Pakistan has tried to please Modi in cahoots with Trump; Imran Khan is the greatest enemy of Pakistan.\"", "The video was published days after the Indian government’s decision to revoke Jammu and Kashmir’s semi-autonomous status on August 5, 2019.", "The state was put on a security lockdown, as described in this AFP report.", "The same video with the same misleading Urdu subtitles was published on Twitter here and here.", "The same video was shared on Facebook here, here and here with a similar claim.", "The claim is false; the video actually shows Erdogan giving a speech at a conference in Ankara, in which he said he had a “fruitful” conversation with Khan about ongoing events in Kashmir.", "A Google reverse image search using keyframes obtained from the clip through video verification tool InVID found the footage in the misleading posts was taken from this tweet by the Pakistani state-run broadcaster Pakistan Television (PTV).", "“We are keeping a close watch on the events unfolding in #Kashmir. I have spoken to Prime Minister @ImranKhanPTI & discussed the ongoing situation with him.” - President of the Republic of Turkey, HE @RTErdogan pic.twitter.com/CUZjRqRXCQ", "The tweet’s caption states: “We are keeping a close watch on the events unfolding in #Kashmir. I have spoken to Prime Minister @ImranKhanPTI & discussed the ongoing situation with him.” - President of the Republic of Turkey, HE \n\t@RTErdogan”", "Below is a screenshot of the tweet by PTV:", "A journalist in AFP’s Istanbul bureau analysed the video. Erdogan’s comments in Turkish translates to English as: \"We are following closely the worrying events in Kashmir. Yesterday I had a fruitful phone conversation with Pakistan's Prime Minister Imran Khan. We will also make an effort to reduce tensions by also calling the prime minister of India.\"", "This video has been taken from a speech President Erdogan made on August 6 in Ankara, at the 11th Ambassadors' Conference.", "This is a report published by Turkey’s TRT World about the event on August 6, which also includes a video of Erdogan speaking.", "Tukey’s Anadolu Agency also posted the same video of Erdogan here, which contains English subtitles.", "The YouTube video’s subtitles state: “We are closely monitoring the worrisome developments in Kashmir. Yesterday, I had a fruitful phone conversation with Pakistani Prime Minister Mr. Imran Khan. We will also work to reduce tensions by speaking with Indian Prime Minister Mr. [Narendra] Modi.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]