["This online report from The Times of Islamabad dated December 13, 2018, is headlined: “First European State declares Pakistan completely safe for tourist and business travel”.", "Its first paragraph states: \"In a new development, European state Portugal has become the first one to declare Pakistan completely safe for tourist travel\".", "It refers to a \"new advisory\" from the Portugese government that stated the security situation in Pakistan had improved, though it did not provide any details to explain its claim that the country had been declared \"completely safe\" for tourism.", "The report was also posted on its Facebook page here.", "Below is a snapshot of that post:", "Similar claims have been repeated in other online reports, including this one on ProPakistani.pk.", "Its headline states: \"Portugal is the first European country to term Pakistan safe for tourism\".", "And this piece on Siasat.pk has a headline that states: \"Portugal Government says Pakistan is a safe place for tourism and first country in europe to allow their citizen for tourism\".", "The post on Siasat’s Facebook page promoting the report has had thousands of shares and reactions. Below is a snapshot of that post:", "The purported news of Portugal declaring Pakistan safe for travel has circulated very widely elsewhere online.", "Pakistan’s Finance Minister Asad Umar posted this tweet on December 18, 2018, which was liked or shared more than 28,000 times in the next 17 days.", "Below is a snapshot of that tweet.", "However travel advisories with restrictions and security warnings for Pakistan remain on the website of the Portuguese Ministry of Foreign Affairs.", "The latest advisory updated on November 23, 2018, does note Pakistan’s improved security situation.", "But it warns of various dangers and does not declare the country “safe” or “completely” safe”.", "The advisory is in Portuguese. Below is an English translation of the section of the advisory about travel. Correspondents in AFP’s Lisbon bureau did the translation.", "“Following the operations carried out by armed and security forces, the situation in Pakistan has improved considerably compared with previous years. However, this does not mean that the possibility of terrorist attacks can't increase, either as isolated cases or as part of a series.", "In this regard, the following precautions should be taken:", "Portuguese nationals who travel to Pakistan should contact the Consular Emergency Office of the Foreign Ministry (+351 21 792 97 14/961 7064 72, email: gec @mne.pt) to register their trip. Before traveling, the recommendations of the World Health Organization, Portugal's Ministry of Health     www.dgs.pt and the Foreign Ministry www.portaldascomunidades.mne.pt should be observed. See \"Health Care\".", "Security Conditions - Prior information should be obtained from the Portuguese embassy in Islamabad (see contacts at the end), or from Pakistan's embassy in Lisbon.\n\t\t\tTrips outside of urban centers must be avoided, and if taken during the night, must be organized by a travel agency capable of providing an escort.\n\t\t\tThere are areas of Pakistan which can be considered especially dangerous, such as the \"Khyber Pass\", Baluchistan province, or the borders with Afghanistan/Iran/India, that are far from border posts with guards.\n\t\t\tIt should be kept in mind that locals often do not understand English. Even in urban centres, any travel should be done with the company of locals or with public or private security forces.", "During their stay, travellers must keep up to date with local security conditions by seeking information from their places of accomodation/police stations about the recommended rules for leaving the premises.", "Pakistani authorities and the Portuguese embassy in Islamabad should be informed of prolonged trips, or of visits to more isolated areas, as prior authorisation must be requested from the relevant Pakistani government departments to visit certain areas (which at the same time prevents the possibility dangerous trips).", "In Islamabad and other urban centres, public demonstrations or large gatherings of people that can be susceptible to rioting should be avoided. Watching shows in indoor venues should only happen in places where there is strict access control (which may not be the case in movie theatres in shopping centres for example).", "Tourists, including mountain climbers who wish to travel to northern Pakistan, should request information regarding security conditions from the authorities or the organisers of the trip, and should immediately contact police if they feel they are at risk.\n\t\t\tIn northern regions of the country, you should contact the nearest \"foreigner protection cell\" from the following list provided by the government of Pakistan, which you should always have at hand.\"", "The notice shows clearly that Portugal has not declared Pakistan “completely safe” or \"safe\" for travellers.", "An AFP correspondent in Islamabad sought comment from Umar, Pakistan's finance minister, about his tweet, sending him two text messages on January 1. As of publishing time on January 4, AFP did not get a reply.", "AFP also sought clarification from Pakistan’s foreign ministry.", "\"We are checking reports that Portugal has dropped advisories against Pakistan. Will get back to you as soon as we confirm it,\" Pakistan foreign ministry spokesman Mohammad Faisal told AFP on January 3.", "AFP emailed the Portugese embassy in Islamabad on December 20, 2018, to inquire about the issue but did not get a reply by publishing time.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]