["After a night of intermittent booing and heckling from disappointed progressives attending the first night of the Democratic National Convention in Philadelphia, Bernie Sanders received a hero’s welcome and took the chance to remind his supporters of their political revolution’s real purpose.", "\"This election is about ending the grotesque level of income and wealth inequality that we currently experience, the worst it has been since 1928,\" Sander said. \"It is not moral, not acceptable and not sustainable that the top one-tenth of one percent now own almost as much wealth as the bottom 90 percent, or that the top 1 percent in recent years has earned 85 percent of all new income. That is unacceptable. That must change.\"", "Sanders’ wealth claim, a favorite line from his stump speech, is largely accurate.  His claim about the uber wealthy hogging almost all of the new income, however, is out of date and exaggerated.", "A month before he launched his presidential campaign, Sanders made a version of the claim in an April 2015 interview with Fox News: \"99 percent of all new income today (is) going to the top 1 percent.\"", "Back then, we rated the claim Mostly True, as Sanders’ figure was credible but not the only way to consider income inequality. (Some economists prefer to also factor in unemployment compensation, welfare and health benefits, Social Security, retirement income and health benefits.)", "According to University of California, Berkeley economist Emmanuel Saez, the top 1 percent captured 91 percent of pre-tax, pre-transfer income from 2009 to 2012.", "For this fact-check, the Sanders campaign referred us to a study by the labor-oriented Economic Policy Institute that concludes the top 1 percent got 85.1 percent of new income from 2009 to 2013.", "The trouble for Sanders: A lot has happened since 2013. And as the economy has improved, the income disparity has lessened.", "When Sanders made the same point at a Democratic debate in February 2016, we found more recent data from Saez. By 2014, the top 1 percent’s share of post-recession income dropped to a less egregious (albeit still disportionate) 58 percent — a figure that Sanders seems aware of.", "And last month, Saez updated his numbers again to include 2015 data, and the uber wealthy’s share decreased slightly again to 52 percent.", "\"In 2014 and especially in 2015, the incomes of bottom 99 percent families have finally started recovering in earnest from the losses of the Great Recession,\" Saez writes, adding that the recovery now looks \"much less lopsided\" even as income inequality remains extremely high.", "Here’s a breakdown:", "Our ruling", "Sanders said, \"The top 1 percent in recent years has earned 85 percent of all new income.\"", "That figure covers 2009 to 2013, but there’s data for even more recent years. Factoring in 2014 and 2015, the top 1 percent’s share in post-recession income falls to 52 percent. That’s still a big number, but not nearly what Sanders told convention delegates and a large television audience.", "We rate his claim Half True.", "ABC News, \"Bernie Sanders FULL SPEECH at Democratic National Convention,\" July 25, 2016", "PolitiFact, \"Bernie Sanders says 99 percent of 'new' income is going to top 1 percent,\" April 19, 2015", "Economic Policy Institute, \"Income inequality in the U.S. by state, metropolitan area, and county,\" June 16, 2016", "PolitiFact, \"Bernie Sanders exaggerates concentration of wealth, income for top 1 percent,\" Feb. 4, 2016", "Emmanuel Saez, \"Striking it Richer: The Evolution of Top Incomes in the United States (Updated with 2015 preliminary estimates),\" June 30, 2016", "Email interview with Warren Gunnels, policy director for Bernie Sanders, July 26, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]