["The video was published here on Twitter on September 18, 2020. It has been viewed more than 7,100 times.", "The footage shows a tower crane collapsing leftwards as a group of people in safety helmets watch on.", "Part of the caption written in simplified Chinese characters translates to English as: “Reportedly, during an opening ceremony for this construction site a tower crane nearby collapsed, and two workers are said to have fallen from it. Both are feared dead. The location of the incident is unknown.”", "The post adds that the onlookers are “people in the Communist Party-ruled China”.", "The same video was also shared on Twitter here and here, alongside similar claims.", "The claim is false.", "A keyword search on Google found this news article published on September 16, 2020 by Gansu Daily, a state-run newspaper in China’s Gansu province.", "The article’s simplified Chinese headline reads: “Tower crane ‘collapsed’, stay alert to safety incidents / an emergency rescue drill for safety-related incidents was held during Lanzhou’s ‘quality month’ for construction projects in 2020”.", "Lanzhou is the capital city of Gansu province.", "The article features a photo of a collapsed tower crane, which corresponds to crane seen in the misleading tweet.", "Below is a screenshot comparison of the video in the misleading tweet (L) and the photo in the Gansu Daily article (R) with similarities circled in red:", "Both the Twitter video and another photo published in the Gansu Daily report feature the same green wall bearing a slogan that reads: “Construct with ingenuity / Improve constantly”.", "Below is a screenshot comparison between the Twitter video (L) and the photo on the Gansu Daily article (R) with the same wall and lamppost circled in red:", "The training exercise was also reported here on the verified Weibo account of Lanzhou's public relations department on September 17, 2020. The post includes a photo of people in red and white safety helmets, similar to those seen in the Twitter video.", "Below is a screenshot comparison of the crowd in helmets in the Twitter video (L) and the photo in the official Weibo post (R):", "The Weibo account also addressed the misleading claim here on September 19, 2020, saying that the video in the misleading tweet “actually shows a safety drill”.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]