["The supposed comments by Maduro began spreading in West Africa in August 2018 and have recently begun doing the rounds again as Venezuela’s political crisis dominates international headlines.", "Articles in French cited Maduro as calling on the French government to scrap visas for Africans, saying: “France has a moral responsibility to open its borders to Africans because it is responsible for the misery there.”", "It quoted Maduro as saying France was “the primary beneficiary of African raw materials and most of the time it doesn’t pay a single cent to extract them. It exploits them freely without paying a cent to the governments of these countries. That’s why most of these Africans are coming to Europe, to have a better future.”", "The comments spread widely in francophone Africa, from Mali to DR Congo, Senegal to Benin. They were also translated into English on the news and entertainment website How Africa.", "In both languages the posts generated debate over the extent to which France is responsible for poverty in former African colonies.", "But an advanced search on Facebook using Whopostedwhat shows that the comments first appeared on the site 24jours, which says in its “conditions of use” section that it publishes fictional content.", "“If you want verified information, please see France 24, CNN, the BBC, RT, Euronews etc,” it adds.", "The suggestion that France is the biggest beneficiary of African raw materials is also false.", "According to figures from the World Bank's WITS database, China is the biggest single-country importer of sub-Saharan African raw materials, not France.", "In 2017, sub-Saharan countries exported raw materials worth around $14.2 billion to China, and $4.0 billion to France.", "While these comments were made up, Maduro has in fact waded into the debate over France’s colonial past before.", "After France won the football World Cup last summer, Maduro commented that Africa was the true winner owing to the African heritage of some of its team members.", "“How much have they despised Africa, and in the football World Cup France won the trophy thanks to African players or the sons of Africans,” Maduro said, as reported by AFP in July 2018.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]