["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "President Joe Biden signs his first executive order in the Oval Office of the White House on Jan. 20, 2021, in Washington. (AP)", "On his first day in office, President Joe Biden signed an executive order revoking the permit for the Keystone XL pipeline, halting its construction in the U.S.", "TC Energy Corp. said it will lay off “thousands” of union workers because of the order. The company’s president said the layoffs would number more than 1,000.", "TC Energy estimated in October that the pipeline would employ 11,000 Americans in 2021, generating more than $1.6 billion in wages.", "The pipeline provided far fewer permanent jobs.", "President Joe Biden spent his first day in the White House signing a spate of executive orders aimed at undoing the policies of the Trump administration. One of them sparked outrage on Facebook over its effect on American jobs.", "On Jan. 20, Biden signed an order that revoked the permit for the construction of the Keystone XL pipeline. In a Facebook post published the same day, one user said the move would cost thousands of jobs.", "\"By revoking the Keystone pipeline permit, Biden is destroying 11,000 jobs and roughly $2 billion in wages,\" the post says. \"Democrats couldn’t even get through Day 1 without killing jobs for middle class Americans.\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "We’ve seen several similar posts offer other figures for how many jobs were lost as a result of Biden’s executive order, ranging from 12,000 to 83,000. So we wanted to take a closer look.", "(Screenshot from Facebook)", "TC Energy Corp., the Canadian company that owns the Keystone XL pipeline with the Alberta government, has said more than 1,000 people are out of work because of Biden’s executive order. The 11,000 and $2 billion figures cited in the Facebook post are estimates published by the company, but most of the jobs would be temporary.", "We reached out to the user who published the post for their evidence, but we didn’t hear back.", "The Keystone XL pipeline is an international project years in the making. Without support from the U.S. government, it’s effectively halted.", "The 875-mile pipeline would carry a heavy crude oil mixture from Western Canada to Steele City, Neb., where it would connect with another leg stretching to Gulf Coast refineries.", "Biden’s order revokes the permit that was granted March 29, 2019, by then-President Donald Trump on the grounds that it is harmful to the environment.", "While an 11-volume State Department report on the Keystone XL pipeline found in 2014 that it would not significantly contribute to carbon pollution, critics say the project threatens Alberta’s rivers and forests. And the project has become a symbol for the political debate over fossil fuels.", "The Obama-era State Department had denied TC Energy’s request for a permit in 2015. Trump revived hopes for the project once he took office, ultimately approving it with an executive order. Construction began in April 2020, but that same month, a federal court said that the project had to go through a full endangered species review. TC Energy appealed the ruling, but the Supreme Court upheld it in July.", "Before Biden signed his executive order, only a 1.2-mile section of the pipeline had been completed in Montana near the U.S.-Canada border.", "Over the past several years, we’ve fact-checked many claims that the Keystone XL pipeline would create thousands of American jobs. Several of them lack context about the duration and nature of these positions, and this Facebook post is similar.", "In a Jan. 20 statement, TC Energy said Biden’s order \"would directly lead to the layoff of thousands of union workers.\" It did not specify exactly how many jobs would be lost.", "President Richard Prior told the Associated Press that the layoffs would number more than 1,000. We reached out to TC Energy for more information, but we haven’t heard back.", "The 11,000 figure in the Facebook post appears to stem from an Oct. 28 press release on the pipeline’s website.", "In October, TC Energy awarded contracts to six American union contractors to build the Keystone XL pipeline in three states in 2021. Those contractors were \"responsible for hiring 7,000 union workers.\"", "RELATED: Keystone XL pipeline: Unbuilt, opposed by Biden, mired in lawsuits", "\"When combined with additional 2021 contracts to be announced later, the total number of American union workers constructing Keystone XL in 2021 will exceed 8,000 and $900 million in gross wages,\" the release said. \"In total, Keystone XL is expected to employ more than 11,000 Americans in 2021, creating more than $1.6 billion in gross wages.\"", "That’s close to what the State Department found in its 2014 report.", "In the report, the agency wrote that 10,400 estimated positions would be for seasonal construction work lasting four to eight-month periods. Since the State Department defines \"job\" as \"one position that is filled for 1 year,\" that would equate to approximately 3,900 jobs over a two-year period.", "In short: Most of the estimated jobs were temporary.", "The State Department forecasted that no more than 50 jobs, some of which could be located in Canada, would be required to maintain the pipeline. Thirty-five of them would be permanent, while 15 would be temporary contractors.", "We reached out to the White House for a comment, but we haven’t heard back.", "A Facebook post says that Biden’s executive order revoking the Keystone XL pipeline \"is destroying 11,000 jobs.\"", "That number is an estimate, and the claim lacks context about the longevity of Keystone jobs.", "TC Energy said more than 1,000 people are out of work because of Biden’s executive order. In October, the company said it expected to employ more than 11,000 Americans in 2021 and generate more than $1.6 billion in gross wages.", "But both TC Energy and the State Department have said the majority of those jobs would be temporary. A 2014 report found that the company would need only 50 employees to maintain the Keystone XL pipeline once it’s finished, 35 of them permanent.", "Temporary jobs are still jobs. But this post could leave the wrong impression without full context. We rate it Half True.", "Alberta government, Investing in Keystone XL pipeline", "Associated Press, \"Keystone XL pipeline halted as Biden moves to cancel permit,\" Jan. 20, 2021", "Ballotpedia, Keystone XL Pipeline political timeline", "CTV News, \"A timeline of the controversial Keystone XL pipeline project,\" Jan. 18, 2021", "Facebook post, Jan. 20, 2021", "Facebook post, Jan. 20, 2021", "Facebook post, Jan. 20, 2021", "Fox Business, \"Biden ending Keystone pipeline would kill thousands of American jobs,\" Jan. 19, 2021", "JoeBiden.com, THE BIDEN PLAN TO BUILD A MODERN, SUSTAINABLE INFRASTRUCTURE AND AN EQUITABLE CLEAN ENERGY FUTURE", "Keystone XL, American Jobs", "Keystone XL, \"TC Energy awards more than $1.6 billion in American contracts to build Keystone XL,\" Oct. 28, 2020", "The New York Times, \"Biden’s 17 Executive Orders and Other Directives in Detail,\" Jan. 20, 2021", "PolitiFact, \"Fox News host: Keystone pipeline would create 'tens of thousands of jobs,’\" Nov. 11, 2014", "PolitiFact, \"John Boehner says Keystone XL pipeline would create 100,000 jobs,\" June 26, 2014", "PolitiFact, \"TransCanada CEO says 42,000 Keystone XL pipeline jobs are 'ongoing, enduring,’\" Nov. 16, 2014", "PolitiFact, \"3 key Keystone XL questions answered,\" Jan. 9, 2015", "Rapid City Journal, \"First piece of Keystone XL pipeline finished as company brings labor camp to S.D.,\" May 22, 2020", "TC Energy, Keystone XL", "TC Energy, Keystone XL Project Overview", "TC Energy, \"TC Energy disappointed with Expected Executive Action revoking Keystone XL Presidential Permit,\" Jan. 20, 2021", "U.S. State Department, New Keystone XL Pipeline Application", "U.S. Supreme Court, Keystone XL pipeline order, July 6, 2020", "The Wall Street Journal, \"Federal Judge Blocks Keystone XL Pipeline Permit,\" Nov. 9, 2018", "The Washington Post, \"Keystone pipeline’s southern leg to begin transporting oil to U.S. Gulf Coast,\" Jan. 21, 2014", "The White House, \"Executive Order on Protecting Public Health and the Environment and Restoring Science to Tackle the Climate Crisis,\" Jan. 20, 2021", "The White House, \"Presidential Memorandum Regarding Construction of the Keystone XL Pipeline,\" Jan. 24, 2017", "The White House, \"Presidential Permit,\" March 29, 2019", "The White House, \"Remarks by the President in TransCanada Keystone XL Pipeline Announcement,\" March 24, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]