["U.S. Rep. Roger Williams, who represents the 25th Congressional District running north and west from Austin to just south of Tarrant County, declared that he always commits to a position on issues before the House--never voting \"present\" the \"chicken way.\"", "A reader asked us to fact-check Williams's tout.", "Williams, a former Texas secretary of state who faces Democratic nominee Julie Oliver on the November 2018 ballot, was asked by Maria Bartiromo, who hosts the Fox Business Network’s \"Mornings with Maria,\" why some Democratic colleagues had voted \"present\" instead of \"yes\" or \"no\" on a House-approved resolution.", "The measure expressed support for officers who carry out the mission of Immigration & Customs Enforcement, the agency that some Democrats lately say should be disbanded. The House vote on the resolution was 244-35 with 18 Democrats joining Republicans favoring the proposal and 34 voting against it, The Hill reported--with another 133 Democrats voting \"present\" as urged by Democratic leaders.", "The leadership \"strategy was aimed at both protecting vulnerable Democrats from a contentious vote,\" The Hill said, \"and protesting what most Democrats deemed a political stunt designed to distract the media and the public from Congress’s failure to enact immigration reforms, including efforts to address the separation of migrant families on the U.S.-Mexico border,\" its story said.", "The morning after the House action, Bartiromo asked Williams: \"How do you justify voting ‘present?’\"", "Williams replied: \"Well, I never voted ‘present.’ So I don’t know that I can justify it. It’s the chicken way out is the only way I know we can put it.\"", "Checking vote histories", "We didn’t divine a way to plumb a government website to determine if Williams, who joined the House in 2013, had never voted \"present.\"", "But to our inquiry, Joshua Tauberer, founder of GovTrack.us, a site that compiles congressional votes, confirmed Williams’s statement. Tauberer said by email that Williams, who as of late July 2018 had been eligible to vote in 3,604 roll-call votes, \"has never voted ‘present,’ except in quorum calls where ‘present’ is the only vote one can make.\" Tauberer told us he reached his conclusion by querying the site’s internal database of votes, which he described as built in part from member votes posted by the House clerk.", "We were curious too about other Texas members voting \"present.\" On that front, Tauberer emailed us a spreadsheet showing more than 1,900 \"present\" votes by Texans since 1990, though most weren’t substantive, we found.", "We sifted the provided information to find that 26 Texas members, from both parties, accounted for more than 680 non-procedural votes of \"present\" since 1990 with Rep. Eddie Bernice Johnson, D-Dallas, leading the delegation with 84 votes of \"present\"  followed by Democratic Rep. Gene Green of Houston, with 61. According to our sort, Republican Rep. Joe Barton of Ennis placed third with 59 \"present\" votes; he was trailed by GOP Reps. Sam Johnson of Plano and Lamar Smith of San Antonio, with 57 \"present\" votes each, and Democratic Rep. Sheila Jackson Lee of Houston, who voted \"present\" 50 times.", "We sifted the information even more to find that since Williams joined the House in 2013, 11 House Democrats had voted \"present\" 20 times across nine issues -- topped by Rep. Joaquin Castro, D-San Antonio, doing so five times. Most recently, the results show, Reps. Green and Vicente Gonzalez of McAllen each voted \"present\" on the ICE resolution that Williams supported. Since 2013, the information indicates, no Texas Republicans in the House voted \"present\" on non-procedural issues.", "Outside analyst", "Finally, we asked an expert on Congress generally about the prevalence and significance of \"present\" votes.", "Steven Smith, a Washington University political scientist, said by email that party strategy or an individual’s political calculation often underlie the semi-rare \"present\" votes. \"At times, a legislator may want to avoid committing to the ‘yea’ or ‘nay’ position without reducing his or her rate of voting participation,\" Smith wrote. \"The legislator will be counted as having voted but without having committed to either side. This probably can be rationalized as having unacceptable alternatives, but it avoids adding a vote for or against a cause, group or constituency,\" Smith said.", "Our ruling", "Williams said he’s never voted \"present\" instead of taking a position on issues before the House.", "That’s backed up by research we elicited from the founder of the GovTrack.us website.", "We rate this claim True.", "TRUE – The statement is accurate and there’s nothing significant missing. Click here for more on the six PolitiFact ratings and how we select facts to check.", "YouTube video, \"Rep. Williams Joins FBN's Mornings with Maria to Discuss Immigration and Tax Reform 2.0,\" \"Mornings with Maria,\" Fox Business Network, July 19, 2018", "Webpages, House Resolution 990 and \"All Actions,\" \"Supporting the officers and personnel who carry out the important mission of the United States Immigration and Customs Enforcement,\" 117th Congress (2017-18) (accessed July 26, 2018)", "News story, \"These Democrats want to abolish ICE,\" CNN, July 3, 2018", "News story, \"House backs resolution expressing support for ICE,\" The Hill, July 18, 2018", "Email, Hanna Allred, communications director, U.S. Rep. Roger Williams, July 23, 2018", "Emails, Joshua Tauberer, founder, GovTrack.us, July 19-20, 22 and 24, 2018", "Spreadsheet showing \"present\" votes by Texas U.S. House members, 1990 into July 2018 (received by email from Joshua Tauberer, July 22, 2018)", "Spreadsheets showing non-procedural \"present\" votes by Texas U.S. House members, 1990 into July 2018 and non-procedural \"present\" votes by the members from 2013 into July 2018 (based on PolitiFact Texas sorting of information received by email from Joshua Tauberer, July 22, 2018)", "Emails, Steven S. Smith, Kate M. Gregg Distinguished Professor of Social Sciences, professor of political science; director, Weidenbaum Center on the Economy, Government, and Public Policy, Washington University, July 25-26, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]