["The image was published here on Facebook on November 30, 2020. The post was shared more than 400 times.", "The image, posted by a Facebook user listed as living in Singapore, purports to show a warning sign erected in the vicinity of a closed cemetery. The fourth icon on the board shows a figure with long hair flowing down its face -- a reference to the pontianak, a mythological creature in Malay and Indonesian folklore. The logo of Singapore’s National Environment Agency shown on the sign indicates the cemetery is located in Singapore.", "The post’s caption, written in a combination of English and Malay, translates to English as: “Understand this Signboard..”", "The image was also shared in other Facebook posts here and here; and on Reddit here.", "The image, however, has been doctored.", "A reverse image search on Google found the same photo published here on December 1, 2020 in a post from Singapore’s National Environment Agency (NEA), which oversees programs related to the environment in Singapore, including cremation, burial, and columbarium services.", "Part of the post’s caption reads: “We are aware that a photo of a signage presumably taken at a closed cemetery, with a 'beware of ghost' icon, is circulating on social media. The photo is doctored, and here is how the original signage actually looks.”", "The fourth icon on the original sign appears to be a person tripping over a pothole, not a mythological creature.", "The image was taken in this cemetery in Singapore. This photo from a Facebook user also appears to show the sign's exact location.", "Below is a comparison of the photo in the misleading Facebook post (L) and the photo shared by a Facebook user (R):", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]