["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "On the day Mitt Romney named U.S. Rep. Paul Ryan as his running mate, actress Eva Longoria fired off a series of Twitter attacks on the presumptive Republican presidential ticket.\n\nThe Aug. 11, 2012 tweets by Longoria, who describes herself as an activist as well as an actress, included this one:\n\n\"Today Mitt Romney picked Paul Ryan, who wants to cut Pell Grant scholarships for nearly 10 million students!\"\n\nLongoria is no politician, but she is political, serving as a national co-chair of President Barack Obama’s 2012 re-election campaign.\n\nKnown for her role as Gabrielle Solis on the TV series \"Desperate Housewives,\" Longoria has appeared at Obama campaign events since being chosen to one of the 35 largely ceremonial co-chair posts. At a Denver rally in July 2012, she told Obama supporters: \"We have to get out there and tell (others) ‘If you’re a woman, there is no way you can vote Republican.’\"\n\nBut what about financially needy college students? How would Ryan’s plan affect them?\n\nLongoria’s evidence\n\nLongoria’s tweet about Ryan and student aid included a link to a page on Obama’s campaign website focused on Romney and Ryan. (So did a tweet nearly identical to Longoria’s made the same day by actress Ashley Judd.) The page slams a budget proposal Ryan made as chairman of the House Budget Committee.\n\n\"To pay for tax cuts for the wealthiest,\" the Ryan plan would, among other things, cut \"Pell Grant scholarships for nearly 10 million students,\" the Obama campaign says.\n\nSo, we know where Longoria got the information for her tweet. But the site doesn’t provide any evidence that would back the claim.\n\nFortunately, our colleagues at PolitiFact National evaluated a similar statement made by Obama himself in April 2012, a few days after the GOP-controlled House approved Ryan’s budget resolution. (The plan didn't pass in the Democratic-controlled Senate.)\n\nObama said that if spending reductions in the resolution \"were to be spread out evenly,\" nearly 10 million college students would see their financial aid cut by an average of more than $1,000 each. The White House told our colleagues the president was referring to the Pell Grant program.\n\nSo, Ryan's plan does not specify cuts to Pell Grants. Obama is simply applying the total spending cuts in the plan evenly across the overall budget to derive a Pell Grant number.\n\nDissecting Obama’s claim\n\nLet’s look at what PolitiFact National found in evaluating Obama’s statement:\n\nFederal Pell Grants provide the largest source of grant funding for needy college students (although Ryan contends the grants should be targeted more to lower-income students). More than 9.7 million students are expected to get grants in 2013, according to the U.S. Education Department.\n\nBy the president’s calculation, applying the Ryan budget cuts evenly would reduce the maximum Pell grant -- $5,500 for the 2011-2012 school year -- to $4,595, leaving some students with nothing at all and cutting grants for nearly 10 million students by an average of more than $1,000 per student.\n\nBudget experts said that because the Ryan spending cuts lacked detail, it was fair for Obama to assume the cuts would be applied evenly. But Obama himself acknowledged that Republicans hadn’t specified the Pell cuts themselves and that they might apply cuts in ways other than he assumed.\n\nIndeed, the Ryan plan budget resolution -- which is a guidance document, not a line-by-line budget -- doesn’t mention Pell grant funding; and any funding cuts would be made by House committees. Moreover, a House Budget Committee report accompanying Ryan’s budget resolution suggested the maximum Pell grant remain at $5,500, contradictory to Obama’s claim.\n\nOur colleagues concluded that Obama’s statement was accurate using his set of assumptions, but his assumptions ignored what House Republicans said was a preference that Pell grant maximums not be reduced.\n\nObama’s claim was rated Half True.\n\nFactCheck.org also looked at Pell Grants and Ryan’s plan. The University of Pennsylvania-based fact checkers concluded\"it is certainly true that Ryan’s budget would require deep spending cuts,\" but \"it is hard to know what impact Ryan’s budget would have on specific programs because the plan contains so few details.\"\n\nWe also sought input from Gillian Morris, spokeswoman for Obama’s campaign in Wisconsin, and Kevin Seifert, campaign manager for Ryan, who remains on the November 2012 ballot for his House seat.\n\nObama’s campaign cited an April 2012 opinion column by The New York Times’ Paul Krugman, which claims without evidence that 1 million students would lose Pell grants altogether. But that wasn’t Obama’s or Longoria’s claim. The campaign also provided a March 2012 blog post by Obama’s Office of Management and Budget director, but it uses the same assumptions the president did in his claim.\n\nRyan’s plan would make fewer students eligible for Pell money, according to an article in the conservative National Review cited by Ryan’s spokesman. But while bringing Pell spending \"under control,\" the budget would nevertheless maintain the maximum Pell grant at $5,500, Ryan wrote in response to criticism of his plan.\n\nOur rating\n\nLongoria said Ryan \"wants to cut Pell Grant scholarships for nearly 10 million students.\"\n\nHer claim is slightly different than one made by Obama, who arrived at his 10 million figure by assuming spending cuts called for in Ryan's budget plan would be made uniformly across federal programs. Nevertheless, she uses Obama's methodology in making her claim.\n\nWe’re giving Longoria the same rating Obama got for making a claim that is partially accurate but leaves out important details -- Half True.", "Twitter, Eva Longoria tweet about Paul Ryan, Aug. 11, 2012\n\nTwitter, Debbie Wasserman Schultz tweet about Eva Longoria, Aug. 4, 2012\n\nBarack Obama campaign website, Mitt Romney-Paul Ryan page\n\nLos Angeles Times, \"Obama taps Villaraigosa, Longoria, others to co-chair campaign,\" Feb. 22, 2012\n\nDenver Post, \"Eva Longoria comes to Colorado to rally women for President Obama,\" July 1, 2012\n\nPolitiFact National, \"President Barack Obama says GOP budget cuts financial aid to college students,\" April 6, 2012\n\nEmail interview, Paul Ryan campaign manager/communications director Kevin Seifert, Aug. 13, 2012\n\nEmail interview, Barack Obama Wisconsin campaign press secretary Gillian Morris, Aug. 13, 2012\n\nFacebook, Paul Ryan posting on Obama speech, April 3, 2012\n\nNational Review, \"The truth about Pell grants,\" April 25, 2012\n\nHouse Budget Committee, \"Repairing the social safety net\"\n\nFactCheck.org, \"What Priorities USA Action doesn’t tell you,\" April 18, 2012\n\nNew York Times, \"Wasting our minds,\" April 29, 2012\n\nThe White House, \"The Ryan-Republican budget: the consequences of imbalance,\" March 21, 2012", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]