["About this rating", "In July 2017, a video purportedly showing \"a bolt of lightning striking a river\" went viral on social media:", "Meteorologist Dan Skoff lent credence to the claim when he reposted the video on Facebook, along with the following message:", "This is crazy! One of the most amazing things I've ever seen with lightning. Almost doesn't look real!", "If you aren't terrified of lightning in a swimming pool, you will be now!", "This video, however, does not actually show a bolt of lightning striking a river. When the video is slowed down, it is easy to tell that the \"lightning\" strike doesn't come from the sky, but from a wire on the hill. Here's a screenshot showing the moment of impact (which can be glimpsed at the 7-second mark in the video above):", "This video was uploaded to YouTube by Finnish water engineering company Rannikon Merityö in 2012, under the title \"Porapaalutusta, osa 3: Räjäytys\" (Drilling rig, part 3: Blasting). Although this clip was not accompanied by any additional information, the video was included on the company's web site on a page about underwater mining and blasting:", "KÄÄNNY VEDENALAISESSA LOUHINTA JA RÄJÄYTYSTYÖSSÄ AINA ASIANTUNTIJAN PUOLEEN", "Rantojen ja vedenalaisen kallion louhinta- ja rakennustyö Turun saaristossa ja ympäristössä. Vedenalaisessa louhinnassa madalletaan kallionpinnan korkeutta järvessä, meressä tai muussa vesistössä. Ennen louhintatyön aloittamista tehdään louhinta- ja räjäytystöiden suunnitelma, jotta kaikki toteutuu turvallisesti. Vesistössä tapahtuva kallion louhinta on luvanvaraista toimintaa ja saattaa vaatia aluehallintoviraston (AVI) luvan.", "MIHIN VEDENALAINEN LOUHINTA SOVELTUU?", "Vedenalaista louhintaa käytetään rantojen ja vesistöjen kunnostukseen sekä merimerkkien perustamiseen. Lisäksi vesiväylien syventäminen, rakentaminen ja ylläpito tehdään louhinta- ja räjäytystöillä. Louhinta suoritetaan laittamalla porausreikiin vedenalaista erikoisräjähdettä, joka upotetaan kallioon porattuihin reikiin. Asiakkaita voi olla yksityiset asiakkaat, satamat, ja venesatamat.", "TAKE SUBMERGED MINING AND BLASTING WORK TO AN EXPERT", "Mining and construction of beaches and underwater rock in Turku archipelago and surroundings. Underwater quarrying lowers the rock surface level in the lake, ocean or other waters. Before the excavation work is started, a mining and blasting plan is planned to ensure that everything is safely accomplished. The rock mining in water is licensed and may require the permission of the regional government agency (AVI).", "WHERE IS UNDERWATER MINING SUITABLE?", "Underwater quarrying is used for the refurbishment of beaches and waterways and the creation of sea symbols. In addition, the deepening, construction and maintenance of waterways are carried out in mining and blasting operations. Extraction is carried out by inserting underwater special explosives into the drilling holes, which are immersed in drilled holes in the rock. Customers can be private customers, ports, and marinas.", "As several pieces of debris can be seen floating in the river shortly after the explosion, it seems most likely that Rannikon Merityö used a detonation cord to dislodge a stump or a tree from the river. Regardless of the exact reason for this explosion, it's clear that this video shows the work of a dredging company, not a bolt of lightning.", "Meteorologist Skoff later updated his Facebook post to note that the video did not actually show a bolt of lightning striking a river:", "This is crazy! It's not lightning, BUT instead a detonation cord! There is no flash from the clouds & the bolt just seems to come from the top of the hill. They probably had some explosives detonate under water. Still cool though.", "A similar explosion can be seen in the following video showing the removal of the City Mill Dam in the U.S. state of Georgia's Chattahoochee River. An almost identical \"lightning bolt\" can be seen flashing across the water at the 1:30 mark:", "While we do not advise hopping into an outdoor pool during a raging thunderstorm, we can assure you that should you disregard that advice and lightning strikes during your swim, it may be exceedingly unpleasant — but it won't look like these videos.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]