["About this rating", "On 24 March 2017, the Democratic National Committee (DNC) released a tweet celebrating a Republican setback, but were called out for using — and editing — another political party's material.", "The tweet, which contained a picture depicting a protest against President Donald Trump, referenced the withdrawal of the proposed American Health Care Act from the House. But other Twitter users noted that a Party for Socialism and Liberation (PSL) poster could be seen in the image, and that the DNC's tweet used an altered version of that poster:", "The GOP pulled their disastrous health care bill — this is a victory for the American people. Continue to speak up. It's working. pic.twitter.com/DtUuUIJeyW", "— The Democrats (@TheDemocrats) March 24, 2017", "@TheDemocrats why did you photoshop the @pslweb poster? ? pic.twitter.com/1avTTyM8yp", "— חאשה (@claritchka) March 26, 2017", "Although the PSL poster seen in the DNC tweet retained the line \"Trump is the symptom\" from the original, it omitted the next two lines: \"Capitalism is the disease\" and \"Socialism is the cure.\" The PSL subsequently criticized the alteration, saying the original poster contained \"the word that terrifies Democrats the most\":", "Actually, in that particular issue we used this variation of the slogan—the word that terrifies @TheDemocrats the most pic.twitter.com/i9wE2q2VTP", "— PSL - Socialism ? (@pslweb) March 26, 2017", "Ben Becker, an organizer with the PSL's New York City branch, said in a phone interview that the alteration was a \"poorly-Photoshopped illustration\" of how the Democrats interact with what he called the mass movement against Trump: \"People online are using it as a symbolic representation of how many times Democratic Party politicians will co-opt activist movements from below and put themselves at the front of them or use the imagery of mass protests [and] take credit for it.\"", "Becker also said he was \"fairly certain\" that the photograph used to create the DNC post was taken from the Womens' March on Washington protest. According to him, the DNC did not contact his group before posting the image and have not been in contact since it went online.", "But in one sense, he said, he was glad that the image has not been taken offline: \"It's an important political lesson here about the relationship of the Democratic Party to its own base and to the movement against Trump. People have to be on guard against it and they have to denounce it when they see it. I think that's the most important thing.\"", "The PSL released a statement on 28 March 2017 saying it would not ask that the picture be taken down. The DNC has not yet responded to our request for comment.", "Collinson, Stephen et al.   \"House Republicans Pull Health Care Bill.\"\r\n    CNN.com.   25 March 2017.", "Party for Socialism and Liberation. \"On the DNC photoshopping our poster: a history of co-optation illustrated in one Tweet.\" Liberation News. 28 March 2017.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]