["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The screenshot shows a still image from a local news segment about a campaign stop that Joe Biden and Kamala Harris made in Phoenix on Oct. 8.", "The stop wasn’t a rally. Biden’s campaign told local news reporters that it didn’t release details about the times and locations of the day’s events to avoid crowding amid the COVID-19 pandemic.", "A clip of the segment on YouTube was deceptively edited and spliced together so viewers didn’t know that Biden’s campaign chose not to advertise the event.", "Democratic presidential nominee Joe Biden and President Donald Trump take a different approach to crowds during the pandemic election. Biden favors small events and virtual options, while Trump still prefers to meet with supporters at large events that don’t require social distancing.", "The Trump campaign has repeatedly said Biden campaigns from his \"basement.\" That isn’t true. Now, social media users and one of Trump’s sons are sharing misleading footage from a TV report to make it look like Biden held a campaign event, and no one showed up.", "On Facebook, a still photo grabbed from the report shows an empty road with \"Biden, Harris campaign event in AZ\" in the chyron. Text above the still says: \"Joe Biden and Kielbasa Harris held a joint campaign appearance in Arizona. The first since the Democratic National Convention. No one showed up. No one.\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "This is misleading.", "The still is from a local news segment by Fox 10’s NewsNOW about a campaign visit that Biden and Harris made to Phoenix on Oct. 8.", "The reporter, Nicole Garcia, was standing outside the Heard Museum, which features American Indian art, as Biden and Harris spoke with local tribal leaders.", "Garcia noted that it wasn’t the typical campaign event with a lot of fanfare, but explained that the campaign didn’t release details about the event to the public to avoid creating crowds amid the COVID-19 pandemic.", "\"I’m told by one of the Biden staffers, local staffers, is that they kind of kept the details about the visit, as far as the timing and the exact locations, they didn’t really want to give that out to the public because they want to keep the crowds to a minimum. They realize we are in a pandemic and they don’t want a crowd of more than 50 people at any of their events,\" Garcia said in the report.", "\"So, right now, here at the Heard Museum in central Phoenix meeting with tribal leaders, and pretty much all of the people that we saw enter into the parking lot, about 45 minutes ago, were with the Biden-Harris campaign and the pool reporters.\"", "Eric Trump, the president’s second son, retweeted a clip of Garcia’s segment that was  deceptively edited to remove the part where she talks about the campaign choosing not to invite the public to avoid drawing a crowd. The video has been viewed on YouTube nearly 50,000 times.", "After meeting with tribal leaders, Biden and Harris delivered remarks in front of pooled national press members, which was live streamed, before launching their bus tour to meet with small business owners in the area.", "The Facebook post’s claim contains an element of truth — it did show a Biden-Harris campaign stop — but it ignores that the campaign didn’t invite the public, or release any details about the event because of the pandemic. We rate it Mostly False.", "Facebook post, Oct. 11, 2020", "YouTube, NewsNOW from Fox: BIDEN & HARRIS visit battleground state AZ, Oct. 8, 2020", "AZ Central, Joe Biden and Kamala Harris meet tribal leaders, rally supporters in joint visit to Phoenix, Oct. 8, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]