["Former President Donald Trump speaks at the Conservative Political Action Conference, Feb. 28, 2021, in Orlando, Fla. (AP)", "Biden has not closed down ICE.", "Biden’s administration established new deportation priorities and ordered a temporary pause on some but not all deportations.", "People convicted of serious crimes such as murder and are considered a threat to public safety, border security or national security are a deportation priority under Biden’s administration.", "Former President Donald Trump criticized President Joe Biden for reversing Trump-era immigration policies and claimed that Biden had crippled the federal agency responsible for deportations.", "\"He has effectively ordered a shutdown of ICE, halting virtually all deportations, everyone, murderers, everybody, no more,\" Trump said Feb. 28 at the annual Conservative Political Action Conference. \"Let's not deport people, and restricting our law enforcement professionals.\"", "Biden revoked several of his predecessor’s executive orders on immigration, ordered a review of Immigration and Customs Enforcement’s deportation priorities and a 100-day pause on deportations.", "But the Biden administration has not shut down ICE, as Trump claimed, and criminals, such as murderers, can still be deported.", "PolitiFact rated a similar claim at CPAC by Sen. Tom Cotton, R-Ark., as False. Trump’s office did not respond to our request for information.", "On Biden’s first day in office, David Pekoske, then the acting secretary of Homeland Security, said that the department did not have the resources to deport every single person living in the country illegally. An estimated 10.5 million people are in the U.S. unlawfully.", "Pekoske ordered a review of immigration enforcement practices. In the interim, he said the department would prioritize the deportation of people who threatened national security, border security and public safety. (Under the Trump administration, everyone in the country illegally was a deportation priority.)", "Pekoske also ordered an immediate 100-day pause on the deportation of people with final orders of removal. However, certain groups of people, including those who had engaged in or were suspected of terrorism or espionage, were not eligible for that temporary reprieve.", "Texas Attorney General Ken Paxton sued the Biden administration over the deportation pause, and a federal judge has since blocked it indefinitely.", "ICE’s Acting Director Tae D. Johnson on Feb. 18 issued interim guidance reiterating that deportation resources would focus on presumed threats to national security, border security, and public safety.", "\"Individuals are presumed to be a threat to public safety if, for example, they have been convicted of an aggravated felony or engaged in certain activity as part of a criminal gang or transnational criminal organization and there is reason to believe they currently pose a threat,\" ICE said. An aggravated felony includes murder, rape or sexual abuse of a minor.", "ICE also said that while there were specific deportation priorities, immigration officers and agents were not prohibited from arresting, detaining or removing people not on the priority list. Those actions, though, would be \"subject to advance review,\" the guidance said.", "There have been news reports of deportations happening under Biden’s administration, although the specifics of those cases and exact number of people deported is unclear. PolitiFact asked ICE for details but the agency did not provide that information.", "It’s also worth noting that beyond ICE’s immigration enforcement unit, the agency also has a Homeland Security Investigations division. That division focuses on cases related to human smuggling and trafficking, money laundering, transnational gang activity, and other crimes. Biden has not ordered a \"shutdown\" of that unit, either.", "Trump said Biden \"has effectively ordered a shutdown of ICE, halting virtually all deportations, everyone, murderers, everybody, no more.\"", "Biden has not closed down ICE; the agency’s divisions are still operating. Biden’s administration established new deportation priorities and ordered a temporary pause on certain, not all, deportations. People convicted of serious crimes such as murder and who threatened public safety are a deportation priority under Biden’s administration.", "We rate Trump’s claim False.", "RELATED: Fact-checking claims about deportations in Biden's first month", "Rev.com, Donald Trump CPAC 2021 Speech Transcript, Feb. 28, 2021", "Ice.gov, Homeland Security Investigations", "ICE’s Acting Director Tae D. Johnson interim guidance, Feb. 18, 2021", "Texas Tribune, Federal judge indefinitely blocks enforcement of Biden administration’s 100-day deportation freeze, Feb. 24, 2021", "PolitiFact, Tom Cotton falsely claims Joe Biden halted the deportation of criminals, Feb. 26, 2021", "PolitiFact, Trump moves on promises on immigration, deportations in first month, Feb. 24, 2017", "AP, Hundreds deported under Biden, including witness to massacre, Feb. 1, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]