["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The House Majority PAC, a group aligned with Democrats, released a new ad criticizing Republican congressman Steve Chabot’s record. Chabot is locked in a tight race with Democratic challenger Aftab Pureval to claim the seat in Ohio’s 1st Congressional District.", "The ad says Chabot \"voted to cut health care for kids, affecting up to half the families at Cincinnati’s own Children’s Hospital.\"", "The ad’s text, in full:", "\"While they shouldn’t have to worry, some kids can’t escape it. But Steve Chabot voted to cut health care for kids, affecting up to half the families at Cincinnati’s own Children’s Hospital. The insurance industry that gave Chabot’s campaign over $700,00 got their way. Just like they did when Chabot voted to rollback protections for pre-existing conditions. Steve Chabot listens to them, not us.\"", "So did Chabot actually vote to deny health care to kids? And would it have impacted around half of the patients at Cincinnati’s Children’s Hospital?", "We wanted to find out.", "It is accurate Chabot voted for the GOP-backed American Health Care Act, though the bill didn't pass. If passed, the measure would have rolled back provisions from President Obama’s Affordable Care Act, including protections for people living with pre-existing conditions and cuts to Medicaid, on which many poor children rely. About half of the patients at Cincinnati Children's Hospital Medical Center are covered through Medicaid. But we don't know how many children specifically would have been affected.", "In 2017, Steve Chabot voted to repeal and replace major parts of the Affordable Care Act.", "The House Majority PAC noted that Chabot’s vote in question was related to the American Health Care Act, the GOP-backed plan to overhaul Obamacare. The measure narrowly passed the house with a 217-213 margin before it failed in the Senate.", "Along with leaving it up to states how much of the ACA should be overturned, the AHCA would have reduced $880 billion in Medicaid spending over a 10-year period, according to the Congressional Budget Office.", "The AHCA would have retained some components of Obamacare, but also would have rolled back state-by-state expansions of Medicaid, which covers millions of low-income children.", "More than 35 million children are enrolled in Medicaid in 2018, constituting the largest group in the program, although they represent a smaller share of expenditures compared to other groups. In Ohio, Medicaid covers two in every five children.", "The AHCA would have altered Medicaid’s financing, ending the current federal-state partnership and converting the program to a per-capita or block grant starting in 2020.", "Following the House vote on the bill in May 2017, research released by Avalere Health, a Washington D.C.-based healthcare consulting firm, estimated how much child health could be threatened if Medicaid faced the changes laid out in the bill.", "The organization found that, nationally, children’s Medicaid would get hit with reduced funding of $43 billion over 10 years under a per-capita cap model, with reductions in spending becoming more dramatic each year.", "The Affordable Care Act also raised Medicaid’s minimum income eligibility limit for children from 100 to 138 percent of the poverty line. This was done in the 34 states, including Ohio, that expanded Medicaid under the ACA. It allows children with families incomes below 138 percent of the poverty line, regardless of age, to be covered by Medicaid. The AHCA plan would lower the eligibility level back down to 100 percent of the poverty.", "It's unclear. The House Majority PAC refers to a WCPO Cincinnati story in which a doctor at Cincinnati’s Children Hospital, Dr. Ray Bignall, said that the bill would have hurt children because of its cuts to Medicaid, on which poor children rely.", "He also said that about 50 percent of the young patients at the hospital are covered through Medicaid.", "The hospital is similar to other Children’s hospitals across the country, which depend on Medicaid funding as half of the patients at these institutions are also enrolled in the program.", "Because these hospitals need the money to keep operations afloat, losing covered benefits and enrollees could lead to decreased revenues and ultimately shrink the types of services the hospitals are able to provide children, regardless of their insurance.", "Chabot’s campaign told us that the WCPO story is about the Senate version of the bill, not the House version, and that the House bill \"did not treat Medicaid the same way.\" In the same story, Dr. Bignall also is quoted saying, \"The cuts are essentially just as deep as they were before. It seems that this is a core element of the legislation that isn't going anywhere.\"", "It is true that there were changes in the Senate bill, but both versions would have ultimately phased out the extra money the federal government provides to states as an incentive to expand Medicaid eligibility, and both would put the program on a budget, ending the open-ended entitlement that now exists.", "Several analyses have found the House bill’s funding plan would lead to extensive shortages in every state, but the Senate version would deepen long-term Medicaid cuts even further.", "The House Majority PAC says Chabot voted to take away children’s health care, impacting about half of the kids at Cincinnati’s Children’s Hospital.", "It revolves around Chabot’s vote for the Republican-backed American Health Care Act, which was estimated to have reduced $880 billion in Medicaid spending over the next 10 years, a program on which millions of poor children rely.", "If the House (or Senate) version of AHCA had passed, the financial restructuring of Medicaid could have resulted in severe cuts to the program, and thus, children losing health coverage. But the exact impact on patients at Cincinnati’s Children’s Hospital is unclear, and Chabot's vote wasn't specific to the hospital.", "We rate this claim Half True.", "House Majority PAC ad, Oct. 26, 2018", "Congress.gov, H.R. 1628 Roll Call, May 4, 2017", "Congressional Budget Office, \"American Health Care Act Cost Estimate,\" Accessed Nov. 2, 2018", "New York Times, \"House Passes Measure to Repeal and Replace the Affordable Care Act,\" May 4, 2017", "Medicaid.gov, \"Medicaid Child & CHIP Total Enrollment in August 2018,\" Accessed Nov. 2, 2018", "Kaiser Family Foundation, Medicaid in Ohio,\" September 2018", "Avalere Health, \"The Impact of Medicaid Capped Funding on Children,\" May 18, 2017", "Kaiser Family Foundation, \"Status of State Action on the Medicaid Expansion Decision,\" Sept. 11, 2018", "WCPO Cincinnati, \"Medicaid cuts could impact half of Cincinnati Children's Hospital patients, doctor says,\" July 17, 2017", "The Chartis Group \"The Impact of the American Health Care Act on Children’s Hospitals: Preparing for the Road Ahead, Accessed Nov. 2, 2018", "The Atlantic, \"How Kids Would Fare Under the American Health Care Act,\" May 18, 2017", "New York Times, \"Senate Health Care Bill Includes Deep Cuts to Medicaid,\" June 22, 2017", "Email interview, Jeb Fain, communications director for House Majority PAC, Nov. 1, 2018", "Email interview, Cody Rizzuto, spokesperson for Steve Chabot campaign, Nov. 2, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]