["Last week, the Missionaries of Charity (MoC), Ranchi was under fire for allegedly selling 280 babies to childless couples. Media reports said that the alleged scam came to light after a couple, who had adopted a newborn from the charity after paying Rs 1.02 lakh toward medical expenses and delivery of the child, complained to the Child Welfare Society that the baby was not returned to them after necessary court procedures. It was reported that the MoC could not provide information on births given by 280 women in its homes in Ranchi.", "One of the earliest accounts of the alleged scam was reported by Dainik Jagran, according to which 450 pregnant women were admitted between 2015 and 2018 in various homes founded by Mother Teresa. But records of only 170 childbirths exist and no information about the remaining 280 is available.", "However, a subsequent July 8 report by Times of India refuted these claims as Child Welfare Committees (CWC) and police denied that 280 children were missing from MoC homes. Ranchi SSP Anish Gupta told the media outlet: “We are investigating the matter but the reports of 280 children missing are not true. There are no such records.” Alt News also spoke to the SSP who confirmed the same to us that although records of MoC seem to have discrepancies, the actual number of missing children is yet to be established.", "The police are yet to determine the extensivity of the case, yet lawyer Prashant Patel Umrao made misinformed tweets.", "Two days after media reports began pouring in, Umrao tweeted that 280 “minor orphan girls” were impregnated in “Teresa missionary orphanage” and their babies trafficked abroad. His claim was retweeted more than 3,000 times.", "280 Orphan minor girls made pregnant in Teresa Missionary orphanage & their babies sent to abroad for trafficking. Pope will forgive all as did in Church Crimes. Horrible, Inhuman but No Koharram, Placards!", "— Prashant Patel Umrao (@ippatel) July 9, 2018", "It was also widely shared on Facebook.", "Alt News contacted Jharkhand ADGP R.K. Mallick who told us that Patel’s claim is completely false. “The charity gives shelter to unwed mothers. At the time of delivery, they are taken by the nuns to the hospitals. It’s not as if children are born in the MoC homes. Post delivery, the babies are given to different child care centres as their mothers don’t want the responsibility and MoC also cannot take care of so many newborns.”", "Patel also claimed that the babies of minor girls were sent abroad upon birth for child trafficking. But this is false because the police have reportedly rescued four children, all from within the country. India Today journalist Rajdeep Sardesai, who had also reported the alleged racket, tweeted that Jharkhand ADGP R.K. Mallick told the media outlet that only four children were missing. The same was confirmed to Alt News by the ADGP. “The 280 number is completely false. Only four children were found missing and we have closed our investigation for now. If other reports by CWC come up, we will probe further,” said Mallick.", "Breaking: ADGP Jharkhand Mr Mallik busts theory that 280 kids were missing from Missionaries of Charity home: tells @IndiaToday that only four are missing, of which 3 have been found! How a story gets lost between Ranchi and Delhi in a propaganda war! Damage already done!", "— Rajdeep Sardesai (@sardesairajdeep) July 12, 2018", "The lawyer made two more misinformed tweets regarding the case and repeated the false information of “280 minor girls made pregnant” and “babies trafficked abroad”.", "This isn’t an isolated case of Patel circulating misinformed claims. Earlier, in the ‘Tanvi Seth passport controversy’, he fuelled a cycle of fake news with his tweets. Alt News has on numerous occasions called out Patel’s bluff. Ironically, he was an attendee at BJP social media meet in Delhi where party chief Amit Shah advised against fake news. When an individual shows a pattern of rumour-mongering, users need to be careful before believing anything they share on social media.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]