["The video was published here on Facebook on April 30, 2020. It has been viewed more than 230 times.", "The 16-second footage shows a man wearing a black suit walking through a crowded market. In the clip, multiple people can be heard speaking Cantonese. At the four-second mark, a voice can be heard saying in Cantonese; “Kim Jong Un”.", "Below is a screenshot of the misleading post:", "The post’s traditional Chinese-language caption translates to English as: “People all over the world would like to know where Kim Jong Un is? Alive or dead? Turns out he is wandering and eating meatballs in Changhua!”", "Changhua is a city in central-west Taiwan.", "The video was shared after heightened speculation about Kim's health. On May 2, state media reported he made his first public appearance in almost three weeks, following rumours that he was seriously ill or possibly dead, AFP reported.", "The video was also shared here, here and here on Facebook alongside a similar claim that Kim had been spotted in Taiwan. It was also shared in this Facebook post with a claim it shows him at a Hong Kong market in 2020.", "All the claims, however, are false. The video has circulated online since at least 2018 and shows a Kim Jong Un impersonator.", "A keyword search found a longer version of the video published here on YouTube on December 16, 2018. The video has been embedded below.", "The video title, written in a mix of traditional Chinese and English, reads: “Kim Jong Un visited Hong Kong Kim Jong un Arrived HongKong?”", "A further keyword search also found this April 2020 report by the Taiwan-based fact checking website MyGoPen about the video in the misleading posts. It states the video shows a Kim Jong Un impersonator dubbed \"Kim Thailand\" in Hong Kong.", "AFP spoke to a spokesperson for Kim Thailand on May 7, 2020, who said the video “does not show the real Kim Jong Un.”", "During a phone conversation, she said: “I can confirm that person is not the real Kim Jong Un... it is actually Kim Thailand, a Thai business owner called Utane Luangsangthong based in Samut Prakarn, Thailand.", "“For this video, it was actually taken in Kowloon, Hong Kong and he was just walking around. Sometimes Mr. Utane likes to do this for entertainment purposes.\"", "The video in the misleading posts was filmed here in Hong Kong, as seen on Google Street View.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]