["About this rating", "One of the predominant news stories of late September 2017 was a tweet storm that President Trump directed at NFL players who chose to \"take a knee\" rather than during the national anthem. One highly publicized tweet in particular drew notice, in which Trump seemingly suggested that fans should boycott games and that the league should prohibit such protests:", "Sports fans should never condone players that do not stand proud for their National Anthem or their Country. NFL should change policy!", "— Donald J. Trump (@realDonaldTrump) September 24, 2017", "In particular, the President was widely criticized for supposedly devoting more time and attention to condemning the pre-game behavior of football players than to arranging much-needed federal aid to Puerto Rico, which had just been devastated by Hurricane Maria:", "It's shocking — though not entirely surprising — that the media and the president have barely acknowledged the devastation caused by Maria. Why is no one talking about the 3.4 million U.S. citizens who were impacted by the storm? Where are the fundraisers and concerts showing the same support that residents of Houston and south Florida felt after Harvey and Irma? Instead of paying attention to the growing humanitarian crisis impacting our fellow countrymen, the president of the United States spent the weekend picking a fight with professional athletes over their decision to exercise their First Amendment rights. Inevitably, the media and all of America's attention followed.", "Trump has tweeted just five times about Hurricane Maria and Puerto Rico since last week — once on Tuesday before the storm hit the island and then Wednesday night, promising his support. Then he tweeted again Monday night, after days of being called out for not posting anything about Puerto Rico. In his tweets, he pretty much blamed the island for the status of its infrastructure and mentioned it has to deal with its debt crisis. He hasn't mentioned the rest of the Caribbean once, not even the U.S. Virgin Islands, which were deeply impacted in the aftermath of Maria and Irma.", "Meanwhile, combining his original tweets and retweets, Trump posted about the controversy surrounding the national anthem and athletes more than 20 times over the last couple of days. More. Than. Twenty. Times.", "It was with a blithe sense of irony, then, that pundits dug up and recirculated a tweet issued by citizen Donald Trump four years before, in which Trump took President Obama to task for weighing in on the controversy over the name of the Washington Redskins football team, describing the issue as \"nonsense\" and admonishing Obama to \"focus\" on the country's \"far bigger problems\" instead:", "President should not be telling the Washington Redskins to change their name-our country has far bigger problems! FOCUS on them,not nonsense", "— Donald J. Trump (@realDonaldTrump) October 8, 2013", "For his part, President Trump asserted that whatever the volume and nature of his tweets, he had not been distracted from tending to hurricane relief efforts by the NFL issue:", "President Trump defended his high-profile campaign against NFL players who kneel during the national anthem and insisted it hasn't distracted him from hurricane relief efforts in Puerto Rico.", "\"To me, the NFL situation is a very important situation,\" Trump said at a news conference. \"I have plenty of time on my hands. All I do is work.\"", "Trump insisted that the government is \"totally focused\" on hurricane relief efforts, even as he devoted time and energy to halting the football protests — a campaign that drew widespread pushback from the NFL over the weekend.", "\"It doesn't take me long to put out a wrong and maybe we'll get it right,\" Trump said. \"I think it's a very important thing for the NFL to not allow people to kneel during the playing of our national anthem.\"", "Gonzalez-Ramirez, Andrea.   \"Can Trump Stop Feuding with NFL Athletes & Pay Attention to Puerto Rico?\"\r\n    Refinery29.   26 September 2017.", "Horsley, Scott.   \"Trump Stands by NFL Comments, Insists He Wasn't Distracted from Hurricane Relief.\"\r\n    NPR.   26 September 2017.", "Spodak, Cassie.   \"Obama Might Change Redskins Name If He Were Owner.\"\r\n    CNN.   5 October 2013.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]