["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The fallout from the Internal Revenue Service’s tougher scrutiny of tea party groups continues with former IRS officials testifying that they never tried to mislead Congress about IRS practices.", "Republican senators like Orrin Hatch, R-Utah, were openly skeptical. \"You lied by omission,\" Hatch said.", "President Barack Obama and Democrats have criticized the excesses of the IRS. But some would like to shift the focus to the legal ambiguity that allows some tax-exempt groups to engage in politics without revealing their donors, as formal campaign organizations must do.", "The chair of the House Democratic Caucus, Xavier Becerra of California, promoted that line during an appearance on NBC’s Meet the Press.", "\"We have a tax code that allows groups to use their political operations within the tax code, under the guise of a charity, to use undisclosed millions of dollars to do political campaigns,\" Becerra said.", "We checked whether charities actually can engage in politics and the experts we reached were quite clear. If by charities, you mean groups with 501(c)(3) status, the law says they can’t.", "\"If Rep. Becerra had used the term ‘tax-exempt organizations’ rather than the word ‘charities,’ his statement would be correct,\" said Brett Kappel, counsel at the Washington law firm Arent Fox. Kappel represented the Ron Paul 2012 campaign.", "\"Charities are 501(c)(3) organizations and cannot engage in any partisan political activities,\" Kappel continued. \"501(c)(4) social welfare organizations are tax exempt, but they are not charities. They can engage in partisan political activities as long as they are not the organization's primary activity.\"", "Becerra said his target was 501(c)(4) groups and notes that the tax code spells out that for such groups, their net income should be \"devoted exclusively to charitable, educational, or recreational purposes.\"", "\"Charitable is another form of the word charity,\" Becerra told PolitiFact. \"I used that word because Americans understand it and they associate it with something good, not groups that are in the business to do politics. If I had said 501(c)(4), they would have understood everything except that term.\"", "There are thousands of tax-exempt organizations that have the legal right to try to shape the course of legislative votes and elections. They could be a chamber of commerce, a child welfare organization that presses for certain legislation, or powerful political players like Crossroads GPS, founded by Republican strategist Karl Rove. According to the Center for Responsive Politics, Crossroads GPS spent $70 million on television ads and other media in the last election.", "For the curious, here’s how the rules breakdown for the different groups:", "• Charities - 501(c)(3): Donations are tax deductible; donors go unreported; no political activity allowed", "• Social Welfare - 501(c)(4): Donations are not tax deductible; donors go unreported; some political activity allowed.", "• Super PAC - 527 groups: Donations are not tax deductible; donors are reported; political activity allowed.", "Social Welfare Organizations", "IRS regulations define a social welfare organization as one that is \"primarily engaged in promoting in some way the common good and general welfare of the people of the community, i.e., primarily for the purpose of bringing about civic betterment and social improvements.\"", "Since civic betterment is in the eye of the beholder, a group can form around virtually any cause. It can raise money to support its activities, and ever since the U.S. Supreme Court’s decision in the Citizens United case, it has a relatively free hand to try to shape the outcomes of elections.", "Kenneth Gross is a former lawyer for the Federal Elections Commission and now heads the political law practice at the Washington firm of Skadden, Arps, Slate, Meagher and Flom. Gross says the Citizens United decision gave 501(c)(4) groups considerable leeway.", "\"They can run ads that say don't vote for some candidate,\" Gross said. \"They can go very strong, so long as they can say they are predominantly a social welfare organization.\"", "Gross noted that spending on campaign ads triggers the need to report the expenditures to the FEC, and to that extent, disclosure is part of the picture. Brad Smith, law professor at Capital University School of Law in Columbus, Ohio, says Becerra is wrong to ignore the FEC reporting.", "\"We know how much (c)(4)’s spent, we know what they spent it on and what candidates they supported or opposed,\" Smith said. \"All we don't know are the names of individual donors.\"", "But that Bercerra told us, was his point. Disclosure of donors, their names and the amounts they gave, is never required. This goes back to a 1958 Supreme Court ruling involving the NAACP. In that decision, the court said keeping membership lists private is essential to protecting the constitutional right to assemble.", "Becerra made his comments in the middle of a discussion about whether the public should know the backers of groups that intervene in politics. If a candidate, political party, an ordinary political action committee or a Super PAC raises money, it must report its donors. But not a 501(c)(4). So long as the group can argue that most of their other activities are aimed at nonpolitical social welfare goals, it can engage in hardcore political work.", "\"This controversy is 100 percent about disclosure,\" Gross said.", "How much is too much", "The crunch point in the debate over 501(c)(4) organizations is the fuzziness over what percentage of their effort goes toward engaging in bare knuckles politics. IRS rules say such groups must be organized exclusively for the promotion of social welfare, but in terms of how much political work they do, the rules limit that only in a relative sense. The political effort can not be their \"primary activity.\"", "The IRS does not define its terms. \"Some lawyers say, so long as it’s 49.99 percent, it’s okay,\" said Gross. \"But there is no percentage in the regulations.\"", "Allison Hayward, an attorney and a board member of the House Office of Congressional Ethics, says the IRS decides whether a group is following the rules based on a test that evaluates \"facts and circumstances.\"", "\"It is a test that doesn’t offer a lot of clarity,\" Hayward said.", "Our ruling", "Becerra said the tax code allows charities to spend undisclosed millions to do political campaigns. Becerra might have used the word \"charities\" too broadly to describe the tax-exempt organizations that rely on this wrinkle of the tax code. Becerra said he was trying to use language that most people would understand instead of the tax code’s technical term of a 501(c)(4) group. He’s right that these organizations can raise millions to engage in politics, and they need not reveal their donors.", "We rate this statement Mostly True.", "Congressman Xavier Becerra, Meet the Press, May 19, 2013", "Interview with Congressman Xavier Becerra, May 22, 2013", "Interview with Kenneth Gross, lawyer with Skadden, Arps, Slate, Meagher & Flom LLP, May 21, 2013", "Email interview with Brett Kappel, counsel with Arent Fox, May 21, 2013", "Email interview with Brad Smith, professor of law, Capital University School of Law, May 22, 2013", "Email interview with Allison Hayward, board member, House Office of Congressional Ethics, May 21, 2013", "Section 501 of the US code, Legal Information Institute, Cornell University Law School", "Charities, Churches, and Educational Organizations - Campaign Intervention, Internal Revenue Service web site", "Political organizations and IRC 501(c)(4), Raymond Chick and Amy Henchey, Internal Revenue Service web site", "Social Welfare Organizations, Internal Revenue Service web site", "Political Campaign and Lobbying Activities of IRC 501(c)(4), (c)(5), and (c)(6) Organizations, John Francis Reilly, Carter C. Hull, and Barbara A. Braig Allen, Internal Revenue Service web site", "NAACP v. Alabama, Privacy and Data Protection, Anita Allen, University of Pennsylvania School of Law", "Comments of the individual members of the exempt organizations task force on Section 501 (c)(4) and politics American Bar Association, May 25, 2004", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]