["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "In his speech at the Democratic National Committee in Charlotte, N.C., President Barack Obama mocked Republicans for turning to tax cuts as the solution to every problem.\n\n\"Have a surplus? Try a tax cut. Deficit too high? Try another. Feel a cold coming on? Take two tax cuts, roll back some regulations, and call us in the morning!\" Obama said.\n\n\"Now, I’ve cut taxes for those who need it – middle-class families and small businesses.  But I don’t believe that another round of tax breaks for millionaires will bring good jobs to our shores, or pay down our deficit,\" Obama said.\n\nObama is often accused by Republicans of raising taxes, and he has raised some taxes during his presidency. He’s also said that he intends to raise income tax rates for couples who make more than $250,000 a year or single people who make more than $200,000 a year.\n\nHere, we’re going to look at his claim to cut taxes for \"middle-class families and small businesses.\" (We’ve been tracking all of Obama’s campaign promises about taxes on our Obameter.)\n\nObama has signed off on two major tax cuts for middle-class families: the Making Work Pay tax credit that was part of the economic stimulus of 2009 and a temporary reduction in Social Security payroll taxes that went into effect in 2011.\n\nAs part of the stimulus, formally known as the American Recovery and Reinvestment Act, single workers collected a $400 tax credit, and working couples got $800. The credit didn’t come in the form of a check; it worked out so that most workers had about $400 less in federal income taxes withheld from their paychecks spread out over the entire year.\n\nMost workers received a tax cut under that plan, with the exception of some high earners. The tax cuts phased out for couples who make more than $250,000 or a single person making over $200,000, according to an analysis from the nonpartisan Tax Policy Center .\n       \nThe result mirrored what Obama promised he would do on the campaign. Obama pledged tax cuts of $500 for each worker and $1,000 for working couples. We rated the promise a Compromise on our Obameter because the resulting tax cut was a little lower than what Obama wanted.\n\nThat tax cut expired at the end of 2011. But Obama won another round of tax cuts for most workers in a December 2010 tax deal with Republicans in Congress. Those tax cuts -- a temporary reduction in worker’s payroll taxes, worth about 2 percent of total earnings -- expire in 2013. Again, the tax cut didn’t come as a check, but gives workers a little more in their paychecks than they would have otherwise.\n\nObama also has passed an array of tax cuts for small businesses.\n\nEight of them were included in the stimulus, the Affordable Care Act (also known as the health care law), and the Hiring Incentives to Restore Employment Act (also known as the HIRE Act). Among the cuts were the exclusion of up to 75 percent of capital gains on key small business investments; a tax credit for the cost of health insurance for small business employees and new tax credits for hiring Americans out of work for at least two months.\n       \nAnother eight cuts came via the Small Business Jobs Act, signed by Obama in September of 2010. These included: adding deductions for business cell phone use; creating a new deduction for health care costs for the self-employed; allowing greater deductions for business start-up expenses; eliminating taxes on all capital gains from key small business investments, and raising the small business expense limit to $500,000.\n   \nThree months later, the president signed a tax bill that raised the expense limit to 100 percent of small business new investments until the end of 2011. It also extended the elimination of capital gains taxes for small business investments through the end of 2012. (For more details, see our previous fact-check that provided at least 16 tax cuts to small businesses; we rated it Mostly True.)\n\nTo be clear, this doesn’t mean the middle-class and small businesses haven’t seen any tax increases under the Obama administration. We rated his campaign promise that no family making less than $250,000 will see \"any form of tax increase\" as Promise Broken. Obama has signed off on new taxes on cigarettes and indoor tanning. His health care law includes a tax penalty for people who don’t buy health insurance; that starts in 2014. (It includes hardship exemptions for people who can’t find affordable policies.)\n\nAlso, under the health care law, small businesses that have more than 50 employees that don’t offer their employees health insurance could face fines.\n\n Our ruling\n\nObama has raised some taxes during his presidency, but he’s also pursued broad-based tax cuts for the middle class and small businesses. We particularly give weight here to the tax cuts that were part of the stimulus and the payroll tax holiday, which reduced taxes for broad swaths of the workforce. Some small businesses may have been hit by new taxes that were part of Obama’s health law, but these would depend on the particular circumstances of each business. Also, there were new taxes on cigarettes and indoor tanning.\n\nObama said he has \"cut taxes for those who need it – middle-class families, small businesses.\" He has, but he also has raised some taxes. So while his statement is accurate, it lacks that additional context. We rate his claim Mostly True.", "PolitiFact, Barack Obama claims credit for \"at least 16 tax cuts to small businesses,\"July 7, 2011\n \nWhite House website,The Recovery Act\n       \nWhite House website,The Affordable Care Act\n       \nWhite House website,Press release on the HIRE Act, March 18, 2010\n       \nWhite House website,Press release on the Small Business Jobs Act, Sept. 27, 2010\n       \nWhite House Blog,\"White House White Board: Tax Cuts, Unemployment Insurance & Jobs,\"posted by Jesse Lee, Dec. 9, 2010\n       \nAmericans for Tax Reform, ,\"Obamacare Tax Hikes: One Down, Twenty to Go\"\n       \nInterview with Curtis Dubay, senior tax policy analyst at the Heritage Foundation, June 13, 2011\n       \nInterview with Joseph Rosenberg, research associate at the Tax Policy Center, June 13, 2011\n       \nE-mail interview with Ryan Ellis, director of tax policy at Americans For Tax Reform, June 13, 2011\n       \nE-mail interview with Richard Morrison, spokesman for the Tax Foundation, June 13, 2011\n\nTax Policy Center, \"The American Recovery and Reinvestment Tax Act of 2009\": Making Work Pay Credit, Conference Report, Distribution of Federal Tax Change by Cash Income Level, 2009, Feb. 13, 2009\n\nPolitiFact, \"Tax cut for 95 percent? Stimulus made it so,\" Jan. 28, 2010\n   \nPolitiFact, \"Tax cuts for 95 percent? A closer look,\" Oct. 20, 2008\n   \nPolitiFact, \"Create a tax credit of $500 for workers,\" last updated Jan. 4, 2011\n   \nThe Tax Policy Center,Impact of Sen. Obama's tax proposals, Oct. 14, 2008\n   \nThomas,The American Recovery and Reinvestment Act of 2009, accessed Feb. 17, 2009\n   \nIRS.gov, \"Making Work Pay Questions and Answers,\" accessed Sept. 5, 2012", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]