["About this rating", "In March 2015, the \"Rhodes Must Fall\" campaign began at the University of Cape Town in South Africa, when students began pushing for the campus to take down a statue of Cecil Rhodes.", "Rhodes (the former prime minister of Cape Colony) was a businessman and politician. He was also an ardent imperialist who was part of the effort to annex large parts of land in South Africa in the late 1800s, making enormous sums of money and eventually founding the De Beers diamond firm.", "Many universities in South Africa bear his name, and for years, Rhodes has been lauded for his accomplishments.  However, he also passed laws which laid the groundwork for apartheid in the country, and is thus also regarded as a symbol of repression, colonization, and apartheid — which has no place, activists say, on a university campus, especially in a region of the world that still struggles with the aftereffects of institutional racism.", "The \"Rhodes Must Fall\" campaign was successful at the University of South Africa; the school removed the statue in April 2015, a month after the protest there began.  Students and anti-colonialism activists then began similar protests to remove statues at other universities, including Oxford, where Rhodes (who was born in England) remains a large figure. Oxford University still offers the elite Rhodes Scholarship, and a statue in his likeness presides over the university's Oriel College campus.", "In January 2016, Oxford students voted to remove the statue.  Later that month, the university opted to keep the statue after receiving threats from alumni to withdraw millions in donations if it was removed.  The college's decision sparked more marches and ongoing protests, keeping the issue in the news.", "A letter about the Cecil Rhodes statue at Oxford University began to be widely circulated via social media and e-mail after it was originally published on the web site Breitbart in December 2015. The message (a missive that in part laments today's politically correct culture) is often preceded by the claim that it is an official letter from Oxford University's chancellor, Chris Patten. The original posting on Breitbart starts with a small disclaimer informing the reader that the following message is what Oxford should have told its students, and not what the university actually said:", "Instead of standing up to these hoity-toity grievance mongers – led by two black South African students on scholarships –  Oriel has caved.", "Here is the letter that Oriel College should have written to the campaigners from Rhodes Must Fall.", "The above-displayed message was eventually stripped from the letter and replaced with the claim that it was an official piece of correspondence from Patten to the student's of Oxford:", "My mouth is still hanging open after reading this….this is OUTStANDING!! About time the institutions and governments on this side of the pond get some backbone and use logic in lieu of feelings.", "Subject: Oxford Rebukes Idiot Activists", "Black activists at Oxford have been campaigning to have THE RHODES statue removed and below is the Chancellor Chris Patten’s response...it’s a beauty from start to finish.", "While Patten did argue against the removal of the Rhodes statue during an appearance on the Today program on BBC Radio 4 in January 2016, his language was far tamer than the openly racist rhetoric employed in Breitbart's fictional letter:", "“But if people at a university are not prepared to demonstrate the sort of generosity of spirit which Nelson Mandela showed towards Rhodes and towards history, if they are not prepared to embrace all those values which are contained in the most important book for any undergraduate, Karl Popper’s Open Society, if they are not prepared to embrace those issues then maybe they should think about being educated elsewhere. But I hope they will embrace those issues and engage in debate.”", "Patten styled the objections to Rhodes as along the lines of the “safe spaces” policies adopted on many university campuses in Britain and the US, which critics have said are used to suppress debate on a range of issues.", "“That focus on Rhodes is unfortunate but it’s an example of what’s happening in American campuses and British campuses,” Patten said. “One of the points of a university – which is not to tolerate intolerance, to engage in free inquiry and debate – is being denied. People have to face up to facts in history which they don’t like and talk about them and debate them.”", "He added: “Can you imagine a university where there is no platform? I mean a bland diet of bran to feed people, it’s an absolutely terrible idea. If you want universities like that you go to China where they are not allowed to talk about western values, which I regard as global values. No, it’s not the way a university should operate.”", "The protests, which have developed into an international movement, are real and ongoing. However, the circulating letter that's alleged to be from Oxford University's chancellor is fake, and first originated as a satirical op-ed piece written by a London-based contributor to Breitbart.com.", "Gayle, Damien.   \"Cecil Rhodes statue row: Chris Patten tells students to embrace freedom of thought.\"\r\nThe Guardian.   13 January 2016 .", "Delingpole, James.   \"Mud Huts v Western Civilization: Why #Rhodesmustfall Must Fail.\"\r\nBrietbart.   24 December 2015 .", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]