["The claim was posted to Facebook by a New Zealand-based user here. The post have been shared over 200 times.", "The image features a screenshot of what appears to be a tweet from the US President Donald Trump.", "The tweet reads: “THE NEXT 30 TO 60 DAYS WILL BE THE BIGGEST DRAINING OF THE SWAMP EVER! ENOUGH IS ENOUGH, THE TIME HAS ARRIVED!”", "The Facebook post’s caption reads: “deleted as quick as he posted it #WWG1WGA”.", "A similar image was also shared hundreds of times here, here and here.", "The image, however, is misleading.", "The screenshot comes from this hoax Twitter account purporting to be Donald Trump. The original tweet can be seen here.", "The image clearly shows the handle of the account where the tweet originated from as @reulDonaldTrump, while the actual Twitter handle of the US president is @realDonaldTrump. Trump’s real account can be seen here.", "Trump's tweets are also accompanied by a blue tick after his username, which means Twitter has verified the account.", "The tweet featured in the widely shared misleading screenshot doesn’t include the blue tick after the username, rather in the profile’s photo.", "See below a comparison of the hoax Twitter account (L) and real Twitter account for the US president (R):", "The caption WWG1WA is a reference to the widely debunked conspiracy theory QANON, which AFP has reported was recently removed from Facebook for its ties to violence.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]