["About this rating", "It is true that Drake released a scented candle that has the same aroma you would smell if you encountered the musician in public.", "However, the aroma is not that of Drake himself, but rather his personal fragrance.", "On Dec. 2, 2020, the Revolve online store released a luxury scented candle product from Drake's Better World Fragrance House in the scent \"Carby Musk,\" which, according to the promotional literature, \"Actually smells like Drake.\" Revolve had previously teased the line of scented candles in October.", "It is somewhat true that Drake released a scented candle that \"actually smells like Drake.\" The kicker is that the candle smells not like Drake himself, but rather his personal fragrance. The product's description read as follows:", "Smooth musk fragrance is introspective as in an interpretation of your beautiful self, yet extrovertive as how you would want others to see your bold and brilliant self. Features notes of Musk, Ambers, Cashmere, Suede, and Velvet. Actually smells like Drake - it's the personal fragrance he wears, which inspired BWFH. Soy wax blend. Includes marker to personalize jar.", "Some Twitter users questioned whether the lineup of candles was real, and at least one person expressed a very specific wish:", "Drake previously gifted scented candles to the Toronto Raptors NBA team. He first dropped hints about a line of candles in June 2020 in Instagram Stories, which was saved and tweeted as a screenshot on Twitter:", "People.com reported that there were four other scents in the lineup of five candles, other than \"Carby Musk,\" the scent that smells like Drake's personal fragrance. The other four included: \"Sweeter Tings,\" \"Williamsburg Sleepover,\" \"Good Thoughts,\" and \"Muskoka.\"", "However, Drake was certainly not the first celebrity to launch a scented candle line. People.com also reported that \"Gwyneth Paltrow, Kacey Musgraves and Kim Kardashian West\" all had their own lines as well. Elle reported that Paltrow previously released candles such as \"This Smells Like My Vagina\" and \"This Smells Like My Orgasm.\"", "Our reporting on Drake previously left off with us debunking the claim that he was dead following a drive-by shooting. The death hoax made the rounds on Twitter in mid-November 2020.", "Meanwhile, the scented candle that \"actually smells like Drake\" was sold out after its initial Dec. 2 release.", "Jordan Liles is a Senior Reporter who has been with Snopes since 2016.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]