["The photo was published in this Facebook post on June 28, 2019. It has been shared more than 950 times.", "Below is a screenshot of the misleading Facebook post:", "The Indonesian-language text in the photo reads: “The story of a grandmother accused of stealing cassava because she was hungry and a judge who cries after reading out the verdict on her.”", "The lengthy caption translates to English as: “In a courtroom, Judge Marzuki sat silently as he listened to a prosecutor reading out a sentence demand on a grandmother accused of stealing cassava. The grandmother said she was poor, had a dying son and a hungry grandchild.", "“But a manager of PT X** (part of the Y** group) was firm on the demand, saying it should serve as an example for other citizens. Judge Marzuki took a deep breath and decides to make a different verdict, something that was not sought by the prosecutor. ‘I am sorry,’ the judge said as he looked at the grandmother. ‘I can’t make any legal exception. The law is a law and you must be sentenced. You must pay 1 million rupiah in fines and if you can’t pay, you must go to jail for two and a half years as sought by the prosecutor.’", "“The grandmother was abject and brokenhearted. Judge Marzuki, however, took off his hat and filled it with 1 million rupiah from his wallet. He then told the audience in the court:", "“‘In the name of the court, I now order each person in this courtroom to pay 50,000 rupiah because you, as citizens of this town, have let a person suffer from hunger and forced her to steal to feed her family. Mr. Clerk, please collect the money in my hat and give all of the money to this defendant.’", "“After Judge Marzuki knocked his gavel and leaves the courtroom, the grandmother received 3.5 million rupiah from the donation.", "“It included 50,000 rupiah from the PT X** manager who was ashamed of accusing the woman.”", "The same photo was shared with an identical claim on Facebook here, here and here.", "A similar claim about the alleged trial was shared without the photo here in 2012.", "The claim is false; the photo has circulated in media reports since 2015 about the court trial of an elderly Indonesian woman who received a suspended sentence for stealing logs.", "A reverse image search on Yandex found the same photo was published in this report published on Indonesian news site JPNN.com on April 17, 2015.", "Below is a screenshot of the report:", "The JPNN report’s headline translates to English as: “This is the action of Grandmother Asyani that makes us really sad.”", "The report’s photo caption states: “Asyani spontaneously kneeled again in front of the judges’ desk after a hearing at the Situbondo District Court.”", "The JPNN reports states in part: \"Grandmother Asyani once again cries when undergoing a trial at the Situbondo District Court, Thursday (16/4).", "“The 63-year-old grandmother, who is popularly called as Muaris, kneels down on the floor before the panel of judges in the green table. In the midst of her crying, the mother of four repeatedly says she is not a thief.”", "A Google keyword search found this report published on April 24, 2015, by Indonesian news site Kompas about the same case. The report used a photo showing the same woman in the same courtroom taken from a different angle. Below is a screenshot of the article:", "The report’s photo caption translates to English as: “Asyani kneeled in front of the judges’ panel at the end of the hearing on Thursday (16/4) at the Situbondo District Court. Asyani cried hysterically because the prosecutor accused her of stealing teak logs. The prosecutor asked for a one-year jail term, with 18 months of probation, and a 500 million rupiah fine or one-day jail.”", "According to Kompas, the panel of judges, led by Judge I Kadek Dedi Arcana, gave Asyani a one-year jail sentence with 15 months of probation.", "There is no record of the “cassava case” in the online ruling database of Indonesia’s Supreme Court website, which stores rulings issued by all judiciary levels in Indonesia, from district courts to the Supreme Court.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]