["This is the message which has been posted by Congress leader Digvijaya Singh on his Twitter account, along with a fleet of ambulances lying unused. Singh posted this picture and message on his Twitter account which has been retweeted over 170 times.", "ये उत्तर प्रदेश की हालत क्या कर दी योगी जी ने, अखिलेश यादव जी द्वारा चलवाई गई 108,102 एम्बूलेंस खड़ी जंग खा रही है और जनता अपने बीमार परिजनों को ठेलो पर अस्पताल ले जा रही है॥ #वाह_योगी_जी_वाह# #बेशरमी_की_भी_हद_होती_है#", "रजत यादव pic.twitter.com/zWJr8CugHY", "— digvijaya singh (@digvijaya_28) October 3, 2018", "On Facebook, the page I am with Ravish Kumar too has posted this image with the aforementioned claim. It has been shared a whopping 31,000 times already.", "ये मेरे प्रदेश की हालत क्या कर दी योगी जी अखिलेश यादव जी द्वारा चलवाई गई 108,102 एम्बूलेंस खड़ी जंग खा रही है जनता ठेलों पर मरीज ले जा रही है।", "Posted by I am with Ravish Kumar on Tuesday, October 2, 2018", "The image is not from UP as claimed by Digvijaya Singh but from Andhra Pradesh. Sakshi TV, which is a Telugu news channel, had reported on September 22 how ambulances at Avutupalli near Vijaywada were lying unused.", "According to the news report, the ambulances are idle because of lack of maintenance on the part of the agency which has been awarded the contract by the Andhra Pradesh government. Alt News spoke to Raja Ramesh, reporter of Sakshi TV who filed the report from Vijaywada. “(The ambulances) seen in the photo are old 108 ambulances which were not used as BVG, the agency tasked with maintenance and service has not allotted the requisite funds.", "If one looks closely at the image posted by Digvijaya Singh, it can be seen that the ambulances are from Andhra Pradesh. At the bottom right of the screen, the words ‘Government of Andhra Pradesh’ can be read on the green band on the vehicle. However, this image is relatively blurred. The image posted on the website of Sakshi TV is clearer and the words can be read easily.", "Political propaganda on social media is rampant, relentless and often economical with the truth. A closer look at the image reveals that the claim circulating on social media is false. While Digvijaya Singh relishes taking potshots at the BJP, he has been caught on the wrong foot in this instance.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]