["About this rating", "A relative of Dale Earnhardt Sr. did share a story about his once removing a Confederate-flag sticker from his truck.", "This story was told by Earnhardt's daughter, Kelley, not his son, Dale Jr.", "In June 2020, shortly after NASCAR announced that it would be ban the display of Confederate flags at future events, we were alerted to a story concerning the late racing legend Dale Earnhardt Sr.'s attitude toward the southern symbol:", "This story truly originates with one of Earnhardt's children. However, it actually came from Earnhardt's daughter, Kelley, not his son, Dale Jr.", "The anecdote can be heard in an April 2015 episode of the \"Fast Lane Family\" podcast. The episode featured a Q&A with Kelley Earnhardt Miller about her father on what would have been his 64th birthday. She prefaced the story by saying that it was a good example of her dad's heart and how he cared for people.", "She said:", "\"On my dad's truck, he had this sticker with a rebel flag that said 'American by birth, Southern by the grace of God' or something like that, you know, had a rebel flag on it. At the time, we had a lot of different nannies that took care of us and we had this housekeeper named Ann, and she was the most awesome lady. She was an African-American lady, and she asked my stepmother about my dad's rebel flag on the back of his truck.", "\"And so the next thing we know my dad's out there with a knife and a razor blade, and he's cutting the rebel flag out of the sticker, he left \"American by birth\" but he didn't want to offend anybody or make anybody mad in that manner. It was so sweet. It was a little kind-hearted thing. She just thought that was the best. She's like, 'That's just so awesome that you would do that.' He had a good heart.\"", "She tells this story around the 24:30 mark of the following audio:", "https://www.iheart.com/podcast/256-fast-lane-family-dirty-mo-31085378/episode/50-ask-kelley-dale-sr-41670893/", "A few months after the episode aired, Dale Earnhardt Jr., also a famous race-car driver, said he, too, was against the display of the Confederate flag. At the time, in June 2015, South Carolina Gov. Nikki Haley was calling for the removal of the Confederate flag from the state house, and NASCAR had endorsed that position.", "Earnhardt Jr. said:", "\"I've made my comments about the Confederate flag several times, and I stand behind NASCAR's stance to remove it ... I think if it's offensive to an entire race, it really does nothing for anybody to be there flying. It belongs in the history books, that's about it.'\"", "Almasy, Steve.   \"NASCAR Bans Confederate Flags At All Races, Events.\"     NBC Sports.   10 June 2020.", "McFadin, Daniel.   \"NASCAR Endorses Call for Removal of Confederate Flag From South Carolina Capitol.\"     NBC Sports.   23 June 2015.", "Long, Dustin.   \"Dale Earnhardt Jr., Jeff Gordon Support NASCAR's Stance on Confederate Flag.\"     NBC Sports.   26 June 2015.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]