["“यह वही ड्रोन है जिसे भारत इज़राइल से खरीद रहा है।इसे खरीदने का प्रयास चीन ने भी किया लेकिन भारत का विरोधी होने के कारण इज़राइल ने बेचने से साफ मना कर दिया|आप भी देखिए इस ड्रोन का कमाल (This is the same drone that India is purchasing from Israel. Even China tried to buy this (drone) but as it opposes India, Israel denied selling it to China. You also watch this amazing drone),” is a message currently viral on social media, accompanied with a CGI video of combat aircrafts and drones.", "इसको देख कर ऐसी फटेगी सायद कोई सील न पाए 😁*", "यह वही ड्रोन है जिसे भारत इज़राइल से खरीद रहा है।इसे खरीदने का प्रयास चीन ने भी किया लेकिन भारत का विरोधी होने के कारण इज़राइल ने बेचने से साफ मना कर दिया* आप भी देखिए इस ड्रोन का कमाल👇👇👇👇👇", "Posted by मीरा मान on Wednesday, 20 February 2019", "Several individual users have shared the 6:16 minutes clip.", "Alt News found that the video has been floating on both Twitter and Facebook with the identical claim since last year.", "The viral video carried the stamp – ‘Semenov Dahir Kurmanbievich’. When Alt News looked up the phrase on YouTube, we found that it was the name of a Russian inventor, Dahir Semenov. We discovered his YouTube channel where, in 2016, he had uploaded the same video which is currently viral on social media.", "We also found his LinkedIn and Facebook profiles which said that he is a Russian citizen currently residing in Turkey.", "Semenov is also a director of a technology company called Dahir Insaat Corporation, which provides clients with construction techniques. He made news in 2015 for designing an earthquake-proof bed.", "In the aftermath of Pulwama attack, Israel offered “unconditional help” to India to tackle terrorism. Recently, the Indian government also approved 54 killer drones from Israel made for the Indian air force. However, the viral video is not representative of the India-Israel defence deal as it was a concept design uploaded by a Russian inventor.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]