["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "An employee sorts through boxes at the Win.It America warehouse in Walton, Ky., on May 1, 2018. After an ICE agent arrested one of the company's employees, the warehouse lost 28 workers over several weeks and struggled to meet its shipping deadline. (AP)", "Would a Wisconsin congressman’s proposal to eliminate ICE really mean no more enforcement of the U.S. borders?", "No.", "But that’s the claim by Leah Vukmir, who is running for the U.S. Senate seat held by Wisconsin Democrat Tammy Baldwin.", "Here’s why Vukmir’s blanket statement goes way wrong.", "Like us on Facebook. Follow us on Twitter: @PolitiFactWisc.", "Pocan’s proposal", "On June 25, 2018, U.S. Rep. Mark Pocan, a Madison-area Democrat, announced his proposal to eliminate the U.S. Immigration and Customs Enforcement (ICE). That was five days after President Donald Trump signed an executive order ending the separation of families who were trying to enter the United States illegally at the Mexican border.", "To be clear, ICE was not involved in those border actions, which resulted in the separation of more than 2,300 children and their parents.", "Pocan instead alluded to ICE actions taken inside the United States, accusing a unit of the agency of \"hunting down and tearing apart families\" at churches and schools, and raiding places such as garden centers and meatpacking plants.", "His proposal drew the wrath of Vukmir, who faces Kevin Nicholson in the Aug. 14, 2018, Republican primary for the Senate. The winner will take on Baldwin on Nov. 6, 2018.", "In a news release on July 5, 2018, Vukmir raised the prospect of open borders, saying Pocan’s proposal would be \"effectively eliminating our border\" She added: \"Sen. Baldwin, where do you stand? Do you believe we should eliminate border enforcement? Americans deserve to know.\"", "(Baldwin doesn’t support Pocan’s proposal, which was introduced as legislation on July 12, 2018. In an odd twist, Pocan and other Democrats who introduced the measure said the same day that if GOP leadership follows through with their vow to bring it to the House floor, they would vote against it. \"We know\" Speaker Paul Ryan \"is not serious about passing our\" bill, the Democrats declared in a statement, saying they \"will not engage in this political stunt.\"", "So, Vukmir is claiming that Pocan’s proposal to eliminate ICE would \"eliminate border enforcement\"  — a broad statement essentially echoed later by her campaign spokeswoman.", "But Pocan isn’t proposing to get rid of border enforcement  — and ICE isn’t the agency that patrols the borders, anyway.", "What is ICE?", "Many Americans might associate ICE with border enforcement. But as University of Texas professor and immigration expert Ruth Ellen Wasem put it, \"most do not know that ICE’s role in immigration enforcement is not at the border.\"", "Border security is actually the responsibility of another federal agency  — Customs and Border Protection. CBP is the parent agency for the Border Patrol, which patrols the U.S. borders with Mexico and Canada. It is the Border Patrol that did the recent separation of parents from children at the Mexican border.", "Elizabeth Cohen, a Syracuse University political science professor and immigration expert, told us:", "Customs and Border Protection is responsible for enforcement at the border and 100 miles in from any point on the border of the U.S., land and water. Eliminating ICE would not eliminate CBP or enforcement at the border.", "What ICE does is arrest, detain and deport unauthorized immigrants who are already inside the United States. This focus on the interior of the country is made clear on the ICE website:", "While certain responsibilities and close cooperation with U.S. Customs and Border Protection, U.S. Citizenship and Immigration Services and others require significant ICE assets near the border, the majority of immigration enforcement work for ICE takes place in the country’s interior.", "For example, in what The Atlantic described as two of ICE’s largest raids, both in Ohio in June 2018, the agency arrested 146 employees at a meat-processing plant and detained 114 workers at a nursery for suspected immigration violations.", "Not abandoning enforcement", "Indeed, Pocan has been clear that he is not proposing to end border enforcement.", "In a USA Today opinion column published two days before Vukmir made her claim, he wrote:", "Abolishing ICE does not mean open borders. ICE is the agency directed by the president to aggressively round up and detain individuals already living in our country, not the agency tasked with patrolling the border. Under my legislation, we would still have agents stationed to secure the border.\n\nFactCheck.org found that Pocan, as well as all other Democrats in Congress who are calling for the end of ICE, have not called for abandoning border enforcement.", "See all of our fact checks in the Wisconsin U.S. Senate race.", "Steven Camarota, research director at the Center for Immigration Studies, which advocates for low levels of immigration, argued that eliminating ICE would hamper immigration enforcement. He told us that while some people entering the United States illegally are immediately returned to Mexico, those detained for any length of time are placed in the custody of ICE. So, eliminating ICE would result in a \"catch and release policy,\" he said.", "But Stephen Legomsky, a Washington University law professor emeritus and immigration expert, told us that CBP or any agency that replaces ICE could take on the detention function.", "As for Vukmir, when we asked her campaign for information to support her statement, spokesman Mattias Gugel sent us a link to an animation that shows how to do a Google search.", "Amusing, perhaps, but it didn’t help his boss.", "Our rating", "Vukmir says Pocan’s proposal to eliminate ICE would \"eliminate border enforcement.\"", "But enforcing the border is not even ICE’s job. Rather, the federal agency pursues unauthorized immigrants who are already inside the country.", "A different federal agency is responsible for patrolling the border, so border enforcement would continue even if ICE were eliminated. And, in any case, Pocan is not proposing to end border enforcement.", "For a statement that is false and ridiculous, we rate Vukmir’s claim Pants on Fire.", "Leah Vukmir campaign, news release, July 5, 2018", "Email, Leah Vukmir campaign spokesman Mattias Gugel, July 10, 2018", "Milwaukee Journal Sentinel, \"Mark Pocan push to abolish ICE reverberates in Wisconsin U.S. Senate race,\" July 9, 2018", "PolitiFact National, \"'Abolish ICE'\" movement is growing. Is the agency's disbanding likely?\" July 3, 2018", "CNN, \"These Democrats want to abolish ICE,\" July 3, 2018", "ICE.gov, \"Overview,\" accessed July 11, 2018", "FactCheck.org, \"Calls to Abolish ICE Not ‘Open Borders,’\" July 3, 2018", "The Hill, \"Abolishing ICE: Good policy, bad politics,\" July 9, 2018", "New York Times, \"What Is ICE and Why Do Critics Want to Abolish It?\"  July 3, 2018", "USA Today, \"Abolish ICE, transfer critical functions: Rep. Mark Pocan,\" July 3, 2018", "Quartz, \"What ICE actually does,\" July 4, 2018", "Email, Center for Immigration Studies director of research Steven . Camarota, July 11, 2018", "Vox, \"‘Abolish ICE,’ explained,\" June 28, 2018", "Email, Washington University law professor emeritus and immigration expert Stephen Legomsky, July 11, 2018", "Interview, University of Texas clinical professor of public policy practice Ruth Wasem, July 11, 2018", "Email, Syracuse University political science associate professor Elizabeth F. Cohen, July 11, 2018", "Email, U.S. Rep. Mark Pocan spokesman Ron Boehmer, July 11, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]