["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Wisconsin U.S. senators Ron Johnson and Tammy Baldwin participated in a Senate committee hearing called by Johnson on the nation's heroin problem. The hearing was held April 15, 2016 in Pewaukee, Wis. (Milwaukee Journal Sentinel photo by Michael Sears)", "Heroin and prescription painkillers were a topic in the second and final Wisconsin U.S. Senate debate on Oct. 18, 2016, three weeks before election day.", "It produced this exchange among Republican incumbent Ron Johnson, Democratic challenger Russ Feingold and moderator Mike Gousha.", "Johnson: \"I’ve been incredibly active on this. The fact that Senator Feingold attacked me, saying I’ve done nothing on this -- completely false. And quite honestly, a very disgusting false attack.\"", "Feingold: \"I didn’t say he did nothing.\"", "Gousha: \"There was a radio ad that said that Senator Johnson essentially did nothing.\"", "Gousha was correct. A Feingold campaign radio ad released Sept. 6, 2016 says:", "\"Heroin addiction and opioid abuse are killing Wisconsin, and yet after six years in Washington, Sen. Ron Johnson has essentially done nothing.\"", "Johnson pushed back by posting the video clip of the debate exchange on Twitter and with a digital ad responding to Feingold’s attack.", "So, let’s check the claim in the radio ad: In the six years since Johnson took Feingold’s seat in the 2010 election, has he \"essentially done nothing\" to fight heroin addiction and opioid abuse?", "Scope of the problem", "The lethal power of heroin and opioids (prescription painkillers such as oxycodone) has increasingly drawn the attention of politicians.", "Prince’s death in April 2016 from fentanyl, a synthetic opioid, led Republican Wisconsin Attorney General Brad Schimel to claim that more people die in Wisconsin from all types of drug overdoses than car crashes. We rated that claim True.", "A couple of months later, when Democratic New York Gov. Andrew Cuomo said \"we’re losing as many people to heroin and opioid overdoses as we lost to the AIDS epidemic at its peak,\" PolitiFact New York’s rating was Mostly False. Deaths directly caused by AIDS (43,115) were higher at their peak in 1995. Nevertheless, the latest data show 28,647 people across the country died from heroin and opioid overdoses in 2014, a figure that has been steadily climbing.", "Now let’s turn to Johnson.", "Johnson actions", "Johnson pushed back on Feingold’s claim partly because a nephew of Johnson’s died from a fentanyl overdose. (Initially, when Johnson revealed the death in March 2016, it was reported as a heroin overdose, but Johnson has since said it was fentanyl.)", "Here’s what Johnson’s campaign cited to us in terms of actions Johnson has taken:", "1. Voted for the Comprehensive Addiction and Recovery Act, which was approved almost unanimously in Congress before being signed into law by President Barack Obama in July 2016.", "Obama described the law as modest and complained that Republicans blocked an additional $920 million in funding supported by Democrats.", "But the law does authorize $181 million in new federal money for opioid and heroin abuse efforts. Moreover, the bill also makes policy changes in what the nonpartisan Pew Charitable Trusts described as the first \"multifaceted federal response to the prescription opioid and heroin epidemic.\"", "2. Introduced in April 2016 the Promoting Responsible Opioid Prescribing Act, which is aimed at reducing financial incentives for doctors who over-prescribe pain medications. The bill has been referred to a committee.", "3. The same month, as chairman of the Senate Homeland Security and Government  Affairs Committee, held field hearings about the opioid problem in Pewaukee, Wis., and Cleveland, Ohio. He also held a hearing in Phoenix in November 2015 on \"America’s heroin epidemic at the border.\"", "4. Johnson also takes credit for a bipartisan investigation done by his committee. A report by the committee, which was disclosed in May 2016, found oversight problems at the Veterans Affairs facility in Tomah, Wis., where the prescription of painkillers to veterans has been under scrutiny.", "Feingold's campaign has pointed to Johnson's votes against two amendments — the first for $1.1 billion to combat heroin addiction, the second for $600 million in emergency funding to fight the opioid crisis.", "More specifically, his campaign criticized Johnson for a no vote in June 2016 on a cloture motion (to limit debate). That motion was in regard to an amendment to a defense authorization bill that would have authorized $18 billion for various purposes, including $1.1 billion to fight heroin and opioid addiction. Johnson also voted no in March 2016 on a motion to \"waive all applicable budgetary discipline\" in order to make appropriations to fight the heroin and opioid problem, which the Feingold said would have provided $600 million.", "It’s fair to criticize Johnson for what he didn’t do -- but that wasn’t Feingold’s claim.", "Our rating", "Qualifying his claim only slightly, Feingold says Johnson \"has essentially done nothing\" to fight heroin addiction and opioid abuse.", "Johnson has voted for a major bill aimed at confronting the heroin-opioids problem, introduced a bill aimed at curbing overprescription of opioids and held Senate committee hearings on the problem. That’s more than nothing.", "We rate Feingold’s statement False.", "WISN-TV, video of Wisconsin U.S. Senate debate (1:19:00), Oct. 18, 2016", "Russ Feingold campaign, radio ad, Sept. 6, 2016", "Email, Russ Feingold campaign spokesman Michael Tyler, Oct. 21, 2016", "USA Today, \"Congress approves anti-addiction bill as funding fight continues,\" July 13, 2016", "The Hill, \"Obama signs opioid bill,\" July 22, 2016", "Milwaukee Journal Sentinel, \"Feingold-Johnson: Political becomes personal,\" Oct. 20, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]