["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "In this Aug. 15, 2019, file photo, former New York City Mayor Rudy Giuliani smiles as he arrives to President Donald Trump's campaign rally in Manchester, N.H. (AP)", "Novartis is a Swiss pharmaceutical company that manufactures hydroxychloroquine. It has donated 30 million doses to the U.S.", "While Novartis paid Giuliani a speaker’s fee in 2006, there is no publicly available evidence that he currently has a financial stake in the company. He has denied having one in press reports.", "Financial disclosure documents indicate that Trump does not have a current connection to Novartis.", "Rudy Giuliani’s promotion of a lupus and arthritis drug to treat COVID-19 patients is raising eyebrows about his motivation.", "In an interview with Fox News on April 5, Giuliani, President Donald Trump’s personal attorney, said hydroxychloroquine could potentially be used to alleviate symptoms associated with the coronavirus.", "\"I think we should let doctors decide whether we should use hydroxychloroquine, not the national bureaucracy,\" he said. \"Everything shows that it works.\"", "Giuliani’s comments echo what Trump has said over the past few weeks, despite the fact that medical experts still don’t know much about the drug’s efficacy against COVID-19. (Not every study shows that it works, for instance.) But a tweet published the same day as the Fox interview claims Giuliani has ulterior motives for promoting the drug.", "\"Here @whpresscorps Ask Trump about THIS!!\" @Wiseronenow said in the tweet. \"‘Giuliani, in early February, bought $2M in shares of Novartis, a primary supplier of hydroxychloroquine. How many shares did Sean Hannity & the Trump family buy?’\"", "(Screenshot from Twitter)", "The tweet was referred to us by VineSight, a startup that uses artificial intelligence to surface potential misinformation. We found the same claim circulating on Facebook, where some posts also implicated President Donald Trump.", "\"Novartis also paid Michael Cohen $1M in payments in 2016,\" one post reads, referring to Michael Cohen, Trump’s former personal attorney. \"Also Trump had a 1 on 1 meeting with Novartis CEO in January 2020.\"", "We’ve seen a lot of misinformation about chloroquine and hydroxychloroquine, so we wanted to take a closer look at Giuliani and Trump’s financial interests in the drugs and their manufacturers.", "We could find no evidence that Giuliani purchased stock in Novartis in early February. The company paid Cohen more than $1 million in consulting fees in 2017, not 2016. And while Trump did attend a dinner with a Novartis leader in January, it was not a one-on-one meeting with the CEO.", "Novartis is a Swiss pharmaceutical company. It has donated hydroxychloroquine to the U.S. National Strategic Stockpile for use in treating COVID-19 patients.", "On March 29, the Department of Health and Human Services published a statement saying that it had accepted 30 million doses of hydroxychloroquine sulfate donated by Sandoz, the generics division of Novartis. The company said in an earlier press release that it plans to give out 130 million doses by the end of May.", "The donation came after Trump said during a March 19 press briefing that chloroquine could potentially be used to treat COVID-19. But the research is far from settled.", "RELATED: Hydroxychloroquine and coronavirus: what you need to know", "Two studies, one from France and one from China, found that hydroxychloroquine helped people clear the virus quickly and alleviate symptoms. But two other studies found that the drug had no discernible effect on the coronavirus. With more than 50 studies still in the works, the efficacy of hydroxychloroquine in treating COVID-19 is still unproven.", "Novartis has said criticism that the drug is unproven and the company is profiting from it is \"without merit.\" Now let’s take a closer look at any ties to Trump and his lawyers.", "While Novartis has paid Giuliani in the past, we could find no evidence that the former New York mayor has a current financial connection to the company.", "A search of the Securities and Exchange Commission’s database, which contains information about publicly traded companies, turned up no documents linking Giuliani to Novartis. We also found no mention of Giuliani on the company’s website.", "A 2007 financial disclosure form from Giuliani, who campaigned for the Republican presidential nomination in 2008, shows that Novartis paid him a $60,000 gross speaker fee on Feb. 6, 2006. The company is not listed anywhere else on the form.", "The New York Times reported that Giuliani’s interest in hydroxychloroquine stems in part from his contact with Dr. Vladimir Zelenko, a New York physician who has been giving the drug to people with coronavirus-like symptoms. Giuliani told the Times he does not have any financial interests in hydroxychloroquine. We reached out to him for a comment, but we haven’t heard back.", "Novartis has had connections with another Trump associate.", "In May 2018, the company disclosed that it had paid Cohen, the former Trump personal attorney, for health care policy consulting. A Senate report published in July 2018 outlined how Cohen had received $1.2 million over a 12-month period ending in February 2018.", "A month after the deal was signed, Novartis \"determined he would not be able to provide the anticipated services,\" according to the report. However, Cohen was still paid for a year under the terms of the contract.", "In December 2018, Cohen was sentenced to three years in prison for campaign finance violations and lying to Congress.", "The connection between Cohen and Novartis has led some to speculate that Trump has financial motives for promoting hydroxychloroquine. Some Facebook users have claimed Trump met with the company \"one on one\" in January, making his recent promotion of the drug suspicious.", "There’s little evidence to back either claim up.", "Trump’s financial disclosure forms indicate that he has not held stock in Novartis since taking office. The last form filed was in May 2019.", "The New York Times reported that the president does have a stake in Sanofi, a French company that makes hydroxychloroquine, through a mutual fund. But the stake is rather small; the Washington Post reported that it’s \"between about $100 and $1,500 in total.\"", "RELATED: Why experts worry about President Trump touting chloroquine", "As for the purported \"meeting\" between Trump and Novartis, there was a dinner the president attended with the company’s chairman — not its CEO — in Davos, Switzerland, on Jan. 21. The event included a slew of executives from other companies around the world.", "Even if Trump or his associates did have some stake in Novartis, it’s uncertain whether they’d reap financial benefits from the increase in demand for hydroxychloroquine. The company is donating, not selling, nearly its entire supply of the drug.", "\"Any rumors that Novartis stands to benefit financially or otherwise from the donation of hydroxychloroquine is without merit,\" a company spokesman told PolitiFact in an email.", "Novartis shares spiked briefly after Trump began touting chloroquine on March 19, but since then they have performed about as well as the broader stock market.", "A tweet claimed that Rudy Giuliani bought $2 million in shares of Novartis in February.", "We could find no evidence that Giuliani has a current financial connection to Novartis, which has donated 30 million doses of hydroxychloroquine to the U.S. The company did pay consulting fees to a former Trump associate, but documents don’t show any financial connection between the president himself and Novartis. The meeting that Trump had with the company’s chairman in January was not one on one — it included many other business executives.", "Bottom line: Available evidence does not show any financial link between Giuliani or Trump and Novartis. Barring additional evidence, the tweet is inaccurate. We rate it False.", "Business Insider, \"Trump touts unproven coronavirus treatment hours after reports that a man in Arizona died trying to use it,\" March 23, 2020", "CNBC, \"Novartis paid Trump lawyer Michael Cohen $1.2 million for advice on Obamacare – work he was unable to do,\" May 9, 2018", "CNN, \"Michael Cohen sentenced to three years in prison after admitting he covered up Trump's 'dirty deeds,’\" Dec. 12, 2018", "C-SPAN, \"President Trump and Coronavirus Task Force Brief Reporters,\" March 19, 2020", "C-SPAN, \"President Trump and Coronavirus Task Force Hold News Conference,\" March 20, 2020", "Emailed statement from Novartis, April 7, 2020", "Facebook post, April 6, 2020", "Fox News, \"Giuliani: Doctors should decide if we use hydroxychloroquine,\" April 5, 2020", "Mediterranee Infection, \"Hydroxychloroquine and azithromycin as a treatment of COVID-19: results of an open-label non-randomized clinical trial,\" March 18, 2020", "Newsweek, \"Novartis responds to social media criticism of Trump administration promoting hydroxychloroquine,\" April 6, 2020", "The New York Times, \"Touting Virus Cure, ‘Simple Country Doctor’ Becomes a Right-Wing Star,\" April 2, 2020", "The New York Times, \"Trump’s Aggressive Advocacy of Malaria Drug for Treating Coronavirus Divides Medical Community,\" April 6, 2020", "Novartis, About page, accessed April 7, 2020", "Novartis, \"Novartis commits to donate up to 130 million doses of hydroxychloroquine to support the global COVID-19 pandemic response,\" March 20, 2020", "OpenSecrets.org, Rudy Giuliani’s 2007 Public Financial Disclosure Report, Feb. 5, 2007", "SEC.gov EDGAR, accessed April 7, 2020", "Tweet, April 5, 2020", "U.S. Department of Health and Human Services, \"HHS accepts donations of medicine to Strategic National Stockpile as possible treatments for COVID-19 patients,\" March 29, 2020", "U.S. Office of Government Ethics, Executive Branch Personnel Public Financial Disclosure Report: Donald Trump, May 16, 2016", "U.S. Office of Government Ethics, Executive Branch Personnel Public Financial Disclosure Report: Donald Trump, June 14, 2017", "U.S. Office of Government Ethics, Executive Branch Personnel Public Financial Disclosure Report: Donald Trump, May 15, 2018", "U.S. Office of Government Ethics, Executive Branch Personnel Public Financial Disclosure Report: Donald Trump, May 15, 2019", "Vox, \"Trump’s promotion of unproven drugs is cause for alarm, but not because he’s making money off it,\" April 7, 2020", "The Washington Post, \"Trump’s promotion of hydroxychloroquine is almost certainly about politics, not profits,\" April 7, 2020", "The White House, \"Remarks by President Trump at a Dinner with Global Chief Executive Officers | Davos, Switzerland,\" Jan. 21, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]