["The video was being posted here on Facebook on January 30, 2021. It has been viewed more than 1,300 times.", "The Indonesian-language post translates as: “Starting from February 5, 2021, in train stations and airports and public places, a fee of 5,000 to 10,000 rupiah per person for one test..Ge Nose C19”.", "“It turns out that Indonesia is no less great... Independent Indonesia !!!! Amazing !!!!”", "“The covid test is simple. Easy and cheap. Rp15,000, 10 seconds, accuracy 99.9%. You don't have to swab, you don't have to draw blood.”", "GeNose C 19 is a coronavirus breathalyser test developed by Gadjah Mada University in the Indonesian city of Yogyakarta.", "The same video with a similar claim has been viewed more than 550 times in other Facebook posts here, here, here and here alongside a similar claim.", "However, the claim is misleading.", "A keyword search found the original video was published by local media Detik.com on January, 23, 2021. The headline reads: “Minister Luhut Tries Advanced Covid-19 Detection Tool GeNose at Senen Station.”", "Luhut Binsar Pandjaitan is the coordinating minister of maritime affairs and investment.", "Senen Station is a train station in Jakarta.", "GeNose machines were installed at Senen Station in Jakarta and Tugu Station in Yogjakarta on February 5, 2021 as a cheaper alternative to the Covid-19 rapid antigen test required for train passengers, Indonesian news site Kompas reported. Each GeNose test costs 20,000 rupiah (US$1.42), while a rapid antigen test costs 105,000 rupiah (US$7.48).", "Kuwat Triyana, the head of GeNose development team at Gadjah Mada University, told AFP on February 5, 2021 by phone that the accuracy of GeNose is “around 95 percent” and it can detect Covid-19 within “45 seconds”.", "Indonesia’s Covid-19 task force spokesperson, Professor Wiku Adisasmito has said that GeNose is not an alternative to the PCR test. “Keep in mind that the GeNose method serves for screening and cannot replace the PCR test, which is used for diagnostics,” he said during a press briefing on January 28, 2021.", "Polymerase Chain Reaction (PCR) tests are the most common method for identifying Covid-19, as recommended by the WHO.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]