["About this rating", "On 7 November 2018, a man entered Borderline Bar & Grill in Thousand Oaks, California, and fatally shot twelve people. As law enforcement officials and emergency responders rushed to the scene in the immediate aftermath of the shooting, an Islamophobic and fear-mongering rumor began to circulate on social media about the identify of the shooter.", "Twitter user @ImPeterGriffinn (whose profile picture depicts the stripes of the American flag as guns), for instance, posted a photograph which supposedly showed the shooter and claimed that the gunman had been identified as a 28-year-old named Abu Al-Hom Kreuzi:", "Griffin eventually deleted that tweet, but he wasn't the only one to promulgate this baseless rumor. According to Charles Seife, a journalism professor at New York University who tracks the spread of online disinformation, this rumor originated with the Twitter account \"Republican Lives Matter.\" That tweet was also deleted but a screenshot can be glimpsed below:", "The rumor that the Borderline Bar shooter had been identified as a Middle Eastern man named Abu al-Hom Kreuzi did not originate with law enforcement officials or a credible news report. This claim was made up out of whole cloth by a group of internet trolls in the immediate aftermath of a mass shooting that left 13 people (including the shooter) dead.", "The actual suspect identified by police was a 28-year-old U.S. Marine Corps veteran named David Long:", "Ian David Long, 28, has been identified as the suspected gunman in the mass shooting at a Thousand Oaks nightclub.", "The shooting happened inside Borderline Bar & Grill. At least a dozen people were killed, including a sheriff's sergeant, Ron Helus. None of the other victims have been identified.", "Thursday morning, authorities said the gunman was found dead inside the nightclub. Ventura County Sheriff Geoff Dean said investigators believe Long fatally shot himself.", "A motive for the shooting is still unclear. Neighbors told investigators that Long was a veteran and may have suffered from PTSD:", "Investigators knocked on doors of surrounding residents to find out what they may know about Long. One neighbor who knew Long said he was a veteran who suffered from PTSD. She said, \"I don't know what he was doing with a gun.\" Others said Long lived at the home with his mother.", "Berman, Mark.   \"12 People Killed, Including Sheriff’s Deputy, In ‘Horrific’ California Bar Shooting.\"\r\n    The Washington Post.   8 November 2018.", "WLS-TV.   \"What We Know About Thousand Oaks Shooting Suspect, Ian David Long.\"\r\n    8 November 2018.", "We have removed and replaced a video that incorrectly identified the origin of the rumor about \"Abu Al-Hom Kreuzi.\"", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]