["About this rating", "In January 2021, during the final few days of Donald Trump's U.S. presidency, reports emerged online that former Democratic presidential candidate Hillary Clinton had suggested the outgoing president may have been influenced by his Russian counterpart Vladimir Putin in relation to the Jan. 6, 2021, attack on the U.S. Capitol by Trump supporters.", "The Democratic-majority House of Representatives impeached Trump on a charge of inciting insurrection for his role in encouraging his followers to descend upon the Capitol as members of Congress certified the electoral victory of President-elect Joe Biden — a victory that Trump had for months disputed, without evidence, as fraudulent and invalid.", "On Jan. 19, 2021, several outlets reported that Clinton, whom Trump defeated in the 2016 presidential election, had suggested Putin might have had an influence on the events of Jan. 6. Fox News, for example, published an article with the headline \"Clinton Suggests Putin May Have Known About Riot in Capitol, Pelosi Wants 9/11 Commission-Type Probe.\"", "The Daily Mail reported that: \"Hillary Clinton has suggested President Trump was 'talking to Vladimir Putin on the day of the Capitol riot' and said she would 'love to see his phone records.'\" Similar articles were published by the London Independent and Unilad.", "Those reports were accurate. During a Jan. 18, 2021, episode of Clinton's podcast \"You and Me Both,\" Clinton discussed the Capitol attack with House Speaker Nancy Pelosi, her guest on that episode. Clinton herself promoted the segment in question on Twitter. The following is a transcript of that segment:", "Clinton: We learned a lot about our system of government over the last four years, with a president who disdains democracy and, as you [Pelosi] have said numerous times, has other agendas. What they all are, I don't think we yet know. I hope historically we will find out who he's beholden to, who pulls his strings. I would love to see his phone records to see whether he was talking to Putin the day that the insurgents invaded our Capitol. But we now know that — not just him but his enablers, his accomplices, his cult members have the same disregard for democracy. Do you think we need a 9/11-type commission to investigate everything that they can pull together and explain what happened?", "Pelosi: I do. Let me, again — to your point of who is he beholden to — as I've said over and over, as I said to him in that picture with my blue suit, as I was leaving, what I was saying to him as I was pointing rudely at him: \"With you, Mr. President, all roads lead to Putin.\" I don't know what Putin has on him politically, financially, personally, but what happened last week was a gift to Putin —", "Clinton: That's right.", "Pelosi: — because Putin wants to undermine democracy in our country and throughout the world. And these people, unbeknownst to them, they're Putin puppets. They were doing Putin's business when they did that, at the incitement of an insurrection by the president of the United States.  [Emphasis is added].", "Clinton stated that Trump was \"beholden to\" certain figures who were \"pulling his strings,\" and then immediately remarked that, \"I would love to see his phone records to see whether he was talking to Putin the day that the insurgents invaded our Capitol.\" Without doubt, then, Clinton suggested that Trump had conducted a telephone call with Putin on the day of the attack on the Capitol, Jan. 6, and that Putin had an inappropriate and sinister influence on Trump.", "Snopes listened to the remainder of the podcast episode in order to see whether it contained any context or background that might cause a listener to reevaluate Clinton's remarks, or if she later retracted or qualified what she had said. None of those was the case. The quotations attributed to Clinton were therefore accurate and a fair representation of what she said.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]