["About this rating", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "Nearly a year after the coronavirus was first identified in the U.S., scientists around the world continued to work to characterize SARS-CoV-2 and the respiratory disease that it causes, COVID-19. And as health care providers raced to deliver vaccines in December 2020, the internet was rife with misinformation.", "One popular rumor claimed that eating burnt oranges would restore lost sense of smell and taste, a common symptom reported by people who contracted COVID-19.", "The claim was featured in a video shared on TikTok on Dec. 15, 2020, in which two women describe the “TikTok trick” as a “Christmas miracle.” The two roommates claimed they had COVID-19 at the time of filming and both lost their sense of smell. In the clip, the duo is seen blackening an unpeeled orange on the stovetop, peeling it, mushing it in a cup, adding brown sugar, and eating it.", "At the time of writing, the video had nearly 800,000 views. But despite its popularity, there is no evidence to suggest that eating any style of orange will restore a person’s loss of smell or taste due to COVID-19. In fact, science is only just beginning to understand the mechanisms behind why people lose their sense of smell from SARS-CoV-2 in the first place, much less how to restore it.", "Highly specialized sensory cells known as olfactory sensory neurons make up a small patch of tissues inside of the human nose, according to the National Institutes of Health. Each olfactory neuron has one odor receptor in the brain. As substances around the nose release microscopic molecules, the neurons stimulate receptors in the brain and send messages to identify the smell.", "To reach the olfactory sensory neurons, smells take one of two paths: either through the nostrils or via a channel that connects the roof of the throat to the nose. This is why scent plays such a large role in our sense of taste — chewing food releases molecules that the olfactory sensory neurons in the back of the throat can pick up on. But when this channel is blocked by an infection, the scent of food can be lost on the brain, a condition known as anosmia.", "The Centers for Disease Control and Prevention (CDC) listed a “new loss of taste or smell” as a symptom of COVID-19 and it is thought that COVID-19 infection creates an inflammation reaction inside the nose that leads to the loss of the olfactory neurons. And anosmia has been shown to be an indicator of viral spread at the community level, making it an important characteristic to track when tracing COVID-19 infection.", "Anosmia refers to the complete inability to detect odors, and viral anosmia isn’t unique to SARS-CoV-2. It has been determined to be a result of a number of different infections, from the common cold to a variety of human-infecting coronaviruses. In fact, viral infections have been shown to be associated with about 40% of adult anosmia cases — 15% of which are thought to be caused by a coronavirus strain.", "Anosmia and hyposmia (partial loss of smell) occur when upper respiratory infections damage sensitive nerve endings, resulting in either a temporary or permanent loss of taste or smell. But the exact mechanism behind how SARS-CoV-2, in particular, causes neurological conditions is only just beginning to unfold. Research suggested in 2020 that anywhere from 40% to 80% of COVID-19 patients will experience a loss of taste or smell.", "In July 2020, a team of researchers led by neuroscientists at Harvard Medical School determined that the olfactory cell types in the upper nasal cavity were the most vulnerable to SARS-CoV-2. Furthermore, olfactory sensory neurons do not express the gene that encodes ACE2 receptor protein, the protein that SARS-Cov-2 uses to enter human cells.", "Snopes spoke with Chelsae Larson, a special education teacher in Montana, who was diagnosed with COVID-19 on Oct. 20 and lost her sense of smell the day prior.", "“It happened very abruptly. I ate breakfast and lunch as normal and when I took a bite of my dinner, I could not taste or smell anything,” she said, noting that she suffered from anosmia. “I started to gain my senses back about six weeks after my results. I still do not have my taste and smell fully back and can only smell really strong scents.”", "And though Larson said that she has “eaten many oranges, tangerines, and various other fruits,” her sense of smell is still not 100% back nearly two months later.", "There is no one-size-fits-all solution when it comes to restoring anosmia. By and large, health experts agree that it comes down to the individual and their body’s ability to repair and regenerate damaged nerve endings.", "About 90% of patients will see an improvement in their sense of smell within four weeks of infection without incident, according to medical advice published in the British Medical Journal. Some medical practitioners recommend patients regularly smell strong odors or essential odors as a way to restore their olfactory system, a concept known as “olfactory training.” Providers also suggest that using some topical corticosteroid drops or sprays could help to restore the sense of smell.", "But until the sense of smell has been restored, experts recommend rigorously adhering to “use by” dates on food and drinks and ensuring all smoke alarms are functioning and tested regularly.", "Anosmia has been linked to mental health conditions like anxiety and depression, and support groups like Fifth Sense and AbScent can help people cope with these symptoms.", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]