["The photo was published in this Facebook post on January 2, 2019. It has been shared more than 6,200 times.", "Below is a screenshot of the misleading post:", "The Thai-language caption translates to English in part as: “What a pretentious country, bans plastic bags, but imports rubbish.”", "The text superimposed on the image translates to English as: “It enters our country every month from 81 countries worldwide, up to tens of thousands of tonnes monthly, is our country the #worldsbin?”", "The same photo was also shared here and here on Facebook alongside a similar claim.", "However, the photo has been shared in a misleading context.", "A reverse image search found that the photo was taken by AFP in Indonesia on June 19, 2019 and published on AFP Forum here.", "AFP's caption states that the photo shows officials inspecting a container \"loaded with a combination of garbage, plastic waste and hazardous materials\" that arrived in Batam, Indonesia in violation of import rules.", "Below is a screenshot comparison of the image in the misleading post (L) and the original AFP image (R):", "There is no official import category for \"general waste\", Thailand's customs department told AFP, although certain waste materials, for example some categories of plastic scraps, can be imported.", "Prakob Vivitjinda, Director General of the Department of Industrial Works said in a statement sent by email to AFP on January 8, 2020:\n\t“The import of plastic waste into the country is not allowed. Thailand has only authorised the import of plastic scraps that can be used as raw materials for new plastic products.\"", "Thailand currently imports plastic scraps from 81 countries, according to research by local NGO Ecological Alert and Recovery.", "“81 is actually the number of countries that Thailand has imported used plastic scraps from between 2014 and 2018, not the general waste data,” Penchom Sae-Tang, Thailand director for  Ecological Alert and Recovery, told AFP by phone on January 15, 2020.", "Sae-Tang provided a research document compiled by her agency titled: “The Imported Waste and Used Products in Thailand for Sustainable Waste Management.\"", "The report, translated from Thai to English, states that over the past five years, the total amount of used plastic imported to Thailand \"from 81 countries is 906,521 tonnes.”", "Japan was the biggest exporter of plastic scraps to Thailand, according to the document, followed by Hong Kong, the USA, Australia and China.", "Below is a screenshot of the data presented in the document:", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]