["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Democratic presidential candidate and former Vice President Joe Biden and his running mate Sen. Kamala Harris, D-Calif., participate in a virtual fundraiser at the Hotel DuPont in Wilmington, Del., on Aug. 12, 2020. (AP/Kaster)", "Biden didn’t say he will raise taxes on everyone. When a member of a crowd said they had benefited from the Republican-led tax bill, Biden responded, “Guess what, if you elect me, your taxes are going to be raised, not cut, if you benefited from that.”", "Biden’s plan seeks to raise up to $4 trillion in tax revenues over a decade. His proposed increases are more than Hillary Clinton’s in 2016, but they are heavily concentrated on corporations and the nation’s highest earners.", "A new ad from a pro-Trump super PAC uses out-of-context footage of Joe Biden to claim that the former vice president wants to raise taxes for Americans across the board.", "Versions of the ad from America First Action began airing Aug. 4 on Facebook and on TV screens in Wisconsin and North Carolina. They focus largely on a comment Biden made in response to a voter during a February campaign stop in South Carolina.", "But the America First Action ad presents that remark out of context. And while some tax experts estimate that Biden’s plan would mean higher taxes on average for all income groups, those increases would be relatively small for all but the biggest earners.", "The 30-second version of the ad opens with a narrator saying, \"Sometimes, politicians accidentally tell the truth,\" before cutting to the clip of Biden from the South Carolina event.", "\"Guess what, if you elect me, your taxes are going to be raised, not cut,\" Biden says. The ad replays the clip later, in between additional narration.", "\"The New York Times says Biden’s tax increases are more than double Hillary Clinton’s plan. Even the Tax Policy Center admits taxes would increase ‘on all income groups,’\" the narrator says, before showing the clip a second time. \"Big tax increases, crushing our recovery.\"", "The spot finishes with Biden saying, \"It could go higher.\"", "America First Action’s portrayal of Biden’s comments in South Carolina gives the impression that Biden told a crowd that all Americans would have their tax rates raised on his watch.", "That’s not the case. When Biden said \"your taxes are going to be raised, not cut,\" he wasn’t talking about his plan for all taxpayers. He was addressing one person at the February event.", "The person indicated that they had benefited from the Republican-led tax bill that became law under President Donald Trump.", "The exchange took place after Biden said, \"By the way, how many of you did really well with that $1.9 trillion tax cut? Really good shape, right?\" The crowd mostly laughed or groaned, but one member of the audience caught Biden’s attention off camera by signaling that they benefited.", "Addressing that person directly, Biden said: \"Well, you did. Well, that’s good. I’m glad to see you’re doing well already. But guess what, if you elect me, your taxes are going to be raised, not cut, if you benefited from that.\"", "The full exchange shows that Biden was saying his plan would raise taxes for people who, in his words, \"benefited from\" the GOP’s Tax Cuts and Jobs Act of 2017. A Biden campaign official said his point was that the wealthy — not all Americans — would not benefit from his plan.", "The ad’s portrayal of the exchange leaves a different impression.", "The same could be said of the ad’s second clip of Biden, in which he says, \"It could go higher.\"", "The ad doesn’t specify what Biden was referring to when he made the remark. But the complete December interview with CNBC shows that Biden was talking specifically about the top tax rate for capital gains, the profits earned from selling property or investments, which are often taxed at a lower rate than ordinary income.", "\"We should charge people the same tax for their capital gains as their tax rate is,\" Biden said. \"And I think we should raise the tax rate back to, for example, I take it back to where it was before it was reduced. It could go higher.\"", "America First Action frames Biden’s tax plan as providing increases that \"are more than double Hillary Clinton’s plan\" and would impact \"all income groups.\"", "The ad cites a report from the New York Times and an editorial from the Wall Street Journal, both published in December, as well as a March 5 analysis from the Tax Policy Center, an independent group that models the effects of tax legislation.", "The New York Times said Biden was proposing more than double the tax increases proposed by Clinton, the Democratic presidential nominee in 2016. That’s accurate, said Gordon Mermin, a senior research associate at the Tax Policy Center and co-author of the March analysis.", "The Tax Policy Center estimated that Biden’s proposals would raise revenues by 1.5% of gross domestic product over 10 years, Mermin said, citing what he said is the preferred metric for comparing across time. The group’s analysis of the Clinton plan put that figure at 0.6% of GDP.", "But the America First Action ad was less exact in its claim that \"even the Tax Policy Center admits taxes would increase ‘on all income groups.’\" As FactCheck.org noted, that’s a partial quote from the group’s March report.", "The full sentence from the report said: \"In 2021, the proposals would increase taxes on average on all income groups, but the highest-income households would see substantially larger increases, both in dollar amounts and as a share of their incomes.\"", "Biden has publicly vowed not to raise taxes for those making less than $400,000 per year. His plan aims to raise up to $4 trillion in tax revenues over a decade, according to the Tax Policy Center, in part by rolling back some of the GOP-led tax law’s tax cuts for corporations and for people with taxable incomes over $400,000.", "Among Biden’s proposed changes, he would:", "Increase the top corporate tax rate to 28% from 21%.", "Raise the top individual federal income tax rate to 39.6%.", "Place a 12.4% Social Security tax on incomes above $400,000.", "Tax capital gains at the same rate as ordinary income for very high earners.", "The highest earners would bear the brunt of the new tax burden brought on by Biden’s plan, according to the Tax Policy Center and other analyses of his proposals. The plan would lead to \"small, modest increases\" in costs for lower-income groups, Mermin said.", "But as we’ve reported, those changes would not be because of higher federal income tax rates across the board.", "\"Those small tax increases for the first four quintiles — and this is said in our brief — are almost all due to the indirect effects of the increase in the corporate tax rate,\" Mermin said, including lowered wages for workers.", "On average, the Tax Policy Center’s March report predicted that the bottom 80% of earners could wind up paying between $30 and $590 extra annually on Biden’s watch. It estimated that over 90% of the tax increases would be borne by the top 20% of earners.", "\"No direct taxes are imposed on any household making less than $400,000 per year,\" the Committee for a Responsible Federal Budget wrote in its analysis of Biden’s plan.", "RELATED: Facebook post wrongly claims Biden would hike tax rates for family earning $75,000", "Biden has also added to his proposals since March, Mermin said, including pitching some tax credits that \"could potentially offset some of these increases for the middle-income folks.\"", "An America First Action ad showed Biden saying, \"Guess what, if you elect me, your taxes are going to be raised, not cut.\"", "The ad takes his words out of context. Biden was not speaking about the impact of his plan on all Americans.", "The comment came during a South Carolina event, when a member of his crowd said he or she had benefited from the GOP-led tax bill. The full context of the quote shows Biden saying that individual’s taxes would be \"raised, not cut, if you benefited from that.\"", "We rate this ad’s main claim Mostly False.", "America First Action on Facebook, Aug. 4, 2020", "America First Action Super PAC on YouTube, \"Too Risky (NC),\" Aug. 4, 2020", "Factcheck.org, \"Republican Group Selectively Edits Biden Tax Remark,\" Aug. 7, 2020", "America First Action, \"America First Action Launches New Anti-Biden Ads In PA, WI and NC,\" Aug. 4, 2020", "Committee for a Responsible Federal Budget, \"Understanding Joe Biden's 2020 Tax Plan,\" July 30, 2020", "The Tax Foundation, \"Details and Analysis of Former Vice President Biden’s Tax Proposals,\" April 29, 2020", "Tax Policy Center, \"An Analysis of Former Vice President Biden’s Tax Proposals,\" March 5, 2020", "Forbes, \"Biden Would Raise Taxes By $4 Trillion Over 10 Years, Mostly On The Highest-Income Households,\" March 5, 2020", "WCNC on YouTube, \"Joe Biden in Conway, South Carolina,\" Feb. 27, 2020", "The University of Pennsylvania, \"The Biden Tax Plan: Budgetary, Distributional, and Economic Effects,\" Jan. 23, 2020", "The Wall Street Journal, \"Joe Biden’s ‘Modest’ Tax Proposal,\" Dec. 18, 2019", "CNBC, \"Joe Biden says Trump is ‘ripping the soul out of this country’ and ‘we’re likely to inherit a recession,'\" Dec. 6, 2019", "The New York Times, \"Biden Proposes Smaller Tax Increases Than Rivals Do,\" Dec. 4, 2019", "PolitiFact, \"Facebook post wrongly claims Biden would hike tax rates for family earning $75,000,\" Aug. 20, 2020", "PolitiFact, \"Is there no policy daylight between Joe Biden and Bernie Sanders, as RNC says?\" March 10, 2020", "Email correspondence with the Biden campaign, Aug. 13, 2020", "Email interview with Kelly Sadler, communications director for America First Action, Aug. 12, 2020", "Phone interview with Gordon Mermin, a senior research associate in the Urban-Brookings Tax Policy Center at the Urban Institute, Aug. 14, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]