["About this rating", "In late March 2017, a Maine cremation business's giveaway became fodder for online memes before the company's Facebook page was apparently taken offline, prompting questions over whether the company was legitimate to begin with.", "Downeast Direct Cremation has offered free cremations in giveaways since first opening in 2014. The company does exist - we spoke to the owner, Cynthia Scally on 28 March 2017; the local Chamber of Commerce also confirmed that it is active - but it apparently departed the social media platform after we contacted her.", "A \"Nihilist Memes\" group prompted our inquiry after sharing a 2015 post on the company's page celebrating Charlie Taylor winning the $975 service in a giveaway. Scally told us that pictures of previous contest winners have been shared before, with one reaching a \"near-viral state.\"", "A picture of another contest winner, Lynne Snow, can be found on me.me, which allows users to find \"dank memes.\" Snow's picture was also shared on Facebook by a user who cracked, \"If this WERE a Monty Python skit - it might just sound something like this ...\"", "Other wags online have poked fun of the company for even offering the service:", "The service includes picking up the deceased from their place of death and completing legal documentation associated with the process, on top of the actual cremation. The company's web site also provides a \"homework\" page for prospective customers.", "Scally said she has seen some of the comments directed toward the winners after they are spread online, adding, \"They're not the greatest.\" We contacted her again seeking confirmation on whether the disappearance of the company's Facebook page was related to being \"featured\" by the meme group and are awaiting a reply.", "Kaye, Nick. \"Downeast Direct Cremation caters to growing trend in Maine.\" Bangor Daily News. 21 July 2014.", "\"All About Maine : Downeast Direct Cremation.\" YouTube. Uploaded by Downeast Direct Creation. 3 April 2016.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]