["About this rating", "In March 2018, a series of news articles sparked reports that a group of doctors in Canada were resisting and protesting against a pay increase offered to them by the provincial government in Quebec:", "Hundreds of Canadian doctors, medical specialists and residents, as well as medical students, have signed a petition protesting their own pay raises, instead asking that the money be reallocated to help nurses and patients in need.", "\"We, Quebec doctors who believe in a strong public system, oppose the recent salary increases negotiated by our medical federations,\" reads the letter, originally posted in French, the official language in the Canadian province.", "It is true that hundreds of doctors signed the petition, but the group opposing the deals makes up only a small fraction of all the doctors in the province of Quebec, a piece of context not mentioned in most reports.", "On 25 February 2018, MQRP (which stands for Médecins Québécois pour le Régime Public, or Quebecois Doctors for the Public Plan, a group of 500 Quebecois doctors dedicated to retaining the province's universal public health system) published an open letter explaining their opposition to pay hikes negotiated between doctors' unions and the provincial government.", "These increases are all the more shocking given that our fellow nurses, clerks and other employees are suffering very difficult working conditions, while our patients live with the lack of access to needed services caused by the draconian cuts of recent years, and the centralization of power at the Ministry of Health. The only thing that seems to be immune to cuts is our pay.", "...We Quebecois doctors demand that the pay increases granted be cancelled and the resources of the system be better distributed for the benefit of all health workers and to ensure the system of healthcare that the people of Quebec deserve.", "As of 21 March, the letter had garnered 944 signatures from people describing themselves as doctors or medical students. It's not clear whether or how MQRP is able to prevent someone who is not a registered medical professional from signing the online petition, so we can't be sure how many of the names listed under the letter actually belong to health professionals. Even if they all do, the 944 names listed on 21 March 2018 would still make up only 4.5 percent of the total number of doctors in Quebec. (According to the Collège des Médecins du Quebec, the standards-setting professional body for doctors in Quebec, there are nearly 21,000 active, registered doctors in the province as of 1 January 2018.)", "Canada's CBC News reported that the provincial government had struck two major pay deals with doctors:", "As part of a deal reached earlier this month, the province's 10,000 medical specialists will see their annual salary rise from $4.7 billion to $5.4 billion in 2023, an increase of 1.4 per cent each year.", "According to data compiled by the Canadian Institute for Health Information, specialists in Quebec make, on average, $403,537 a year, compared to $367,154 in Ontario.", "Quebec's GPs signed an eight-year deal with the province last October that sees their pay increase by an average of 1.8 per cent per year.", "The group has scheduled a protest in Montreal on 24 March, listing among its demands \"the cancellation of the doctors' pay increases, as well as a public consultation on the terms and payments granted to doctors by Quebecois society.\"", "Criss, Doug; Hassan, Carma.  \"Hundreds of Doctors in Canada Are Protesting. They Say They Make Too Much.\"\r\n  CNN.  8 March 2018.", "Kassam, Ashifa.  \"Canadian Doctors: Cancel Our Pay Rise and Spend Money Elsewhere.\"\r\n  The Guardian.  9 March 2018.", "Sit, Ryan.  \"500 Canadian Doctors Protest Pay Raises Because They Already Make Too Much Money.\"\r\n  Newsweek.  7 March 2018.", "Le Conseil d'Administration de MQRP.  \"Nous Demandons l'Annulation Des Hausses.\"\r\n  Médecins Québécois Pour le Régime Public.  25 February 2018.", "CBC News.  \"Doctors Tell Quebec Government They Don't Want Pay Increase.\"\r\n  CBC News.  26 February 2018.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]