["“With all the food and pet products now coming from China, it is best to make sure you read the label,” claims one version of the posts shared thousands of times since mid-April 2020. “BUY USA & CANADIAN MADE by watching for ‘0’ at the beginning of the number,” it claims.", "“Very simple: Pick up a product. Look at the barcode. If the first 3 numbers are 690 or 691 or 692, the product was made in China,” claims another version of the posts which implore people to “Buy American.”", "The misinformation is not new -- fact-checking organization Snopes addressed the topic as far back as 2008 -- but according to social media monitor CrowdTangle, posts making these claims have been shared thousands of times in North America in April 2020 including, on Facebook here, here and here and on Instagram here and here.", "The posts surfaced as US states and Canadian provinces ordered residents to stay at home, causing huge spikes in unemployment, but they do not accurately explain barcode prefixes.", "“The information being spread is inaccurate,” according to Shannon Sullivan, senior director for public relations at GS1 US, a non-profit organization that issues company prefixes for barcodes.", "Companies wishing to create a Global Trade Item Number to uniquely identify products through barcoding must register for a company prefix.", "“The company prefix does not determine the country in which a product was manufactured – it only indicates the country where the company prefix was obtained,” Sullivan said.", "This was confirmed by Andy Verb, president and owner of Bar Code Graphics, Inc.", "“Where the product is sourced is not a factor with GS1 company prefixes,” Verb told AFP by email.", "This list details the prefixes assigned to different countries, but clearly states: “Note that since GS1 member companies can manufacture products anywhere in the world, GS1 prefixes do not identify the country of origin for a given product.”", "Consumers wanting to buy American products can look for a “Made in America” designation on a product. The US Federal Trade Commission oversees companies to ensure they comply with standards to market their products as “Made in America.”", "In Canada there are separate guidelines for companies wishing to make “Product of Canada” or “Made in Canada” claims. The Canadian Food Inspection Agency said: “Products that contain foreign ingredients, regardless of their source, are not eligible to bear a ‘Product of Canada’ claim.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]