["After clauses of the Motor Vehicle (Amendment) Act, 2019 came into effect from September 1, videos of clashes involving policemen have been posted on social media with false contexts. A video showing a brawl between men in khaki uniforms has now been shared on Twitter and Facebook, with the caption, “चालान के पैसे का बँटवारे के लिए पुलिस वाले आपस में ही भीड़ गए” (“Policemen clash among themselves over sharing of fines collected”- translation).", "चालान के पैसे का बँटवारे के लिए पुलिस वाले आपस में ही भीड़ गए", "चालान के पैसे का बँटवारे के लिए पुलिस वाले आपस में ही भीड़ गए", "Posted by Sarcasm TV Humour on Tuesday, September 10, 2019", "The above post is from the page Sarcasm TV Humour. It has also been posted on another page, Bollywood First. The 36 second long video clip has also been shared on Twitter.", "चालान के पैसे का बँटवाड़ा के लिए जब पुलिस आपस में ही लड़ मरी🤭🤸😂🤣🤫🤔😬👇#गुंडा_टैक्स pic.twitter.com/bETIollhQq", "— CPभाईYADAV (@cp4bhai) September 9, 2019", "Alt News took a frame from the video and reverse-searched the same on Google using specific key words. The result threw up an article by Deccan Chronicle, dated June 27, 2016, pertaining to the same incident. It was titled, ‘Watch: Uttar Pradesh cops fight over share of bribe, suspended’. The incident had occurred in Lucknow, UP.", "According to the report, four policemen posted at an important intersection in Lucknow were caught on camera fighting on the street. The brawl was reportedly over sharing of bribe collected from the local street vendors. A homeguard too was involved in the fight. The video was posted by ANI on Twitter on the same day. The incident was also reported by The Quint.", "#WATCH: Policemen in Lucknow scuffle on road over a share of bribehttps://t.co/2WtbP1i8O1", "— ANI UP (@ANINewsUP) June 26, 2016", "It may be noted that the video depicts a brawl between policemen which took place in June 2016 in Lucknow. The fight was regarding disagreement over sharing of bribe collected from local vendors. The video has now been shared in the context of the new motor vehicles act which prescribes steep penalties for traffic rule violations.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]