["About this rating", "As Senate Democrats forged forward on a voting rights bill, titled \"For the People Act 2021,\" in late March, they faced fierce opposition from Republicans.", "On March 24, 2021, U.S. Sen. Chuck Schumer criticized state legislatures for working on laws that he argued would disenfranchise Black voters, specifically by limiting voting on Sunday, a day when churches with majority Black congregations host events like Souls to the Polls. He received a rebuke from Mississippi Sen. Cindy Hyde-Smith, which soon went viral.", "In the above tweet, author Stephen King incorrectly said Hyde-Smith is a Georgia senator, when in fact, she represents Mississippi. But on March 24, 2021, Hyde-Smith did express the sentiment in so many words that states should not hold voter events on Sunday because it is the Sabbath.", "She was responding to Schumer, who had criticized Georgia lawmakers for attempting to suppress early voting on Sundays, which would specifically affect Black communities whose churches have a history of using Sundays to encourage voters to cast their ballots.", "Schumer said: “Why did the Georgia legislature only pick Sundays to say there should be no early voting on Sunday? We know why. It’s because that’s the day African Americans vote in the ‘Souls to the Poll’ operation where they go from church to vote. It’s despicable.”", "Later, during a Senate Committee hearing, Hyde-Smith said she wanted to address Schumer’s comments. Her full remarks:", "Senator Schumer's question was, he was wondering why on Sundays, Georgia would not participate in an electoral process of gathering signatures of registration and things on Sunday and I would just like to respond to that. Georgia is a southern state just like Mississippi. I cannot speak for Georgia, but I can speak for Mississippi on why we would never do that on a Sunday or hold an election on a Sunday.", "[Holds up a dollar bill]", "You know this is our currency, this is a dollar bill. This says, ‘The United States of America In God We Trust.’ Etched in stone in the U.S. Senate chamber is ‘In God We Trust.’ When you swore in all of these witnesses, the last thing you said to them in your instructions was, ‘so help you God.’ In God's word in Exodus 20:18. it says remember the Sabbath, and keep it holy. So that is my response to Senator Schumer.", "Schumer responded that observing the Sabbath on Sundays is not, strictly speaking, biblical, if one is citing the Old Testament as one's source. \"I'll start by reminding my colleague of the separation between church and state,\" Schumer said on the Senate floor, \"and frankly, the Bible passage she talked about comes from the Old Testament when the Sabbath was on Saturday.\"", "Indeed, Jews still observe the Sabbath on Saturdays, as do Seventh-Day Adventists and several other Christian denominations.", "Hyde-Smith made her remarks around 25 seconds into the video below:", "She clearly stated that Mississippi would not hold election events on Sundays because of the Sabbath, and that the day should be devoted to God.", "Since this debate, legislators in Georgia backed down on restricting early voting on Sundays. The current version of legislation now requires that during the three-week early voting period in the state, counties would be required to offer early voting on the two Saturdays in that period, and makes it optional on Sundays.", "While Hyde-Smith did not explicitly say the words paraphrased in Stephen King’s tweet, she expressed the same sentiment. We rate this claim as “True.”", "Update [March 26, 2021]: Added Schumer's rebuttal concerning the the Old Testament's version of the Sabbath.", "Nur Nasreen Ibrahim is a reporter with experience working in television, international news coverage, fact checking, and creative writing.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]