["About this rating", "A fatal case of hantavirus infection occurred in China in March 2020.", "Though rare, a single human case of hantavirus infection, which is spread by rodents, is neither an \"outbreak\" nor a new phenomenon.", "A man who passed away in China's Yunnan Province tested positive for hantavirus, a rare type of virus transmitted from rodents to humans, and news reports about that event raised fears that a new disease outbreak was looming.", "The reports came in late March 2020, as the world was reeling from the global COVID-19 pandemic caused by the spread of a novel coronavirus first detected in Wuhan, China, in the winter of 2019. Much of the hantavirus anxiety appears to have been sparked by a tweet from Global Times, an English-language publication based in China.\n\nThe tweet sparked viral memes and fears that, even as hundreds of thousands of COVID-19 cases are being reported worldwide and illnesses and deaths caused by the coronavirus continue to rise in the United States, a second disease outbreak was looming. Here is an example of a meme spreading on Twitter in late March (the user's name has been cropped out to protect privacy):\nHowever, a single reported case of hantavirus in China does not an outbreak make, and hantaviruses are hardly new. They go back decades and aren't transmitted between humans like COVID-19. Instead, hantaviruses are spread from rodents to humans, and cases are extremely rare. The first strain of hantavirus was recorded during the Korean war, when it killed 190 American G.I.'s and sickened about 3,000.", "With rare exception, rodents are the hosts that transmit the disease to humans, through \"urine, feces, and saliva, and less frequently by a bite from an infected host,\" according to the Centers for Disease Control and Prevention (CDC).", "The most common type of hantavirus illness found in the United States is Hantavirus Pulmonary Syndrome (HPS), the CDC says, and again, it's rare. HPS was first discovered by health professionals in 1993 in the Southwest region of the U.S. Researchers traced the earliest case to the death of a 38-year-old man in Utah in 1959. From 1993 to 2017, the U.S. had 728 known cases, per the CDC.", "HPS is serious, resulting in fever, muscle aches, and pneumonia. It has a mortality rate of 38%, which is drastically higher than the 0.1% mortality rate of the seasonal flu.", "A second type of illness caused by a hantavirus is Hemorrhagic Fever with Renal Syndrome (HFRS). This disease is found mostly in Eastern Asia and Europe, but not in the Americas.", "In contrast to hantavirus illnesses, COVID-19 has encircled the globe in a matter of months since its initial detection in late 2019. As of this writing on March 24, 2020, more than 400,000 cases worldwide and 50,000 in the U.S. have been reported.", "Because hantavirus is not new and because it isn't transmitted between humans, no one should fear that a new outbreak of disease caused by hantavirus is looming. We therefore rate this claim \"False.\"", "Centers for Disease Control and Prevention. \"Hantavirus.\"", "The Associated Press. \"Outbreak Of Hanta Is Unusual.\"\r\n  17 June 1997.", "Miller, Ryan W. \"A Case of Hantavirus has Been Reported in China. Here's Why You Shouldn't Worry.\"\r\n  USA Today. 24 March 2020.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]