["About this rating", "In early September 2020, several people asked Snopes if U.S. President Donald Trump told his former press secretary Sarah Huckabee Sanders to take \"one for the team\" after North Korea's leader, Kim Jong-un, apparently winked at her during an international summit in 2018.", "At the root of the readers' question was this: Did the president at one point support Kim supposedly flirting with Sanders if it opened the door to a stronger relationship between his administration and North Korea?", "We cannot directly answer that question for two reasons: No transcript of the alleged conversation appeared to exist, and any attempt to dissect the intention of such a comment, perhaps under a veil of humor, would be anything but scientific.", "But we can address what appeared to be the source of the inquiries from Snopes readers: a retelling of events by Sanders herself that was widely published by media outlets in September 2020.", "More than two years after the alleged encounter, several media outlets including Fox News, The New York Times, The Guardian, and National Public Radio reported on sections of a book written by Sanders titled, \"Speaking for Myself: Faith, Freedom, and the Fight of Our Lives Inside the Trump White House,\" that were apparently released before the book's planned launch date of Sept. 8, 2020.", "In those excerpts, Sanders purportedly describes a summit in Singapore in June 2018 where — as she was taking notes on a conversation between Kim and Trump — she briefly looked up and noticed Kim staring at her, the news reports stated. Then, per The Guardian, which said it obtained a full copy of the book and was cited by Fox News, Sanders wrote of the meeting with Kim:", "We made direct eye contact and Kim nodded and appeared to wink at me. I was stunned. I quickly looked down and continued taking notes. … All I could think was, ‘What just happened? Surely Kim Jong-un did not just mark me!?'", "Later, she reportedly told Trump and his chief of staff at the time, John Kelly, about what had happened while they were in the presidential limousine, on their way back to Air Force One. And, according to her story reported by The Guardian, that conversation including the commander-in-chief went like this:", "'Kim Jong-un hit on you!' Trump said. 'He did! He fucking hit on you!'", "Sanders, a devout Christian who discusses her faith throughout her book, does not spell out the presidential expletive. But she does write that she told Trump that was not what she meant, and said: “Sir, please stop.”", "Kelly backed up the president and Trump joked: “Well, Sarah, that settles it. You’re going to North Korea and taking one for the team! Your husband and kids will miss you, but you’ll be a hero to your country!”", "Trump and Kelly, Sanders writes, “howled with laughter” as the car drove on.", "Given that play-by-play based on excerpts of Sanders' book, we rate this claim \"Correct Attribution\" — she did indeed say Trump told her to take \"one for the team\" after the leader of North Korea apparently winked at her.", "Haberman, Maggie.   \"Sanders Says Trump Joked About Her 'Taking One for the Team' With Kim Jong-un.\"\r\n   New York Times.   2 September 2020.", "Pengelly, Martin.   \"Trump Told Sarah Sanders to 'Take One For The Team' After Kim Jong-un Wink.\"\r\n    The Guardian.   2 September 2020.", "Stimson, Brie.   \"Trump Joked Sarah Sanders Should 'Take One For The Team' After Kim Jong Un Wink, Her Book Says.\"\r\n   Fox News.   3 September 2020.", "Ordoñez, Franco.   \"In Memoir, Sarah Huckabee Sanders Shows She's All In With Trump.\"\r\n   NPR.   3 September 2020.", "Allen, Mike.   \"Sarah Sanders Says John Bolton Was 'Drunk On Power.\"\r\n   Axios.   22 June 2020.", "Colson, Thomas.   \"Sarah Huckabee Sanders Says Trump Told Her To Go To North Korea And Take 'One For The Team' After Kim Jong Un Winked At Her.\"\r\n   Business Insider.   2 September 2020.", "Jessica Lee is Snopes' Senior Assignments Editor with expertise in investigative storytelling, media literacy advocacy and digital audience engagement.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]