["The one-minute six-second video was published on Facebook here on June 15, 2020. It has been viewed more than 1,800 times.", "The post’s Urdu-language caption translates to English as: “Look at the plight of corona patients at Central Hospital, Rawalpindi and have mercy on yourself. For God’s sake there is no room in the hospitals of Rawalpindi-Islamabad. In this heat of June look at the condition of patients under the open sky and take precautions.”", "The same video was also shared thousands of times alongside a similar claim on Facebook here, here, here, here, here and here.", "The claim is false. The footage in fact shows patients from a hospital in Lahore on June 13 after a fire broke out.", "A reverse Google image search with video keyframes extracted with InVID-WeVerify, a digital verification tool, found screenshots from the footage were published on Twitter here. The tweet was published by Lahore-based journalist Madiha Abid Ali, who reported on the fire and debunked the misleading claim.", "“A day before yesterday fire erupted in the operation theatre of the multi-storey emergency ward building of the Services Hospital Lahore. Few people are circulating the video and relating it with #COVID19 situation. Please beware of #FakeNews #FakeNewsAlert,” the tweet reads.", "A Google user's image of the Services Hospital Lahore tagged at the location on Google Maps also matches the building seen in the video shared in the misleading posts.", "Below is a screenshot comparison of a Google user's image of the Services Hospital Lahore (L) and the video in the misleading Facebook post (R) with corresponding features circled in red:", "A spokesperson for the Punjab Government’s Rescue 1122 emergency service told AFP that a fire broke out at the hospital on June 13.", "“The fire started in the rear portion of the ICU (Intensive Care Unit). When smoke started entering the ward, patients were timely evacuated from the building,” Deeba Shahnaz, the service’s chief public information officer, told AFP by phone on June 19, 2020.", "Shahnaz said the government was aware that footage from the evacuation was being shared alongside a claim about “coronavirus patients at another hospital” and said the claim is “not true.”", "Punjab Chief Minister Usman Buzdar also said there had been a fire at the hospital on June 13, 2020 in this statement published the same day. He subsequently ordered an investigation, calling for officials to provide medical support to patients.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]