["About this rating", "On 21 April 2017, widespread electrical outages in New York and San Francisco (and erroneous reports of a third in Los Angeles) prompted some to assume that the blackouts were conspiratorial in nature. Conspiracy web site SuperStation95 weighed in with a fear-mongering headline: \"U.S. Power Grid Under Cyber-Attack? Power Outages in NYC, SF, LA\" and cited an unnamed source that they claimed was from the Department of Homeland Security (DHS):", "A series of power outages in Los Angeles, San Francisco, and New York City left commuters stranded and traffic backed up on Friday. Although the outages occurred around the same time, there is no evidence (yet) that they were connected by anything more than coincidence. Given the sudden and unusual nature of the outages, SuperStation95 inquired of our sources in the Department of Homeland Security who told us:", "\"On their face, these power outages are a little too coincidental to be naturally occurring. We can confirm we are looking for evidence of Cyber-Attack . . . and we think we'll find it.\"", "Gillian Christensen, acting press secretary for DHS, told us in an e-mail that the quote was not made by a DHS spokesperson and DHS does not view the outages as resulting from a cyber attack.", "We contacted spokespersons for Pacific Gas & Electric, the power company that provides electricity in San Francisco, and Con Ed, which provides power to New York City. The outages, though both coincidentally occurring on the morning of 21 April 2017, were not related and were caused by mechanical failures as opposed to a cyber attack.", "Although we were unable to immediately reach a spokesperson for Los Angeles Department of Water and Power, a local news report noted that the referenced outage was yet another unrelated mechanical failure (apparently tied to ongoing construction work) that caused lights to go out in Century City, a community just south of Los Angeles. Moreover, that outage did not coincide with the ones in New York and San Francisco but rather occurred one day earlier.", "The outage in San Francisco started just after 9 a.m. local time and affected 88,000 customers, PG&E spokeswoman Jacqueline Ratto told us. The outage was caused by an overloaded circuit breaker at the company's Larkin substation that sparked a fire. A spokesman for Con Ed said the outage in New York that stranded morning subway commuters around 7:30 a.m. local time (several hours before San Francisco's) was caused by a service line failure. Crews are still looking into the ultimate cause of that outage. CBS New York reported the outages happened after the nation had been given a poor infrastructure score by the American Society of Civil Engineers.", "Patch.com, a web site that covers local communities in Southern California, reported that power went out at about 9:30 a.m. local time in Century City affecting about 500 customers. That outage was caused by an accident: construction workers struck LADWP equipment near the intersection of Constellation Boulevard and Avenue of the Stars on 20 April 2017. All customers affected by outages in all three cities were back online the same day after repair crews worked for hours to restore electricity.", "Although two of the three outages happened on the same morning in different locations (and a third took place the day before) we found no evidence that there was any connection between them. They all seemed to have been caused by physical equipment failures (or an aging infrastructure), as opposed to a hacking attack on \"the grid.\"", "SuperStation95. \"U.S. Power Grid Under Cyber-Attack? Power Outages in NYC, SF, LA Featured.\"\r\n  21 April 2017.", "Sage, Alexandria, and Randewich, Noel. \"Power Outage Cripples San Francisco for Seven Hours.\"\r\n  Reuters. 22 April 2017.", "CBS New York. \"Major Power Outages in New York City, San Francisco Come Amid Worries About Failing Infrastructure.\"\r\n  21 April 2017.", "Rosenberg, Eli. \"Why a Midtown Power Failure Snarled Your Morning Subway Commute.\"\r\n  The New York Times. 21 Apirl 2017.", "Patch.com. \"Hours-Long Century City Power Outage Affects High Rises, Residents.\"\r\n  20 April 2017.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]