["About this rating", "On 4 March 2017, several dubious news outlets reported that a Japanese man was killed when a six-ton pile of porn he had amassed in his apartment fell and crushed him.", "While it is true that a Japanese man died in his apartment amidst tons of pornography, the Japanese news website Nikkan Spa!, originally reported that he actually died of a heart attack. Further, despite reports that the man was not found for six months after his death, the Nikkan-Spa! simply reported that the unidentified man's body was found a month later.", "Gruesomely, the story notes that the pornography soaked up his \"body fluids,\" which would normally cause an odor and alert neighbors of his death. \"Although it is nightmare talk, this is reality,\" the article says.", "The phenomenon of solitary deaths, or kodokushi, has been a concern in Japan since at least 2005:", "According to the Japan Quality of Life Survey, conducted in 2013 by the Japanese government’s Economic and Social Research Institute, 32% of respondents reported that they were somewhat or very concerned about dying alone. According to our own analysis of the data, the worries are negatively correlated with subjective well-being. Worries about solitary death show one of the highest negative correlations with happiness.", "Japanese national broadcasting company NHK tied the phenomenon to a society without bonds, where people have lost their connection to family, neighbors, and colleagues.", "nikkan-spa.jp.\r\n   \"A Lonely Death Surrounded by a Large Amount of Erotic Books.\"  28 February 2017.", "Kohlbacher, Florian and Tiefenbach, Tim.  \"The Rise of Solitary Deaths.\"\r\n     British Chamber of Commerce in Japan.    May 2015.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]