["On March 7, 17.8 million viewers tuned in to CBS to watch Oprah Winfrey’s explosive interview with Prince Harry and Meghan, Duchess of Sussex. The interview  provided insights into the couple’s decision to exit royal life in early 2020.", "Following the interview, the interviewees and interviewer were quickly subject to misinformation online.", "One widely shared claim is that Winfrey was hiding an ankle monitor under her boot throughout the interview.", "Fact check:Prince Harry's children could run for president under certain conditions", "This claim stems from QAnon conspiracy theories that Winfrey is a member of an elite \"cabal\" of pedophiles that controls the government, media and economy. QAnon followers believe perpetrators will be brought to justice in a swift and stealthy \"great awakening.\"", "Proponents have shared images that highlight a bump in Winfrey’s right boot that they argue is an ankle monitor and that they claim proves she’s been secretly arrested.", "“Oprah, Harry and meghan are all heavily Cabal,” one account captioned several images. “Oprah showing her ankle monitor loud and proud in this interview.”", "“I told y'all arrests are goin on behind the scene,” wrote another. “Oprah is a witch and was part of a child sex trafficking cult.”", "Other posts that suggest Winfrey was hiding an ankle monitor in her right boot are found here and here.", "Fact check:Rep. Alexandria Ocasio-Cortez's net worth is not close to $1 million", "USA TODAY contacted several posters for comment.", "This is not the first time false allegations about Winfrey’s arrest have spread on the internet. USA TODAY debunked similar claims last year.", "Winfrey responded to previous allegations in a March 18, 2020, tweet.", "“Just got a phone call that my name is trending,” she wrote. “And being trolled for some awful FAKE thing. It’s NOT TRUE. Haven’t been raided, or arrested. Just sanitizing and self distancing with the rest of the world. Stay safe everybody.”", "Both falsehoods likely stem from QAnon-related conspiracy theories that allege Winfrey is part of an elite child sex trafficking ring.", "Travis View, the host of the QAnon Anonymous podcast, told USA TODAY in June that conspiracy theorists target celebrities like Winfrey because “they are thoroughly convinced that the only way you can sort of achieve that high degree of success is by doing something morally depraved.”", "Fact check:Viral posts make false claims about Friday the 13th, the next full moon", "Harpo Productions, Winfrey’s media company which produced the interview special, told USA TODAY the ankle monitor claim was false.", "In an email, Harpo spokesperson Nicole Nichols said that the claim was “completely untrue.”", "USA TODAY analyzed footage from the interview and found the shape highlighted in the photos appeared to be a fold in Winfrey’s leather boot. As she moved throughout the interview, the crease shifted, indicating there was no ankle monitor protruding.", "Also USA TODAY could find no reputable news coverage of the claimed arrest.", "Winfrey has been photographed outside her home several times in recent weeks.", "When she began her interview with Markle, she thanked a friend for allowing them to film the interview special on their property. O The Oprah Magazine stressed that the interview was not filmed at Winfrey's home in a March 8 article.", "Fact check:Satirical tweet focuses on Texas Gov. Greg Abbott's reopening order", "The U.S. Sun tabloid published videos and images of Winfrey boarding a private jet for Maui on Feb. 20, after she finished filming the interview in California.", "Claims that Oprah Winfrey wore an ankle monitor during her interview with Prince Harry and Meghan and is secretly under arrest are FALSE. These allegations likely stem from QAnon conspiracy theories that Winfrey is part of a pedophilic \"cabal.\" Harpo Productions, USA TODAY analysis of the interview and recent reports confirm Winfrey has not been arrested.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook."]