["By Brooks Jackson", "Posted on September 13, 2016", "Donald Trump mangled his economic facts — again — when he said many people are working two jobs largely “because of this horrible Obamacare.”", "The fact is, anyone working today is less likely to be holding two or more jobs than they were when Obama took office, or when he signed the Affordable Care Act.", "Trump also repeated his false claim that wages are lower now than they were 18 years ago. And he claimed that workers are “working harder today,” when in fact the average work week is nearly one hour shorter than it was 18 years ago.", "Trump made his multiple misrepresentations Sept. 12 during a phone-in interview on “Fox and Friends.”", "Trump said blue-collar workers “haven’t been taken care of properly by this country,” and then continued:", "Donald Trump, Sept. 12: [O]n average, people 18 years ago were making more than they’re making today and they’re working harder today. And in many cases they — and to a large extent because of this horrible Obamacare — in many cases they’re working two jobs.", "Trump has repeatedly claimed in the past — wrongly — that wages are down compared with 18 years ago, when in fact real, inflation-adjusted wages have increased substantially during that period.", "Wages for rank-and-file, nonsupervisory workers (the very “blue collar” workers Trump was referring to) have risen even more since we first debunked this bit of bogus Trumponomics back in June.", "The most recent figures from the Bureau of Labor Statistics show that average, weekly real wages in July were 11 percent higher than they were in the same month 18 years earlier. They have risen 2.1 percent in the last year, and 4.5 percent in the last two years.", "So Trump’s claim that “on average” wages are down is still wrong, no matter how often he repeats it. They are going up nicely, and are well above what they were 18 years ago.", "Trump was also off base when he said people are “working harder.” There’s no metric we know of that measures the difficulty of work or worker effort over time, but statisticians do measure the average number of hours worked. And those nonsupervisory workers are putting in fewer hours today than 18 years ago.", "The average work week in August was 33.6 hours, down by 0.9 hour (54 minutes) from the same month in 1998. That’s a 2.6 percent shorter work week, on average.", "Trump’s vague statement that “in many cases” people are working two jobs is true enough; there were just over 7.2 million people working two or more jobs in August, according to the most recent figures from the BLS household survey. But that has little or nothing to do with the Affordable Care Act.", "The Great Recession, which officially began in December 2007 and ended in June 2009, wiped out more than 8 million jobs. Since then, the number of multiple jobholders has gone up — but much more slowly than the rise in the number of all jobholders. Only 4.8 percent of all workers held down two or more jobs in August, compared with 5.2 percent the month Obama first took office, and 5.1 percent in March 2010 when he signed Obamacare into law.", "And the percentage in August was exactly the same as it was in December 2013, the month before the new law’s insurance exchanges took effect, and individuals were required to obtain coverage or pay a tax penalty.", "So we can detect no relationship between the Affordable Care Act and the likelihood of workers holding two or more jobs. Actually, the trend has been away from multiple job-holding for some time.", "BLS figures on multiple jobholders go back to 1994. The percentage peaked at 6.6 percent of all jobholders in November 1996. Thus, today’s workers are actually 27 percent less likely to be working two or more jobs than the workers of 20 years ago.", "https://www.sharethefacts.co/share/90c62476-25d0-4682-a1aa-1887673ca518", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]