["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Democrat Alex Sink is airing a rare, two-minute campaign ad that tries to link Republican gubernatorial candidate Rick Scott to alleged fraud at a urgent patient care business he founded in 2001, Solantic.\n\nThe spot, called \"Fraud Files,\" opens more like an introduction to a Dateline NBC episode than a campaign commercial, mixing a narrator's voice with short clips from TV. The first half of the ad deals with Scott's time running Columbia/HCA.\n\nThe second half talks about Solantic, the company he built after resigning from Columbia/HCA.\n\n\"In 2008, new allegations emerged that Solantic was also engaging in multiple forms of fraud,\" the narrator says over visuals of flapping yellow sheriff's police tape, a detective in a suit taking notes and men in police T-shirts carrying boxes out of a building.\n\nThe ad essentially is blending together two fraud allegations.\n\nThe first is a 2008 lawsuit filed by Dr. P. Mark Glencross. Glencross alleged that Solantic improperly used his medical license in 2004 when the company filed paperwork saying each clinic had a medical director in charge. Scott was deposed during the case -- Scott has declined to release that deposition. The two-year-old case was settled within a month of Scott's deposition and both parties signed a confidentiality agreement.\n\nThe second stems from allegations by another former Solantic physician, Dr. Randy Prokes. During the gubernatorial primary, Prokes sent an e-mail to Bill McCollum's Republican campaign for governor claiming that Solantic billed Medicare at full rates for patients seen by a nurse practitioner, when federal rules require that billing be at 85 percent of the fee paid for physician examinations.\n\nThe McCollum campaign passed the letter on to the Florida Department of Law Enforcement. The FDLE then sent the letter on to the inspector general’s office at the U.S. Department of Health and Human Services. That's where the letter sits today. The Department of Health and Human Services has not said whether it's investigating Prokes' claims.\n\nThe claims of fraud are real, but suggesting through images that police raided or seized records from Solantic is entirely misleading. Ads are about both the visuals and the words campaigns choose. In this case, the Democratic Party is inflating the allegations against Solantic by including video of sheriff's tape and police collecting evidence. There have been no reports that we could find of police raiding a Solantic facility, and the Democratic Party, when asked, could provide no evidence of any such search. As such, we rate this claim False.", "Florida Democratic Party, Profits over Patients: The Rick Scott Story, Oct. 10, 2010\n\nFlorida Democratic Party, interview with Eric Jotkoff, Oct. 11, 2010\n\nRick Scott campaign, e-mail interviews with Jennifer Baker, Aug. 19, 2010\n\nSolantic, history of the company, accessed Aug. 20, 2010\n\nSt. Petersburg Times, \"Lawsuits point to trouble at Rick Scott's current health care business,\" Aug. 5, 2010\n\nSt. Petersburg Times, \"Defiant Rick Scott assails suit over sealed testimony, says McCollum abusing power,\" Aug. 11, 2010\n\nDuval County court records, Solantic v. Gary Glencross, accessed Aug. 20, 2010\n\nFlorida Division of Elections, Florida First Initiative filing documents, accessed Aug. 20, 2010\n\nOrlando Sentinel, The Scott-McCollum Solantic opus (CliffsNotes version), Aug. 11, 2010\n\nOrlando Sentinel, FDLE passes Solantic complaint to the feds, Aug. 16, 2010\n\nNaples Daily News, \"Complaint against clinics owned by Rick Scott sent to federal investigators,\" Aug. 16, 2010", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]