["A video showing a crocodile in a water-logged residential area being pulled out by a man is doing the rounds on social media with the claim that the incident took place in Patna, Bihar.“Crocodile In Patna during Heavy rain”, reads the text posted along with a post which has amassed nearly 12,000 views so far. Bihar is battling floods yet again with the death of at least 29 citizens reported in the last 48 hours.", "Crocodile In Patna during Heavy rain .", "Crocodile In Patna.", "Posted by Shiksha Point on Sunday, 29 September 2019", "Many people have shared the video with the identical narrative on Facebook and Twitter.", "On the other hand, Facebook page Jaago Bihar Jaago claimed that the video was from Bihar’s Jehahanbad district. The caption posted by the page reads, “जहानाबाद में रोड पे बाढ़ में आया मगरमच्छ, बच के चलना रे बाबा .” Alt News has also received a verification request on its official mobile application where the user is enquiring if the video is from Kankarbagh.", "Listening to the people conversing in the video, Alt News found that the crowd was speaking in Gujarati. We subsequently performed a Google search with relevant keywords and found the video posted by Times of India on August 4, 2019. The broadcast carried visuals of the rescue operation from a different angle.", "A ten-foot-long crocodile was rescued by forest officials from a society in Vadsar, Vadodara, Gujarat. “Due to waterlogging by the ongoing heavy rains, further incidents of crocodiles entering Vadodara’s housing complexes have been recorded. Following last week’s viral video of a crocodile attacking a dog inside Lalbaug’s Rajsthamb society, a team of rescuers captured another reptile at night from the entrance of a house.”, reads the caption posted along with the video TOI’s YouTube video.", "A two-month-old video of a crocodile rescued in Vadodara, Gujarat is circulated with the false claim that a crocodile was spotted a locality in Patna, Bihar. Earlier, Alt News had debunked a video of a crocodile rescued in Ratnagiri as Mumbai.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]