["कांग्रेसियों की रैली में लहराते हैं पाकिस्तान के झंडे क्या आपका खून नहीं खोलता……क्या अब भी आप कांग्रेस को वोट देंगे??? (Pakistani flags are waved at Congress rallies does your blood not boil…..will you still vote for Congress?- translated). This message has been shared more than 15000 times along with an image of a green coloured flag being waved at a political rally by the Congress party. The Facebook page Phir Ek Baar Modi Sarkar which has close to 100,000 followers shared this message and photograph on May 27. Since then, it has been shared more than 25,000 times.", "कांग्रेसियों की रैली में लहराते हैं पाकिस्तान के झंडे", "क्या आपका खून नहीं खोलता…… क्या अब भी आप कांग्रेस को वोट देंगे????", "Posted by फिर एक बार मोदी सरकार on Sunday, May 27, 2018", "Another Facebook page BJP All India which has a massive following of over one million uploaded it too, and it has been shared close to 5000 times by users. It has also been posted by the page Narendra Modi WhatsApp Group and shared widely.", "Alt News had chronicled the rush of fake news in the run up to the Karnataka election, among which was a viral post that claimed the Pakistani flag was waved at a rally in Karnataka by the Congress party. Many pro-BJP Facebook pages had shared the video of the rally. An image from the same rally has now been recirculated by right-wing pages on Facebook only a fortnight after the election ended in the state.", "It may be reiterated that the green coloured flag seen in the image is NOT the flag of Pakistan. It is in fact the banner of the Indian Union Muslim League (IUML) which is a political party formed in 1948 and based in Kerala. It is recognised by the Election Commission as a state party.", "The Pakistan flag has a white patch on the left which the flag flown in the Congress rally doesn’t.", "The confusion caused by the similarities in these banners and the systematic attempt to malign non-BJP political parties using this optical trickery is a recurring phenomenon now.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]