["About this rating", "A photograph of a college student smoking marijuana isn't likely to garner much internet attention. Attach a famous or notorious name to it, however, and you get a piece of Internet lore with unlimited potential.", "An image purportedly showing a young Jeffrey Dahmer standing next to a marijuana \"snow bong\" or \"ice bong\" has been around since at least 2013 when it was posted to the \"Trees\" subreddit — a section of reddit.com dedicated to marijuana — with the caption, \"So I just found this photo of Jeffrey Dahmer...\"", "Although this posting contained no information about where and when this image was taken (or where it was allegedly found), this photograph's association with the infamous serial killer stuck.", "And we'll admit, the man in this photograph does bear a superficial resemblance to a young Jeffrey Dahmer:", "chi-phi fraternity, University of...um... Minnesota", "a snow bong sculpted by scott burgeson.the wide angle lens distorts the subject.the...um...sculpture was about 8 feet tall", "A sign for the Chi Phi fraternity can be spotted in the background of this photograph.", "Jeffrey Dahmer spent one single term at Ohio State University (not the University of Minnesota) in 1978. According to The Lantern, the university's newspaper, Dahmer was not a member of any university organizations, and thus would be unlikely to participate in fraternity activities (such as a giant snow bong):", "In June 1978, Dahmer began his decade-long killing spree when he took the life of 18-year-old hitchhiker Steven Hicks. Dahmer struck the young man in the head with a barbell and buried his body behind his house in Bath Township.", "With the weight of the murder on his shoulders, Dahmer walked onto the OSU campus for autumn quarter classes a mere three months later. Little is known about his tenure as a Buckeye.", "Dahmer resided in Morrill Tower for only one quarter and never officially declared a major.", "[...]", "Dahmer was not officially listed as a member of any university organizations or athletics, and his tenure at OSU was cut short when he failed to enroll in winter quarter classes for the 1979 term.", "We have so far been unable to track down Scott Burgeson for comment.", "Romagnino, Kara.   \"Killers Part of OSU’s Past.\"\r\n    The Lantern.   30 October 2005.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]