["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Just because you've taken money from Wall Street doesn't mean you can't regulate Wall Street. That was the message Hillary Clinton tried to promote during the March 6 debate with fellow Democratic presidential candidate Bernie Sanders in Flint, Mich.", "Sanders has attacked Clinton for accepting a lot of contributions from the financial industry, an industry both Sanders and Clinton say they want to tighten the screws on.", "Sanders argued that you can't do it when you've accepted as much money from Wall Street as Clinton has. Clinton countered Sunday night that the case of President Barack Obama shows you can.", "\"President Obama took more money from Wall Street in the 2008 campaign than anybody ever had,\" she said. \"And when it came time to stand up to Wall Street, he passed and signed the toughest regulations since the Great Depression, with the Dodd-Frank regulations.\"", "For this fact-check, we're looking at whether Obama set a record for campaign donations from Wall Street in 2008. Given the context, we're only looking at direct contributions made to candidates, not super PACs or other organizations that can accept unlimited contributions.", "Clinton spokesman Josh Schwerin cited a 2012 analysis by the Center for Responsive Politics, a nonpartisan research group that tracks campaign donations. It found that Obama received $44.3 million in 2008 from the \"finance, insurance and real estate\" sector. Four years earlier, George W. Bush had received $36 million. Adjusted for inflation, Bush received $41.1 million in 2008 dollars, making Bush and Obama close, but still putting Obama ahead.", "But the \"finance, insurance and real estate\" sector includes industries that go beyond what people traditionally think of as Wall Street. The Center for Responsive Politics has told PolitiFact that the best way to determine what Wall Street is donating is to look at donations from the \"securities and investment\" category.", "By that measure, Obama received $17.3 million in 2008 (with Republican Sen. John McCain a distant second at $9.7 million and Clinton in that cycle at third, at $7.5 million). Four years earlier, George W. Bush received $10 million, which is $11.4 million in 2008 dollars.", "So when it comes to Wall Street contributions, Obama broke the record in 2008.", "But Obama's support of financial reform may have cost him. When he ran for reelection in 2012, Wall Street sent him $10 million less. He received $7 million for that election cycle. It was Republican Mitt Romney who set the new record — $23.7 million, which would be $22.2 in 2008 dollars.", "And, for the record, in the current race, the most recent data supplied by the center's website, OpenSecrets.org, shows Clinton with $3.4 million from the securities and investment industry, Marco Rubio with $1.6 million, Ted Cruz with $754,583, John Kasich with $274,317 and Sanders with $108,761.", "Our ruling", "Clinton said, \"President Obama took more money from Wall Street in the 2008 campaign than anybody ever had.\"", "Adjusting for inflation, Obama garnered about $3 million more than George W. Bush if you look at the broad \"finance, insurance and real estate\" sector. But using the \"securities and investment\" category, a tighter measure of Wall Street contributions, Obama clearly set a new record in 2008.", "Yet that record only lasted four years. Romney upped that ante by $5 million in 2012.", "Because the statement is accurate but needs clarification or additional information, we rate it Mostly True.", "HELP US RAISE $15,000 TO HIRE AN EXTRA FACT-CHECKER", "The Washington Post, \"Transcript: The Democrats’ debate in Flint, annotated,\" March 6, 2016", "Email, Josh Schwerin, spokesman, Hillary Clinton campaign, March 7, 2016", "FactCheck.org, \"Obama White House ‘Full of Wall Street Executives’?\" Feb. 29, 2012, accessed March 7, 2016", "Center for Responsive Politics, \"Finance/Insurance/Real Estate Recipients\" and \"Securities & Investment Recipients,\" all years, accessed March 7, 2016", "Bureau of Labor Statistics, \"Inflation Calculator,\" accessed March 7, 2016", "PolitiFact, \"American Future Fund says Wall Street \"supports President Obama\" and funds him like in 2008,\" May 24, 2012", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]