["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Facing an election challenge from a state senator in his own party, Milwaukee County Executive Chris Abele unveiled two campaign ads on Nov. 2, 2015.", "Both TV spots make the same boast about taxes.", "In the ad titled \"Foundation,\" the narrator puts it this way: \"As county executive, he balanced the budget without raising taxes, five years in a row.\"", "Really? Then why is the property tax levy millions of dollars higher than when Abele took office?", "It’s been well documented that the county Board of Supervisors has generally raised property taxes in making changes to Abele’s budgets.", "But Abele has, in his own way, adopted those increases as well.", "The numbers", "Abele has proposed five county budgets since winning a special election in April 2011 to finish out the final year of Scott Walker’s term, after Walker was elected governor. Abele won a full four-year term in 2012, running unopposed. But he faces a serious challenge from state Sen. Chris Larson of Milwaukee in the April 2016 election.", "(Although both Abele and Larson are Democrats, the county executive position is officially nonpartisan.)", "As the following table shows, for each of his five budgets, Abele proposed a property tax levy freeze -- in other words, he proposed levying the same total amount of property taxes that was levied the previous year.", "But it’s also clear that Abele’s proposed levy has increased every year, and was $13 million higher in 2016 than it was in 2012.", "Budget Year", "Property tax levy proposed by Abele`", "Property tax levy adopted by County Board following vetoes and veto overrides", "2011", "(Proposed by Scott Walker)", "$269.6 million", "2012", "$269.6 million", "$275.4 million", "2013", "$275.4 million", "$279.3 million", "2014", "$279.3 million", "$279.3 million", "2015", "$279.3 million", "$282.9 million", "2016", "$282.9 million", "$287 million*", "*The County Board on Nov. 9, 2015, adopted the 2016 budget, though Abele can still issue vetoes.", "The pattern was essentially the same each year:", "Abele proposed a budget that would have frozen the levy.", "The County Board approved changes in the budget that -- except for 2014, when the levy stayed the same -- raised the levy.", "Abele issued a number of budget vetoes, some or all of which were overridden by the County Board.", "The result was that, except for 2014, the County Board ultimately adopted a budget that contained a property tax levy larger than what Abele proposed.", "So, by proposing the freezes, and issuing the vetoes, each year, Abele tried to keep the property levy from going up.", "But when it came time to propose a budget for the next year, Abele used the previous year’s levy.", "In other words, each year, Abele took advantage of the fact that the County Board had adopted a levy that was higher than he proposed.", "So, the \"freeze\" he proposed each year was on the higher amount adopted by the board, not the lower amount that he had proposed and tried to preserve with his vetoes.", "This was the same pattern Walker followed as county executive.", "Our rating", "Abele says he balanced the Milwaukee County budget \"without raising taxes five years in a row.\"", "That claim has the ring of finality to it, as though Abele has presided over five budgets without a tax increase.", "In reality, Abele did propose a freeze in the property tax levy each year and he issued budget vetoes that would have kept the levy down. But the County Board ultimately adopted a budget that raised the total property tax take in four of the five years, and Abele took advantage of those actions when he proposed a freeze the following year. So, taxpayers are paying more than when he took office.", "For a statement that is partially accurate, our rating is Half True.", "More on Milwaukee County", "Edward Flynn: In Milwaukee County, juveniles arrested for car theft \"get sent immediately home, because under the point system in juvenile court\" on holding suspects, \"a stolen car gets zero points.\" Mostly False,", "Facebook posts: Milwaukee \"incarcerates 1.2% of white men\" and has \"incarcerated over 50% of black men in their 30s.\" Half True.", "YouTube, Chris Abele \"Foundation \"Foundation TV ad, Nov. 2, 2015", "Wisconsin Taxpayers Alliance, \"County property tax history\"", "Email exchange, Milwaukee County Executive Chris Abele spokeswoman Melissa Baldauff, Nov. 5, 2015", "Email exchange, Chris Larson campaign manager Rick Coelho, Nov. 5, 2015", "PolitiFact Wisconsin, \"As introduced, package has no property tax increase (Promise Kept),\" Oct. 4, 2011", "PolitiFact Wisconsin, \"Despite his efforts (and vetoes), taxpayers will pay more in the end (Promise Broken),\" Nov. 18, 2011", "Milwaukee Journal Sentinel, \"Milwaukee County Board boosts spending 1.3%, adopts $1.3 billion budget,\" Nov. 10, 2014", "Milwaukee Journal Sentinel, \"County Board overrides all but 2 Chris Abele budget vetoes,\" Nov. 19, 2014", "Milwaukee Journal Sentinel, \"Board overrides dozens of Chris Abele’s budget vetoes,\" Nov. 21, 2013", "Milwaukee Journal Sentinel, \"Milwaukee County Board overrides 22 of 24 Abele vetoes,\" Nov. 14, 2012", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]