["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A TV ad by Ed Gillespie, the Republican nominee for the U.S. Senate, indicates incumbent Mark Warner has received PolitFact’s most ignoble rating: \"The Lie of the Year.\"", "The commercial starts with footage from a videotape Warner posted on Aug. 10, 2009, laying out his qualified support for health care reform. At the time, Congress was considering Obamacare -- also known as the Affordable Care Act -- and there was loud debate over whether the bill would strip people of health insurance policies they liked and wanted to keep.", "\"Let me make clear, I’m not going to support a health care reform plan that’s going to take away health care that you’ve got right now or a health care plan that you like,\" Warner said in the 2009 video.", "While Warner is saying this, the words \"LIE OF THE YEAR\" appear in red capital letters and, underneath them, in black caps, is the attribution to \"POLITIFACT, 12/12/13.\"", "The Lie of the Year is awarded each December by our colleagues at PolitiFact National. Gillespie’s claim that Warner took the title last year was news to us because the dubious distinction went to President Barack Obama’s statements that under that ACA, \"If you like your health care plan, you can keep it.\" Obama had repeated that vow at least 37 times since 2009, including during his re-election campaign in 2012.", "Those promises unraveled last fall when insurers informed millions of Americans who buy their own coverage -- as opposed to getting it through work -- that their policies were being cancelled because they did not meet the ACA’s minimum standards.", "Paul Logan, a spokesman for Gillespie, essentially told us the ad claim is fair because the promises by Warner and Obama were identical. Logan said the Lie of the Year was not directed specifically at the president, but to anyone who made the like-it, keep-it claim.", "PolitiFact National’s article announcing the Lie of the Year, however, only refers to the White House’s repetition of the false claim. It notes that when insurers started cancelling policies last fall, Obama’s first reaction was to deny he made a blanket promises that people could keep their pre-existing coverage. \"For all those reasons, PolitiFact has named `If you like your health care plan, you can keep it,’ the Lie of the Year for 2013,’\" our colleagues wrote.", "PolitiFact National also specified that the distinction went to Obama’s statements in a follow-up article -- which Logan also sent us -- detailing national reaction to the award.", "So it’s clear that Gillespie’s campaign took liberty in interpreting the PolitiFact’s Lie of the Year.", "There are important distinctions between Obama’s comments and Warner’s.", "Gillespie’s campaign is circulating tapes of two events where Warner pledged not to vote for a bill that would take away existing insurance plans: the video used in the ad and one from a September 2009 town hall meeting in Fredericksburg. Both of those recordings occurred when the ACA was being drafted. Warner was speaking about his conditions for supporting legislation; he was not offering a long-term guarantee on how the law would work.", "Warner wound up voting for a bill that contained language shielding existing policies from meeting the minimum ACA coverage standards, but leaving it to the White House to fill in the details. Obama subsequently imposed tough regulations that blocked insurers from adjusting the grandfathered plans to market conditions or selling them to new customers, all but assuring the death of substandard policies. Warner says he was surprised by the president’s actions.", "Obama repeated his like-it, keep-it line long after he imposed regulations that guaranteed the law wouldn’t work that way. The White House published the rules in June 2010 with a chart estimating between 39 percent and 69 percent of employers with grandfathered plans would relinquish them by 2013.", "Unlike Obama, we’ve come across no record of Warner making a like-it, keep-it statement past 2009.", "Our ruling", "Gillespie’s ad indicates PolitiFact National branded Warner with the \"Lie of the Year\" in 2013 for promising four years earlier that he wouldn’t vote for health care reforms that took away insurance plans people like.", "PolitiFact National never mentioned Warner in handing out the award. In articles and videos, our colleagues focused the award on Obama’s insistence over the years that under the ACA, \"If you like your health care plan, you can keep it.\"", "The statements and the circumstances behind them are not clones. The president had far greater power in shaping the law that bears his name than the senator. Warner didn’t repeat his pledge after he voted for the ACA in 2009. Obama continued to make his vow long after he added regulations to the law in mid-2010 that guaranteed the ACA would end some pre-existing insurance plans.", "The clear implication of Gillespie’s ad -- that PolitiFact cited Warner for telling the Lie of the Year -- is simply False.", "Gillespie Campaign, \"Mark Warner, Lie of the Year,\" Sep. 12, 2014.", "PolitiFact National, \"Lie of the Year: ‘If you like your plan, you can keep it,’\" Dec. 13, 2013.", "Emails from Paul Logan, Gillespie campaign spokesman, Sep. 16, 2014.", "PolitiFact National, \"The most interesting reactions to the 2013 Lie of the Year,\" Dec. 18, 2013.", "U.S. Sen. Mark Warner, \"Can I keep my health insurance?\" Aug. 10, 2009.", "C-SPAN, \"Sen. Mark Warner town hall meeting,\" Sep. 3, 2009.", "Federal Register, ACA regulations, June 17, 2010.", "Email from David Turner, spokesman for Mark Warner campaign, Aug. 18, 2014.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]