["The claim was published on Facebook here on May 23, 2020. It has been shared more then 200 times.", "Part of the post’s Burmese caption translates to English as: “Previously it was very easy to open a Facebook account. You can get a Facebook account only if you have an email address or phone number. Now, Mark won't grant you an account easily. It costs 4 USD (over 5,000 Myanmar kyats) to get an account. Before, only ads could be boosted by payment previously but it seems Mark has changed his policy before the world economic crisis.”", "The post also claims that Facebook will require payment for creating new pages and groups, as well as publishing and sharing content. Alleged costs range from 1,000 Myanmar kyats for a text post and 2,000 Myanmar kyats for a post with a photo. The new income, the post claims, will be donated to COVID-19 vaccine research.", "An identical claim was also shared hundreds of times in other Facebook posts; for instance here and here.", "The claim is false.", "“Facebook does not charge people to use Facebook,” a company spokesperson said in an email to AFP on May 25, 2020. “Instead, we charge advertisers to show ads on the Facebook family of apps and technologies. This helps us make Facebook available to everyone without charging people for access to it.”", "Facebook also maintains a webpage here in its help center that stated the platform is free of charge for users. “No, we don’t charge you to use Facebook,” the page tells users.", "The company’s newsroom also has no mention of any changes to Facebook's pricing policy.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]