["A video of former American professional boxer Mike Tyson performing Islamic prayers is being shared on Facebook and Twitter. The text associated with the video reads, “A coffee shop owner in central Los Angeles wrote on his business’ door: “Dogs and Muslims are not allowed”…then walk in three boxing world champions … the ex-world champion Mike Tyson, the present world boxing champion, the Swede Bado Jack, and their Imaam, present world kick-boxing champion, Palestinian A’amer Abdallah … the coffee shop owner and his staff watching in humiliation as they pray right there, in the center of his shop. There stands the owner. (sic)”", "A Twitter user @abba_zacks tweeted the video on October 20. As of writing the article, this tweet has been retweeted over 1,000 times. (archived link)", "Retweet pls, when you come across 🙏🏾", "A coffee shop owner in central Los Angeles wrote on his business door: “Dogs and Muslim are not allowed”….then walks in three boxing world champions… the Ex boxing world champion MIKE TYSON, the present world boxing champion the SWEDE… pic.twitter.com/3uIrR9XrbI", "— Double—Malams👳🏾‍♂️✌🏾 (@abba_zacks) October 20, 2020", "Similarly, multiple Facebook users posted this video. Additionally, Alt News received several requests to fact-check the clip on our WhatsApp helpline (+917600011160) and official Android application.", "This slideshow requires JavaScript.", "In order to gain context behind the video, Alt News visited the Twitter profiles of the three men mentioned in the claim.", "Badou Jack had tweeted the video in August along with the text, “Praying side by side with my brothers @MikeTyson & @TeamAbdallah #muslimbrothers #alhamdulillah”. This was quote-tweeted by Amer Abdallah. Readers should note that the names of Jack and Abdallah have been misspelt in the viral message.", "Praying side by side with my brothers @MikeTyson & @TeamAbdallah #muslimbrothers #alhamdulillah pic.twitter.com/RpdXCfYWme", "— Badou Jack (@BadouJack) August 23, 2020", "The logo seen behind Jack and Tyson in the viral video, stylized ‘TR’, stands for Tyson Ranch, a licensing and branding company owned by Mike Tyson. The company primarily sells cannabis-related products. Tyson tweeted a picture of himself on September 4 in which the same logo can be seen.", "Tyson Ranch has also tweeted photos of a store where the logo is visible.", "Join us next Friday, August 2nd at Monarch Beach Club for @miketyson ‘s charity golf event benefiting @standingunited https://t.co/NojyW02Pfk pic.twitter.com/iPU6SPl2ww", "— TysonRanch (@tysonranch) July 24, 2019", "The complete video of the trio praying inside Tyson Ranch was uploaded by The Mayweather Channel.", "A video posted by Swedish professional boxer Badou Jack in August was therefore shared with the false claim that Badou, along with Mike Tyson and Amer Abdallah, offered namaz in an LA-based shop to protest against the owner discriminating against Muslims.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "A purported video of a Muslim man beating a temple priest with a bat is…", "A picture depicting the Pakistani flag apparently bigger in size and apparently placed higher than…", "Amid the ongoing war between Israel and Hamas, a video of a fleet of cars…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "A clip featuring Pakistan men’s Cricket team captain Babar Azam is viral on social media…"]