["Corrections & clarifications: This story has been updated to clarify the claim made in The Federalist article about the vaccination model proposed by Dr. Ezekiel Emanuel.", "Since President-elect Joe Biden tapped Dr. Ezekiel Emanuel, an oncologist and brother of former Chicago Mayor Rahm Emanuel, to be a member of his coronavirus task force, Emanuel has come under heightened scrutiny for past writings.", "An article in The Federalist, a conservative publication, makes this claim in its headline: \"Biden COVID Advisor: Those Older Than 75 Should Get Vaccines Last.\" The article further asserts that Emanuel backs a COVID-19 vaccination model that “would exclude those over age 75 from receiving a COVID vaccine, at least until availability is widespread and no shortages exist, globally.”", "It cites two pieces of Emanuel’s work as proof he’s against early vaccine administration for the elderly: a 2014 article he wrote for The Atlantic and an article he co-wrote in September for Science Magazine. Promotion for the article was shared on The Federalist’s Instagram.", "Emanuel never said that individuals over the age of 75 should be the last to receive a vaccine for COVID-19, nor does the work that The Federalist points to indicate he may hold that position.", "“The claims in this piece are completely false,” said Kenneth Baer, a spokesperson for Emanuel.", "TJ Ducklo, a spokesperson for Biden, emphasized where the president-elect stands on the matter.", "\"The President-elect believes that the vaccine process should prioritize safety and efficacy, and be fully transparent so the American people have confidence in any vaccine being put forward,\" Ducklo said. \"It should also be distributed equitably so that  everyone — not just the wealthy and well-connected — receives the protection and care they deserve.\"", "The Federalist did not respond to USA TODAY’s multiple requests for comment.", "Fact check:Operation Warp Speed official discussed vaccine distribution, not mandatory vaccinations", "Emanuel writes in his 2014 Atlantic piece “Why I Hope to Die at 75” that he personally sees no value in living past that age.", "As the Federalist article suggests, Emanuel does write that he would forgo colonoscopies, cancer screenings and antibiotics for common infections – or a flu shot for an imagined flu pandemic, a convenient parallel to the world in which we live today. But as the Federalist author notes, Emanuel says a number of times that his argument reflects his own personal view.", "“I am not saying that those who want to live as long as possible are unethical or wrong. I am certainly not scorning or dismissing people who want to live on despite their physical and mental limitations. I’m not even trying to convince anyone I’m right. ... And I am not advocating 75 as the official statistic of a complete, good life in order to save resources, ration health care, or address public-policy issues arising from the increases in life expectancy,” Emanuel wrote in the piece. “What I am trying to do is delineate my views for a good life and make my friends and others think about how they want to live as they grow older.”", "Kenneth Baer, a spokesman for Emanuel, reiterated that The Atlantic article reflects Emanuel’s “personal choice as to what health interventions he would want as he ages.”", "Fact check:Melatonin could help against COVID-19, but more studies are needed", "As evidence that Emanuel would translate his personal distaste for a life past 75 into COVID-19 policy that might affect older Americans, The Federalist points to an article Emanuel co-authored in September for Science Magazine, “An ethical framework for global vaccine allocation.”", "The Federalist piece frames the Science article as an argument for distributing a COVID-19 vaccine abroad before it’s distributed to all Americans. It also argues that the method Emanuel and his co-writers suggest using as a metric for premature death would exclude people over the age of 75 from receiving a COVID-19 vaccine until no shortages exist globally.", "Govind Persad, a health law expert and co-author of the Science article, told USA TODAY that neither of those claims is true.", "“I read the Federalist article, and it's one of these things where – you see this sometimes in politics – where one strategy if you want to try to discredit somebody or make people worry about them is you say so many false things, it’s hard to refute,” he said.", "The Science article was written to provide a roadmap for organizations attempting to distribute COVID-19 vaccines to countries around the world – particularly aimed toward COVAX, a coalition of public health organizations funding COVID vaccine research with the goal of buying and distributing the vaccine to countries that can’t afford to purchase them, Persad said.", "“It's not an article about which people should get vaccines, in any country, first; it's an article about how global health decision makers, like COVAX or the foreign Minister of Canada, somebody like that, should decide how vaccines that are being sent out to solve a global health problem, especially in low and middle income countries, should decide which countries to send vaccines to first.”", "The article itself explains that, too. It offers up a “Fair Priority Model,” which has three phases: reducing premature deaths, reducing serious economic and social deprivations, and returning to full functioning. The proposed metric for the first phase is Standard Expected Years of Life Lost (SEYLL) averted per dose of vaccine, which is where The Federalist argues those past 75 years old lose their right to prompt vaccination.", "Persad explained that one way of understanding the burden of a pandemic or other global health problem is to assess years of life lost. But an issue with that method is that countries that already have a lower life expectancy are at a disadvantage.", "SEYLL corrects for that. It assumes that if a person has a life-saving intervention, it allows that person to live to the highest global life expectancy at the age at which they received the intervention, Persad.", "“I don’t understand how they get from that this idea, that there’s some sort of cut off age in SEYLL – there’s no cutoff age above which giving a person an intervention would lack value significantly at any age,” Persad said.", "More:Fact check: COVID-19 vaccine recommendations don't link government aid to immunization", "He added that the CDC document linked in The Federalist article, purported to define SEYLL, is for a different metric.", "“They say, ‘In the CDC’s definition, the cutoff is even sooner’ – so stop there. There's actually no cutoff at all,” Persad said. “Second, the CDC metric that they're talking about is not the one that we're using. We're using SEYLL. The CDC is, if you click on the link, they're talking about a totally different metric called Years of Potential Life Lost (YPLL), that looks at the years of life lost before 75. That's a different metric that's different from SEYLL, so it's not clear at all what that would have to do with our article.”", "The Science article reads that minimizing SEYLL might mean immunizing those at “high risk of death, those most likely to transmit infection, or those most at risk of initial infection.”", "Baer, the spokesman for Emanuel, affirmed that stance, writing that Emanuel advocates for an approach that tries to \"maximally reduce premature death and loss of life, reduces pressure on the health care system (which could lead to more loss of life), and to address important equity issues such as the higher prevalence and death rates among African-Americans and Latinos.”", "“Dr. Emanuel has written at length on (the COVID vaccine) in the world's leading medical journals,\" Baer said. \"Even a cursory read of those articles would show that Dr. Emanuel believes that we should not use age as the variable to determine who gets a vaccine.\"", "We rate the claim that Dr. Ezekiel Emanuel, one of President-elect Joe Biden's COVID-19 advisers, backs a COVID-19 vaccination model that “would exclude those over age 75 from receiving a COVID vaccine, at least until availability is widespread and no shortages exist, globally\" as FALSE because it was not supported by our research.", "The Federalist article misconstrues the two articles it uses as evidence. Emanuel's 2014 article in The Atlantic describes his personal preferences in care beyond the age of 75. A co-author of the Science article told USA TODAY that their article is about distributing COVID-19 vaccines to countries around the world; it does not address which people in any countries should receive vaccines first. The Federalist article also bases its argument on a metric Emanuel and his co-authors do not use.", "Thank you for supporting our journalism. Youcan subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]