["The pictures have been shared more than 800 times on social media in recent weeks. We’ve archived some of the shares here, here and here. The earliest post AFP found was here on Facebook in November 2015.", "The photo montage shows two pictures of the same man, on the left wearing an army uniform and holding a decapitated head, and on the right wearing casual clothes.", "The pictures have also been circulating in French, including a post from October which has since been deleted.", "“Integration is going well,” the caption reads. The post claims the man is an “ISIS war criminal\" now living in Europe as a refugee.", "In a bid to identify the man, AFP ran reverse image searches of the photographs on the Yandex search engine, where we found a version of the picture showing the man wearing jeans and a hoodie on a website listing ex-Iraq militia fighters seeking asylum in Europe.", "According to the website, the man’s name is “Ammar Alziady” or “Ammar Al-ziadi”. It provides a link to a Facebook profile, which has been deleted, although its contents have been archived online.", "On the archived Facebook profile attributed to Ammar al-Ziady, AFP found a photograph from 2015 showing the man wearing an army uniform bearing the Iraqi flag. Members of the Islamic State group would not wear an Iraqi flag, as they are fighting against Iraq and do not recognise the state.", "On his Facebook page, “al-Ziady” claimed to belong to Asaib Ahl al-Haq, one of Iraq’s paramilitary forces formed to combat IS. The photo below, posted on August 23, 2015, is captioned: “Asaib Ahl al-Haq heroes in Baiji”, referring to a battle to control the city between IS and a coalition formed by the Iraqi army, the American army and militia fighters.", "A historian specialising in Shiite militia said the man appears to be a member of a group called Kata'ib Jund-al-Iman.", "Contacted by AFP, the historian, who tweets anonymously at @Historicoblog (in French) to protect his identity, said an orange flag behind the man which features in a photograph on his Facebook page is that of Kata'ib Jund-al-Iman.", "AFP was not able to establish how the man entered Europe, but the posts on his Facebook page allowed us to build a picture of his journey.", "On September 6, 2015, he published a post locating himself at the Abel Hotel in Istanbul. Two days later, he published a photo of himself standing in front of Hotel Star Park in Istanbul.", "On September 10, 2015, he is seen sitting on a wall by the sea. In the background, we can see a Greek flag and a European Union flag.", "AFP used Google Maps to track down the location in the photograph. We matched it to this pier on the Greek island of Lesbos, a few kilometres from the Turkish border.", "AFP also tracked down the location of the photo showing the man in casual clothes. Posted to his Facebook page on September 14, 2015, it was taken at the West Train Station in Vienna, Austria.", "In late 2015, thousands of migrants passed through the railway station every day, particularly those travelling on to neighbouring Germany. AFP reported that almost 170,000 people entered Austria in September 2015, most of whom continued to Germany and beyond.", "On September 21, Al-Ziady posted a photograph of himself in front of the Tornio-Haparanda bus station on the border between Sweden and Finland. The spot was a major point of transit for thousands of migrants who arrived in Finland in 2015.", "In November 2015, American news agency AP reported that a 29-year-old Iraqi man had been arrested in Finland on suspicion of war crimes in Iraq in June 2014. The article names him as Jebbar-Salman Ammar (not Ammar al-Ziady, as listed on the Facebook page). The following March, AFP reported that the man had been found guilty of committing a war crime “after he posted images of himself on Facebook with the head of an Islamic State fighter”.", "Contacted by AFP, Ammar’s lawyer Ari Niemen said his client told Finnish police that he also used the name Amman Al-Ziady. We obtained a Finnish police report which confirms the man had a Facebook account under that name.", "The same report states that Ammar was questioned by Finnish police on November 13, 2015 and charged on November 16, two months after the first photographs showing him on European soil appeared on Facebook. He had been living in a centre for asylum seekers in Kaivanto, Finland, around twenty kilometres from Tampere, where he was sentenced.", "Ammar told police that the decapitated head belonged to “an Islamic State terrorist responsible for massacres in Camp Speicher”, in the Iraqi city of Tikrit.", "Nonetheless, he was handed a 16-month suspended sentence.", "His lawyer said Ammar had been “sent back to Iraq after the trial”.", "“He was taken directly from the court to the airport,” the lawyer said.", "\"Militia abuses\"", "Human Rights Watch reported on “militias abuses” following Iraq’s recapture of Tikrit from IS in March and April 2015.", "“In the aftermath of the fighting, militia forces looted, torched, and blew up hundreds of civilian houses and buildings” in and around Tikrit and “unlawfully detained some 200 men and boys, the report says.", "According to the Finnish police report, Ammar denied having decapitated the head he is seen holding in the photograph. He said the fighter “blew himself up”.", "Members of the Islamic State group have been known to enter Europe through the Balkans, using routes taken by asylum seekers fleeing the war in Syria. Some jihadists who carried out attacks in Europe, including the Paris attacks in November 2015, are believed to have travelled with refugees on their way to Europe after spending time in Syria.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]