["U.S. Rep. Mike Rogers, R-Mich., said he thinks Russia is looking to reacquire Crimea from Ukraine.", "President Barack Obama has been vocal in his opposition to Russian counterpart Vladimir Putin’s military intervention in Ukraine. Focus has shifted from the new government in Kiev, Ukraine’s capital, to Crimea, a region Russian troops seized control of Saturday.", "Meanwhile, politicians and pundits are divided over what the United States’ role should be in the conflict. Rep. Mike Rogers, R-Mich., expressed his concern of Russia’s interference in Crimea to Fox News Sunday host Chris Wallace.", "\"I would believe that Russians would love to see the Crimea as part of the Russian Federation,\" he said. \"It was there until 1954 when it was given to the Soviet Republic of the Ukraine at the time. I think they’d like it back. It’s strategic for them militarily and economically.\"", "Rogers was correct in saying that Ukraine has only controlled the Crimean Peninsula since 1954 -- a claim we also heard Sunday from the Washington Post's David Ignatius. Not up on your Soviet history? We’ll review the facts.", "Crimea is an eastern Ukrainian peninsula located on the Black Sea. It’s connected to the rest of the country by a small strip of land. Out of its 2 million residents, about 60 percent consider themselves Russian. That’s the highest concentration of Russian speakers in Ukraine. Although the territory belongs to Ukraine, Russia stations part of its Black Sea fleet in Sevastopol as part of a pre-existing agreement between the two countries.", "As Rogers pointed out, Crimea hasn’t always been part of Ukraine. Here’s a quick rundown of what’s happened in the region since the Ottoman Empire used the peninsula as a hub for slave trade.", "1783: Russia annexed Crimea.", "1853: The Crimean War began, lasting three years. Russia lost to an alliance of the Ottoman Empire, France, Britain and Sardinia. Crimea remained part of Russia.", "1917: Crimea briefly became a sovereign state before becoming a base for the White Army of anti-Bolshevik forces in the Russian War.", "1921: The peninsula, now called the Crimean Autonomous Soviet Socialist Republic, became part of the Soviet Union.", "1942: Nazi Germany took control of Crimea.", "1944: Joesph Stalin forcibly deported all Muslim Tatars, a group of 300,000 who had lived on the peninsula for centuries, due to members’ alleged cooperation with Germany during World War II. Many returned to Crimea in the 1980s and 1990s.", "1945: After World War II, the autonomous Soviet republic was dissolved and Crimea became a province of the Soviet Union called the Crimean Oblast.", "1954: Russian Premier Nikita Khrushchev transferred the Crimean Oblast to Ukraine. It’s often reported that it was a gesture of goodwill from Khrushchev, who had Ukrainian roots.", "1991: The Soviet Union collapsed. Many expected President Boris Yeltsin, the new president of the Russian Federation, to take Crimea for Russia. But he didn’t bring it up during negotiations with Ukraine.", "1997: Ukraine and Russia signed a treaty that allowed Russia to keep its fleet in Sevastopol. The agreement’s since been extended, so the fleet is set to remain there until at least 2042.", "So the story of the Crimean Peninsula is long and complicated, to say the least. And as Rogers implied, there could be more news to come as war threatens Eastern Europe. Today, Crimea’s residents are divided on the issue of Russia’s military intervention. Generally speaking, ethnic Russians support Russia’s involvement in the region, while Tatars and Ukrainians express pro-Ukrainian sentiments.", "Our ruling", "Rogers said Crimea belonged to Russia until 1954, when Khrushchev gave the land to Ukraine, then a Soviet republic. Rogers’ history lesson explains why Russians remain so intertwined with Crimea and why some Americans are worried that Russians will try to annex the peninsula.", "We rate Rogers’ statement True.", "Correction: About 60 percent of people living in Crimea identify themselves as Russian. An earlier version of this story described the statistic differently. This post was updated at 1 p.m. March 3, 2014.", "The Moscow Times, \"Forget Kiev. The real fight will be for Crimea,\" Feb. 25, 2014", "The Moscow Times, \"Will Putin seize Crimea?\" Feb. 24, 2014", "New York Times, \"Amid more signs of Russian force in Crimea, delight mixes with dismay,\" March 1, 2014", "New York Times, \"Ukraine in maps,\" Feb. 27, 2014", "New York Times, \"Ukraine puts troops on high alert, threatening war,\" March 2, 2014", "NPR, \"Crimea: 3 things to know about Ukraine’s latest hot spot,\" Feb. 26, 2014", "Radio Free Europe, \"Pro-Russian separatism rises in Crimea as Ukraine’s crisis unfolds,\" Feb. 18, 2014", "Slate, \"Khrushchev’s gift,\" Feb. 25, 2014", "Wall Street Journal, \"In Crimea, a long history of Russian power struggles,\" Feb. 27, 2014", "Washington Post, \"To understand Crimea, take a look back at its complicated history,\" Feb. 27, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]