["The 27-second video was published on Facebook here on January 29, 2021.", "“Revolt in Delhi Police. 200 policemen tendered mass resignation,” the post’s Hindi caption reads.", "The video shows a police officer speaking in Hindi.", "“We don't want this job. We have served a lot, but now we’re sorry. I request to the government that we don’t want to do this job anymore,” he says. “Why should we be baton-charged? They beat us and didn’t even spare my kid.”", "A social media handle called “TheFollowUp” can be seen listed for various platforms at the bottom of the video.", "The post circulated after violent clashes erupted between police and farmers protesting new agricultural laws in Delhi on January 26, 2021.", "The video was also shared alongside similar claims on Facebook here, here, here; and on Twitter here.", "The claim, however, is false.", "A keyword search for “TheFollowUp” found that it is a local news outlet in the Indian state of Jharkhand.", "The same footage shared in the misleading posts was published on TheFollowUp’s YouTube channel on September 18, 2020, several months before farmers protests began in Delhi.", "The video’s Hindi description translates as: “Protesting assistant police personnel are angry after being baton-charged, listen to what they are saying.”", "The same footage shared in the misleading posts can be seen in the YouTube video’s first 27 seconds.", "Below is a screenshot comparison of the video shared in misleading posts (L) and YouTube video (R):", "Several other major media outlets reported on the police protest in September 2020, including Indian news agency ANI and the Times of India. Both reports stated that demonstrating officers were police in Ranchi, Jharkhand's capital.", "Delhi police also denied the claim about the old footage, stating on Twitter that that claim is a “mischievous social media campaign” that is “propagating false rumours regarding disaffection in police ranks.”", "“Old, unrelated videos were being posted with fake news of resignation of police personnel,” reads another tweet in the police’s thread published on February 1, 2021.", "Old, unrelated videos were being posted with fake news of resignation of police personnel. Acting on such fake news, CyPAD Unit of @DelhiPolice registered a criminal case and has arrested one person Om Prakash Dhetarwal of Churu District of Rajasthan.\n\t\t(2/4)", "The Indian government’s Press Information Bureau also took to Twitter to refute the claim.", "“There has been a claim on social media that 200 Delhi Police personnel have tendered mass resignation. #PIBFactCheck: This is a fake claim,” the agency tweeted on January 30, 2021.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]