["About this rating", "As thousands of people took to the streets of London on 3 June 2019 in protest of U.S. President Donald Trump's state visit, a video supposedly showing aerial footage of the event was widely circulated on social media:", "This video does feature aerial footage of an anti-Trump protest, but it was taken in July 2018 during President Trump's previous visit to the UK.", "The BBC originally shared the footage with the caption, \"Thousands of protesters are marching through central London in protest of Donald Trump's visit\":", "The Associated Press captured additional footage of this July 2018 anti-Trump protest, which involved as many as 100,000 people and a giant balloon depicting Trump as a baby:", "Hordes of demonstrators converged in central London on Friday, intent on mocking U.S. President Donald Trump on his only full day of business with British leaders on what was dubbed a \"working visit\" to the United Kingdom. The visual cornerstone of the anti-Trump protests — which included several organized marches by varying groups — was a giant balloon depicting the U.S. leader as an angry, screaming orange baby in a diaper, clutching a cellphone with Twitter on the screen.", "President Trump's state visit in June 2019 was also met with protests. However, the crowd that time around wasn't quite as large as the previous year, as the New York Times reported:", "Flying the giant Trump baby balloon once again, Britons protesting President Trump’s state visit tried to bring central London to a standstill with demonstrations that they hoped would draw large crowds throughout the day.", "But the turnout fell below expectations and the volume of the protests during Mr. Trump’s first visit in July, suggesting that the passions that drove hundreds of thousands into the streets then have now cooled somewhat.", "We were unable to find comparable aerial footage of the anti-Trump protests in June 2019. A video from The Guardian shows what was labeled as \"thousands of people protest against Donald Trump's state visit\":", "Booth, Robert.   \"Trump Protests: Tens of Thousands Take to Streets Across UK.\"\r\n    The Guardian.   13 July 2018.", "CBS News.   \"Huge Protests in London as Donald Trump Visits U.K., Meets Queen Elizabeth II.\"\r\n    13 July 2018.", "Yeginsu, Ceylan.   \"Protesters Hit London Streets, With a Giant Trump Balloon in Tow.\"\r\n    The New York Times.   4 June 2019.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]