["By Angelo Fichera", "Posted on July 26, 2019 | Updated on July 27, 2019", "Democratic Rep. Jerrold Nadler selectively cited former special counsel Robert S. Mueller’s testimony to misleadingly claim that Mueller said he didn’t indict President Donald Trump only because he couldn’t indict a sitting president.", "Mueller clarified in his July 24 congressional testimony that “we did not make any determination with regard to culpability.”", "During a press conference on July 26, Nadler said that Mueller “told us in a remarkable exchange with [Democratic Rep. Ted] Lieu that but for the Department of Justice policy prohibiting [him] from doing so, he would have indicted President Trump. Indeed it is clear that any other citizen of this country who behaved as the president has would have been charged with multiple crimes. Notably, my Republican colleagues were unable to refute a single one of these facts.”", "But Nadler, chairman of the judiciary committee, ignores some of the facts.", "During Mueller’s testimony, in response to a question from Lieu, Mueller provided an eyebrow-raising answer that seemed to suggest that it was an Office of Legal Counsel decision — which found that a sitting president cannot be indicted — that alone prevented him from charging Trump. But soon after, Mueller explicitly corrected himself — twice.", "Lieu: Thank you. So to recap what we’ve heard, we have heard today that the president ordered former White House Counsel, Don McGahn, to fire you. The president ordered Don McGahn to then cover that up and create a false paper trail. And now we’ve heard the president ordered Corey Lewandowski to tell Jeff Sessions to limit your investigation so that he — you stop investigating the president. I believe any reasonable person looking at these facts could conclude that all three elements of the crime of obstruction of justice have been met. And I’d like to ask you the reason, again, that you did not indict Donald Trump is because of OLC opinion stating that you cannot indict a sitting president, correct?", "Mueller: That is correct.", "That suggestion would have gone much further than what Mueller said in his final report on the investigation.", "Mueller’s 448-page report noted that his team “determined not to make a traditional prosecutorial judgment” regarding potential obstruction of justice and therefore “did not draw ultimate conclusions about the President’s conduct.” Factoring into that decision to not consider prosecution, Mueller wrote, was the OLC opinion regarding the indictment of a sitting president. (Attorney General William P. Barr later told Congress in a letter that there would be no charges, saying that “the evidence developed during the Special Counsel’s investigation is not sufficient to establish that the President committed an obstruction-of-justice offense.”)", "At the start of the following congressional hearing, before the House intelligence committee, Mueller in his opening remarks corrected his earlier response to Lieu — again citing his report’s explanation.", "Mueller: Now, before we go to questions, I want to add one correction to my testimony this morning. I want to go back to one thing that was said this morning by Mr. Lieu, who said, and I quote, “You didn’t charge the president because of the OLC opinion.” That is not the correct way to say it. As we say in the report and as I said at the opening, we did not reach a determination as to whether the president committed a crime.", "And he later did so again when asked about the matter by Republican Rep. John Ratcliffe of Texas.", "Ratcliffe: So to that point, you addressed one of the issues that I needed to, which was from your testimony this morning, which some construed as a change to the written report. You talked about the exchange that you had with Congressman Lieu. I wrote it down a little bit different. I want to ask you about it so that the record’s perfectly clear. I recorded that he asked you, quote, “The reason you did not indict Donald Trump is because of the OLC opinion stating you cannot indict a sitting president,” to which you responded, “That is correct.” That response is inconsistent, I think you’ll agree, with your written report. I want to be clear that it is not your intent to change your written report. It is your intent to clarify the record today.", "Mueller: Well, as I started today, this afternoon, and added either a footnote or an endnote, what I wanted to clarify is the fact that we did not make any determination with regard to culpability in any way. We did not start that process down — down the road.", "Nadler is not the only one to misrepresent Mueller’s testimony regarding the OLC decision.", "The cherry-picking has surfaced on social media, as well. A viral meme shared by a page called the Trump Resistance Movement, for example, cites a limited portion of the Mueller-Lieu exchange to also suggest that the OLC decision is the only thing that stood in the way of Trump’s prosecution.", "As we said, Mueller made clear that that was not what he meant.", "Update, July 27: A spokesman for Nadler, Daniel Schwarz, director of strategic communications for the House Judiciary Committee, told us he “didn’t take [Mueller] to be changing a stance on any of his responses to Lieu. He just came back to it to reaffirm that he did not [reach] a declination decision.”", "But Mueller said he wanted “to add one correction to my testimony.” He quoted Lieu as saying, “You didn’t charge the president because of the OLC opinion,” and Mueller said, “That is not the correct way to say it.” He said that “we did not reach a determination as to whether the president committed a crime.” Not reaching a determination on whether a crime was committed isn’t the same as saying, in Nadler’s words, “he would have indicted” the president “but for” the OLC opinion.", "In a CNN interview, Lieu acknowledged Mueller had “walked it back,” but said, “I believe he fully understood my question. It was a logical extension of me getting him to establish the three elements of obstruction of justice were met and I think it’s what he actually believes.” That’s Lieu’s opinion.", "But the record shows Mueller did make a “correction” to his response to Lieu.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]