["An image of a clearing in an area of dense forest has been shared thousands of times in Facebook posts that claim it shows deforestation in the Sri Lankan rainforest Sinharaja. The claim is false; the image was actually captured in 2017 by AFP and shows the deforestation in the Western Amazon region of Brazil.", "The image was published in this Facebook post published on March 18, 2021, where it has been shared more than 3,600 times.", "The Sinhala-language caption says: “Deforestation occurring in the Pukutuwaka area located in the Southern border of the Sinharaja forest under the sponsorship of the government. Mother Sri Lanka, we have wronged, please forgive us!”", "Sri Lanka’s Sinharaja has been designated a UNESCO heritage wilderness site since 1988.", "The Sinharaja Forest Reserve has been in the news in Sri Lanka due to allegations of illegal deforestation occurring in the area, after a young girl who lives close to the rainforest border raised concerns during a popular TV program.", "Pukutuwaka is not a real area located within the Sinharaja forest - the jumbled word in Sinhala literally translates into ‘round buttocks’ -- indicating the post was meant to be satirical.", "Many Facebook users, however, believed the claim, for example this comment, which translates as:", "“I have a friend residing close to this area. Due to deforestation, the water levels of the rivers have dropped and the waterfalls are also drying as the catchment areas have been impacted”", "Another comment in Sinhala says: “They are destroying a beautiful area”", "Similar claims were made using the identical image on Facebook as seen here.", "But the claims are all false; the photo was taken by AFP in 2017 and it actually shows the western border of the Amazon rainforest.", "The original image was captured by Carl De Souza for AFP and can be seen on the Getty Images website. It was published on September 22, 2017.", "The caption reads: “Aerial view of deforestation in the Western Amazon region of Brazil on September 22, 2017. Parts of the Western Amazon rainforest have suffered some of the heaviest deforestation in the Amazon as a whole, with figures puting it at a third higher than last year. Illegal logging has been hard to police in a country in economic crisis. “", "Here is a screenshot comparison of the misleading posts’ image (L) and the Getty Image (R):", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]