["About this rating", "On 1 November 2016, the liberal blog Occupy Democrats posted a story headlined, \"FBI Just Announced It’s Looking Into the Trump Campaign’s Ties to Russia\" that made it appear as if a criminal case against Donald Trump's former campaign manager, Paul Manafort, were imminent:", "It’s official. NBC is now reporting that Donald Trump’s campaign management has fallen under the scrutiny of an FBI inquiry, which is sure to blossom into a formal criminal investigation centered on Trump’s disgraced ex-manager Paul Manafort’s stewardship of the Republican campaign and his close ties to Ukraine. When he departed, Manafort was facing felony charges, and now the FBI’s suspicions have been confirmed by the evidence.", "New York Times found Ukrainian documents which outlined $12.7 million in previously unreported payments from a Ukrainian political party to Manafort, precipitating his departure from the campaign.", "In August 2016, the New York Times published a report that a secret ledger had been unearthed in Ukraine showing $12.7 million in payments designated from Viktor Yanukovych’s pro-Russian political party to Manafort between 2007 and 2012. When the story was published, anti-corruption officials in Ukraine told the paper that they had not yet determined whether Manafort had actually received the money.", "The Occupy Democrats story was based on a later 1 November 2016 NBC report:", "The FBI has been conducting a preliminary inquiry into Donald Trump's former campaign manager Paul Manafort's foreign business connections, law enforcement and intelligence sources told NBC News.", "Word of the inquiry, which has not blossomed into a full-blown criminal investigation, comes just days after FBI Director James Comey's disclosure that his agency is examining a new batch of emails connected to an aide to Hillary Clinton.", "While an unnamed source apparently spoke to NBC, the FBI at that time had not not announced an inquiry into Manafort's activities — the Bureau, generally, does not officially confirm whether or not they are investigating a matter, and they responded to our inquiry by saying just that. Similarly, they gave no formal statement to NBC.", "But on 20 March 2017, then-FBI Director James Comey broke from that practice to announce the FBI was in fact investigating allegations of collusion between the Trump campaign and the Russian government. During a public hearing of the House Permanent Select Committee on Intelligence, Comey said:", "The FBI, as part of our counterintelligence effort, is investigating the Russian government’s efforts to interfere in the 2016 president election.", "Less than two months later, President Trump fired Comey, prompting Deputy Attorney General Rob Rosenstein, who had been given oversight of the Russia investigation after Attorney General Jeff Sessions recused himself amid questions about his own communications with Russians, hired Special Counsel Robert Mueller.", "On 26 July 2017, FBI agents conducted an early-morning raid on the home of then-candidate Trump's former campaign chair Paul Manafort. On 27 October 2017, CNN reported that Mueller had filed the first charges in the investigation and at least one person was expected to be in custody within days.", "Stern, Grant.   \"FBI Just Announced It’s Looking Into the Trump Campaign’s Ties to Russia.\"\r\n    Occupy Democrats.   1 November 2016.", "Kramer, Andrew et al.   \"Secret Ledger in Ukraine Lists Cash for Donald Trump’s Campaign Chief.\"\r\n    The New York Times.   14 August 2016.", "Dilanian, Ken et al.   \"FBI Making Inquiry Into Ex-Trump Campaign Manager's Foreign Ties.\"\r\n    NBC News.   1 November 2016.", "Goldman, Adam, and Rappeport, Alan.   \"Emails in Anthony Weiner Inquiry Jolt Hillary Clinton’s Campaign.\"\r\n    The New York Times.   28 October 2016.", "Brown, Pamela, et al. \"First on CNN: First Charges Filed in Mueller Investigation.\"\r\n  CNN. 27 October 2017.", "Rosenberg, Matthew. \"Comey Confirms F.B.I. Inquiry on Russia; Sees No Evidence of Wiretapping.\"\r\n  The New York Times. 20 March 2017.", "Updated to note the FBI is investigating despite earlier unconfirmed reports.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]