["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Gary Johnson, the libertarian 2016 presidential candidate, recently assailed strict federal regulations on marijuana, saying that the drug causes far less harm when compared with legal drugs.", "Johnson was asked about the potential public health dangers of marijuana in states where it was recently legalized, during a CNN libertarian town hall on Aug. 3, 2016. He responded by arguing that the drug hasn’t actually killed anyone, and that prescription drugs are far more dangerous.", "\"I just think that so much research and development needs to take place that hasn't taken place. And that marijuana products deal -- or compete directly with legal prescription drugs that statistically kill 100,000 people a year, and there are no documented deaths due to marijuana.\"", "Johnson later repeated the claim during an Aug. 10 interview with On Point with Tim Ashbrook, a call-in radio show.", "Many supporters of marijuana legalization like to say that the drug poses no grave risks to a person’s health, but how does it actually compare with prescription drugs in terms of death statistics? We decided to dive into the data to find out.", "Clearing up the contextual smoke", "One immediate problem with Johnson’s claim is that it leaves out important context about how a drug can actually kill someone.", "Drugs directly kill people through toxic overdoses, but they can also indirectly kill people by causing accidents. We’ll look at both cases for marijuana. (The Johnson campaign did not respond to requests for clarification.)", "We decided to look at direct overdose deaths first. It’s very difficult to overdose on marijuana’s active ingredient. A review study comparing the acute lethal toxicity of commonly abused drugs shows that the lethal dose for marijuana (around 15 grams or above) is at least 1,000 times greater than the effective dose (15 milligrams), or the dose required to achieve a noticeable effect. In contrast, alcohol can become lethal at only 10 times the effective dose.", "Additionally, the U.S. Drug Enforcement Administration drug sheet for marijuana reports that no deaths from marijuana overdose have ever been recorded.", "However, marijuana has played an indirect role in fatalities. Experts that we talked with agreed that the drug itself doesn’t cause major acute health problems and is far safer than other medications. However, they said that it can still dangerously inhibit someone’s ability to make safe decisions.", "Dr. Ryan Vandrey, a researcher at Johns Hopkins University who specializes in the behavioral effects of marijuana, stressed that looking only at deaths from direct overdoses is a narrow way of examining a drug’s health effects.", "\"Too often individuals cite that individuals haven’t died from cannabis -- I don’t think that’s true. It certainly can be argued that cannabis use has contributed to the deaths of individuals, such as due to impairment during driving,\" he said.", "Dr. Jerome Avorn, a professor of medicine at Harvard Medical School, told us, \"The main risk from marijuana is from the risky or stupid things people do after using it, such as driving, rather than from any toxic effects of the substance itself, which is remarkably safe.\"", "A 2013 literature review article noted that higher levels of THC in the blood are associated with substantial driving impairment and a higher risk of accidents, especially when combined with moderate alcohol consumption. However, the authors emphasized that more research needs to be done on the issue.", "Other accidental deaths involve marijuana users who seemingly became out of touch with reality and took reckless actions. A report from 2015 detailed the case of a 19-year-old male who jumped off a balcony after consuming multiple servings of a marijuana cookie. The study suggests that a high enough dose of THC can result in a greater risk of \"adverse psychological effects.\"", "In summary, it appears that marijuana doesn’t directly cause overdose deaths, but there are documented cases where it likely led to accidental fatalities.The exact number of marijuana-related deaths that occur annually is difficult to pin down.", "One more caveat: synthetic marijuana has been attributed to overdose deaths. However, the experts we talked with told us that these drugs have nothing to do with marijuana and are a completely different class of substances.", "How about prescription drugs?", "As with marijuana, Johnson was unclear about whether he was referring to only prescription drug overdoses or to all deaths associated with prescription drugs, such as though allergies or deadly complications.", "Deaths from prescription drug overdoses are very common in the United States. The National Institute of Drug Abuse’s website shows that approximately 25,000 people died from prescription drug overdoses in 2014. Around 19,000 of these deaths came from prescription opioid pain relievers such as methadone and oxycodone.", "But Johnson said that prescription drugs, \"statistically kill 100,000 people every year.\" Where is he getting his data from?", "There’s a study from 1998 that showed there were over 100,000 fatal \"adverse drug reactions\" in hospital patients in the U.S. However, the study is 18 years old, and the National Institute for Drug Abuse told us that the study was based on invalid calculations that overestimated the number of deaths.", "Dr. Avorn emphasized that counting all deaths from prescription drugs is \"horrendously complicated,\" and that estimates vary wildly. A recent article in the New York Times pointed out how the interplay between a large number of potential causes of death makes it difficult to determine how many people die from improperly administered prescription drugs or other \"medical errors.\"", "Although Johnson’s claim is difficult to verify, the data show that at least tens of thousands of people do die from prescription drugs yearly.", "Our ruling", "Johnson said that marijuana competes with \"legal prescription drugs that statistically kill 100,000 people a year and there are no documented deaths due to marijuana.\"", "Marijuana is far less toxic than many prescription painkillers, which kill tens of thousands of people every year. Marijuana has never killed anyone through overdose, but Johnson’s vague claim leaves out the crucial fact that marijuana has played a role in accidental deaths. And the number of prescription drug deaths isn't estimated to be as high as Johnson said.", "The claim is partially accurate but leaves out important context. We rate his claim Half True.", "https://www.sharethefacts.co/share/455541b7-e999-4df3-be01-918edecb86ec", "Center for Disease Control and Prevention, \"Notes from the field: death following ingestion of an edible marijuana product,\" July 24, 2015.", "CNN Transcripts, \"Libertarian town hall meeting,\" August 3, 2016.", "Drug Enforcement Administration, \"Drug fact sheet: marijuana,\" accessed August 11, 2016.", "E-mail interview with Dr. Beatriz Carlini, Senior Research Scientist at the Alcohol and Drug Abuse Institute, August 11, 2016.", "E-mail interview with Dr. Jerome Avorn, Professor of Medicine at Harvard University, August 11, 2016.", "Gable, Robert. \"Comparison of acute lethal toxicity of commonly abused psychoactive substances,\" Addiction, 99, pp. 686-696, 2004.", "Hartman, Rebecca, and Huestis, Marilyn. \"Cannabis effects on driving skills.\" Clinical Chemistry, 59(3), March 2013.", "National Institute on Drug Abuse, \"Overdose death rates,\" December 2015.", "Phone interview with Dr. Ryan Vandrey, Associate Professor of Psychiatry and Behavioral Sciences at Johns Hopkins University, August 11, 2016.", "The New York Times, \"Death by medical error: adding context to deadly headlines,\" August 15, 2016.", "WBUR, \"Gary Johnson on what it means to be a libertarian in 2016,\" August 10, 2016.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]