["About this rating", "The White House Office of Management and Budget appears to be delaying a final decision on proposals that would definitively end the use of \"negro\" as a racial category in federal data gathering.", "It is already permitted as a racial category in federal data gathering, so there is no prospect of the Trump administration bringing it back.", "Whether or not the OMB will ultimately adopt those proposals.", "The long and complicated history of the word \"Negro\" in the United States took another bureaucratic twist in late 2017, when articles appeared with the shocking charge that Trump's White House was considering bringing back government use of the word. The left-wing, anti-Trump web site Truth Examiner reported:", "For most of the 1900s, the term “Negro” was considered the best term for African-Americans, but it eventually became antiquated, and even insulting — reminding Americans of a time when Black citizens couldn’t vote and didn’t have equal rights.  Now, even though government agencies have removed the word from most surveys and census reports, it’s not yet forbidden to use, the way Trump is forbidding the CDC from saying “transgender,” for instance.", "Former President Barack Obama signed a law to “modernize” 1970’s era laws to replace “Negro” with “African-American,” and “Oriental” with “Asian-American.”", "Obama also has a proposal to remove “Negro,” “Far East,” and other antiquated words from all government documents and language...But it doesn’t seem that Trump is ready to forbid these words, even as he prohibits “diversity” and “Science-based” from other agencies. Since he seems to think that America was last great in the 1960’s, he probably wants the term to be used more frequently again.", "In reality, the situation is much more complicated that the article presents. In 1997, the Clinton administration approved the use of \"Negro\" in federal data gathering, but a working group established by the Obama White House and carried over into Donald Trump's administration has repeatedly proposed ending federal use of \"Negro\" as a racial category.", "However, Trump's Office of Management and Budget (the White House agency responsible for setting these federal standards on data gathering) appears to have stalled a final decision on whether and when to implement these changes, which would effectively bar the use of the word by federal agencies.", "\"Negro\" has lost favor as a racial category. It was widely used from the 19th century until the Civil Rights movement of the 1960s, when many in the black community began to reject the term as an offensive throwback to the Jim Crow era of segregation and oppression.", "In the last half century, \"black\" and \"African American\" have almost entirely supplanted \"negro\" in popular usage, and as the term increasingly came to be seen as outdated and even offensive, it has gradually been eliminated from use by government entities.", "In 2013, for example, the Census Bureau ruled that \"negro\" would no longer be a category on census forms; the United States Army followed suit in 2014. In 2016, President Barack Obama signed a bill that amended two specific existing laws by replacing their use of the word (along with other archaic racial and ethnic categories) with \"African-American.\"", "More broadly, though, federal agencies are still technically permitted to use \"Negro\" as a racial category in forms and documents due to a 1997 decision by the Clinton White House's OMB, which set what are known as the Standards for the Classification of Federal Data on Race and Ethnicity:", "OMB accepts the following recommendations concerning the term or terms to be used for the name of the Black category:", "The name of the Black category should be changed to \"Black or African American.\" The category definition should remain unchanged. Additional terms, such as Haitian or Negro, can be used if desired.", "The ruling was based on recommendations by a special working committee established by the OMB, which had earlier reported that using the category \"Black or African American\" in federal data gathering would cover most individuals in that community, but that \"Negro\" should be allowed to persist as an optional additional category because the term, in their words, \"may be favored by older Blacks.\" The report also concluded: \"'Colored' may be favored by some Blacks in the South.\"", "Although federal agencies are technically allowed to use the word as a racial category in data gathering, we could find no evidence that any of them do so.", "The Obama administration set up a new committee in 2014 to revisit these standards on racial and ethnic categories in federal data gathering. In September 2016, the committee recommended removing \"Negro\" from the standards (along with \"Far East\"), meaning the term would no longer be permitted as a racial category in any federal data gathering.", "The proposals went out for public consultation, and in March 2017, following the transition to the Trump administration, the committee once again proposed removing \"Negro\" from the standards.", "The source of the claim that the Trump administration is \"considering\" the proposals is the fact that the OMB has not yet announced its final decision on them.", "NPR reported that the decision was not announced when it was expected on 1 December 2017, and the OMB's own March 2017 publication had expected it sooner than that, in order to give time for any revisions that might be necessary ahead of the 2020 Census.", "We asked the OMB to clarify the expected date of their final decision and asked for an explanation of any delay there might have been, but have not yet received a response.", "The apparent delay in issuing a final decision on the OMB committee's recommendations does not necessarily mean that the Trump administration is considering not implementing them.", "There are sometimes delays in final decisions on federal policy proposals and recommendations for innocuous logistical reasons.", "Sally Katzen, who was centrally involved in the Clinton-era changes to racial and ethnic categories as head of the OMB's Office of Information and Regulatory Affairs in 1997, told NPR: \"The objective in each instance is to arrive at the right decision, not at any old decision.\"", "In this matter, there is no evidence that the apparent delay is caused by opposition to ending the use of these racial categories.", "Whatever the Trump administration might be considering, it is not considering \"bringing back\" the use of the word as a racial category in federal data gathering, as it is technically already allowed under the Clinton administration's 1997 decision.  What does remain to be seen is whether Trump's Office of Management and Budget will adopt the proposals of a working group first established by the Obama administration and finally put an end to the use of \"Negro\" as a racial category on federal forms.", "Ballard Brown, Tanya.  \"No More 'Negro' for Census Bureau Forms and Surveys.\"\r\n  National Public Radio.  25 February 2013.", "Associated Press.  \"Army Drops Use of Term 'Negro' in Document.\"\r\n  Fox News.  6 November 2014.", "Meng, Rep. Grace.  \"H.R. 4238 - To Amend the Department of Energy Organization Act and the Local Public Works Capital Development and Investment Act of 1976 to Modernize Terms Relating to Minorities.\"\r\n  United States House of Representatives.  20 May 2016.", "LaCapria, Kim.  \"Oriental Shrug.\"\r\n  Snopes.com.  23 May 2016.", "Office of Management and Budget.  \"Revisions to the Standards for the Classification of Federal Data on Race and Ethnicity.\"\r\n  Obama White House Archives.  30 October 1997.", "Office of Management and Budget.  \"Recommendations from the Interagency Committee for the Review of the Racial and Ethnic Standards to the Office of Management and Budget Concerning Changes to the Standards for the Classification of Federal Data on Race and Ethnicity.\"\r\n  Federal Register.  9 July 1997.", "Office of Management and Budget.  \"Standards for Maintaining, Collecting and Presenting Federal Data on Race and Ethnicity.\"\r\n  Federal Register.  30 September 2016.", "Office of Management and Budget.  \"Proposals from the Interagency Working Group for Revision of the Standards for Maintaining, Collecting and Presenting Federal Data on Race and Ethnicity.\"\r\n  Federal Register.  1 March 2017.", "Lo Wang, Hansi.  \"Trump Administration Delays Decision on Race, Ethnicity Data for Census.\"\r\n  National Public Radio.  2 December 2017.", "Davis, Rachaell.  \"Why is the White House Stalling on Eliminating the Term 'Negro' from All Federal Forms?\"\r\n  Essence.  18 December 2017.", "Lo Wang, Hansi.  \"'Negro' Not Allowed on Federal Forms? White House to Decide.\"\r\n  National Public Radio.  13 December 2017.", "Kaplan, Erin Aubry.  \"The Term 'Negro'? Color it Obsolete.\"\r\n  Los Angeles Times.  8 February 2010.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]