["Mahindra Group Chairman Anand Mahindra tweeted a video of a circle visible around the sun. According to Anand Mahindra, he had received this on WhatsApp where it was claimed that this is a full rainbow visible “once in 100-250 years”. “Had never heard about this. As we struggle with the monsoon deluge, it’s good to remind ourselves what lies ahead just after the rain.”, reads Mahindra’s tweet. The tweet claimed that this was seen in Gujarat. It has garnered more than 5,500 retweets so far.", "Received in my #whatsappwonderbox “Full Rainbow ‘Brahma Dhanush’in Gujarat. Visible once in 100-250 years.” Breathtaking. Had never heard about this. As we struggle with the monsoon deluge, it’s good to remind ourselves what lies ahead just after the rain. Lifts my Sunday spirit pic.twitter.com/ByxII2rHMS", "— anand mahindra (@anandmahindra) August 4, 2019", "Mahindra’s tweet was also retweeted by Bollywood actor Amitabh Bachchan.", "Many other individuals on Facebook have shared the video with a similar narrative. Journalist Madhav Narayan had also posted the video claiming to be a full rainbow seen in Gujarat.", "First of all, the video is circulating on social media since 2017. Twitter user Arvind Shenoy posted the same video on October 8, 2017, claiming it to be from Pune, Maharastra.", "FULL CIRCLE RAINBOW, ALSO CALLED BRAMHA DHANUSHYA. SEEN IN PUNE TODAY. @iMac_too ,@brakoo pic.twitter.com/w25B4ZAqqc", "— Dr. Arvind Shenoy (@DrArvindShenoy) October 8, 2017", "Alt News found that the video posted by Anand Mahindra is that of a 22 degree Halo and NOT Rainbow. We found several articles written on the phenomenon which is not uncommon and has been seen at various places around the world. A sun halo or 22 degree Halo is a ring caused by sunlight passing through ice crystals in cirrus clouds within the earth’s atmosphere, according to University of Illinois’ Weather World Project 2010 explainer on the topic. The ring is formed around the sun or moon.", "While primary rainbows are red on the outside and violet on the inside, sun halos are red inside and violet outside. In the comparison below, an image of the primary rainbow (left) has been juxtaposed with a sun halo (right). It may be reiterated here that a halo surrounds a sun or moon.", "Sun halos photographed during the days (two on the left) and nights (two on the right) around the world have been placed in the collage posted below to depict that it is not an uncommon phenomenon.", "In 2018, The Hindu had reported an incident of people in Shivmogga district of Karnataka witnessing a similar 22-degree halo. “Haronahalli Swamy, a functionary of Shivamogga Amateur Astronomers Association, told The Hindu that the ‘Sun Halo,’ a circle of light with 22 degree radius, is produced when sun light is refracted in hexagonal suspended ice crystals and super cool water droplets formed in the cirrus clouds. The halo is created when the Sun is aligned with these crystals at a particular angle”, stated the report.", "While the video posted by Anand Mahindra depicts a sun halo, a full circle rainbow has also been spotted several times around the world. An explanation given in a Slate Magazine article reads, “We see rainbows in the sky because in general, the ground is close to you. When we look up toward the sky we see for a long way, and there are lots of raindrops along your eyeline that can add their light together to make the rainbow. When you look down, the ground gets in the way, there aren’t as many drops, and you don’t see a rainbow.”", "The official website of the United Kingdom’s Met Office also reiterated, “The key factor that determines how much of a rainbow we see is our visual reference point. In most cases we only see less than half of a circle – the characteristic rainbow arc we are all familiar with. However, if you are lucky enough to be in the right position at the right time, you can see a full circle rainbow in all its splendour.” The article", "In cases of a rainbow, sunlight that enters individual droplets of liquid water bends or refract multiple times. Then, refraction allows the droplet to separate the sunlight into its component colours.", "In the video posted below, a double rainbow which essentially doesn’t have a sun or moon in the centre like a sun halo can be seen.", "🔥 Ever Seen A Full Rainbow? 🔥 pic.twitter.com/pUBRpd3wQy", "— Nature is Lit🔥 (@NaturelsLit) June 29, 2019", "In conclusion, a video of a 22-degree halo observed at an unverified location was passed off by Anand Mahindra as that of a full rainbow visible only 100-250 years.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video of a ladder moving on its own, purportedly from Jharkhand, is viral on…", "In a 2-minute video, a man recommends a “technique” to prevent infection from Omicron, the…", "A video of a set of iron nails that appear to melt after being placed…", "Several social media users have shared an image that shows two columns — ‘Cepa/variante’ (Spanish…", "A 90-second video of a man dissecting a banana has been shared on the internet…."]