["The photo was published here on Facebook on August 10, 2019 and has been shared more than 3,000 times since.", "The Hindi-language caption of the post translates to English as: “This has become the situation of Kashmir that people carrying the dead bodies for funerals are also being shot at by pellet guns. What kind of a free Kashmir is this, brother.\"", "Below is a screenshot of the misleading Facebook post:", "The same photo and claim were shared in other posts on Facebook, for example here and here, and on Twitter here and here.", "On August 5, 2019, the Indian government revoked disputed Kashmir’s special status, granted by Article 370 of the Indian constitution. Here is an AFP video report on the issue.", "But the photo does not show the current situation in Kashmir.", "The image was first published here on a news website called “The Citizen” September 27, 2018.", "The picture, taken by Kashmir-based photojournalist Basit Zargar was, the report says, taken in September 2018 when protests and clashes broke out after a 28-year-old civilian was killed in Noorbagh area of Qamarwari in Srinagar after Indian forces opened fire during a ‘cordon and search operation.’", "The photo was also published here on October 18, 2018, on an Urdu-language blog, where the image has a watermark of the photographer’s name and the date.", "The image used in the misleading posts also contains the watermark, which has been blurred.", "In September 2018, authorities imposed curfew in the region and also suspended mobile Internet services, according to local and international media reports, for example here and here in September 2018.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]