["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Brad Woodhouse, president of the pro-Clinton Super PAC Correct the Record, said Hillary Clinton's handling of her emails broke no laws.", "Questions about Hillary Clinton’s handling of her email records during her time as secretary of state are likely to dog her throughout her presidential campaign. But the candidate will have many defenders, including Correct the Record, a super PAC created to support Clinton.", "Correct the Record president Brad Woodhouse, a long-time Democratic operative, dismissed the entire email matter during an interview recently on CNN.", "\"Every federal employer has to consider what they archive as work-related and what they consider personal, and she did what every other federal official did, what every other previous secretaries of state did,\" Woodhouse told New Day co-hosts Chris Cuomo and Alisyn Camerota on June 5, 2015. \"Look, nobody has found -- you know, the New York Times  wrote a story that some type of laws had been broken. Turns out they had to retract that. People had to back off that, and it's totally not true.\"", "In the news business, retractions don’t come lightly and we wondered if in fact, the newspaper of record had taken back part of what it reported on Clinton.", "In reality, the New York Times hasn’t retracted a word. The closest it came was in a column from public editor Margaret Sullivan, who wrote that the article that broke the story \"was not without fault.\" But the lapse, Sullivan continued, was a failure to list exactly which regulations Clinton might have ignored.", "That lack of specificity, Sullivan wrote, allowed Clinton supporters to score political points. \"Not because it highlighted a factual error — the story was accurate — but because it kicked up enough dust to obscure the facts.\"", "Sullivan, we should note, doesn’t speak for the newspaper. Her job is to serve as an internal but independent critic of the paper’s work, something akin to an inspector general in government.", "Formal retractions or corrections come from the editors themselves, and as we noted, that has not happened.", "Adrienne Watson, a spokeswoman for Correct the Record, said Woodhouse was not using the word retraction in an official sense. Rather, he was speaking of the gradual fade in New York Times coverage that insinuated that Clinton had broken some law.", "\"Ultimately the charge was retracted, even if the New York Times never issued a correction,\" Watson said. \"Their own experts changed their minds.\"", "Let’s unpack that.", "What the ‘New York Times’ said", "The newspaper broke the story under the headline \"Hillary Clinton Used Personal Email Account at State Dept., Possibly Breaking Rules.\" It’s opening lines were \"Hillary Rodham Clinton exclusively used a personal email account to conduct government business as secretary of state, State Department officials said, and may have violated federal requirements that officials’ correspondence be retained as part of the agency’s record.\"", "So the top of the story suggested a possible violation, which falls short of charging outright that she broke a law, as Woodhouse said.", "But the article does lay the groundwork to add weight to the idea of a potential violation.", "\"Under federal law, however, letters and emails written and received by federal officials, such as the secretary of state, are considered government records and are supposed to be retained so that congressional committees, historians and members of the news media can find them.\"", "And:", "\"Regulations from the National Archives and Records Administration at the time required that any emails sent or received from personal accounts be preserved as part of the agency’s records.", "But Mrs. Clinton and her aides failed to do so.\"", "About week and half after the initial story, the New York Times wrote that the regulations on preserving emails were vague.", "\"Although the White House has strict requirements dating back two decades that every email must be saved, there is no such requirement for federal agencies. Instead they are in charge of setting their own policies for determining which emails constitute government records worthy of preservation and which ones may be discarded.\"", "While, as the story noted, President Barack Obama signed a 2014 bill that required government officials who use personal email accounts to hand over those records in 20 days, that law took effect after Clinton left the State Department. According to Thomas Blanton, a government disclosure expert cited in the story, this gave Clinton \"wiggle room.\"", "Blanton was also cited in the original article. However, it is not accurate to say he changed his mind from one week to the next. In the first New York Times story, Blanton said \"it was a shame\" that the emails from Clinton’s personal account had not been turned over automatically.", "The New York Times also cited in its first story Jason Baron, a lawyer at Drinker Biddle and Reath, who is a former director of litigation at the National Archives and Records Administration. At the time, Baron said he could not think of another instance when a high-ranking official used a private email account for all government business. Baron described Clinton’s email scenario as a serious breach.", "However, Baron did not say the practice was illegal. In the weeks that followed, he consistently said it was a bad practice.", "Our ruling", "Woodhouse said that the New York Times retracted the charge that Clinton’s handling of her email broke a law. That's wrong on two points. The newspaper never accused Clinton of breaking a law. Also, while the newspaper’s public editor said the original story should have included more details, the paper never issued a retraction or a correction. A spokeswoman for Woodhouse’s organization agreed with that point.", "The claim is not accurate, and we rate it False.", "CNN, New Day, June 5, 2015", "New York Times, Making Clinton Coverage Bulletproof, March 7, 2015", "New York Times, Hillary Clinton Used Personal Email Account at State Dept., Possibly Breaking Rules, March 2, 2015", "Media Matters, An open letter to the New York Times, March 3, 2015", "USA Today, Hillary Clinton's campaign gets super PAC boost, May 12, 2015", "Nation of Change, The New York Times Reverses Course on Clinton’s Emails After Public Editor Admits Fault in Reporting, March 19, 2015", "Politico, Brad Woodhouse bio, undated", "New York Times, Vague Email Rules Let Federal Agencies Decide When to Hit Save or Delete, March 13, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]