["By Robert Farley", "Posted on September 20, 2018", "In an op-ed, Hillary Clinton went too far with her criticism that President Donald Trump has shown a “complete unwillingness to stop” Russian interference in U.S. elections. The Trump administration has taken a number of steps to combat foreign interference in future elections.", "Among them:", "While the administration claims Trump has taken “historic actions” and implemented a “whole-of-government approach to safeguard our nation’s elections,” some have argued that the administration’s efforts have not gone far enough to effectively combat the problem. Others have faulted Trump for not taking a harder public stance against Russian interference. That’s fair for politicians to debate. But election security experts say the president and his administration have taken some positive steps to combat foreign meddling in U.S. elections.", "Clinton’s overreach reminds us of when Trump wrongly claimed that President Barack Obama “did nothing” in the months leading up to the 2016 presidential election about Russia meddling in the election. As we wrote then, among other things, Obama spoke to Putin about the issue in September 2016, and his administration worked with state officials from mid-August until Election Day to prevent voting systems from being hacked.", "Then, as now, the rhetoric about presidential inaction goes too far.", "Clinton’s comment came in an op-ed for The Atlantic, published on Sept. 16 under the headline “American Democracy Is in Crisis.” Clinton, the Democratic presidential nominee who lost the 2016 election to Trump, argued that “the legitimacy of our elections is in doubt,” adding, “There’s Russia’s ongoing interference and Trump’s complete unwillingness to stop it or protect us.”", "As we have written, Trump has sent mixed messages on Russian meddling, at times acknowledging that he believes U.S. intelligence officials who concluded Russians interfered in the 2016 election. Other times, he has tempered those statements with other comments such as, “Nobody really knows for sure,” or he has tweeted that the Russia investigation is “all a big hoax.”", "Nonetheless, he and the administration — at his direction — have taken numerous steps to combat Russian election meddling.", "“This appears to be one of those cases where the president’s words belie his actions,” said Charles Stewart III, a political science professor at MIT and one of the co-authors of a report from the National Academies of Sciences, Engineering, and Medicine on ways the government can work to protect U.S. elections from outside interference.", "“The federal government has done quite a lot to address Russia’s ongoing interference with America’s elections,” Stewart told us via email. “Because some of this comes from the Department of Homeland Security (DHS), it is fair to say that the administration has clearly been working to address this interference. Other actions have come from parts of the executive branch, such as the special counsel and the Election Assistance Commission, that probably can’t be called ‘the administration,’ but is certainly part of the web of activities the administration has been involved with.”", "“I know for a fact that the DHS has been quite active working with state and local election officials to enhance the cyber defenses of election administration,” Stewart said. “They have worked with dispatch (after some bureaucratic foot-dragging) to get top election officials in each state security clearances, so that they and other security agencies can share classified information about what they know. They are helping to establish information-sharing organizations, like the Government Coordinating Council and MS-ISAC. They have worked directly with state and local election offices to do things like security scans and audits. If there’s anything limiting DHS in this regard, it’s that their capacity is beginning to be outstripped by demand.”", "A spokesperson for the National Association of State Election Directors told us via email, “The Department of Homeland Security (DHS) and the U.S. Election Assistance Commission (EAC) have been critical partners for state and local election officials in preparing for the November 6th midterm election and beyond. Both DHS and the EAC have provided guidance and best practices, and many states are taking advantage of free security services offered by DHS; those states that aren’t using DHS services are using private vendors or in-state resources to accomplish the same goals.”", "Responding to criticism from some Democrats that it wasn’t addressing the problem, the White House put out a press release on Aug. 2 outlining a “whole-of-government approach to election security being implemented at [Trump’s] direction.”", "The same day, a handful of Trump administration national security officials held a press conference to highlight the work being done to protect the integrity of the elections.", "“The president has specifically directed us to make the matter of election meddling and securing our election process a top priority,” said Director of National Intelligence Dan Coats, who warned in July that “the warning lights are blinking red again” with regard to foreign attacks on the U.S. digital infrastructure.", "Efforts have been made, Coats said, “to share more information across the federal government, as well as with state and local governments, and also with the public and the private sector.”", "Coats said he leads an “interagency working group” that meets weekly to ensure “election security and integration of our efforts.”", "For DHS’ part, Secretary of Homeland Security Kirstjen Nielsen said the agency has worked with state and local officials. “Whether it’s offering no-cost, voluntary technical assistance or sharing best practices for securing online voter registration databases, or providing technical advice on ransomware and destructive malware, our department stands ready to provide tailored support based on each jurisdiction’s unique needs,” she said.", "To date, she said, “all 50 states, the District of Columbia and over 900 local governments have partnered with DHS in order to bolster the resilience of the nation’s election infrastructure.”", "FBI Director Christopher Wray said that shortly after becoming director he created “a new foreign influence taskforce at the FBI, which was designed to identify and counteract the full range of malign foreign influence operations targeting our democratic institutions and our values.”", "Wray also talked about increased information- and intelligence-sharing with state and local government officials and the private sector.", "The FBI also has been working with social media and technology companies, providing classified briefings and sharing “specific threat indicators and account information, and a variety of other pieces of information so that they can better monitor their own platforms,” Wray said. The special counsel’s office earlier this year indicted three Russian organizations and 13 Russian nationals for allegedly engaging in an extensive plot during the 2016 campaign to “produce, purchase, and post advertisements on U.S. social media and other online sites expressly advocating for the election of then-candidate Trump or expressly opposing Clinton,” according to the indictment.", "The same day as the press conference, National Security Adviser John Bolton sent a letter to Senate Democrats highlighting the president’s actions “to ensure the integrity of our elections,” such as leveling sanctions against Russia, expelling Russian intelligence officers and sanctioning Russian oligarchs and companies they control, all as a result of the Russian interference in the election.", "More recently, Trump issued an executive order on Sept. 12 declaring a “national emergency” to deal with the threat of foreign interference in U.S. elections.", "Executive Order 13848, Sept. 12: I, DONALD J. TRUMP, President of the United States of America, find that the ability of persons located, in whole or in substantial part, outside the United States to interfere in or undermine public confidence in United States elections, including through the unauthorized accessing of election and campaign infrastructure or the covert distribution of propaganda and disinformation, constitutes an unusual and extraordinary threat to the national security and foreign policy of the United States.", "The order instructs the director of national intelligence to conduct a post-election “assessment of any information indicating that a foreign government, or any person acting as an agent of or on behalf of a foreign government, has acted with the intent or purpose of interfering in that election.” It also would give the president the discretion to impose sanctions on governments found to have improperly interfered in U.S. elections.", "All of those efforts show some tangible progress by the administration to confront and combat the issue of foreign meddling in the U.S. elections, election security experts told us.", "“On the positive side, numerous government agencies now have task forces focused on the threat of foreign interference in our elections or our democracy more broadly,” David Salvo, deputy director of the Alliance for Securing Democracy, a bipartisan initiative that uses top national security experts to develop “comprehensive strategies to defend against, deter, and raise the costs on Russian and other state actors’ efforts to undermine democracy and democratic institutions.”", "“That shows there’s a general consensus across government that Russian interference will remain a challenge, reflecting public statements on the issue by several Cabinet officials,” Salvo told us via email. “There has also been an expansion of sanctions against Russian individuals who were involved in or facilitated interference operations in the United States and other forms of corruption.”", "“You can’t say they are doing nothing,” said Jake Braun, a former White House liaison to the U.S. Department of Homeland Security in the Obama administration who is now executive director of the University of Chicago’s Cyber Policy Initiative.", "But Braun, Salvo and other experts say there are other actions Trump should and could be taking, but has not.", "Braun told us in a phone interview that DHS has done cyber assessments and has distributed “Albert sensors,” which can identify bad actors in a network. But these have gone to a “tiny fraction” of the election districts in the country, Braun said. “While progress has been made, there is a lot more to be done.”", "Added Salvo, “Through legislation, Congress has given the administration wide latitude to expand sanctions against Russian individuals and sectors to really raise the cost of conducting interference operations against U.S. democracy, and the administration hasn’t fully implemented that legislation. Furthermore, while the recent Executive Order is a positive step in terms of signaling the degree of seriousness with which the administration ostensibly views this threat, it still gives the president discretion whether to impose sanctions on those who interfere in our elections. There should be tripwires that trigger mandatory sanctions, as proposed in bipartisan legislation currently before Congress, rather than leaving everything for the president to decide.", "“Finally, I’d say that until the signing of the Executive Order, President Trump hasn’t publicly demonstrated to the American people that he himself takes this threat seriously,” Salvo said. “It’s one thing for his Director of National Intelligence or Secretary of State to say they believe Russian interference remains a threat. It’s another entirely for President Trump to say so. Leadership from the highest levels is a critical form of deterrence to defend our democratic institutions and processes from foreign interference, and hopefully builds bipartisan consensus among American citizens and lawmakers that we need to take urgent action to defend against this threat. Going forward, we need more statements from the president that mirror his comments on the Executive Order.”", "Stewart — who was part of a committee including computer science and cybersecurity experts, legal and election scholars, social scientists, and election officials that spent two years researching the issue for the National Academies — said a president who was “laser-focused on this issue” would:", "“I think there’s evidence of less-than-full movement on points 1 & 3, a reluctance to do # 2, and too much timidity to take the lead on # 4,” Stewart said in an email.", "And while Congress authorized $380 million in March for states to bolster election security, Democrats have faulted Trump for failing to convince Republicans to support an amendment proposed in August that would have provided an additional $250 million to states to help them protect their elections. The amendment was rejected in a 50-47 vote, largely along partisan lines. Explaining Republican opposition, Sen. James Lankford said he wanted to see how the initial $380 million was spent before considering additional funding.", "Again, there is room for political debate about whether Trump has done enough to address election security and the threat of interference from Russia. But Clinton went too far with her assertion that Trump has shown a “complete unwillingness to stop” it.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]