["About this rating", "On 8 March 2013, John Brennan was sworn in as CIA Director. He was nominated by President Barack Obama on 7 January 2013, and in February of that year a rumor began to circulate about Brennan's purported conversion to Islam while he was stationed in Saudi Arabia in the 1990s:", "Objections were raised to Brennan's nomination by lawmakers such as Rand Paul, who filibustered Brennan's confirmation over his prior sanctioning of the use of drones. But a fringe objection echoed outside the Beltway, where Brennan's fitness to serve was questioned due to his supposedly becoming a Muslim while stationed in Riyadh, Saudi Arabia. The claim's fire was fueled after Brennan was sworn in to his office not on a Bible but on a copy of the Constitution.", "The rumor about Brennan's conversion to Islam coalesced after a 9 February 2013 radio broadcast during which former FBI agent John Guandolo levied the accusation. The most relevant portion of the interview has been excerpted below:", "On 13 February 2013, talk show host Glenn Beck repeated the claim in his frequently employed \"just asking questions\" style. According to Beck, the assertion was \"plausible\" simply by merit of having been uttered aloud at one point in the not too distant past, and it was therefore reasonable to speculate as to whether Brennan had in fact converted to Islam:", "Beck acknowledged he had no evidence to offer in support of such a claim:", "I will tell you, I don't know if this is true or not. I will tell you that there is so much in John Brennan's background that should be questioned that this is plausible. Now, if somebody makes a charge like that, shouldn't we at least explore it before we put him as the chief of all intelligence? It seems that we can't ask reasonable questions any more.", "Different versions of the \"Brennan is a Muslim\" claim have a single thing in common: ex-FBI agent John Guandolo. Guandolo resigned from his position with the Bureau in December 2008 after he was caught engaging in a sexual relationship with a key confidential source in the midst of a corruption investigation of a Louisiana politician. Since then, he has created a burgeoning second career training law enforcement groups to identify potential covert Islamic threats to the United States.", "However, Guandolo's credibility in this area has been questioned, one example being an NPR segment that primarily focused on Jordanian-American Omar al-Omari. Guandolo was central to the segment due his insinuation during a law enforcement training course that Omari was connected to a vague cabal of \"terrorists\":", "One of the trainers in Ohio that day was a man named John Guandolo. He's a former FBI agent and former Marine. According to people in the training class that day and Guandolo himself, a photograph of Omari with members of the Council on American-Islamic Relations, a local Muslim advocacy group, was put up on the screen. According to the people who were there, Guandolo and the other visiting trainers didn't say outright Omari was a terrorist, but they suggested that he had links to bad people — people who were members of the Muslim Brotherhood, Hamas and even al-Qaida.", "\"I stand by what I said that day about Omari,\" Guandolo told me, though he declined to say so on tape. \"The facts are on my side.\"", "Guandolo suggested when I interviewed him on the phone that there were things he knew about Omari that the FBI didn't. \"We know we have our facts right, because we have to,\" Guandolo said. (Nearly a dozen sources contacted by NPR in the intelligence community, the FBI and at the Department of Homeland Security said Omari has no links to terrorists or terrorism. They said the accusations against him are unfounded.)", "There is no certification process to vet [terrorism] experts [such as Guandolo]. They simply present their resumes and, often through word of mouth, they get hired. The trainers tend to be former government officials. Sometimes they have had key roles in the federal government fighting terrorism. Just as often, they have not. There's growing evidence that many of these training sessions are providing officers at the grass roots with a biased view of Muslims in America. That is what appears to have happened to Omari.", "Guandolo remains the sole source we've found for this claim about John Brennan's being a Muslim, with no versions of it tracing back to any source other than him. The only thing approaching proof the former FBI agent had cited in support of his claim is the fact that Brennan once said during a speech that he had \"marveled at the majesty of the Hajj.\" Since the Hajj is an annual pilgrimage undertaken by Muslims to Mecca, a holy city that non-Muslims not are allowed to enter, Guandolo arrived at the extremely far-fetched conclusion that Brennan himself must be a Muslim in order to have marveled at it. But Brennan didn't say he had ever taken part in such a pilgrimage or visited Mecca himself, and quite obviously someone with his extensive background in Middle Eastern affairs could know (and have seen) something of the Hajj without having participated in it:", "I did spend time as an undergraduate at the American University in Cairo in the 1970s. And time spent with classmates from Egypt, from Jordan, from Palestine, and around the world who taught me that whatever our differences of nationality or race or religion or language, there are certain aspirations that we all share: to get an education. To provide for our families. To practice our faith freely. To live in peace and security. And during a 25-year career in government, I was privileged to serve in positions across the Middle East — as a political officer with the State Department and as a CIA station chief in Saudi Arabia. In Saudi Arabia, I saw how our Saudi partners fulfilled their duty as custodians of the two holy mosques of Mecca and Medina. I marveled at the majesty of the Hajj and the devotion of those who fulfilled their duty as Muslims by making that privilege — that pilgrimage.", "Guandolo's claim is not only unfounded but problematic. Even if Guandolo's demonstrated inclination to make claims without factual basis were not considered, his statements constitute a conflict of interest due to his post-FBI career: Guandolo markets the idea of an imminent, pervasive threat to security in the United States has resulted from a conspiracy by Muslims to infiltrate the government at its highest levels and is paid for his \"expertise\" through his being hired to provide lectures and training classes on the subject.", "Aside from Guandolo's shaky accusation, the one other scanty piece of evidence cited in support of this claim is that the movie Zero Dark Thirty, about the U.S. intelligence and military operation to track down and kill Osama bin Laden in Pakistan, featured a top-level CIA character known as \"The Wolf\" who was depicted in the film as a practicing Muslim and shown praying in his office. Some who have heard the rumor about Brennan have speculated this character was intended to represent him, but the personal details of the real-life man on whom the character was based (known only as \"Roger\") aren't a match for Brennan. And Brennan, who at the time was the White House counterterrorism adviser, was represented in the film by a composite character known only as \"National Security Advisor,\" portrayed by a different actor than the one who filled the \"Wolf\" role.", "While it is true that John Brennan was sworn into office using a copy of the U.S. Constitution rather than a Bible, that fact alone is not definitive proof of any particular religious sentiment. Had he sought to conceal his Islamic faith, it's just as likely he would have opted to use a Bible (particularly if he had no intent to uphold the very Constitution on which he swore his oath). And if we are to believe that John Brennan is a closeted Muslim, then we would also have to believe that either no one in the highest levels of the U.S. government has the least bit of concern about that fact (not enough to speak up about it, anyway), or that Brennan has managed to successfully hide his religious beliefs from the entirety of the vast intelligence network that he heads. The more logical answer is that John Brennan could very well have no faith at all, or that he holds the ideals of the Constitution higher than the ideals of religion in relation to his duties as head of the CIA.", "In January 2017, John Brennan was succeeded as CIA Director by Mike Pompeo.", "Rayfield, Jillian.   \"John Brennan Is a Secret Muslim, Says Anti-Islam Activist.\"\r\n    Salon.   10 February 2013.", "Rayfield, Jillian.   \"Right Wing Runs with “John Brennan-Is-a-Muslim' Theory.\"\r\n    Salon.   14 February 2013.", "McCarthy, Tom.   \"John Brennan Sworn in on First Draft of Constitution — Without the Bill of Rights.\"\r\n    The Guardian.   8 March 2013.", "Temple-Raston, Dina.   \"Terrorism Training Casts Pall Over Muslim Employee.\"\r\n    NPR.   18 July 2011.", "Mosely, Brian.   \"Islamic Subversion Alleged by Speaker.\"\r\n    [Shelbyville] Times-Gazette.   17 February 2009.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]