["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Margaret Gomez, a Democrat up for re-election as Travis County's Precinct 4 commissioner, has positioned herself as a candidate for the people. Lately, she's boasted about stopping Capital Metro, Austin's public transit authority, from increasing bus fares for seniors and people with disabilities. \n\nFrom a campaign flier distributed after the South Austin Democrats endorsed Gomez on Jan. 12: \"Margaret Gomez has delivered results for Southeast Travis County... (she) stopped Capital Metro from raising fares for senior and disabled citizens.\"\n\nGomez, a commissioner since 1995, served as the county's appointee to the board that oversees Capital Metro from 1997 through 2009 including a closing 19-month run as the board chair. \n\nGomez's campaign pointed to the successful motion she made during a November board meeting to exempt seniors and people with disabilities from a bus and rail fare hike. The board voted 4-1 to increase the fare for a one-way bus ride to $1 and increase other discounted fares — like the 31-day adult bus pass — by more than 100 percent.\n\nThe new fares kicked in Jan. 18. Thanks to the exemption initiated by Gomez, older and disabled riders continue to ride for free.\n\nBefore the vote, Gomez had posted a statement posted on a pro-Democratic blog, the Burnt Orange Report: \"I do not believe that we should balance the agency's budget on the backs of the elderly and disabled citizens, which is why I will ask the board to exempt seniors and disabled citizens from any fare increase.\"\n\nYet Gomez wasn't always committed to sparing those riders from paying fares, as her record on the transit agency board shows. \n\nIn May 2008 board members — including Gomez — twice voted unanimously in favor of a two-step fare increase plan that would have doubled the price of bus fare to $1 by 2011. Seniors and people whose disabilities weren't severe enough to qualify for the special door-to-door transit services required by federal law would have started paying 50-cent fares.\n\nThe plan went to the Local Government Approval Committee, an ad hoc body of elected officials — Gomez not included — which amended the board's proposal and opted not to charge seniors and disabled citizens while it raised other Capital Metro fares that year..\n\nIn August 2009, Capital Metro staff members proposed to the board steeper fare increases that it wanted to kick in several months sooner than the original hikes were planned to go into effect, including charging 25 cents for single rides for seniors and people with disabilities. \n\nThat's the proposal that was later amended, at Gomez's motion, to spare seniors and the disabled from the fare increase. \n\nSo did Gomez get it right? Did she stop the fare increase?\n\nSure she did, along with most fellow board members. She also earlier voted twice to advance plans subjecting seniors and the disabled to fare increases. But fares never raised for seniors and disabilities on her watch.\n\nWe rate Gomez's claim Mostly True.", "Austin American-Statesman, \"Ex-Austin Council Member Alvarez challenges longtime commissioner Gomez,\" by Suzannah Gonzales, Feb. 8, 2010\n\nAustin American-Statesman, Transit fares to increase more, and sooner, under new proposal, by Ben Wear, Aug. 10, 2009\n\nAustin American-Statesman, Who voted how on Cap Metro fares, by Ben Wear, Aug. 5, 2009\n\nAustin American-Statesman, Capital Metro holding public meetings on bus fare hikes, by Ben Wear, June 9, 2008\n\nBurnt Orange Report, Capital Metro should exempt seniors and disabled citizens from fare increase, by Margaret Gomez, Oct. 28, 2009\n\nCapital Metro, Capital Metro Transit Alliance Special Board Minutes, Nov. 4, 2009\n\nMargaret Gomez Campaign, Gomez builds support for fare increase exemption for senior and disabled riders, Nov. 4, 2009\n\nInterview with Adam Shaivitz, spokesman at Capital Metro, Feb. 18, 2010\n\nInterview with David Mauro, consultant at the Margaret Gomez Campaign, Feb. 19, 2010\n\nInterview with Edith Moreida, senior executive assistant at the Travis County Commissioner's office, Feb. 19, 2010", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]