["About this rating", "On 16 August 2016 Twitter user Zarah Sultana published what became an instantly viral tweet, depicting a woman carrying a tote bag with Arabic writing and bearing a humorous translation:", "Text on bag reads as: \"This text has no other purpose than to terrify those who are afraid of the Arabic language.\" pic.twitter.com/vHknRBQoPG", "— Zarah Sultana (@zarahsultana) August 16, 2016", "After tens of thousands of Twitter shares, the image made its way to Facebook, where many appreciated the humor but wondered whether the translation was accurate.", "English speakers lacking knowledge of Arabic asked Sultana whether the translation was indeed correct:", "@zarahsultana Is that what it really says? — Steven L. Johnson (@StevenLJohnson) August 16, 2016", "An Arabic speaker transcribed the tote's inscription into digital form:", "لا يوجد اي هدف لهذا النص الا نشر الرعب في نفوس من يهاب اللغة العربية", "Feeding that transcription into Google Translate produces a rough version of what is claimed as the writing's English meaning:", "There is no goal of this text that horror published in the hearts of afraid of the Arabic language", "Sultana subsequently tweeted contact information for the company behind the Arabic totes, Israel-based Rock Paper Scissors Printshop:", "@CascadiaForever @MaddowBlog To purchase the bag, FB page is: https://t.co/XK6iTf4JYV & the Instagram account is: https://t.co/6eMM61vcsu :)", "— Zarah Sultana (@zarahsultana) August 16, 2016", "The totes began picking up steam back in May 2016, as noted in a news article from that initial wave of interest:", "The message on Rock Paper Scissors’ newest tote bag is simple but powerful.", "In pink Arabic lettering it says: \"The only goal of this text is to spread panic among those who fear the Arabic language.\"", "Most of their designs contain Arabic words, not as a statement, they say, but “because it is our language, and part of who we are, and we think it should be part of our urban landscape.”", "That was the thinking behind the tote. \"While fuddling what to write we came to a conclusion that the existence of the font and language — and not necessarily the writing — is what's important,\" they told SBS.", "“We notice here that the Arabic language is starting to disappear from signs and public places,” the designers said.", "Arabic is an official language in Israel, but newspapers regularly filled with stories of an ongoing culture war which has been raging for years in the small Mediterranean country. The battle centers around identity, fought between a substantial Arab-Israeli minority, and conservatives seeking to cement Israel’s identity as a Jewish state.", "Winsor, Ben.   \"The Arabic on This Tote Bag Is Hilariously Edgy.\"\r\n    SBS.   19 May 2016.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]