["By Eugene Kiely", "Posted on February 15, 2018", "We’ve written this before, but we will restate it: The U.S. intelligence community says Russia waged an influence campaign during the 2016 campaign to help elect Donald Trump, but it made no determination on whether Russia’s meddling affected the election outcome.", "We repeat ourselves, because Vice President Mike Pence recently revived a false talking point that U.S. intelligence agencies came to the “universal conclusion” that Russia’s meddling had no impact on the election results. He made his remarks in an interview with Axios, a political website.", "Pence, Feb. 14: Irrespective of efforts that were made in 2016 by foreign powers, it is the universal conclusion of our intelligence communities that none of those efforts had any effect on the outcome of the 2016 election.", "As we have written, the Office of the Director of National Intelligence on Jan. 6, 2017 released a declassified intelligence report that said “Russian President Vladimir Putin ordered an influence campaign in 2016 aimed at the US presidential election.” Among other things, the report said, Russian intelligence services gained access to Democratic National Committee computers for nearly a year, from July 2015 to June 2016, and released hacked material to WikiLeaks and other media outlets “to help President-elect Trump’s election chances.”", "But that report did not say that “none of those efforts” changed the outcome of the election, as Pence claimed. On that point, the DNI report clearly said that the intelligence community “did not make an assessment of the impact that Russian activities had on the outcomes of the 2016 election.”", "Director of National Intelligence report: The US Intelligence Community is charged with monitoring and assessing the intentions, capabilities, and actions of foreign actors; it does not analyze US political processes or US public opinion.", "Since the report was made public more than a year ago, Trump and his supporters have peddled false and misleading interpretations of the intelligence report on the 2016 election interference.", "A day after the report was released, Trump tweeted: “Intelligence stated very strongly there was absolutely no evidence that hacking affected the election results. Voting machines not touched!” As we wrote, the fact that no machines were hacked does not mean that Russia’s influence campaign did not affect the election results.", "Two days after the report was issued, Kellyanne Conway, who is now White House counselor, told CNN’s Jake Tapper on “State of the Union” that then-Director of National Intelligence James Clapper testified before a Senate committee that Russia’s attempts to influence the U.S. presidential election had failed.", "Conway, Jan. 8, 2017: If you read the full report, they make very clear, Mr. Clapper in his testimony made very clear on Thursday under oath that the — that any attempt, any aspiration to influence our elections failed. They were not successful in doing that. And it’s a very important point.", "Wrong again. In fact, Clapper said the complete opposite when he testified under oath before the Senate Armed Services Committee on Jan. 5, 2017. He said of the Russian interference: “[T]he intelligence community can’t gauge the impact that it had on choices that the electorate made. There is no way for us to gauge that.”", "In a Senate Select Intelligence Committee hearing on Jan. 10, Clapper reiterated that the report “does not — repeat does not assess the impact of Russian activities on the actual outcome of the 2016 election or draw any conclusions in that regard one way or the other.”", "This has not deterred others in the Trump administration from distorting the report’s findings.", "In October, CIA Director Mike Pompeo wrongly said, “The intelligence community’s assessment is that the Russian meddling that took place did not affect the outcome of the election.”", "In that case, Pompeo’s own agency had to reiterate that the intelligence community did not make any assessment in regards to whether Russia’s meddling affected the election results.", "“The intelligence assessment with regard to Russian election meddling has not changed, and the director did not intend to suggest that it had,” agency spokesman Dean Boyd said in a statement clarifying Pompeo’s remarks.", "We should also note that an October 2016 report by the Department of Homeland Security’s Office of Intelligence and Analysis found that “Russian government cyber actors” potentially targeted “Internet-connected election-related networks” in 21 states. The department notified the 21 states in September 2017, but none reported any evidence of altered voter data or ballots.", "So, there remains no evidence that votes were changed. But the intelligence community has not said if Russia’s influence campaign affected the election outcome.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]