["President Donald Trump's anti-human trafficking stance has become a hallmark of his administration. Daughter and adviser Ivanka Trump has spurred the president's investment in anti-trafficking measures since the beginning of his term. She called trafficking an \"ugly stain on civilization\" at the unveiling of the Trafficking in Persons report at the State Department in 2017, according to CNN.", "Ivanka Trump's work to mitigate human trafficking globally is also well-documented, from a meeting with survivors in Italy to her influence in the Oval Office.", "During her speech at the Republican National Convention in August, Trump mentioned nine pieces of anti-trafficking legislation passed during the Trump administration.", "\"To protect the most vulnerable among us, I’ve worked alongside the president as he signed into law nine pieces of legislation to combat the evil of human trafficking,\" Ivanka Trump said, according to a transcript on the transcription blog Rev.", "A claim posted to Facebook days later appeared to reflect Trump's statement, but it referenced nine executive orders instead of laws.", "\"Our President has signed 9 Executive Orders to combat child trafficking!\" user Doug Ellingson posted on Aug. 29. \"Ask yourself why you don't know this? Who is fighting to keep it from you? And why don't they want you to know?\"", "The viral post has over 39,000 shares and over 1,900 reactions. Ellingson did not elaborate on the contents of the post in response to a request for comment from USA TODAY.", "More:Fact check: No evidence child traffickers are tagging cars as potential targets with codes", "More:Fact check: On a viral list of 10 Trump 'accomplishments,' 3 are true", "More:Fact check: Over 8,000 US trafficking arrests since 2017 have not included members of Congress", "Executive orders issued by the president are readily available to the public on The White House website.", "Trump has issued two executive orders targeting human trafficking. The first, aimed at disbanding transnational criminal organizations that traffic humans, was signed on Feb. 9, 2017.", "The second order concerned online child trafficking and sexual exploitation in the United States. It was signed Jan. 31.", "Trump also issued three proclamations observing human trafficking. National Slavery and Human Trafficking Prevention Month has been recognized eachJanuary since 2018.", "The Facebook user who posted the claim may have confused \"legislation\" with \"executive order\" and combined human trafficking with child trafficking.", "Not quite. According to the website for Congress, before the RNC in August, Trump had signed eight bills expressly targeting human trafficking into law:", "Budgets for anti-human trafficking programs are referenced in other pieces of legislation passed during Trump's term. And two bills signed into law earlier this month, the Not Invisible Act of 2019 and Savanna's Act, addressed human trafficking prevention efforts for missing and murdered American Indians.", "We rate this claim PARTLY FALSE, based on our research. The claim mistakes nine pieces of anti-human trafficking legislation for executive orders signed by Trump to combat child trafficking. The president has only signed two executive orders, one concerning child trafficking and another to prevent international trafficking. It is true that the president has signed eight bills expressly targeting human trafficking since 2017.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]