["“कुत्ते की तरह घसीटता हुआ अखिलेश को थाना ले जाया गया।।370 के खिलाफ कर रहे थे प्रदर्शन।। (Akhilesh was dragged to the police station like a dog. He was protesting against Article 370 -translated)”, reads the message attached to a video wherein former chief minister of Uttar Pradesh Akhilesh Yadav is being escorted by the police to a car. Yadav is seen interacting with the press while he is being pushed towards the car. Twitter user Himmat Harwara has shared the video with the identical message and the tweet was retweeted more than 2,000 before it got deleted.", "घसीटता हुआ अखिलेश को थाना ले जाया गया।।370 के खिलाफ कर रहे थे प्रदर्शन।।", "Posted by Sandeep Shrivastava on Monday, 12 August 2019", "Many other Facebook and Twitter users have posted the video with the same message. An identical post by Bittu Sharma has been shared more than 2,400 times so far.", "With a keyword search on Google, Alt News found that the video depicts Akhilesh Yadav’s arrest at the Lucknow airport on March 9, 2011. According to a Times Now report, Samajwadi party workers who were shouting anti-Mayawati slogans were lathi-charged by the police across the state. Yadav was arrested on the last day of the state-wide protest held against the BSP government by Samajwadi Party.", "At the time, NDTV had reported, “The police claim he was arrested as a preventive measure to keep the peace in the state – Mayawati has enforced prohibitory orders, banning large crowds from gathering.”", "In conclusion, an eight-year-old video of Akhilesh Yadav being arrested by the police in Uttar Pradesh during the BSP regime was falsely shared as of the leader being arrested for protesting against the repeal of provisions of Article 370.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]