["‘Bangalore Congress candidate (chamarajpet) Zameer Ahmed promises unending bloodshed of Hindus if Congress is voted to power and when he becomes minister’. This provocative message accompanies a video that is currently circulating widely on social media. In the video, Congress candidate for the Karnataka assembly election Zameer Ahmed Khan is seen addressing citizens in Urdu on his campaign trail. The video along with this message was first posted on Twitter by a user Kamal Lochan Mahanta. Mahanta according to his Twitter profile is a self-proclaimed Hindu nationalist residing in Chicago who is ‘blessed to be followed by PM @narendramodi’.", "Although Mahanta later deleted the video, Alt News managed to retrieve a copy of the same, which has been posted below.", "As can be seen and heard in the video posted above from 00:51 to 1:00, Zameer Ahmed Khan is saying, “लिखवा लेना, मेरे को मिनिस्टर बनाया तो 5 साल के अन्दर ऐसे ऐसे कारनामे करके दिखाऊंगा गिनीज रिकॉर्ड में नाम आएगा” (Get it in writing, if I am made a minister, in five years I will do such work that my name will appear in the Guinness record. (approximate translation). Instead, what is being claimed is that the Congress candidate is promising bloodshed of Hindus if Congress comes to power and he becomes a minister.", "This video with the accompanying false claim was shared by right-wing users on Twitter. It has also been circulated widely on Facebook. The page PMO India: Report Card which has a massive following of over 1.5 million users too had posted this video, which was later deleted. The Twitter handle of PMO India: Report Card is followed by senior office bearers and BJP members like Piyush Goyal, Maheish Girri, Sambit Patra, Radha Mohan Singh, Giriraj Singh, Amit Malviya among others.", "We’re posting two videos, especially for people of Karnataka. All of you must see and must share it.", "Video 1: Zameer Ahmed promises unending bloodshed of Hindus in Karnataka if Congress is voted to power… https://t.co/LQ0gBi3MDX", "— PMOIndia-ReportCard (@PMOIndia_RC) May 2, 2018", "On Facebook, many individual users have shared the video widely with angry messages.", "Social media users pointed out that the information is fake and tagged the police commissioner of Bengaluru and Bengaluru City police seeking action.", "I hope @BlrCityPolice and @CPBlr has noted this down. Fake information meant to instigate communal violence. Here’s the offending tweet pic.twitter.com/D4vpTUqmaG", "— Yeh Log ! (@yehlog) May 2, 2018", "Social media is a crucial battle ground for political parties as they look to sway potential voters in their favour. The upcoming assembly election in Karnataka is perceived as a critical event, the outcome of which will set the course for the 2019 general election. The run up to this election has witnessed a whirlwind of misinformation/disinformation over the past few months (1, 2, 3, 4). Disturbingly, much of the narrative has focused on communal division. Alt News will keep tracking such misinformation on social media.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]