["The 17-second video was published here on Facebook on July 15, 2020. It has been viewed more than 10,000 times.", "The video shows a man standing in front of a McDonald’s restaurant counter. He begins verbally and physically assaulting the cashier behind the counter. The video carries the words: “Bugis junctions”.", "Bugis Junction refers to a development project in Bugis, an area in central Singapore.", "The post’s caption states: “This was shared by a friend on an incident in Mcdonalds Bugis Junction Can someone who was thwr confirm the veracity of the attack I have posted this to the Mcdonalds Facebook page to ask if a Police report was made on this customer It disturbs me no end to see such abuse...”", "The video was also shared here on Facebook with a similar claim.", "During the COVID-19 pandemic, McDonald’s Singapore had some of its restaurants temporarily closed in April 2020 after several of its employees were infected with the disease. It reopened those restaurants in May 2020.", "However, the claim is false.", "After viewing the video in the misleading post, a spokesperson for McDonald’s Singapore told AFP by email on July 27, 2020: “(W)e would like to confirm that the incident did not take place in the Singapore Bugis Junction McDonald’s outlet, it took place in Hong Kong.”", "In the video, the man can be heard challenging restaurant staff to call the police and cursing in Cantonese, which is one of the official languages of Hong Kong, along with English. It is not commonly spoken in Singapore.", "The video was featured in this July 15, 2020, report by Hong Kong newspaper Apple Daily about an altercation at a McDonald's restaurant in the city's Tuen Mun district.", "Below is a screenshot comparison of the video in the misleading post (L) and the one published by Apple Daily (R):", "Hong Kong's English-language daily newspaper South China Morning Post (SCMP) also reported on the incident in this July 16 report. The article’s headline reads: “Coronavirus: Hong Kong police arrest two suspected triad members in connection with assault on McDonald’s manager over refusal to wear mask”.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]