["Adam Putnam, 2005 file photo (Times Photo by Joseph Garnett, Jr.)", "Republican governor candidate Adam Putnam has been a politician for over half of his life, providing opponents a long history of stances to chew on.", "\"Flip Flop! After opposing term limits for decades, Adam Putnam adopts Donald Trump and Ron DeSantis’ position,\" read the subject line of a Florida Democratic Party news release.", "Putnam’s flip-flop, according to the Florida Democrats, came June 6 when he weighed in on term limits for school board members.", "\"If term limits are good enough for the governor and the Legislature, they're good enough for school boards,\" Putnam said via email to the Tampa Bay Times.", "Term limits have been an issue in Florida for quite some time.", "Voters in November will decide whether to approve a constitutional amendment establishing eight-year term limits on school board members, among other things. The proposal closely mirrors the 1992 measure that established eight-year caps on members of Florida’s Legislature. Congressional term limits are also a priority of the man Putnam is looking to replace, Gov. Rick Scott.", "For this reason, we wanted to see if the claim had any credence. Did Putnam really change a longtime stance opposing term limits to one that lines up with DeSantis and Trump?", "While there is some truth to this claim, the link to Trump is largely irrelevant. Trump’s position on term limits is mainly about Congress, not school boards and state legislatures.", "Putnam served in the U.S. House for 10 years before he started the first of two terms as agriculture commissioner in 2011. He also was a member of the Florida House from 1996 to 2000.", "The issue of term limits has come up several times over his political tenure. The Democrats latched onto several instances of Putnam discussing why, at the federal level, he did not support a limit on terms.", "When Putnam was first elected to the U.S. House in 2000, he hinted that voters should control the term lengths of lawmakers.", "\"I have always believed that voters are the ultimate term limit implementers,\" Putnam said Nov. 25, 2000, according to the Associated Press. \"The voters are pretty effective at giving those two-year job evaluations.\"", "He turned down signing a term-limit pledge in Congress as a candidate in 2000. And he voted against term limits as a citizen, he said, when they were on the referendum in the state of Florida in 1992. (He was 18 at the time.)", "\"I believe term limits are implemented every two years by the voting public for the House of Representatives,\" Putnam said in a 2001 appearance on CNN. \"I voted against them when they were on the referendum in the state of Florida. And so, therefore, I did not take the pledge.\"", "And finally, as agriculture commissioner in 2012, Putnam suggested that the eight-year term limit on state lawmakers impedes their ability to do their job.", "\"The eight-year (term limit) time frame virtually guarantees the likelihood of someone spending more than one term as a committee chair is almost nil because it suggests you are ineffective,\" Putnam said in a Tampa Bay Times column.", "The Democrats started to shout \"flip-flop\" after a comment by Putnam on June 4, 2018. Putnam said he supports term limits on school board members, telling the Tampa Bay Times that \"if term limits are good enough for the governor and the legislature, they're good enough for school boards.\"", "That position is consistent with his primary opponent, DeSantis, who recently penned an op-ed for the U.S. Term Limits website in support of Florida’s Amendment 8 requiring school board term limits.", "\"No elected office, whether federal or local, is ever better off when run by career politicians,\" DeSantis wrote. \"That’s why I support eight-year term limits for all school board member.\"", "The connection to Trump is more tenuous. As a presidential candidate, Trump promised to enact a constitutional amendment that would extend term limits to all members of Congress (which is Stalled on our Trump-O-Meter).", "\"If I’m elected president, I will push for a constitutional amendment to impose term limits on all members of Congress,\" Trump said at a rally in Colorado Springs, Colo. \"Right? They’ve been talking about that for years.\"", "Trump’s 100-day action plan also detailed his term-limit plans for Congress.", "But Trump has not specifically come out in support of school board term limits, in Florida or elsewhere, as Putnam did.", "To back up the Trump connection, Florida Democratic Party spokesman Kevin Donohoe pointed to an alleged remark from a 2016 rally in South Carolina to suggest Trump’s comments throughout the 2016 campaign were broad enough to make the argument he supports term limits for \"any politician.\"", "\"Under my proposal, there will never be a 'next campaign' for any politician in America ever again,\" a Newsmax article quoted Trump as saying.", "We checked the Lexis Nexis and CQ databases for evidence of Trump’s remark, as well as Factba.se, which compiles everything the president has ever publicly said or tweeted.", "As it turns out, Trump didn’t really say that. The quote came from a 2016 column on The Blaze by Wayne Allyn Root, who urged Trump to brand himself the \"Term Limits President.\"", "\"Here is the speech Donald should give this week in South Carolina,\" Root wrote, before adding the quote that was shared on Newsmax.", "The Florida Democratic Party said, \"Flip-flop: After opposing term limits for decades, Adam Putnam adopts Donald Trump and Ron DeSantis’ position.\"", "The Democrats are conflating Putnam’s general position against term limits for members of Congress and state government with a recent ballot initiative on school boards.", "They have a point that Putnam has long been skeptical of term limits, declining pledges to support them, criticizing them as impeding sound governance, and voting against them in 1992 as a young adult.", "Putnam’s most recent comments in support of term limits for school board members do suggest a change in tone, and they are in line with his opponent, DeSantis.", "However, Trump’s position on term limits is a red herring in this case. Trump has promised to enact congressional term limits, but has not specifically come out in support of term limits for school board members. A piece of evidence the Democrats provided relies on a suggested speech for Trump, and is not a stated philosophy.", "For a claim that is partially accurate but omits critical context, we rate it Half True.", "Interviews, Florida Democratic Party spokesperson Kevin Donohoe, June 6-7, 2018", "Tampa Bay Times, \"Florida GOP candidates for governor weigh in on school board term limits,\" June 6", "Tampa Bay Times, \"Adam Putnam opposed term limits for most of his career. Now, he’s for them.\" June 6", "Trump-O-Meter, \"Enact term limits,\" March 27, 2017", "Newsmax, \"Trump: I'll Take a 'Very Serious Look' at Term Limits for Congress,\" Aug. 18, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]