["Since the beginning of 2020, several social media users have been sharing an image of BJP Delhi MP Manoj Tiwari and Imam Ahmed Bukhari, the 13th Shahi Imam of Delhi’s Jama Masjid. The viral post takes a subtle dig at Tiwari and the Bharatiya Janata Party for indulging in ‘identity politics’. Tiwari’s name has been in the spotlight as the likely Delhi chief ministerial candidate for the BJP in the upcoming Delhi elections. The party, however, is yet to finalise a name.", "Congress’s Salman Nizami shared the photograph on January 17 and wrote, “Bukhari Rs 500 mei बिक गया . (Bukhari sold at Rs 500.)”", "Facebook-user Qader Unisa posted the viral image and wrote, “Shahi Imam of Delhi Jama Masjid with Manoj Tiwari BJP Delhi CM Candidate/Bhojpuri Film Actor.” Another Facebook user Aman Pathan shared the viral image and wrote, ” ‘One thief is another thief’s cousin.’ Those who curse the Muslim all day are asking for the support. Anyway… out of all people, they are asking for support from a person who has no respect among the Muslim community. Who is going to vote for you? #GotHim.", "[Translated from “चोर चोर मौसेरे भाई” दिन भर मुस्लिम को कोसने वाले गए हैं शाही इमाम का समर्थन मांगने, खैर समर्थन भी उस शख्स से मांग रहे हैं जिसकी मुस्लिम समाज मे कोई इज्जत ही नहीं बची है…वोट क्या घंटा दिलाएंगे #लपेटा]”", "Alt News found that the claim is also circulating on Twitter.", "On January 17, Delhi-based journalist Prashant Kanojia posted a sarcastic tweet along with the viral image. The tweet said, “Bukhari’s deal final on 250 grams of walnuts and 500 grams of raisins.", "[Translated from 250 ग्राम अखरोट और 500 ग्राम किशमिश पर बुखारी का डील फाइनल।]”", "250 ग्राम अखरोट और 500 ग्राम किशमिश पर बुखारी का डील फाइनल। pic.twitter.com/xNme3XigOv", "— Prashant Kanojia (@PJkanojia) January 16, 2020", "Alt News did a keyword search on Google and found a video from May 6, 2017, by Zee Media. The video reported that Bukhari met Tiwari after an attack that took place at the latter’s residence. In the video, Bukhari says, “He is my old friend and our friendship goes long back. As soon as I learnt he (Tiwari) was attacked, I decided to pay him a visit.”", "On May 1, 2017, Times of India reported that two men were arrested after they allegedly barged into Delhi BJP chief and MP Manoj Tiwari’s residence and roughed up his staff.", "Alt News also found that the viral image was tweeted by journalist Atul Krishna on May 6, 2017.", "Shahi Imam of Jama Masjid met Delhi BJP President Shri Manoj Tiwari a little while back pic.twitter.com/zFjJoJ8aYQ", "— Atulkrishan (@atulkrishan007) May 6, 2017", "Social media users have shared an image of BJP MP Manoj Tiwari with Imam Ahmed Bukhari and portrayed this as the BJP’s attempt at vote bank politics ahead of Delhi elections in February.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]