["Hall of Famer Henry \"Hank\" Aaron died at his home in Atlanta on Jan. 22. The legacy of the former Braves baseball player, whose start with the Negro Leagues led to him eclipsing Babe Ruth's home run record, is celebrated online and on social media but also entangled with discussion of the COVID-19 vaccine.", "An article published Jan. 22 by The Defender, an outlet of Robert F. Kennedy Jr.'s Children's Health Defense, intimates a connection between Aaron's death and the vaccine he received Jan. 5, alongside other civil and human rights leaders at the Morehouse Healthcare Clinic, part of the Morehouse School of Medicine.", "\"Home Run King Hank Aaron Dies of 'Undisclosed Cause' 18 Days After Receiving Moderna Vaccine,\" the article's headline reads. The story recounts comments Aaron made after his vaccination experience and the existence of some vaccine hesitancy.", "Some have pointed to deaths among the elderly in Norway and Germany to cast suspicion on the vaccine's safety.", "\"Aaron’s tragic death is part of a wave of suspicious deaths among elderly closely following administration of COVID vaccines,\" Kennedy told The Defender.", "Responding to USA TODAY, Kennedy said he \"knew and admired Hank Aaron\" and felt it was \"fair and correct to report the subsequent tragedy in that context.\"", "Users on social media suggested the COVID-19 vaccine may have played a role in Aaron's death.", "\"All I'm asking is how can you NOT CONSIDER THE VACCINE as a contributor to his death? He didn't live 20 days after taking it,\" wrote ShabazzTheOG in an Instagram post shared Jan. 23 and repeated in an accompanying video.", "\"So why all of a sudden did he pass with THIS shot when he's been taking them his entire life? it wasn't his age so don't even try it. It is this EXPERIMENTAL vaccination!\" echoed Instagram user _rizzaislam in a post Jan. 23.", "USA TODAY was unable to reach the users who posted the claims for further comment.", "Fact check:The vaccine for COVID-19 has been nearly 20 years in the making", "Morehouse released a statement to CBS Alabama affiliate CBS 42 on Jan. 25, saying the former athlete's death was unrelated to the COVID-19vaccine.", "\"Mr. Aaron was a public health advocate and worked with us to help bridge the health equity gap in Atlanta and around the world. His passing was not related to the vaccine, nor did he experience any side effects from the immunization. He passed away peacefully in his sleep.\"", "The Fulton County Medical Examiner's office confirmed with NBC Atlanta affiliate 11 Alive that there was no evidence the COVID-19 vaccine caused Aaron's death. USA TODAY was unable to reach Fulton County officials for comment.", "11 Alive spoke to former Atlanta Mayor and U.N. Ambassador Andrew Young, who received the vaccine with Aaron; veteran broadcasting executive Xernona Clayton and former Secretary of Health and Human Services Dr. Louis Sullivan. Young recounted that a conversation with Aaron's driver did not reveal any alarming indicators.", "\"I talked to the fella who was his driver, and I said, 'Was Hank feeling any discomfort or any problem over the last few days?' and he said, 'No, he wanted to keep his schedule,'\" he said.", "Aaron suffered from arthritis, had a partial hip replacement after a fall in 2014 and used a wheelchair during his vaccination. Young, Clayton and Sullivan – ages 88, 90 and 87, respectively – said they did not experience any severe vaccine reactions, the Atlanta Journal-Constitution reported.", "Dr. Peter Hotez, a vaccine scientist and dean for the National School of Tropical Medicine at Baylor College of Medicine, tweeted Jan. 22, \"There is zero evidence a #COVID19 vaccination contributed to the death of Henry Aaron.\"", "The next day, Atlanta Mayor Keisha Lance Bottoms tweeted, \"He passed in his sleep, the same way my dad died nearly 30 yrs ago. I share that because the vaccine won't stop ALL death, but it will go a long way in preventing deaths from coronavirus, which is disproportionately impacting minority communities.\"", "Fact check:Health and Human Services' Brett Giroir confirms vaccine distribution is tracked to ensure dosing", "As The Defender notes, Aaron's passing follows reports of deaths of older people in Europe. The 33 fatalities in Norway among nursing home residents, ages 75 and over, was investigated by the Norwegian Medicines Agency and the World Health Organization, the latter of which ruled the deaths \"in line with the expected, all-cause mortality rates and causes of death in the sub-population of frail, elderly individuals.\"", "In Germany, the \"seven cases of elderly people dying shortly after vaccination\" were evaluated by the Paul Ehrlich Institute, which concluded most probably died from preexisting illnesses, including carcinomas, kidney deficiencies and Alzheimer's disease, and not vaccination, Bloomberg reported.", "Michael Osterholm, epidemiologist and director of the Center for Infectious Disease Research and Policy at the University of Minnesota,  said the phenomenon of elderly deaths after vaccination is not unexpected.", "\"If you look at heart attacks in the United States and you look at the incidence per 10 million people getting vaccinated ... which is roughly the number we have vaccinated in the U.S., in that age group from 55 to 64, you would expect to see 793 individuals die from a heart attack in that week following vaccination, just by chance alone, if vaccination never occurred,\" he said in an episode of his podcast Osterholm Update: COVID-19. \"So imagine, just on a daily basis, it wouldn’t be surprising to find adverse health outcomes occur associated with the vaccine by time, but not associated by actual cause-and-effect.\"", "Osterholm cautioned more reports of seemingly causal events as vaccination efforts proceed will continue to surface, but public health experts will keep a close eye on the deployment of the vaccine.", "\"To date, we’ve seen nothing that supports that these vaccines, other than the reaction you have at the time of the vaccination or ... after the first 24 to 36 hours, which during that time you can feel a little rough, particularly after your second dose of vaccine, but beyond that, we’ve not seen anything yet that supports these vaccines have any adverse health outcomes,\" he said.", "Fact check:COVID-19 outbreak at NY nursing home started before vaccinations", "We rate this claim MISSING CONTEXT because without additional context it might be misleading. Former Braves baseball player and Hall of Famer Hank Aaron died Jan. 22, almost three weeks after receiving a COVID-19 vaccination. His death has been declared due to natural causes and unrelated to his inoculation. Reports of elderly deaths after vaccination in Norway and Germany do not implicate the vaccines, as they are most likely due to frailty with old age, terminal illness or other underlying conditions. Aside from reactions such as allergies the day of or within a few days of vaccination, there is no evidence to suggest that adverse vaccine health outcomes, such as death among the elderly, are occurring at an unusual frequency compared with what would normally happen in the absence of vaccination.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook."]