["About this rating", "The White House's call-in comment line was non-operational as of January 2017.", "The phone comment line went non-operational during the end of President Obama's administration and wasn't immediately reinstated by the incoming Trump administration.", "On 23 January 2017, the web site Addicting Info published an article reporting that the news Trump administration had dismantled the White House call-in line in order to \"ban the public\" from calling to offer comment or protest:", "Trump Bans The Public From Calling The White House To Comment Or Protest", "In another attempt to stifle freedom of expression, President Trump and his administration have dismantled the White House switchboard comment operating system. Instead, callers will be told to take their complaints and comments to Facebook and other White House social media platforms.", "While it's true that the White House call-in comment line was inactive as of January 2017 (we called the number and were informed by an automated voice message that the comment line was closed), it's inaccurate to say that the Trump administration \"banned\" the public from calling the White House or \"dismantled\" the White House switchboard.", "When Donald Trump was sworn in as the new President of the United States on 20 January 2017, both a peaceful transition of power and a digital transition of assets took place. For instance, the majority of content on WhiteHouse.gov was removed and archived at ObamaWhiteHouse.archive.gov in order to give the Trump administration the opportunity to populate the government web site with their own content. Similar changes were made with the @POTUS Twitter account.", "In this case, the White House comment line was shut down nearly a week before President Trump took office. On 14 January 2017, the Washington Times reported that the Obama administration had closed down the phone-in comment line:", "President Obama is done listening — at least by phone.", "The White House comments line, 202-456-1111, is no longer working and apparently hasn’t been operational for weeks. The line is normally staffed by volunteers.", "Callers to the line hear a recorded message: “The comment line is currently closed, but your comment is important to the president.”", "The recorded message advised callers to send comments for the White House via Facebook Messenger. Although President Obama's White House Facebook account had Messenger installed, as of the moment President Trump's does not:", "While one could argue that President Trump's administration was slow to pick up the digital reins in the days immediately following his inauguration, it's incorrect to say that he \"dismantled\" the White House call-in line. It's more accurate to say that the White House call-in comment line was closed at the end of President Obama's term, and the Trump administration did not reinstate it in the first few days of his presidency.", "Denson, Ryan.   \"Trump Bans the Public from Calling the White House to Comment or Protest.\"\r\n    Addicting Info.   23 Janaury 2017.", "Boyer, Dave.   \"White House Shuts Down Call-In Line.\"\r\n    The Washington Times.   14 January 2017.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]