["About this rating", "U.S. Democratic presidential candidate Beto O'Rourke was in a punk band called Foss, and he was arrested once on suspicion of burglary and once on suspicion of DUI in the 1990s. (Both charges were later dismissed.)", "The El Paso Pussycats was the name of the band's EP, not the name of the band itself.", "In the days following Beto O'Rourke's March 2019 announcement that he was launching a campaign for the 2020 Democratic presidential nomination, some social media users spread a meme featuring a photograph that supposedly showed the Democratic politician wearing a dress on the cover of an album for his band the El Paso Pussycats. The text of the meme also asserted the Texas politician had been arrested twice, once on suspicion of burglary and again on suspicion of drunken driving, during the 1990s:", "The claims made in this meme are largely accurate, although a few inaccuracies should be noted.", "The man seen on the left in the above-displayed image truly is O'Rourke (who reportedly played bass guitar). While the meme stated that O'Rourke was in a band called the El Paso Pussycats, his band was actually named \"Foss.\" This photograph was used for the cover of an EP that Foss released in 1993, and the name of the EP, not the band itself, was \"El Paso Pussycats.\"", "O'Rourke talked to Rolling Stone in August 2018 (this meme first received attention during the 2018 midterm elections, hence the mention of O'Rourke's \"Texas Deserves Better\" U.S. Senate campaign slogan), and he shared an audio file of the band's song \"Rise\" with the magazine:", "It is a well-established fact that as a high schooler in El Paso, Texas, Rep. Beto O’Rourke (D-TX) was in a band, Foss — ::pauses to take giant bong rip:: It’s Icelandic for ‘waterfall’ — with Cedric Bixler-Zavala, who would go on to considerable fame fronting the Mars Volta and At the Drive-In. On Tuesday, the @TexasGOP Twitter account tweeted what it believed was a sick burn of O’Rourke about his pre-political days.", "The tweet featured the cover of Foss’s EP, The El Paso Pussycats, with a scrawled note, “Sorry can’t debate. We have a gig.” It seemingly intended to imply that O’Rourke — who was first to call for debates against the incumbent Sen. Ted Cruz back in April — was now avoiding them. Instead, the tweet mostly reminded people that O’Rourke was and remains considerably cooler than Ted “Care to see my new mime routine?” Cruz ...", "“I was into Minor Threat, I was into the Rites of Spring,” O’Rourke recalls. But more than just the bands, it was Dischord’s whole ethos that appealed to him, an angsty teen. “They started their own label, they pressed their own records, they wrote their own songs, they booked their own tours and they set conditions, like: you’re not gonna pay more than five bucks to come into this show. You’re not gonna pay more than 10 bucks for this record. Our shows are gonna be all ages, everybody can come in.”", "This meme correctly states that O'Rourke was arrested twice in the 1990s, once on suspicion of burglary and once on suspicion of driving while under the influence. Both charges were dropped, however, and O'Rourke has publicly addressed these incidents, saying: \"Twenty-three years ago I was arrested for attempted forcible entry after jumping a fence at the University of Texas at El Paso. I spent a night in the El Paso County Jail, was able to make bail the next day, and was released. Three years later, I was arrested for drunk driving -- a far more serious mistake for which there is no excuse.\"", "We covered O'Rourke's arrest record more in-depth in an article we published during the 2018 midterm elections.", "O'Rourke, Beto.   \"O’Rourke: Texas Should Lead the Way on True Criminal Justice Reform [Opinion].\"\r\n    Houston Chronicle.   27 August 2018.", "Flegenheimer, Matt.   \"Beto O’Rourke Was Once Adrift in New York City. Now He’s Searching Again.\"\r\n    The New York Times.   6 February 2019.", "Stuart, Tessa.   \"Beto O’Rourke Shares the Story of His Old Band, Foss — And a Single.\"\r\n    Rolling Stone.   30 August 2018.", "Wilkie, Christina.   \"Beto O'Rourke is Running for President. Like Obama, He Has Sought the Middle Ground on Policy – While His Democratic Rivals Veer to the Left.\"\r\n    CNBC.   14 March 2019.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]