["About this rating", "Just as the cheery pop music of the early 1960s gave way to psychedelia and heavy metal as the decade progressed, so did interest in pop stars' lives move beyond comparisons of their hairstyles and favorite colors to consideration of the more salacious aspects of their lives.", "Favorite tales (then as now) involved drug use and sexual exploits, and, as usual, the most popular stories proved to be mixtures of truth, fiction, exaggeration, and publicity stunts.  For example, the Rolling Stones, who probably spawned more legends of the \"sex and drugs\" variety than any other band of the rock 'n' roll era, spanned the spectrum: the lurid tale of Mick Jagger's being caught in a compromising position with girlfriend Marianne Faithfull during a drug raid at Keith Richards'home was pure invention; an infamous film clip in which the band members passed a naked groupie around their tour plane was staged for the cameras; rumors of Keith Richards' beating his heroin addiction by having his blood changed were exaggerations; and Angela Bowie's account of catching her husband, David Bowie, in bed with Mick Jagger was true in the details but rather innocuous in its implications.", "The most ubiquitous non-Stones-related tale is unquestionably the infamous \"mud shark\" legend, which relates how members of Led Zeppelin supposedly employed a (live) shark as a sexual device with a pliant female groupie:", "[Davis, 1985]", "One girl, a pretty young groupie with red hair, was disrobed and tied to the bed.  According to the legend of the Shark Episode, Led Zeppelin then proceeded to stuff pieces of shark into her vagina and rectum.1", "[Moser & Crawford, 1998]", "Then there was the infamous \"mudshark incident,\" which was actually more like a red herring. In 1969, Led Zeppelin checked into Seattle's Edgewater Inn. The place was a favorite with musicians because guests could fish from their rooms. The band hauled in some fish. Then they hauled in a seventeen-year-old redhead named Jackie. She mentioned she really liked being tied up. The obliging Englishmen ordered a rope from room service. Next, Jackie removed her clothes and the boys tied her to the bed. Then the road manager entertained the band by taking a red snapper and introducing it to the girl's private parts.2", "This story is tough to classify as either purely \"true\" or \"false\" because so many different versions with varying details exist, but we might safely say it's one of many legends formed from a kernel of truth covered with several layers of exaggeration and embellishment.", "The core incident took place at The Edgewater in Seattle (probably at  the time of the group's 27 July 1969 appearance at the Seattle Pop Festival), a hotel on Puget Sound from which guests could fish right out the windows of their rooms.  According to Richard Cole, Led Zeppelin's road manager, he and drummer John Bonham (aka \"Bonzo\") were busily engaged in the pastime of catching sharks through an Edgewater window when they were interrupted by some persistent groupies, but what occurred next didn't quite live up to the notorious modern version of the legend:", "It wasn't Bonzo, it was me. It wasn't shark parts anyway: It  was the nose that got put in. We caught a lot of big sharks, at least two dozen, stuck coat hangers through the gills and left 'em in the closet . . . But the true shark story was that it wasn't even a shark. It was a red snapper and the chick happened to be a f_______ redheaded broad with a ginger p____. And that is the truth. Bonzo was in the room, but I did it. Mark Stein [of Vanilla Fudge] filmed the whole thing. And she loved it. It was like, \"You'd like a bit of fucking, eh? Let's see how your red snapper likes this red snapper!\" That was it. It was the nose of the fish, and that girl must have come 20 times. But it was nothing malicious or harmful, no way! No one was ever hurt.", "The basic tale incorporated a number of variations that were added to it across time:", "The incident was variously described as involving some or all of the members of Led Zeppelin.", "The piscatorial object involved was variously reported as a shark, a mud shark, a swordfish, a red snapper, or a generic fish.", "In different versions the fish employed in the escapade was said to be alive, dead, or stuffed and mounted.", "The female groupie was sometimes reported as having been tied (voluntarily or involuntarily) to the bed.", "The extremes of the legend ranged from the band's using an intact fish to harmlessly pleasure a groupie, to their cutting up a fish and stuffing pieces into several of the woman's bodily orifices.", "So yes, a female groupie was sexually engaged with a fish, but the fish was not a shark (and was presumably dead), it wasn't \"stuffed\" inside her, the only member of Led Zeppelin present at the time (John Bonham) was merely an onlooker rather than an active participant, and the woman left the hotel unharmed.", "(We note that Richard Cole may not have been the most accurate chronicler of Led Zeppelin's history, but since his accounts tended to run to excess it's safe to assume the reality was no wilder than he presented it.  In any case, accounts given by others connected with the incident didn't substantially contradict Cole's version.)", "Nonetheless, tales of sexual exploits involving groupies and animals are familiar entries in the Led Zeppelin canon of rumors:", "One evening, two young girls were lounging in the bathtub of Led Zeppelin's hotel suite. Page walked in. He giggled, \"We figured you need something to keep you company.\" Then he threw four live octopuses into the tub. The young ladies wound up enjoying the octopuses more than the rockers. \"Oh my god,\" squealed one of them, \"I've gotta get one of these. It's like having an eight-armed vibrator!\"", "Led Zeppelin later cheered on another adventurous female fan while she made love with her pet Great Dane. The boys in the band even provided strategically placed bacon for the Great Dane's pleasure.2", "Sightings:   The \"Mud Shark\" was immortalized in song by Frank Zappa during gigs in 1970-71.", "Cole, Richard.   Stairway to Heaven: Led Zeppelin Uncensored.\r\n    New York: HarperCollins, 1992.   ISBN 0-060-18323-3.", "1.   Davis, Stephen.   Hammer of the Gods: The Led Zeppelin Saga.\r\n    New York: William Morrow & Co., 1985.   ISBN 0-688-04507-3   (pp. 79-80).", "2.   Moser, Margaret and Bill Crawford.   Rock Stars Do the Dumbest Things.\r\n    Los Angeles: Renaissance Books, 1998.   ISBN 1-58063-023-5   (pp. 129-130).", "Sherman, Dale.   Urban Legends of Rock & Roll.\r\n    Burlington, Ontario: Collector's Guide Pub., 2003.   ISBN 1-896522-78-5   (pp. 94-95).", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]