["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Occupy Democrats posted this meme on its Facebook page. (Screenshot)", "Billionaire Donald Trump’s immigration proposals include forcing Mexico to pay for a wall at the border, tripling the number of immigration officers, and ending the long-standing practice of birthright citizenship.", "There are exceptions but generally speaking, if you are born in the United States, you can claim citizenship regardless of the immigration status of your parents. This goes back to the 14th Amendment.", "Once Trump raised the issue, other GOP contenders followed suit, including Louisiana Gov. Bobby Jindal. On Aug. 17, 2015, Jindal tweeted, \"We need to end birthright citizenship for illegal immigrants.\"", "This prompted the liberal group Occupy Democrats to post a meme on its Facebook page with this message:", "\" ‘We have to end birthright citizenship to stop anchor babies,’ says Republican Bobby Jindal whose noncitizen parents arrived in the U.S. four months before he was born and used his birthright citizenship to become Americans, making him an anchor baby.\"", "The part we’re fact-checking is the claim that Jindal’s parents gained citizenship through him.", "People define \"anchor baby\" in different ways. Some use it when food assistance and medical care for a low-income child of undocumented immigrants produce indirect benefits for the parents. That doesn’t apply in Jindal’s case.", "For one, his parents had healthy incomes when they arrived, and more to the point, Occupy Democrats focused on another meaning of anchor baby — a child through whom a noncitizen can craft a path to full citizenship.", "Coming to America", "The Facebook post is shaky on its quotation of Jindal. His tweet didn’t mention \"anchor babies.\" The closest he came to saying those words was during an interview with Fox News where, on being pressed by the host, Jindal said, \"I’m happy to use the phrase,\" but he still didn’t actually use it.", "However, regarding Jindal’s personal timeline, the post is accurate. Jindal’s parents moved from India to Baton Rouge, La., on Feb. 1, 1971. Jindal was born on June 10, 1971. So that’s just about four months later.", "Back in the days when people like Trump were clamoring for President Barack Obama to show his birth certificate, Jindal moved to ensure that no such questions would hang about him. In 2011, the Times-Picayune reported that Jindal had produced his birth certificate. It showed that he was born at Woman’s Hospital in Baton Rouge to Raj Gupta, his mother, and Amar Jindal, his father.", "At the time, his mother had a scholarship to study nuclear physics at Louisiana State University, and his father, an engineer professor, was working for a subsidiary of the Kansas City Southern Railway. A couple of years later, Amar Jindal took a new job with the Exxon oil company. Jindal’s mother Raj Gupta earned two master’s degrees, one in physics and another in nuclear engineering. She ultimately worked for the state Labor Department in information technology.", "Mike Reed, communications director in the Louisiana governor’s office, told us that Raj Gupta became an American citizen in 1976, and Amar Jindal followed 10 years later in 1986.", "Why does that matter? Because those dates mean that Jindal’s birthright citizenship played no legal role in his parent’s citizenship applications.", "Let’s see why.", "21 is the magic number", "Two leaders in immigration law explained that Jindal only could have helped his parents become citizens when he had turned 21 years old.", "Under the 1965 Immigration and Nationality Act, the child of immigrants can sponsor them to become permanent residents. The child must be a citizen and must be 21 or older. Once the parents are permanent residents, they must live in America for five straight years. After that, they can apply for citizenship.", "If Jindal’s citizenship had made any difference, the earliest his parents could have been eligible would have been 1992, five years after he turned 21.", "When his mother became a citizen in 1976, Jindal was 5, and in 1986, for his father’s naturalization, he was 15. It’s not even close.", "\"If both parents had lawful permanent residence, then it doesn’t make a difference if they had a kid,\" said David Leopold, former president of the American Immigration Lawyers Association.", "Lenni Benson, a law professor at New York Law School, also said that given the Jindals’ circumstances, the son’s citizenship was \"irrelevant.\"", "\"Once they secured immigrant visas and became lawful permanent residents, they could seek naturalization on their own after five years of residence and meeting other requirements,\" Benson said.", "Everything Leopold and Benson told us matches the rules that we found on the U.S. Citizenship and Immigration Services website.", "At the end of the day, there is no evidence that Jindal was an \"anchor baby.\"", "Occupy Democrats did not return a message to the group’s email address.", "Our ruling", "Occupy Democrats said Bobby Jindal’s parents used his birthright citizenship to become Americans. We reviewed the law and spoke to two experts in immigration law. The only way Jindal might have been able to help his parents become citizens is if he had been 21. He was 5 when his mother became a citizen and 15 when his father took the same step.", "The experts we reached told us Jindal’s citizenship was irrelevant, bringing Occupy Democrats' claim into the realm of ridiculous. We rate this claim Pants on Fire!", "Occupy Democrats, Facebook meme, Aug. 23, 2015", "Bobby Jindal, tweet, Aug. 17, 2015", "Fox News, America’s Newsroom, Aug. 20, 2015", "Trump for President, Immigration reform, July 31, 2015", "Times-Picayune, Jindal joins Trump in urging end to birthright citizenship, Aug. 18, 2015", "Times-Picayune, Gov. Bobby Jindal releases his birth certificate, May 11, 2011", "U.S. Citizenship and Immigration Services, Who Is Eligible for Naturalization?", "U.S. Citizenship and Immigration Services,Exceptions and accommodations", "U.S. Citizenship and Immigration Services,Bringing Parents to Live in the United States as Permanent Residents", "Immigration and Nationality Act of 1965", "Think Progress, How Many Candidates Have ‘Taken Advantage’ Of Birthright Citizenship, But Oppose It?, Aug. 19, 2015", "Email interview, Alan Hyde, professor, School of Law, Rutgers University, Aug. 24, 2015", "Email interview, Lenni Benson, professor, New York Law School, Aug. 24, 2015", "Interview, David Leopold, principal, David Wolfe Leopold and Associates, Aug. 24, 2015", "Email interview, Mike Reed, communications director, Louisiana Governor’s Office, Aug. 24, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]