["About this rating", "Businesses that require customers to wear masks during the COVID-19 pandemic are required to accomodate people who may not be able to wear masks due to a medical condition.", "Americans without disabilities are not protected under the federal Americans with Disabilities Act (ADA). Further, the federal Health Insurance Portability and Accountability Act (HIPAA) does not pertain to customers at a grocery store.", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "In April 2020, as major stores such as Costco started requiring customers to wear masks in order to prevent the spread of the COVID-19 coronavirus disease, a message started to circulate on social media that appeared to encourage Americans to lie about having medical conditions in order to exploit a \"mask loophole.\"", "The message generally read:", "✨MASK LOOPHOLE✨", "Store clerk at the door:\n“Excuse me, but do you have a mask?\nI can’t let you in without one”. ?", "Me: “No I’m sorry, I have a medical condition that prohibits the use of anything that could restrict the flow of oxygen to my lungs or brain”. ?", "Their answer 90% of the time:\n“Oh, okay, sounds good to me, ??‍♀️\nGo ahead, have a great day”", "Their answer 10% of the time:\n“What kind of medical condition is THAT”?", "Gentle Answer: “According to HIPAA regulations, you’re not allowed to ask me that. Please don’t discriminate against those who can not wear masks, we need our essentials too.\nI’ll be in and out”", "As long as you’re polite and non aggressive, this has not failed me yet. # staaayfreeeee ??", "These \"mask loophole\" posts sometimes opened with the declaration \"Don't want to wear a mask? Try this!\" and ended with \"What have you got to lose?\" They were frequently accompanied by one of two images supposedly showing flyers issued from the U.S. Department of Justice that could be presented to stores to explain that these people were \"exempt\" from these rules:", "However, these flyers were not issued, endorsed, or distributed by the Department of Justice, and the advice relayed in the \"mask loophole\" flyer is both legally and morally questionable.", "The social media post above essentially argues that able-bodied people can lie about having a medical condition in order to avoid wearing a mask in a store that requires customers to wear them. If the store presses them on the issue, they can claim that the store would be violating the federal American Disabilities Act (ADA) and the Health Insurance Portability and Accountability Act (HIPAA) by asking them about their medical conditions.", "This social media post doesn't relay a \"mask loophole\" so much as it encourages people to exploit a law designed to provide protections to disabled people.", "We reached out to several regional ADA centers for more information about the flyers. While their answers varied in length and content, they all hit on one major theme: Americans without disabilities are not protected by the Americans with Disabilities Act:", "New England ADA Center: The ADA protects the privacy of people who have disabilities. People who lie about a medical condition and don’t have one, do not have rights under the ADA.", "We are not in favor of people lying in order to get the modifications of policies and procedures that are the legitimate right of people with disabilities for whom wearing a face mask would be detrimental to their medical conditions.", "Great Lakes ADA Center: \"Individuals without disabilities do not have protected rights in terms of the conditions set forth by a business, etc. in order to come into their establishment but a person with a disability does have rights (ADA plus many state civil rights laws) and thus, business entities must understand these issues and look at what they can do, how they can do it and creative ways of addressing any concerns that they have.\"", "Northeast ADA Center: The ADA protects individuals with disabilities. As with many things in our society, there are people that attempt to take advantage of our system. There are typically remedies for this in criminal and civil law.", "A spokesperson for the Justice Department told us the department did not issue the flyers. All of the ADA centers we contacted also told us that they were unfamiliar with the flyers.", "The scenario depicted in this social media post (a citizen refusing to wear a mask at a grocery store) is also unrelated to HIPAA. (It's worth noting that one of these viral flyers misspelled this acronym \"HIPPA\"). The Health Insurance Portability and Accountability Act was passed in 1996 with the aim of protecting private medical records. HIPAA restricts hospitals and health care providers from sharing protected information and gives patients better access to their own records. This law has little to do with customers at a grocery store.", "Kathy Gips, the director of training at the New England ADA Center, told us:", "HIPAA only applies to three types of covered entities: health plans, health care clearinghouses, and health care providers. It restricts their ability to share protected health information. It also gives patients access to their own medical records. It has nothing to do with customers or stores or employment or anything else.", "HIPAA does not apply to individuals (in this case, store clerks) asking a customer to wear a mask. It applies to the release of medical records from health personnel.", "The U.S. Department of Health and Human Services (HHS) reiterates this point on its website, explaining that HIPAA regulations apply only to \"covered entities,\" including health plans, health care providers, and health care clearinghouses. HHS writes:", "The Privacy Rule, as well as all the Administrative Simplification rules, apply to health plans, health care clearinghouses, and to any health care provider who transmits health information in electronic form in connection with transactions for which the Secretary of HHS has adopted standards under HIPAA (the “covered entities”).", "The HHS website also notes that HIPAA does not apply to other entities, such as law enforcement, employers, and schools.", "While this social media post appeared to be widely circulated by able-bodied people seeking to exploit a \"mask loophole,\" the ADA does truly protect individuals who cannot wear a mask due to medical conditions from being discriminated against. This means that stores that implement mask requirements have to find ways to accommodate individuals who cannot wear a mask.", "Gips explained:", "Title III of the ADA requires businesses to make reasonable modifications of policies, practices and procedures ... The store should work with the person to maintain 6 ft social distancing, and if that’s not possible to consider accommodations such as shopping for the person and providing curbside service or home delivery.", "So what about Costco?", "These flyers were widely circulated in the wake of Costco's announcement that it would be temporarily requiring customers to wear masks while shopping during the COVID-19 pandemic. While these social media posts claimed that showing one of these flyers to a Costco employee would force them store to adhere to the ADA's anti-discrimination guidelines, Costco was already operating with this in mind. In fact, when Costco announced the mask requirement it noted that this new policy did \"not apply to children under the age of 2 or to individuals who are unable to wear a face covering due to a medical condition.\"", "Walansky, Aly.   \"People Want to Boycott Costco Over the Store's New Mandatory Mask Policy.\"\r\n    Today.   7 May 2020.", "Health and Human Services.   \"Summary of the HIPAA Privacy Rule.\"\r\n   Retrieved 11 May 2020.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]