["Minister in the presidency for planning, monitoring and evaluation, Jeff Radebe, made a bold claim about Africa’s population growth at South Africa’s annual presidency budget vote.", "While emphasising the potential of the African continent and its growing middle class, Radebe said that “by 2050, it is projected that Africa will have the same population as China and India combined”.", "A reporter flagged the claim to us.", "Director of media and communications in Radebe’s department, Tshegofatso Modubu, pointed out that Radebe went off script while delivering his speech.", "An online copy of his speech shows that he was meant to say “by 2050, it is projected that Africa will have the same population as China and India combined today” [our emphasis].", "Modubu said that this, entirely different claim, was backed up by the data in the 2015 edition of the United Nations World Population Prospect Report.", "“It is estimated that the population of India is about 1.311 billion and China 1.371 [billion],” she said. “Combined, they have a population of about 2.6 billion. It is estimated that the population of Africa will grow close to that figure by 2050.”", "To be fair, Africa Check decided to judge each claim separately.", "“By 2050, it is projected that Africa will have the same population as China and India combined”", "Let’s start with what Radebe said. When he spoke in parliament he made no mention of comparing Africa’s 2050 population with India and China’s 2015 population.", "The United Nations report provides population projections for 2015, 2030, 2050 and 2100.", "In 2015, Africa’s population was estimated at 1.2 billion. The combined total for India (1.3 billion) and China (1.4 billion) came to 2.7 billion.", "Fast forward 35 years and Africa’s population is expected to double. By 2050, the continent is predicted to be home to 2.5 billion people.", "That same year just over 1.7 billion people are expected to call India home, compared to 1.3 billion in China. Their combined population will come in at 3.1 billion.", "The claim that the continent “will have the same population” as India and China combined is therefore incorrect.", "Source: 2015 United Nations World Population Prospect Report", "“By 2050, it is projected that Africa will have the same population as China and India combined today.”", "Now we can move onto fact-checking what the minister was meant to say.", "An online copy of Radebe’s speech shows that he should have added the word “today” at the end of the sentence. It’s a small but important difference.", "By 2050, Africa’s population of 2.5 billion is still expected to be lower than India and China’s combined 2015 population estimate of 2.7 billion.", "This is a difference of around 210 million people. Or, put another way, a shortfall of about 1 Nigeria, 3 South Africas or 26 Lesothos when current population sizes are considered.", "The minister’s online speech is closer to the truth, although still an exaggeration.", "Edited by Anim van Wyk", "Please complete this form to receive the HTML sharing code.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "For democracy to function, public figures need to be held to account for what they say. The claims they make need to be checked, openly and impartially. Africa Check is an independent, non-partisan organisation which assesses claims made in the public arena using journalistic skills and evidence drawn from the latest online tools, readers, public sources and experts, sorting fact from fiction and publishing the results.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "© 2023 - Africa Check - All rights reserved.", "We will never charge you for verified, reliable information. Help us keep it that way by supporting our work.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "Support independent fact-checking in Africa."]