["About this rating", "On 11 August 2016, the hashtag #SaveTwitter began trending on Twitter along with claims that the social media site was shutting down in 2017 due to cyber bullying:", "These rumors were unfounded. Twitter has not announced they will be shutting down their online social networking service in 2017.", "While we haven't been able to determine exactly how this rumor got started, a possible scenario has emerged. Twitter user @BradTheLagLong posted the hashtag #savetwitter along with a message about cyber bullying shortly before the hashtag went viral:", "I apologize to those who love Twitter but the abuse I got on here was disgusting and that is why action needed to be taken. #SaveTwitter", "— BradTheLadLong (@BradTheLadLong) August 11, 2016", "Shortly after this message was posted, a picture of text blaming @BradTheLadLong for prompting Twitter to shut down began circulating", "BRADTHELADLONG HAS MADE TWITTER CLOSE DOWN. WHAT A WANKER #SAVETWITTER pic.twitter.com/VJ8VTYS12g — Queen Jorgie Porter (@Ollie_Ostrich) August 11, 2016", "These messages were sent around the same time that Twitter experienced an issue with follower counts and retweets:", "Some people may have briefly experienced issues with their follower counts and Retweets. This is now resolved, thanks for your patience!", "— Twitter Support (@Support) August 11, 2016", "A story painting a dim financial picture for the social media site was also published a few days before the #savetwitter hashtag went viral: BizJournals wrote on 8 August 2016 that a \"struggling Twitter\" was subleasing space at its San Francisco headquarters. While Twitter explained in a statement that \"we’re always looking at ways to use our office spaces more efficiently and effectively,\" at least one user shared that story along with the #savetwitter hashtag:", "A viral tweet about cyberbullying, a brief hiccup with follower counts, and a news article about a \"struggling Twitter\" seemed to have merged to create a false rumor that Twitter would soon be closing up shop.", "Twitter has taken steps to address cyberbullying, but the company has not announced any plans to shut down completely over the issue:", "Twitter is a thrilling place for teens. You can follow celebrities close enough to step on their digital heels. You can be the first of your friends to make a gif that goes viral. You can set up an account where you pretend to be a pop star crossed with a philosopher — or even your dad’s ten-gallon hat. Inanimate objects can have a voice, too, you know. Of course, all of this fun assumes that you’re using Twitter safely. Below are a few guidelines to help you do just that.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]