["How can this be allowed @HMOIndia? Sudha Murthy resigns from Thirupathi board. Jagan appoints his uncle YEHOVA VINCENT Subbareddy( YV SUBBARADDY) -a staunch Evangelist as chairman of TIRUPATI TUMALA BALAJI TEMPLE, richest Hindu shrine He works to spread more CHURCHES in Andhra.", "The above message was tweeted by Madhu Kishwar, who has posted misinformation on several occasions in the past. Kishwar has alleged that Andhra Pradesh CM Jagan Mohan Reddy had appointed his uncle, allegedly “a staunch evangelist”, as the chairman of the Tirumala Tirupati temple trust, displacing author and chairperson of Infosys Foundation Sudha Murthy, who was a member of the board. Kishwar in her tweet claims that the full name of Y V Subba Reddy, Jagan Mohan Reddy’s uncle, is Yehova Vincent Subbareddy. Subba Reddy was recently appointed to the post.", "How can this be allowed @HMOIndia? Sudha Murthy resigns from Thirupathi board. Jagan appoints his uncle YEHOVA VINCENT Subbareddy( YV SUBBARADDY) -a staunch Evangelist as chairman of TIRUPATI TUMALA BALAJI TEMPLE, richest Hindu shrine He works to spread more CHURCHES in Andhra.", "— MadhuPurnima Kishwar (@madhukishwar) June 11, 2019", "Her tweet has been retweeted over 6000 times and ‘liked’ over 8400 times since it was posted on June 11. Earlier, the same claim had been made in a tweet posted by a user Ritu Rathaur, who is followed on the platform by the Office of Nirmala Sitharaman, and Union Minister Giriraj Singh.", "So if sources are to be believed @ysjagan the newly appointed christian CM Of Andhra has made his maternal uncle a devout christian chairman of richest Hindu Temple Trust TTD Hail Indian Secularism which allows governments to control & destroy Hindu Temples!@PMOIndia @HMOIndia", "— Ritu (सत्यसाधक)🇮🇳 (@RituRathaur) June 5, 2019", "The Tirumala Tirupati Devasthanam (TTD) is an independent trust established for the management of the Tirumala Venkateshwara temple in Tirumala, Andhra Pradesh.", "Recently supreme court had commented that Hindu temples should be managed by Hindus only", "Then how @ysjagan is appointing Xtian (Reddy is fakery) Subba Reddy as Chairman of TTD Board? @svbadri @csranga @Swamy39 @Ish_Bhandari @arvindneela @MRVChennai", "What’s your comment? pic.twitter.com/GDRKvNDlkn", "— Shakuntala Iyer (@shakkuiyer) June 6, 2019", "The above user is followed on Twitter by Prime Minister Narendra Modi.", "Y V Subba Reddy’s full name is Yarram Venkata Subba Reddy and NOT Yehova Vincent Subba Reddy, as claimed by Madhu Kishwar in her tweet. This was confirmed by Subba Reddy himself, who retweeted a tweet in response to Madhu Kishwar, in which a copy of his poll affidavit was attached.", "In his defence, Subba Reddy tweeted a screenshot of an article in which he has been quoted as saying that he is a Hindu since birth.", "pic.twitter.com/js6GyfRwCg", "— Y V Subba Reddy (@yvsubbareddymp) June 12, 2019", "Moreover, Andhra Pradesh police has been asked to take stern action against those spreading false propaganda against Y V Subba Reddy.", "Interestingly, speculation about Y V Subbareddy’s appointment before his eventual confirmation, was followed by aggressive editing of his Wikipedia page, suggesting that he is a ‘converted Christian’. His page was later ‘protected’ due to ‘persistent vandalism’. More than 200 edits were made to the page before it was shielded from further alteration.", "Author and chairperson of Infosys Foundation, Sudha Murthy has clarified that her resignation from the board of the TTD was not political.", "In a conversation with The News Minute, Murthy said, “We were appointed by previous govt and it is not nice to continue without an invite. My decision was not political, it was just the decent thing to do.” She added, “My resignation has nothing to do with who becomes new TTD chairman. If the new government invites me, I will join”.", "In conclusion, the claim that Y V Subba Reddy’s full name is Yehova Vincent Subba Reddy is outrightly false, and so is the implication that Sudha Murthy was edged out in order to make way for a Christian to helm the temple trust.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]