["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "There was a net loss in jobs from November to December. Bureau of Labor Statistics data indicate that while women overall lost jobs, men overall gained jobs nationally.", "A separate Bureau of Labor Statistics survey indicates the number of employed white women increased, while the number of employed Hispanic or Latina women and Black women decreased.", "When the Bureau of Labor Statistics issued its latest job numbers, the Jan. 8, 2021, release brought a jaw-dropping number to light – from November to December the U.S. economy lost 140,000 jobs.", "Then came another jaw-dropper: As a group, only women lost jobs.", "Then came this claim, from Wisconsin Treasurer Sarah Godlewski. On Jan. 9, 2021, she tweeted a link to a CNN article about the job losses among women with this comment:", "\"This headline is hiding something from you. It wasn’t all women that lost jobs, it was mostly Black and Latina women. In fact, white women gained employment. Any response we have to this pandemic and economy has to also address structural inequality.\"", "Did Black and Latina women carry the brunt of job loss nationally, while white women gained employment?", "When asked for a source, Godlewski’s office pointed to the CNN article, dated Jan. 8, that she retweeted. That article noted the U.S. economy lost 140,000 jobs overall, with women losing 156,000 jobs, while men gained 16,000 jobs.", "Her office also pointed to this paragraph in the article:", "Black and Latina women disproportionately work in some of the hardest-hit sectors in the pandemic, often in roles that lack paid sick leave and the ability to work from home. As schools and day cares closed, many were forced to make hard trade-offs between work and parenting. \"Those sectors are less likely to have flexibility, so when employers are inflexible or women can't come to work because of caregiving responsibilities — they have to exit the workforce,\" said Nicole C. Mason, president and CEO of the Institute for Women’s Policy Research.", "We did our own check of the BLS numbers, and the preliminary November and December numbers reflect what was in the CNN article.", "But Godlewski’s claim was specifically on the difference in outcomes for Black and Latina women, as groups, when compared to white women.", "The BLS conducted a separate survey known as the Current Population Survey, which  measures employment for Black, Hispanic or Latina, and white women ages 20 and older. This data was part of the Jan. 8 release of the December jobs numbers. Participating households respond to the survey in the week of Dec. 6.", "That data, which is not seasonally adjusted, indicates the number of employed Black women decreased by 82,000 from November to December, and the number of Hispanic or Latina women employed decreased by 31,000.", "Meanwhile, the number of employed white women increased by 106,000 in the same time span.", "The overall number of women in the labor force has been fluctuating since the March-to-April numbers, which marked the first full hit of the pandemic. There was a decrease from July to September.", "Laura Dresser, an economist with the Center on Wisconsin Strategy at the University of Wisconsin-Madison, said prior economic declines were led by male-dominated fields, such as construction and manufacturing. The pandemic-driven decline, she said, has strongly affected areas – such as the restaurant and education industries – with a high number of women workers.", "\"And those jobs are low-wage jobs,\" Dresser said. \"They're held disproportionately by women. They're held disproportionately by people of color.\"", "With a link to a news article, Godlewski claimed: \"It wasn’t all women that lost jobs, it was mostly Black and Latina women. In fact, white women gained employment.\"", "Federal statistics show that, as a group, women accounted for all of the job loss from November to December. What’s more, the number of employed white women increased during that time frame, while the numbers for Black and Hispanic or Latina women fell.", "We rate this claim True.", "Sarah Godlewski, Twitter, Jan. 9, 2021.", "Annalyn Kurtz (CNN), The US economy lost 140,000 jobs in December. All of them were held by women, Jan. 8.", "Bureau of Labor Statistics, THE EMPLOYMENT SITUATION–DECEMBER 2020, Jan. 8, 2021.", "Bureau of Labor Statistics, A-1 Employment status of the civilian population by sex and age, Jan. 8, 2021.", "Bureau of Labor Statistics, A-2 Employment status of the civilian population by race, sex, and age, Jan. 8, 2021.", "Bureau of Labor Statistics, A-3. Employment status of Hispanic or Latino population by sex and age, last modified Jan. 8, 2021.", "Bureau of Labor Statistics, B-1 Employees on nonfarm payrolls by industry sector and selected industry detail, Jan. 8, 2021.", "Bureau of Labor Statistics, B-5 Employment of women on nonfarm payrolls by industry sector, seasonally adjusted, Jan. 8, 2021.", "Interview with Laura Dresser, Jan. 11, 2021.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]