["About this rating", "On 28 September 2017, The Hill and Marketwatch both reported that the Trump administration was \"forcing evacuees from Puerto Rico to sign promissory notes ensuring full repayment for transportation costs\" and was holding evacuees' passports as \"collateral\":", "[T]he U.S. government, in accordance with a long-standing but discretionary policy, will hold the evacuees' passports as collateral until it gets its money.", "According to the U.S. Department of State’s Bureau of Consular Affairs:", "\"Anyone evacuated on U.S.-government coordinated transport, including charter and military flights, must sign an Evacuee Manifest and Promissory Note (Form DS-5528) note prior to departure.”\n“The promissory note obligates an evacuated person to repay the cost of the transportation to the U.S. government.\"", "The cost of the \"promissory loan\" is based on \"the price of the last commercial one-way, full-fare (not discounted) economy ticket prior to the crisis.\" In other words, the loan isn't based on the discounted economy fare that many visitors probably found online to get to Puerto Rico.That’s not all:", "\"Upon evacuation, a Department of State official must limit an evacuee’s passport. In order to obtain a new passport, an evacuee must arrange payment as agreed upon via the promissory note.\"", "The claim struck a nerve amid a deepening humanitarian crisis in the United States territory of Puerto Rico after Hurricane Maria caused widespread devastation the week before. The Hill based its report off of Marketwatch's claim, which cited a U.S. Department of State page (\"Information for Evacuated U.S. Citizens\") that was not specific to Hurricane Maria, the Trump administration, or Puerto Rico:", "Procedures for Evacuation:", "The page has no date stamp, indication of when it was published, or information about when such policy was put into place, and the earliest archived version of the page on the Internet Archive was saved on 15 September 2017; Hurricane Maria did not appear until 16 September 2017. However, identical language was published in a September 2014 Department of State handout [PDF], and the policy clearly antedated \"the Trump administration.\"", "A 19 July 2006 article from ABC News reported:", "American citizens in Beirut relying on the U.S. Department of State to provide evacuation from the conflict-ridden city are faced with high and rising costs.", "A July 15 Department of State message tells U.S. citizens it will not \"provide no-cost transportation.\" Unable to present U.S. citizens with even up-front estimates for transportation costs, the Department of State has made it known that they require evacuated citizens to sign a promissory note and will bill individuals in the near future for their emergency evacuation. The government is evacuating citizens via helicopter and ferry to Cyprus where they can board commercial airlines home.", "Faerlie Wilson, an American student studying in Beirut tells ABC News, \"The Department of State makes you sign a form, and then they tell you the costs after.\"", "The policy gained some traction as a topic of debate in early September 2017.", "The practice of charging evacuated Americans can be documented back to at least August 1944 [PDF]. However, U.S. Code Title 22, Chapter 38, Section 2671 pertains to the return of Americans citizens from places outside the United States, not transport of American citizens to other American territories or states. (Puerto Ricans are American citizens.)", "It is possible the authors of the articles mentioned here received information not cited in the article about the situation in Puerto Rico, but also possible that policy was presumed to be implemented with no information one way or the other. Neither article made clear that evacuation (not dispatched aid) was the primary plan for rebuilding Puerto Rico, but in any case the relevance of the decades-old policy to the situation in the territory is unconfirmed. Notably, the Robert T. Stafford Disaster Relief and Emergency Assistance Act [PDF] (a law pertaining to federal response and \"natural disaster assistance for state and local governments in carrying out their responsibilities to aid citizens\") defines hurricanes such as Maria as applicable natural disasters and Puerto Rico as part of the United States:", "(a) The Congress hereby finds and declares that -\n(1) because disasters often cause loss of life, human suffering, loss of income, and property loss and damage; and\n(2) because disasters often disrupt the normal functioning of governments and communities, and adversely affect individuals and families with great severity; special measures, designed to assist the efforts of the affected States in expediting the rendering of aid, assistance, and emergency services, and the reconstruction and rehabilitation of devastated areas, are necessary.", "It is the intent of the Congress, by this Act, to provide an orderly and continuing means of assistance by the Federal Government to State and local governments in carrying out their responsibilities to alleviate the suffering and damage which result from such disasters by -", "(1) revising and broadening the scope of existing disaster relief programs ...\n(2) Major Disaster - “Major disaster” means any natural catastrophe (including any hurricane, tornado, storm, high water, winddriven water, tidal wave, tsunami, earthquake, volcanic eruption, landslide, mudslide, snowstorm, or drought), or, regardless of cause, any fire, flood, or explosion, in any part of the United States, which in the determination of the President causes damage of sufficient severity and magnitude to warrant major disaster assistance under this Act to supplement the efforts and available resources of States, local governments, and disaster relief organizations in alleviating the damage, loss, hardship, or suffering caused thereby.\n(3) “United States” means the fifty States, the District of Columbia, Puerto Rico, the Virgin Islands, Guam, American Samoa, and the Commonwealth of the Northern Mariana Islands.", "Although it is true that the Department of State billed evacuees for repatriation as far back as 1944, the Trump administration did not invent the policy. By 29 September 2017, The Hill edited their article to reflect that the claim was in fact false:", "The State Department is not requiring anyone evacuated from hurricane-ravaged Puerto Rico to sign promissory notes reimbursing the government for travel costs.", "Marketwatch reported that the evacuees from Puerto Rico were being required to put up promissory notes under a longstanding policy. The Hill also posted a story based on the Marketwatch report ... But the State policy does not apply to the U.S. territory of Puerto Rico, a spokeswoman for the department said.", "--This report was updated at 2:21 p.m. [on 28 September 2017]", "Anid, Ingrid and Astrid Hill.   \"The Price Of Escape.\"\r\n    ABC News.   19 July 2006.", "Bowden, John.   \"Trump Administration Forcing Puerto Rico Evacuees To Pay For Airfare: Report.\"\r\n    The Hill.   28 September 2017.", "Dropp, Kyle and Brendan Nyhan.   \"Nearly Half Of Americans Don’t Know Puerto Ricans Are Fellow Citizens.\"\r\n    New York Times.   26 September 2017.", "Kilgore, Tomi.   \"Mark Cuban, Pitbull Step Up, But Trump Administration Making Puerto Rico Evacuees Pay.\"\r\n    Marketwatch.   28 September 2017.", "U.S, Department of State Consular Affairs.   \"Information For Evacuated U.S. Citizens.\"\r\n    September 2014.", "U.S. Code: Title 22, Chapter 38.   \"§ 2671 - Emergency Expenditures.\"\r\n    Accessed 28 September 2017.", "Bureau of Consular Affairs, U.S. Department of State.   \"Information For Evacuated U.S. Citizens.\"\r\n    Accessed 28 September 2017.", "FEMA.gov.   \"Robert T. Stafford Disaster Relief and Emergency Assistance Act.\"\r\n    Accessed 28 September 2017.", "Updated [29 September 2017]: Changed rating from \"Unproven\" to \"False\" after the State Department confirmed there was no truth to the claim.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]