["“Biden and Friends Busted Partying and Singing Without Masks or Social Distancing at Joe’s Elite Birthday Bash,” reads the headline of an article on Daily Patriot Post, a right-wing website.", "The article, as well as several Facebook posts, feature a video of a smiling Biden standing next to Atlanta Mayor Keisha Lance Bottoms in a room full of people singing “Happy Birthday” to him.", "The video was originally posted on Twitter on November 20, 2020 by Bottoms herself, whose Twitter handle is visible in many of the social media posts.", "“Wishing our President-Elect @joebiden a VERY Happy Birthday from the great Blue state of Joe’gia!” Bottoms wrote.", "In the comments under the video, several users complained about Biden and Bottoms celebrating inside without masks during the pandemic. Some perceived it as unfair in a year when Americans are advised not to travel or gather in large numbers for Thanksgiving as cases of the virus virus reach record levels.", "“No masks. Large gathering. Singing so spittle is going all around. All with a man with dementia in a high risk category is right there. Meanwhile us peasants can’t have Thanksgiving,” one wrote.", "Wishing our President-Elect @joebiden a VERY Happy Birthday from the great Blue state of Joe’gia! pic.twitter.com/knv2XtcqYq", "However, the video is from November 2019, before the Covid-19 pandemic.", "In a tweet sent out 12 minutes after her birthday wishes, Bottoms specified that the video was taken for Biden’s birthday in 2019. She noted it was filmed at Atlanta’s Tyler Perry Studios, after the Democratic debate on MSNBC that day.", "Pre-Covid! This was in the @TPStudios White House following the @DNC @msnbc debate on 11/20/19. https://t.co/7IVxsirx2J", "Biden spokesman Kamau Marshall tweeted a video of the same scene from behind the president-elect, mentioning that the crowd had surprised Biden with a birthday song “last year”.", "On the afternoon of November 20, 2020, Biden was in Wilmington, Delaware, where he met with vice-president elect Kamala Harris, House of Representatives Speaker Nancy Pelosi, and Senate minority leader Chuck Schumer in the city’s Queen theater, his transition headquarters. Biden’s Twitter account published a photo of them sitting far apart and wearing masks, and mentioned that they discussed how to get the pandemic under control.", "Biden’s social media accounts do not mention any specific celebrations that day.", "This afternoon, @KamalaHarris and I met with @SpeakerPelosi and @SenSchumer to discuss how we’ll get this virus under control, deliver much-needed relief, and build back better than before.\n\n\t\tWe’re getting right to work for the American people. pic.twitter.com/jbeNpsimdj", "Biden is known for appearing publicly with a mask throughout the pandemic, and recently referred to mask-wearing as “a patriotic duty.”", "During the campaign, president Donald Trump often mocked Biden for wearing a mask.", "In early November 2020, Trump envoy Richard Grenell tweeted a photo of a maskless Biden on an airplane to portray him as “phony.” That photo, too, was from before the pandemic.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]