["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Medicare’s finances face a troubled future and according to U.S. Rep. Jon Runyan, the national health care law is hastening the program’s decline.\n\nRunyan, who is running for another term against Democrat Shelley Adler on Nov. 6, sounded his warning in an interview posted online on Sept. 17 with Townsquare Media New Jersey.\n\nRunyan (R-3rd Dist.) said, \"for those of you that are still in the workforce and have the ability to manage for retirement, we have to have a serious discussion on how to preserve Medicare for the long haul because if we do nothing and continue to let Obamacare siphon off that $700 billion dollars off the top of it, Medicare goes away in less than 10 years -- certain accounts of it -- and it just falls apart at the seams.\"\n\nIs the Patient Protection and Affordable Care Act -- what some call Obamacare -- taking money from Medicare and endangering parts of the program, as Runyan suggests?\n\nThere are several problems with that claim.\n\nThe law reduces future growth in Medicare costs by $716 billion over 10 years, according to the nonpartisan Congressional Budget Office. But that money isn’t cut from Medicare’s current budget and spending will continue to increase.\n\nIt’s worth noting that Runyan voted for a Republican budget that also included those spending reductions.\n\nBut the larger issue is Runyan’s suggestion that those reductions harm Medicare. The opposite is true.\n\nJonathan Oberlander, a professor of social medicine and health policy at the University of North Carolina-Chapel Hill, called Runyan’s statement \"absolute nonsense.\"\n\nFirst, Medicare isn’t going away, Oberlander said. \"Second, Obamacare improves Medicare’s benefits and its financial condition.\"\n\nTwo trust funds pay for Medicare. One of the funds is in good financial shape. When Runyan said certain Medicare accounts would go away, he’s referring to the fund for Medicare Part A, which pays for hospital care.\n\nThat fund is in trouble; an April Medicare Trustees report said it will run out of assets and be unable to meet all of its obligations by 2024.\n\nEven then, if nothing is done, the Medicare Trustees project the fund will take in enough revenue to meet 87 percent of its obligations in 2024. But the trustees note that \"in practice, Congress has never allowed a Medicare trust fund to exhaust its assets.\"\n\nRunyan’s campaign spokesman, Chris Russell, said that once the fund \"can no longer cover the costs of the benefits it’s supposed to provide, then something needs to give. If it's allowed to get to that point, you will either need to slash benefits or raise taxes to keep it fully intact.  That's [Runyan’s] point.\"\n\nStill, the fund will not disappear in less than 10 years. But more importantly, without the Affordable Care Act that fund would be in even worse condition.\n\nThe Congressional Budget Office estimated repealing the health care law would boost spending in Medicare Part A by $517 billion, in part by restoring future increases in payments to hospitals.\n\nIf the law is repealed, the fund would be unable to meet all of its obligations in 2016, eight years earlier than if the law stays in place. That’s because spending would increase and new revenues dedicated to the fund would be eliminated, according to the nonpartisan Kaiser Family Foundation.\n\nOur ruling\n\nRunyan said, \"if we do nothing and continue to let Obamacare siphon off that $700 billion dollars off the top of it, Medicare goes away in less than 10 years -- certain accounts of it -- and it just falls apart at the seams.\"\n\nThis statement is misleading on several fronts.\n\nThe health care law decreases growth in future Medicare spending by $716 billion over 10 years. It does not cut that amount from the current Medicare budget.\n\nAnalysts project one of the trust funds that pay for Medicare services will be unable to meet all of its obligations in 2024, but the fund would still cover some benefits.\n\nWithout the Affordable Care Act, the fund would be exhausted in 2016.\n\nFor those reasons, we rate this statement False.\n\nTo comment on this ruling, go to NJ.com.", "Townsquare Media New Jersey, Interview with U.S. Rep. Jon Runyan, Sept. 17, 2012\n\nE-mail interview with Chris Russell, campaign spokesman for Congressman Jon Runyan, Sept. 18, 2012\n\nE-mail and phone interview with John Hoadley, research professor at Georgetown University’s Health Policy Institute, Sept. 18, 2012\n\nE-mail interview with Jonathan Oberlander, professor of social medicine and health policy and management at the University of North Carolina-Chapel Hill, Sept. 19, 2012\n\nPolitiFact New Jersey, Rep. Jon Runyan claims Medicare \"will be gone in eight years, if we do nothing to it\", May 20, 2012\n\nCongressional Budget Office, Direct Spending and Revenue Effects of H.R. 6079, the Repeal of Obamacare Act, July 24, 2012\n\nPolitiFact, Is Barack Obama right on 'guaranteed benefits' under Medicare?, Sept. 17, 2012\n\nFactCheck.org, Medicare’s ‘Piggy Bank’, Aug. 24, 2012\n\nFactCheck.org, A Campaign Full of Mediscare, Aug. 22, 2012\n\nCenters for Medicare & Medicaid Services, Medicare Stable, But Requires Strengthening, April 23, 2012\n\nPolitiFact Ohio, Pat Boone claims Medicare will be bankrupt in nine years, March 29, 2012\n\nCongressional Budget Office, March 2012 Medicare Baseline, accessed Sept. 17, 2012\n\nPolitiFact, Ryan's plan includes $700 billion in Medicare \"cuts,\" says Stephanie Cutter, Aug. 15, 2012\n\nPolitiFact New Jersey, Jon Runyan claims Affordable Care Act cuts Medicare program by $500 billion, June 29, 2012\n\nJon Runyan for Congress, The Truth About Medicare, accessed Sept. 18, 2012\n\nNew York Times, Patients Would Pay More if Romney Restores Medicare Savings, Analysts Say, Aug. 21, 2012\n\nKaiser Family Foundation, Repealing the Affordable Care Act: Implications for Medicare Spending and Beneficiaries, Sept. 10, 2012\n\nCongressional Research Service, Medicare: History of Part A Trust Fund Insolvency Projections, May 27, 2009\n\nCongressional Budget Office, CBO's Analysis of the Major Health Care Legislation Enacted in March 2010, accessed Sept. 18, 2012\n\nKaiser Health News, FAQ: Decoding The $716 Billion In Medicare Reductions, Aug. 17, 2012\n\nFactCheck.org, Ryan’s VP Spin, Aug. 30, 2012\n\nPolitiFact, Paul Ryan said President Obama \"funneled\" $716 billion out of Medicare \"at the expense of the elderly,\" Aug. 29, 2012\n\nHouse Budget Committee, Fiscal Year 2013 Budget, accessed Sept. 12, 2012", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]