["About this rating", "On Oct. 10, 2019, U.S. President Donald Trump held a campaign rally in Minneapolis, Minnesota, during which he dissed some popular musicians, claiming that they had been used by Hillary Clinton to artificially inflate the crowd size at her presidential campaign events:", "Trump reminisced about the crowd sizes of his rallies during the 2016 campaign, saying, “I didn’t need Beyoncé and Jay-Z. And I didn’t need little Bruce Springsteen and all of these people.”", "He then claimed, without evidence, that these artists would come in and perform a couple of songs at Clinton events because she was unable to get a crowd. “What happens is they leave and everyone leaves with them, and she’s still speaking in front of the same lousy crowd. Craziest thing I’ve ever seen.”", "Afterwards, Occupy Democrats posted a meme that quoted Springsteen as saying \"We're living in a frightening time. The stewardship of the nation has been thrown away to somebody who doesn't have a clue as to what that means. Trump doesn't have a grasp of what it means to be an American\":", "That statement was correctly attributed to Springsteen and was taken from a two-part October 2019 interview the musician sat for with \"CBS This Morning\" to promote his concert film \"Western Stars\":", "Bruce Springsteen laughed off Donald Trump’s recent comments about him during a campaign rally, with the singer adding that the president “doesn’t have a grasp” on what it means to be an American.", "When CBS This Morning‘s Gayle King asked Springsteen if he was “surprised” that Trump was still “trash-talking” him, Springsteen just laughed and replied, “Anything’s possible.”", "“We’re living in a frightening time,” Springsteen added. “The stewardship of the nation has been thrown away to somebody who doesn’t have a clue what that means. Unfortunately, we have somebody who doesn’t have a grasp of the deep meaning of what it means to be an American.”", "Here's a video excerpt of Springsteen's remarks from that \"CBS This Morning\" appearance:", "https://youtu.be/m8ar38jz--Q", "Kreps, Daniel.   \"Bruce Springsteen: Trump ‘Doesn’t Have a Grasp’ on What It Means to Be American.\"\r\n    Rolling Stone.   25 October 2019.", "Blistein, Jon.   \"Trump Attacks Beyonce, Jay-Z, Springsteen Over Clinton Support.\"\r\n    Rolling Stone.   11 October 2019.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]