["By Beatrize Stephen-Pons", "Posted on June 29, 2018", "Q: Did Sandra Bullock say, “Donald Trump is doing everything to improve our nation”?", "A: No. There is no record of the actress ever making that comment, and her publicist says Bullock never said that.", "The viral story that attributes that fake quote to Sandra Bullock surfaced in the fall of 2017 and continues to be posted on different websites. The story’s wording remains identical across multiple websites, although some only include select phrases.", "Most of the story’s content was taken from an October 2015 People magazine article about Bullock, who was promoting a new movie at the time. As of June 2018, copies of the story still included a line from the People article saying that Bullock held a press conference “for her new film, Our Brand Is Crisis, in Los Angeles last Friday.”", "That film, in which she plays a political consultant, was released about three years ago.", "In addition to lifting sections from the People article, the unknown author added fabricated quotes from the actress.", "For example, the story also claims Bullock said, “If you don’t like our current President, you can leave our country and never come back, especially you Hillary.”", "We found no record of her making that statement or other comments that would indicate she is a Trump supporter and hostile toward his critics, such as Hillary Clinton. A publicist for Bullock, Cheryl Maisel, also told us via email that “Ms. Bullock NEVER made [those] statements” attributed to her in the viral story.", "The People article even suggested that Bullock might not vote for Trump in the 2016 election because she didn’t support comments he made about Mexican Americans.", "“I don’t agree with that at all,” the magazine quoted her saying. “That was not a statement that I can get behind. I don’t agree with that statement.”", "However, IndieWire reported in October 2015 that Bullock did say at another event promoting “Our Brand Is Crisis” that she appreciates that Trump says what he is thinking.", "“I’m grateful that he says it, so you know who you’re dealing with,” she said.", "“Secretly, I don’t want anyone to be advised, because I want to see who everyone truly is. The thing that makes him so engaging on television is the thing that, you know, might have gotten him derailed,” IndieWire quoted Bullock saying. “He just says whatever he wants to say, so I’m sure the strategist would say, ‘You gotta put a plug in it at some point. Even if you feel that way, don’t say it.'”", "During the same panel discussion, Bullock claimed to not have any partisan leaning.", "“Whether it’s Democratic or Republican, moderate or independent, I don’t care — give me the best person to take care of our country and those who are already here,” she said, according to IndieWire. “That’s the person I want.”", "She didn’t say whether that was Trump, Clinton or another candidate.", "Update, June 29: We updated this story with a comment from Bullock’s publicist.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk false stories shared on the social media network.", "“JUST IN: Actress Sandra Bullock to Hillary Clinton: ‘If you Don’t Like Our President You can Leave And… .” Americainfront.com. 27 Nov 2017.", "“Actress Sandra Bullock: ‘Donald Trump Is Doing Everything To Improve Our Nation, If You Don’t Like Him Just… .’” Whatpeopleneedtoknow.com. 13 Jun 2018.", "Kimble, Lindsay. “Sandra Bullock Says Her Political Views Are Informed by What’s Best For Her Son.” People. 17 Oct 2015.", "Erbland, Kate. “Sandra Bullock to Donald Trump: ‘Put A Plug In It.’” IndieWire. 28 Oct 2015.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]