["The June 2018 Facebook post, which we’ve archived here, says the sizeable mansion seen in the photo is owned by Malema and is located in the affluent Johannesburg area of Sandton.", "“This is house of Julius Malema in Sandton......the same Malema known for fighting for the poor in Alexandria....the same Malema who said he does not want to celebrate his marriage with the poor..!!!” it reads.", "A reverse image search of the mansion leads to numerous articles related to Malema as far back as 2010. The search results include a 2013 article about the sale of his “half-built mansion” on a popular South African property website.", "The website features the same misleading image of the eye-catching mansion. But as other news articles showed, the half-built mansion owned by Malema remained a construction site at the time -- it was not the completed house seen in the photo.", "In fact, the mansion seen in the Facebook post is a well-known landmark in Bedfordview, an affluent suburb in eastern Johannesburg. The house is known for a fish tank built into the walls that’s visible to the public -- see a blog post here. The property is not in Sandton, to the north of the city, as the Facebook post claims.", "In March 2010, a Johannesburg businessman, who wished to remain anonymous, told the Saturday Star newspaper that he designed the three-storey home and had since posted security guards outside to look out for his family, who he said were being harassed by people who wanted to see “Malema’s house”.", "Years later, Facebook user Alexandra Da Silva issued a plea for people to stop sharing the false information about her family’s home, as they “have no affiliation to Julius Malema”. The post has been shared more than 1,400 times since it was published on December 6, 2018.", "“THIS IS NOT JULIUS MALEMAS HOUSE? THIS IS STARTING TO GET OUT OF HAND, MY FAMILY LIVES HERE AND IF THIS ISNT STOPPED WHO KNOWS WHAT DANGER THEY COULD BE IN? PLEASE COULD EVERYONE SHARE THIS POST, AND MAKE IT KNOWN THAT INNOCENT PEOPLE LIVE HERE, WHO HAVE NO AFFILIATION TO JULIUS MALEMA.”", "Malema has often been accused of hypocrisy for living a wealthy lifestyle while claiming to represent South Africa’s poorest people -- as seen in articles here and here -- but he fiercely defends himself against such charges.", "We reached out to the EFF to ask about Malema’s supposed ownership of the home, but have yet to receive a response.", "In December 2018 Malema confirmed to media that he has a residence in Cape Town, as a member of parliament, but that his wife was renting a property in Johannesburg from a controversial alleged cigarette smuggler.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]