["About this rating", "In August 2020, a photograph supposedly showing a fisherman with a 327-pound halibut started to circulate on social media:", "As this picture spread on social media (the above-displayed posting racked up more than 100,000 shares alone), many people expressed skepticism over the size of this fish, arguing that the picture was an example of forced perspective. In other words, they argued that the fish was actually relatively small — it was just being held closer to the camera to make it appear larger.", "While forced-perspective photography has been the impetus of countless internet rumors (we've previously written about the non-existence of 110-pound squirrels and 42-pound frogs), this photograph of a 327-pound halibut appears to be real. A little forced perspective might be at play, but, in general, this is a real picture of a really big fish.", "This fish was caught circa Aug. 12, 2020, in Seward, Alaska, by a fisherman aboard a charter fishing boat operated by the J-Dock Fishing Company.  This charter fishing business shared a second photograph of this catch to its Facebook page:", "While we haven't ventured off to Alaska to verify this fish's measurements, we can say that a 327-pound halibut is well within reason. The National Oceanic and Atmospheric Administration writes that halibut, one of the world's largest flatfish, can grow to more than 8 feet long, and can weigh in excess of 500 pounds.", "According to The International Game and Fish Association, Jack Tragis is the current record holder for largest Pacific Halibut, having reeled in a 459-pound fish off the shores of Dutch Harbor, Alaska, in 1996.", "Thu, Jun 13, 1996 – 11 · The World (Coos Bay, Oregon) · Newspapers.com", "NOAA.   \"Pacific Halibut.\"     Retrieved 18 August 2020.", "The World.   \"Where's the Tartar Sauce?\"     13 June 1996.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]