["Multiple Facebook posts have shared the misleading footage, for example here on February 16, 2019, where it has been viewed nearly 200,000 times.", "It has also been posted repeatedly on YouTube, for example here, and on Twitter, for example here.", "The posts have a Hindi-language caption that says: “Have you ever seen such a Prime Minister who himself calls a widow of a martyr. He is wiping off their tears like a father. Your eyes will get moist after watching this.”", "The clip and the misleading claim were uploaded on social media two days after a suicide attack in Indian-administered Kashmir which killed around 40 Indian paramilitary soldiers. Here is an AFP report on the attack.", "Indian media routinely use the word “martyr” to describe soldiers killed in action. For example, this Times of India news report describes the Indian soldiers killed in the February 14, 2019, suicide bomb attack in Indian-administered Kashmir as \"martyrs\".", "In the misleading clip’s audio, a man can be heard consoling the woman seen speaking on the telephone, enquiring about her children, and assuring her that his party will help her.", "The man says: “My party workers will come to meet you, your family will be taken care and this sacrifice will not go in vain. I wanted to visit your place but it was hampered by bad weather conditions.”", "The woman says: “Me and my daughter need your blessings.”", "The man replies: “You are like family and we will take care of the family.”", "A reverse image search found the footage was first posted online in 2013.", "The exact same video that appears in the misleading posts was uploaded on Narendra Modi’s official YouTube channel here on November 2, 2013.", "The video actually shows Modi, who was then chief minister of India’s Gujarat state, speaking to a woman whose husband was killed at one of Modi’s rallies.", "Five men died in a blast on October 27, 2013 near a Modi rally in the eastern Indian city of Patna. Here is an Indian Express report on the incident. And here is an AFP report on the incident.", "Modi also tweeted on November 2, 2013 about the telephone call with the widow.", "“Spoke to wife of Shaheed Munna Srivastava on phone. We are all a part of one family & stand by them in this hour of grief,” he wrote.", "Spoke to wife of Shaheed Munna Srivastava on phone. We are all a part of one family & stand by them in this hour of grief.", "Indian media reports at the time, for example here, here and here, did not use the term \"martyrs\" to describe the five civilian victims of the 2013 bomb blast.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]