["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "In a recent debate, Democrat challenger Wayne Powell accused U.S. Rep. Eric Cantor of receiving a fortune in contributions from a a billionaire Las Vegas casino owner.\n\n\"You took $5 million from Sheldon Adelson,\" Powell said.\n\nCantor denounced the accusation as \"untrue.\"\n\nWe checked Powell’s claim that the House majority leader received $5 million from Adelson, chairman of the Las Vegas Sands Corp. casino empire who is making massive contributions to Republican political action committees this year. Adelson is chairman of the Republican Jewish Coalition, an organization that is trying to get Jews to support GOP candidates. Cantor is a member of the coalition.\n\nPowell’s campaign cited a July 15, article in Politico about how Adelson and his wife, Miriam, donated $5 million to the YG Action Fund, a super PAC that Politico said is \"backed\" by Cantor. The story said the couple together had also given another $5 million in February to another Republican super PAC -- the Congressional Leadership Fund -- \"backed\" by Cantor and other House leaders.\n\nWe verified the contributions through records through a database kept by the Center for Responsive Politics of political contributions reported to the Federal Election Commission. It showed Adelson and his wife each gave $2.5 million to the YG Action Fund on April 30 of this year.\n\nThe super PAC, as Politico noted, had been lagging in fundraising before the Adelsons stepped in, collecting just $55,000 for the first three months of the year.\n\nYG gets its name from the \"Young Guns\" label given to a triumvirate of House Republican leaders: Cantor; vice-presidential candidate Paul Ryan; and Rep. Kevin McCarthy, R-Ca. The three co-authored a 2010 book titled, \"Young Guns: a New Generation of Conservative Leaders.\"\n\nOn its website, the super PAC said it is \"dedicated to supporting conservative candidates to elected office who hold true to the Young Guns movement.\"\n\nTwo former Cantor aides play key roles in the super PAC. John Murray, the House majority leader’s former deputy chief of staff, is president and treasurer. Brad Dayspring -- also a former deputy chief to Cantor -- is an advisor to the super pac, according to a synopsis from Center for Public Integrity.\n\nSuper PACs arose in the wake of a 2010 Supreme Court decision that allowed unlimited corporate and union spending on elections. Super PACs can raise unlimited amounts of money from corporations, unions, and individuals and spend it to advocate for or against political candidates.\n\nBut under law, super PACs are not allowed to coordinate their spending with any particular campaign or candidate. They are barred from giving directly to political candidates.\n\nPowell’s campaign also pointed to a Politico article that said Cantor’s former aides who run the super PAC still provide the House Majority Leader with messaging advice.\n\nEvery Republican is Crucial (ERIC) PAC, controlled by Cantor, contributed $5,000 to the YG Action Fund on March 28 -- a month before the Adelsons’ big donations.\n\nIn early March, Cantor irritated many Republicans by taking sides in a GOP primary in which two House incumbents from Illinois were forced to run against each other because of redistricting. Cantor endorsed freshman Rep. Adam Kinzinger over 10-term Rep. Don Manzullo. Three weeks later, the YG Action Fund paid $52,000 to air a pro-Kinzinger radio commercial.\n\nSo is donating to YG the tantamount to giving money to Cantor, as Powell says?\n\nRay Allen, Jr., a Cantor adviser, said no. The super Pac and Cantor’s congressional re-election fund are \"distinctly different and legally separate entities.\"\n\n\"Just as people do not confuse donating to the Republican Party with donating to Cantor for Congress, people understand the difference between donating to the YG Action Fund and donating to Cantor for Congress,\" Allen said in an e-mail.\n\nLarry Sabato, a University of Virginia political scientist, offered a different take. \"Cantor is technically correct that he didn’t accept the money, but in the big picture, Adelson has gained influence with Cantor by donating $5 million to the Young Guns,\" he said. \"Does Cantor personally call the shots at the YG Action Fund? No. But if Eric Cantor wanted some candidate to be funded by the YG Action Fund, you can rest assured that would happen.\"\n\nSince 2001, the Adelson’s have contributed $30,800 to Cantor’s re-election campaigns and $15,000 to Eric PAC.\n\nOur ruling\n\nPowell said Cantor \"took $5 million from Sheldon Adelson.\"\n\nThat’s not correct. Adelson and his wife gave $5 million to the YG Action Fund. Cantor has close ties to the super PAC, which is run by two former senior advisers to the majority leader. The group takes its name from \"Young Guns,\" the title of a book Cantor co-authored.  \n\nPowell would have been correct in saying a super PAC closely tied to Cantor took $5 million from the Adelsons. But he exaggerated when he said Cantor took the money; the YG Action Fund is required to operate independently of Cantor.\n\nSo we find an element of truth in a largely inaccurate statement. We rate Powell’s claim Mostly False.", "C-Span.org,Virginia 7th Congressional District Debate, (Statement starts at 38 minutes into video), Oct. 1, 2012.\n\nE-mail from Ray Allen, Jr., strategist for Eric Cantor, Oct. 4, 2012.\n\nE-mails from Dave \"Mudcat\" Saunders, advisor to Wayne Powell, Oct. 4-5, 2012\n\nPolitico,\"Sheldon Adelson gives $5M to Eric Cantor-backed super PAC,\"July 15, 2012.\n\nPolitico,\"Cantor super PAC fundraising stumbles,\"April 15, 2012.\n\nCongressional Research Service,\"‘Super pacs’ in federal elections: overview and issues for Congress,\"December 2, 2011.\n\nCenter for Responsive Politics,\"YG Action Fund contributors,\"accessed Oct. 5, 2012.\n\nCenter for Responsive Politics,\"Congressional Leadership Fund contributors,\"accessed Oct. 5, 2012.\n\nCenter for Responsive Politics,\"Super PACs,\"accessed Oct. 4, 2012.\n\nYG Action Fund website, accessed Oct. 4, 2012.\n\nPolitico, \"Cantor distances himself from super Pacs,\" May 8, 2012.\n\nPolitico,\"A super PAC politician firewall? Not quite,\"August 23, 2012.\n\nThe Center for Public Integrity,\"PAC profile: YG Action Fund,\"accessed Oct. 4, 2012.\n\nFederal Election Commission,\"Contribution limits 2011-12,\"accessed Oct. 5, 2012.\n\nFederal Election Commission,\"Coordinated Communications and independent expenditures,\"February, 2011.\n\nInterview with Larry Sabato, political scientist, University of Virginia, Oct. 6, 2012.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]