["About this rating", "On 22 March 2019, the Washington Free Beacon website accused U.S. Rep. Ilhan Omar (D-Minnesota) of \"holding a series of secret fundraisers with groups that have been tied to the support of terrorism, appearances that have been closed to the press and hidden from public view.\"", "Although it's true that Omar in February and March of 2019 attended two fundraising events that were not open to the news media (one for charity and one for her reelection campaign), the events were not secret, nor were they hosted by groups \"tied to terror.\" Furthermore, a third event in which she spoke in front of a large crowd in Los Angeles on 23 March 2019 could hardly be mistaken for a \"secret\" one, as it was livestreamed by Fox News. Those facts didn't stop an echo chamber of websites from reproducing similar headlines insinuating that a U.S. congresswoman was sneaking around holding furtive meetings with global terror-linked organizations.", "Omar is one of the first two Muslim women to serve in Congress. An immigrant from Somalia, she is also the only member of Congress to don a hijab, the head covering worn by observant Muslim women. She has been the target of a slew of hoaxes and conspiracy theories, including unfounded claims she married her brother to game the U.S. immigration system, and false claims she made incendiary comments about white men. This fundraiser rumor is also not the first instance in which she has been falsely linked to terrorism.", "Free Beacon reported that, \"Omar recently spoke in Florida at a private event hosted by Islamic Relief, a charity organization long said to have deep ties to groups that advocate terrorism against Israel. Over the weekend, she will appear at another private event in California that is hosted by CAIR-CA PAC, a political action committee affiliated with the Council on American Islamic Relations, or CAIR a group that was named as an unindicted co-conspirator in a massive terror-funding incident.\"", "Those two sentences contained numerous falsehoods. For starters, Free Beacon conflated different organizations with similar names and relied on unreliable accusations or incomplete context to support their \"terror ties\" claim.", "The event in Florida was hosted by Islamic Relief USA (IRUSA). Although IRUSA licenses the \"Islamic Relief\" name from the global umbrella organization Islamic Relief Worldwide (IRW), it is distinct from IRW. IRUSA is a Virginia-based, non-profit that operates in 40 countries to provide disaster relief and to fight societal ills such as poverty, hunger, and inequality. It is also one of the organizations that has participated in the U.S. government's Combined Federal Campaign, one of many charities that federal employees can select to donate to directly from their paychecks.", "It was clear that Free Beacon conflated these two organizations, reporting that \"Islamic Relief has come under congressional investigation for what lawmakers have described as its efforts to provide assistance to terrorist group such as Hamas and the Muslim Brotherhood. The charity has been banned by some countries as a result of these ties. In 2017, Congress sought to ban taxpayer funds from reaching the charity due to these terror links.\"", "All the references linked to by Free Beacon are about IRW and not IRUSA, even though Omar spoke at IRUSA's 23 February 2019 benefit dinner to help raise money for famine victims in Yemen. It's unclear how the IRUSA event attended by Omar could be construed as \"secret,\" because although it was not open to the news media, the Eventbite page advertising the event noted that members of the public could RSVP to attend for as little as $15.", "And although it's true that then-U.S. Rep. Ron DeSantis (R-Florida) had pushed for an amendment to a spending bill that would have eliminated State Department funding for IRW, it died when DeSantis was not present to offer the amendment for a vote, citing the looming threat of Hurricane Irma. Opponents of the bill, including then-U.S. Rep. Keith Ellison (D-Minnesota), argued the amendment was motivated by Islamophobia, noting that IRW had broad support from reputable relief organizations and a track record of working alongside various United Nations agencies and European governments.", "United Kingdom-based IRW was banned from operating in the United Arab Emirates and Israel over terror accusations by the governments of those countries, which the charity forcefully denied. (The British newspaper The Telegraph termed the charges \"ludicrous and defamatory.\") Furthermore, the U.S. government does not designate the Muslim Brotherhood, which is an international religious and political movement, as a terrorist organization.", "Free Beacon demonstrated a similar problem conflating the prominent civil rights, non-profit organization Council on American-Islamic Relations (CAIR) with a separate political action committee, CAIR California PAC (CAIR PAC CA).", "On 24 March 2019, Omar spoke to an audience at a banquet hosted by CAIR's Los Angeles chapter. The event was attended by an estimated 1,000 protesters, who demonstrated outside the Hilton Woodland Hills venue as Omar spoke. The event garnered widespread coverage from news media.", "CAIR-Los Angeles Executive Director Hussam Ayloush expressed frustration about the characterization of the organization's activities as \"secret\" or \"terror\"-related, telling us that they were unfair. \"For Islamophobes, anything that Muslims do is nefarious somehow. When Muslims don’t engage [in American politics and discourse] they say, 'Oh what’s wrong with them, they're not integrating. They must have secret plans.' And when we are engaging they ask, 'Why are they engaging, they must have secret plans.'\"", "The day following the Woodland Hills event, Omar spoke at a privately hosted political fundraiser in Irvine, California, to benefit her reelection campaign. That event was sponsored by CAIR PAC CA, a political action committee that supports candidates of its choosing. According to fliers advertising the fundraiser, the event was billed as a \"meet and greet\" with Omar. The public could RSVP to attend by donating anywhere from $50 to $250, upon which the address of the venue would be provided.", "Citing death threats directed at Omar and the recent suspected hate crime vandalism of an Escondido, California, mosque, CAIR PAC CA President Joe Salas told us the event's address was kept discreet out of fear for the congresswoman's safety. But the event itself wasn't \"secret,\" he said, and about 400 to 500 people attended.", "\"We will open our events to the public when President Trump opens his [events] down at Mar-a-Lago,\" Salas joked, referencing similarly discreet campaign fundraising events that have benefited President Donald Trump.", "Accusations that CAIR has links to terrorism are long-standing, as are CAIR's rebuttals that the effort to paint them as such stems from anti-Muslim bigotry. The New York Times documented in 2007 that:", "Broadly summarized, critics accuse CAIR of pursuing an extreme Islamist political agenda and say at least five figures with ties to the group or its leadership have either been convicted or deported for links to terrorist groups. They include Mousa Abu Marzook, a Hamas leader deported in 1997 after the United States failed to produce any evidence directly linking him to any attacks.", "There were no charges linked to CAIR in any of the cases involved, and law enforcement officials said that in the current climate, any hint of suspicious behavior would have resulted in a racketeering charge.", "The Times also quoted retired FBI counter-terrorism agent Michael Rolince as stating, \"Of all the groups, there is probably more suspicion about CAIR, but when you ask people for cold hard facts, you get blank stares.\"", "Documenting a similar controversy in 2006 in which CAIR was accused of having terror links, the Associated Press reported:", "In a fundraising letter, state GOP Chairman Ron Carey said [Keith] Ellison has received \"financial support from a self-identified supporter of Hamas.\"", "That was a reference to [CAIR founder Nihad] Awad's 1994 statement that he preferred Hamas to the Palestinian Liberation Organization. In an interview, Awad said that was before the group engaged in suicide bombings and was designated a terrorist organization by the State Department.", "\"I don't support Hamas today,\" Awad said. \"My position and CAIR's position is extremely clear -- we condemn suicide bombings. We are mainstream American Muslims.\"", "The claim that CAIR was an \"un-indicted co-conspirator\" in a terror plot is incomplete and not new. The Washington Post analyzed it in 2011, reporting:", "These claims lack context. CAIR is an aggressive Muslim civil liberties organization, modeled on the Anti Defamation League, that has made it a target for criticism. It was indeed named as an “unindicted co-conspirator or joint venturer” in the Holy Land Foundation case -- an Islamic charity that in 2008 was convicted of funding Islamic militant groups. But CAIR was not alone in that designation; nearly 250 other organizations and individuals were also named.", "The federal government said the organizations were included on the list in order to produce evidence at the trial, but the district court and a federal appeals court later ruled that it had been a mistake to make the list public.", "As the appeals court summed up last year, “The court held that the Government did not argue or establish any legitimate government interest that warranted publicly identifying [one of the organizations] and 245 other individuals and entities as unindicted co-conspirators or joint venturers, and that the Government had less injurious means than those employed, such as anonymously designating the unindicted co-conspirators as ‘other persons,’ asking the court to file the document under seal, or disclosing the information to the defendants pursuant to a protective order.”", "However, federal Judge Jorge A. Solis denied CAIR’s request that its name be publicly stricken from the list. He said that the government “has produced ample evidence” to establish the association of CAIR and other organizations with entities such as the Holy Land Foundation, the Islamic Association for Palestine and with the Hamas militant group. Solis acknowledged CAIR’s claim that evidence produced by the government “largely predates” the official designation of these groups as terror organizations but he said the “evidence is nonetheless sufficient to show the association of these entities with HLF, IAP, and Hamas.”", "Free Beacon reported that \"Omar's appearance at these closed-door forums is raising eyebrows in the pro-Israel world due to her repeated and unapologetic public use of anti-Semitic stereotypes accusing Jewish people of controlling foreign policy and politics. With Omar's popularity skyrocketing on the anti-Israel left, it appears her rhetoric is translating into fundraising prowess.\"", "Estee Chandler, founder of the Los Angeles chapter of the progressive organization Jewish Voice for Peace (JVP), dismissed claims that Omar's commentary represents anti-Semitic views. Chandler, who supports Omar and maintains her comments were directed at state policy and not the Jewish people, accepted an award on behalf of JVP's work at the Irvine event at which Omar spoke.", "\"My rebuttal is that when they announced we were getting this award, Jewish Voice for Peace got a fairly long standing ovation from this room of supposed anti-Semites,\" she told us. \"It defies logic that anyone could characterize that room as anti-Semitic.\"", "Salas said that Omar's talk at the PAC event in Irvine wasn't recorded, but that it didn't contain any anti-Semitic remarks. Instead, he said, most of the crowd was composed of young activists who asked Omar a lot of biographical questions about her road to Congress. Also in attendance were members of San Diego, California's, Somali population and some members of the Jewish community, he said.", "We reached out to Free Beacon with emailed questions about their story but the publication declined to answer them.", "Kredo, Adam.   \"Omar Holding Secret Fundraisers with Islamic Groups Tied to Terror.\"\r\n    The Washington Free Beacon.   22 March 2019.", "Delmar-Morgan, Alex, and Peter Oborne.  \"The Continuing War Against Islamic Charities.\"\r\n    The Telegraph.   2 December 2014.", "Ramesh, Randeep.   \"Islamic Relief Defies Israeli Ban and Continues Operations in Palestine.\"\r\n    The Guardian.   11 December 2014.", "Finnegan, Michael.   \"Rep. Ilhan Omar Tells California Audience That Trump’s Anti-Islam Remarks Inspire Attacks Like New Zealand Shooting.\"\r\n    Los Angeles Times.   24 March 2019.", "MacFarquhar, Neil.   \"Scrutiny Increases for a Group Advocating for Muslims in U.S.\"\r\n    The New York Times.   14 March 2007.", "Frommer, Frederic J.   \"Muslims Supporting Congressional Hopeful.\"\r\n    Associated Press.   22 September 2006.", "Kessler, Glenn.   \"The King Hearings: Is CAIR a ‘Terrorist Organization’?\"\r\n    The Washington Post.   10 March 2011.", "Noted that Jewish Voice for Peace was given an award at the Irvine event.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]