["“The CDC has officially almost HALVED the number of COVID-19 deaths listed on their website. This is HUGE,” a May 2, 2020 Facebook post says alongside images of two sets of CDC statistics.", "“This means that the data is no longer trustworthy. Shocker,” the post says.", "But the statistics do not represent a reduction in the CDC’s toll: one number is based on data from death certificates while the other relies on information from US states, including confirmed and probable deaths due to the disease.", "The claim about the CDC's death toll has also been made on Facebook here, here and here, on Twitter here, here and here, and on Instagram here.", "It comes during an intense debate over measures taken to curb the novel coronavirus pandemic and how public health precautions should be adapted to allow a reopening of the US economy.", "The virus has killed more than 282,000 people worldwide since it emerged in China in late 2019, but decisions by officials in the United States to shutter non-essential businesses -- to limit its spread -- and the wearing of face masks are under growing scrutiny.", "Social media users have used the alleged reduction in the death toll to claim that the CDC’s statistics are unreliable and that the threat posed by COVID-19 has been exaggerated.", "The CDC has, however, not cut its figures, a spokesperson told AFP.", "“There has been no decrease or revision down in deaths,” the spokesperson said by email. “There are two sets of death data on CDC’s websites -- (1) from our National Center for Health Statistics, that includes provisional data from death certificates that have COVID-19 listed as a cause of death and (2) from reporting done by states to CDC.”", "The National Center for Health Statistics numbers are lower than the figures from the states.", "The “latter data collection includes deaths that are confirmed and probable,” the spokesperson added.", "AFP Fact Check has debunked more than 430 examples of false or misleading information about the novel coronavirus crisis. A complete list of our fact checks on the topic in English can be found here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]