["The misleading screenshot was shared here on Facebook on November 25, 2020.", "The Thai-language post contains a screenshot of a tweet, purportedly shared by Free Youth, which reads:", "“Breaking: #Nov25Mob Change to Thai Summit Tower, to avoid clashing with the founding mob and to avoid playing the same game as the tyrants. Together at 3 PM.", "Let’s celebrate our father’s birthday!!”", "The post also includes an attached infographic which reads: “Go to Thai Summit Tower!”", "Free Youth is a pro-democracy movement launched by students in Thailand. It is one of the main activist groups that has staged anti-government rallies in the country since July.", "The protesters have called for an overhaul of the government, the rewriting of the 2017 military-scripted constitution and the reform of the monarchy.", "The post’s reference to “Thai Summit Tower” relates to the Thai Summit Group, Thailand’s largest auto-parts manufacturer.", "Thanathorn Juangroongruangkit was an executive vice president of the Thai Summit Group, before quitting in 2018 to form a political party, Future Forward.", "Royalists have accused him of supporting anti-government protesters, the Bangkok Post reported here.", "Screenshots of the purported tweets were also shared here and here on Facebook.", "But the tweet was not sent from Free Youth’s verified Twitter account, which was created in January 2020.", "The tweet included in the misleading Facebook post was tweeted from this account with the handle @FreeY0UTHth on November 25, 2020.", "While both accounts show the same profile picture, the Twitter handle for the authentic account contains the letter “O”, instead of the number “0”.", "Below is a comparison of the fake (L) and real (R) Twitter accounts, with differences circled in red by AFP:", "Panumas \"James\" Singprom, co-founder of Free Youth tweeted on November 25 that the purported Twitter account is fake.", "จะว่าไปแอคเคาท์ปลอมนี้ทำกราฟิกเหมือนดีนะ อยากเห็นหน้าคนทำจริงๆ https://t.co/7xhj9WSseK", "The Thai-language tweet reads: “Actually, this fake account does the graphics quite well. [I] really want to see the man's face.”", "“We are in a digital world where everyone can post and share anything.\"", "AFP identified other fake Twitter accounts impersonating Free Youth here and here.", "In an email to AFP on November 29, 2020, Lauren Myers-Cavanagh, Twitter's Asia-Pacific head of policy communications, confirmed that the \"account was suspended for violation of the Twitter Rules against Impersonation.\"", "Dr. Jessada Salathong, a professor at Chulalongkorn University’s Faculty of Mass Communications, said imposter accounts may aim to “create friction to the society” and “cause confusion and misunderstanding to the protesters”.", "“In my opinion, the impersonators also aim to pull the people who are politically neutral to join their camps,” he told AFP by phone on November 27, 2020.", "Pijitra Suppasawatgul, head of the Journalism and New Media Department at Chulalongkorn University, told AFP on November 27 by phone: “We are in a digital world where everyone can post and share anything. It has become easier for impersonators to discredit the opposite camp.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]