["The video has been shared repeatedly on Facebook, for example here, which has been viewed around 68,000 times since it was uploaded on February 27, 2019.", "The footage shows rounds of tracer bullets being fired as flares fall from above in the dark.", "In the clip, a group of people appear in the foreground filming the bright barrage of bullets on their phones and a voice can be heard saying in English: \"...can do what a man can do\".", "The caption on the post, published by a Facebook page called \"Pak Army\", says: \"Current situation of Sialkot LOC\".", "LOC stands for the Line of Control, the de facto border between Pakistan and India in the disputed Kashmir valley. Sialkot is in Pakistan's Punjab province, near the border.", "Below is a screenshot of the misleading post:", "The same video with similar captions also appears elsewhere on Facebook, for example here.", "Pakistan and India have recently exchanged fire near the Line of Control. Here is an AFP story on the incident.", "But the video in the misleading Facebook posts does not show the current situation at the India-Pakistan border.", "A reverse image search using key frames from the video, obtained through digital verification tool InVid, found that the footage has been circulating online since 2017.", "The video was published in July 2017 on YouTube here, with the caption: “(Pakistan Army) Thousands of Tracers… Random Infantry Fire Power Show”.", "It was also published in July 2017 on Facebook here and elsewhere on YouTube here and here, with the caption: \"Pakistan Army Shows Fire Power\".", "Below is side-by-side comparison of video screengrabs from the misleading Facebook post (L) and the July 2017 YouTube video (R):", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]