["About this rating", "Displayed below is a genuine image of JonBenét Ramsey that appeared in the A&E docuseries \"Hunting JonBenét's Killer: The Untold Story.\"", "However, this is not the last known photograph of Ramsey.", "The identity of the woman in the background is unknown.", "In July 2020, following the arrest of British socialite Ghislaine Maxwell, who was allegedly connected to convicted sex offender Jeffrey Epstein's sex trafficking ring, a photograph went viral supposedly showing Maxwell pictured with JonBenét Ramsey, a 6-year-old whose disappearance and subsequent death made U.S. national news in 1996:", "This is a genuine photograph of Ramsey. However, the identity of the woman in the background is unknown and there's little evidence to support the claim that this person is Maxwell.", "This photograph appears in the April 2019 A&E special \"Hunting JonBenét's Killer: The Untold Story.\" We reviewed the version of this video available via Hulu and found this image at around the 1:21:40 mark. The photograph is presented as a new image that has never been seen by the public, but no information is provided about where or when it was taken.", "Some have presumed that this was the last photo of Ramsey, but that isn't the case. A few seconds after this photograph appears in the A&E special, another image is shown that supposedly shows the actual last photograph ever taken of her, on Christmas day 1996:", "There is little evidence to support the claim that Maxwell can be seen in the background of the viral photograph of Ramsey. In fact, this claim appears to be based almost entirely on the fact that the woman in the photograph and Maxwell both have short dark hair. The viral photograph only gives a partial glimpse at this person's profile, making it very difficult to identify this person with any accuracy. That hasn't stopped online investigators, however, who collected several images of Maxwell in an attempt to prove this theory:", "Maxwell may bear a passing, partial resemblance to the woman in the Ramsey photograph, but that is not proof that they are in fact the same person. Maxwell, of course, is far from the only woman to have short, dark hair and an angular nose.", "While the person in this photograph could be just about anyone other than Maxwell, social media users did point out one interesting connection between the accused sex trafficker and the Ramsey case: They both involved attorneys from the law firm Haddon, Morgan, and Foreman.", "This appears to be true. In 1997, Boulder, Colorado's \"The Daily Camera\" reported that the Ramseys had hired \"a pair of powerful Denver attorneys to advise them in the case,\" including G. Bryan Morgan, a founding partner of the Haddon, Morgan, and Foreman law firm. And court documents show that Maxwell was being represented by Laura Menninger, an attorney at this same firm, as recently as May 2020 in a civil suit. It's unclear if Menninger will also be representing Maxwell during her criminal trial.", "It should be noted that these two cases are separated by more than 20 years. Moreover, Haddon, Morgan, and Foreman have been involved in a number of high-profile cases (or cases involving high profile people), such as Harvey Weinstein, Kobe Bryant, Hunter S. Thompson, and Charlie Sheen. The lawyer who defended Oklahoma City bomber Timothy McVeigh also had a temporary office at Haddon, Morgan, and Foreman. In other words, the fact that Maxwell and the Ramseys turned to the same law firm says more about the firm's penchant for high profile and controversial cases than it does any connection between its clients.", "To sum up: The viral photograph of JonBenét Ramsey is real. However, this is not the final photograph taken of Ramsey, and the claim that the woman in the background is Maxwell is based on little more than a passing resemblance.", "Patten, Dominc.   \"Harvey Weinstein’s New Defense Team Officially Approved By NY Court – Update.\"\r\n    Deadline.   25 January 2019.", "Henson, Steve.   \"Bryant to Stand Trial in Rape Case.\"\r\n    Los Angeles Times.   21 October 2003.", "Kelly, David.   \"Low-Profile Defense Team Knows High-Profile Cases.\"\r\n    Los Angeles Times.   4 August 2003.", "Radar Online.   \"EXCLUSIVE: New Lawyer Appears In Court For Charlie Sheen.\"\r\n    19 April 2010.", "Hill, James.   \"Court Agrees to Delay Testimony of Jeffrey Epstein Confidant Ghislaine Maxwell in Civil Suit.\"\r\n    ABC News.   22 May 2020.", "Zaret, Elliot.   \"Ramseys Hire Only 'the Best.'\"\r\n    Daily Camera.   18 January 1997.", "Chronis, Peter.   \"Nichols May Have the Better Lawyer.\"\r\n    Denver Post.   21 September 1994.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]