["About this rating", "A specific component of bee sting venom, melittin, has been shown to destroy strains of HIV in lab cultures.", "A bee sting on its own would have no antiviral effect, and even isolated melittin would have to be delivered via complex nanoparticles to be viable as a therapy.", "A recurring scientific item spread online since 2013 has presented variations of the claim that bee sting venom can kill HIV, the disease that often leads to AIDS. This assertion is rooted in a 2013 study published in the journal Antiviral Therapy.", "As stated in that paper, the goal of the research was to establish a proof-of-concept for a topical anti-HIV gel using melittin, a peptide found in bee venom, that could serve as a prophylactic against HIV when applied prior to sexual activity.", "That melittin is damaging to viruses is not the breakthrough aspect of this research. Melittin is a cytolytic, which essentially means it can destroy cells by increasing their permeability. The problem is that melittin has this effect not just on viruses, but also on important human cells:", "Bee venom contains a potent toxin called melittin that can poke holes in the protective envelope that surrounds HIV, and other viruses. Large amounts of free melittin can cause a lot of damage. Indeed, in addition to antiviral therapy, the paper’s senior author, [...] has shown melittin-loaded nanoparticles to be effective in killing tumor cells.", "The breakthrough in this study was the researchers' ability to attach melittin to complex nanoparticles that allowed the compound to selectively target HIV without coming into contact with non-viral cells:", "The new study shows that melittin loaded onto these nanoparticles does not harm normal cells. That’s because [the researchers] added protective bumpers to the nanoparticle surface. When the nanoparticles come into contact with normal cells, which are much larger in size, the particles simply bounce off. HIV, on the other hand, is even smaller than the nanoparticle, so HIV fits between the bumpers and makes contact with the surface of the nanoparticle, where the bee toxin awaits.", "Their results were promising, too. Melittin that was not attached to these bumper-modified nanoparticles inhibited the HIV virus’s ability to infect cells, but it was also toxic to normal vaginal cells. But, according to the study, that latter effect was successfully blunted:", "Melittin formulated as a nanoparticle appears completely unreactive against vaginal epithelial or reporter cells in vitro, and still prevents infection ...", "This meant that by proof of concept standards, the research team had succeeded. Later research achieved another goal: demonstrating that the gel was not toxic to sperm, either. That mileston would be a step forward for mixed HIV status couples interested in a natural conception, the authors of that study argued.", "But ultimately, the truth is that while this compound is a component of bee venom, the delivery of that compound is a specifically engineered nanoscale process. It should also be noted that these studies didn’t even use melittin from an actual bee, but instead used a synthetic version — so being stung by live bees will in no way afford one protection against HIV.", "Hood, Joshua L.,   \"Cytolytic Nanoparticles Attenuate HIV-1 Infectivity.\"\r\n    Antiviral Therapy.   6 September 2012.", "McClendon, Jesse Francis.   Physical Chemistry of Vital Phenomena: For Students and Investigators in the Biological and Medical Sciences.\r\n     Princeton University Press, 1917", "Strait. Julia Evangelou.   \"Nanoparticles Loaded With Bee Venom Kill HIV.\"\r\n    The Source (Washington University in St. Louis) .   7 March 2013.", "Jallouk, Andrew P., et al.   \"Nanoparticle Incorporation of Melittin Reduces Sperm and Vaginal Epithelium Cytotoxicity.\"\r\n    Plos One.   18 April 2014.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]