["About this rating", "Coretta Scott King acknowledged several politicians, including Jeff Sessions, during her remarks at the dedication of the Rosa Parks Library.", "Coretta Scott King did specifically thank Jeff Sessions during the speech.", "Coretta Scott King, the wife of Martin Luther King, Jr., became a focal point of American politics in February 2017, when Senator Jeff Sessions of Alabama was nominated to serve as the Attorney General for the new Trump administration. During Sessions' confirmation hearings, Senator Elizabeth Warren of Massachusetts attempted to read to the Senate a letter Mrs. King had written in 1986, opposing Session's nomination for a federal judgeship:", "“Anyone who has used the power of his office as United States Attorney to intimidate and chill the free exercise of the ballot by citizens should not be elevated to our courts,” King wrote in the cover page of her nine-page letter opposing Sessions’s nomination, which failed. “Mr. Sessions has used the awesome powers of his office in a shabby attempt to intimidate and frighten elderly black voters. For this reprehensible conduct, he should not be rewarded with a federal judgeship.”", "According to the web site True Pundit, Warren presented the letter to the Senate in an attempt to \"smear\" Sessions and to frame him as a \"bigot.\" This argument, according to the web site, was \"shattered\" after a video surfaced of Coretta Scott King thanking Sessions during a 2000 dedication speech for the Rosa Parks Library:", "SHATTERED: Video of Coretta Scott King Thanking Jeff Sessions for Rosa Parks Library Crushes Elizabeth Warren Racial Stunt", "Well, that was quick. Sen. Elizabeth Warren’s racial stunt that sparked her removal from the senate floor Tuesday night proved even shorter than her time living in a teepee.", "Warren attempted to use the words of Coretta Scott King, the widow of slain civil rights hero Martin Luther King Jr., to smear Sen. Jeff Sessions’ bid for Attorney General. Warren’s now warrant-less claim was that King’s wife’s words framed Sessions as a bigot.", "But now a more recent video has surfaced where Coretta King in fact praises Sessions at the launching of the Rosa Parks Library and Museum.", "What a difference 12 hours can make.", "The video itself is real, recording a speech King delivered at the dedication of the Rosa Parks Library and Museum at Troy University in Montgomery, Alabama, in December 2000. However, King didn't actually thank or praise Sessions during her speech.", "King's only mention of Sessions came at the very beginning of her talk, when she listed off the politicians, civil rights activists, and other dignitaries who were in attendance at the event:", "To President Martindale, to Sen. Sessions, Mayor Bright, Troy State Chancellor, Jack Hawkins Jr., Dr. Dorothy Height, Ms. Johnnie Carr, Juanita Abernathy, Mammie Till-Mobley, to all of the distinguished program participants and guests in this audience today, it's a great honor and a privilege for me to join you in celebrating the grand opening of the Rosa Parks Library and Museum.", "King did not single out Sessions for praise, or specifically thank him, during her speech.", "Cameron Martindale, the President of Troy University Montgomery, did thank Sessions, however. As Martindale introduced Sessions, she said that the establishment of the Rosa Parks Library would not have been possible without his support:", "This project has been doubly blessed by having the support of both Alabama Senators. Senator Jeff Sessions and Senator Richard Shelby. They have worked tirelessly over the last two years to secure funding for this project and I cannot adequately thank them for what they mean to us. This project would not be possible without the support of Senator Shelby and Senator Sessions.", "Lowery, Wesley.   \"Read the Letter Coretta Scott King Wrote Opposing Sessions’s 1986 Federal Nomination.\"\r\n    The Washington Post.   10 January 2017.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]