["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Just days before voters head to the polls, the National Republican Congressional Committee released a new ad blasting Jared Golden, the Democratic candidate running for the U.S. House seat in Maine’s 2nd Congressional District.", "The \"Golden Years\" ad targets senior voters by claiming that Golden will \"steal\" their golden years to \"pay for his reckless agenda.\"", "Here's the NRCC ad in full:", "\"They call them the golden years, when you’re supposed to enjoy the life you worked so hard to build. But politician Jared Golden wants to turn your golden years into his. Golden supports a reckless bill to end Medicare as we know it. And he supports using your Social Security to fund other government programs. Jared Golden would steal your golden years to pay for his reckless agenda. Maine seniors can’t afford that risk.\"", "The \"reckless\" bill the ad refers to is Sen. Bernie Sanders’ \"Medicare for All\" proposal, which Golden has said he supports, following improvements to the Affordable Care Act. Conservatives have continuously said that such a system would end Medicare \"as we know it\" by creating a new program funded by the government and open to everyone, not just those 65 and older. (See this fact-check.)", "Here, we are going to focus on the accusation that Golden \"supports using your Social Security to fund other government programs.\"", "The claim is based on Golden’s one-time support of a statewide referendum, often referred to as \"Homecare for All,\" that will appear on the ballot in Maine on Nov. 6.", "The initiative would raise taxes on wealthier Mainers to help pay for a universal home care program. While there is debate over who the tax will affect, it has no direct ties to Social Security, would not cause people to lose their benefits and Golden does not support it in its current form.", "The citizen-initiated referendum would fund a home care program for elderly and disabled Mainers by implementing a tax on higher incomes in the state. It would also create a government board to administer the funds.", "The ballot question seeks to fund the system by adding a 3.8 percent surtax on incomes of more than $128,400. The Maine home care program would be paid for by collected on households earning income above $128,400. Funds would be managed by a board made up of industry representatives and home care recipients.", "The effort intends to solve a long-term problem in Maine’s home health care system, where aides make an average hourly age of $12.41, according to the Maine Labor Department.", "It is worth noting, too, that Maine holds the top spot as the oldest state in the country, according to a 2017 U.S. Census Bureau’s American Community Survey, which found the median age in Maine was 44.6, essentially unchanged from 2016.", "It wouldn’t.", "The closest connection is the threshold in which the Maine home care tax would kick in, on incomes more than $128,400. That’s because the government funds Social Security by taxing incomes up to $128,400.", "The NRCC cites Golden’s one-time support of the initiative as an attempt to erode seniors’ Social Security to pay for the program. The group pointed to a May 2018 op-ed Golden penned in the Portland Press Herald.", "\"If you’re like more than 98 percent of people in this state, you already pay a tax on all of the income you earn in order to fund Social Security, and your employer does the same,\" Golden wrote in the op-ed. \"Individuals who are paid more than $128,400 a year, however, currently do not pay any Social Security tax on income greater than that amount. The referendum would ask them to pay a bit more of their fair share on all of their income, like the rest of us already do.\"", "But Golden’s campaign said he wrote that before language changed in the final wording of the bill. Golden actually no longer supports the bill, because it could apply to families earning more than $128,400 a year as opposed to individuals.", "Golden’s campaign manager Jon Breed told us that while Golden believes there is a growing problem in Maine's home health care system, he \"does not agree that families with incomes over $128,000 should face a 3.8 percent tax increase.\"", "Since the bill’s language was altered, several analyses have concluded the measure would include married couples filing jointly.", "The NRCC also pointed us to a report on the proposal by the Maine Center for Economic Policy, a left-leaning research and policy organization.", "At one point in the analysis, it says that \"Mainers will be asked whether to partially close the Social Security tax loophole to fund a universal home care program.\"", "The report says the initiative would be the first of its kind in the country, and creates a new tax structure for high income earners that picks up where Social Security taxes leaves off. The tax also applies to non-wage income, which is currently untaxed by payroll-type taxes.", "What does that all mean for Social Security?", "Not much, as the threshold is the referendum’s only link to Social Security. The home care program would be funded through a new tax on high earners, not Social Security.", "The National Republican Campaign Committee said Golden \"supports using your Social Security to fund other government programs.\"", "The group is referring to Golden’s previous support of a state referendum that will appear on the ballot in Maine and would implement a tax on wealthier Mainers to fund a home care program. (Golden’s campaign says he no longer supports it after a recent change.)", "The program would not result in cuts to Social Security. The NRCC distorted a thin link, as the Maine tax would be levied above the current Social Security cut-off of $128,400.", "Again, it would not result in a decrease of senior’s Social Security benefits.", "We rate it Pants on Fire.", "NRCC ad, Oct. 30, 2018", "Social Security Administration, \"Maximum Taxable Earnings,\" Accessed Oct. 31, 2018", "Maine Labor Department, \"Occupational Employment and Wage Estimates, 2017,\" accessed Oct. 31, 2018", "U.S. Census Bureau, \"Fact Finder ,\" Accessed Oct. 31, 2018", "Portland Press Herald, \"State Rep. Golden: Voters have chance to expand vital home care options,\" May 23, 2018", "\"Homecare for All\" referendum, Accessed Nov. 1, 2018", "Associated Press, \"Northern New England states still the oldest,\" Sept. 14, 2018", "The Free Press, State of Maine Referendum Election, Nov. 6, 2018, Accessed Nov. 1, 2018", "Maine Revenue Service, \"Referendum analysis,\" Accessed Nov. 1, 2018", "Bangor Daily News, \"Where 2nd District hopefuls stand and where ads misfire on Medicare, Social Security,\" Oct. 30, 2018", "Bangor Daily News, \"Following the money on Maine’s home care ballot question,\" Sept. 17, 2018", "Maine Center for Economic Policy, New analysis: Home care tax would affect top 3 percent of wealthiest Mainers,\" Sept. 19, 2018", "Portland Press Herald, \"Will Maine referendum on home care penalize married couples?\" Aug. 17, 2018", "Email Interview, Chris Martin NRCC Regional Press Secretary, Oct. 31, 2018", "Email Interview, Jon Breed campaign manager for Jared Golden, Oct. 31-Nov. 1, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]