["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "State Rep. James White R-Woodville, speaks at the Judiciary and Civil Jurisprudence Committee at the state Capitol in Texas in March 2019 (Stephen Spillman for Statesman).", "In a tweet proclaiming \"so goes Texas, so goes the world,\" state Rep. James White said that 10% of children in the United States are Texans.", "Texas is the second most populous state in the nation and PolitiFact has checked a number of claims about its residents in the past. Most recently, we rated False a claim that a third of Texas has seen a \"20-25% population loss in the last 5 years.\"", "But what about White’s claim that 10% of all children in the United States live in Texas?", "White’s tweet used many abbreviations and symbols, but can be paraphrased as such: Texas youths are 20% of our state population, but 100% of our state’s future. Texas holds the destiny of our nation. Ten percent of U.S. children are Texans. So goes Texas, so goes the world.", "He included a link to a video showing a public interview he did with Raise Your Hand Texas, a non-profit education advocacy organization, about educational development of teachers in his district.", "Looking at the data", "When we asked White, a Republican from Hillister, for the source of his claim, he pointed us to a 2016 report from the Center for Public Policy Priorities, a left-leaning think tank, titled \"State of Texas Children.\"", "The report said: \"More than 7 million children live in Texas today, representing nearly 1 in 10 children living in the U.S.\"", "PolitiFact Texas checked a similar statement in 2017: \"One in 10 babies born in this country is born in Texas.\"", "We rated that claim True, based on data from the Centers for Disease Control and Prevention about annual births.", "But White’s claim is a bit different, as it focuses on total population, not annual births. For this check, we turned to two sets of data from the Census Bureau measuring population by age and location.", "There are about 73.4 million people in the United States under the age of 18, according to 2018 population estimates.", "There are about 7.4 million in Texas — about 10% of the total population of people under 18 in the United States.", "Texas makes up the second largest share of people under 18 in the U.S., after California, which is home to about 12% of the population under 18 years old.", "Within Texas, the population under 18 made up about 26% of the state’s population in 2018.", "In California, minors made up 23% of the state’s population in 2018.", "Our ruling", "White said: \"10% of U.S. children are Texans.\"", "White’s claim checks out. There are about 73.4 million minors in the United States and about 10%, or 7.4 million, live in Texas.", "We rate this claim True.", "Twitter, James White, Jan. 27, 2020", "Facebook, James White, Jan. 26, 2020", "U.S. Census, Annual Estimates of the Resident Population for Selected Age Groups by Sex for the United States, States, Counties, and Puerto Rico Commonwealth and Municipios, accessed Jan. 28, 2020", "U.S. Census, Annual Estimates of the Resident Population by Single Year of Age and Sex for the United States, accessed Jan. 29, 2020", "PolitiFact Texas, Fort Worth pediatrician says 1 in 10 U.S.-born babies born in Texas, Oct. 12, 2017", "Email interview with Rep. James White, Jan. 29, 2020", "Center for Public Policy Priorities, State of Texas Children 2016, accessed Jan. 29, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]