["About this rating", "The Dragon Soop brand of caffeinated alcoholic beverages has joined Anchor Butter and Cadbury chocolates as the target of unoriginal updates of an internet hoax dating back several years, a hoax holding that production line worker deliberately contaminated the product with HIV-infected blood:", "There is no truth to this rumor, just as there was no truth to similar rumors about other food and beverage items falsely alleged to have been contaminated with the virus that causes AIDS, such as pineapples, oranges, bananas, canned goods, and soft drinks, including Pepsi-Cola:", "This is the guys who added his infected blood to Pepsi :)#Copied pic.twitter.com/4rf5m2a5XR", "— RKJockies (@rkjhaw) December 18, 2017", "Because the specter of AIDS (acquired immune deficiency syndrome), scares people, the rumor continues to mutate and thrive despite the extreme unlikelihood of HIV (human immunodeficiency virus) being transmitted in such a manner. According to the Centers for Disease Control (CDC), the virus cannot survive long outside a human host and only under the rarest circumstances has been passed from person to person via food:", "You can’t get HIV from consuming food handled by an HIV-infected person. Even if the food contained small amounts of HIV-infected blood or semen, exposure to the air, heat from cooking, and stomach acid would destroy the virus.", "Though it is very rare, HIV can be spread by eating food that has been pre-chewed by an HIV-infected person. The contamination occurs when infected blood from a caregiver’s mouth mixes with food while chewing. The only known cases are among infants.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]