["One of the photos was posted on this Facebook page with over 250,000 followers attracting 6,633 shares and reactions and 748 comments.", "Another post on a Facebook page with over 700,000 followers also shared the same image and captioned it: \"The new Zambian Police uniform that was unveiled. ONE word to describe them.\"", "On Thursday morning, Zambia was one of the top trends on Twitter in Kenya with countless posts commenting on the alleged new Zambian police uniform.​", "Countless memes ridiculed the Zambian police service in the misleading posts.", "Police spokeswoman Esther Katongo told AFP she was aware of the picture and that it did not portray Zambian police.", "“The new uniform which is circulating [on social media] is for the Zambia Revenue Authority not for the police. We have not introduced any new uniform,” she said.", "According to a post on the official Facebook page of the Zambia Revenue Authority, the uniform was for customs officers and was introduced on January 16, 2019.", "\"The Zambia Revenue Authority has launched the new customs uniform for the enforcement units and the anti-smuggling units. The blue and gold striped uniform will enable officers to perform their duties comfortably regardless of the environment they find themselves in. With the new uniform, officers will now have an option of which uniform to use depending on the assignment and environment. The new staff uniforms meet the functional needs of anti-smuggling work,\" the Facebook post reads.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]