["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "American Hustle -- a movie based on the story of Abscam, the late-1970s FBI sting that ensnared more than a half-dozen politicians for accepting bribes -- got shut out at the Oscars despite snagging 10 nominations. But the movie is living on as an issue in a 2014 U.S. Senate race.", "Larry Pressler, a former U.S. senator from South Dakota now running as an Independent for another term in the chamber, is airing a campaign ad touting his role in the Abscam scandal. The twist is that Pressler is touting his honesty in the face of illegal offerings.", "\"American Hustle shows the FBI making real-life bribes to Washington politicians,\" Pressler says to the camera in the ad. \"I know, because as your U.S. senator, I turned them down.\"", "Pressler left office in 1997; since then, he's worked as an attorney and taught at universities. In his current race, he's widely considered an underdog to the Republican frontrunner, former Gov. Mike Rounds.", "Given all the attention American Hustle has been attracting since its release, we couldn’t resist taking a second look at the decades-old scandal.", "First, let’s recap what happened in Abscam. The case involved representatives of \"Arab sheiks\" -- actually, undercover FBI agents -- offering politicians payoffs that were intended to secure them casino licenses in New Jersey. The operation resulted in the convictions of Sen. Harrison Williams, D-N.J., six members of the U.S. House, and a number of local officials. The movie tells the somewhat fictionalized story of how the operation was undertaken on behalf of the FBI by a con man whose name in real life was Mel Weinberg. (Here’s an article about the real-life events that inspired the movie.)", "So how does Pressler fit in? It turns out that his role was largely happenstance.", "Pressler, then a first-term Republican who had weighed a run for president in 1980, was \"presented to the agents as a sudden substitute for the legislator they expected, who had decided against attending such a meeting,\" according to John Good, the FBI supervisor who oversaw the Abscam operation, in a July 23, 1982, New York Times article.", "Here’s how Pressler recalled what happened, in a first-person article published last year in the Huffington Post.", "In the fall of 1979, shortly after I concluded my dark-horse candidacy for the Republican presidential nomination, a prominent Washington, D.C. socialite, who was serving as one of my volunteer fundraisers, informed me that some wealthy people were eager to meet me and talk about contributing to my campaign deficit.", "As a relatively unknown first-term senator from South Dakota, I had few deep-pocketed supporters, and so I jumped at the chance to follow up on my fundraiser's promising lead. However, since it was illegal for a member of Congress to discuss fundraising on federal property, I agreed to meet the prospective donors in a home they were renting a short distance from the Capitol.", "On the appointed day, we arrived at a two-story redbrick colonial home on fashionable W Street. Inside, the house was furnished with exquisite antiques, elegant chandeliers and, as I would later learn, a battery of hidden television cameras and microphones. …", "One of the FBI imposters I met that day was a swarthy man who appeared to be from the Middle East. He told me that he represented a prominent sheik who was seeking entry to the United States for himself and a number of his associates and who needed special bills passed by Congress to allow them to avoid the usual immigration procedures.", "He then offered to make an under-the-table payment if I would play ball.", "\"Wait a minute!\" I said. \"What you are suggesting may be illegal. I would never do anything in exchange for a campaign contribution.\"", "And with that, I stormed out of the house.", "Ultimately, Pressler was never charged in Abscam, since he was one of the few officials approached who rejected a bribe outright. His actions won him plaudits from Federal District Court Judge George C. Pratt in upholding the convictions of seven Abscam defendants:", "Neither Pressler nor another target \"apparently knew he had been brought before the sheik's representatives to be offered money in return for a promise of favorable legislative action,\" Pratt wrote. \"However, neither one was overwhelmed by the circumstances, and each declined the offer. Pressler, particularly, acted as citizens have a right to expect their elected representatives to act. He showed a clear awareness of the line between proper and improper conduct, and despite his confessed need for campaign money, and despite the additional attractiveness to him of the payment offered, he nevertheless refused to cross into impropriety.\"", "CBS News anchor Walter Cronkite, at the time the epitome of credibility in the media, singled out Pressler’s actions for praise. And U.S. Senate historian Donald Ritchie told PolitiFact that he considered the ad’s claim to be correct.", "Syndicated cartoonist Jim Berry even drew a cartoon of Pressler being greeted by the Greek philosopher Diogenes, who was known for carrying a lantern in the hopes of finding an honest man somewhere in the world. The caption was, \"Senator Pressler? I am Diogenes. I've been looking for you.\"", "Our ruling", "Pressler said that \"American Hustle shows the FBI making real-life bribes to Washington politicians. I know, because as your U.S. senator, I turned them down.\" Pressler’s retelling fits with the description of the facts published in the media at the time -- actions that drew praise from a federal judge who wrote that Pressler \"showed a clear awareness of the line between proper and improper conduct\" and \"refused to cross into impropriety.\"", "We rate Pressler’s claim True.", "Larry Pressler, campaign ad, Feb. 28, 2014", "National Journal, \"How 'American Hustle' Is Helping One Former Senator's Campaign,\" Feb,. 28, 2014", "New York Times, \"Excerpts from Ruling by Federal Judge Upholding the ABSCAM Convictions,\" July 25, 1981", "Larry Pressler, \"American Hustle, Abscam, and What it Means to America\" (column in Huffington Post), Feb. 15, 2014", "Newark Star-Ledger, \"Jersey Hustle: The real-life story of Abscam,\" Nov. 25, 2013", "Washington Post, \"To the players in Abscam, the real-life ‘American Hustle,’ the bribes now seem quaint,\" Dec. 26, 2014", "New York Times, \"FBI Accused of Being 'Giddy' in Abscam Bribes,\" July 23, 1982 (accessed via Nexis)", "New York Times, \"Analysis: Abscam Inquiry: Focus on Targeting,\" Aug. 6, 1982 (accessed via Nexis)", "New York Times, \"FBI Chief Defends Undercover Work in Abscam,\" April 30, 1982 (accessed via Nexis)", "Los Angeles Times, \"Academy Awards 2014: 'American Hustle's' imperfect 10 at the Oscars,\" March 3, 2014", "KELO-TV, \"Pressler Remembers ABSCAM,\" Dec. 20, 2013", "Email interview with Donald Ritchie, historian of the U.S. Senate, March 4, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]