["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A fake news story circulating online falsely says President Barack Obama has used the United Nations to somehow force the United States to pay African-Americans reparations for slavery.", "The headline from the website Freedom Daily is wrong in every way and should be disregarded. \"Obama-Led U.N. Has Just Made It Official, U.S. To Immediately Pay Blacks ‘Reparations’,\" it read on Dec. 9, 2016.", "Freedom Daily, which bills itself as \"a forum for discussing meaningful conservative American and world news,\" quotes a story from a similar website called the Conservative Daily Post.", "These websites ridicule a report from the United Nations' Working Group of Experts on People of African Descent, a Geneva-based panel that had found the United States’ history of slavery had left a lasting impact on American society that justified reparations to African-Americans.", "They presented their report to the United Nations Human Rights Council in September 2016. The group of global human rights experts concluded from their research that past transgressions had led to current strife in America.", "\"In particular, the legacy of colonial history, enslavement, racial subordination and segregation, racial terrorism and racial inequality in the United States remains a serious challenge, as there has been no real commitment to reparations and to truth and reconciliation for people of African descent,\" the report read. \"Contemporary police killings and the trauma that they create are reminiscent of the past racial terror of lynching.\"", "The panel said progress had been made in America over the decades, but the nation was facing a \"human rights crisis\" brought on by the lingering racial discord.", "The \"reparatory justice\" suggested by the panel includes considering benefits similar to those sought by a Caribbean coalition seeking reparations from European countries that colonized them. Those reparations encompass the possibilities of \"a formal apology, health initiatives, educational opportunities, an African knowledge programme, psychological rehabilitation, technology transfer and financial support, and debt cancellation.\"", "Let’s first acknowledge that Obama doesn’t lead the United Nations, though the United States certainly holds sway over U.N. actions. The United States is a charter member of the group, a permanent member of the U.N. Security Council and a significant financial contributor. But the body is led by South Korean Secretary General Ban Ki-moon, who will be succeeded by Portuguese leader Antonio Guterres on Jan. 1, 2017.", "Furthermore, Obama has publicly said that he does not support the idea of financial reparations for slavery. He has said he’d prefer to focus on expanding access to jobs, health care, education and other programs to address the disadvantages minorities face.", "Additionally, the panel’s findings are nonbinding. The United Nations isn’t forcing the United States to do anything. The report was an academic exercise to explore the legacy of slavery on modern America.", "There’s nothing official about the report beyond its U.N.-sanctioned research. There certainly isn’t any plan for the federal government to pay such reparations, immediately or otherwise.", "Our ruling", "The website Freedom Daily said in a headline that the \"Obama-Led U.N. has just made it official, U.S. to immediately pay blacks ‘reparations’.\"", "The posts track back to a U.N.-affiliated panel that concluded America’s history of slavery has stacked the deck against modern African-Americans. The group found that reparations to those citizens are justifiable.", "Every part of the eye-grabbing headline is wrong: Obama doesn’t lead the United Nations, the report is non-binding and has no official impact on the federal government, and there are no plans for the U.S. to immediately pay reparations.", "About the only thing accurate thing in the posts are that such a study even exists, but it’s presented in such a misleading way that it’s beyond just inaccurate. It rates Pants On Fire!", "FreedomDaily.com, \"BREAKING: Obama-Led U.N. Has Just Made It Official, U.S. To Immediately Pay Blacks ‘Reparations’,\" Dec. 9, 2016", "PolitiFact, \"What Bernie Sanders, Barack Obama and Hillary Clinton have said about reparations for slavery,\" Jan. 26, 2016", "United Nations Human Rights Office of the High Commissioner, \"Statement to the media by the United Nations’ Working Group of Experts on People of African Descent, on the conclusion of its official visit to USA, 19-29 January 2016,\" Jan. 29, 2016", "United Nations General Assembly, \"Report of the Working Group of Experts on People of African Descent on its mission to the United States of America,\" Aug. 18, 2016", "Washington Post, \"WorldViews U.S. owes black people reparations for a history of ‘racial terrorism,’ says U.N. panel,\" Sept. 27, 2016", "ConservativeDailyPost.com, \"BREAKING: Obama-Led U.N. Has Just Made It Official, U.S. To Immediately Pay Blacks ‘Reparations’,\" Dec. 7, 2016", "UPI, \"Antonio Guterres sworn-in as ninth U.N. secretary general,\" Dec. 12, 2016", "United Nations Human Rights Office of the High Commissioner, Working Group of Experts on People of African Descent, accessed Dec. 14, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]