["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "With Rhode Island currently hobbled by the nation’s highest unemployment rate, gubernatorial candidates have been suggesting all sorts of ways to improve the state’s business climate.", "During a March 7 interview on Rhode Island Public Radio, Cranston mayor and Republican candidate for governor Allan Fung said the state sometimes nickel-and-dimes its businesses. He gave an example from his own experience.", "Fung said he hired a campaign manager for one of his previous campaigns.", "\"Well, lo and behold, I got this hundred-something dollar fee that came from the Department of Labor and Training, for hazardous materials.\"", "Fung said he had only the one employee, and, as a political campaign, no contact with hazardous materials.", "\"But because you have an employee, you have to pay that,\" he said.", "Do you? We checked it out.", "Fung’s political career goes back to 2002, when he won a seat on  the Cranston City Council (he was the second highest council vote getter). His first mayoral run, unsuccessful as it turned out, was in 2006, when he lost to Democrat Michael Napolitano by 79 votes.", "It was for that campaign that he hired a manager, Ryan Bilodeau. Copies of Fung’s 2006 campaign finance reports on file in the State Archives show regular payments to Bilodeau, as well as IRS withholding and state tax payments. They also show, on March 12, 2006, a $42 check made out to the state Department of Labor and Training, with the notation \"right to know registration form.\"", "The Department of Labor and Training is charged with enforcing what is known as the \"Hazardous Substances Right to Know Act,\" so named because it says employees in Rhode Island have a right to know what hazardous materials are used in their workplaces.", "The law requires businesses that deal with hazardous materials to notify workers -- and the labor department -- about the materials.  Even if a business doesn’t use any hazardous materials, it still has to file the form.", "In 2006, when Fung hired his campaign manager,  all Rhode Island employers were assessed a $42 fee when they filed the required declaration form, DLT spokeswoman Nikki Armstrong said.", "And that was the law. Until July 2013.", "That was when the General Assembly passed a budget article, submitted by Governor Chafee’s administration, that eliminated the fee.", "\"This change is the latest in a series of cost-saving initiatives my administration has made to improve regulations and to build a more customer-friendly business climate in Rhode Island,\" Chafee said in a statement announcing the abolition of the fee, an action he said was projected to save about 10,000 state businesses collectively around $400,000 a year.", "Fung for Governor campaign manager Patrick A. Sweeney acknowledged that the candidate was off by $58. But he said Fung’s bigger point, \"that we have a plethora of regulations that are hurting small businesses across the country,\" was still valid.", "Our ruling", "Allan Fung, recollecting events of eight years ago, said he had to pay a fee of about $100 for filing a hazardous materials notification form when he hired his first campaign staff member.", "He was right about there being a fee, but he overstated the amount. And in expressing his frustration about the fee, he gave the impression it still exists, when, in fact, it was eliminated a year ago.", "Because the statement contains some element of truth but ignores critical facts that would give a different impression, we rate it Mostly False.", "(If you have a claim you’d like PolitiFact Rhode Island to check, email us at [email protected]. And follow us on Twitter: @politifactri.)", "Rhode Island Public Radio, Bonus Q+A: Fung on Taxes, Debates, Paying for his Proposals & More, March 7, 2014. Accessed Mar. 19, 2014", "State of Rhode Island, Department of Labor and Training, Right-to-know online filing. Accessed March 19, 2014", "Rhode Island Department of Labor and Training, Media Advisory, \"Eliminating hazardous substances filing fee saves businesses $400,000,\" July 23, 2013. Accessed March 19, 2014", "Rhode Island Statutes, Chapter 28-21, \"Hazardous Substances Right to Know Act,\" Accessed March 19, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]