["About this rating", "President Donald Trump has faced criticism and even ridicule for what some observers perceive as a habit of speaking in an incoherent or disjointed manner, interspersing his public pronouncements with flights of thought, asides, and tangents of dubious relevance.", "For example, as a Republican presidential candidate, Trump departed from a criticism of the Obama administration's nuclear deal with Iran by launching into a protracted aside about his uncle Dr. John Trump's work as a physicist at the Massachusetts Institute of Technology (MIT), adding references to his family's \"good genes\" and his own university degree:", "Early in 2018, the 45th president famously dismissed claims that his mental state was \"unstable\" and that he routinely demonstrated a lack of competency for the duties of his office by insisting he was a \"very stable genius,\" and \"like, really smart.\"", "In January 2019, a meme emerged online that appeared to show President Trump paying U.S. military leaders the somewhat bizarre compliment of being \"better looking than Tom Cruise, and stronger,\" while marveling at the quality of a Pentagon meeting room. The anti-Trump, pro-labor union Facebook page \"Union Thugs\" then posted the meme, which was shared widely:", "An actual thing the President of the United States said today. Out loud.", "\"I had a meeting at the Pentagon with lots of generals. They were like from a movie. Better looking than Tom Cruise, and stronger. And I had more generals than I've ever seen, and we were at the bottom of this incredible room. I said 'This is the greatest room I've ever seen.'\"", "This unhinged lunatic has your nuclear codes, people!!!", "The quotation is complete and authentic. President Trump made the remarks during a lengthy, sprawling public cabinet meeting at the White House, which the New York Times labelled \"freewheeling and fact-free.\"", "Seventy-nine minutes into the meeting, a reporter asked President Trump whether he had a timeline in mind for the withdrawal of American troops from Syria, a policy decision Trump announced in December 2018 which prompted the almost immediate resignation of Defense Secretary Jim Mattis.", "The president did not answer that question but instead responded by criticizing former President Barack Obama's record on U.S. military involvement in Syria, reiterating his own desire to withdraw troops from the country (calling it \"sand and death\") and asserting that American military efforts to defeat ISIS in Syria had primarily benefited Iran, Russia, and the authoritarian regime of Syrian President Bashar al-Assad.", "The president then strayed into a tangent about Iran, saying it was \"a much different country to what it was when I became president.\" The following comprises the remainder of his response:", "Iran -- when I became president I had a meeting at the Pentagon with lots of generals. They were like from a movie. Better-looking than Tom Cruise, and stronger. And I had more generals than I've ever seen, and we were at the bottom of this incredible room. I said \"This is the greatest room I've ever seen.\" I saw more computer boards than I think that they make today. And every part of the Middle East, and other places, that was under attack, was under attack because of Iran. And I said to myself \"Wow.\" I mean, you look at Yemen, you look at Syria, you look at every place. Saudi Arabia was under siege. They were all -- I mean they wanted Yemen because of the long border with Saudi Arabia, that's why they're there, frankly -- but every place was under siege. And I actually asked a question, \"How do you stop these people? They're all over the place.\" They had plenty of money. President Obama had just given them $150 billion. He just gave $1.8 billion in cash, I'm still trying to figure than one out ... Gave $1.8 billion in cash, plane-loads of cash. I mean cash, from five different countries. You know why from five different countries...? Because we didn't have enough cash in the tri-state area to give them $1.8 billion. So they had to use the currency of other countries. That's the real reason. So with all of that, with all of that being said, I did something called \"Terminate the horrible Iran nuclear deal,\" which by the way in eight years gives Iran the legal right to have nuclear weapons. Okay? I did it. Iran is no longer the same country. Iran is pulling people out of Syria. They can do what they want there, frankly, but they're pulling people out, they're pulling people out of Yemen. Iran wants to survive now. Iran was a power in the Middle East, they were going to take over the whole Middle East. They were going to take over everything -- that's what they wanted to do -- and destroy Israel while they're at it. Iran is a much different country right now. They're having riots every week in every city, bigger than they've ever had before. Their currency is under siege thanks to us. A lot of bad things are happening. When we do all of the things that we've done, monetarily, to Iran, Iran is in trouble. And you know what, I'd love to negotiate with Iran. They're not ready yet, I don't think, but they will be. But Iran is a much different country right now...than it was when I took over. When I took over two years ago, Iran was going to take over the Middle East and who knows what, and they were going to have all the nuclear weapons they wanted in a very short period of time, because of that stupid deal. When I terminated that deal and then did what I had to do, Iran is a much different country today than it was 19 months ago. That I can tell you.", "President Trump was then pressed on the timeline for U.S. withdrawal from Syria but did not provide any details, saying only, \"It's just over a period of time.\"", "The relevant section of the cabinet meeting (including the question on troop withdrawal and President Trump's response) can be viewed below:", "The quotation included in the \"Union Thugs\" meme was fully accurate and complete (that is, it did not omit intervening remarks or present statements as sequential that were in fact separated by other remarks or subjects).", "Although the meme did not present the full context of President Trump's remarks, that ought to have no bearing on the reader's understanding of them because Trump's musings on Iran were themselves tangential to the question asked of him, which related to a timeline for the withdrawal of U.S. troops from Syria.", "Mikkelson, David.   \"Donald Trump's 'Nuclear' Speech.\"\r\n    Snopes.com.   17 August 2016.", "Colvin, Jill.   \"Trump Says He's 'Like, Really Smart,' 'A Very Stable Genius.'\"\r\n    Associated Press.   6 January 2018.", "Tackett, Michael and Linda Qiu.   \"Trump's Freewheeling and Fact-Free Cabinet Meeting.\"\r\n    The New York Times.   2 January 2019.", "Landler, Mark et al.   \"Trump Withdraws U.S. Forces from Syria, Declaring 'We Have Won Against ISIS.'\"\r\n    em>The New York Times.   19 December 2018.", "Borger, Julian.   \"Defense Secretary James Mattis Resigns and Points to Differences With Trump.\"\r\n    The Guardian.   21 December 2018.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]