["By D'Angelo Gore", "Posted on July 26, 2017", "Twice in two days, President Donald Trump falsely tweeted that acting FBI Director Andrew McCabe’s wife received $700,000 in campaign donations from Hillary Clinton.", "The nearly $675,000 — not $700,000 — donated to Dr. Jill McCabe, who unsuccessfully ran for a Virginia state Senate seat in 2015, came from the Virginia Democratic Party and Common Good VA. The latter is the political action committee of Democratic Virginia Gov. Terry McAuliffe, a longtime friend and supporter of Hillary and Bill Clinton.", "We previously wrote about the donations in October, when Trump mentioned them during a campaign rally. This time, he brought them up in a series of tweets in which he criticized Attorney General Jeff Sessions for not removing the current head of the FBI.", "Problem is that the acting head of the FBI & the person in charge of the Hillary investigation, Andrew McCabe, got $700,000 from H for wife!", "— Donald J. Trump (@realDonaldTrump) July 25, 2017", "Why didn't A.G. Sessions replace Acting FBI Director Andrew McCabe, a Comey friend who was in charge of Clinton investigation but got….", "— Donald J. Trump (@realDonaldTrump) July 26, 2017", "…big dollars ($700,000) for his wife's political run from Hillary Clinton and her representatives. Drain the Swamp!", "— Donald J. Trump (@realDonaldTrump) July 26, 2017", "But the contributions didn’t come from Clinton or her campaign, and Andrew McCabe wasn’t “in charge” of the FBI’s investigation of Clinton’s emails at the time of the donations, either.", "Jill McCabe’s campaign received $467,500 from McAuliffe’s PAC and another $207,788 from the Virginia Democratic Party for the November 2015 election. McCabe wasn’t the only candidate to receive “big dollars” from McAuliffe’s PAC that year. Common Good VA gave $803,500 to state Senate candidate Jeremy McPike, who won his race, and $781,500 to Daniel Gecker, who lost his. These donations were all part of a failed effort by the Democratic governor to help the Democrats take control of the state Senate that year.", "There’s no evidence that Clinton had any say in the contributions to McCabe’s campaign or even knew about them.", "Also, McCabe had lost the election by the time her husband became deputy director of the FBI in February 2016. It was in that role that he “assumed for the first time, an oversight role in the investigation into Secretary Clinton’s emails,” according to an FBI spokesman quoted by the Wall Street Journal, which first reported the story about the donations.", "The Journal wrote that while McCabe “was part of the executive leadership team overseeing the Clinton email investigation … FBI officials say any final decisions on that probe were made by Mr. [James] Comey, who served as a high-ranking Justice Department official in the administration of George W. Bush.” Comey was FBI director at the time.", "For more, read our original article, “Clinton’s Connection to FBI Official.”", "FactCheck.org Rating:", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]