["About this rating", "In September 2018, a quotation emerged online which appeared to offer support for the widely-held perception that President Donald Trump doesn't even like man's best friend: dogs.", "A Facebook user posted a meme to that effect on 10 September 2018, quoting Trump as having said \"I never understood why people like dogs. Dogs are disgusting\":", "We could find no evidence of Donald Trump's ever having said this, despite checking newspaper archives, the archives of the New York Times (which has closely covered his career and pronouncements for several decades), the FactBase web site's archive of interview and speech transcripts, and the Internet Archive's \"Trump Archive.\" The quotation appears to be bogus.", "However, does it allude to a real dislike of dogs on the part of the 45th president?", "The perception that President Trump dislikes or even hates dogs is a widely-held one. An October 2017 article by Newsweek article made just such a claim, asking \"Why does President Trump hate dogs?\"", "As evidence that Trump felt this way about canines, the article pointed to three pieces of evidence variously cited in a series of similar articles about his alleged negative sentiments and comportment toward dogs.", "'Like a dog'", "Robert Pattinson should not take back Kristen Stewart. She cheated on him like a dog & will do it again--just watch. He can do much better!", "— Donald J. Trump (@realDonaldTrump) October 17, 2012", "The first piece of evidence is the fact that Trump often uses \"dog\" as an insult. A cursory glance at his Twitter history reveals a penchant for calling his perceived enemies or rivals \"dogs,\" or describing their failures or shortcomings in somewhat unusual canine similes: \"choked like a dog,\" \"got fired like a dog,\" \"sweating like a dog.\"", "However, this habit does not necessarily demonstrate a fervent dislike of actual dogs. It could just as plausibly be part of the president's idiosyncratic way of speaking and writing, what the Huffington Post's Nick Wing aptly described as a \"lack of oratorical creativity.\"", "The logic of the argument is as follows: Donald Trump compares people to dogs as a way of insulting them, therefore Donald Trump thinks being a dog is undesirable, so it must follow that Donald Trump hates dogs.", "However, if one were consistent in applying this logical framework to all simile-based insults (or praise), one would end up forced to make some pretty bizarre claims: that anyone who calls someone else a \"rat\" for being disloyal is thereby declaring their hatred for actual rats, that anyone who uses the word \"snake\" to criticize someone else's duplicity must by necessity hate actual snakes, that anyone who praises someone as being a \"wily old fox\" must therefore have a love for that particular species, and so on.", "President Trump's 2012 declaration that Robert Pattinson should not reunite with Kristen Stewart because \"she cheated on him like a dog\" is evidence of his idiolect, and might suggest he doesn't fully understand how similes work. But that insult, along with all the others, is not sufficient evidence to conclude that he hates dogs.", "No dog in the White House", "The second piece of evidence cited by Newsweek (and others) is the fact that President Trump is the first occupant of the White House in more than a century not to own a dog. (According to the Washington Post, William McKinley was the last dog-free president before Trump.)", "Again, the logic of this argument collapses fairly easily. The absence of a dog from the White House (although unusual from a historical point of view) is not evidence that the president dislikes dogs. If one were consistent in drawing that conclusion from that premise, one would be forced to claim that the many millions of people who don't keep pet dogs in their homes are motivated by a dislike of dogs, when clearly other reasons might be more primary: allergies, time constraints, frequent travel, and so on.", "In fact, President Trump has reportedly already given an explanation for why the First Family does not currently keep a dog at the White House: he's just too busy.", "In the same Newsweek article whose headline read \"Why does President Donald Trump hate dogs?\" the president's friend Lois Pope recounted how she identified a Goldendoodle named Patton as the perfect dog for the family and offered to arrange for the Trumps to adopt him:", "[Pope] came across the gentle teddy bear, and presented him to Trump and son Barron at the Mar-a-Lago, where she has been a member for 24 years. “I went through great trouble to find the perfect dog for Donald Trump,” she told Newsweek. \"He would’ve been a perfect dog for any president.\" Patton is hypoallergenic, loyal and beautiful, she said.", "But it seems Patton wasn't destined for the White House -- Pope said Trump told her he was too busy for a dog, and she, in turn, was actually relieved she wouldn't have to give up the \"lovable giant pup\" with whom she had fallen in love.", "It is not intellectually supportable to speculate or conclude that the reason President Trump doesn't keep a dog in the White House is because he doesn't like them, when several plausible alternative explanations exist, and the president has already reportedly provided one (i.e., that he's too busy).", "'Not a dog fan'", "The third piece of evidence typically cited by those claiming Donald Trump hates dogs (including Newsweek) is arguably the strongest, but it is challenged by other available evidence.", "In her memoir Raising Trump, the president's ex-wife Ivana Trump wrote that he only reluctantly agreed to allow her poodle Chappy to live with them in New York and claimed he was \"not a dog fan\":", "So I spent my first month in New York exploring the city with my poodle at my side. Donald was not a dog fan. When I told him I was bringing Chappy with me to New York, he said, \"No.\" \"It's me and Chappy or no one!\" I insisted, and that was that ...", "I've told you about Chappy and his deep love for my chinchilla coat. He had an equal dislike of Donald. Whenever Donald went near my closet, Chappy would bark at him territorially.", "Newsweek cited that section as evidence that \"the feeling was mutual\" between the future president and his wife's dog Chappy. However, the very next line in the book, omitted from the Newsweek article, added nuance to the picture of Donald Trump as a dog-hater who feuded with his wife's pet poodle: \"Despite their issues with each other, Donald never objected to Chappy's sleeping on my side of the bed.\"", "Donald Trump has gone on record stating his dislike for pitbulls, specifically, saying in a 2008 interview with radio host Howard Stern that:", "I'm not a big fan of pit bulls. I've known too many people who were badly hurt by pits. I know a girl who is beautiful who is taking care of a dog who was a pit bull. The dog ripped her apart. So I'm not a big fan. You know these people come out, \"oh the poor dog the poor dog.\" These are trained killers these dogs.", "However, we could not find any similarly negative statements about dogs in general, and we did find evidence which might indicate that, at the very least, Trump is not as averse to dogs as is widely believed.", "Evidence to the contrary", "From 2010 to 2015, the Westminster Kennel Club in New York kept an annual tradition in which the winner of the Westminster Dog Show would visit Donald Trump for a photo-op at his office in Trump Tower, as shown in photographs from 2010, 2011, 2012, 2013 and 2015 (below):", "In 2013, the Westminster Kennel Club even wrote on Facebook that Trump had a \"genuine affection for dogs,\" next to a photograph of him smiling and holding that year's winner, \"Banana Joe\":", "In 2017, the Associated Press spoke to several people associated with the Westminster Dog Show, who described Trump as being welcoming and at ease while spending time with the illustrious competition's winners:", "People in the room for Trump’s visits, in those pre-presidential days, describe him as friendly and relaxed, smiling broadly while spending up to a half-hour with the victors. A self-confessed “germaphobe,” Trump didn’t seem bothered a bit by the close brushes with the dogs, either.", "...“He could not have been more engaging,” said [David] Frei, host of Westminster telecasts for 27 years. “He did not have any qualms.”", "Will Alexander, who was the handler for the 2015 champion \"Miss P\" and was interviewed by the Associated Press for its 2017 article, told us by phone that Trump seemed genuinely comfortable around the beagle during their 30- to 45-minute visit at Trump Tower, holding her and talking to her before and after the cameras were on him:", "He wanted to hold her right away. It wasn't just for a photoshoot ... I remember when he finally did put her down, he had some beagle hair on his suit -- because beagles tend to shed quite a bit -- and somebody went to wipe it off, but he told them to leave him alone, that it was fine. He didn't come across to me as someone who didn't like dogs ... He seemed quite genuine about it ... He seemed like he wanted her there, and he wanted to hold her and talk to her -- he seemed quite comfortable with her.", "Conclusion", "Ultimately, we can't say for certain how Donald Trump feels about dogs. However, at least as much evidence (if not more) suggests that he is comfortable around them as suggests that he finds them aversive, or even disgusting.", "The claim that he \"hates dogs\" appears to be based on shaky logic (he doesn't own one and he insults people by comparing them to dogs) and relatively scant evidence (his ex-wife said he was \"not a dog fan,\" but she also said that he had no objection to sharing a bed with one). It is also contradicted by photographic evidence and first-hand accounts of Trump's cheerful demeanor around dogs.", "Delkic, Melina.   \"Why Does President Donald Trump Hate Dogs?\"\r\n    Newsweek.   25 October 2017.", "Peyser, Eve.   \"Of Course Donald Trump Hates Dogs.\"\r\n    Vice.   17 August 2018.", "Rucker, Philip.   \"'Like a Dog': Trump Has a Long History of Using Canine Insults to Dehumanize Enemies.\"\r\n    The Washington Post.   14 August 2018.", "Bondar, Daniella.   \"Donald Trump Reportedly Hates Dogs, So That Might Explain a Few Things.\"\r\n     Elite Daily.   August 2018.", "Wing, Nick.   \"Donald Trump Clearly Doesn't Understand How Dogs Work.\"\r\n    The Huffington Post.   9 February 2016.", "Sclafani, Jennifer.   \"The Idiolect of Donald Trump.\"\r\n    Scientific American.   25 March 2016.", "Trump, Ivana.   Raising Trump.\r\n    Gallery Books, 2017.   ISBN 1501177281.", "Walker, Ben.   \"Put it on Paws? Trump Visit is Uncertain for Dog Show Champ.\"\r\n    Associated Press.   9 February 2017.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]