["Julio DeJesus pumps gas for 98.9 cents a gallon on March 30, 2020, in Cleveland. (AP)", "• According to AAA data, New York was one of 12 states that had unleaded regular gasoline that cost more than $2.00 a gallon on April 27, as long as the District of Columbia is included as a state.", "• All told, among the 50 states and D.C., New York ranked the seventh-highest for unleaded regular prices per gallon.", "With the coronavirus pandemic sending automobile miles plummeting — and with it, demand for gasoline — Americans are finding prices at the pump to be lower than they’ve been in years. But New York state remains on the higher end of that range.", "That’s what WKBW-TV, Buffalo’s ABC affiliate, reported on April 27, citing the American Automobile Association.", "\"New York is one of only 12 states where the average gallon of gas costs more than $2.00, according to numbers provided by the AAA of Western and Central New York,\" the report said.", "Is that correct? Yes.", "We asked AAA for the gas price data for April 27, and they provided us with the full list of 50 states plus the District of Columbia. The data comes from surveys of up to 120,000 gas stations across the country.", "We looked at the price per gallon for unleaded regular. Here’s the list of states, from most expensive to least expensive:", "According to this list, New York, at $2.18 a gallon, was the seventh most expensive state for gasoline, trailing Hawaii, California, Washington state, Oregon, Nevada, and the District of Columbia. (D.C. isn’t a state, but we’ll grant some leeway.)", "The other five states with gas prices above $2.00 were Arizona, Pennsylvania, Utah, Alaska, and New Jersey. That adds up to 12 states above $2.00, as the statement said, as long as you include D.C. as a state.", "Three states had gas below $1.40 a gallon: Ohio, Oklahoma, and Wisconsin.", "AAA isn’t the only source of this data. We also looked at data from the wesbite GasBuddy.", "GasBuddy sent us their own state-by-state prices from April 27 and it shows a similar pattern, but slightly different due to data sampling.", "New York, at $2.13, was one of eight states with gas prices above $2.00. In descending order, they were Hawaii, California, Oregon, Washington state, Nevada, New York, Arizona, and Pennsylvania.", "That’s fewer than the 12 states that AAA found with $2.00-plus gasoline, but four additional states on the GasBuddy list had prices just under $2.00. Utah, Alaska, the District of Columbia, and New Jersey all had gas prices at between $1.95 and $1.95.", "One reason why gas prices are relatively high in New York is the tax burden, according to an interactive map produced by the American Petroleum Institute.", "In 2018, New Yorkers paid more than 45 cents a gallon in state taxes and 18 cents a gallon in federal taxes, for a total of 63 cents a gallon. That’s nearly twice what Ohio motorists pay in taxes. New York is one of just a handful of states where motorists pay more than 49 cents a gallon in gasoline taxes.", "Since the article appeared, the situation hasn’t changed much.", "By the following week, only 10 states had average gas prices above $2.00 per gallon, and New York remained one of them.", "With some states beginning to re-open portions of their economies, gasoline prices have increased slightly in some states, according to AAA and GasBuddy data. But the average price per gallon in the United States had only risen a couple of cents per gallon,", "In New York, the changes were also minimal. AAA had New York’s average price per gallon at $2.15, while GasBuddy had a slightly lower price, $2.12.", "A news report cited the American Automobile Association in saying that \"New York is one of only 12 states where the average gallon of gas costs more than $2.00.\"", "AAA provided us the full data, confirming that the statement is correct, as long as the District of Columbia is counted as a state. Among the 50 states and D.C., New York ranked seventh highest in per-gallon prices for regular unleaded.", "Another gasoline price metric, from GasBuddy, had eight states above $2.00, with four additional states between $1.95 and $1.99.", "We rate the statement True.", "WKBW, \"Gas prices have dropped, but in N.Y. state they're still pretty high,\" April 27, 2020", "AAA, \"Only 12 states carry gas price average of $2/gallon or more,\" April 27, 2020", "AAA, \"As states re-open, motorists see pump price increases,\" May 4, 2020", "AAA, live gas price tracker, accessed May 7, 2020", "GasBuddy, live has price tracker, accessed May 7, 2020", "American Petroleum Institute, gasoline tax by state, accessed May 7, 2020", "Email interview with Elizabeth Carey, director of public relations and corporate communications with the AAA of Western and Central New York, May 7, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]