["About this rating", "Canadian authorities may use their discretion to ticket motorists who are eating while driving if they deem those motorists are unable to operate their vehicles safely.", "The new distracted-driving law applies only in the province of Ontario, and it is geared toward distractions caused by hand-held devices and not by eating.", "On 1 April 2019 the website \"Canada Eh?\" reported that Canadian motorists would soon run the risk of stiff fines for being caught eating while behind the wheel. The story's headline was: \"Canadians Can Be Fined $1000 for Eating While Driving Starting Next Month.\"", "Although the story was shared widely on social media, it wasn't quite accurate. One Canadian province, Ontario, did enact stricter penalties for distracted driving, such that first-time offenders could be penalized with a fine of up to $1,000 and a three-day license suspension.", "But each Canadian province, much like each state in the U.S., has its own motor vehicle code, and the $1,000 fine doesn't apply throughout all of Canada. Moreover, the new law in Ontario pertains specifically to hand-held devices rather than eating, and it went into effect on 1 January 2019 (not \"next month\").", "As the Canadian Broadcasting Corporation (CBC) reported, \"Drivers [in Ontario] who are caught talking on their phones, texting, dialing or emailing using a hand-held device, such as a cell phone and other entertainment devices, will be fined up to $1,000 with a three-day licence suspension and three demerit points.\"", "Penalties rack up with each offense, according to the CBC. \"Drivers with more than one distracted driving conviction will face a fine of up to $2,000, a seven-day licence suspension and six demerit points, while motorists who have been caught driving distracted more than two times will pay a fine of up to $3,000 and lose their license for 30 days.\"", "According to the Ontario government website, \"Ontario’s distracted driving laws apply to the use of hand-held communication/entertainment devices and certain display screens.\" Drivers may not:", "Eating while driving is not a specific part of the law, although motorists can still be ticketed if the act of eating impairs their driving, the Ontario government pointed out:", "You are allowed to use hands-free wireless communications devices with an earpiece, lapel button or Bluetooth. You can view GPS display screens as long as they are built into your vehicle’s dashboard or securely mounted on the dashboard.", "Other actions such as eating, drinking, grooming, smoking, reading and reaching for objects are not part of Ontario’s distracted driving law. However, you can still be charged with careless or dangerous driving.", "The British Columbian division of the Royal Canadian Mounted Police (RCMP) tweeted in 2017 an example of an instance in whic drivers could potentially be ticketed for unsafely eating while driving — slurping hot noodles with chopsticks:", "#DYK you can’t eat a bowl of soup while driving? Drive without due care= $368 Fine + 6 points #TicketTuesday pic.twitter.com/TlOXWtvgOW", "— BCRCMP Traffic (@BCRCMPTraffic) September 12, 2017", "When asked for a clarification of the tweet, RCMP Constable Melissa Wutke said it was meant to depict an \"exaggerated situation,\" and that not all instances of eating while driving would result in motorists' being ticketed.", "\"Each situation is considered on its own merit, there is no blanket statement such as if you eat noodles and drive it will equal this, it's all very dependent on the situation the officer sees,\" she told the local news outlet KelownaNow. \"But if you're able to eat something with one hand that likely isn't going to distract you from driving, then that probably is not the problem.\"", "CBC News.   \"Ontario's New Distracted Driving Law to Start in 2019.\"\r\n    22 November 2018.", "McCullough, Dylan.   \"RCMP Clarifies Snacking While Driving Tweet.\"\r\n    KelownaNow.   14 September 2017.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]