["About this rating", "On 11 April 2017, the \"America's Last Line of Defense\" web site published an article positing that U.S. Supreme Court had just ruled that \"the only Islam taught to our children in public schools will be the history of Radical Islam and what they can do to help stop it\":", "The full panel of nine SCOTUS justices met yesterday to decide the fate of a case very near and dear to Barack Obama and the Democrats. The court ruled 5-4, with Justice Gorsuch casting the tie-breaker, that the only Islam taught to our children in public schools will be the history of Radical Islam and what they can do to help stop it.", "Judge Gorsuch, in his first opinion for the high court, wrote:", "'The government certainly has no business being involved in religion, but this isn’t a government issue or a religious issue. This is about the Judicial branch interpreting the laws as they apply to the teaching of religion. We should be teaching any religions in this country besides standard Judeo-Christianity, as our founders wanted, and we certainly shouldn’t be filling the children with lies about Islam being a “religion of peace” when they see the carnage on the news almost every day.", "It is our duty as Americans first and judges second to safeguard the way our children are indoctrinated.'", "There was no truth to this story, which originated with the clickbait fake news site \"America's Last Line of Defense\" and was widely spread online by a network of shill sites.", "Newly confirmed justice Neil M. Gorsuch's first day on the high court did not take place until 17 April 2017, a week after the \"America's Last Line of Defense\" article was published.  On that first day, the court heard no cases involving the teaching of religion in public schools.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]