["About this rating", "On 4 January 2017 the Seattle Tribune web site published an article reporting that six individuals protesting the election of Donald Trump were killed in the course of blocking a freeway:", "A 32-year old man driving a Waldrum Brother’s delivery truck is responsible for the death of 6 Anti-Trump protesters that were blocking traffic while chanting “Dump Trump” in the middle of a Seattle freeway.", "The accident occurred near an I-15 off-ramp today around 5:15 PM. According to witnesses, a crowd of approximately 16 individuals pulled their vehicles to the side of the freeway and created a barricade by linking their arms together.", "The protester’s actions immediately hindered the flow of traffic and motorists became upset at what many of them viewed as an unwanted obstacle preventing them from getting home after a long day at work.", "Although the Seattle Tribune appears to be the digital edition of a real city newspaper, it is simply one of many fake news sites (along with the Boston Tribune and the Baltimore Gazette) that mimics the appearance of real metropolitan news outlets in order to spread hoaxes and generate ad revenue. The Seattle Tribune is the latest front employed by the well known fake news purveyor Associated Media Coverage:", "A number of fellow fake news or \"satire\" sites feature disclaimers informing readers their articles are fabricated, but Associated Media Coverage (and the Seattle Tribune) do not.", "Although the photograph used with the fake Seattle Tribune article was captioned \"Delivery truck collides with protesters chanting 'Dump Trump' in the middle of the freeway,\" the image was published as early as October 2016 and was unrelated to any incident involving anti-Trump protesters killed by a truck while blocking a freeway.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]