["About this rating", "On 12 March 2017, the Twitter account @memeprovider recirculated an old rumor holding that the FitnessGram Pacer Test (a multistage aerobic capacity test that progressively gets more difficult as it continues) had been banned from schools because it was deemed too cruel for children:", "The graphic included in the tweet was taken from a February 2016 article published by the web site Neomongolia News Network:", "A controversial fitness test has been banned from all schools in Neomongolia today after an executive order by President Chinkus. The test has been subject to a ton of blast after becoming a viral sensation online. Many coming forth saying that the test has damaged their psyche, giving them PTSD.", "There was no truth to either the tweet or the earlier article it echoed.", "Although the Neomongolia News Network web site does not carry a readily available disclaimer labeling its content as fiction, the article was clearly written in jest. The story takes place in a fictional location (\"Neomongolia\") and references a non-existent president (\"President Chinkus\") and an imaginary currency (\"250,000 Neomongolian dollars\").", "A brief perusal of some of the web site's other headlines (\"Bernie Sanders Returns to Assisted Living Facility,\" \"Cruz, Bush Share Room in Psychiatric Hospital,\" and \"Chinese Smog Crisis Solved After Vape Shop Raids\") reveals that this web site is clearly an \"entertainment\" outlet and not a news source.", "The FitnessGram Pacer (Progressive Aerobic Cardiovascular Endurance Run) Test is a real cardio activity developed in 1982. A common copypasta explains the rules of the exercise:", "The FitnessGram Pacer Test is a multistage aerobic capacity test that progressively gets more difficult as it continues. The 20 meter pacer test will begin in 30 seconds. Line up at the start. The running speed starts slowly but gets faster each minute after you hear this signal [beep]. A single lap should be completed every time you hear this sound [ding]. Remember to run in a straight line and run as long as possible. The second time you fail to complete a lap before the sound, your test is over. The test will begin on the word start. On your mark. Get ready! ... Start. ding", "This test became a bit of a meme in 2016 as Vine users took audio from a recording of the exercise and placed into various videos:", "https://vine.co/v/ipl65jpUhle/embed/simple", "Although the FitnessGram Pacer Test may still strike fear into people of a certain age, this test was not banned from schools for being overly cruel to children.", "Neomongolia News Network.   \"Pacer Test Banned for Child Cruelty.\"\r\n    27 February 2016.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]