["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "When it comes to taxes, Democratic candidate for governor Nan Rich wants to make things more fair for the little guy in Florida.", "Rich, a former state senator from Weston, faced a question about whether Florida’s tax system should be changed during a Florida Press Association event July 11 at the swanky Biltmore Hotel in Coral Gables.", "\"I think it's a regressive tax base, and when you look at some of the studies saying it’s the third most-regressive tax base -- I don't want you to quote me on that because PolitiFact may get me, I'm not sure if it’s (No.) three -- but I think there are things we need to do to make a more equitable and fair tax structure.\"", "At PolitiFact Florida, our ears perk up when we hear rankings that put Florida near the top or bottom. As for her request for us not to PolitiFact her, well, we couldn’t help but take that as a friendly challenge.", "Studies about regressive taxes", "Rich told PolitiFact Florida in an interview, \"don’t hold me to ‘third regressive.’ .... I did not say ‘third’ definitively. ... We are one of the most regressive.\"", "Rich cited a 2013 report by The Institute on Taxation and Economic Policy, which partners with Citizens for Tax Justice, a group that advocates for fair taxation of middle- and low-income families.", "The report concluded that all states have regressive tax systems. It means that state taxes come more from the poor and middle class than from the rich.", "\"Virtually every state’s tax system is fundamentally unfair, taking a much greater share of income from middle- and low-income families than from wealthy families,\" the report says. \"The absence of a graduated personal income tax and the over reliance on consumption taxes exacerbate this problem in many states.\"", "The report measures property, sales and excise taxes on gasoline and cigarettes paid by different income groups in each state in 2013 and concludes Florida is \"No. 2 of the terrible 10\" -- the second most-regressive tax system in the country. (No. 1 was Washington state.)", "\"The No. 1 and No. 2 predictor of a very unfair tax system is not having a personal income tax of any kind and an above-average sales tax, and Florida has both of those things,\" said Matt Gardner, the institute’s executive director.", "The report found that for non-elderly taxpayers, the bottom 20 percent pay 13.2 percent of their income toward state and local taxes. Meanwhile, the top 1 percent of earners only pay about 2.3 percent of their income toward state and local taxes.", "The report gives a nod to one progressive feature of Florida’s taxes: We don’t have sales taxes on groceries.", "We were unable to find any other entity that included Florida in a state-by-state comparison of regressivity and taxes.", "The Tax Foundation, a business-backed group that analyzes tax policy, wrote a report criticizing the institute’s study, but their points were not specifically about the states’ rankings. Instead, they criticized the report for promoting income taxes.", "The foundation does its own ranking of states in terms of business climate -- Florida placed fifth.", "We interviewed a few experts on taxes, and they were not surprised by Florida’s ranking when it comes to regressive taxes.", "\"Not that many states don’t have an income tax, so that puts us in a small group that looks more regressive,\" said University of Central Florida economist Sean Snaith. However, he said, \" ‘regressive’ and ‘burdensome’ are separate issues. The tax burden in Florida is still very low, despite being regressive.\"", "Aaron Twait, research director at the Minnesota Center for Fiscal Excellence, said there are only two taxes that are progressive: the income tax and the estate tax.", "\"States that don’t have the income tax -- they just don’t have that lever to pull,\" he said. \"Sales taxes, property taxes, and excise taxes run from moderately regressive to really regressive.\"", "Our ruling", "Rich said that there is evidence that Florida has \"the third most-regressive tax base,\" though she acknowledged when she spoke she wasn’t certain if she had the number right.", "She was close: A study placed Florida No. 2 in terms of its regressive tax base.", "Florida has a regressive tax base because we lack a state income tax. Though the Tax Foundation criticized the report, it didn’t dispute the states’ rankings, and other experts we interviewed also had no qualms about Florida’s placement.", "Rich’s number of third place was just a smidgen low, so we rate this claim Mostly True.", "Institute on Taxation and Economic Policy, \"Who Pays?\", January 2013", "Citizens for Tax Justice, Website, Accessed July 22, 2014", "Florida Center for Fiscal and Economic Policy, \"Improving fiscal condition allows the Legislature to address previous budget cuts and address tax fairness,\" November 2013", "Tax Foundation, \"Comments on Who Pays? A Distributional analysis of the tax systems in all 50 states,\" Feb. 20, 2013", "Tax Foundation, \"State business tax climate index 2014,\" October 2013", "Government of the District of Columbia, \"Tax rates and tax burdens in the District of Columbia- a nationwide comparison 2012,\" December 2013", "Tampa Bay Times, \"Nan Rich rips Charlie Crist for not debating,\" July 11, 2014", "PolitiFact Wisconsin, \"Kooyenga says Wisconsin’s income tax system stands out nationally as progressive,\" June 2, 2013", "Interview, Nan Rich, former state senator and current Democratic primary candidate for governor, July 11, 2014", "Interview, Richard Borean, Tax Foundation spokesman, July 11, 2014", "Interview, Stu Kantor, Tax Policy Center spokesman, July 11, 2014", "Interview, Aaron Twait, Minnesota Center for Fiscal Excellence research director, July 21, 2014", "Interview, Sean Snaith, director of the University of Central Florida's Institute for Economic Competitiveness, July 21, 2014", "Interview, Matt Gardner, Executive Director, Institute on Taxation and Economic Policy, July 21, 2014", "Interview, Norton Francis, Urban-Brookings Tax Policy Center senior research associate, July 21, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]