["About this rating", "Editor's Note: Betty White died on Dec. 31, 2021.", "In the days before actor Betty White's 99th birthday on Jan. 17, 2021, a Twitter user alleged that she was born before the mass production of sliced bread.", "The assertion was true.", "White, whose acting highlights included \"The Golden Girls\" and \"The Mary Tyler Moore Show,\" was born on Jan. 17, 1922, in Oak Park, Illinois.", "Meanwhile, Otto Frederick Rohwedder, of Iowa, designed and manufactured the first commercial bread-slicing machine around 1928, according to the Smithsonian National Museum of American History. Below is an image of the invention, courtesy of that agency.", "The Smithsonian said of the machine, which Rohwedder's daughter donated to the museum in the early '70s, on its website:", "It was used to slice loaves of fresh bakery bread at Korn's Bakery, in Rohwedder's home town of Davenport, Iowa, beginning in late 1928. This is Rohwedder's second automatic bread-slicer, the first having fallen apart after about six months of heavy use at Bench's Bakery, in Chillicothe, Missouri.", "The public loved the convenience of sliced bread and, by 1929, Rohwedder's Mac-Roh Company was feverishly meeting the demand for bread-slicing machines. By the following year, the Continental Baking Company was selling sliced bread under the Wonder Bread label.", "Wonder was one of the first major brands to mass distribute sliced bread in 1930, according to History. \"By that point, the majority of Americans were eating commercially made bread, compared with decades earlier, when most of the supply still was homemade.\"", "In sum, since White was born in early 1922 and Rohwedder invented the first commercial bread-slicing machine roughly six years later, in 1928, we rate this claim \"true.\"", "Updated [Dec. 31, 2021]: Updated to report Betty White's death.", "Jessica Lee is Snopes' Senior Assignments Editor with expertise in investigative storytelling, media literacy advocacy and digital audience engagement.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]