["“After extensive research, our findings show that consuming alcoholic beverages may help reduce the risk of infection by the novel coronavirus; COVID-19. Vodka is the most recommended for drinking, cleaning, and sanitizing.”", "The message was displayed on what appears to be letterhead paper dated March 7, 2020, complete with the hospital’s logo in the top left corner, an official stamp and a scrawled signature.", "The photo was posted on several Facebook pages in the Philippines, racking up 25,000 shares in less than 24 hours. Although most Facebook users took the recommendation as a joke, Saint Luke’s, in the midwestern state of Missouri, received enquiries regarding the letter, Lindsey Stitch, a hospital spokeswoman, told AFP.", "“The information circulating is definitely a fake letter. Vodka has no impact on the coronavirus,” Stitch told AFP by email.", "The hospital’s Facebook page published an official debunk of the claim on March 11.", "Stitch reiterated advice published on Saint Luke’s website, recommending that people wash hands with soap and water or “alcohol-based hand sanitizer.” The page does not recommend drinking alcoholic beverages.", "She also said people should not leave home if they are feeling unwell.", "The novel coronavirus has spread from China around the world, killing more than 4,500 people and wreaking havoc on the global economy.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]