["The tweet, shared on December 3, 2018, includes a video showing angry people throwing bottles and chairs at a stage, and security personnel in yellow vests trying to calm the situation down in a busy hall. The accompanying text reads: “Ex girlfriend with her gang attend the wedding reception of ex boyfriend in East London, even the Security were overpowered.”", "The video has been viewed over 100,000 times, retweeted 2,392 times and has more than 2,900 likes.", "In the 479 comments on the post, some appear to believe the video does show an ex-girlfriend and her ‘gang’ as the account claims, while others suggest the wedding couldn’t have taken place in South Africa. A few others state that the video is not what the post claims it to be.", "A six minute version of the video can be found on a Facebook post from October 7, 2018 with the following caption: “Ugandans In London (ROYAL REGENCY) Threw Bottles And Chairs After Artists Failed To Show Up on stage. Some pple were seen complaining after paying VIP £60 Approx $120”.", "A venue name can be seen in the video, the Royal Regency, which is located in the Manor Park district of east London in the United Kingdom - pictures on their website match the video.", "The South African city of East London, with approximately 400,000 residents, is 1,000 kilometres (621 miles) from Cape Town on the south east coast.", "Ugandan musician Vinka had been scheduled to perform at the “The Big Weekender”. She posted an apology on her Facebook page after the event.", "Samiul Bari, from The Royal Regency management, said, “yes it was a music event, the performer didn't show so ...(people)...got upset and violent”.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]