["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "U.S. Sen. John McCain, R-Ariz., has been diagnosed with a brain tumor called a primary glioblastoma. (AP photo)", "A fake news story that claimed former President Barack Obama tweeted that he wanted U.S. Sen. John McCain to die from a brain tumor originally came from a parody website looking to troll conservatives.", "The headline on a July 20, 2017, post on DailyThings.world read, \"Barack Obama tweets sick attack on John McCain, says he should have died.\" Facebook users flagged the story here and on NewsFeedHunter.com as being potentially fabricated, in an effort to cut down on fake news.", "The story included an image of a July 19 tweet from Obama that read, \"John McCain is NOT a war hero. If there were any God in heaven, he would have died from that brain tumor.\" The post said Obama quickly deleted the tweet.", "The story came on the heels of the announcement that McCain, R-Ariz., was diagnosed with a brain tumor called a primary glioblastoma. The American Brain Tumor Association said that a 2009 study showed almost 10 percent of patients may potentially live five years or longer. The 80-year-old is considering treatment options.", "McCain returned to the U.S. Senate for votes on Republican health care reform, most recently casting a deciding vote against a last-ditch \"skinny repeal\" bill to end the Affordable Care Act.", "But let’s be clear: This story is completely fake.", "There was no such tweet for Obama to delete. It was no doubt the product of any number of websites that allow you to create a fake tweet that appears to come from another account.", "The only thing Obama tweeted on July 19 were words of encouragement for McCain, whom Obama defeated in the 2008 presidential election.", "\"John McCain is an American hero & one of the bravest fighters I've ever known. Cancer doesn't know what it's up against. Give it hell, John,\" Obama wrote.", "John McCain is an American hero & one of the bravest fighters I've ever known. Cancer doesn't know what it's up against. Give it hell, John.", "There is no record of another tweet from Obama’s account that day.", "The fake story originated the same day on OurLandOfTheFree.com, a parody website with hidden registration information. It appears to be affiliated with a network of websites run by liberal trolls who run fake news sites in an attempt to fool conservatives.", "The footer note on OurLandOfTheFree.com said that the site makes \"no guarantee that what you read here is true. In fact, it most definitely is not.\" It echoes the warning on its About Us page.", "Bloggers wrote, \"Barack Obama tweets sick attack on John McCain, says he should have died.\"", "The story and the tweet it described appeared on multiple outlets, but sprang from a website devoted to writing absurd stories about liberals in an attempt to fool conservatives. Obama’s only tweet about McCain’s brain cancer was encouraging.", "We rate this statement Pants on Fire!", "DailyThings.world, \"Barack Obama Tweets SICK Attack On John McCain, Says He Should Have Died,\" July 20, 2017", "OurLandOfTheFree.com, \"Barack Obama Tweets SICK Attack On John McCain, Says He Should Have Died,\" July 19, 2017", "PolitiFact, \"A fake in 140 characters: How not to get tripped up by hoax Twitter accounts,\" March 14, 2017", "Twitter, Obama tweet, July 19, 2017", "CNN, \"Sen. John McCain has brain cancer, aggressive tumor surgically removed,\" July 20, 2017", "NPR, \"McCain Votes No, Dealing Potential Death Blow To Republican Health Care Efforts,\" July 27, 2017", "American Brain Tumor Association, \"Glioblastoma,\" accessed July 28, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]