["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The United States Postal Service had $14.2 billion in cash on hand as of Aug. 12.", "It is the most cash on hand since 2004; a spokesperson said. The department’s data only goes back that far.", "The Postal Service is still losing money.", "2020 has brought an unlikely federal service into the spotlight. The United States Postal Service has been at center stage due to President Donald Trump’s outspoken mistrust of mail-in ballot voting and his reluctance to approve $25 billion in Postal Service funding.", "After facing losses from the beginning months of COVID-19, its ongoing debt, and an increase in mail-in ballots for the election, some legislators say the Postal Service needs the funds.", "Sen. Josh Hawley (R-Mo.) disagrees. In an Aug. 23 Facebook post, he said the Postal Service has the manpower and the money to function just fine in November. Hawley called the Democrats’ push for more money \"hysteria.\"", "He added, \"USPS currently has the most cash on hand in its history, approx $15 billion.\"", "That’s a lot of cash on hand — and a bold claim —  so we decided to follow the money.", "To understand the claim, we need to know what  \"cash on hand\" means: cash and cash equivalents. It’s like how much cash is in the register at a store. It’s money that can be used immediately.", "Businesses can still have a considerable amount of cash on hand, even when they are in debt. Being in debt means a company still owes money that they’ve borrowed or taken out in loans.", "Now back to Hawley.", "His information comes from a virtual Senate Homeland Security and Governmental Affairs Committee hearing on U.S. Postal Service on Aug. 21. At the hearing, Postmaster General Louis DeJoy said there was \"somewhere between $14-15 billion\" in cash on hand.", "The most recent information is from two separate documents, and we get two answers.", "According to the latest financial statement from the Postal Service in June, the agency had over $13 billion in cash and restricted cash.", "In a more recent fact sheet from the U.S. Department of Treasury, the service had $14.2 billion in cash on hand as of Aug. 12.", "Hawley’s approximation is close. This is the most cash on hand that the Postal Service has had — at least in the past 16 years. According to an email from spokesperson David Coleman, the data available to his team goes back only to 2004. 2020’s cash on hand is the highest: at least $13 billion, compared to around $9 billion in 2019. So it’s hard to verify whether that’s the most in history. The modern Postal Service dates back to 1970 legislation that reorganized it from a Cabinet position to an independent agency.", "According to an Aug. 21 statement from the Postal Service, the agency has been experiencing losses for years.", "\"Since 2007,\" the statement reads, \"the Postal Service has experienced nearly $80 billion in cumulative losses.\"", "It says that the financial year of 2019 had losses near $9 billion, and 2020 will be close to $11 billion.", "The Service says they can manage the influx of mail-in ballots this year.", "Election mail is predicted to \"amount to less than 2% of total mail volume from mid-September to Election Day,\" according to the statement.", "Hawley agrees that the Postal Service can handle this unprecedented election.", "\"The Postmaster testified before Congress that USPS has the money, the manpower, and the resources to deliver the mail safely and on time through the election,\" Hawley said in an email from his team. \"He said he is committed to not implementing any measure that could possibly slow down the mail between now and November.\"", "Still, the Postmaster General says sending in your ballots early is best.", "As of Aug. 12, The Postal Service has about $14.2 billion in cash on hand. Hawley claimed: \"USPS currently has the most cash on hand in its history, approx $15 billion.\"", "The Postal Service finance department could only confirm that this is the most cash on hand since 2004, according to a Postal Service spokesman. All of history is a lot longer than 16 years ago though, so it is hard to confirm this part of the claim completely.", "With the losses the Postal Service has experienced, the cash on hand may not be as helpful as it may sound.", "The statement is accurate but needs clarification or additional information. We rate Hawley’s claim Mostly True.", "Email Exchange, Whitney Smith, spokesperson for Josh Hawley (R-Mo.) Sept. 2 2020", "Email Exchange, David Coleman, spokesperson for the USPS Sept 10, 2020", "Hawley’s Facebook page, Josh Hawley’s Aug. 23 Facebook post, Aug. 30 2020", "USPS website, USPS Aug. 21 Statement, Sept. 2, 2020", "The United States Postal Service: An American History, 2020", "C-SPAN recorded hearing, Senate Homeland Security and Governmental Affairs Committee (HSGAC) Hearing on U.S. Postal Service on Aug. 21, Sept. 2 2020", "USPS 3rd Quarter Financial Results", "Provided by Coleman, USPS Quarter III, 2020 form 10-Q Sept. 10 2020", "Provided by Smith, US Treasury fact sheet from 8/19/20, Sept 2. 2020", "Provided by Smith, HSAGC Memorandum, Aug 20, Sept 2. 2020", "Politifact Illinois, No, USPS isn’t operating with a multibillon dollar surplus, Sept. 6 2020", "Investopedia, Debt Definition, Sept. 14, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]