["About this rating", "On Dec. 17, 2020, Sony PlayStation announced that it would provide refunds to customers who digitally purchased Cyberpunk 2077, a new video game from developer CD Projekt Red. The game was released one week earlier on Dec. 10.", "According to The New York Times, customers wanting refunds for Cyberpunk 2077 had experienced buggy gameplay and crashes that made it difficult to progress through the storyline:", "PlayStation’s move to stop distributing 'Cyberpunk 2077,' a role-playing game set in a dystopian crime-ridden megalopolis that was long hyped as the game of the decade, came a week after the game was released and days after complaints from users about its glitches and poor visuals on some platforms drew attention.", "On Monday, CD Projekt Red, apologized for not showing the game running on base models of last-generation consoles before it was released, removing the opportunity for gamers to make informed decisions about purchasing.", "“We should have paid more attention to making it play better on PlayStation 4 and Xbox One,” the company said. Players have reported fewer gameplay problems on other platforms, including the latest generation of consoles, the PlayStation 5 and Xbox Series X, which were released last month but remain difficult to find.", "Less than 24 hours later, Microsoft Xbox also announced Cyberpunk 2077 refunds:", "CD Projekt Red announced that fixes to the game would be arriving in January and February 2021.", "Cyberpunk 2077 was available for PC, PlayStation 4, Stadia, and Xbox One. It was also playable on the brand new consoles, PlayStation 5 (PS5) and Xbox Series X/S. However, the versions of the game that were playable on the PS5 and new Xbox consoles were available thanks to backward compatibility. This meant that gamers who played Cyberpunk 2077 on PS5 and Xbox Series X/S were playing the PS4 or Xbox One version of the game.", "According to GameSpot, the official version of Cyberpunk 2077 for the new consoles was tentatively set for 2021.", "Cyberpunk 2077 refunds were available on two pages setup by PlayStation and Xbox.", "On the subject of video games, we previously reported about purported hints to Grand Theft Auto (GTA) 6 in a teaser for GTA Online.", "Jordan Liles is a Senior Reporter who has been with Snopes since 2016.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]