["GRAPHIC CONTENT DISCLAIMER: All the images in this post are movie stills and do not show real-life violence.", "The pictures were used in this Facebook post by an account called “Biafra Broadcasting cooperation - BBC” on January 11, 2020. The post contains six images and has been shared 226 times.", "Part of the post reads: “Fulani herdsmen attack in plateau state yesterday leaving many dead”.", "Three of the pictures depict the same man, but from different angles, with a machete apparently embedded in his skull and what appears to be a great deal of blood flowing from a wound.  In the other images, a young boy is shown with objects seeming to protrude from his belly, while two men in the other pictures supposedly have suffered fatal head wounds.", "But the claim of a murderous attack by Nigerian herdsmen is false and none of the pictures shows real instances of violence. Rather, they come from various movies in which Nigerian makeup artist James Akaie has used special effects to create lifelike murder scenes.", "Four of the six images bear the watermarks \"jamesakaieffect\" and “tricksplanet”.", "Several searches on Google with the two phrases led to Akaie's Instagram account where he had posted the same images -- and others -- more than four weeks before the false posts went up.", "Akaie describes himself as a “movie Maker, Special Effect Makeup Artiste and a Prosthetics builder, Special props maker and CEO Tricksplanet”. All the pictures on his Instagram account carry the same two watermarks.", "Akaie told AFP that some of the gory scenes depicted in the pictures were created for a movie called The True Caller, which is yet to be released, and another “produced by BGT Films”, a Nigerian movie production company.", "The True Caller producer Eze Nnamdi Egege, in a telephone interview with AFP, confirmed Akaie’s involvement as a special-effects specialist for the movie.", "Egege said: “It was James who made those things in the pictures,” adding that the violent scenes were “the concept” of the movie.", "A search on YouTube for The True Caller includes a link to this trailer for the unreleased movie. A warning to sensitive viewers; the trailer includes graphic scenes.", "A screenshot below left, taken 83 seconds into the trailer, shows a bearded man with a check shirt, almost identical to a picture Akaie posted on his Instagram account in May 2019, below right, describing a “chopped head effect”.", "Three of the pictures used to spread the false claim can be found on Akaie’s Instagram page here, here and here. Two of the other three posted here and here have Akaie’s two watermarks, while the last picture found here demonstrates how the special effect is created.", "The false claims hark on repeated cases of violence between mainly Muslim Fulani cattlemen and largely Christian farmers in central Nigeria and the southern part of the west African nation. See AFP reports here and here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]