["About this rating", "A photograph purportedly showing a park in Australia completely covered in spider webs is frequently shared online with humorous captions such as \"It's not snow, but rather the spider season in Australia\":", "This image is genuine, one of several photographs taken in July 2016 by a couple of Pokémon Go players who stumbled across a field covered in spider webs while searching for a \"Meowth\" in a park in Yinnar, Victoria.", "Leslie Schmidt explained to BuzzFeed News that \"We were chasing a Meowth but didn't get it. [We] got distracted by the webs ... I guess I just loved the juxtaposition of wonder and horror. It looks so snuggly but it's what they use to trap dinner.\"", "While this scene may appear shocking to some viewers, it isn't an unprecedented occurrence. These pictures depict the remnants of an act of mass migration in which millions of spiders use their webs as a type of parachute to carry them to new areas. These \"mass ballooning\" events can leave fields covered in spider webs, as seen here. Due to their appearance, locals refer to these types of webs as \"angel hair\":", "South Australian resident Keith Basterfield talked with the Goulburn Post after a similar mass ballooning event in May 2015:", "It’s a natural migration phenomenon called Angel Hair, and one South Australian retiree Keith Basterfield is keen to hear more about.", "“What happens is that during a particular time of the year, particularly in May and August, young spiders in the Outback somewhere throw these threads of spiderwebs up in the air and use them as a parachute to detach themselves from the ground and move in large colonies through the sky,” Mr Basterfield explained.", "“They fly through the sky and then we see these falls of spider webs that look almost as if it’s snowing.", "Wagga Wagga, Australia, was also briefly covered in webs in 2012 as spiders attempted to escape rising floodwaters:", "\"The behaviour is called ballooning -- that is how they disperse,\" Graham Milledge, entomology collections manager at the Australian Museum in Sydney said.", "Flood events typically trigger mass ballooning events.", "\"They often do it as a way of dispersing and getting into a new area but, in an event like this, they are just trying to escape the floods,\" Mr Milledge said.", "\"They often land in the same place and that is why you get this large mass of them.\"", "Australia isn't the only location to witness this type of arachnidian event. The center image in the bottom row of the above-displayed collage was taken in Pakistan in 2010 after the area experienced massive flooding. It's unclear if the arachnids in Pakistan \"ballooned\" into the trees, or if these webs were built after the spiders climbed the trees in order to avoid flood waters:", "The unprecedented flooding in Pakistan in the latter half of 2010 disrupted the lives of 20 million people, but it also affected the country's arachnid population.", "With more than a fifth of the country submerged, millions of spiders climbed into trees to escape the rising floodwaters. The water took so long to recede, the trees became covered in a cocoon of spiderwebs. The result is an eerie, alien panorama, with any vegetation covered in a thick mass of webbing.", "The United States has also seen fields covered in spider webs. For example, in November 2015 residents of North Memphis, Tennessee, were shocked to see nearly a half-mile stretch of grass covered in spider webs. Todd Blackledge, a biologist and expert in spider silk at the University of Akron in Ohio, told National Geographic that:", "In the spring and fall, millions of juvenile spiders crawl to the highest points of their habitat -- say a fence pole, or a tall plant -- and send out silk strands that allow them to be lifted on air currents.", "The strands act “a little bit like a hot-air balloon,\" says Blackledge -- hence the name for the behavior, ballooning. This means the spiders “go wherever the wind takes them,” allowing their populations to spread.", "The vast majority of these high-flying arachnids will die during the journey, eaten by predators or killed by harsh weather conditions. But only a small fraction need to survive to set up shop in their new home.", "A video from the New York Times offers some additional information about spider ballooning:", "Duhaime-Ross, Arielle.   \"Tennessee’s Half-Mile-Long Spider Web Shows How Little We Know About Our Surroundings.\"\r\n    The Verge.   28 November 2015.", "Wired.   \"Milions of Spiders in Pakistan Encase Trees in Webs.\"\r\n    3 March 2011.", "Murphy, Brittany.   \"Baby Spiders Take to the Air.\"\r\n    Goulburn Post.   13 May 2015.", "Greshko, Michael.   \"Millions of Baby Spiders Create Giant Silken Blanket.\"\r\n    National Geographic.   24 November 2015.", "Esposito, Brad.   \"A Woman Playing Pokémon Go Stumbled Upon an Insane Amount of Spiderwebs.\"\r\n    BuzzFeed News.   14 July 2016.", "Australian Geographic.   \"Mass Spider Webs Cover Flood-Affected Areas.\"\r\n    7 March 2012.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]