["The 37-second video was shared here in a Facebook post on December 11, 2020. It has been viewed more than 26,000 times.", "The post’s Hindi-language caption translates to English as: “The farmer-supporter Sikhs shouting ‘Allahu Akbar’ and ‘Long live Pakistan’ in London, but no one should call them as Khalistanis, they are only the food-provider.”", "The people in the video can also be heard chanting: “Long live Imran Khan”, “Punjab will become Khalistan” and “Kashmir will become Pakistan”.", "\"Allahu Akbar\" is an Islamic slogan that means \"God is most great\".", "Imran Khan refers to the current Pakistani prime minister and Khalistan is a Sikh political ideology that calls for an independent homeland for Indian Sikhs.", "The misleading post was shared as farmers in India continue to demonstrate against new agricultural laws, as AFP reported here.", "The video was also shared here, here, here and here on Facebook and here, here, here and here on Twitter, alongside an identical claim.", "The claim is false.", "A reverse image search on Yandex of keyframes extracted from the video found the same video shared in multiple Facebook posts dated November 2019, for example here.", "“Sikh Community slogans: Pakistan Zindabad (long live Pakistan), Punjab bany ga Khalistan (Punjab will become Khalistan), Kashmir bany ga Pakistan (Kashmir will become Pakistan). They are so happy with the PM Imran Khan after completion of #KartarpurCorridor initiative,” says the caption alongside the video in this Facebook post on November 7, 2019.", "‘Kartarpur Corridor initiative’ refers to the opening of a special route that allows Indian Sikhs to cross into Pakistan in order to visit one of their holy religious sites on September 7, 2019 as AFP reported here.", "A keyword search found a similar video report by Ruptly which shows the same protest on September 27, 2019.", "“Protesters demonstrating against the Indian Prime Minister Narendra Modi and his government's ongoing lockdown in Indian-administrated Kashmir were met with a counter rally in New York City on Friday [September 27] as the Indian PM arrived to speak at the United Nations General Assembly,” says the video description posted on YouTube on September 28, 2019.", "The protest shown in the misleading posts was filmed here on New York’s 47th Street, close to the junction with 2nd Avenue.", "Below is a screenshot comparison of the video in the misleading posts (top) and 47th Street on Google Street View (bottom) with similar elements highlighted in red by AFP:", "The Coalition Against Fascism in India (CAFI), which organised the protest ahead of Modi's speech to the United Nations General Assembly in New York on September 27, 2019, tweeted details of the demonstration in a press release here.", "The anti-Modi protest was also reported by Indian media, for example here by the National Herald and here by The Wire.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]