["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Republican Ken Cuccinelli claims in a TV ad that Democrat Terry McAuliffe walked away with millions of dollars  from a company that went bankrupt and left thousands without jobs and retirement savings.", "The 30-second spot focuses on McAuliffe’s relationship with Global Crossings, a start-up  fiber-optic company whose stock soared in the late 1990s and crashed in 2002. The commercial starts with footage of a fenced-in, abandoned plant, and shifts to interviews with former employees. Here’s the script:", "Narrator: \"January 2002. New York firm Global Crossing filed for bankruptcy.\"", "Corey Darrow, former worker: \"I lost all my severance. Lost all the money in my 401k.\"", "Deb Goehring, former worker: \"Got locked out. And that was it. My career was over.\"", "Narrator: \"Yet political insider and investor Terry McAuliffe cashed in, walking away with millions.\"", "Gary Baron, former worker: \"Probably had some insider knowledge. There’s a lot of lies to make money for themselves.\"", "Darrow: \"You know, it’s like they took my money and ran.\"", "Narrator: \"That’s the real Terry McAuliffe.\"", "We took a look at whether McAuliffe really did enrich himself on the company’s demise. The ad has been controversial since its release on Sept. 6. Two of the former employees in the ad told Mother Jones magazine  they thought they were being interviewed for a documentary and did not know their words would be used in a political commercial.", "Cuccinelli’s campaign says the former employees knew how their comments would be used and sent us a long list of articles detailing Global Crossing’s rise and fall and McAuliffe’s ties to the firm.", "The relationship began in 1997, a year after McAuliffe helped President Bill Clinton get reelected by serving as his chief fundraiser. McAuliffe was retained as a dealmaker by Gary Winnick, a Los Angeles billionaire investor who was starting Global Crossing Holdings, a telecommunications company that would own and operate undersea fiber-optic cables. McAuliffe invested $100,000 of his own money in Global Crossing stock before it was publicly offered.", "McAuliffe, in a 1999 story in The New York Times, said Winnick \"wanted a stable of people around him with great contacts\" to \"help him work on details.\" McAuliffe said in the article that \"Winnick was looking for a little political action.\"", "McAuliffe’s retainer with Winnick ended in 1998. But he was allowed to hold on the stock, which rocketed in the dot.com boom.", "Cuccinelli’s ad contains a picture of McAuliffe smiling and the printed words, \"Made a profit of $18 million.\"  That comes from the 1999 Times article in which McAuliffe said the value of his $100,000 investment in Global Crossing had risen to about $18 million. But that’s not the amount McAuliffe pocketed.", "McAuliffe said during his unsuccessful 2009 gubernatorial campaign that he ended up making $8 million, a figure that was confirmed that year by Associated Press, which was given access to McAuliffe’s trading records.", "\"His return was $8.1 million, mostly on the sale of 176,017 shares in 1999, the year Global Crossing stock peaked beyond $60 a share,\" the AP reported.", "\"He could have made much more -- closer to the $18 million in some published reports -- had he sold all of his shares in 1999,\" the AP wrote. \"Stock transaction records he provided to the AP show his last shares were sold in January 2002, after the company’s stock had plunged to 14 cents a share. And, as McAuliffe notes, he was never a board member or officer of the company.\"", "The first sign of Global’s demise, according to The Times, came in April 2001 when officers were told revenues were going to fall $1 billion short of earning estimates. That was about two years after McAuliffe made his stock killing.", "Cuccinelli’s ad, without directly saying so, links McAuliffe’s profit to the downfall of Global Crossing, which caused about 12,000 workers to lose their jobs and retirement funds. The company froze their pensions and invested their 401 (k) retirement savings in Global Crossing stock, which became worthless.", "But none of the three former employees in the ad mentions McAuliffe by name. Two of the workers placed the blame on an unidentified \"they\" and \"them.\" And the third employee, Deb Goehring, has told Mother Jones magazine and The Virginian-Pilot that she bears no animus towards McAuliffe.", "\"I said I don't really know anything about Terry McAuliffe,\" she told Mother Jones. \"He was not involved in day-to-day operations in any way that I saw. As far as I'm concerned, he was like me, a stockholder, and he was able to make money at it. More power to the man. Good for him.\"", "McAuliffe’s campaign, in responding to the ad, has stressed that McAuliffe \"had no role in running the company\" and that his Global Crossing holdings were a tiny fraction of the $20 billion value of the company’s in stock estimated by Forbes Magazine in April 1999.", "Chris LaCivita, Cuccinelli’s chief strategist, says the ad shows \"Winnick provided an insider deal that proved very lucrative for McAuliffe, despite thousands losing their jobs. McAuliffe has spent his entire career connecting wealthy donors to elected officials and leveraging those contacts to make a fortune for himself, while workers get left out in the cold.\"", "Our ruling", "McAuliffe made a fantastic profit through an insider deal that allowed him to buy Global Crossing stock before it was offered to the public. Cuccinelli’s ad, without directly saying so, clearly links McAuliffe’s gain to the downfall of the company and the woes of its employees.", "There’s no evidence McAuliffe had a management role in Global Crossing. He was an investor who bought low and sold about half of his holdings at peak value. He held on to the rest of his shares until they were virtually worthless. All of the shares were publicly traded, so it’s far-fetched to suggest McAuliffe raided the company’s coffers.", "We rate the claim False.", "YouTube, \"Ken Cuccinelli Global Crossing ad,\" Sept. 6, 2013.", "Emails from Anna Nix, Sept. 10 and 11, 2013.", "Emails from and interview with Gary Maloney, Sept. 10 and 16, 2013.", "The Wall Street Journal, \"Clinton Fund-Raiser McAuliffe Cashed In On Labor Ties,\" Oct. 1, 1999.", "The New York Times, \"Friendship counts; Clinton’s Top Fund-Raiser Made Lots for Himself, Too,\" Dec. 12, 1999.", "Associated Press, \"Questions about investment windfalls dog McAuliffe in Va. governor’s race,\" May 27, 2009.", "Washington Post, \"Democrats Bet on Money Man as New Leader,\" Feb. 2, 2001.", "The Post-Standard, \"Florida Company owed $47,000 by Telergy; Telergy was able to pay its 465 workers Friday; Troubled DeWitt company ordered equipment two days before huge layoff,\" Aug. 18, 2001.", "CNNMoney, \"Global files for bankruptcy,\" Jan. 28, 2002.", "The New York Times, \"How Executives Prospered as Global Crossing Collapsed,\" Feb. 11, 2002.", "Roll Call, \"GOP Hearings Target Ullico, McAuliffe,\" June 16, 2003.", "Los Angeles Times, \"Founder Escapes Charges in Global Crossing Failure,\" Dec. 14, 2004.", "CRN.com, \"Global Crossing Chairman Gary Winnick To Resign From Board,\" Dec. 31, 2002.", "Government Printing Office, Hearing before the Government Affairs Committee of the U.S. Senate, \"Self-Dealing and Breach of Duty: A Review of the Ullico Matter,\" June 19, 2003.", "The Washington Times, \"The ULLICO scandal,\" June 21, 2003.", "The Washington Post, \"Va. Candidate McAuliffe Has History of Mixing Business, Politics,\" May 3, 2009.", "Richmond Times-Dispatch, \"Democrats pull no punches in Danville debate,\" April 29, 2009.", "Richmond Times-Dispatch, \"McAuliffe saw opening in Va. - Political veteran says he brings excitement, ideas to his first race,\" May 24, 2009.", "The Washington Post, \"Cuccinelli ad criticizing McAuliffe for Global Crossing profits sparks controversy,\" Sept. 6, 2013.", "The Washington Post , \"Cuccinelli’s attack on McAuliffe’s Global Crossing investment,\" Sept. 9, 2013.", "The New York Times, \"Global Crossing Woes Delay Military Contract,\" Feb. 14, 2002.", "FactCheck.org, \"More (Mostly Accurate) Virginia Attacks,\" Sept. 11, 2013.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]