["By Saranac Hale Spencer", "Posted on April 18, 2018", "Q: Can U.S. residents collect “M.A.G.A. Checks”?", "A: No. A “M.A.G.A. Check” is the invention of a publisher selling an investment guide that makes promises of easy money.", "There is no evidence of any public or private program offering a “M.A.G.A. Check.”", "But a story posted on a website called magachecks.com has been circulating on Facebook claiming that President Donald Trump has passed a law resulting in “massive payouts” named for his campaign slogan — Make America Great Again. Users of the social media site flagged it as potentially false.", "The story is actually a sales pitch for a monthly investment newsletter called “True Wealth.”", "The sales pitch makes lofty promises of easy money. It consists of vague references to unnamed government programs and testimonials from people with single syllable first names and a last initial — like “Jim G.,” who, it claims, is “on pace to collect $5,295 in ‘M.A.G.A. checks’ before the year is over” and “Bob A.,” who is supposedly expecting to collect $2,400.", "For example, it claims – without any supporting evidence – that Trump brought back a 1960s-era law that allowed real estate companies to pay “practically ZERO Federal income taxes.” The publisher promises “big cash payments” to subscribers who invest in these “cash-rich companies.”", "“In this special report, I’ll tell you what I believe are the 4 most stable, reliable and cash-rich companies in the M.A.G.A. program today – ones that regularly dole out big cash payments to their shareholders,” the sales pitch says.", "The publisher also refers to coverage of the program on major financial sites, but those articles don’t actually exist. For example, the sales pitch claims that Forbes “called the income from ‘M.A.G.A. Checks’, ‘very reliable and repeatable.'” But a search of Forbes‘ website shows that the publication has made no mention of “M.A.G.A. Checks” anywhere, let alone calling them “reliable.” Similarly, the sales pitch claims that Nasdaq.com said, “‘M.A.G.A Checks’ will soar in 2018.” Again, a search of the site shows no mention of “M.A.G.A. Checks.”", "According to domain registry records, the site that posted the sales pitch is owned by Stansberry & Associates Investment Research.", "Stansberry & Associates used to be called Pirate Investor, but changed its name in 2005 after the Securities and Exchange Commission filed a suit in federal court alleging that the company had run a scheme to defraud its subscribers. In August 2007, the court found that Pirate Investor and its editor, Frank Porter Stansberry, had defrauded subscribers by selling a false stock tip and ordered them to pay back $1.3 million, plus $240,000 in penalties.", "U.S. District Judge Marvin Garbis wrote in that decision: “Stansberry’s conduct undoubtedly involved deliberate fraud, making statements that he knew to be false; Pirate acted in reckless disregard of regulations when it published Stansberry’s unbelievable claims without a shred of confirmation.”", "Garbis’ judgment was upheld by an appeals court in September 2009, and Pirate Investor and Stansberry paid back the money by November 2010.", "Stansberry is still an editor at the company, according to its website.", "The Social Security Administration also has had at least two run-ins with Stansberry & Associates, according to reports to Congress from the Office of the Inspector General. First, in 2006, the OIG had received complaints that the company was claiming that there was a program called “Upper Social Security” that would allow a person to collect “10-times more than ‘ordinary’ Social Security.” The company agreed to stop using the phrase. Then, in 2011, Stansberry & Associates paid $55,000 to settle a claim for misleading advertising in a publication called “Get Social Security No Matter What Your Age” — the company admitted no wrongdoing in that settlement.", "Stansberry & Associates also has generated more than 100 complaints to the Better Business Bureau, with many consumers saying that they had purchased a single book and were later charged $149 for a subscription that they hadn’t authorized — 85 percent of the reviews for the company are negative.", "Spokesmen for both the Federal Trade Commission and the Consumer Financial Protection Bureau said that they hadn’t heard of any program issuing “M.A.G.A. checks” and cautioned consumers about investing in anything that sounds too good to be true.", "Similarly, Kimberly Burham, managing director of legislation and special projects at the Wharton School at the University of Pennsylvania, had heard of no such program.", "Although the story makes unrestrained claims, such as, “This is a no brainer if you want monthly checks rolling in like clockwork,” the writer was unwilling to explain to us the basis of those claims. Steve Sjuggerud, the author of the story, did not respond to multiple calls for comment.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to help identify and label false stories flagged by readers on the social media network.", "Sjuggerud, Steve. “Can ‘M.A.G.A. Checks’ Really Make America Great Again!?” Magachecks.com. Apr 2018.", "State of Maryland Department of Assessment and Taxation. Articles of Amendment for a Limited Liability Company — Pirate Investor. 24 Oct 2005.", "United States Securities And Exchange Commission v. Agora, Inc., Pirate Investor, LLC. Complaint. U.S. District Court for the District of Maryland. 10 Apr 2003.", "United States Securities And Exchange Commission v. Agora, Inc., et al. Memorandum of Decision. U.S. District Court for the District of Maryland. 3 Aug 2007.", "Social Security Administration. “Semiannual Report to Congress.” Office of the Inspector General. 1 Oct 2005 – 31 Mar 2006.", "Social Security Administration. “Semiannual Report to Congress.” Office of the Inspector General. 1 Apr 2011 – 30 Sep 2011.", "Better Business Bureau. Reviews & Complaints. Stansberry & Associates Investment Research, LLC. Accessed 16 Apr 2018.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]