["About this rating", "As the 2017 NFL season got underway, an open letter written the year before by retired Marine Col. Jeffery Powers to NFL commissioner Roger Goodell about players kneeling during the United States national anthem reappeared on social media:", "Commisioner,", "I've been a season pass holder at Yankee Stadium, Yale Bowl and Giants Stadium.", "I missed the '90-'91 season because I was with a battalion of Marines in Desert Storm. 14 of my wonderful Marines returned home with the American Flag draped across their lifeless bodies. My last conversation with one of them, Sgt Garrett Mongrella, was about how our Giants were going to the Super Bowl. He never got to see it.", "Many friends, Marines, and Special Forces Soldiers who worked with or for me through the years returned home with the American Flag draped over their coffins.", "Now I watch multi millionaire athletes who never did anything in their lives but play a game, disrespect what brave Americans fought and died for. They are essentially spitting in the faces and on the graves of real men, men who have actually done something for this country beside playing with a ball and believing they're something special! They're not! My Marines and Soldiers were!", "You are complicit in this!", "You'll fine players for large and small infractions but you lack the morale courage and respect for our nation and the fallen to put an immediate stop to this.", "Yes, I know, it's their 1st Amendment right to behave in such a despicable manner. What would happen if they came out and disrespected you or the refs publicly?", "I observed a player getting a personal foul for twerking in the end zone after scoring. I guess that's much worse than disrespecting the flag and our National Anthem. Hmmmmm, isn't it his 1st Amendment right to express himself like an idiot in the end zone? Why is taunting not allowed yet taunting America is ok? You fine players for wearing 9-11 commemorative shoes yet you allow scum on the sidelines to sit, kneel or pump their pathetic fist in the air. They are so deprived with their multimillion dollar contracts for playing a freaking game! You condone it all by your refusal to act. You're just as bad and disgusting as they are. I hope Americans boycott any sponsor who supports that rabble you call the NFL. I hope they turn off the TV when any team that allowed this disrespect to occur, without consequence, on the sidelines. I applause those who have not.", "Legends and heroes do NOT wear shoulder pads. They wear body armor and carry rifles.", "They make minimum wage and spend months and years away from their families. They don't do it for an hour on Sunday. They do 24/7 often with lead,not footballs, coming in their direction. They watch their brothers carted off in pieces not on a gurney to get their knee iced. They don't even have ice! Many do t have legs or arms. Some wear blue and risk their lives daily on the streets of America. They wear fire helmets and go upstairs into the fire rather than down to safety. On 9-11, hundreds vanished. They are the heroes.", "I hope that your high paid protesting pretty boys and you look in that mirror when you shave tomorrow and see what you really are, legends in your own minds. You need to hit the road and take those worms with you!", "Time to change the channel.", "Col Jeffrey A Powers USMC(ret)", "Days earlier, it had been reported that 17 players had joined Colin Kaepernick in protesting the police shootings of black men by kneeling during the national anthem before games. Powers' letter first gained attention on 17 September 2016, when conservative commentator Allen B. West posted it to his web site:", "Folks, I do not need to add a single word to this… other than it came to me through a retired military email network. You need to read it.", "We reached out to Col. Powers, who confirmed to us that the letter is, indeed, genuine. Powers told us that he could not remember exactly where he originally posted the screed (he said that it was probably Facebook) and we have so far been unable to uncover the original posting. The earliest version we could find was posted to Facebook on 13 September 2016.", "According to a Bloomberg executive profile for the company Homeland Security Technology Inc., where Powers worked after retiring from the service, he is a decorated veteran of the Gulf War:", "He is veteran of Operation Desert Shield/Storm where he commanded a 1,200-man Task Force into Saudi Arabia as part of the lead Marine Corps contingent in Desert Shield. He was decorated for valor while serving as Operations Officer for the lead Task Force into Kuwait. He retired from the U.S. Marine Corps achieving the rank of Colonel.", "Powers' service would have prevented him from enjoying New York Giants games during the 1990-1991 season:", "Ma) Jeffery A. Powers (left), operations officer of 1st Light Armored Infantry Battalion (Task Force Shepherd) and Capt Roger L. Pollard (right), commander of Company D, 3d Light Armored Infantry Battalion (Task Force Shepherd) examine the aftermath of the battle at Observation Post 4 on the morning of 30 January 1991.", "The fallen soldier mentioned in the text is Sgt. Garrett Mongrella, who — just as Powers wrote — died during the war.", "Although this letter was written in September 2016, Powers' attitude toward the NFL has not changed. The decorated veteran told us that he has no plans to watch any games during the 2017 football season.", "Westermeyer, Paul W.   \"U.S. Marines in Battle: Al-Khafji.\"\r\n    Marine Corps History Division, 2008.", "Morris, David J.   Storm on the Horizon: Khafji — The Battle That Changed the Course of the Gulf War.\r\n    Free Press, 2004.   ISBN 0743235576.", "Enloe, Chris.   \"Retired Marine Colonel Pens Scathing Letter to NFL Commissioner: ‘Legends and Heroes Do Not Wear Shoulder Pads.’\"\r\n    The Blaze.   18 September 2016.", "Wilder, Charlotte.   \"9 Powerful Photos of the 18 NFL Players Who Protested During the National Anthem.\"\r\n    USA Today.   14 September 2016.", "Gonzalez, David.   \"So Few Died, But How It Hurt Those Back Home: 11 Stories.\"\r\n    The New York Times.   15 March 1991.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]