["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Donald Trump said his landslide win in New York destroyed Ted Cruz’s chances of getting the GOP nomination through the primary process.", "With 60.5 percent of the votes in the Empire State, the Republican frontrunner is projected to nab 89 delegates, while Cruz picked up none. (Ohio Gov. John Kasich got three.) This means that it is impossible for Cruz to secure the 1,237 delegates needed for the nomination on the first ballot, according to Trump.", "\"Ted Cruz is mathematically out of winning the race,\" he tweeted April 20. \"Now all he can do is be a spoiler, never a nice thing to do. I will beat Hillary!\"", "Does Trump’s math stack up?", "The answer is more complicated than you’d expect. It boils down to how you interpret some state rules and whether or not you count unbound delegates.", "We explained the delegate process in-depth here, but here’s a brief overview. To win the Republican nomination, a candidate has to clinch the support of a majority of 2,472 delegates. Most, but not all, are obligated to vote for the candidate who won their congressional district’s or state’s nominating contest.", "But if no one gets to the 1,237 threshold on a first vote, many delegates are \"released\" to vote for whomever they want on second and third ballots. So Cruz (or Kasich or really anyone) does have a path forward in this sense. But Trump’s statement is about that first ballot.", "So far, 41 states and territories with a total of 1,798 delegates have already held primary or state conventions. Fifteen contests with 674 delegates are still up for grabs.", "We looked at estimates for how many delegates Cruz has won from major outlets like the Associated Press, the New York Times and 538.com (Fox News uses the AP’s counter) and two popular blogs that track delegate math.", "The figures reported range from 542 \"hard\" delegates (meaning they’re bound to Cruz on the first ballot) to 559 \"soft\" delegates (including those who aren’t bound but have said they’d vote for him).", "This means that Cruz would need at the very least 678 more to get the nomination, so 100 percent of the remaining delegates plus four more. And if we don’t count the unbound delegates from Pennsylvania (54) and West Virginia (three), he’d need 110 percent of the remaining bound delegates.", "Seems mathematically impossible, right?", "But here’s the catch: Cruz could fish for more supporters among the 1,798 delegates from states that have already held primaries. At least 45 of them will arrive at the Republican National Convention not committed to any candidate (three from Colorado, five from the Virgin Islands, 8 from Guam, one from American Samoa and 28 from North Dakota).", "\"I suppose if every unpledged delegate broke for him, maybe,\" said Seth Masket, a political science professor at the University of Denver.", "Of course, winning 100 percent of the remaining delegates and retroactively recruiting more is a tall feat. Masket pointed out that it’s pretty unrealistic. And a handful of states that award delegates proportionally — for example, New Mexico, Oregon and Washington — make it near impossible, according to Josh Putnam, a government professor at the University of Georgia and founder of Frontloading HQ.", "\"The key is that mathematically (Cruz) can't get there through the allocation process. He would have to lean on some large share of the small sliver of first-ballot unbound delegates,\" Putnam said.", "For the record, not even Cruz himself thinks he'll get to 1,237.", "\"We are headed to a contested convention. At this point, nobody is getting 1,237,\" Cruz told Philadelphia radio host Chris Stigall on April 20. \"Donald is going to talk all the time about other folks not getting to 1,237. He's not getting there, either.\"", "Our ruling", "Trump said, \"Ted Cruz is mathematically out of winning the race.\"", "Cruz would need at the very least 678 more delegates to win the race. It’s impossible for him to reach that number in the remaining primaries, given that there are just 674 delegates left to win.", "However, he could conceivably find more supporters in the states who’ve already held primaries, given that a few dozen are thus far uncommitted.", "Trump’s statement is largely accurate but needs additional information. We rate it Mostly True.", "https://www.sharethefacts.co/share/614c5bc7-e903-4c05-9fc7-352f789fed99", "Twitter, Donald Trump, April 20, 2016", "Associated Press, \"Delegate tracker,\" April 20, 2016", "New York Times, \"2016 Delegate Count and Primary Results,\" April 20, 2016", "Fivethirtyeight, \"Who’s On Track For The Nomination?\" April 20, 2016", "CNN, \"CNN Delegate Estimate,\" April 20, 2016", "Frontloading HQ, \"2016 Republican Delegate Count,\" April 20, 2016", "The Green Papers, \"Republican Convention Presidential Nominating Process,\" April 20, 2016", "PolitiFact, \"5 questions you have about delegates, answered,\" March 29, 2016", "Email interview with Joshua Putnam, government professor at the University of Georgia and founder of Frontloading HQ, April 20, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]