["About this rating", "In May 2019, the city of Statesville, NC, applied for an injunction that would force Camping World and associated companies to comply with city ordinances by either removing a large American flag from one of their locations or replacing it with one that was in compliance with size regulations.", "A Camping World Facebook post omitted crucial contextual information such as: the injunction would allow the company to replace the existing flag with a smaller one measuring up to 1,000 square feet; the city had already given the company a permit for an American flag of that size; the city had already voted to change its ordinance to allow flags 10 times larger than before.", "In May 2019, several reports and posts on social media claimed that the city of Statesville, NC, had taken legal action against a camping and outdoors retailer aimed at preventing them from flying the U.S. flag outside their local store.", "On 18 May, Camping World posted the following message on Facebook:", "The City of Statesville, North Carolina has filed a lawsuit seeking an injunction to require Gander RV in Statesville, NC to take down their American Flag. They are imposing a $50/day fine retroactive to 10/15/18. Many cities like Statesville have requested that Camping World and Gander Outdoors take down their American Flags. WE WON'T DO IT! Stand with us.", "This is about more than just the flag. This is about our Veterans, Military, and the men and women that have sacrificed for this great country. They are the reason we fly the flag and they are the reason we will NOT take it down!", "The post linked to a Change.org petition inviting readers to sign up and express their support for the company's stance on the flag. As of 21 May, that petition had attracted more than 100,000 signatures.", "The petition was boosted on Twitter by Marcus Lemonis, the controversial CEO of Camping World, who wrote: \"I will not budge ... I will not compromise ... I will not take the flag down\":", "I will not budge... I will not compromise... I’m grateful for who I am and what I have and it’s clear to me the reasons why... #usa I will not take the flag down ⁦@cityofsvl⁩ or any other city pic.twitter.com/i8bTBBxxr4", "— Marcus Lemonis (@marcuslemonis) May 18, 2019", "In May 2019, the city of Statesville did indeed apply for a court injunction that, if ordered, would force Camping World and associated companies to remove or replace an American flag from their location at Moreland Drive in Statesville and would impose fines of $50 per day -- stretching back to October 2018 -- until Camping World rectified the situation.", "However, the descriptions of the controversy published by Camping World on Facebook and Change.org were woefully incomplete and therefore likely to be extremely misleading, because they failed to mention the following highly relevant details from what is now a four-year battle between city officials and the Illinois-based company:", "Beginning in 2014, Section 6.07 of the city of Statesville's Unified Development Code (UDC) had stated that governmental flags (such as the Stars and Stripes) flown outside local businesses could be no larger then 8 feet high and 12 feet wide (96 square feet) and flown on a flagpole no taller than 40 feet.", "In June 2015, Camping World applied for a variance (akin to an exemption) to Section 6.07, to allow the company to fly an American flag measuring 40 feet high and 80 feet wide (3,200 square feet) on a 130-foot flagpole. In August 2015, the Statesville Board of Adjustment denied the application for a variance.", "Three years later, in June 2018, Statesville City Council voted to change Section 6.07 of the UDC to allow American flags 25 feet high and 40 feet wide (1,000 square feet) with a flagpole no taller than 130 feet. Shortly thereafter, Camping World applied for, and was granted, a permit to erect just such an American flag at the Moreland Drive location of Gander Outdoors.", "However, in August 2018 the company instead erected a 40-by-80-foot flag at the location. According the city's civil complaint against Camping World, municipal officials twice warned the company that the flag was in violation of the already-expanded restrictions contained in Section 6.07.", "At the 1 October 2018 Statesville City Council meeting, members voted 5-3 against a proposal to once again expand the restrictions to allow a 40-by-80-foot American flag such as the one flying at Gander Outdoors.", "Two weeks later, according to the civil complaint, the city issued a citation to Camping World, advising that the company had violated Section 6.07 and had been warned of such, and that the city was entitled to take further legal action against the company and to collect a fine of $50 per day, starting from 15 October 2018 until such time as Camping World became compliant with Section 6.07 — a fine that is itself set out in Section 1.07 of the city's UDC.", "Between October 2018 and May 2019, Camping World failed to remove the flag or replace it with one that complied with Section 6.07, and on 7 May, the city filed a civil complaint in Iredell County District Court, seeking an injunction that would force the company to comply with the city ordinance on pain of a further charge of contempt of court, as well as seeking collection of the $50/day fine in addition to legal costs.", "None of that four-year backstory was included in Camping World's widely shared Facebook post or Change.org petition, which stated only that the city of Statesville was bringing a lawsuit to force the company to take down its American flag.", "The company made no mention of the fact that the city had already changed the relevant ordinance to allow flags 10 times larger than before, nor that the city had granted Camping World a permit for a flag that would have measured 25 by 40 feet (1,000 square feet), nor that the court injunction, if ordered, would allow the company to replace the existing flag with a smaller one. As such, Camping World's Facebook post and Change.org petition were woefully and misleadingly lacking in highly-relevant context.", "Speaking by phone, Camping World CEO Marcus Lemonis told Snopes.com, \"I do accept the fact that our current flag size is in violation of the city's ordinance,\" which he claimed was \"unusual in comparison to most cities in America, including most cities in North Carolina.\"", "However, he vowed that: \"We will not be taking the flag down under any circumstances. Zero. None. Never going to happen.\" He later added: \"You can make the fine $500 a day, $1,000 a day, $5,000 a day -- I'll just pay it. It's that important to me.\"", "Lemonis emphasized that he and his company respected and would comply with any restrictions on flags and flagpole heights that were aimed at preventing danger to motorists, passersby, or to air traffic, but that no such public safety rationale had been given in the case of Statesville. He also stipulated that he believed the restrictions in place should be loosened specifically for the American flag, and that he thought similar size restrictions were reasonable for other kinds of flag:", "\"We will not budge on the size of the American flag, singularly, when we know that there is no danger presented to people or to air traffic.\"", "Camping World.   \"Petition -- Let Camping World and Gander RV Fly the American Flag!\"\r\n    Petition.org.   18 May 2019.", "Mac Guill, Dan.   \"Did the CEO of Camping World Tell Trump Supporters Not to Shop at His Stores?\"\r\n    Snopes.com.   23 August 2017.", "City of Statesville (North Carolina).   \"Unified Development Code, Section 6.07 -- Sign Regulations (15 November 2017 Version).\"\r\n    Accessed 21 May 2019.", "Statesville Board of Adjustment.   \"Meeting Minutes, 4 August 2015.\"\r\n    4 August 2015.", "City of Statesville (North Carolina).   \"Zoning Approval for Building Permit 236224.\"\r\n    5 June 2018.", "The Statesville Record & Landmark.  \"PHOTOS: Camping World Raises Giant American Flag.\"\r\n  17 August 2018.", "Iredell County District Court.   \"City of Statesville vs. Holiday Kamper Co. et al. -- Complaint.\"\r\n    7 May 2019.", "City of Statesville (North Carolina).  \"Unified Development Code, Section 1.07 -- Compliance (15 November 2017 Version).\"\r\n    Accessed 21 May 2019.", "City of Statesville Council.   \"Meeting Minutes, 1 October 2018.\"\r\n    1 October 2018.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]