["The claim was posted on Facebook on February 4, 2021. It has been shared more than 400 times.", "“It’s good that Facebook administrators shut down the FB account of Pulse Asia,” the Tagalog-language post reads. “Facebook knows that their surveys are all lies.”", "“Imagine, Duterte got 91% approval trust (sic) rating despite only fooling citizens with his remarks.”", "In October 2020, Philippine polling company Pulse Asia published a survey that found a 91 percent approval rating for Philippine President Rodrigo Duterte.", "The poll, carried out the previous month, asked 1,200 people to evaluate the performance of various government figures in the past three months.", "The survey prompted a backlash from some social media users, who accused the polling company of pro-Duterte bias.", "Coronavirus restrictions have crippled the Philippine economy and thrown many out of work in a country where hunger and poverty were already major problems before the pandemic struck.", "In an interview with ABS-CBN News, Pulse Asia chief Ronald Holmes said Duterte’s 91 percent approval rating could be partly attributed to the people’s satisfaction with the government’s assistance programme for those affected by Covid-19.", "A similar claim was also shared here and here on Facebook; and here on Twitter.", "The claim, however, is false.", "As of February 18, 2021, the Pulse Asia account remains active and can be accessed here.", "While Pulse Asia’s website was inaccessible for some time in February, Holmes said this was not related to the Duterte survey.", "“Our website is undergoing redesign,” he told AFP in a Facebook message on February 16, 2021.", "In response to the misleading posts, a Facebook spokesperson told AFP it had not taken down Pulse Media’s account.", "“We have not taken any action on the Pulse Asia Research Page and it continues to be available on Facebook,” a representative for the platform told AFP in a WhatApp message on February 16, 2021.", "Keyword searches on Google also did not yield any credible reports that supported the claim in the misleading posts.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]