["\"The last rhinoceros in the world dies. They are officially extinct,\" a sensationalist headline on VideoChaska announced in late July. The website is an online media outlet that often posts clickbait-style articles and false \"life hack\" claims. The story incorrectly reveals that it is not all rhinos but, in fact, all black rhinos that have succumbed to human interference.", "According to the false article, the human interference came in the form of a transfer of rhinos from one national park in Kenya to an ecological reserve. Further down in the article, readers are told that two rhinos were transferred, and that while the male died, the female is still alive, though injured after an attack by a pride of lions.", "The article has taken elements of several true stories about rhinos, but comes to false conclusions.", "First, the western black rhinoceros, a subspecies of the Africa-native black rhinoceros, were officially declared extinct by the International Union for the Conservation of Nature (IUCN) in 2011, five years after its last known sighting in 2006.", "Second, a rhinoceros transfer did occur in July 2018 when the Kenyan Wildlife Service moved 11, not two, eastern black rhinos from Nairobi and Lake Nakuru national parks to the Tsavo East National Park, according to the Kenyan Ministry of Tourism and Wildlife.", "All eleven rhinos eventually died and on July 31, 2018, the Kenya Tourism Federation expressed \"deep concerns and sadness in regards to the unprecedented tragic death of 11 rhinos in the recent translocation exercise.\"", "After the first 8 rhinos died, the Kenyan ministry announced that the deaths had been caused by \"salt poisoning as a result of taking water of high salinity on arrival in the new environment.\"", "The eleventh rhino was attacked by a pride of lions and later died as well.", "Lastly, the VideoChaska story said the population of black rhinos was down to two. It is actually the northern white rhino which has only two females remaining. The last male northern white rhino, Sudan, died in the Ol Pejeta Conservancy in Kenya in March 2018.", "Although black rhinos are still rated \"Critically Endangered\" by both the World Wildlife Fund (WWF) and the IUCN, their population has been steadily rising for several decades. From a historic low of 2,500 in the 1990s, black rhinos have bounced back to between 5,000 and 5,500 individuals today, according to the WWF.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]