["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A reader sent us this social media meme, so we checked to see whether it was accurate.", "Everything was better in the old days, apparently -- including the chore of paying for college, at least according to a social media meme sent to us recently by a reader.", "The meme -- created by OurTime.org, an advocacy group for young Americans -- said, \"In 1978, a student who worked a minimum-wage summer job could afford to pay a year's full tuition at the 4-year public university of their choice.\"", "Really? We figured this was worth a look.", "First, the minimum wage. Starting on Jan. 1, 1978, the minimum wage was $2.65. Someone working at the minimum wage for 13 weeks, and 40 hours per week, in the summer of 1978 would have ended up with $1,378 for their labors.", "For the tuition they would have faced in the 1978-79 school year, we turned to figures from the National Center for Education Statistics, the federal government’s repository of education data.", "The cost of tuition and fees (in that year’s dollars, not adjusted for inflation) was $688 for in-state residents attending a four-year, public university.", "So the meme’s claim is correct except for a few caveats -- two minor and one more significant:", "• The cost of tuition and fees plus room and board was significantly higher that year -- $2,145 -- but the meme was careful to cite \"tuition\" only, so we’ll ignore the impact of room and board.", "• The tuition-and-fees figure we used is a national average, so some states may have had in-state tuition rates out of reach of minimum wage workers.", "• The meme’s only notable failing has to do with overly broad wording -- specifically its use of the phrase \"of their choice.\" The data we used refers to in-state tuition, meaning that the student would have access to this sweet tuition rate only at their home-state university. That’s not the same thing as \"of their choice.\"", "Our ruling", "The meme said that \"in 1978, a student who worked a minimum-wage summer job could afford to pay a year's full tuition at the 4-year public university of their choice.\"", "If you use the national average the figure is correct. The only problem is the part about a university \"of their choice.\" The data is correct for in-state tuition -- not for any university in the country, where out-of-state rates may well have kicked up the tuition amount beyond a summer’s minimum-wage haul.", "On balance, we rate the claim Mostly True.", "CORRECTION: After we published this article, a reader noticed that we had used the incorrect tuition figure from the National Center for Education Statistics chart. This version uses the correct figure. The rating remains at Mostly True.", "OurTime.org, social media meme, July 31, 2014", "National Center for Education Statistics, \"Average undergraduate tuition and fees and room and board rates charged for full-time students in degree-granting institutions, by level and control of institution: 1969-70 through 2011-12,\" accessed Aug. 7, 2014", "U.S. Department of Labor, \"History of Federal Minimum Wage Rates Under the Fair Labor Standards Act, 1938 - 2009,\" accessed Aug. 7, 2014", "Email interview with Carly Lindauer, spokeswoman for the College Board, Aug. 7, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]