["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Scientists around the world are racing to develop vaccines against COVID-19 and some trials are underway. There aren’t, however, \"mass vaccinations\" happening in Africa that are causing kids to die, as a recent Facebook post claims.", "\"Mass vaccinations for COVID-19 in Senegal was started yesterday (4/8) and the first 7 CHIDLREN who received it DIED on the spot,\" it says.", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The misinformation seems to stem from a video post on Facebook on April 4 that claimed to show the arrest of someone who allegedly injected vaccines into children near Dakar, according to France 24. A French voiceover in the video says: \"There is a big scandal in Senegal. There is a guy who came into a house to get kids vaccinated for coronavirus. He vaccinated seven children who died on the spot.\"", "But France 24 noticed that the voiceover covers another voiceover in Wolof, one of the national languages spoken in Senegal. In the Wolof version of the video, the voiceover says: \"He’s a guy who came to the neighborhood today with injections supposedly against the coronavirus. He entered the house of the Mbodji family. He said he is there to administer vaccines.\"", "The death of seven children isn’t mentioned.", "Alassane Mbodji, who lives at the house in the videos, told France 24 that \"everything that is said on social networks is false. No one died of any vaccine. Our children are healthy.\"", "She told the news station that a man came to the home and introduced himself as an agent of the Ministry of Health who was there to raise awareness about the threat of coronavirus. He wore a T-shirt with a health department logo, she said.", "\"But in the discussions, we quickly realized that he was not an agent of the Ministry of Health. He did not have a badge. He had cosmetic products for sale in his bag,\" she said. Because he was pretending to be a public agent to sell his products — flouting rules barring people from entering others’ homes — she reported him to the authorities, according to the story.", "A spokeswoman for Senegal’s health ministry told Agence France-Presse the Facebook claims were inaccurate. \"There is no vaccine,\" she said.", "We rate this Facebook post False.", "Facebook post, April 10, 2020", "World Health Organization, Public statement on collaboration on COVID-19 vaccine, April 13, 2020", "National Institutes of Health, NIH clinical trial of investigational vaccine for COVID-19 begins, March 16, 2020", "France 24, A test of the Covid-19 vaccine on children in Senegal? What does the video really show?, April 4, 2020", "AFP, Senegalese children did not die from a coronavirus vaccine (which does not yet exist), April 10, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]