["A video of two children and a woman who seem to have committed suicide by hanging themselves in their home is viral on social media. Facebook user Mohd Samim posted the video with the message that a Nepali family in Gujarat’s Morbi committed suicide after starving from hunger amidst the lockdown. It further states that the family was facing a financial crisis. The post has amassed over 1,100 shares so far.", "The Hindi text posted along with the message reads, “ये वीडियो #गुजरात मोरबीमा की बताई जा रही है #नेपाली फैमिली है यहां काम करने आए थे #Lockdown के दौरान काफी दिनों तक कुछ खाना नहीं मिला भूख से परेशान होकर खाने पीने की दिक्कत पैसों की दिक्कत के कारण फांसी लगाकर आत्महत्या करली”.", "The same video was also shared with the narrative that the incident took place in Ahmedabad’s Danilimda area. The text reads, “It’s from Ahmedabad’s Danilimda. It would be okay if it isn’t possible for you to transact money to friends and family but make sure that you give at least ₹500 to needy people around you. So that no one dies due to hunger. People are even asking for rents in Ahmedabad. They are being forced to take such steps.”", "[Translated from: “અમદાવાદ ના દાણીલીમડા નું છે પરિવાર મિત્રો ટ્રાન્જેક્શન નહિ થાય to ચાલશે પણ આપડી આજુ બાજુ આવું નાથાય તે જોજોખીસા ના 500રૂપિયા આપી દેજો પણ આવું નાથવા દેતા ભૂખ ના મારે અમદાવાદ નું છે અત્યારે લોકો ભાડું પણ માગે છે તૈયારે મંજબુરી માં આ કરવું પડે છે”.]", "With a keyword search on Google, Alt News found a report published by The Times of India on May 3, 2020. Tulsi Nepali, a 25-year-old woman, had hanged herself to death after strangling her two daughters – nine-year-old Puja and five-year-old Sirjana – in Gujarat’s Morbi city. According to the police’s preliminary investigation, the woman had taken “the drastic step in a fit of rage after suspecting her husband, Vishnu, of having an extramarital affair.” Vishnu, who worked as a gym instructor, and his wife Tulsi had reportedly moved to Morbi just five months ago.", "“After the incident, police also took the help of FSL and sent the bodies to Rajkot for panel post mortem. However, the post mortem report also revealed that the mother had killed (her) two daughters before committing suicide.” reported a local website Morbi Update on May 3, 2020. The report said that a complaint has been filed by the husband and police is taking further action in the matter.", "Alt News spoke to RJ Chaudhary, an inspector with Morbi A Division police station. He said, “The claims about the lack of food and a financial crisis being the reason behind the crime are false.”", "A video of an incident where a mother strangled her two daughters to death and later committed suicide herself was shared with a false narrative that a Nepali family in Gujarat’s Morbi committed suicide due to lack of financial resources and food during the nationwide lockdown.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]