["Democrats in the state Legislature protested in June 2013 when majority Republicans introduced and quickly passed a bill requiring women seeking an abortion to get ultrasound scans.", "Two months later, the gaping divide between the two parties on abortion -- seen in the bitter floor debate over the bill -- remains wide.", "That was evident when Assembly Minority Leader Peter Barca (D-Kenosha) and the Assembly Speaker Robin Vos (R-Rochester) were interviewed together on Wisconsin Eye Aug. 7, 2013.", "Vos said he was proud the new law means that \"every single mother has the opportunity to see the child\" before making a \"final decision to end the life of that baby.\" Democrats who sued to block the law, he added, are \"out there saying it’s more about getting rid of the child than it is about giving information to the mother, and I think that’s sad.\"", "In response, Barca called the new law \"so irresponsible.\"", "\"I think it's maybe the first time we've dictated a medical procedure a woman has to go through, whether she can afford it or wants it or believes it’s necessary. In the case of rape … even if you're raped, if you don't report it in the first 30 days, the Republicans will force you to have to have an ultrasound.\"", "The bill passed on party-line votes, and Gov. Scott Walker signed it into law July 5, 2013.", "Besides ultrasounds, Act 37 requires doctors who perform abortions to have hospital admitting privileges within 30 miles. The law’s authors say that means better care if abortions result in urgent medical problems. A judge has temporarily blocked the requirement on doctors, but the ultrasound provision remains in effect.", "Abortion providers argue the admitting requirement would force closure of two clinics because their doctors don't have admitting privileges at nearby hospitals. The result, they say, is that abortions in Wisconsin would not be available north of Madison or -- after the 19th week of pregnancy -- anywhere in the state.", "While the ultrasound provision has drawn much attention, the treatment of sexual assault victims under the bill has drawn relatively little.", "Is Barca right that women who do not report a rape within 30 days would be required to have an ultrasound?", "More about the law", "Under the law, the person performing the ultrasound must describe what is being shown and provide the woman an opportunity to see the ultrasound images. But the woman can't be required to view the images.", "PolitiFact Wisconsin previously rated False a claim by activist Rachel Campos-Duffy that more than 90 percent of women seeking an abortion decide not to get one after seeing their ultrasound. Research indicates that some women change their mind, but no solid evidence backs her sweeping claim.", "Barca’s statement was specific to sexual assault victims.", "The new law explicitly grants an exception -- a \"waiver\" in the bill’s parlance -- from pre-abortion ultrasounds when a pregnancy is the result of sexual assault or incest, or in cases of medical emergencies. The bill’s definition of \"sexual assault\" includes rape. It covers assaults of the first, second and third-degree.", "The reporting requirement drew criticism from some lawmakers and the Wisconsin Coalition Against Sexual Assault, which said that for victims who don’t report a rape, an ultrasound \"only serves to remind them of the trauma caused by the perpetrator.\"", "Several things have to happen before sexual assault victims qualify for the waiver.", "-- The woman must state that a report alleging the assault has been made to law enforcement.", "-- A physician or qualified assistant must confirm the report has been made and make a notation in the woman’s medical file.", "-- Law enforcement officials must confirm -- confidentially -- that they received the report.", "So it’s correct to say that rape victims who seek abortions would be required to have an ultrasound unless they report to police.", "But Barca runs into trouble on part of his statement.", "He frames his claim around a specific time limit, saying that rape victims don’t just have to make a report to avoid an ultrasound, they have to do so within 30 days.", "To be sure, that reporting timeframe is the norm in Wisconsin. In 2010, 72 percent of the 4,857 reported sexual assaults were reported within 30 days, state figures show. Still, another 12 percent of those reporting did so after a month but before one year, and another 5 percent did so after a year. No data was available on the rest.", "But our search of Act 37 and related statutes, plus checks with legislative officials and interest groups, found no evidence of any specific timetable in the law enforcement reporting provision.", "Rather, victims can report the crime and thereby avoid an ultrasound scan without regard to any time limits.", "Barca aide Erik Greenfield told us the lawmaker misspoke in mentioning a 30-day time limit.", "It’s unknown exactly how many rape victims seek abortions but do not report being assaulted. But there is evidence that many sexual assault victims do not report file a report with police, for a variety of reasons.", "Nationally, a large survey by the Bureau of Justice Statistics, an arm of the U.S. Justice Department, showed that 64 percent of rapes or sexual assaults against females were not reported to the police from 2005 to 2010. The leading reasons for not reporting: feared reprisal (20 percent); considered it a personal matter (13 percent); felt police would not help (13 percent); reported to  different official (8 percent); not important enough to report (8 percent); did not want to get perpetrator in trouble (7 percent).", "In Wisconsin, evidence suggested that only 19 percent of sexual assaults are reported to law enforcement, the state Office of Justice Assistance, said in 2011. OJA was an independent state agency eliminated in the 2013-’15 state budget.", "Critics of the bill say these numbers strongly suggest that some abortion-seeking assault victims will be non-reporters and therefore will be forced to get an ultrasound. State Sen.  Mary Lazich, the bill’s sponsor, doesn’t deny the possibility, but said victims could avoid that.", "\"They need to report sexual assaults,\" Lazich, R-New Berlin, told us.", "Our rating", "Barca said that a new law passed by Republicans regulating abortion deals with sexual assault victims this way: \"Even if you're raped, if you don't report it in the first 30 days, the Republicans will force you to have to have an ultrasound.\"", "The law does require an ultrasound when such victims do not report the assault to law enforcers, but there is no 30-day deadline for doing so.", "Barca’s claim is partially accurate but misses on an important detail that muddles his message.", "We rate his claim Half True.", "Wisconsin Eye, video, June 12, 2013 Senate floor debate on Senate Bill 206", "Wisconsin Eye, video, Civil Dialogue with Speaker Vos (R-Rochester) and  Minority Leader Barca (D-Kenosha).", "Interview with State Senator Mary Lazich, Aug. 15, 2013", "Interview with Erik Greenfield, deputy communications director, Office of Assembly Democratic Leader Peter Barca, Aug. 16, 2013", "Wisconsin Act 37", "Wisconsin Statutes, \"Voluntary and Informed Consent,\" 253.10", "Interview with Ian Henderson, director of legal and systems services, Wisconsin Coalition Against Sexual Assault, Aug. 13, 2013", "Milwaukee Journal Sentinel, \"Federal Judge extends hold on Wisconsin’s abortion law,\" July 18, 2013", "Wisconsin Office of Justice Assistance, \"Sexual Assaults in Wisconsin  2010,\" April 2011", "US Bureau of Justice Statistics, \"Female Victims of Sexual Violence, 1994-2010,\" (Table 9) , March 7, 2013", "US Bureau of Justice Statistics, \"Over 60 percent decline in sexual violence against females from 1995 to 2010,\" March 7, 2013", "Wisconsin Department of Justice, \"Report finds slight increase in number of victims reporting sexual assaults to law enforcement,\" May 2, 2011", "Wisconsin Legislative Council, research help", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]