["About this rating", "In June 2020, as widespread protests against institutional racism and police brutality spread across the United States, NASCAR announced that it was banning the display of the Confederate flag — a symbol that has been historically connected to slavery — at all future events:", "“The presence of the confederate flag at NASCAR events runs contrary to our commitment to providing a welcoming and inclusive environment for all fans, our competitors and our industry. Bringing people together around a love for racing and the community that it creates is what makes our fans and sport special. The display of the confederate flag will be prohibited from all NASCAR events and properties.”", "Shortly after that announcement, a rumor started to circulate on social media that NASCAR was also doing away with  pre-race prayers, military flyovers, and the singing of the national anthem because the game day traditions had been deemed too controversial:", "But NASCAR made no such announcements. As of this writing, pre-race prayers, military flyovers, and the playing of the National Anthem are still regular features of a NASCAR event.", "NASCAR announced its ban on the Confederate flag on their official website on June 10, 2020. Our search of NASCAR's website (as well as their social media pages) for a similar statement announcing the removal of the National Anthem, pre-race prayers, and military flyovers came up empty.", "Furthermore, NASCAR has already hosted a race in the day's following their Confederate flag ban. The Dixie Vodka 400, held on June 14, 2020, featured a pre-race prayer, the singing of the national anthem, and a military flyover. All three moments can be seen in the following video, starting around the four minute mark:", "The pre-race invocation was delivered by Tony Boselli, a former NFL player and COVID-19 survivor, and included a prayer for those whose lives had been touched by racism. Boselli said:", "I prayer for every individual that has been touched by racism. I pray that you bring healing to their lives. God I pray that all of us live our lives with empathy, passion, and love for one another.", "It should also be noted that NASCAR recently removed its rules requiring team members to stand during the national anthem, a policy change that would allow racers to peacefully protest during the national anthem. This change would not be needed, of course, if NASCAR was truly removing the national anthem altogether.", "We reached out to NASCAR, and we'll update this article if more information becomes available.", "McCarriston, Shanna.   \"NASCAR Bans Confederate Flags and Removes Guidelines Requiring Standing For National Anthem.\"\r\n    CBS Sports.  10 June 2020.", "NASCAR.   \"NASCAR Statement on Confederate Flag.\"\r\n    10 June 2020.", "Reynolds, Tim.   \"Kamara Lauds Wallace’s Courage After NASCAR’s Trying Week.\"\r\n    Miami Herald.   14 June 2020.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]