["Rumours of child abduction gangs on the prowl have been circulating aggressively on social media and messaging platforms over the past two months. A variant of these rumours claims that these gangs are into the organ trafficking business, removing the internal organs of abducted children. An incendiary audio clip has been doing the rounds, the message delivered in Hindi by a male voice which says,", "“तमिलनाडू पुलिस को एक कनटेनर से बच्चों की लाश मिली, इन बच्चों के जिस्म के अन्दर का हिस्सा निकाला गया है, जैसे किडनी, लीवर। तमिलनाडू पुलिस ने बताया इन सारे बच्चों को अलग अलग देशों से किडनैप करके लाया गया है ..नोट:-अपने घर के बच्चों को सम्भालो, उनका ख्याल रखो, अपने सारे ग्रुप मे ये मैसेज सेन्ड करो। इस फोटो को इतना फैलाओ ताकि कुत्ता पकड़ा जाना चाहिए। अगर जिसने ये नहीं फैलाया वो अपनी माँ का सपूत नहीं। अपने फोन में चाहे कितने भी ग्रुप हो 1, 2 , 3, 4 या 25, ये सारे ग्रुप मे भेजो, हरामखोर पकड़ा जाना चाहिए।”", "Translation: “Tamil Nadu police found bodies of children inside a container. Internal organs were removed from their bodies, like kidney and liver. Tamil Nadu police has said these children were abducted from various countries and brought here. Note: Take care of your children. Send this message to every group. Spread this photograph so much that this dog is caught. Who does not circulate this is not his/mother’s child. Send this to as many groups- 1, 2, 3, 4, or 25. This rascal must be caught.”", "Alt News is not posting the audio clip here owing to its provocative nature and scope for misuse. It has been shared along with a photograph showing bodies of children lying on the ground.", "Several readers of Alt News have requested verification of this image and the accompanying claim.", "There are two aspects of the claim- the audio message, and the photograph circulated along with it. Alt News had fact-checked this message earlier, when it was shared with the same photograph with which it has been circulated now. There is no truth to this claim. It is a rumour which has been circulating online for at least the past two years i.e. since early 2017.", "Insofar as the picture is concerned, Alt News had reverse-searched it on Google and found that it pertained to a chemical attack in Ghouta, Syria in August 2013 during the Syrian civil war, in which suburbs of Damascus were targeted with rockets containing the chemical agent Sarin. Alt News found the same photo in a blog from 2013.", "The American fact-checking website Snopes had fact-checked this photo in 2016, when it was being shared with the false narrative of organ trafficking in Thailand.", "In conclusion, a rumour which has been circulating online since 2017, that bodies of children with missing organs were found inside a container by Tamil Nadu police, was clubbed with a photograph depicting the tragic aftermath of a chemical attack in 2013, during the Syrian civil war.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]