["About this rating", "Rapinoe momentarily allowed her boot to brush against a U.S. flag that her teammate briefly dropped to the ground during celebrations after the World Cup Final on July 7, 2019 -- both actions that could reasonably be regarded as gestures that were disrespectful towards the flag.", "Video footage shows that Rapinoe did not stomp or stamp on the flag, which was picked up off the ground after about three seconds. Rapinoe has also in the past draped herself in the U.S. flag after an on-field victory,  described herself as \"very deeply American,\" and expressed the view that the U.S. is a \"great country.\"", "In July 2019, some (mostly) right-leaning observers criticized U.S. women's soccer stars Megan Rapinoe and Allie Long after an incident in which an American flag was briefly dropped to the ground as Long, Rapinoe, and others celebrated their 2-0 World Cup Final victory over the Netherlands.", "Special opprobrium was reserved for Rapinoe, who has become the target of criticism from President Donald Trump and some of his supporters due to her public refusal to visit the White House if the U.S. team were invited there, as well as for her past protests during the U.S. national anthem (the latter a gesture of solidarity with former NFL quarterback Colin Kaepernick, who was the catalyst of national anthem protests against racial injustice and police brutality that also drew President Trump's ire).", "In a widely shared tweet on July 7, shortly after the final match took place, Jonathan Gilliam posted a short video clip of the incident and singled out Rapinoe, claiming that she \"stomped\" on a U.S. flag and engaged in \"unpatriotic\" behavior:", "\"You should be disturbed by this unpatriotic narcissistic behavior. [Megan Rapinoe] is neither a hero or a role model. I rewound and watched the entire celebration on the field. Rapinoe didn't want anything to do with an American flag before she stomped it. Repulsive.\"", "You should be disturbed by this unpatriotic narcissistic behavior. @mPinoe is neither a hero or a role model. I rewound and watched the entire celebration on the field. Rapinoe didn’t want anything to do with an #Americanflag before she stomped it. #repulsive pic.twitter.com/Kevbe7jJYt", "— Jonathan T Gilliam (@JGilliam_SEAL) July 7, 2019", "Other right-leaning web sites and commentators jumped into action. The True Pundit website claimed the players had \"tossed the flag to the ground and trampled on it,\" and Before It's News accused Rapinoe and Long of \"showing their hatred for America\" by \"stomping\" the flag.", "This is not what video of the event showed, however. The relevant 15 seconds of the footage can be viewed below, but here's a breakdown of what it actually captured.", "In the moments leading up to the incident, Long had been celebrating the team's victory while draped in the U.S. flag, and she held the World Cup trophy along with teammates Alex Morgan and Kelley O'Hara. Long was closest to the camera, Morgan was in the middle, and O'Hara was on the left:", "O'Hara then walked away, and as Long handed the trophy to Rapinoe, Long was still holding the flag in her hand and allowed part of it to touch the ground:", "Rapinoe (center) then led Morgan (left) and Long (right) in a two-handed celebration dance, and Long allowed the flag to fall out of her hand and onto the ground:", "The video (below) shows that Rapinoe's left boot briefly brushed against the flag, displacing it slightly (a movement that would not have occurred had Rapinoe actually \"stomped\" or stamped on the flag, which is a deliberate up-and-down motion). However, before the three players moved forward any farther, O'Hara ran back over to them as Long picked up the flag and handed it to O'Hara, who took it away out of frame:", "According to our analysis of the footage, just under three seconds elapsed between Long's dropping the flag to the ground and her picking it up again and handing it to O'Hara. The following clip shows the whole incident and demonstrates that Rapinoe's left foot momentarily brushed against the flag on the ground and moved it slightly, but that Rapinoe did not land the sole of her boot on the flag and therefore did not \"stomp\" on it:", "In the thralls of joy and relief at having won a historic World Cup final (by beating the Netherlands, the U.S. became only the second team in Women's World Cup history to win back-to-back titles), Long's handling of the flag was very briefly not in keeping with traditional flag etiquette.", "The U.S. Flag Code states that, as a matter of respect, \"The flag should never touch anything beneath it, such as the ground, the floor, water, or merchandise.\" Although it's not explicitly prohibited, touching a flag which has already fallen to the ground with your footwear (as Rapinoe did) can reasonably be presumed to be a gesture of disrespect and against the spirit of the code.", "The Flag Code is quite restrictive in several ways, stating, for example, that the U.S. flag should never be used as clothing or be draped over a person, the latter of which being something numerous victorious U.S. athletes have been doing for many years, and which an emotional Rapinoe did herself after the women's national team won gold at the 2012 Olympic Games. (Contrary to the attacks on Rapinoe's patriotism, just days before the 2019 final she described herself in an interview as \"very deeply American,\" saying the U.S. was a \"great country,\" albeit one which should \"strive to be better.\"):", "Embed from Getty Images", "North, Anna.   \"Why Trump Is Feuding With Megan Rapinoe, Star of the U.S. Women's Soccer Team.\"\r\n    Vox.   3 July 2019.", "NBC Sports.   \"Trump to Anthem Protesters: 'Get That Son of a Bitch Off the Field.'\"\r\n    22 September 2017.", "True Pundit.   \"Shock Video: USA Women Win Soccer World Cup, Then Toss USA Flag on Ground & Dance Atop It (Video).\"\r\n    8 July 2019.", "Before It's News.   \"Allie Long and Megan Rapinoe of U.S. Women's Soccer Team Show Their Hatred for America by Dragging the Flag on the Ground After Victory.\"\r\n    8 July 2019.", "The American Legion.   \"United States Flag Code.\"\r\n    Accessed 8 July 2019.", "Elliott, Helene.   \"Unpatriotic? U.S. Soccer Star Megan Rapinoe Says: 'I'm Extremely American.'\"\r\n    Los Angeles Times.   3 July 2019.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]