["The dome of the U.S. Capitol is visible as a sign that reads \"Black Lives Matter\" hangs on an overpass on North Capitol Street in Washington on June 2, 2020. (AP)", "ActBlue is a nonprofit technology organization that provides a platform for people to contribute to Democratic campaigns and causes. Black Lives Matter and Democratic presidential candidates both use the platform to fundraise.", "ActBlue does not pocket donations that are facilitated by its platform — it ferries the money along to the organizations requesting it. It’s similar to a platform called WinRed, which facilitates fundraising for Republican candidates.", "Since protests over the death of George Floyd erupted in late May, donations to civil rights organizations have surged. But some conservative commentators say not all the money is going toward the cause.", "In a since-deleted June 11 Facebook post (archived here), Ryan Fournier, co-founder of Students for Trump, claimed that donations to Black Lives Matter were actually being funneled to Democratic campaigns.", "\"All money donated to Black Lives Matter goes directly to ActBlue, a Democrat Super PAC that then feeds the money to Democrat candidates,\" he said. \"Congratulations, you played yourself.\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.) Fournier deleted the post after we reached out to him, but the Twitter version remained posted.", "(Screenshot from Facebook)", "Other conservative commentators, such as Candace Owens and the Hodgetwins, Instagram posts have made similar allegations. So we looked into them.", "The post is inaccurate. ActBlue is a platform for people to contribute to Democratic campaigns and other causes like Black Lives Matter. It passes along donations to organizations that use its fundraising platform — it doesn’t pocket the money itself.", "We reached out to Fournier for the source of his claim and haven’t heard back. His assertion appears to stem from a video circulating on social media.", "The video shows a screen recording of an Instagram story from a user in Miami. He attributed the information to a conservative Instagram account called \"Telerevela,\" which started posting in February and publishes conspiratorial posts about the coronavirus pandemic and protests over police brutality in Spanish. Telerevela posted an identical video, albeit in Spanish, on Facebook around 1 a.m. on June 11.", "The video, which has nearly 2 million views on Twitter, lays out a false trail for Black Lives Matter donations.", "In it, the user tries to donate to Black Lives Matter. When they tap the donate button on the movement’s website, they’re directed to a web address that has ActBlue in it. The donation page also has a disclosure about the nonprofit.", "(Screenshot from Twitter)", "Then, they open up a page from OpenSecrets.org — the website of the nonprofit Center for Responsive Politics, which tracks money in politics — to see how ActBlue spends its money. They highlight what appear to be several multi-million dollar contributions to Democratic presidential candidates like Sen. Bernie Sanders and former Vice President Joe Biden.", "\"And that my fellow Americans is how ‘white collar’ money laundering is done,\" reads some text at the end of the video. \"BLM is just another corrupt arm of the (Democratic National Committee).\"", "The video misrepresents what ActBlue does, as well as where donations to Black Lives Matter actually go.", "Black Lives Matter is using ActBlue’s fundraising platform to take donations. But ActBlue isn’t pocketing the money.", "ActBlue told us in an email that it passes along contributions from its fundraising platform directly to the 501(c)(3) charities or 501(c)(4) nonprofits that asked for them. Its function is similar to PayPal or Stripe, which are conduits for online purchases.", "OpenSecrets also clarified that point in a tweeted response to Candace Owens’ post, saying that \"a donation to BLM through ActBlue goes just to BLM, not any other group.\"", "ActBlue is a fundraising platform used by Democrats & progressives. Like WinRed on the right, many candidates use it to process donations but that money isn't pooled to be shared across candidates or groups. A donation to BLM through ActBlue goes just to BLM, not any other group. https://t.co/rb5sF7VbwA", "OpenSecrets compared ActBlue with WinRed, a fundraising platform for Republican campaigns and causes that was launched in 2019 to compete with ActBlue. Both organizations facilitate fundraising for aligned political groups.", "Despite being classified as political action committees by the Federal Election Commission, ActBlue and WinRed have \"non-contribution accounts,\" meaning they have separate bank accounts that \"will not be used to make contributions, whether direct, in-kind or via coordinated communications, or coordinated expenditures, to federal candidates or committees,\" according to the FEC.", "Democratic and Republican presidential candidates are listed as \"top vendors/recipients\" on ActBlue and WinRed’s OpenSecrets pages not because the organizations have directly donated to them, but rather because the organizations act as \"middle men\" between the donors and the candidates.", "For example, if you were to go to Biden’s donation page, you would be redirected to a page on ActBlue’s fundraising platform to complete the transaction. Similarly, if you tried to donate to President Donald Trump’s re-election campaign, you’d be redirected to a page from WinRed.", "RELATED: ‘Defund the police’ movement: What do activists mean by that?", "As the Center for Public Integrity reported when WinRed was launched, the idea is to make it easier for political campaigns to fundraise small-dollar donations.", "\"Take the 2018 midterm elections, when Democratic House and Senate candidates outraised Republicans more than two to one in contributions from individuals,\" the center wrote. \"Republicans pointed to ActBlue, which helps donors more easily give money to Democratic candidates and liberal political groups, as a big reason why.\"", "The Black Lives Matter Global Network Foundation, Inc., the organization that operates the Black Lives Matter website, is fiscally sponsored by the nonprofit Thousand Currents. That means Thousand Currents is handling Black Lives Matter’s finances as the organization seeks its own tax-exempt status. The Internal Revenue Service stipulates that 501(c)(3) organizations are \"absolutely prohibited\" from making contributions to political campaigns, which would apply to Thousand Currents.", "A popular claim on social media asserts that donations to Black Lives Matter go directly to ActBlue, which uses them to fund Democratic campaigns.", "It’s wrong. ActBlue is a nonprofit technology organization that provides a platform for people to contribute to Democratic campaigns and causes. Black Lives Matter and Democratic presidential candidates use the platform to fundraise.", "ActBlue does not pocket donations that are facilitated by its platform — it routes donations to organizations in a similar way to the Republican fundraising platform WinRed.", "The Facebook post is inaccurate. We rate it False.", "Correction, June 16, 2020: A previous version of this article stated that the Black Lives Matter Global Network Foundation, Inc. is a nonprofit. In fact, it is in a fiscal sponsorship with a nonprofit. It is not yet its own 501(c)(3) organization.", "ActBlue, \"Can you donate to Elect Joe Biden?\" accessed June 12, 2020", "ActBlue, \"Urgent: Fund the Movement,\" accessed June 12, 2020", "ActBlue Charities, \"ActBlue Charities is HERE,\" Feb. 17, 2016", "Black Lives Matter Privacy Policy, accessed June 12, 2020", "Center for Public Integrity, \"Red Shift: How Republicans Plan To Catch Democrats In Online Fundraising,\" July 1, 2019", "CrowdTangle, accessed June 12, 2020", "Email from Caleb Cade, senior associate at STG Results, June 11, 2020", "Facebook post from Ryan Fournier, June 11, 2020", "Facebook video from the Hodgetwins, June 11, 2020", "Facebook video from Telerevela, June 11, 2020", "Federal Election Commission, ACTBLUE, accessed June 12, 2020", "Federal Election Commission, Types of nonconnected PACs, accessed June 12, 2020", "Federal Election Commission, WinRed, accessed June 12, 2020", "Instagram post from Telerevela, Feb. 9, 2020", "Instagram post, June 11, 2020", "Internal Revenue Service, \"The Restriction of Political Campaign Intervention by Section 501(c)(3) Tax-Exempt Organizations,\" accessed June 12, 2020", "The New York Times, \"Protests Spur Surge in Donations, Giving ActBlue Its Biggest Day of the Year,\" June 1, 2020", "OpenSecrets.org, ActBlue, accessed June 12, 2020", "OpenSecrets.org, WinRed, accessed June 12, 2020", "PolitiFact, \"How George Floyd protests evolved in 5 major cities,\" June 10, 2020", "ProPublica Nonprofit Explorer, Black Lives Matter Foundation, accessed June 12, 2020", "Tweet, June 10, 2020", "Tweet from Candace Owens, June 10, 2020", "Tweet from Matt Binder, June 11, 2020", "Tweet from OpenSecrets, June 10, 2020", "Tweet from Ryan Fournier, June 11, 2020", "Twitter video, June 10, 2020", "WinRed, \"WE MADE HISTORY,\" accessed June 12, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]