["By Lori Robertson, Robert Farley, Vanessa Schipani and Eugene Kiely", "Posted on August 31, 2017", "In a speech on changing the tax code, President Donald Trump offered some political spin on the facts.", "Trump made his remarks on Aug. 30 in Springfield, Missouri, calling on Congress to “support pro-American tax reform.”", "Trump exaggerated the amount of money U.S. companies likely have in offshore accounts, nearly doubling a figure the White House includes in a fact sheet, released the same day as the president’s remarks.", "Trump: Because of our high tax rate and horrible, outdated, bureaucratic rules, large companies that do business overseas will often park their profits offshore to avoid paying a high United States tax if the money is brought back home. So they leave the money over there. The amount of money we’re talking about is anywhere from $3 trillion to $5 trillion. Can you believe that?", "U.S. companies with business overseas do keep some profits in offshore accounts, where it isn’t subject to U.S. corporate taxes until it is repatriated to this country. The profits are declared indefinitely, or permanently, reinvested, which means the companies say they will reinvest the money abroad.", "If a U.S. company does bring the money back to the United States, it would be “subject to the U.S. tax rate of 35 percent minus a tax credit equal to whatever taxes the company paid to foreign governments,” the Institute on Taxation and Economic Policy explains in a March report on this issue.", "The White House cites figures from that report in its Aug. 30 fact sheet on Trump’s tax remarks.", "White House fact sheet, Aug. 30: Fortune 500 corporations are holding more than $2.6 trillion in profits offshore to avoid $767 billion in Federal taxes, according to the Institute on Taxation and Economic Policy.", "If the White House is citing a figure of $2.6 trillion for profits kept overseas, where does Trump get the $5 trillion figure? We asked the White House, but we haven’t received a response.", "We also asked ITEP, a nonprofit that partners with the left-leaning Citizens for Tax Justice, about the $5 trillion figure, which Trump has used before. ITEP Senior Fellow Matthew Gardner told us in an email: “I have never seen an estimate as high as $3 trillion, and the $5 trillion number seems impossibly high.”", "ITEP’s estimate is for Fortune 500 companies, but the independent research firm Audit Analytics has a database for all companies that file with the Securities and Exchange Commission. Don Whalen, the firm’s director of research, told us that as of today, there were $2.8 trillion in corporate profits indefinitely reinvested.", "Trump’s campaign cited a $2.1 trillion estimate from 2015 in the footnotes for Trump’s economic speech in Detroit in August 2016. In that speech, Trump said: “We are also going to bring back trillions of dollars from American businesses that is now parked overseas.” And his campaign tax plan used a figure of $2.5 trillion.", "But he has established a pattern of bumping that up to $5 trillion. He told the Economic Club of New York in September 2016: “Some people say there are $2 trillion dollars overseas, I think it’s $5 trillion.” And he used the figure in an interview with the Wall Street Journal in late July.", "Trump went on to say in his Aug. 30 remarks: “By making it less punitive for companies to bring back this money, and by making the process far less bureaucratic and difficult, we can return trillions and trillions of dollars to our economy and spur billions of dollars in new investments in our struggling communities and throughout our nation.”", "It’s worth noting that the U.S. has tried to spur repatriation of these earnings before. In 2004, the American Jobs Creation Act created a one-year reduction that made the tax rate on repatriated profits 5.25 percent for companies that paid a 35 percent corporate rate, explains a 2011 Congressional Research Service report. About one-third of offshore earnings were brought back to the U.S., CRS said, but studies on the impact generally found that “the repatriations did not increase domestic investment or employment. They further conclude that much of the repatriations were returned to shareholders through stock repurchases.”", "The president didn’t reveal details on what his tax holiday for offshore profits would be. His campaign tax plan, however, proposed a repatriation tax of 10 percent.", "FactCheck.org Rating:", "Read More", "Though he gets the numbers right, Trump engaged in some misleading spin when he compared economic growth under his administration with the previous administration.", "Trump, Aug. 30: And today, a very appropriate day that this should happen, we just announced that we hit 3 percent in GDP. Just came out. And on a yearly basis, as you know, the last administration, during an eight-year period, never hit 3 percent. So we’re really on our way.", "It’s true that the real GDP growth rate was 3 percent for the second quarter of this year, according to the Bureau of Economic Analysis. But Trump doesn’t make it clear that he is talking about one quarter, and then he compounds the distortion by comparing one quarter growth to annual growth under the Obama administration.", "In fact, the real GDP growth rate exceeded 3 percent in eight quarters during the Obama administration, with a high of 5.2 percent in the third quarter of 2014, according to the Bureau of Economic Analysis.", "Trump is correct that the annual real GDP growth rate never exceeded 3 percent under Obama. The highest it reached was 2.9 percent in 2015, according to the BEA. It remains to be seen if the nation’s economy will top 2.9 percent annual growth under Trump. Real GDP increased just 1.2 percent in the first quarter of this year.", "FactCheck.org Rating:", "Read More", "Trump claimed “when it comes to the business tax, we [the U.S.] are dead last.” And, he said, the U.S. rate is “60 percent higher” than “our economic competitors.” The U.S. does have the highest statutory corporate tax rate among developed countries. But the U.S. isn’t highest when tax credits are factored in, for example.", "There are many ways to measure and compare corporate tax burdens, and Trump chose those that paint the U.S. in the worst possible light relative to other countries.", "Trump: Today, we are still taxing our businesses at 35 percent, and it’s way more than that. And think of it, in some cases way above 40 percent when you include state and local taxes in various states. The United States is now behind France, behind Germany, behind Canada, Ireland, Japan, Mexico, South Korea and many other nations. …", "So when it comes to the business tax, we are dead last. Can you believe this? So this cannot be allowed to continue any longer. America must lead the way, not follow from behind. We have gone from a tax rate that is lower than our economic competitors, to one that is more than 60 percent higher. We have totally surrendered our competitive edge to other countries.", "It’s not strictly true that the U.S. has a higher statutory corporate tax rate than every other country in the world. That dubious distinction goes to Comoros, a tiny archipelago off Africa’s east coast that has a statutory rate of 50 percent, and the United Arab Emirates, which selectively levies at a rate of 55 percent, Kyle Pomerleau, director of federal projects at the Tax Foundation, told us.", "The federal statutory corporate tax rate in the U.S. is 35 percent, as Trump said, and that figure jumps to about 39 percent when state taxes are added in. That is highest among the 35 advanced economies tracked by the Organisation for Economic Co-Operation and Development. The next highest is France at 34.4 percent.", "But that’s just one way to measure corporate tax burdens. In 2014, a Congressional Research Service report found that the average effective corporate tax rate in 2008 was 27.1 percent, which tracks pretty closely to the GDP weighted average among other OECD countries, 27.7 percent.", "“Although the U.S. statutory tax rate is higher, the average effective rate is about the same, and the marginal rate on new investment is only slightly higher,” the CRS report states. “The statutory rate differential is relevant for international profit shifting; effective rates are more relevant for firms’ investment levels.”", "Pomerleau, of the Tax Foundation, warned however that effective tax rate calculations that simply divide taxes paid by corporate profits skew results for the U.S. That’s because the U.S. has a smaller corporate sector than many other developed nations. And that’s because the U.S. has a larger proportion of pass-through businesses, such as S corporations and partnerships that are taxed at an individual rather than corporate rate. The marginal individual rate ranges from 10 percent to 39.6 percent.", "A Congressional Budget Office report in March presented three measures of corporate tax. The first, the “top statutory corporate tax rate,” lists the U.S. highest among G20 nations at 39.1 percent. The second is the “average corporate tax rate,” a measure “of the total amount of corporate taxes that a company pays as a share of its income.” By that measure, the U.S. rate of 29 percent ranks third among G20 countries, behind Argentina at 37.3 percent and Indonesia at 36.4 percent. Finally, the CBO calculated the “effective marginal corporate tax rate,” defined as “a measure of a corporation’s tax burden on returns from a marginal investment.” By that measure, CBO found, the U.S. rate of 18.6 percent was fourth among G20 countries, lower than Argentina (22.6), Japan (21.7) and the United Kingdom (18.7).", "A 2016 Government Accountability Office report found that from 2006 to 2012 “at least two-thirds of all active corporations had no federal income tax liability.” The GAO said: “Among large corporations (generally those with at least $10 million in assets) less than half—42.3 percent—paid no federal income tax in 2012. Of those large corporations whose financial statements reported a profit, 19.5 percent paid no federal income tax that year.”", "As for Trump’s claim that “we have gone from a tax rate that is lower than our economic competitors, to one that is more than 60 percent higher,” that’s accurate when comparing the U.S. statutory corporate tax rate to the average statutory tax rate among the 35 countries tracked by the OECD. But according to a Congressional Research Service analysis of rates in 2010, when weighted to reflect the relative size of the countries’ economies, the difference between the U.S. statutory rate and the OECD average is just 32 percent.", "FactCheck.org Rating:", "Read More", "Trump discussed the complexity of the U.S. tax code that frustrates today’s taxpayers.", "Trump: In 1935, the basic 1040 form that most people file had two simple pages of instruction. Today, that basic form has 100 pages of instructions, and it’s pretty complex stuff. The tax code is so complicated that more than 90 percent of Americans need professional help to do their own taxes.", "Trump’s statement on professional tax help is misleading.", "Fifty-four percent of taxpayers — not all Americans — paid someone else to do their taxes for tax year 2014, according to the Taxpayer Advocate Service, which serves as an advocate for taxpayers at the IRS. And another 40 percent of taxpayers used tax software.", "That would, of course, include some Americans who choose to use online software for ease and convenience, not necessarily because they think their taxes are too complicated. Some tax filers can use software for free, if they meet income and other requirements set by several companies.", "Of the 147.4 million individual returns filed in 2013, 16 percent were through 1040EZ, according to IRS data, which is one page.", "He was right when he said that the 1040 instruction form in 1935 was only two pages. Today, the 1040 instruction booklet is 106 pages, although not all of them are instructions. There are dozens of pages of tables and other illustrations. His larger point, however, that filing taxes is much more complicated today is correct.", "But Trump ignored one key difference between then and now: Only about 5 percent of Americans paid the federal income tax in the 1930s. It wasn’t until President Franklin D. Roosevelt signed the Revenue Act of 1942 that the federal income tax became a tax on the masses, according to the IRS.", "IRS, Taxes in U.S. History: In 1939 only about five percent of American workers paid income tax. The United States’ entrance into World War II changed that figure. The demands of war production put almost every American back to work, but the expense of the war still exceeded tax-generated revenue. President Roosevelt’s proposed Revenue Act of 1942 introduced the broadest and most progressive tax in American history, the Victory Tax.", "“By war’s end in 1945, about 90 percent of American workers submitted income tax forms, and 60 percent paid taxes on their income,” the IRS says.", "In 1935, the top marginal tax rate was 63 percent; today it is 39.6 percent.", "FactCheck.org Rating:", "Read More", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]