["The U.S. may have reached more than 77 million coronavirus vaccines administered, but its rollout effort lags behind countries like Israel, where more than 50% of Israelis have received at least one dose and nearly 40% have been fully vaccinated.", "Protection against the virus is not the only thing the country of 9.2 million is providing its vaccinated citizens: It's handing out some social perks as well, according to one social media post.", "\"Photo from Isreal (sic), where they are implementing an internal COVID-19 vaccine passport,\" writes one Facebook user to the image of green lounge chairs on a beach marked with the words \"RESERVED FOR VACCINATED PEOPLE ONLY.\"", "The post has received more than 400 interactions and shares since it was published Feb. 28, along with many comments expressing disbelief.", "\"This is called social conditioning!\" one Facebook user commented.", "\"That's messed up!\" another said.", "USA TODAY has reached out to the original poster for further comment.", "More:Fact check: False claim declares there are ID requirements to enter Washington", "The \"internal COVID-19 vaccine passport\" is a very real initiative introduced by Israel's Ministry of Health in mid-January and released in late February in an effort to reopen the country, and the economy, more widely.", "According to the ministry, the passport, or \"Green Pass\" – a vaccination certificate, in both digital and paper form – is available to anyone who has received two doses of the COVID-19 vaccine through any one of Israel's four health maintenance organizations or other accredited vaccination service.", "People who have recovered from the virus, indicating acquired immunity, but have not been vaccinated are not eligible.", "Though shops, malls and museums are open to all, the Green Pass confers exclusive access to restricted sites like hotels, gyms, theaters, music venues and other leisure facilities. Indoor dining in restaurants and bars is expected to be included sometime in March, The Guardian reported.", "Pass-holders are not required to follow COVID-19 safety restrictions such as going into isolation if coming into contact with a confirmed infected patient or after international travel from a COVID-19 \"red zone,\" or countries with high infectious rates.", "But mask-wearing in public settings remains compulsory, as do social distancing and avoiding social gatherings.", "Other caveats are that the pass does not take effect until a week after the second dose is administered and expires within six months, although it can be renewed many times. It's also invalid unless accompanied by proper identification documents, a precaution against it being falsely used or distributed.", "About 60% of Israelis were expected to be eligible for the pass, Israeli Intelligence Minister Eli Cohen told the state's public radio broadcaster Kan before the Green Pass' launch.", "There are hopes the program will help incentivize those who have put off vaccination. The country saw a decline in vaccination rates last month.", "But resuming some semblance of pre-COVID-19 normalcy has raised concerns that the initiative will invite discrimination and further the divide between those with vaccine access and those without. Israel has received criticism for sending sparse vaccine shipments to its neighbor Gaza – with a population of about 2 million people – while sending more to distant political allies elsewhere and even in exchange for an Israeli citizen detained in Syria.", "The case fatality rate, or proportion of reported infections that result in a person dying, is 1.1% among Palestinians living in the West Bank, Gaza and East Jerusalem compared with 0.7% in Israel, according to recent data from the World Health Organization.", "More:Fact check: Face masks do not cause bacterial pneumonia", "The claim that Israel is implementing an internal COVID-19 vaccine passport is supported by our research. The domestic passport, also known as a \"Green Pass,\" provides people who have been fully vaccinated some freedom from COVID-19 safety restrictions.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook."]