["Appearing with fellow Democrats seeking a new U.S. House seat, Rep. Lloyd Doggett of Austin defended his decision to run in the 35th Congressional District, which snakes from downtown San Antonio north into southeastern Travis County.\n\nOn the April 13, 2012, edition of KLRN-TV’s \"Texas Week,\" Doggett pointed out that this is the second decade that the state’s ruling Republicans, including Gov. Rick Perry, have tried to knock him out of the House by drawing district lines seemingly to his disadvantage.\n\nDoggett, who is not seeking re-election in his newly Republican-leaning 25th Congressional District, said that, in contrast, \"the district that I am running in for re-election to Congress is the district that has more of my current constituents than any other district in the state. I represent or have represented about half of the district; the other half is new.\"\n\nSylvia Romo of San Antonio, the Bexar County tax assessor-collector, objected, saying that 55 percent of the 35th district is in Bexar County. Inaccurate, Doggett said, and then the program’s host, Rick Casey, offered up that 47 percent of the district is in Bexar County with 31 percent in Travis County; that is where Doggett resides.\n\n\"But I don't just represent Travis County,\" Doggett replied. \"I represent Lockhart and San Marcos and Kyle. And when you include the areas that I serve in Congress, it's just under half of this total district.\"\n\nPhew. Is Doggett right?\n\nBy email, Doggett campaign spokeswoman Ashley Bliss-Herrera passed along a population analysis of the 35th district from the Texas Legislative Council, which helps state legislators draft legislation. Bliss-Herrera said the analysis shows that nearly 315,300 of the district’s nearly 698,500 residents, or 45 percent, live in the Travis, Hays and Caldwell county portions of the district. And, she said, Doggett has represented those areas before.\n\nWe provided Bliss-Herrera with another population analysis by the legislative council indicating that about 41 percent of the 35th district’s residents were previously in the 25th district now represented by Doggett. According to the council, the 35th district also sweeps in residents of the 10th, 20th, 21st, 23rd and 28th congressional districts that will be moot after the next Congress is sworn in.\n\nBliss-Herrera said the latter analysis does not account for parts of Travis County in the 35th district that Doggett has represented in the past. Doggett was initially elected to succeed Rep. J.J. \"Jake\" Pickle in 1994, representing what was then the 10th district taking in nearly all of Travis County.\n\nThis wrinkle seems believable, though we were unable to confirm as much from available legislative council data.\n\nAll told, then, it’s evident that Doggett has represented 41 percent of the district he seeks to represent. It’s also plausible that he’s represented 45 percent. That’s approaching half. We rate his claim Mostly True.", "Emails (excerpted), responses to PolitiFact Texas, Ashley Bliss-Herrera, field and communications director, Lloyd Doggett campaign, May 15-16, 2012\n\nTexas Legislative Council, redistricting research, \"\"Plan Overlap Population Analysis, CONGRESSIONAL DISTRICTS PLANC235 Compared with PLANC100 2010 General Election,\" Feb. 27, 2012; \"District Population Analysis with County Subtotals, CONGRESSIONAL DISTRICTS - PLANC235,\" Feb. 28, 2012 (downloaded May 14, 2012)", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]