["“Check out the social distancing from Calgary Muslims during Ramadan,” says a Facebook post from late April 2020. Below, a photo shows hundreds of men under a large tent.", "Several identical versions of the posts have been shared since April 25, shortly after the beginning of Ramadan, which started on April 23 this year.", "According to social media monitor CrowdTangle, one post, which has since been deleted, was shared in several large Canadian Facebook groups.", "However, the photo used to decry Calgary Muslims’ alleged breach of social distancing during the pandemic was taken in August 2019, months before the novel coronavirus was first reported in China.", "Dan McGarvey, a photographer for Canada’s national broadcaster CBC, took the photo at a ceremony celebrating the start of Eid al-Fitr, another Muslim holiday, on August 11, 2019 at Calgary’s Akram Jomaa Islamic Centre.", "Imam Fayaz Tilly, a spokesman for the Muslim Council of Calgary, confirmed to AFP that the posts were false.", "“I think most Calgarians know that this was deliberately shared to create confusion,” he said.", "“We immediately suspended prayers, Friday prayers and all congregations, even before government regulations. All of our programs are being streamed online to various social media platforms,” Tilly told AFP.", "Asked if there had been any reports or complaints around issues of social distancing in connection to Ramadan celebrations, a Calgary Police Service spokesperson told AFP: “To date, we have not seen any reports to the Calgary Police Service or complaints about this.”", "In order to contain the COVID-19 pandemic, the city of Calgary declared a state of local emergency on March 15, and gatherings of more than fifteen people are prohibited throughout the province of Alberta, in which Calgary sits.", "As a result, places of worship have closed their doors, including the Akram Jomaa Islamic, which is offering Facebook Live sermons and is delivering iftar, the meal breaking the daily Ramadan fast at sunset, to community members at home.", "On April 30, 3,590 of Alberta’s 5,355 confirmed COVID-19 cases were in the Calgary zone, including 57 of 89 deaths related to the virus in the province.", "​AFP Fact Check has debunked more than 400 instances of false or misleading information about the novel coronavirus. A roundup of our work in English can be found here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]