["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Gov. Rick Scott has drawn criticism from environmentalists for denying in 2011 that man contributes to climate change and now dodging questions with the reply of \"I’m not a scientist.\"", "The topic arose during the Oct. 21 CNN debate when moderator Jake Tapper asked Gov. Rick Scott why he was \"reluctant to believe the overwhelming majority of scientists who say that man contributes to climate change.\"", "Instead of answering the question directly, Scott claimed that he had already taken action to protect the environment, including addressing sea-level rise.", "\"We have spent $350 million to deal with sea-level rise down in the Keys, or down in the Miami area. We spent hundreds of millions of dollars to deal with coral reefs,\" he said.", "Scott made a similar claim in the debate at Broward College on Oct. 15.", "Scott’s claim, particularly about investing in projects to combat sea-level rise, stood out for us. Under Scott, has the state spent $350 million to deal with sea-level rise in the Miami area and hundreds of millions to protect coral reefs?", "Did Scott invest hundreds of millions to help coral reefs?", "We asked a Scott campaign spokeswoman to provide details about the spending for both projects. As for the coral reefs, Jackie Schutz told PolitiFact that the state had \"$100 million spent on protecting the Keys.\"", "The money stemmed from a mandate by the state for the Keys to upgrade from cesspits and septic tanks to a modern sewer system. Improving water quality can help coral reefs.", "In 1999 when Jeb Bush was governor, the state required that the Keys comply with wastewater standards that would necessitate modern sewer by 2010. That deadline would later be extended to 2015.", "To meet that goal, when Charlie Crist, was governor the Legislature approved a bill in 2008 that allowed bonding of $50 million a year for four years for the wastewater program. The bill stated that \"beginning July 1, 2010, the Legislature shall analyze the ratio of the state's debt to projected revenues prior to the authorization to issue any bonds under this section.\" No money was actually doled out during the Crist administration, which coincided with the recession.", "Scott took over as governor in 2011.", "The first year that the state doled out money was in 2012. But the next year Scott, along with legislative leaders, decided not to issue bonds due to concerns about the state’s debt capacity, according to an article in the Florida Keys Keynoter.", "In 2014, the state doled out the second $50 million.", "In August 2014, Scott’s campaign released a \"Let’s Keep Florida Beautiful Plan,\" which included a promise to invest another $100 million in the Keys wastewater project.", "So how does the sewer system relate to coral reefs?", "Centralized wastewater treatment prevents nutrients and other pollutants from entering nearshore waters, said Chris Bergh of The Nature Conservancy in the Keys. Wastewater treatment kills bacteria from human waste that can cause coral disease.", "\"It was a great boon to the Keys environment and residents, but it will not affect sea-level rise in any but the most tangential ways,\" Bergh said.", "Sea-level rise money", "A spokesman for Scott’s office, John Tupps, sent us a list of what he said amounted to over $350 million \"to address flood mitigation and sea-level rise.\"", "The projects were administered by various state agencies and included the following, in addition to the $100 million for sewer in the Keys:", "• $21 million for FEMA flood map modernization;", "• $122 beach protection projects;", "• $5 million for the coastal zone management program;", "• $80 million for flood mitigation in Florida in coastal communities;", "• $25 million for the Keys wastewater revolving loan program projects.", "The first thing we will point out is to get to $350 million Scott counted $100 million to install a sewer system in the Keys even though the point of that project wasn’t to deal with sea-level rise.", "We asked environmental experts if these additional projects should be considered as steps toward combating sea-level rise.", "They told us that while these projects have their merits, they aren’t long-term solutions to sea-level rise.", "For example, better flood maps help identify properties that are vulnerable under today’s conditions to flooding, but they don’t deal with future sea-level rise, Bergh said.  These are typical beach maintenance and flooding-related projects. Scott hasn’t taken steps that scientists say would address future sea-level rise such as reducing coal-fired power plants.", "Florida State University oceanography professor Jeff Chanton said that if the beach protection projects refer to pumping sand onto the beach, that is an \"ineffective short-term temporary fix.\" Chanton was one of the scientists who met with Scott this summer and urged him to take action on climate change.", "The scientists showed Scott how two feet of sea-level rise -- projected by 2048 -- will swallow much of Miami-Dade and Monroe counties. They called on Scott to reduce or eliminate coal-fired power plants; wean the state off carbon-emitting natural gas and oil-fired power; and develop more alternative energy options. The scientists noted that sea-level rise has already caused flooding in Miami Beach at high tide.", "We also sought out several government officials in Broward and Miami-Dade counties as well as the cities of Miami and Miami Beach to see if they had received state money to combat sea-level rise. No one could pinpoint a specific project.", "\"I have no idea what he's talking about. It's the first I've heard of it,\" said Monroe County Commissioner Heather Carruthers, who serves on the Southeast Florida Regional Climate Change Compact, in an interview with the Florida Keys Keynoter.", "Our ruling", "Scott said during the CNN debate, \"We have spent $350 million to deal with sea-level rise\" in the Miami area and \"hundreds of millions dollars to deal with coral reefs.\"", "The state has spent $100 million to help the Keys upgrade to a sewer system, which should improve water quality -- a benefit for coral reefs. Scott omits that it was under Crist that the Legislature passed a law paving the way for the money, and he's wrong to claim it's \"hundreds of millions.\"", "Scott’s office also pointed to a list of projects including flood mitigation, flood maps and beach protection -- and throws in the $100 million for the sewer project -- to make his claim about $350 million to deal with sea-level rise. While these include worthy projects, experts say they aren't directly related to addressing future sea-level rise. They’re typical projects for Florida, not new measures to address climate change.", "We rate this claim Mostly False.", "C-SPAN, CNN debate, Oct. 21, 2014", "Florida House, SB1552, 2008", "Florida Department of Environmental Protection, \"Report to the Department of Community Affairs 10-Year Work Program for Monroe County Florida Keys Wastewater Improvements,\" April 2008", "Gov. Rick Scott campaign, \"Let’s Keep Florida Beautiful,\" Aug. 3, 2014", "Florida Keys Keynoter, \"In CNN debate with Crist, Scott says the state spent ‘$350 million to deal with sea-level rise down in the Keys. That isn’t true,\" Oct. 24, 2014", "Florida Keys Keynoter, \"Village says residents can't afford wastewater mandate,\" Jan 20, 2012", "Key West Citizen, \"‘Rick Scott day’ named in honor of gov’s visit,\" March 16, 2013", "Tampa Bay Times, \"‘Belief in climate change is optional, but participation is mandatory,’\" May 18, 2014", "Miami Herald Naked Politics blog, \"Rick Scott won’t say if he thinks man-made climate change is real, significant,\" May 27, 2014", "Miami Herald, \"Gov. Scott meets with scientists but remains silent on climate change,\" Aug. 19, 2014", "New York Times, \"Miami finds itself ankle-deep in climate change debate,\" May 7, 2014", "Interview, Ron Saunders, D-Keys, former state representative and minority leader, Oct. 24, 2014", "Interview, State Rep. Holly Raschein, R-Key Largo, Oct. 27, 2014", "Interview, Ron Book, lobbyist for Marathon, Oct. 27, 2014", "Interview, Chris Bergh, South Florida Conservation Director for The Nature Conservancy, Oct. 28, 2014", "Interview, Jeff Chanton, Florida State University oceanography professor, Oct. 28, 2014", "Interview, Harold R. Wanless, chairman and a professor in the Department of Geological Sciences at University of Miami, Oct. 27, 2014", "Interview, Roman Gastesi Jr., Monroe County Administrator, Oct. 23, 2014", "Interview, Nannette Rodriguez, Miami Beach spokeswoman, Oct. 28, 2014", "Interview, Miguel Ascarrunz, Director of Broward’s Emergency Management Division, Oct. 28, 2014", "Interview, Luis Espinoza, Communications Program Manager Miami-Dade Regulatory and Economic Resources Department Environmental Resources Management, Oct. 24, 2014", "Interview, John Tupps, Gov. Rick Scott spokesman, Oct. 28, 2014", "Interview, Jackie Schutz, Gov. Rick Scott campaign spokeswoman, Oct. 22, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]