["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Florida Agriculture Commissioner Adam Putnam announced for governor at the old Polk County Courthouse in Bartow May 10, 2017. (Tampa Bay Times)", "Florida Agriculture Commissioner Adam Putnam asked his Twitter followers if voting practices in San Francisco and Takoma Park, Md., are fair to American citizens since they allow noncitizens to participate.", "\"San Fran & Takoma Park have been overrun by liberals. They’re allowing illegals to vote. Is this fair to Americans?\" Putnam, a Republican who is running for governor, tweeted Aug. 30.", "San Fran & Takoma Park have been overrun by liberals. They’re allowing illegals to vote. Is this fair to Americans? https://t.co/Q1YkvZ1sXJ", "Putnam’s tweet caught our attention given the broader false claims from President Donald Trump and others that millions of immigrants in the country illegally fraudulently voted in the 2016 presidential election.", "Was Putnam correct about San Francisco and Takoma Park \"allowing illegals to vote\"?", "Starting in the 2018 November elections, noncitizens in San Francisco will be allowed to vote for board of education members. Takoma Park in 1992 adopted a measure permitting noncitizens to vote in city elections. But noncitizens in those cities cannot vote in other elections, a notable distinction not clear in Putnam’s tweet.", "In the November 2016 election, San Francisco voted in favor of Proposition N, which asked if the city should allow noncitizen residents of San Francisco who are of legal voting age, not in prison or on parole for a felony conviction, and the parent, legal guardian or legally recognized caregiver of a child living in the San Francisco Unified School District to vote for Board of Education members.", "The approved measure is set to apply to the elections in 2018, 2020 and 2022. It’s slated to expire after the 2022 election unless it’s extended by ordinance, according to the San Francisco Department of Elections.", "The San Francisco elections department did not provide comment in reaction to Putnam’s tweet, but Takoma Park told us his message was a \"mischaracterization\" of its voting policy.", "\"It's clear that Mr. Putnam's social media posts were sent to cause a knee-jerk reaction and fails to accurately describe what our City Charter does,\" said Jeremy Dickey, Takoma Park city spokesman. \"He chose not to attack the fact that Takoma Park also allows 16-year-olds to vote, because that would not have fit his narrative.\"", "A charter amendment resolution adopted in 1992 removed the citizenship requirement for voting in Takoma Park for the election of the city’s mayor and six council members, Dickey said.", "\"Takoma Park strives to be a welcoming community for all, and that means allowing people who live in our City to have their voices heard, regardless of citizenship status,\" Dickey added.", "But the right doesn’t extend to federal office. The Illegal Immigration Reform and Immigrant Responsibility Act of 1996 states it’s unlawful for noncitizens to vote for candidates seeking federal offices, such as the presidency or a seat in Congress. But it’s not illegal for noncitizens to vote for local offices if it’s allowed by a state constitution, statute or local ordinance.", "We asked voting and elections experts for feedback on Putnam’s claim. They said his message left the impression that noncitizens are allowed to vote in all types of elections.", "Voting rights granted to noncitizens in Takoma Park and San Francisco \"are limited to local office, not a blanket right to vote for all governmental offices,\" said Lorraine Minnite, a political science professor at Rutgers University who wrote The Myth of Voter Fraud.", "\"These cities are allowing noncitizens to vote in elections, but the lack of clarity about which elections is misleading and in context with Trump's unsubstantiated claims of millions of illegal votes in the presidential election, Putnam's overly broad claim creates confusion and detracts from the ability for the public to assess whether noncitizens should be given limited voting access,\" said Rachel Bitecofer, assistant director of the Wason Center for Public Policy at Christopher Newport University.", "The replies to Putnam’s post show the confusion among some people who saw it.", "\"Per Constitution only citizens can vote,\" one person responded.", "\"Illegal Voting?  If allowed, we lose all form of control in this country. Let's let taxpayers vote.  Become Legal & Vote,\" wrote another.", "Even though some localities allow noncitizens to vote in local elections, noncitizen voting in the United States is rare, said Alan Abramowitz, an Emory University political scientist.", "And the actual number of noncitizens who vote in local elections is relatively small, said Joshua A. Douglas, a law professor at the University of Kentucky College of Law who specializes in election law and voting rights. Douglas wrote an op-ed for the Washington Post noting that noncitizen voting has a storied history in America and used to be more commonplace than it is now.", "\"The intent of these new laws is not to allow illegal aliens to vote but to give legal noncitizens, also called legal permanent residents, a say in local affairs,\" Douglas said. \"In fact, even if the text of the law technically allows illegal aliens to vote, it seems highly unlikely that they would register with the city (thereby giving government officials precise info on their citizenship status) so as to vote.\"", "It's worth noting that a noncitizen isn't just someone who is in the country illegally. That classification also extends to individuals who are in the country on visas or who are lawful permanent residents.", "Putnam’s tweet was expanded on in an op-ed published by multiple Florida publications, his website also posted the op-ed and a link to it was posted on Facebook and Twitter before the tweet about San Francisco and Takoma Park, his office said.", "The tweet about San Francisco and Takoma Park did not include a link to the editorial, but to a form and poll on Putnam’s website that required individuals to submit their email address along with a \"No\" or \"Yes\" answer to the question \"Should Illegal Immigrants Be Allowed To Vote?\" Politicians use polls like these to collect personal information about voters to target with advertising, or to raise funds.", "Putnam’s op-ed said voting is an American right that must be protected and \"not minimize the value of it by allowing noncitizens the same right.\" It criticizes so-called sanctuary cities and adds that some cities \"have taken it a step further.\"", "\"Not only are they allowing violent illegal aliens to remain within their boundaries without the threat of getting caught, but some cities are going so far as to grant illegal aliens the right to vote in America,\" said the Aug. 29 op-ed.", "Cities like San Francisco and College Park, Md., \"have lost their American values, and have been overrun by liberals. They have forgotten the principles our nation was founded on – the right for American citizens to choose our leaders – in granting foreigners who violated our laws to come to our country the right to shape our country’s future through voting,\" Putnam wrote.", "College Park was still considering the issue when Putnam's editorial published. (College Park officials initially said the measure passed, but they later clarified that it actually failed. They said it did not receive the necessary number of affirmative votes as required by state law.)", "National media outlets have reported on a \"growing trend of liberal cities, including Takoma Park and San Francisco, allowing illegal immigrants to vote,\" said Amanda Bevis, spokeswoman for Putnam.", "\"Adam Putnam will not let that happen in Florida. Illegal immigrants violated our laws to come to America, and these cities are granting those very people the right to vote,\" Bevis added. \"The actions by these cities completely undermine the value of voting in America that so many others work so hard to earn.\"", "Putnam said, San Francisco and Takoma Park are \"allowing illegals to vote.\"", "In the November 2016 elections, San Francisco voted to allow noncitizens to vote for board of education members starting in the 2018 election. Takoma Park adopted a measure in 1992 to allow noncitizens to vote for mayor and city council members. Neither of the measures allow noncitizens to vote for candidates seeking other offices. Federal law allows noncitizens to vote in local elections if their municipalities allow it.", "Putnam's tweet leaves the impression that the cities give noncitizens broader voting power and that’s not the case. We rate it Half True.", "Twitter, @adamputnam: tweet Aug. 30, 2017, tweet, Aug. 29, 2017", "Email exchange, Amanda Bevis, spokeswoman for Adam Putnam, Aug. 31-Sept. 8, 2017", "AdamPutnam.com, Sanctuary cities, voting rights for illegal aliens wrong for U.S., Aug. 29, 2017", "AdamPutnam.com, Should Illegal Immigrants Be Allowed To Vote?", "FloridaPolitics.com, Adam Putnam: The right to vote, Aug. 29, 2017", "News-Press.com, Sanctuary cities, voting rights for illegal aliens wrong for U.S., Aug. 29, 2017", "Sunshine State News, The Right to Vote, Aug. 30, 2017", "Jacksonville.com, Thursday Lead Letter: Illegal aliens should not have the right to vote, Aug. 30, 2017", "City of Takoma Park, Register to vote", "City of College Park, Md., City council agenda for Sept. 12, 2017", "New York Times, California Measure N — San Francisco Vote School Board— Results: \"Yes\" in the Lead, Aug. 1, 2017", "San Francisco Department of Elections, Proposition N information", "Twitter, @nayartlatin tweet Aug. 30, 2017, @CounterEffectsC tweet Aug. 31, 2017", "Email interview, Joshua A. Douglas, a law professor at the University of Kentucky College of Law, Aug. 31, 2017", "Email interview, Rachel Bitecofer, assistant director of the Wason Center for Public Policy at Christopher Newport University, Sept. 2, 2017", "Email interview, Alan Abramowitz, an Emory University political scientist, Aug. 31, 2017", "Email interview, Lorraine Minnite, a political science professor at Rutgers University, Sept. 1, 2017", "Email interview, Jeremy Dickey, Takoma Park city spokesman, Aug. 31, 2017", "Email exchange, San Francisco Department of Elections office, Aug. 31, 2017", "Washington Post, Noncitizens are gaining the right to vote. Good., Aug. 18, 2017", "PolitiFact, Trump-O-Meter: Cancel all funding of sanctuary cities, last updated June 29, 2017", "PolitiFact, Donald Trump's Pants on Fire claim that millions of illegal votes cost him popular vote victory, Nov. 28, 2016", "PolitiFact, Welcome, Anthony Scaramucci! Here's some research on illegal voting, July 21, 2017", "Department of Homeland Security, Lawful Permanent Residents (LPR), last published Aug. 4, 2017", "U.S. Citizenship and Immigration Services, Illegal Immigration Reform and Immigrant Responsibility Act of 1996, accessed Sept. 12, 2017", "Washington Examiner, College Park, Maryland will allow non-citizens to vote in local elections, Sept. 12, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]