["The video was posted here on Facebook on March 24, 2020. It has been viewed more than 3,400 times.", "The 58-second video shows uniformed police officers confronting a crowd of people on a beach.", "Below is a screenshot of the misleading Facebook post:", "The video caption, written in simplified Chinese, translates to English as: “Hong Kong's black-clad rioters open your eyes widely and see the United States you flatter, the scene of US police driving away people on the Miami beach!”", "Hong Kong has experienced months of violent pro-democracy protests since June 2019. Here is an AFP report about the unrest.", "The video, and shorter versions of it, have also been shared here on Facebook, here and here on Twitter, alongside a similar claim.", "It was also viewed tens of thousands of times here on Twitter and here and here on YouTube, published alongside a claim that it shows Brazilian police enforcing social distancing orders during the novel coronavirus pandemic.", "The claims are false.", "A reverse image search and a subsequent keyword search found an identical video published in this March 11, 2019 article by the Brazilian news website topelegance.com.", "The Portuguese headline translates to English as: “VIDEO: Game ends with a fight, shots and five injured police officers”.", "It was published alongside a longer version of the video in the misleading posts. The same clip can be seen from the nine-second mark to the one-minute eight-second mark.", "Below is a screenshot of the topelegance.com report:", "The report reads, in part: \"A beach soccer championship held at Itapema beach that aimed to bring fun and interaction to participants and fans ended in a fight. The Military Police were at the scene and had to use force, rubber bullets and stun grenades.", "“In a note, the Military Police states that the police were at the scene carrying out preventive policing in the competition, when fans started the disorder. The Military Police also states that the fans attacked the police by throwing glass bottles, launching rockets towards the officers and damaging three vehicles.", "The incident was also reported by another local media, including the news websites Santa Catarina News, NSC Total and Diarinho.", "Closer examination of the video also revealed an identifiable food stall. Below is a screenshot of the video, with the stall circled red by AFP.", "The location of the incident can be seen on Google Maps in the Brazilian city of Itapema.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]