["About this rating", "During the debate, Trump was repeatedly asked and invited to explicitly and clearly condemn white supremacists, and he did not do that.", "Trump did not verbally articulate that he was unwilling to condemn white supremacists, or would not do so, and in fact said, \"Sure, I'm willing to do that.\"", "Voting in the 2020 U.S. Election may be over, but the misinformation keeps on ticking. Never stop fact-checking. Follow our post-election coverage here.", "One of the biggest talking points to emerge after the first presidential debate between U.S. President Donald Trump and former Vice President Joe Biden in September 2020 was the claim that Trump had \"refused to condemn white supremacists\" when invited to do so.", "On CNN, political commentator Van Jones emphatically made the argument that Trump had \"refused to condemn white supremacy,\" stating:", "Only three things happened, for me, tonight: Number one, Donald Trump refused to condemn white supremacy. Number two, the president of the United States refused to condemn white supremacy. Number three, the commander-in-chief refused to condemn white supremacy on the global stage, in front of my children, in front of everybody's families. And he was given the opportunity multiple times to condemn white supremacy, and he gave a wink and a nod to a racist, Nazi, murderous organization that is now celebrating online, that is now saying \"We have a go-ahead.\" Look at what they're saying, look at what the Proud Boys are doing right now online, because the president of the United States refused to condemn white supremacy.", "Similarly, U.S. Sen. Amy Klobuchar, D-Minn., wrote on Twitter that Trump had \"refused to condemn white supremacism,\" and Biden himself wrote on Twitter that \"the President of the United States refused to disavow white supremacists on the debate stage last night.\"", "This is a complicated claim to disentangle and largely revolves around the sense of the word \"refuse.\" During the Sept. 29 debate, Fox News moderator Chris Wallace and Biden repeatedly urged, asked, and invited Trump to condemn white supremacist and right-wing militia groups. Remarkably, Trump did not do that. When an adult person is repeatedly asked to do something, and clearly hears and understands the requests, but doesn't do it, a reasonable argument can be made that that person has \"refused\" to do what they were asked to do.", "On the other hand, Trump did not verbally articulate an unwillingness to condemn white supremacists, which is often an important component of \"refusing\" to do something, as opposed to simply not doing it. For example, he did not say \"No\" or \"I won't do that.\" On the contrary, at least not in a clear manner. As a result of these mutually contradictory elements of Trump's remarks during that moment in the debate, we are issuing a rating of \"Mixture.\"", "The discussion in question came around 65 minutes into the Sept. 29 debate at the Cleveland Clinic in Ohio. In order to provide as much relevant context as possible, the following is a transcript of the exchange, which can be watched below:", "Wallace: [Addressing Trump] ...You have repeatedly criticized the vice president [Biden] for not calling out Antifa and other left-wing extremist groups —\nTrump: That's right\nWallace: — but are you willing, tonight, to condemn white supremacist and militia groups —\nTrump: Sure\nWallace: — and to say that they need to stand down and not add to the violence in a number of these cities, as we saw in Kenosha, and as we've seen in Portland?\nTrump: Sure, I'm willing to do that but —\nWallace: — Are you prepared to specifically —\nBiden: Well do it\nWallace: Go ahead then. \nTrump: — I would say, I would say almost everything I see is from the left wing, not from the right wing —\nWallace: So what do you, what are you saying?\nTrump: I'm willing to do anything, I want to see peace —\nWallace: Then do it, Sir —\nBiden: Say it. Do it. Say it.\nTrump: Do you want to call them, what do you want to call them? Give me name, give me a name, go ahead —\nWallace: White supremacists and right-wing —\nTrump: Who do you want me to condemn? Who?\nBiden: The Proud Boys\nWallace: White supremacists and right-wing militias\nTrump: The Proud Boys? Stand back and stand by, but I'll tell you what, I'll tell you what, somebody's got to do something about Antifa and the Left...", "When asked to condemn \"white supremacists and right-wing militia groups,\" Trump verbally articulated a willingness to do so (\"Sure, I'm willing to do that\"), but also prevaricated, delayed, and bristled at the request, for example asking \"Who do you want me to condemn?\" when the terms of the request had already been made clear, and saying \"Give me a name, go ahead.\" He also swiftly shifted focus from white supremacists (the subject of the moderator's question to him) to a condemnation of \"the left wing.\"", "While it can be argued that Trump did not unequivocally refuse to condemn white supremacists, he undoubtedly demonstrated a reluctance to do so, one that will be very worrying to many voters. When Trump ultimately got around to issuing his version of the condemnation requested by Wallace and Biden, it was shrouded in ambiguity (\"Proud Boys? Stand back and stand by\") and followed by another rapid shift in focus to \"antifa and the Left.\" Whatever Trump did say, he did not condemn white supremacists.", "The Proud Boys are a right-wing organization whose members have at various times articulated anti-Semitic, racist, white supremacist, homophobic, misogynistic, and Islamophobic views, as well as at times associating with more extremist right-wing figures and groups. The Anti-Defamation League describes the group as follows:", "Easily recognizable, thanks to their black and yellow Fred Perry polo shirts and red Make America Great Again baseball caps, members are regulars at far-right demonstrations and Trump rallies. After several years of forging alliances with members of the Republican political establishment, the Proud Boys have carved out a niche for themselves as both a right-wing fight club and a volunteer security force for the GOP.", "Despite their associations with mainstream politicians, Proud Boys' actions and statements repeatedly land them in the company of white supremacists and right-wing extremists. Jason Kessler, the primary organizer of the deadly 2017 Unite the Right Rally in Charlottesville, is a former Proud Boy. Several members attended the violent August 12, 2017 demonstration that ended in the death of counter-protestor Heather Heyer.", "Trump's \"Stand back\" could appropriately be interpreted as an instruction to temporarily desist from activities, while \"stand by\" suggests an instruction to get prepared to take action. That's how at least some prominent Proud Boys received and interpreted the latter instruction. As The New York Times' Mike Baker documented, several Proud Boys expressed delight at Trump's remarks on the social networking site Parler, with one writing \"President Trump told the Proud Boys to stand by because someone needs to deal with Antifa...Well Sir! We're ready!\" Another wrote, \"Standing by, Sir.\"", "Snopes asked the White House and Trump campaign what the president meant by \"stand back and stand by\" and whether he actually meant to say \"stand down,\" a phrase suggested to Trump by Wallace earlier in the exchange. We did not receive a response from either.", "On Sept. 30, the day after the debate, Trump told reporters that he didn't know who the Proud Boys were, but \"whoever they are, they have to stand down, let law enforcement do their work.\" Asked whether he denounced white supremacists, Trump said, without specificity, \"I've always denounced any form, any form, any form of any of that.\"", "Trump hasn't always condemned white supremacists — for example, he did not do so just hours earlier, despite being repeatedly asked to, in front of an international television audience — but he has spoken of them in condemnatory terms in the past.", "In August 2017, Trump was widely criticized for saying there were \"very fine people on both sides\" of clashes between neo-Nazi, white supremacist, and pro-Confederate monument demonstrators, and anti-racist counter-protesters (including some antifa activists) in Charlottesville, Virginia. Those clashes came to a head when James Alex Fields, an Ohio man with ties to the American far right, murdered anti-racism activist Heather Heyer by striking her with the car he was driving.", "During an Aug. 14, 2017, briefing, Trump said:", "We condemn in the strongest possible terms this egregious display of hatred, bigotry, and violence.  It has no place in America...No matter the color of our skin, we all live under the same laws, we all salute the same great flag, and we are all made by the same almighty God.  We must love each other, show affection for each other, and unite together in condemnation of hatred, bigotry, and violence.  We must rediscover the bonds of love and loyalty that bring us together as Americans. Racism is evil.  And those who cause violence in its name are criminals and thugs, including the KKK, neo-Nazis, white supremacists, and other hate groups that are repugnant to everything we hold dear as Americans.", "During an Aug. 15, 2017, press conference, Trump said his earlier reference to \"very fine people\" pertained to demonstrators who are in favor of preserving Confederate monuments rather than removing them, and he added: \"I'm not talking about the neo-Nazis and the white nationalists, because they should be condemned totally.\"", "In August 2019, Trump condemned \"racism, bigotry, and white supremacy\" after a mass shooting in El Paso, Texas, in which the suspect allegedly targeted those he perceived to be immigrants and had allegedly posted a far-right, anti-Hispanic and white supremacist manifesto. Speaking from the White House, Trump said:", "\"The shooter in El Paso posted a manifesto online consumed by racist hate.  In one voice, our nation must condemn racism, bigotry, and white supremacy.  These sinister ideologies must be defeated.  Hate has no place in America.  Hatred warps the mind, ravages the heart, and devours the soul.  We have asked the FBI to identify all further resources they need to investigate and disrupt hate crimes and domestic terrorism — whatever they need.\"", "Two weeks after the first presidential debate in 2020, Trump again condemned white supremacists. During an Oct. 15 town hall event in Miami, Florida, NBC News anchor Savannah Guthrie confronted the president with his remarks at the debate. Trump again bristled at the question, but said \"Are you listening? I denounce white supremacy. What's your next question?\"", "Anti-Defamation League.   \"Proud Boys.\"\r\n    Accessed 30 September 2020.", "Lemire, Jonathan and Julie Pace.   \"Defiant Trump Insists Anew: Blame Both Sides for Violence.\"\r\n    The Associated Press.  16 August 2017.", "Attanasio, Cedar; Bleiberg, Jake; Weber, Paul J.  \"Police: El Paso Shooting Suspect Said He Targeted Mexicans.\"\r\n    The Associated Press.  10 August 2019.", "[Updated] 20 October 2020: Added reference to Trump's remarks at Oct. 15, 2020 NBC News town hall in Miami, Florida.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]