["When he was a real estate developer, Donald Trump helped raise funds and donated at least $200,000 to organizers of the 1995 Veterans Day parade in New York City.", "While he didn’t finance the parade on his own, he is credited by organizers for saving the event, which had drawn zero contributions from corporations at the time of his donation.", "A post circulating on Facebook claims that when President Donald Trump was a real estate developer, he paid for the 1995 Veterans Day parade in New York City after the city refused to fund the event.", "The post reads: \"Almost 26 years ago, NYC refused to fund the Veterans Day parade. Donald Trump financed it!\"", "This is somewhat accurate, but it exaggerates Trump’s contribution and misstates the city’s role.", "Trump has been credited by organizers for saving the parade, but the post exaggerates the extent of Trump’s monetary contribution and appears to misstate the city’s role.", "We found no evidence that the city of New York refused to pay for the event, which was put on by a private, nonprofit organization. A search of news archives and databases turned up no dispute between the city and parade organizers over funds for the event, and then-mayor Rudy Giuliani expressed dismay over the lack of support for the parade.", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "News stories at the time reported that Trump donated $200,000 to the event and helped raise another $300,000.", "We reached out to the United War Veterans Council, the organization that hosted the event, for more details but did not hear back.", "In a 2016 interview with CNN, the organization’s parade organizer, Vincent McGowan, put Trump’s donation amount somewhere between $325,000 and $375,000, but said it wasn’t $1 million, which is what Trump’s campaign website said.", "In 1995, Tom Fox, the parade director at the time, credited Trump with the parade’s success.", "\"Donald Trump saved the parade,\" Fox was quoted saying. \"We had asked for donations from 200 corporations, and none of them came through.\"", "Before the event, the New York Times reported that Trump was given the honor of serving as grand marshal for the event in exchange for his contributions, and put the total cost of the parade at about $2.4 million. (McGowan told CNN in that same 2016 interview that Trump was never grand marshal because he’s not a veteran, but the Times reported that he was in a follow-up story published a day after the parade.)", "Trump didn’t fund the entire event. And while the post seems to be wrong on the city’s involvement, it does appear that Trump’s contribution and efforts enabled the parade to go on as planned. We rate this Mostly True.", "Facebook post, Sept. 9, 2020", "UPI archive, More than 500,000 watch Nation's Parade, Nov. 11, 1995", "New York Times archive, Veterans Day Parade Tries for a Comeback, Nov. 10, 1995", "NY Daily News archive, Donald sounds charge for march, Nov. 12, 1995", "CNN, Trump will give $1 million to Marine charity, but there are other discrepancies, May 25, 2016", "New York Times archive, On Parade To the Beat Of History, Nov. 12, 1995", "Snopes, Donald Trump \"saved\" the Veterans Day parade in New York City in 1995, Nov. 13, 2019", "FactCheck.org, Donald Trump and New York’s Veterans Day Parade, Nov. 15, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]