["About this rating", "The day after Donald Trump's inauguration on 20 January 2017, millions of women marched in protest in Washington D.C. and cities around the world. As photographs of the event made their way around the internet, an image appeared purportedly showing a plane flying a banner reading \"Where's My Damn Dinner?\" over the crowd:", "This image took another lap around the internet in January 2018 after a second Women's March took place in cities across the country. Many overtly misogynist web sites shared this image, including Return of the Kings, which chided protesters for lacking proper cooking skills, and Chateau Heartiste, which called the pilot the \"Alpha Male of the Month.\" But the image also spread to a seemingly neutral outlet, appearing in the The Irish Times article \"The best signs from the 2018 Women's March.\" The Irish newspaper appears to have pulled the image from a Twitter account labeled #parody that has posted sexist and racist memes.", "This image is not a genuine photograph, it did not originate in 2018, and this \"alpha\" pilot is completely fictional.", "This is a composite of two different images: One showing a group of protesters holding various signs beneath an empty blue sky, and a second showing a plane towing a banner. Madeline Bills took the photograph of the crowd at the 2017 Boston Women's March. The image of the plane comes from a PhotoFunia template that allows users to create their own plane banners in a few short clicks:", "Here's a look at the original photograph from the Women's March (left) and the plane banner that was created with PhotoFunia:", "It is also worth considering that the concept of the domineering \"alpha male\" is based on incomplete science, has been questioned more and more since the phrase entered the popular lexicon in the 1980s via primate research, and in fact may simply be nothing more than an urban legend that endures through a combination of a shoddy understanding of pack behavior and wishful thinking.", "Waddell, Kaveh.   \"The Exhausting Work of Tallying America's Largest Protest.\"\r\n    The Atlantic.   23 January 2017.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]