["The video was posted here on YouTube on December 8, 2020.", "The video’s caption, written in a mix of Turkish and English, reads in part: “BREAKING: FDA announces 2 deaths of Pfizer vaccine trial participants from ‘serious adverse events'”.", "At the video’s 12-second mark, a man says: “Just reporting live on a breaking story that I think needs attention, and that is coming from the Jerusalem Post. We have an article released just a few minutes ago. And basically the title is, ‘FDA announces deaths of 2 Pfizer vaccine trial participants.’”", "At the video's 55-second mark, the man presents on screen what appears to be an FDA document before stating: “Basically, two participants under the section in the FDA document, which I will show you here were found to have died as a result of the vaccine intervention.”", "The claim circulated online shortly before the FDA approved emergency use of the Pfizer-BioNTech Covid-19 vaccine, AFP reported.", "The misleading video appears to have been taken from this longer YouTube video, which was viewed more than 15,000 times before it was deleted.", "The longer video, which makes identical claims, was also shared here, here, here and here on Facebook.", "A similar claim circulated online here and here in Portuguese, as well as here and here in Spanish.", "The claim is misleading.", "The FDA document and The Jerusalem Post article referenced in the misleading video have been misrepresented.", "Government document", "The December 10, 2020 FDA report states that six people -- \"2 vaccine, 4 placebo\" -- died during trials, but not as a result of receiving the vaccine.", "It states, in part: “A total of six (2 vaccine, 4 placebo) of 43,448 enrolled participants (0.01%) died during the reporting period from April 29, 2020 (first participant, first visit) to November 14, 2020 (cutoff date). Both vaccine recipients were >55 years of age; one experienced a cardiac arrest 62 days after vaccination #2 and died 3 days later, and the other died from arteriosclerosis 3 days after vaccination #1.", "“All deaths represent events that occur in the general population of the age groups where they occurred, at a similar rate.”", "A longer version of the briefing document, also uploaded here on the FDA website, states: \"None of these deaths were assessed by the investigator as related to study intervention.\"", "News article", "The Jerusalem Post article, published here on December 8, 2020, echoes the FDA report.", "It reads, in part: “(Israel’s Midaat Association) noted that in large trials of tens of thousands of people, death can occur without any connection to the trial, but that companies such as Pfizer are required to report those deaths.", "“‘According to the published data, six of the participants in the experiment died, two of whom received the vaccine and four of the control group,’ said Dr. Uri Lerner, the scientific director for Midaat. ‘After an in-depth examination, no connection was found between the experiment and the cause of death.’”", "AFP Fact Check has debunked other false claims about Pfizer-BioNTech’s Covid-19 vaccine here and here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]