["About this rating", "Immanuel Christian School requires would-be employees to affirm in writing that they will not engage in homosexual sexual acts or have a transgender identity. It also reserves the right to refuse to admit or to expel students if those students or their parents support, condone, promote or engage in homosexual sexual acts, a rule that could reasonably be interpreted as banning openly lesbian, gay or bisexual parents or students.", "The school does not explicitly bar gay, lesbian or bisexual persons from teaching there, but rather states that homosexual sexual acts (as opposed to same-sex preferences) are considered unacceptable \"moral misconduct.\"", "It is a matter of subjective personal opinion, rather than objective fact, whether the ban on teachers' engaging in homosexual sexual acts is tantamount to a de facto ban on gay, lesbian and bisexual teachers.", "In January 2019, Second Lady Karen Pence faced widespread criticism after the White House announced she had taken a job as a part-time art teacher at a Christian school in Northern Virginia, an institution that, according to some news reports, bars LGBT teachers, staff and students.", "A White House press release announced that Pence -- wife of Vice President Mike Pence -- had returned to the K-8 elementary school where she worked from 2001 to 2013 while her husband was a U.S. Representative for the 2nd and 6th Congressional Districts of Indiana:", "\"Today, Karen Pence is back in the classroom, not as the Second Lady of the United States, but as Mrs. Pence to teach art classes for children at an elementary school in Northern Virginia.  Mrs. Pence will teach twice a week at Immanuel Christian School until May. Mrs. Pence accepted this wonderful opportunity to teach art in early December 2018. 'I am excited to be back in the classroom and doing what I love to do, which is to teach art to elementary students,' said Mrs. Pence. 'I have missed teaching art, and it’s great to return to the school where I taught art for twelve years.”'", "The announcement quickly received negative press due to requirements that Immanuel Christian School places on would-be employees and parents of would-be students. The Huffington Post published an article with the headline \"Karen Pence is Working at a School That Bans LGBTQ Employees and Kids.\" The article read:", "\"Karen Pence, wife of Vice President Mike Pence, started at a job this week teaching art at Immanuel Christian School in Northern Virginia. It’s not a school where everyone is welcome. In a “parent agreement” posted online, the school says it will refuse admission to students who participate in or condone homosexual activity, HuffPost learned through an investigation into discriminatory admissions policies. The 2018 employment application also makes candidates sign a pledge not to engage in homosexual activity or violate the 'unique roles of male and female.'\"", "The New York Times' headline was \"Karen Pence Is Teaching at Christian School That Bars L.G.B.T. Students and Teachers,\" an ABC News report carried the headline \"Second lady Karen Pence to teach at school with ban against LGBT students, parents and teachers,\" Yahoo! News reported \"Karen Pence works at school that bans homosexuality\" and CNN reported that the school \"bans gay students and parents.\" Salon.com and the Daily Beast published similar articles, which also averred that the school barred LGBT employees and students.", "At the heart of these claims were two documents posted on the website of the school, which is in Springfield, Virginia, about 12 miles southwest of downtown Washington, D.C. and is closely affiliated with Immanuel Bible Church.", "The first document is the employment application required of anyone applying for a job as a teacher, teaching assistant or substitute teacher at the school. As part of that application, would-be staff are required to sign and initial each of 13 \"articles of employment.\" The document prefaces those articles with the following introduction:", "\"Immanuel Christian School is a non-profit religious educational organization and is supported as a ministry of Immanuel Bible Church. More importantly, our school is a community of believers who have joined together to meet the spiritual and academic needs of our community, representing Jesus Christ. Our school promotes behavior consistent with the Holy Scriptures. Consequently, when joining Immanuel Christian School, you freely and willingly agree to the standards of behavior outlined in this policy. The standards included in the policy are not exhaustive; rather, they provide a guideline of conduct we believe is in accordance with biblical standards. Please read, initial each item, and sign as indicated.\"", "Would-be teachers are required to affirm that they are born-again Christians, that they are or will become active members of a local \"theologically conservative\" church, that they will avoid \"careless speech and actions\" (for example in social media postings) and that they will in general act in a way that upholds and promotes the conservative, Christian, biblically founded mission and values of the school.", "Article 8 goes into specific details about behaviors that are not permitted of would-be employees, and outlines examples of what school authorities regard as prohibited \"moral misconduct.\" This is the section of the employment application that caused widespread controversy in January 2019:", "I will strive to live a personal life of moral purity that is separated from the world according to Scriptures, as defined by the Statement of Faith of Immanuel Bible Church and agreed upon by the Elders and Pastors of Immanuel Bible Church. I understand that the term “marriage” has only one meaning; the uniting of one man and one woman in a single, exclusive covenant union as delineated in Scripture and that God intends sexual intimacy to occur only between a man and a woman who are married to each other and that God has commanded that no intimate sexual activity is engaged in outside of marriage between a man and a woman.", "Further, I will maintain a lifestyle based on biblical standards of moral conduct. Moral misconduct which violates the bona fide occupational qualifications for employees includes, but is not limited to, such behaviors as the following: heterosexual activity outside of marriage (e.g., premarital sex, cohabitation, extramarital sex), homosexual or lesbian sexual activity, polygamy, transgender identity, any other violation of the unique roles of male and female, sexual harassment, use or viewing of pornographic material or websites, and sexual abuse or improprieties toward minors as defined by Scripture and federal or state law.", "So in order to be considered as a potential employee of Immanuel Christian School, an applicant must sign a personal commitment not to engage in homosexual sexual activity, \"transgender identity\" or \"any other violation of the unique roles of male and female.\" The document does not explicitly prohibit teachers from being gay, lesbian or bisexual (or prohibit individuals who are gay, lesbian or bisexual from teaching at the school) as such, but rather it prohibits them from engaging in homosexual sexual activity.", "This appears to be in keeping with a widespread position, common to many Christian denominations, that persons with same-sex sexual preferences ought not to be condemned or excluded on the basis of those preferences alone, but only on the condition that they strictly exercise chastity, and refrain from publicly identifying as gay, lesbian or bisexual or engaging in same-sex and extra-marital relationships or sexual activity.", "It is a point of considerable philosophical dispute -- and beyond the scope of a fact check -- whether barring gay, lesbian and bisexual individuals from giving full expression to their sexual identities and orientations while being members of a church, for example, or teaching at a school, is itself tantamount to effectively barring gay, lesbian and bisexual individuals from those organizations.", "For example, Dignity USA, a group that advocates inclusion and participation for LGBTQI Catholics, defines its viewpoint in the following way:", "We believe that gay, lesbian, bisexual, transgender, queer and intersex Catholics in our diversity are members of Christ's mystical body, numbered among the People of God. We have an inherent dignity because God created us, Christ died for us, and the Holy Spirit sanctified us in Baptism, making us temples of the Spirit, and channels through which God's love becomes visible. Because of this, it is our right, our privilege, and our duty to live the sacramental life of the Church, so that we might become more powerful instruments of God's love working among all people.", "We believe that gay, lesbian, bisexual, transgender, queer and intersex persons can express their sexuality and gender identities and expressions in a manner that is consonant with Christ's teaching. We believe that we can express our sexuality physically, in a unitive manner that is loving, life-giving, and life-affirming. We believe that all sexuality should be exercised in an ethically responsible and unselfish way. We believe that our transgender and queer communities can express their core identities in a sincere, affirming and authentic manner.", "By contrast, the official position of the Catholic church (as articulated in the Catechism) is that homosexual sexual acts are \"intrinsically disordered\" and \"contrary to the natural law\" but that homosexual persons \"must be accepted with respect, compassion, and sensitivity\" on the condition that they exercise chastity.", "Article 8 in Immanuel Christian School's articles of employment does specifically and explicitly designate \"transgender identity\" as a form of unacceptable moral misconduct. Unlike the ambiguity of the document's position towards homosexual persons (as opposed to homosexual sexual acts), this clearly amounts to a ban on transgender persons from working at the school as teachers, substitute teachers or teaching assistants.", "The second document at the heart of the January 2019 controversy over Karen Pence's employment at the school was a \"parent agreement,\" which parents of would-be students are required to \"support\" as part of the application process for being admitted to the school.", "It's not clear whether parents are required to sign the agreement before their child can be accepted for enrollment at the school, but the document prefaces the list of 15 commitments with the following statement: \"I agree that Immanuel Christian School should maintain its objective of thoroughly Christian education and should show evidence of that in policies for academic work, student behavior, and all relationships with students, employees, school families, churches, and the community. I will cooperate with Immanuel Christian School (ICS) in the following ways.\"", "The sixth of these commitments reads as follows:", "I understand the biblical role of Immanuel Christian School is to partner with families to encourage students to be imitators of Christ. This necessarily involves the school’s understanding and belief regarding biblical morality and standards of conduct. I understand that the school reserves the right, within its sole discretion, to refuse admission to an applicant or to discontinue enrollment of a student if the atmosphere or conduct within a particular home, the activities of a parent or guardian, or the activities of the student are counter to, or are in opposition to, the biblical lifestyle the school teaches. This includes, but is not limited to contumacious behavior, divisive conduct, and participating in, supporting, or condoning sexual immorality, homosexual activity or bi-sexual activity, promoting such practices, or being unable to support the moral principles of the school. (Lev. 20:13 and Romans 1:27.) I acknowledge the importance of a family culture based on biblical principles and embrace biblical family values such as a healthy marriage between one man and one woman. My role as spiritual mentor to my children will be taken seriously.", "So the school reserves the right to refuse to admit or to expel a student if either that student or their parents or guardians engage in, support, condone or promote homosexual or bisexual activity. Although this does not explicitly bar gay, lesbian or bisexual persons from attending the school or sending their children there, it could reasonably be regarded as an implicit ban on openly gay, lesbian or bisexual persons doing so.", "It is extremely difficult to imagine a scenario in which openly gay, lesbian or bisexual parents could, in good faith, present themselves to school authorities as upholding a requirement that they not support, condone, or promote homosexual or bisexual activity, especially if that activity is not regarded as limited to sexual acts, but rather includes same-sex relationships.", "Similarly, it is extremely difficult to imagine a scenario in which the parents of children who have openly expressed their own emerging or settled homosexual or bisexual orientation could, in good faith, present their children for attendance at the school while also committing to not support or condone homosexual or bisexual \"activity.\"", "Significantly, the document cites Chapter 20, Verse 13 of the book of Leviticus as the scriptural basis for its ban on the promotion or support of homosexual acts by parents or students. That verse famously reads: \"If a man has sexual relations with a man as one does with a woman, both of them have done what is detestable. They are to be put to death; their blood will be on their own heads.\"", "We asked the White House whether Karen Pence had signed and initialed all 13 of the \"articles of employment\" for Immanuel Christian School, including Article 8, and whether she regarded that document, along with the \"parent agreement,\" as amounting to a formal or de facto ban on LGBT staff, parents and students. We did not receive a response in time for publication.", "Similarly, we asked Immanuel Christian School whether the provisions of Article 8 in the articles of employment, taken together with the parent agreement, were intended to be a formal or de facto ban on LGBT staff, parents and students, but we did not receive a response in time for publication.", "The White House.  \"Statement -- Karen Pence Returns to the Classroom to Teach Art.\"\r\n  15 January 2019.", "Klein, Rebecca.  \"Karen Pence Is Working at a School That Bans LGBTQ Employees and Kids.\"\r\n  The Huffington Post.  15 January 2019.", "Haag, Matthew.  \"Karen Pence is Teaching at Christian School That Bars L.G.B.T. Students and Teachers.\"\r\n  The New York Times.  16 January 2019.", "Mallin, Alexander.  \"Second Lady Karen Pence to Teach at School With Ban Against LGBT Students, Parents and Teachers.\"\r\n  ABC News.  16 January 2019.", "Yahoo! News.  \"Karen Pence Works at School That Bans Homosexuality.\"\r\n  16 January 2019.", "CNN.  \"Karen Pence Teaching at School That Bans Gay Students.\"\r\n  16 January 2019.", "Leah, Rachel.  \"Yes, Karen Pence's Job at a Private School That Bans LGBTQ Students and Parents Matters.\"\r\n  Salon.com.  16 January 2019.", "The Daily Beast.  \"Karen Pence Works at School That Bans Gay Employees and Students.\"\r\n  15 January 2019.", "Immanuel Christian School.  \"Employment Application.\"\r\n  12 July 2017.", "Immanuel Christian School.  \"Parent Agreement.\"\r\n  29 October 2018.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]