["The president's falsehoods on El Paso crime continued, and he misled the crowd on the trade deficit and South Korea's contribution to U.S. military costs.", "By Lori Robertson, D'Angelo Gore, Robert Farley and Eugene Kiely", "Posted on February 14, 2019", "President Donald Trump made several claims in his Feb. 11 political rally in El Paso that distorted the facts, including:", "The president held a campaign rally in El Paso to again make his case for a border wall, as members of Congress debated a border security and spending bill to avoid another government shutdown. Both chambers are expected to vote on a measure today.", "Trump again repeated false claims about crime in El Paso before and after a border fence was built, adding some new twists to his talking points. But he also made misleading and false statements about the trade deficit and an agreement with South Korea on its contribution to the U.S. military presence there.", "The president left the false impression that the trade deficit had declined thanks to his efforts. In fact, the trade deficit has gone up under Trump.", "Trump, Feb. 11: And did you see the, you know, I haven’t been here very long, the trade deficit really went down very big this last month, and people are saying, “Whoa.” I told you so. That’s what I do. That’s what I do.", "That’s some serious spin. The trade deficit did go down in November, the most recent data available, but that came after the monthly deficit reached the highest point in 10 full years in October.", "Trump said he hasn’t “been here very long” and yet the deficit dropped “last month.” His audience cheered as he told them, “That’s what I do.” But the trade deficit has gone up in his two years in office. It’s up 20.3 percent for the 12 months ending in November, compared with 2016, the year before he took office.", "Even if the president wanted to focus solely on the November monthly figure, that too is up from November 2017, and 2016.", "These figures come from the Commerce Department’s Bureau of Economic Analysis. Its most recent report, released Feb. 6, said the November monthly goods and services trade deficit had dropped by $6.4 billion compared with October. However, it noted, “Year-to-date, the goods and services deficit increased $51.9 billion, or 10.4 percent, from the same period in 2017.”", "And 2017’s annual trade deficit ($552.3 billion) was up 10 percent from 2016 ($502 billion). So far, the trade deficit for the first 11 months of 2018 is just below the full 2017 figure — by a mere $13 million.", "Historical numbers from BEA show that the 2017 trade deficit was the highest since 2008, just edging out 2011, and 2018’s figure will easily top that.", "Trump suggested that, prior to 2019, South Korea was paying “$500 million a year” under a cost-sharing deal that helps fund American military forces in that country. That’s wrong.", "Trump, Feb. 11: I can only tell you this, we’re going to make great deals on trade. We’re going to make great deals on military. When we defend another nation that’s rich they have to help us out. Do we agree? They have to help us out. And they’re doing it. They’re doing it. You saw South Korea, they were paying us $500 million a year. I say you got to do more. You got to give more. Anyway. Now they’re up to almost $900 million.", "On Feb. 10, South Korea’s Ministry of Foreign Affairs announced that it had agreed (pending approval by its legislature) to contribute 1.039 trillion Korean won (or about $924 million in U.S. dollars) in 2019 as part of a new one-year “Special Measures Agreement” that helps to offset the cost of maintaining a U.S. military presence in South Korea.", "But the press release noted that was only an 8.2 percent increase from what South Korea paid in 2018 (which would have been 960 billion won) under a previous five-year deal approved in 2014 that expired at the end of last year. That earlier deal, which went into force in June 2014, called for South Korea to contribute 920 billion won in 2014 and then increase its annual payments at the rate of inflation. That worked out to “approximately $830 million per year,” according to Trump’s own State Department.", "Even the five-year deal before that one — agreed to in 2009 — had South Korea committing to contribute much more than $500 million a year. As the State Department said on Jan. 15, 2009: “In the agreement signed in Seoul today, the [Republic of Korea] will provide 760 billion won (approximately U.S. $691.5 million based on the 2008 average exchange rate) in 2009 and will increase the funding level in the subsequent years by the rise in the Consumer Price Index, with a maximum four-percent annual cap.”", "The Trump administration reportedly requested that South Korea increase its contribution for 2019 to as much as $1.6 billion, but South Korea would not agree to do so.", "In its “Strategic Digest” report for 2018, U.S. Forces Korea said that “South Korea reinforces the Alliance by funding approximately 41 percent of the day-to-day non-personnel stationing costs for USFK.” If its 2018 contribution of over $800 million was less than half of those costs, that suggests the Trump administration was seeking to have South Korea pay close to all of the non-personnel costs of hosting the U.S. military.", "In his visit to El Paso, the president doubled down on his false State of the Union claim that a border fence transformed the Texas city from one of the most dangerous cities in the country to one of the safest.", "We first wrote about the president’s bogus crime claims about El Paso when, during a speech in Louisiana on Jan. 14, he claimed El Paso went from “one of the most dangerous cities in the country to one of the safest cities in the country overnight” after “a wall was put up” along the Mexico border.", "As we wrote then, El Paso has never been “one of the most dangerous cities in the country.” The city had the third lowest violent crime rate among 35 U.S. cities with a population over 500,000 in 2005, 2006 and 2007 – before construction of 57 miles of fencing started in the El Paso sector in mid-2008. Nor was there an “overnight” drop in violent crime in El Paso after “a wall was put up.” In fact, the city’s violent crime rate increased 5.5 percent from 2007 to 2010 — the years before and after construction of the fence, which was completed in mid-2009. Those years were not anomalies. The violent crime rate increased about 9.6 percent between 2006 and 2011 — two years before the fence construction began and two years after it was finished.", "Along with the rest of the country, El Paso’s violent crime rate spiked in the early 1990s and has been trending downward ever since. The city’s violent crime rate dropped 62 percent from its peak in 1993 to 2007, a year before construction on the fence began. We pointed out the same facts when the president repeated the false talking point in his State of the Union address.", "At his rally in El Paso, Trump again took aim at media outlets, and the Republican mayor of El Paso, for noting that FBI crime statistics directly contradicted the president’s earlier claims.", "This time, however, the president argued the FBI data had been manipulated, masking the crime-reducing effectiveness of the fence.", "“Take a look at what they did with their past crimes and how they made them from very serious to much lesser,” the president said. Later, he said people ought to “look at how they recorded those past crimes, it went way, way down,” adding that there was an attempt to “pull the wool over everybody’s eyes.”", "Trump, Feb. 11: And I’ve been watching where they’ve been trying to say, “Oh, the wall didn’t make that much –” Well you take a look at what they did with their past crimes and how they made them from very serious to much lesser, you take a look at what the real system is. … And I don’t care whether a mayor is a Republican or a Democrat, they’re full of crap when they say it hasn’t made a big difference.", "I heard the same thing from the fake news. They said, “Oh, crime actually stayed the same.” It didn’t stay the same, it went way down. And look at what they did to their past crimes and look at how they recorded those past crimes, it went way, way down. These people, you know, you’d think they’d want to get to the bottom of a problem and solve a problem, not try and pull the wool over everybody’s eyes. So for those few people that are out there on television saying, “Oh, it didn’t make too much of a difference,” it made a tre– people from El Paso, am I right?", "Trump did not say who changed the way crime data was recorded, and he provided no evidence that it had changed. The El Paso police department also did not respond to our inquiries. But El Paso County Commissioner Carlos Leon, who served as the El Paso police chief for five years until 2003, called the president’s allegation “insulting.”", "“He made it seem like the numbers were doctored,” Leon said. “The numbers are black and white. That’s the way it was. … For the president to say the mayor and others are full of crap, that’s insulting. The numbers are what the numbers are. There is no such thing as doctoring those numbers.”", "And the numbers, he said, show that El Paso has long been a relatively safe city and that there was not a sharp decline in violent crime immediately after the fence went up.", "Over the years, there have been changes to the Uniform Crime Reporting system that the FBI uses to collect crime data. For example, hate crime was added in 1990 and human-trafficking in 2013, and the definition of rape changed in 2013, according to the FBI.", "But we found no evidence of any attempt by city, state or federal law enforcement officials to intentionally deceive the public by misreporting the city’s crime data, as Trump suggested.", "Rather than repeating his claim that El Paso was once one of the most dangerous cities in the country — it has never been — the president changed his talking point, comparing the number of murders in Juarez, Mexico, just across the border, with El Paso as evidence that “walls work.”", "Trump, Feb. 11: Just a few thousand feet, as an example, from where we stand right now on the other side of the border, it’s one of the most dangerous cities in the world, Juarez, Mexico. Well, the people at Juarez agree. Yet, thanks to a powerful border wall and El Paso, Texas, it’s one of America’s safest cities now. Now, listen to this, so you’re talking a few feet away, right, a few feet, got a wall, it’s a few feet away. Last year Juarez had 1,200 murders, El Paso, right next door, a few feet away, had 23 murders. That’s not good either. But 23 compared to 1,200. Walls work, actually there’s nothing like them for what we’re talking about.", "Trump was roughly correct when he noted that in 2018, Juarez recorded 1,200 murders (actually 1,247, according to El Diario), and El Paso police reported 23 murders.", "But that’s not evidence a border fence has kept homicides in Juarez from spilling into El Paso, as Trump suggests. The number of murders in Juarez has far outpaced those in the much smaller city of El Paso both before and after the fence.", "In 2007, there were 336 homicides in Juarez compared with 17 in the city of El Paso. Construction of the fence started in mid-2008. That year, a war between drug cartels in Juarez sent the number of homicides in the Mexican city soaring to 2,570. Yet across the border in the city of El Paso, there were 17 homicides, according to the FBI’s Uniform Crime Reporting Program.", "In 2010, the year after the fence was completed, the number of homicides dropped to 5 in El Paso, before climbing back up to 16 in 2011 and 23 in 2012. Most recently, the city of El Paso recorded 17 homicides in 2016 and 19 in 2017. Those figures are in line with those before the fence went up. The city averaged 15.2 homicides a year in the five years between 2003 and 2007.", "Because of changing population, it’s better to look at the rate, rather than the raw number, to gauge crime. The murder rate in the city of El Paso was 2.5 in 2016 and 2.8 in 2017, about where it was before the fence. From 2003 to 2007, the murder rate averaged about 2.5 per 100,000 residents per year.", "“It has always been a different story right next door in Juarez,” Leon said.", "As usual, the president repeated some of his debunked claims.", "Here are a few of them:", "Bureau of Economic Analysis. “U.S. International Trade in Goods and Services, November 2018.” 6 Feb 2019.", "Bureau of Economic Analysis. U.S. Trade in Goods and Services, 1992-present. accessed 13 Feb 2018.", "Republic of Korea Ministry of Foreign Affairs. “ROK and US Reach Agreement on 10th Special Measures Agreement.” Press release. 10 Feb 2019.", "U.S. Department of State. “Agreement Between the United States of America and the Republic of Korea for Special Measures relating to Article V of the Agreement under Article IV of the Mutual Defense Treaty.” 28 Jun 2014.", "Nauert, Heather. “U.S.-Republic of Korea Special Measures Agreement Consultations.” U.S. Department of State. Press release. 5 Mar 2018.", "U.S. Department of State. “U.S. and Republic of Korea Conclude New Special Measures Agreement.” Media note. 15 Jan 2009.", "Atwood, Kylie, et al. “US-South Korea reach agreement over cost of US troops in region.” CNN. 4 Feb 2019.", "United Nations Command, Combined Forces Command, and U.S. Forces Korea. “Strategic Digest.” 2018.", "Suderman, Alan. “Virginia abortion feud erupts; governor blasted for comments.” Associated Press. 30 Jan 2019.", "North, Anna. “The controversy around Virginia’s new abortion bill, explained.” Vox. 1 Feb 2019.", "Bureau of Labor Statistics. “Employment, Hours, and Earnings from the Current Employment Statistics survey (National); Total Nonfarm Employment, Seasonally Adjusted.” Data extracted 5 Feb 2019.", "Bureau of Labor Statistics. “Labor Force Statistics from the Current Population Survey; All employees, thousands, manufacturing, seasonally adjusted.” Data extracted 5 Feb 2019.", "Farley, Robert.”Trump Wrong About Wall Effect in El Paso.” FactCheck.org. 19 Jan 2019.", "FBI. Uniform Crime Reports Program. Accessed 13 Feb 2109.", "Orquiz, Martin. “Cierra el año con 1,247 homicidios.” El Diario. 31 Dec 2018.", "CNN. “El Paso mayor: Trump was wrong about crime in speech.” 11 Feb 2019.", "KVIA. “El Paso Police release murder statistics from 1960 to 2018.” 16 Jan 2019.", "Figueroa, Lorena. “Homicides in Juárez in 2015 drop to ’07 levels.” El Paso Times. 4 Jan 2016.", "FBI. “Crime in the United States — 2007.” Accessed 13 Feb 2019.", "Robertson, Lori. “Trump’s ‘Greatest Idea’ for a 2014 Law.” FactCheck.org. 24 Oct 2018.", "Gore, D’Angelo. “VA Could Fire Workers Before Trump Signed Law.” FactCheck.org. 27 Jul 2018.", "S.204 – Trickett Wendler, Frank Mongiello, Jordan McLinn, and Matthew Bellina Right to Try Act of 2017. Congress.gov. 30 May 2018.", "FDA. “Expanded Access” webpage. FDA.gov. updates 8 Nov 2018.", "Gottlieb, Scott. FDA commissioner. “Examining Patient Access to Investigational Drugs.” Testimony before the Subcommittee on Health, Committee on Energy and Commerce, US House of Representatives. 3 Oct 2017.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]