["A screenshot of a Sinhala language newspaper has been shared hundreds of times in multiple Facebook posts published in August 2020 which claim it shows the Sri Lankan government approved a salary increase for government ministers. The claim is misleading; the newspaper front page shared in the posts was originally published in August 2018; as of August 18, 2020, there has been no new announcement about a pay rise for government ministers.", "The screenshot was published in this Facebook post on August 10, 2020.", "The Sinhala text in the screenshot translates to English as:", "\"Salary raise for Ministers approved", "“Salary arrears from seven months to be paid alongside August salary", "“Rs. 750,000 for a MP", "“Rs. 550,000 for a Deputy Minister", "“Rs. 600,000 for a Minister or State Minister\".", "The post's Sinhala caption reads: “This is great, let’s pay more taxes”.", "The post circulated just days after Sri Lanka held parliamentary elections on August 5, 2020. Sri Lanka Podujana Peramuna, a political party led by former President Mahinda Rajapaksa, won a landslide victory and secured a two-thirds majority.", "A similar claim about a pay rise was also shared on Facebook here, here and here and on Twitter here.", "The claim, however, is misleading.", "The new parliament is set to convene on August 20 but as of August 18, there have been no announcements regarding a salary increase for ministers or members of parliament.", "A keyword search on Google also found that the front page shared in the misleading posts shows an edition of the Maubima newspaper that was originally published on August 3, 2018.", "It can be seen here on the newspaper’s official Facebook page.", "Here is another article published by Sri Lankan newspaper Daily Mirror about the salary increase planned for ministers in 2018.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]