["The debate over including a citizenship question on the 2020 census has been heating up since the March 26, 2018, U.S. Commerce Department announcement of its census plans.", "Officials said the question -- which asks respondents whether they are citizens -- will be included for all respondents at the request of the Justice Department.", "The department said the purpose of the question is to better enforce the Voting Rights Act.", "Meanwhile, immigrant-rights advocates and Democrats argue that the question instills fear in immigrant communities and will lead to an undercount of the population.", "The population count, taken every 10 years, is required by the U.S. Constitution and used to determine the number of seats each state has in the House as well as how federal money is distributed to local communities.", "Since undocumented immigrants are more heavily concentrated in some states and areas, an undercount would mean less money and could change how legislative districts are drawn.", "California, which has a large immigrant population, has filed a lawsuit in federal court against the Commerce Department and census bureau seeking to block the question.", "During a March 28, 2018, interview with host John Muir on the \"Restoring Reason\" program on Green Bay’s WTAQ radio, Republican National Committee Chair Ronna McDaniel slammed the opposition to the census question.", "\"When you talk about the Democrats, too, look at what they are fighting for. They are now mad that our census, which for years and years and years, decades, has asked, ‘Are you a citizen of the United States of America?’ – they are mad that the census asks that simple question.\"", "Is McDaniel correct?", "Has the citizenship question that is now at the center of a debate already been asked for \"years and years and years\"?", "The evidence", "The history section of the U.S. Census Bureau’s web page notes that the first U.S. census was taken in 1790. At that time the questions asked for the name of the head of the family and the number of persons in each household, including slaves.", "As part of its announcement, the Commerce Department said that citizenship questions have been included on prior censuses:", "Between 1820 and 1950, almost every decennial census asked a question on citizenship in some form. Today, surveys of sample populations, such as the Current Population Survey and the ACS (American Community Survey), continue to ask a question on citizenship.", "According to our colleagues at PolitiFact National, the last time all households were asked about U.S. citizenship was in the 1950 Census. That census questioned where individuals were born, and \"if foreign-born — is he naturalized?\"", "In 1960, the census only asked about place of birth.", "From 1970 to 2000, the Census Bureau used two questionnaires: a long-form and short-form.", "Most households received the short-form questionnaire, which covered basic questions, while about 1 in 6 households received a long-form questionnaire that included a question on citizenship.", "The 2010 Census, the most recent one, only used a short-form questionnaire with 10 questions. None of those related to citizenship.", "However, in the mid-2000s the Census Bureau began gathering demographic and socioeconomic information through the American Community Survey, or ACS. The survey  collects information from about 3.5 million households a year and asks about citizenship status.", "The ACS asks such questions as \"In what U.S. state, territory, commonwealth or foreign country was this person born?\" Another question is \"Is this person a CITIZEN of the United States?\"", "The idea with both the now-defunct long-form and the ongoing ACS survey is to use a large sample of responses to draw conclusions about the population as whole, much as a poll does not need to contact every voter to be considered valid.", "Our rating", "McDaniel said the census \"for years and years and years, decades, has asked, ‘Are you a citizen of the United States of America?’\"", "The last time all households were asked about U.S. citizenship was in the 1950 census. But in the decades since, some version of the question has been asked in nearly every census -- either through the now-defunct \"long form\" or the ongoing annual surveys.", "The 2020 census calls for asking all households the citizenship question.", "For a statement that is accurate but needs clarification or additional information, we rate McDaniel’s claim Mostly True.", "U.S. Department of Commerce press release \"U.S. Department of Commerce Announces Reinstatement of Citizenship Question to the 2020 Decennial Census,\" March 26, 2018.", "WTAQ \"Restoring Reason\" with John Muir, audio heard at about the 10:28 mark.", "ABC News \"Decision to add citizenship question to census draws protest,\" March 27, 2018.", "U.S. Department of Commerce, Bureau of the Census, 1950 Census of Population and Housing.\"", "PolitiFact National, \"What You Need to Know About the Census’ Citizenship Question,\" March 28, 2018.", "U.S. Census Bureau, \"1790 Overview\"", "Bureau of the Census \"American Community Survey\"", "U.S. Census Bureau 1960 Census https://www.census.gov/history/pdf/1960censusquestionnaire-2.pdf", "Statista \"Number of households in the U.S. from 1960 to 2017 (in millions).  :", "Reuters, \"U.S. to add citizenship question to 2020 Census,\" March 26, 2018.", "National Public Radio, \"The 2020 Census Questions Every U.S. Household Will Be Asked,\" March 29, 2018.", "The New Republic, \"R.I.P. Census Long Form, May 11, 2010.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]