["On September 2, the Indian government banned the popular Chinese action game PlayerUnknown’s Battlegrounds, popularly known as PUBG, for “national security concerns”. The ban came against the backdrop of India’s growing tensions with China. Two days after the Bharatiya Janata Party (BJP)-led government pulled the plug on the mobile game, nCore Games announced a new Indian version of PUBG Mobile called FAU-G or Fearless And United: Guards. That same day, ABP News aired the broadcast, “After PUBG Ban, Akshay Kumar Presents New Action Game ‘FAU-G’.”", "At 2:08 minutes into the show, ABP News anchor claimed that the visuals playing on television screens are from the upcoming Indian game FAU-G. “See this is the game we were just talking about, which you can spot on your television screens. You must have seen PUBG and FAU-G is similar to this. FAU-G has taken the place of PUBG and you can see images of how the game is going to look. FAU-G. See these two visuals. On one side you can see how gaming used to be on PUBG and on the other side you can see FAU-G taking the place of PUBG. The visuals that the game will have and how it will be played,” said the anchor in Hindi.", "After the broadcast was aired, a Twitter user wrote that ABP News aired clips from the season 4 trailer of PUBG as visuals of soon to be released Indian counterpart FAU-G.", "Farzi news mai bhi farziwada 😑 vo dusri video PUBG:PC season 4 trailer ki hai @ABPNews FAUG ki nhi. @AltNews@zoo_bear pic.twitter.com/9TyPuslQq4", "— Shalendragaur (@Shalendragaur1) September 9, 2020", "This is indeed true. The same visuals were on ‘PUBG – Season 4 Gameplay Trailer’ released on September 4, 2019, on their verified YouTube channel.", "Below are several screengrabs from the trailer and the visuals aired by ABP News which are evidently the same. These visuals can be spotted 2:08 minutes onward in the ABP News broadcast and 0:40 seconds into the PUBG trailer.", "Thus, ABP News used visuals of PUBG to report on FAU-G replacing the Chinese game.", "The poster of FAU-G released by nCore Games and tweeted by actor Akshay Kumar had also created a social media buzz on September 4 when users found that the poster was made using a stock photo.", "Bangalore-based nCore Games, however, clarified that they “bought the license to use the image from Shutterstock.”", "Clarification @vishalgondal ⁩ @dayanidhimg @akshaykumar #FAUG pic.twitter.com/qVFMjv5Crt", "— nCORE Games (@nCore_games) September 7, 2020", "Donate Now", "Aqib is monitoring and researching mis/disinformation at Alt News", "A claim that Nobel laureate Amartya Sen has passed away went viral on social media…", "Within hours of Prime Minister of Canada Justin Trudeau alleging that “agents of the government…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…", "On the front page of its national edition dated August 22, Hindi daily Dainik Jagran…", "In his reply to the no-confidence motion brought by the Opposition in the Lok Sabha,…"]