["About this rating", "An image circulating online in September 2017 depicted federal Housing and Urban Development (HUD) Secretary Ben Carson as having a less than charitable viewpoint toward hurricane victims.", "You see, a hurricane is God's way of saying you are meant to be homeless. So in a sense, your homelessness is a gift from heaven.", "The photograph was likely from a 7 May 2015 meeting between Carson and community leaders in Baltimore. But there is no record of Carson making that statement about hurricane victims.", "In a September 2017 interview, Carson said that families who receive federal housing assistance would get help in the aftermath of Hurricane Harvey, which caused significant damage in parts of Texas:", "We will make sure that they're all taken care of. In many cases where things have been destroyed, we'll have to go to some transitional housing first. But yes, we'll be taking care of all of them.", "Carson has also promised that HUD would be \"a rapid, responsible and compassionate agency\" in its response.", "A HUD spokesperson told us that around 500,000 homeowners affected by Harvey and Hurricane Irma in Florida currently have mortgages insured by the Federal Housing Administration. Those homeowners are eligible for a 90-day \"foreclosure moratorium.\"", "The caption used in the image of Carson could be a play on a remark he actually did make during a May 2017 interview:", "I think poverty to a large extent is also a state of mind. You take somebody that has the right mindset, you can take everything from them and put them on the street, and I guarantee in a little while they'll be right back up there. And you take somebody with the wrong mindset, you can give them everything in the world, they'll work their way right back down to the bottom.", "When asked in September 2015 how he would deal with Hurricane Joaquin, Carson -- then a Republican presidential candidate -- told reporters, \"I don't know.\"", "DelReal, Jose A. \"Ben Carson Calls Poverty 'a State of Mind' During Interview.\"\r\nWashington Post. 24 May 2017.", "NPR. \"Harvey Recovery Will Take Time, HUD Secretary Ben Carson Says.\"\r\n6 September 2017.", "ABC News. \"Ben Carson on How He Would Handle Hurricane Joaquin: 'I Don't Know.'\"\r\n30 September 2015.", "YouTube, uploaded by HUDChannel. \"Next Steps for Hurricane Recovery: A Video Message from Secretary Carson.\"\r\n14 September 2017. https://youtu.be/6kspZTkwz0k", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]