["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The 2,500-word New York Times story examined a new allegation that Joe Biden sexually assaulted a former staff assistant in 1993.", "Times executive editor Dean Baquet said 13 words about Biden’s past physical contact with women were deleted from the story post-publication after Biden’s campaign contacted them.", "The same words that were removed, however, are intact in the story two paragraphs earlier. The words describe past allegations of Biden “kissing, hugging or touching” women in ways that the women say they “made them feel uncomfortable.”", "As pressure built on Joe Biden to answer a sexual assault allegation made against him, the New York Times was accused of squelching a story to help the presumptive Democratic presidential nominee.", "\"New York Times Editor Admits Biden Sexual Assault Story was Censored at Behest of Biden Campaign\" was the headline of an article on FrontPageMag.com, a website published by the David Horowitz Freedom Center, which identifies itself as a conservative think-tank.", "The FrontPageMag.com article was shared in a Facebook post that was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "It concerns a 2,500-word New York Times article published April 12 that examined the allegation. Following its publication, the Times removed 13 words from one sentence after receiving an objection from the Biden campaign.", "The deleted words were not about the most recent allegation, one that comes from Biden’s former staff assistant, Tara Reade. Rather, the removed portion referred to previously reported descriptions of Biden’s past physical contact with women. These descriptions are elsewhere in the story.", "In a series of media interviews starting with a podcast released March 25, Reade accused Biden of sexually assaulting her when he was a senator.", "She said the assault occurred in the basement of a Capitol Hill office building in the spring of 1993, when Reade was a 29-year-old staff assistant to Biden. Reade said Biden pushed her against a wall, groped her and penetrated her with his fingers.", "In April 2019, around the time several other women complained of unwanted physical contact with Biden, Reade told a California newspaper that Biden had inappropriately touched her, but she did not allege any sexual assault.", "Biden’s campaign denied Reade’s sexual assault allegation. After some Democrats pressed him to respond, the former vice president appeared on MSNBC’s \"Morning Joe\" May 1 and released a statement denying the allegations. \"I’m saying unequivocally, it never, never happened,\" he said.", "For their lengthy April 12 article, New York Times reporters spoke to several people who worked in the Senate office with Reade who said they didn’t recall discussion of such an incident. The Times reported that Reade said she complained about Biden’s behavior but did not mention the alleged assault to Marianne Baker, Biden’s executive assistant, and two top aides, Dennis Toner and Ted Kaufman. They declined to take action, Reade said.", "Two friends of Reade’s would only talk to the newspaper if their names weren’t used. One said that Reade told her about the alleged assault in 1993. The other said Reade in 2008 told her that Biden had touched her inappropriately and that she’d had a traumatic experience working in his office.", "The FrontPageMag.com article homed in on a sentence that Times executive editor Dean Baquet said was edited after publication.", "The sentence was found in the sixth paragraph of the New York Times story, which initially read (emphasis ours):", "\"No other allegation about sexual assault surfaced in the course of reporting, nor did any former Biden staff members corroborate any details of Ms. Reade’s allegation. The Times found no pattern of sexual misconduct by Mr. Biden, beyond the hugs, kisses, and touching that women previously said made them uncomfortable.\"", "FrontPageMag.com claimed the second sentence was \"deleted\" after the article was posted online. Web archives show the sentence was not deleted, but edited so that it ended at \"Biden\":", "\"No other allegation about sexual assault surfaced in the course of reporting, nor did any former Biden staff members corroborate any details of Ms. Reade’s allegation. The Times found no pattern of sexual misconduct by Mr. Biden.\"", "There is no editor’s notation on the online article disclosing the post-publication change.", "Here’s what FrontPageMag.com ignores in its analysis:", "Two paragraphs earlier in the Times article, the story reads that, \"Last year, Ms. Reade and seven other women came forward to accuse Mr. Biden of kissing, hugging or touching them in ways that made them feel uncomfortable.\"", "Nothing about that paragraph was changed.", "FrontPageMag published its article on April 14, the day after the Times ran a question-and-answer article in which media columnist Ben Smith interviewed Baquet.", "In the Q&A, Baquet explains why the sentence was trimmed:", "Smith: \"I want to ask about some edits that were made after publication, the deletion of the second half of the sentence: ‘The Times found no pattern of sexual misconduct by Mr. Biden, beyond the hugs, kisses and touching that women previously said made them uncomfortable.’ Why did you do that?\"", "Baquet: \"Even though a lot of us, including me, had looked at it before the story went into the paper, I think that the campaign thought that the phrasing was awkward and made it look like there were other instances in which he had been accused of sexual misconduct. And that’s not what the sentence was intended to say.\"", "Smith: \"And why not explain that?\"", "Baquet: \"We didn’t think it was a factual mistake. I thought it was an awkward phrasing issue that could be read different ways and that it wasn’t something factual we were correcting. So I didn’t think that was necessary.\"", "In an email to PolitiFact, Baquet responded directly to the FrontPageMag claim, saying that the paper didn’t make the change at Biden’s behest: \"They reached out and questioned the language, and we decided on our own that they had a point. That happens pretty routinely. That head(line) makes it look like they ordered us to change.", "\"We didn't do an editor's note because I didn't think the change rose to that level. My honest view is that it has become a large issue because of the politicization of the case, not because this was a huge change. I thought doing an interview with Ben was an honest way to discuss the story, how we made the decision to run it, and why we made the change. Ben asked hard questions and I tried to answer them. I thought that was pretty visible and transparent.\"", "An article from the website of a conservative organization claimed \"New York Times Editor Admits Biden Sexual Assault Story was Censored at Behest of Biden Campaign.\"", "The Times removed 13 words from a 2,500-word story about a new sexual assault allegation against Biden.", "The Times’ editor said that after being contacted by the Biden campaign, the paper deleted, for better clarity, a portion of a sentence that referred to Biden’s previous physical contact with women.", "The same words that were taken out of the sentence remain in the story two paragraphs before, stating that women had spoken out about Biden \"kissing, hugging or touching them in ways that made them feel uncomfortable.\"", "For a statement that contains an element of truth but ignores critical facts that would give a different impression, our rating is Mostly False.", "FrontPageMag.com, \"New York Times Editor Admits Biden Sexual Assault Story was Censored at Behest of Biden Campaign,\" April 14, 2020", "Email, New York Times executive editor Dean Baquet, May 1, 2020", "New York Times, \"The Times Took 19 Days to Report an Accusation Against Biden. Here’s Why,\" published April 13, 2020 and updated April 29, 2020", "New York Times, \"Examining Tara Reade’s Sexual Assault Allegation Against Joe Biden,\" published April 12, 2020 and updated April 29, 2020", "Washington Free Beacon, \"New York Times Says Biden Campaign Inaccurately Citing Report on Sexual Assault Allegation,\" April 29, 2020", "BuzzFeed News, \"Democrats Will Have To Answer Questions About Tara Reade. The Biden Campaign Is Advising Them To Say Her Story ‘Did Not Happen,’\" April 28, 2020", "Wayback Machine, original version of New York Times article, April 12, 2020", "Washington Examiner, \"New York Times criticized for editing out Biden sexual misconduct allegations over 'imprecise language,’\" April 12, 2020", "Washington Examiner, \"New York Times disputes Biden camp claim that paper exonerated him,\" April 29, 2020", "Associated Press, \"Former Senate staffer accuses Joe Biden of sexual assault,\" April 13, 2020", "Wall Street Journal, \"Democrats Urge Joe Biden to Address Sexual Assault Allegation,\" April 30, 2020", "Wall Street Journal, \"Leading Democrats Stand Behind Biden After Sexual-Assault Allegation,\" April 28, 2020", "PolitiFact, \"Tara Reade has accused Joe Biden of sexual assault. Here’s what we know,\" April 30, 2020", "YouTube, The Hill interview of New York Times media columnist Ben Smith, April 30, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]