["One article reporting the false rumour, on the blog Enlightenment Africa, has been shared nearly 7,000 times from various accounts -- we’ve archived it here. English is also being “sidelined” as a language in Rwanda, the blog claimed.", "“This is good, really good but such a move leaves the Belgian (the former colonizer) and French authorities furious,” it quotes “people” as saying.", "A similar article on the Watchdog Uganda news website was shared more than 2,000 times, while another was posted on this Nigerian blog.", "The unfounded rumour has also spread in French, including on this Congolese Facebook page. “The Rwandan parliament has just approved Swahili as Rwanda’s official language. Now French and English are secondary languages,” reads the caption.", "In fact, Rwanda’s National Assembly voted for Swahili to become one of the country’s official languages back in February 2017 -- not in May 2019, as suggested by recent misleading online posts.", "As reported by AFP at the time, Swahili joined national language Kinyarwanda along with French and English as languages used for official communications.", "The recognition of Kiswahili was one of a number of commitments Rwanda made in 2007 in the East African Community, an organisation whose three founders -- Kenya, Uganda and Tanzania -- use Swahili as an official language alongside English.", "Before the 1994 genocide, Swahili was spoken only in some urban areas of Rwanda, and only Kinyarwanda and French had official status.", "After the genocide, with the return of former refugees and exiles -- many of whom had been hosted in anglophone and Swahili-speaking countries of East Africa -- English became the third official language, while Swahili gained momentum.", "Swahili belongs to the Bantu group of languages ​​and is the result of interactions between the peoples of East Africa and people from India and the Gulf. It is the most widely spoken language in sub-Saharan Africa and since 2004 it has been one of the official languages ​​of the African Union (AU).", "Contrary to the rumour, French remains an official language in Rwanda. As reported by AFP, Rwanda’s then foreign minister, Louise Mushikiwabo, was named head of International Organisation of La Francophonie (OIF), the global group of French-speaking nations, last October.", "French, the language of former colonial power Belgium, has been declining in use in Rwanda since the genocide.", "English, which was spoken by most of the Tutsi refugees who returned from Uganda to form the new political and administrative elite, replaced French in 2008 as the obligatory language used to teach children in Rwandan public schools.", "President Paul Kagame, who is himself Ugandan-educated, introduced English in 2003 as the third official language listed in the constitution, alongside Kinyarwanda and French.", "Nonetheless, Rwanda has not dropped French as an official language, even if it is used much less than English these days.", "According to the OIF, Rwanda counted some 700,000 French-speakers in 2015 -- about six percent of the population.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]