["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "No matter how outlandish, some rumors just won't quit and one of the most tired claims is once again circulating online: That a particular food or drink product has been infected with HIV/AIDS and people should avoid consuming it.", "A Facebook post that features a photo of a man in handcuffs identifies him as being an employee of a Cadbury candy factory and says he was arrested for contaminating products with his HIV-positive blood. Therefore, it continues, people should avoid eating the company’s products or risk contracting the virus.", "The full post: \"This is the guy who added his infected blood to Cadbury products. For the next week do no eat any products from Cadbury, as a worker from the company has added his blood contaminated with HIV (AIDS). It was shown yesterday on BBC News. Please forward this message to people who you care.\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "This Cadbury rumor first appeared in 2018, and has been debunked before.", "The claim is unsubstantiated on several levels.", "First, a reverse-image search shows that the photo was published on multiple Nigerian websites in 2014 and is of Boko Haram terrorist Aminu Ogwuche, who was accused of planning the April 14, 2014, bus park bombing in the Nigerian suburb of Abuja. The blast killed 71 people and injured another 120, according to reports. The photo shows Ogwuche being extradited by international police to Nigeria from South Sudan.", "Second, no arrests have been made and no warnings issued about the British confectionery company’s products being contaminated with HIV. There have also been no recalls or media reports of such a thing.", "Third, and probably most importantly, it is nearly impossible to contract HIV by food consumption.", "According to the Centers for Disease Control, HIV does not survive outside of the human’s bodily fluids and it cannot reproduce outside a human host:", "\"You can’t get HIV from consuming food handled by someone with HIV. Even if the food contained small amounts of HIV-infected blood or semen, exposure to the air, heat from cooking, and stomach acid would destroy the virus,\" the CDC says.", "In very rare cases, HIV has been found to have been spread from an infected person to another through pre-chewed food. According to the CDC, the only known cases where this has occurred is when the pre-chewed food was shared with an infant.  The contamination occurs when infected blood from a caregiver’s mouth mixes with food while chewing.", "Posts on social media claim that Cadbury candy products are contaminated after an HIV-positive worker was arrested for infecting the products with his blood.", "This rumor has been going around for over a year, and is completely bogus.", "The man in the photo is a Nigerian terrorist and there is no evidence that Cadbury products have ever been contaminated with the virus.", "We rate this Pants on Fire!", "Facebook post, Feb. 28, 2019", "AfricaCheck.org, HOAX-ALERT: Nigerian bomber didn’t infect Cadbury’s chocolate with HIV!", "March 1, 2018", "Reverse-image search, March 7, 2019", "Naij.co, Nyanya Mastermind Extradicted Back To Nigeria, 2014; Accessed March 7, 2019", "Vanguard News Nigeria, Ogwuche, Nyanya bombing suspect extradited to Nigeria, July 15, 2014", "Centers for Disease Control and Prevention, HIV transmission, Accessed March 7, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]