["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Gov. Rick Perry delivered his inaugural speech on Jan. 18. Photo by Jay Janner/Austin American-Statesman", "It’s well known that Gov. Rick Perry, just sworn in to a fresh four-year term, is a graduate of Texas A&M University, where he was a student yell leader. Not so well known: the claim Perry put forth in his inaugural address Tuesday on the south side of the Texas Capitol: \"For 154 years, they kept an Aggie out of the Governor’s Office.\"", "We don’t read Perry’s remark as a claim that Aggies never even entered a governor’s office -- say, to visit. Still, we were hooked: Is Perry truly the first Aggie governor of Texas since statehood in 1845?", "News reports from the start of his first term say so.", "A Dec. 21, 2000, news article in the Austin American-Statesman said that after Gov. George W. Bush resigned that morning, then-Lt. Gov. Perry would be sworn in as his successor that afternoon. The story refers to Perry as \"the first Texas A&M graduate to get the job.\"", "Likewise, a May 4, 2001 Associated Press dispatch on Perry’s first gubernatorial visit to A&M’s College Station campus opens: \"Aggie Rick Perry, the first Texas A&M graduate to be Texas governor...\"", "The AP story said other Aggies had run for governor, including 1990 Republican nominee Clayton Williams, but \"no Aggies have been elected.\" Perry, a West Texan who graduated in 1972 with a degree in animal science, is quoted saying: \"Had it not been for my opportunity to get an education at Texas A&M,\" becoming governor \"wouldn't have been possible.\"", "We checked the news reports by consulting an online database of gubernatorial biographies kept by the Texas State Library and Archives Commission.", "According to Perry’s biography, he is \"the first Texas A&M graduate to occupy the Texas Governor’s Mansion.\"", "Two previous guvs established A&M ties after serving in the state’s top elected office. Richard Hubbard, governor from 1876-1879, attended Mercer University in Georgia and then Harvard University, but later joined A&M’s board of directors, which later became the board of regents. And in 1891, Lawrence Sullivan Ross followed up two terms as governor by stepping \"immediately into the presidency of the seriously troubled Agricultural Mechanical College of Texas,\" which later was renamed Texas A&M University.", "Six governors have attended the University of Texas, most recently Dolph Briscoe, who graduated from from UT in 1942 before serving as governor from 1973-1979. Other governors were connected to UT in some other fashion, like Ann Richards, who graduated from Baylor University before earning her teaching certificate at UT in Austin.", "Never mind those teasips, as the Aggies call UT students. Hullabaloo, Caneck, Caneck! Perry’s statement is True.", "The Associated Press, news article, \"Aggie Rick Perry makes first Aggieland appearance as Texas governor,\" May 4, 2001 (Nexis search)\n\nAustin American-Statesman, news article, \"Texas will have new governor today,\" Dec. 21, 2000 (Nexis search)\n\nInterview, Lane Stephenson, director of news and information services, Texas A&M University, College Station, Jan. 18, 2011\n\nGov. Rick Perry, 2011 inauguration speech, Austin, Jan. 18, 2011\n\nTexas A&M University, Texas A&M University Facts, accessed Jan. 18, 2011\n\nTexas State Library and Archives Commission, Governors of Texas, 1846-present, accessed Jan. 18, 2011\n\nTexas State Cemetery, James Perry, accessed Jan. 18, 2011\n\nUniversity of Texas at Austin, Texas Politics: Ann Richards, accessed Jan. 18, 2011", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]