["By Brooks Jackson", "Posted on March 7, 2019 | Corrected on March 21, 2019", "The White House is claiming the economy grew 3.1 percent last year, while the statisticians at the U.S. Commerce Department’s Bureau of Economic Analysis put growth at 2.9 percent. What gives?", "Answer: The White House is spinning the numbers, focusing on a little-used measure to make the economy look a little more robust than it does measured the usual way.", "In fact, real gross domestic product (which is adjusted for inflation) was 2.9 percent higher in 2018 than it was in 2017, according to BEA’s most recent release. (That’s BEA’s “initial estimate,” which could be adjusted up or down slightly on March 28, when BEA plans to update its figures with more complete data.)", "That’s a disappointing figure for Trump, as it is still well below the 4 to 6 percent growth he promised repeatedly, both when he was a candidate and also as president. The 2018 figure is no better than the real GDP growth in 2015, which was Obama’s best year.", "White House economists, however, focus on a different measure, one not normally used by economists in or out of government to gauge annual growth: BEA’s Table 1.1.11, which measures the change between the last quarter of the year compared to the same quarter a year earlier.", "Voila! Now 2018 becomes a “banner year” with growth at “the fastest pace for any calendar year since 2005,” in the words of the White House Council of Economic Advisers. The White House website carries a headline banner saying “America’s economy achieves 3 percent growth for the first time in 13 years,” which isn’t as carefully worded, and is not correct.", "The CEA’s claim involves some careful wording and statistical cherry-picking. It’s true that 2005 was the last time fourth-quarter GDP was 3 percent or more above the same quarter a year earlier. That’s what the CEA means by referring to “calendar year.” But there have been five other 12-month periods in the past 13 years when, measured the same way, GDP grew faster, and twice when it equaled the 3 percent rate touted by the White House website.", "It grew 3.4 percent in the 12 months ending in the second quarter of 2015, for example. And it grew 3.8 percent in the 12 months ending in the first quarter of that year. It also grew 3.2 percent in the 12 months ending in the third quarter of 2010.  Those were all during Obama’s tenure.", "Similarly, under President George W. Bush, growth from a year earlier was 3.4 percent in the first quarter of 2006, and 3.1 percent in the second quarter of that year.", "Also, growth equaled 3 percent in the 12 months ending in the third quarter of 2014 under Obama, contrary to the claim in the White House website banner, and again in the third quarter of 2018 under Trump.", "Correction, March 21: We’d like to thank a reader for pointing out a mistake in our original story, where we referred to real gross domestic product in 2019 and 2018 instead of 2018 and 2017. We have corrected the error.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]