["About this rating", "On Nov. 29, 2020, The Washington Post's editorial board published a piece containing a morbid statistic: In less than five months, the Trump administration had killed more death row inmates than the federal government had done in the previous five decades combined.", "Even as U.S. President Donald Trump used his office to pardon his supporter and former national security adviser Michael Flynn in late November 2020 for twice lying to the FBI, his administration moved ahead with scheduling an unprecedented number of executions before Trump leaves office on Jan. 20, 2021.", "The U.S. Department of Justice (DOJ) in the summer of 2020 ended a 17-year hiatus on federal executions. According to statistics gathered by the nonpartisan research nonprofit organization Death Penalty Information Center (DPIC), the DOJ had put to death eight people starting in July 2020. Until then, only three people had been executed by the federal government from 1970 to 2020.", "The actions of Trump's DOJ \"have no parallel in modern American history and are out of step with both with the historical practices of past presidents, both Republican and Democratic, and the current practices of U.S. states,\" said Robert Dunham, DPIC's executive director.", "U.S. Attorney General William Barr has scheduled five more people to die during the lame duck session, or the months between the election and the inauguration of President-elect Joe Biden. Until now there hadn't been any federal executions carried out during the transition period between presidential administrations for a century.", "The cases themselves are horrific but have also raised issues.", "One of those scheduled for execution, Dustin Higgs, is set to die on Jan. 15, just days before Trump leaves office — and is on the birthday of civil rights icon Martin Luther King Jr. Higgs, who is Black, was convicted in the 1996 murders of three young women: Tamika Black, Tanji Jackson, and Mishann Chinn, according to the DOJ. But he wasn't the person who fired the gunshots that killed the women, and the man who did was sentenced to life without the possibility of parole, not death.", "Lisa Montgomery, who is scheduled to die on Dec. 8, 2020, will be the first female federal inmate to be executed in nearly six decades. Montgomery was convicted in the 2004 murder of Bobbie Jo Stinnett, who was eight months pregnant. Montgomery strangled Stinnett, cut her open, and took the baby, who was eight months into gestation; Montgomery later tried to pass the child off as her own. Montgomery reportedly suffers from serious mental illness and has a history of severe trauma that includes being the victim of gang rape, incest, and child trafficking.", "The unprecedented number of U.S. executions is also remarkable because it stands in opposition to the policy agenda espoused by Trump's successor, practices by state governments, and the views of the American public.", "During his campaign, Biden vowed to end the death penalty at the federal level. Roughly half of the states in the U.S. have either abolished or put moratoriums on capital punishment. Polls also show that public support for use of the death penalty has waned.", "Trump's interest in capital punishment precedes his time in office. He infamously bought a newspaper advertisement calling for New York to adopt the death penalty in the case of the \"Central Park Five\" — five Black and Latino boys who were wrongly accused and convicted of beating and raping a jogger in Central Park. They were cleared, but not before they spent decades in prison.", "As president, Trump has explored giving drug dealers death penalties. He also initiated, in November 2020, a federal rule change allowing for outdated, more brutal methods of execution for federal prisoners, which could include firing squads, electrocutions, and hangings, depending on the state in which the sentencing occurred.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]