["Just days after revealing that he’d been through a deep vetting process as a choice for vice president -- but wasn’t picked -- Democratic Ohio Sen. Sherrod Brown took the stage on the final day of the convention in Philadelphia.", "Brown, who insisted all along that his gig representing Ohio is satisfying enough, delivered a speech that drew contrasts between nominees Hillary Clinton and Donald Trump.", "\"While Trump outsources jobs, Hillary Clinton has a real plan to bring jobs back to America – like a $10 billion ‘Made in America’ plan with tax credits to revitalize manufacturing,\" Brown said. \"Trump proposes tax cuts, too – $3 trillion for millionaires like himself and $2 trillion for corporations like his. Of course we can’t say for sure how much Trump will take for himself, because he’s refused to share his tax returns with the American People.\"", "It’s been widely reported that Trump’s tax plan generously favors the top one-percent of Americans. We asked Brown’s Senate office for his sources of the numbers \"$3 trillion\" and \"$2 trillion.\" Trillions tend to sound exaggerated -- maybe because that many zeroes make our eyeballs swim.", "Rachel Petri, from Brown’s senate office, offered a piece from Citizens for Tax Justice to back up the claim about Trump’s planned corporate tax cuts.", "Citizens for Tax Justice, a liberal think tank, plotted a hypothetical analysis of Trump’s proposal, if implemented in 2016. They found that the changes would equal $12 trillion less revenue collected in federal taxes over the next decade.", "\"This includes $9.6 trillion in personal income tax cuts, $2 trillion in corporate income tax cuts, and the $300 billion cost of repealing estate and gift taxes,\" according to the report (emphasis ours).", "Petri said that the $3 trillion for millionaires figure comes from data from the Tax Policy Center, which was analyzed by the left-leaning Center on Budget and Policy Priorities. That report estimates that the tax cuts going to millionaires would result in a loss of revenue collected by approximately $3.2 trillion over 10 years.", "Since both groups Brown pulled stats from are liberal-leaning, we looked for a report from a source that skews conservative.", "One such group, the Tax Foundation, reported a cost of $1.54 trillion for Trump’s corporate tax cuts over 10 years. Though that is off by half a trillion, rounding up would get it to Brown’s $2 trillion quote.", "The Tax Foundation estimates $10.2 trillion less revenue over a decade due to reduced individual tax rates. The top one-percent of earners would see 27 percent of the cut under the plan, which is about $2.75 trillion. (Correction Aug. 2, 2016: An earlier version of this fact-check had a different calculation.) Again, rounding up gets it to Brown’s $3 trillion under this analysis.", "Trump is no longer the presumptive Republican candidate, but this is a presumptive tax plan. In May, Trump tapped two all-stars of conservative fiscal policy to help with a revamp. As of yet, Trump Tax 2.0 is still pending.", "Our ruling", "Addressing the DNC, Brown said that Trump’s tax plan would cut \"$3 trillion for millionaires like himself and $2 trillion for corporations like his.\"", "Those numbers basically check out, via Brown’s think-tank sources. A conservative group’s analysis fell a little shorter, but supports Brown when rounded up.", "It’s all subject to change upon the unveiling of Trump’s Tax Plan Part Two. But it is accurate as of Brown’s speech.", "We rate the statement Mostly True.", "https://www.sharethefacts.co/share/0b1c5101-f92c-4d53-b889-a223ba2ead27", "Email interview, Rachel Petri, for Sen. Sharrod Brown, Jul. 29, 2016", "Tax Foundation, \"Details and analysis of Donald Trump’s tax plan,\" Sept. 29, 2015", "Politico, \"Trump launches tax plan rewrite,\" May 11, 2016", "Citizens for Tax Justice, \"Donald Trump’s tax plan would cost $12 trillion,\" Mar. 17, 2016", "Center on Budget and Policy Priorities, \"Millionaires would gain trillions under Trump and Cruz tax plans,\" Apr. 28, 2016", "Time, \"Trump’s tax plan could cost $12 trillion, and save him millions in taxes each year,\" Sept. 29, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]