["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "As Oklahoma’s elected officials wrestle to close a budget gap, a recent op-ed from the Oklahoma Council of Public Affairs argued that tax hikes shouldn’t be part of the solution.", "\"Why do we need to raise taxes if the government is already spending more than ever before,\" the conservative think tank wrote. \"State government spending is at an all-time high. The state is on track to spend more in this fiscal year — more than $17.9 billion — than at any time in state history.\"", "Where does the state money go? Well, schools, both K-12 and higher education, account for one of the heftiest lines in the budget. Another big ticket item is SoonerCare, the state’s Medicaid program.", "It all adds up. We wondered if it’s truly the case that the state is spending more money than ever before. The answer depends on whether you think inflation matters.", "Most economists, bankers and corporate CFOs do, and when you factor in that a dollar today is worth less than a dollar in the past, the council’s claim falls short.", "The council got its spending numbers through 2016 from the state’s Office of Management and Enterprise Services. The state hasn’t closed out the books for 2017, but preliminarily, expenditures hit about $17.9 billion. (Technically, we’re now in FY 2018.) Based solely on the raw dollars, that part of the council’s statement is on the mark. Here’s how the official totals look in the years for which we have final numbers:", "2006", "2007", "2008", "2009", "2010", "2011", "2012", "2013", "2014", "2015", "2016", "Current dollars (billions)", "12.85", "14.14", "15.02", "16.08", "16.62", "16.65", "16.71", "17.04", "17.52", "17.40", "17.96", "But the numbers change when you take inflation into account. We used a very common yardstick -- constant 2009 dollars based on the changes in the national Consumer Price Index.", "Viewed that way, spending today amounts to about $15.83 billion in 2009 dollars. It was clearly higher at the height of the recession in 2009 ($16.08 billion) and 2010 ($16.35 billion), and a smidge more in 2011. This chart shows the constant (in red) and nominal or current dollars (in blue) side-by-side.", "Spokesman David Autry at the Oklahoma Council of Public Affairs said the inflation adjustment had the biggest impact on the results, but he discounted its importance.", "\"Working Oklahomans (taxpayers) aren’t allowed the luxury of adjusting for inflation when the mortgage or rent comes due,\" Autry said. \"The taxpayers who foot the bill for state government are forced every day to live within their means.\"", "Adjusting for inflation does have a place in the council’s toolkit. Autry said that the council adjusts for inflation when it looks at numbers over a longer period of time, because \"because readers may not have that kind of knowledge.\"", "He also noted that the results shift depending on the choice of an inflation measure, and sent us three alternatives.  But even using his options, spending in 2010 topped 2016 for the two that looked at what consumers pay. Only by limiting the measure to what producers pay (the producer price index) did 2016 come out the highest.", "Autry sent this table:", "We can round out the spending burden picture by looking at spending compared to the state’s population and its economy. When there are fewer people, the burden falls on fewer shoulders. If the economy is smaller, even the same amount of spending would require a bigger economic effort.", "The state gained about 330,000 people between 2006 and 2016. Its economy grew by about $33 billion in real terms in the same period, according to the U.S. Bureau of Economic Analysis.", "Based on population, constant dollar spending was higher in seven of the past 11 years. Measured against the size of the state’s economy, it was higher in eight out of the past 11 years.", "2006", "2007", "2008", "2009", "2010", "2011", "2012", "2013", "2014", "2015", "2016", "Per capita constant dollars", "3790", "4021", "4080", "4324", "4346", "4183", "4070", "4043", "4050", "3985", "4034", "Spending as percent of GDP", "9.6%", "10.1%", "10.2%", "11.2%", "11.4%", "10.5%", "9.7%", "9.3%", "9.0%", "8.7%", "9.0%", "The Oklahoma Council of Public Affairs said that spending this year is on track to be the highest ever. While the raw numbers show that, the statement ignores the impact of inflation, a standard practice when comparing dollars over time. Factoring in inflation shows that real spending was higher in 2009 to 2011.", "When population and economic growth are added in, spending has been higher over most of the past decade.", "The statement contains an element of truth but it ignores critical facts that would give a different impression. We rate this claim Mostly False.", "Tulsa World, Oklahoma budget crisis? What budget crisis?, Oct.5, 2017", "Oklahoma Office of Management and Enterprise Services, Comprehensive annual financial reports, accessed Oct. 13, 2017", "U.S. Bureau of Labor Statistics, Consumer Price Index, accessed Oct. 12, 2017", "U.S Census Bureau, Oklahoma population, accessed Oct. 11, 2017", "U.S. Bureau of Economic Analysis, Oklahoma real GDP 2006-2016, accessed Oct. 12, 2017", "Email interview, David Autry, communications manager, Oklahoma Council of Public Affairs, Oct.13, 2017", "Email interview, Russell Evans, associate professor of economics, Oklahoma City University, Oct. 12, 2017", "Interview, Shelley Zumwalt, director of public affairs, Office of Governor Mary Fallin, Oct. 16, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]