["About this rating", "The widespread damage done by wildfires in Southern California in December 2017 led to the re-emergence of a meme across social media purportedly offering advice to homeowners who may encounter animals escaping the blazes.", "The message reads:", "If you live ANYWHERE near the forest fires that are decimating the California PLEASE be aware that the animals are fleeing the fires and they may show up in your yards. The forestry department is URGING you to bring your animals in at night and let the wild ones pass through. Please put out buckets of water for them — they are scared, exhausted, and have also lost their homes — they need to refuel.", "A spokesperson for the U.S. Forest Service confirmed to us that they are not the \"forestry department\" that allegedly urged people to lay water out for wildlife.", "Regarding how — or if — to help animals evading a wildfire, John Griffin, director of urban wildlife for the Humane Society of the United States (HSUS) told us that he was not sure if \"putting out buckets of water\" for wayward wildlife really helped them. While people may want to instinctually help animals at risk, he said, doing so can have them figuratively \"shooting in the dark.\" He said:", "In this situation it's just better not to have an intervention, because [animals] are extremely resilient and they're aware of other food or water sources. Trying to interfere with that, you don't know that interfering won't cause an issue. If they're truly injured and require assistance, that's a different set of circumstances.", "Peter Tira, a spokesperson for the California Department of Fish and Wildlife, also discourages interacting with wildlife, saying:", "If you encounter a wild animal in our neighborhood, leave it alone. Fire or no fire, just let the animals be.", "A similar post was distributed online in September 2017, when wildfires were impacting the Pacific Northwest U.S.", "As of 7 December 2017, a combined 116,000 acres in Los Angeles and Ventura counties had been damaged by various wildfires in those areas. The blazes caused various schools in the area to cancel classes. More than 300 structures had been destroyed.", "A separate fire in northern San Diego County destroyed at least 20 structures and damaged 2,500 acres.", "Robertson, Michelle. \"Fact check: Don't expect wild animals fleeing fires to show up in your yard.\"\r\nSFGate. 16 October 2017.", "Rocha, Veronica et al. \"Southern California Wildfires: Live Updates.\"\r\nCNN. 7 December 2017.", "The New York Times. \"Southern California Fires Live Updates: Threats in Ventura and San Diego Counties.\"\r\n7 December 2017.", "Update [8 December 2017]: Corrected reference to U.S. Forest Service.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]