["The photos were published in this article by Sri Lankan news site Lanka Lives. The article reports that the family of an unnamed former opposition politician were involved in a car crash on February 3, 2021. The report features two photos of a wrecked BMW alongside a partially blurred image of a man.", "“Last evening a BMW 8 series type vehicle was met with an accident in Dehiwala while trying to overtake a truck,” the Sinhala-language article claims.", "“A 16-year old underage girl and her mother, who received minor injuries have been discharged this morning after being admitted to the Kalubowila hospital for treatment... Confidential sources revealed it was the wife and daughter of a former opposition MP who represented the Kurunegala district, that was involved in the accident.\"", "The photos of the wrecked BMW featured in the article were also posted in multiple Facebook posts (including here and here) alongside an image of Bimal Rathnayake, a former MP for Sri Lanka’s far-left People’s Liberation Front.", "“The BMW that crashed was given to my wife by a vegetable seller in a market - Comrade Bimal notes,” reads one Facebook post sharing the claim.", "The claim, however, is false.", "A reverse image search of the photo showing the exterior of a wrecked BMW led to this report on a car crash in Mumbai, India, published on May 19, 2015.", "Below is a screenshot of the misleading post’s image (L) and the photo published in the 2015 article (R):", "Police in Dehiwala, the town were the misleading article claims the accident happened, also told AFP that there have been no reports of a car crash involving an ex-MP’s vehicle on February 3, 2021.", "Rathnayake himself denied the claim in a Facebook post on February 6, 2021.", "The Sinhala-language post translates to English as: “With regard to a fake news circulated by political opponents with regard to a vehicle accident.", "“An alleged accident that is claimed to have occurred a few days back has been linked to my family members and myself and these claims have been circulated on social media by a group of political opponents.", "“The photographs used in the report are from an accident that had occurred in a foreign country.\"", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]