["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Then-Indiana Gov. Mike Pence, center, talks with South Bend, Ind., Mayor Pete Buttigieg, right, as they cross the Jefferson Boulevard bridge during a fitness walk along the St. Joseph River in South Bend on July 3, 2013. (AP)", "At a CNN town hall, the first question posed to Democratic presidential candidate Pete Buttigieg, the mayor of South Bend, Ind., gave him a chance to answer criticism about his qualifications to serve in the Oval Office.", "The audience member began with a reference to the host of Comedy Central’s \"The Daily Show\" and to President Donald Trump. Then there was this exchange:", "Question: \"So, in a recent comedy piece, Trevor Noah said that you were the exact opposite of Trump in many regards, going so far as to say that you were the anti-Trump. However, similar to Trump, you lack experience in state and federal governance. If elected, how would you use this lack of experience as an advantage?\"", "Buttigieg: \"Well, first of all, in many ways, experience is my answer to the question of age. I get that my experience is not the most conventional for somebody running for president, but unlike this president, I have experience in government. As I often point out, I’ve got not only more experience in government than the president, but more executive experience than the vice president, more military experience than anybody who's come into that office since George H.W. Bush.\"", "It’s well known that prior to serving in the White House, Trump had no prior government experience. And we’ve rated Buttigieg’s military claim as True.", "Now let’s look at whether Buttigieg has more executive experience than his fellow Hoosier, Vice President Mike Pence. It’s a claim he has made repeatedly for months.", "To back Buttigieg’s statement, his campaign simply pointed out to Buttigieg’s tenure as mayor of his native South Bend, home of University of Notre Dame and the National Studebaker Museum, and to Pence’s tenure as Indiana’s governor.", "Buttigieg, who is 37, is serving his second term as mayor. He has held the post since January 2012, except for a six-month leave-of-absence in 2014 when he was deployed to Afghanistan as a member of the U.S. Navy Reserve. (Buttigieg announced in December 2018 he would not seek a third term.)", "Pence, 59, was inaugurated as governor in January 2013 and served until his term ended in January 2017, even though he had become Trump’s running mate in July 2016. All of that was after Pence had served 12 years in the U.S. House of Representatives, where for two years (2009 to 2011) he was chairman of the House Republican Conference.", "Buttigieg’s campaign argues that Buttigieg’s nearly 7½ years as mayor gives him more executive experience than Pence’s four years as governor.", "South Bend has a \"strong mayor\" form of government, which means the mayor is the elected chief executive running the city, as opposed to cities where the mayor has a lesser role and the day-to-day administration is handled by a hired city manager.", "But, obviously, serving as mayor of a city of about 100,000 people with a 2019 budget of $368 million isn’t the same as serving as governor of a state with 6.7 million people. The last two-year state budget signed by Pence, in 2015, was for $31 billion.", "Moreover, Pence has now served for more than two years in a rather major  executive branch office — vice president.", "The response from the Buttigieg campaign to us indicates Buttigieg was referring to executive experience in elected office. But we’ll note that Buttigieg was an officer from 2009 to 2017 in the U.S. Navy Reserve. And Pence served as president of the Indiana Policy Review Foundation, a conservative think tank, from 1991 to 1993.", "\"Pence’s two jobs have been heavier hitters,\" said Margaret O'Mara, a history professor at the University of Washington whose specialties include the modern presidency, referring to Pence’s time as governor and vice president. \"The bottom line, however, is that no job truly prepares a person to become U.S. president — it is a job unlike any other, and one that every occupant has had to learn to master while already in office.\"", "Using a baseball analogy, Jerald Podair, professor of history and American studies at Lawrence University in Appleton, Wis., was more blunt. \"When all is said and done, Mayor Pete is no different than thousands of mayors of mid-size cities,\" Podair said. \"His experience is Triple-A at best. Pence’s is major league.\"", "Buttigieg says he has \"more executive experience than the vice president.\"", "In terms of No. 1-in-charge jobs, Buttigieg’s seven-plus years as the mayor of South Bend, Ind., exceeds the four years Pence served as governor of Indiana. But the scope of Pence’s duties was wider as governor. Moreover, even though it’s a No. 2 position, Pence’s two-plus years as vice president obviously count as high-level executive-branch experience as well.", "The statement has element of truth but leaves out critical facts that would give a different impression. We rate Buttigieg’s statement Mostly False.", "CNN, CNN town hall transcript, April 22, 2019", "Email, Pete Buttigieg campaign spokeswoman Lis Smith, April 23, 2019", "Email, Vice President Mike Pence press secretary Alyssa Farah, April 23, 2019", "The White House, Mike Pence biography, accessed April 23, 2019", "State of Indiana Historical Bureau, \"List of Governors,\" accessed April 23, 2019", "Email, Margaret O'Mara, associate professor of history at the University of Washington, whose specialties include the modern presidency, April 24, 2019", "Email, Jerald Podair, professor of history and American studies at Lawrence University, April 24, 2019", "PolitiFact, \"Obama's 20 years of experience,\" March 7, 2008", "Northwest Indiana Times, \"Pence sworn in as Indiana's 50th governor,\" Jan. 14, 2013", "Associated Press, \"Pence signs $31B budget for Indiana,\" May 7, 2015", "South Bend Tribune, \"From youngest mayor to Smart Streets: A timeline of Pete Buttigieg's political career,\" Dec 17, 2018", "PolitiFact, \"‘Executive’ makes it right,\" Sept. 2, 2008", "SouthBendIN.gov, \"City Celebrates Passage Of 2019 Budget,\" accessed April 23, 2019", "CNN, \"Mike Pence Fast Facts,\" Jan. 17, 2019", "SouthBendIN.gov, Mayor Pete Buttigieg biography, accessed April 23, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]