["Filling out a federal form is part of the background check process. Since the February 2018 Florida school shooting that killed 17 people, some politicians are calling for a law requiring background checks on all gun purchases. (Getty Images)", "Reacting to the school shooting in Parkland, Fla. that killed 17 people, U.S. Sen. Tammy Baldwin spoke out for universal background checks -- that is, requiring them for every gun sale.", "The Wisconsin Democrat said universal checks are supported by 97 percent of gun owners, a claim we rated Mostly True, based on the latest national polling of households that have guns.", "Clearly, the checks -- the potential buyer shows identification, completes a federal form and goes through an instant criminal background check -- are not required for all gun sales.", "Indeed, under federal law, only federally licensed gun dealers, importers and manufacturers must run the checks.", "So, what percentage of guns are sold without a background check?", "Possible White House hopeful’s claim", "On March 7, 2018, Montana Gov. Steve Bullock -- a possible Democratic contender for president in 2020 -- visited Milwaukee to raise money for Wisconsin Democrats.", "Interviewed by WTMJ-TV in Milwaukee, he touched briefly on guns, voicing support for universal background checks and saying:", "\"It makes no sense that a quarter of our guns are sold outside of the background checks.\"", "So, Bullock’s claim is 25 percent.", "‘Zombie’ claim", "After the Florida school shooting, U.S. Sen. Bernie Sanders, I-Vt., said on NBC’s \"Meet the Press\" that \"40 percent of the guns in this country are sold without any background checks.\"", "But that was wrong. PolitiFact Florida rated his statement False. So did the Washington Post Fact Checker and FactCheck.org.", "All three agreed, and Sanders’ staff essentially acknowledged, he was using an outdated statistic from a 1994 study.", "Recent study", "The fact checks, and experts we contacted, instead cited a study authored by researchers from Northeastern and Harvard universities that was published in January 2017. They did an online survey, in 2015, of 1,613 adult gun owners.", "Among gun owners who said they obtained their most recent gun within the two previous years:", "22 percent overall said they obtained the guns without a background check. But that includes guns that were purchased or received in another way, such as through a gift or an inheritance.", "13 percent who purchased firearms -- for example, from a friend or online -- said they had done so without a background check.", "The lower figure applies here, given that Bullock’s claim is about gun sales.", "Our rating", "Bullock says: \"A quarter of our guns are sold outside of the background checks.\"", "The latest study that surveyed gun owners on the topic found that, among gun owners who had acquired a gun in some way within the previous two years, 22 percent had done so without a background check.", "That’s close to Bullock’s figure. But it takes into account people who acquired guns either by purchasing them, or by simply receiving them, for example as a gift.", "Among those surveyed who had purchased a gun within the previous two years, only 13 percent said they had done so without a background check.", "We rate Bullock’s claim Mostly False.", "Go here for a review of our other gun fact checks since Parkland.", "WTMJ-TV, Steve Bullock interview (0:50), March 7, 2018", "Email, Gov. Steve Bullock chief of staff Tom Lopach, March 12, 2018", "PolitiFact Florida, \"Bernie Sanders repeats false claim about gun sales without background checks,\" Feb. 20, 2018", "Washington Post Fact Checker, \"Bernie Sanders resurrects a ‘zombie’ claim on gun sales without background checks,\" Feb. 20, 2018", "FactCheck.org, \"Sanders Uses Stale Gun Sales Stat,\" Feb. 20, 2018", "PolitiFact National, \"Fact-checking a misleading post on ID requirements for buying guns, voting,\" Feb. 22, 2018", "Email, Coalition to Stop Gun Violence policy analyst Dakota Jablon, March 9, 2018", "Email, Northeastern University health sciences professor Matthew Miller, March 9, 2018", "Email, Brady Campaign and Center to Prevent Gun Violence press secretary Max Samis, March 9, 2018", "Annals of Internal Medicine, \"Firearm Acquisition Without Background Checks: Results of a National Survey,\" January 2017", "Email, Johns Hopkins University’s Center for Gun Policy and Research director Daniel Webster, March 9, 2018", "Email, Giffords Law Center legal director Laura Cutilletta, March 9, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]