["By Angelo Fichera", "Posted on July 11, 2018", "Q: Did Facebook hire George Soros “to remove ‘unwanted’ Conservative content from the platform to better regulate elections”?", "A: No. A false story mischaracterizes Soros’ ties to the Atlantic Council, which has partnered with Facebook on an elections integrity project.", "Facebook announced in May that it will work with the Atlantic Council, an American think tank focused on international affairs, as it attempts to stem the flow of misinformation spread on the social platform during elections.", "“Experts from their Digital Forensic Research Lab will work closely with our security, policy and product teams to get Facebook real-time insights and updates on emerging threats and disinformation campaigns from around the world,” Facebook said in its press release. “This will help increase the number of ‘eyes and ears’ we have working to spot potential abuse on our service — enabling us to more effectively identify gaps in our systems, preempt obstacles, and ensure that Facebook plays a positive role during elections all around the world.”", "But the social media giant has not hired George Soros, the billionaire investor known for financing liberal causes, “to remove ‘unwanted’ Conservative content from the platform to better regulate elections.”", "A false story making that claim appeared July 8 on the website neonnettle.com and accrued thousands of engagements — such as shares, reactions and comments — on Facebook. A similar story was also published in May on the website yournewswire.com, and that version had tens of thousands of Facebook interactions.", "The stories attempt to portray the Atlantic Council as a Soros operation simply because his philanthropic organization donated to the council.", "The Open Society Initiative for Europe, a branch of Soros’ Open Society Foundations, is listed as having given the Atlantic Council between $10,000 and $24,999 during the 2016 fiscal year (that donation is listed as being exclusively for the 2016 Wroclaw Global Forum).", "Open Society Foundations also has donated to the Ploughshares Fund, a foundation that advocates against nuclear weapons, which gave the Atlantic Council between $100,000 and $249,000 in the 2016 fiscal year.", "Among many others that have donated to the Atlantic Council is the Charles Koch Institute, an educational nonprofit of the billionaire businessman and conservative political donor.", "In 2016, the council reported a budget of about $24 million, according to its IRS filing that year.", "The Atlantic Council positions itself as a nonpartisan organization that welcomes diverse viewpoints, and a spokeswoman cited its intellectual independence policy when asked about the false claim that Soros would be working on the Facebook project.", "“Intellectual independence is the entire foundation of our work,” the spokeswoman, Nicole Meir, wrote in an email to FactCheck.org. “Facebook and Open Society Foundations have — separately — decided to support our work, but neither coordinate or have veto or influence over the scale and scope of our research and reporting.”", "Soros does not sit on the board of the Atlantic Council and is not a member of its staff. And we could find no evidence that he is personally involved with — or has been hired to work on — Facebook’s partnership with the Atlantic Council.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk false stories shared on the social media network. Facebook has no control over our editorial content.", "Greenberg, Jay. “Facebook Hires George Soros to Help Remove Conservative Content from Platform.” Neonnettle.com. 8 Jul 2018.", "Harbath, Katie. “Announcing New Election Partnership With the Atlantic Council.” Press release, Facebook. 17 May 2018.", "“Honor Roll of Contributors.” Atlantic Council. Accessed 9 Jul 2018.", "Meir, Nicole. Spokeswoman, Atlantic Council.  Email sent to FactCheck.org. 10 Jul 2018.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]