["About this rating", "As of mid-November, as COVID-19 cases rose to the highest levels ever in the U.S., store items that were difficult to find at the beginning of the pandemic were once again sold out in some stores in some locations. These products included toilet paper, paper towels, disinfecting wipes, hand sanitizer, and other cleaning supplies.", "The fact that these products may be sold out in one store or location doesn't necessarily mean that inventory fell to the same low levels over the entire country. Further, the Consumer Brands Association doesn't expect the these items to become as scarce in late 2020 as they were in March.", "It's not yet known how shoppers will react to the rise in COVID-19 cases and resulting lockdowns in the coming weeks.", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "Long lines snaking through Costco parking lots and Target shelves emptied of toilet paper are reminders of the early days of the COVID-19 pandemic in the United States.", "In November 2020, as COVID-19 case numbers climbed to higher counts than ever, some store shelves began to look a lot like they did in March 2020.", "The Associated Press reported that \"a surge of new coronavirus cases in the U.S. is sending people back to stores to stockpile again.\" Walmart, Kroger, and Publix all reported experiencing a spike in demand, and some stores are placing per-shopper limits on toilet paper and other products.", "However, Geoff Freeman, president and CEO of the Consumer Brands Association, formerly the Grocery Manufacturers Association, believed this time will be different.", "[Freeman] doesn’t expect things to be as bad this go-around since lockdowns are being handled on a regional basis and everyone is better prepared.", "\"A more informed consumer combined with a more informed manufacturer and a more informed retailer should provide all of us with a greater sense of ease and ensure we can meet this growing demand,\" Freeman said.", "The biggest supply issue seems to be paper products: 21% of shelves that stock paper towels and toilet paper are empty, the highest level in at least a month, according to market research company IRI. Cleaning supplies have remained level at 16%. Before the pandemic, 5% to 7% of consumer goods were typically out of stock, IRI said.", "While some stores may be out of sought-after items, some shoppers have discovered that Amazon Fresh, a grocery delivery service from Amazon, seems to have kept at least one of the most coveted items in stock throughout 2020: Clorox and Lysol disinfecting wipes.", "It is not yet known if the rise in coronavirus cases in late 2020 will cause inventory shortfalls as severe as those seen in mid-March for paper products, cleaning supplies, and other items. However, as of mid-November, the Consumer Brands Association doesn't expect end-of-the-year levels to fall as low as they did in the spring.", "Jordan Liles is a Senior Reporter who has been with Snopes since 2016.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]