["About this rating", "A presidential trip taken in February 2013 incurred an estimated cost of $3.6 million.", "The estimated cost included both official business travel and a brief presidential vacation in Florida.", "On 26 October 2016 the Washington Times published an article reporting that President Obama's 2013 outing with golfing legend Tiger Woods cost the American taxpayer nearly $4 million:", "The Government Accountability Office reported [on 26 October 2016] that the departments of Defense and Homeland Security spent more than $3.6 million in travel costs and other expenses for Mr. Obama’s getaway weekend with Mr. Woods and other golf partners at an exclusive resort in Florida.", "The audit said the costs included operation of Air Force One, at about $200,000 per hour of flight, plus a virtual squadron of “supporting aircraft and U.S. Coast Guard small boats,” as well as per diem and other travel expenses for an unspecified number of Pentagon and Homeland Security personnel required to support the president’s golf weekend ... In all, Mr. Obama’s four-day excursion required six additional military transport planes flying eight missions with at least 22 total flight legs, involving 14 commercial airports and Air Force bases ranging from Joint Base McGuire in New Jersey to Dyess Air Force Base in Texas.", "Although the article contained hyperlinks to what may have looked to be citations supporting their story, those links led only to general and unrelated articles on the paper's own web site. Curiously absent was a link to the easily accessible Government Accountability Office (GAO) report about the 2013 \"golf outing\" or any information that would serve to substantiate the claims made.", "The February 2013 vacation during which President Obama played golf with Tiger Woods was widely reported, and the GAO did publish a report titled \"Estimated Costs for a Specific Presidential Trip to Illinois and Florida\" dated simply \"October 2016\" [PDF]. The words \"golf\" and \"Tiger Woods\" appeared nowhere in that GAO document, which began with an explanation of why the study was conducted and an overview of President Obama's activities between 15 February 2013 and 18 February 2013:", "Why GAO Did This Study", "According to White House officials, to be able to communicate instantly with the U.S. military, the President flies on military aircraft whenever he travels — whether for official, political, or other non-official reasons. On February 15, 2013, the President flew from Joint Base Andrews in Maryland to Chicago, Illinois to deliver remarks on economic proposals that he introduced in his State of the Union address on February 12, 2013, later flew to Palm Beach, Florida for vacation, and then returned to Joint Base Andrews.", "GAO was asked to identify the costs associated with the President’s February 15, 2013 through February 18, 2013, travel to Illinois and Florida. This review was conducted in response to a request from Senator Barrasso, then Ranking Member, Subcommittee on Transportation and Infrastructure, Senate Committee on Environment and Public Works. This report provides information on the major costs incurred by DOD and DHS in supporting the President’s February 2013 trip to Illinois and Florida.", "GAO examined cost data from DOD and DHS on aircraft operating costs, per diem expenses, and other significant costs. Additionally, GAO interviewed knowledgeable officials from the White House, DOD, and DHS who were involved in supporting presidential travel. GAO also examined relevant guidance.", "To the column's left was a section summarizing the GAO's findings:", "GAO estimated that the major costs incurred by the Department of Defense (DOD) and the Department of Homeland Security (DHS) for the President’s travel to Chicago, Illinois, and Palm Beach, Florida, from February 15, 2013, through February 18, 2013, were about $3.6 million, of which about $2.8 million in costs were incurred by DOD and $0.77 million by DHS (specifically, the U.S. Coast Guard and U.S. Secret Service). These costs consisted of the (1) operating expenses of the President’s aircraft, supporting aircraft, and U.S. Coast Guard small boats; and (2) travel expenses, which include per diem (lodging and meals), commercial airfare, and rental cars for DOD and DHS personnel supporting the trip. They exclude certain classified DOD costs, and the salaries and benefits of U.S. government civilian and military personnel traveling with the President or involved with agency travel preparations since these personnel would have received their salaries and benefits for the conduct of their regular duties and responsibilities regardless of whether the President traveled. The table highlights the estimated major costs associated with the President’s February 2013 trip.", "The audit was requested by Wyoming Sen. John Barrasso in November 2013. In a letter attributed to Barrasso (the full text of which was unavailable), the Senator was quoted as saying of the request:", "At a time when government agencies and programs were preparing to implement tough cost-saving measures in order to meet the budgetary constraints of sequestration. President Obama chose to use taxpayer money for a weekend trip to play golf. I have heard from a number of concerned constituents in my state who believe the money used for this trip could have been spent in a manner that would have reduced the federal deficit or have helped reduce the impact of sequestration on the public.", "Barrasso referenced the cost of the trip as a potential offset to the federal deficit, which just prior to his November 2013 request news outlets  reported had fallen to $680 billion in Fiscal Year 2013. Were President Obama's travels in that three-day period rounded up to $4 million, that cost would account for 0.00059 percent of the 2013 federal deficit.", "In a response to Barrasso dated 11 October 2016, the GAO reported:", "You requested that we examine DOD’s and DHS’s (Secret Service and Coast Guard) costs associated with the President’s February 15, 2013, Letter Page 2 GAO-17-24 Presidential Travel through February 18, 2013 travel to Illinois and Florida. On February 15, 2013, the President flew from Joint Base Andrews in Maryland to Chicago, Illinois. The President delivered remarks at Hyde Park Academy and discussed economic proposals introduced in the State of the Union address given on February 12, 2013. Afterwards, the President flew from Chicago to Palm Beach, Florida, before returning to Joint Base Andrews on February 18, 2013. No public events were scheduled while the President was in Florida; White House officials stated the President was on vacation during this time. This report provides information on the major costs incurred by DOD and DHS for the President’s February 15, 2013, through February 18, 2013, travel.", "To estimate the major costs of the February 15, 2013 through February 18, 2013 trip, we collected data from DOD organizations including: the Air Force’s 89th Airlift Wing at Joint Base Andrews, Maryland; the Marine Corps’ Helicopter Squadron One at Marine Corps Base Quantico, Virginia; and the Air Mobility Command, Scott Air Force Base, Illinois, and DOD’s Military Working Dog Program—all of which provided support for the President’s trip. We also collected data from the Secret Service and the U.S. Coast Guard. These data include fiscal year 2013 aircraft and boat-related operating expenses and travel expenses—including commercial air travel and per diem expenses (such as food and lodging) and rental cars for DOD, the Secret Service, and Coast Guard personnel supporting the trip. We calculated aircraft-related operating expenses for the President’s 2013 trip by using the estimated cost per flight hour and the actual flight hours for each specific aircraft type as reported to us by the Air Force and Marine Corps to estimate the total cost per aircraft involved. We obtained the estimated cost per flight hour rate from the Air Force and Marine Corps.", "According to the GAO report on which the articles about President Obama's alleged $4 million golf outing with Tiger Woods were based, the costs of President Obama's trips to Illinois and Florida in February 2013 \"were about $3.6 million, of which about $2.8 million in costs were incurred by DOD and $0.77 million by DHS.\" The total sum referenced in the \"$4 million\" number was not only rounded up from the $3.6 million estimate, but it combined the costs of an official business trip as well as a brief vacation in Florida. Although President Obama met and played golf with Tiger Woods during the second leg of his travel, that outing did not itself cost $3.6 million dollars (or any specific amount of money cited in the GAO audit).", "Any presidential travel is necessarily costly in general (from an accounting standpoint, at least), but we note in a separate article that estimated expenses for presidential air travel are based on an accounting formula that is often highly misleading about the true costs involved.", "Boyer, Dave.   \"Obama’s Golf Weekend With Tiger Woods Cost Taxpayers More Than $3.6 Million.\"\r\n    Washington Times.   26 October 2016.", "Calmes, Jackie.   \"Back In A Swing State, This Time For Sport.\"\r\n    New York Times.   17 February 2013.", "Holland, Steve.   \"In A First, Obama Plays Golf With Tiger Woods.\"\r\n    Reuters.   17 February 2013.", "Irwin, Neil.   \"Congratulations, America! Your Deficit Fell 37 Percent In 2013.\"\r\n    Washington Post.   31 October 2013.", "Sahadi, Jeanne.   \"U.S. Deficit Falls To $680 Billion.\"\r\n    CNNMoney.   30 October 2013.", "United States Government Accountability Office.   \"Report To The Honorable John Barrasso, U.S. Senate: Presidential Travel; Estimated Costs For A Specific Presidential Trip To Illinois And Florida.\"\r\n    October 2016.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]