["About this rating", "An Atlanta NAACP leader said in an interview that the Civil War carving should be removed from Stone Mountain.", "The national NAACP organization has called for no specific action to have the Civil War carving removed from Stone Mountain.", "In mid-2015, the historic Stone Mountain Confederate Memorial Carving was the focus of controversy over the display of Confederate symbols following a June 2015 mass shooting in Charleston, South Carolina.", "In June 2015, rumors claimed that a petition was being circulated that aimed to destroy the Stone Mountain carving permanently, but those rumors referenced a long-inactive petition that antedated the Charleston massacre.  Then a \"like and share\" image began to circulate online alongside claims that the National Association for the Advancement of Colored People (NAACP) had issued a formal statement demanding the memorial be \"sand-blasted off\" Stone Mountain:", "That rumor was particularly upsetting to those opposing the removal of Confederate symbols, who feared the carving (along with parts of Southern history) would be permanently destroyed.", "News articles and social media posts referencing the NAACP claim overwhelmingly linked back to a single article published by Atlanta television station WSB-TV on 13 July 2015, titled \"NAACP Wants Removal of Confederate Generals from Stone Mountain.\" The article quoted Atlanta NAACP chapter president Richard Rose, who opined that the Stone Mountain carving ought to be removed (and used the term \"sand-blasted\"):", "The organization issued a statement calling for the removal of all symbols of the Confederacy from the park.     \"My tax dollars should not be used to commemorate slavery,\" Rose said.      Rose said his group wants Confederate symbols removed from all state-owned buildings, parks and lands.       Rose told Petersen he would start with Jefferson Davis, Robert E. Lee and Stonewall Jackson.     \"Those guys need to go. They can be sand-blasted off, or somebody could carefully remove a slab of that and auction it off to the highest bidder,\" Rose said.", "The following day (14 July 2015) the Atlanta Journal-Constitution published an article titled \"Sandblasting the Confederate Faces Off Stone Mountain? Yeah, Right.\" Curiously, what appeared to be link to the purported NAACP statement merely led to an image of the carving and a photograph of a document (which was undated and nearly impossible to read):", "Although subsequent references to an NAACP statement calling for the destruction of the Stone Mountain carving were rife in articles across the web, we were unable to locate an actual copy of the purported statement to review its content or substantiate its existence. No mention of it appeared on the Atlanta NAACP's web site, nor was it mentioned on their Facebook  page. No information was provided in any reference to it about the date on which it was issued, what its content may have been, or what formal action was supposedly being sought by the Atlanta NAACP chapter.", "It's true Atlanta NAACP chapter president Richard Rose said that the Stone Mountain carving should be \"sand-blasted off\" the mountain in a June 2015 interview and that the following day the Journal-Constitution referenced a \"statement\" from the local NAACP chapter. However, we were unable to locate a purported statement released by that chapter (or the larger national NAACP organization) demanding such an action. Moreover, whether such an action is even possible or plausible (not to mention under consideration to any meaningful degree) is doubtful.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]