["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Rashida Tlaib, Democratic candidate for Michigan's 13th Congressional District, speaks at a rally in Dearborn, Mich., Friday, Oct. 26, 2018. (AP)", "Newly minted Democratic U.S. Rep. Rashida Tlaib has made headlines during her first week in office, from being the first Palestinian woman elected to the U.S. House to using profanity as part of a vow to impeach President Donald Trump.", "Now, an offensive tweet supposedly made by Tlaib is going around social media.", "The tweet reads:", "\"Americans have spent decades raping and pillaging my people. What goes around comes around. #FridayFeeling\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The tweet, made shortly after 10 a.m. on Jan. 4, is not from Tlaib’s account and no longer exists on Twitter.", "It’s a hoax.", "Tlaib’s real account is verified and has the blue checkmark badge by her name. The tweet referenced in the Facebook post came from an account that is not – and one that has since been deleted or removed from the social media platform.", "The fake account also tried to make it appear as if Tlaib’s name was spelled correctly, but it wasn’t. It used an uppercase \"i\" in place of the lowercase \"L\" in her last name. When her name is spelled accurately on Twitter, the result is that the lowercase \"L\" reaches higher than the \"T\" in her last name. When misspelled with an uppercase \"i\", that faux-\"L\" only comes in at about the same height as the T.", "Moreover, Tlaib’s Twitter following is around 277,000, a number more on par for a member of the U.S. House than the 30 followers the hoax account had amassed before it was removed.", "We rate this claim Pants on Fire!", "Tweet screenshot", "NBC, Tlaib apologizes — for 'distraction,' not for cursing Trump or impeachment charge,", "Rashida Tlaib twitter account, Accessed Jan. 9, 2019", "Press&Guide,  Fake Tlaib account tweets about ‘raping and pillaging’ America, Jan. 8, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]