["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Former Hewlett Packard CEO Carly Fiorina gestures during the third Republican presidential debate. (Getty images)", "Carly Fiorina said on Fox News Sunday that she \"misspoke\" when she used a striking but inaccurate statistic about women and unemployment during the third GOP debate. Nonetheless, Fiorina suggested the real culprit is the \"liberal media.\"", "Numerous fact-checkers, including PolitiFact, debunked Fiorina’s claim that \"92 percent of the jobs lost during Barack Obama’s first term belonged to women.\" To FIorina, that’s quibbling with details to bury the larger truths.", "\"This is what the liberal media tries to do. Let us discredit the messenger so that we ignore the truth of the message,\" she said Nov. 1. \"Here’s the truth of the message: Women are harmed by this administration’s policies. Record numbers of women have lost jobs, are living in poverty, or are living in extreme poverty.\"", "Progressive policies, Fiorina continued, have been bad for everyone, regardless of gender: \"We have record numbers of people who are no longer working or who have quit looking for work. We have record numbers of people on food stamps. We have record numbers of people living in poverty. Those are the facts. That is the truth.\"", "We wanted to check out her claim that there are more people living in poverty now than ever before.", "What the numbers say", "Looking at data from the Census Bureau, Fiorina’s right that the number of people living in poverty (46.7 million in 2014) is the highest since the census began keeping track in 1959. However, the poverty rate — the measure typically used — is nowhere near historical highs.", "There are 8 more million people living in poverty now than in 1959, but the overall population of the United States also grew by 141 million people (from 177 million in 1959 to 318 million in 2014). So the poverty rate actually decreased from 22.4 percent in 1959 to 14.8 percent in 2014.", "\"Most economists would agree that standards of living have increased substantially since 1959, and poverty, especially elderly poverty, was more severe in 1959 than today,\" said John Iceland, a professor of sociology and demography at Pennsylvania State University and author of  Poverty in America.", "Here’s a graph from a Census Bureau report published in September of 2015 that illustrates this point:", "All the experts we spoke to cautioned against using raw numbers when making comparisons. Instead, analysts typically use rates to correct for the growing population of the nation.", "\"If we use absolute values and not rates, then the following statements are both true: There are more people who are poor than ever today. But GDP is much higher today than it ever was under a Republican president, so the Obama Administration economic policy is a smashing success,\" said Sheldon Danziger, the president of the nonpartisan Russell Sage Foundation, which funds research on poverty.", "If we use Fiorina’s preferred measure, we reached a record number of people living in poverty under the watch of every president starting with Richard Nixon, Danziger pointed out. Conversely, said George Washington University economist Tara Sinclair, the number of people not living in poverty has also increased.", "\"No president in the last 40 years has been able to lower the number of people in poverty. Poverty rates fell most under the Bill Clinton Administration than any since Nixon,\" Danziger said.", "What’s more, given the economic impact of the recession, poverty is actually lower than expected, in part due to spending in the stimulus package, according to Austin Nichols, a senior research associate at the Urban Institute, a nonpartisan economic and social policy think tank.", "\"So if Obama had any effect on poverty, it was to lower poverty, though presidents tend to have smaller impacts on broad economic trends than they would like to believe,\" he said. \"In fact, when you use a broader definition of poverty that encompasses noncash aid, poverty hardly changed through the recession, which was a surprise to many who work on these issues.\"", "As for Fiorina’s claim that \"record numbers of women ...are living in poverty,\" she’s again accurate that more women live in poverty today than ever (about 162,000 in 2014). But the overall rate has remained relatively unchanged.", "Here’s a chart using census data that illustrates that point:", "A Fiorina spokeswoman passed along two articles highlighting the increase in raw numbers and told PolitiFact that the increase should not be trivialized.", "Our ruling", "Fiorina said, \"We have record numbers of people living in poverty today.\"", "In terms of raw numbers, Fiorina is correct that more people live in poverty today than ever in the 56 years the census has been keeping track.", "However, absolute value is an inappropriate measure for poverty analysis, experts said. If we use the right measure, poverty rate, we see that poverty has decreased significantly since 1959.", "We rate Fiorina’s claim Half True.", "Fox News, Fox News Sunday, Nov. 1, 2015", "Email interview with Anna Epstein, spokesperson for Carly Fiorina, Nov. 1, 2015", "Email interview with John Iceland, professor of sociology and demography at Pennsylvania State University, Nov. 1, 2015", "Email interview with Sheldon Danziger, president of the nonpartisan Russell Sage Foundation, Nov. 1, 2015", "Email interview with Austin Nichols, a senior research associate at the Urban Institute, Nov. 1, 2015", "Email interview with Tara Sinclair, professor economics at George Washington University, Nov. 1, 2015", "U.S. Census Bureau, \"Income and Poverty in the United States: 2014,\" September 2015", "U.S. Census Bureau, \"Table 7. Poverty, by Sex,\" accessed Nov. 1, 2015", "PolitiFact, \"Fiorina levies out-of-date charge on women job losses under Obama,\" Oct. 29, 2015", "PolitiFact Georgia, \"Perdue claim on women in poverty off mark,\" Oct. 15, 2014", "PolitiFact Virginia, \"Kirk Cox says number of Americans in poverty is at historic high,\" July 11, 2014", "PolitiFact, \"Bernie Sanders says poverty in U.S. is at an all-time high,\" Jan. 23, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]