["About this rating", "Some of the most chilling photographs documenting the horrors of the Holocaust feature neither the perpetrators nor the victims of that genocide.  Rather, these haunting images document enormous caches of suitcases, clothing, hair, shoes, eyeglasses, artificial limbs, jewelry teeth, and other items confiscated from victims sent to various Nazi death camps:", "POLAND - CIRCA 1939:  War 1939-1945. Auschwitz's concentration camp: the hangar of shoes. Roger Viollet via Getty Images-34332  (Photo by Roger Viollet via Getty Images/Roger Viollet via Getty Images)\n\nSuch pictures are spine-chilling both because they provide an easily assimilable visual depiction of the sheer scale and enormity of the Holocaust, and because they offer a visceral reminder of how Nazi ideology viewed certain classes of human beings as nothing more than raw material to be exploited and disposed of:", "Accused Nazi war criminal Josef Schwammberger used pliers to rip out Jews’ gold teeth and forced concentration camp prisoners to strip before having them killed and cremated, witnesses said in accounts ...", "One account was from Siegfried Kellermann, who spoke to Innsbruck police in 1946 about the roundup three years earlier of Jews from the southeastern Polish town of Przemysl.", "″There was a huge wood pile, which was set on fire and all people had to strip naked and give up any gold, money and jewelry,″ Kellermann said in describing Schwammberger’s treatment of the prisoners.", "″Schwammberger and two or three other men killed the people, and their bodies were immediately thrown into the fire.″", "Heinrich Kirschenbaum, a former inmate in the camp at Mielec near Krakow, told investigators Schwammberger checked to see if inmates had gold teeth and told those who did to report to him at night.", "″After they showed up, Schwammberger personally ripped out their gold teeth with a pliers,″ according to the file report.", "One picture of this type is frequently circulated via social media, said to show wedding or engagement rings removed from the fingers of Holocaust victims:", "The photograph included in the above tweet is indeed a genuine archival representation of this class of image. The accompanying caption provided by Getty Images describes it as follows: \"A US soldier inspects thousands of gold wedding bands taken from Jews by the Nazis and stashed in the Heilbronn Salt Mines on May 3, 1945, in Germany. The treasures were uncovered by allied forces after the defeat of Nazi Germany.\"", "A US soldier inspects thousands of gold wedding bands taken from Jews by the Nazis and stashed in the Heilbronn Salt Mines on May 3, 1945, in Germany. The treasures were uncovered by allied forces after the defeat of Nazi Germany.", "The U.S. Holocaust Memorial Museum archives the same photograph with an expanded description of what it depicts:", "A soldier dips his hands into a crate full of rings confiscated from prisoners in Buchenwald and found by American troops in a cave adjoining the concentration camp.", "Original caption reads: \"These are a few of the thousands of wedding rings the Germans removed from their victims in order to salvage the gold. U.S. First Army troops found these rings, with watches, precious stones, eyeglasses, and gold teeth fillings, in a cave adjoining the Buchenwald concentration camp near Weimar, Germany. 5/5/45.\"", "Original caption from donated photograph: \"Every wedding ring here represents a home broken and a human murdered by the Germans. These are only a small portion of the thousands of wedding rings the Germans removed from their prisoners to salvage the gold at the notorious Buchenwald concentration camp near Weimar, Germany. U.S. troops discovered these rings along with watches, precious stones, eyeglasses, and even gold teeth fillings when they liberated the camp and freed 21,000 prisoners in April, 1945. Death already had liberated 70,000 who were starved or butchered during the Nazi reign of terror.\"", "Costelloe, Kevin.   \"Files Say Nazi Victims’ Gold Teeth Yanked; Bodies Thrown into Bonfire.\"\r\n    Associated Press.   25 November 1987.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]