["About this rating", "On 18 January 2016, the above-displayed video featuring footage of violent refugees accompanied by audio of Republican presidential candidate Donald Trump reciting the lyrics to a song entitled \"The Snake\" was uploaded to YouTube along with a message warning about the \"Islamification\" of the United States:", "Do not allow the islamification currently happening in Europe to reach America. Act now before its too late.", "The above-displayed video does feature audio of Trump reciting the lyrics to the song \"The Snake.\" The Republican Presidential candidate has recited this poem at at least one of his campaign events in an attempt to illustrate the alleged dangers of allowing Syrian refugees to enter the United States:", "Although the audio portion of the clip really does feature Donald Trump, this video is often shared with misinformation about its origins.", "First, \"The Snake\" was not written by Donald Trump, nor was it written specifically about Syrian refugees. The song was penned by Chicago poet, singer, and \"Grandpap of Rap\" Oscar Brown Jr., and it was based an Aesop fable titled \"The Farmer and the Viper\":", "While some may see \"The Snake\" as a particularly apt song to describe the refugee crisis, Oscar Brown Jr.'s family disagreed. Brown's daughter Maggie told the Chicago Tribune that she wanted Trump to stop using the poem, while Brown's grandson suggested that Trump read some more of Oscar Brown Jr.'s poetry — specifically \"Debris,\" about the aftermath of the 9/11 terrorist attacks:", "\"So efforts to terrorize terror / Just guarantee terror no end / A violent response is in error / For violence then will extend.\"", "The origins of the visual images in the video are also questionable. These violent scenes supposedly depict the results of \"Islamification,\" but we found at least one segment that had nothing to do with refugees or religion:", "in", "This screenshot captures an assault of a young couple that took place outside a bar in Missouri in 2014, not violence perpetrated by Muslims or refugees.", "A similar tactic — showing a rapid succession of unrelated violent footage in an attempt to legitimize a general claim — was also used in the \"Gates Wide Open\" video.", "Finally, it should be noted that this video was not produced by Donald Trump or his campaign. The GOP candidate did recite the lyrics to the song \"The Snake\" during a campaign rally, and he did use the poem to illustrate the dangers of taking in Syrian Refugees, but he was not responsible for the creation of \"The Vicious Snake\" video.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]