["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Researchers have not been able to find evidence supporting claims that the former president said this.", "And so, my fellow Americans: ask not what your country can do for you—ask what PolitiFact can do for your country.", "That’s not a John F. Kennedy quote (though it’s close to something the former president said during his inaugural address), and neither is this one that was posted on Facebook on March 30.", "\"There’s a plot in this country to enslave every man, woman and child,\" reads the text of a photo of what looks like a flyer pasted to a phone pole. \"Before I leave this high and noble office, I intend to expose this plot.\"", "The quote is attributed to President Kennedy, whose photo is featured. It says Kennedy uttered these words seven days before his assassination. Kennedy was shot to death on Nov. 22, 1963.", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "We couldn’t find the quote included in a list of quotations by the president on the John F. Kennedy Presidential Library and Museum website. But the library is often asked about the statement, said archivist Stacey Chandler.", "\"When there is a credit or citation line, it typically suggests this was part of a speech at Columbia University in late November 1963,\" she said. Sometimes the quote is attributed to Kennedy on Nov. 15, 1963, she said. Other times, it’s Nov. 12, 1963. But researchers have never found evidence that Kennedy spoke at Columbia on either of those dates, or any time in 1963, according to Chandler.", "The library also has records related to speeches he delivered as president and he gave two on the 15th, seven days before his assassination, but those don’t appear in either, Chandler said.", "You can read transcripts of the speeches he gave in New York City that day here—at the  AFL-CIO convention—and here, at the National Convention of the Catholic Youth Organization.", "His schedule from Nov. 15 doesn’t include a visit to Columbia nor any other speeches or events.", "Chandler said the library has a few ways of searching presidential statements, including keyword searches of archival holdings, historical newspaper coverage and speech databases such as the Presidency Project at the University of California, Santa Barbara.", "\"We’ve never found a match for this statement through any of these resources, and we haven’t been able to confirm it via secondary sources, either,\" Chandler said.", "Marc J. Selverstone, chair of the Presidential Recordings Program at the University of Virginia, told us that the Facebook post has no validity.", "\"Never seen it in any reputable source,\" he said.", "We couldn’t find it in one either. We rate it False.", "Facebook post, March 30, 2019", "John F. Kennedy Presidential Library and Museum, \"Ask not what your country can do for you…\" visited April 2, 2019", "John F. Kennedy Presidential Library and Museum, John F. Kennedy Quotations, visited April 2, 2019", "John F. Kennedy Presidential Library and Museum, Remarks in New York City at the AFL-CIO Convention, Nov. 15, 1963", "John F. Kennedy Presidential Library and Museum, Remarks in New York City at the National Convention of the Catholic Youth Organization, Nov. 15, 1963", "John F. Kennedy Presidential Library and Museum, John F. Kennedy’s schedules in November 1963", "Email interview with Stacey Chandler, archivist, John F. Kennedy Presidential Library, April 2, 2019", "Email interview with Marc J. Selverstone, chair, presidential recordings program, University of Virginia, April 2, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]