["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "An election inspector checks the names of voters as the counting of ballots begins on Election Day at City Hall in Warren, Mich., in Macomb County on Nov. 3, 2020. (AP/Goldman)", "Conservatives on social media were sharing screenshots of the election map from Decision Desk HQ. The screenshots appeared to show that in one overnight update, Biden received a large number of voters while Trump and other candidates got none.", "A Decision Desk HQ spokesperson said the change was the result of an error in a file sent by the state. The state corrected the error, and Decision Desk HQ followed.", "Votes cast legally on or before Election Day will continue to be counted for several days. Counting these votes is part of the process and not a sign of voter fraud, which is rare.", "Widespread posts about vote tallies in Michigan are taking off online as conservatives ramp up their efforts to sow doubt over the legitimacy of legally cast ballots counted after Election Day.", "Hours after President Donald Trump called for the counting of votes cast before Election Day to cease and falsely declared that he’d won reelection, right-leaning pundits and politicians began circulating a pair of misleading screenshots that they claimed showed potential election fraud in Michigan.", "The screenshots showed a change in the vote tallies as they appeared on the elections map powered by Decision Desk HQ, an election data and analysis service. The photos appeared to show that in one update overnight, Democratic presidential nominee Joe Biden received a sudden influx of 138,339 votes in Michigan while other candidates received none.", "\"An update gives Biden 100% of new votes — 128k+,\" said Matt Mackowiak, founder of a GOP political communications firm, in one of the first tweets that spotlighted the two screenshots.", "Mackowiak later deleted his tweet, which Twitter had labeled as potentially misleading. \"I have now learned the MI update referenced was a typo in one county,\" he wrote in a second tweet.", "A screenshot of Matt Mackowiak's since-deleted tweet about Michigan.", "But the correction hasn’t gotten nearly the same attention as the first tweet, which was spread widely among conservatives. Many claimed the photos showed proof of \"fraud\" or \"theft\" or illegality by Democrats in Michigan who had \"magically found\" ballots for Biden, the former vice president.", "Trump shared a retweet of Mackowiak’s tweet, writing, \"What is this all about?\"", "WHAT IS THIS ALL ABOUT? https://t.co/6487pYLZnL", "Similarly misleading claims based on the same screenshots also circulated on Facebook, where they were flagged as part of the platform’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "In reality, the influx of 138,339 votes for Biden referenced in the social media posts were the result of a data error, said Drew McCoy, a spokesperson for Decision Desk HQ. They were not indicative of voter fraud, mysteriously surfaced votes or other nefarious actions by Democrats.", "\"It was a simple error from a file created by the state that we ingested,\" McCoy said of the viral screenshots, noting that Decision Desk HQ does not make changes to state-provided files.", "\"The state noticed the error and produced an updated count,\" McCoy said. \"Once they did, we updated the count accordingly. This happens on election night, and we expect other vote tabulators in (Michigan) experienced this error and corrected in real-time like we did.\"", "The correction appears to be reflected in tweets Decision Desk HQ sent as the results trickled in from Michigan on Nov. 4. In one tweet posted at 5:04 a.m. EST, the service reported 2,130,695 votes for Biden and 2,200,902 votes for Trump. In another tweet at 5:43 a.m. EST, the service reduced the vote count for Biden, putting him at 2,019,899 votes to Trump’s 2,217,540.", "As the Detroit Free Press noted, several Twitter users responded to the 5:04 a.m. EST tweet saying that the error seemed to be linked to the vote totals in Shiawassee County.", "\"This kind of funkiness is typical,\" said Alex Halderman, a professor of computer science and engineering and elections security expert at the University of Michigan. \"Preliminary results are sometimes updated manually by copying and pasting from a spreadsheet. The error could simply be that one candidate's totals were updated but not the other's.\"", "Votes that were cast legally on or before Election Day are still being counted in Michigan and in other battleground states, as is routine for presidential elections and unsurprising in a pandemic. Experts have warned for months that results could be slowed by the high use of mail-in ballots.", "Absentee ballots in the state are expected to tilt toward Biden, the Detroit Free Press reported.", "Michigan Secretary of State Jocelyn Benson said in a Nov. 4 press conference that she was not aware of the social media posts alleging a mysterious or fraudulent influx of overnight votes cast for Biden. She warned about \"the use of false graphics to try to indicate that there’s some sort of problem happening\" and encouraged the public to consult official state sources for the results.", "\"We understand that the eyes of the nation are on Michigan right now, and our voters and these ballots,\" Benson said. \"We’re committed to ensuring accuracy and that every vote is counted and every ballot is validated.\"", "A number of tweets claimed that Biden received a suspicious, potentially fraudulent influx of 138,339 votes in Michigan overnight while other candidates received none.", "The update that appeared to show large numbers of ballots delivered to Biden all at once was the result of a data error, the spokesperson for Decision Desk HQ told PolitiFact.", "The error was promptly corrected and not indicative of voter fraud or any other nefarious action by Democrats or the state.", "We rate such claims False.", "PolitiFact Michigan reporter Clara Hendrickson contributed reporting to this fact-check.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more.", "Matt Mackowiak on Twitter, Nov. 4, 2020", "Matt Mackowiak on Twitter, Nov. 4, 2020", "Donald J. Trump on Twitter, Nov. 4, 2020", "Various Twitter posts, Nov. 4, 2020", "Various Facebook posts, Nov. 4, 2020", "Decision Desk HQ, \"2020 General Election Results,\" accessed Nov. 4, 2020", "Fox News on YouTube, \"Michigan officials to provide election updates,\" Nov. 4, 2020", "Detroit Free Press, \"Huge absentee vote count underway in Michigan as Biden, Trump grab other states,\" Nov. 4, 2020", "Detroit Free Press, \"No, Joe Biden did not magically 'find' votes in Michigan,\" Nov. 4, 2020", "Buzzfeed News, \"Here's A Running List Of False And Misleading Information About The Election,\" Nov. 4, 2020", "Snopes, \"RUMOR ALERT: Biden Did Not Receive 100% of 128K New Votes in Michigan,\" Nov. 4, 2020", "PolitiFact, \"Trump falsely and prematurely claims 2020 presidential victory,\" Nov. 4, 2020", "PolitiFact, \"Trump spokesman Jason Miller paints dubious picture of Election Night,\" Nov. 1, 2020", "PolitiFact, \"Be patient on election night 2020: Counting the returns will take time,\" June 18, 2020", "Email interview with Drew McCoy, spokesperson for Decision Desk HQ, Nov. 4, 2020", "Email interview with Alex Halderman, professor of computer science and engineering and the director of the Center for Computer Security and Society at the University of Michigan, Nov. 4, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]