["About this rating", "President Clinton fired FBI Director William Sessions on 19 July 1993, one day before Deputy White House Counsel Vince Foster, a longtime associate of the Clintons, was found dead of a self-inflicted gunshot wound.", "There is nothing inherently suspicious about the coincidental timing of Sessions's firing and Vince Foster's death (which was determined to be a suicide).", "On 11 May 2017, two days into a firestorm ignited by President Trump's dismissal of FBI Director James Comey, who was investigating possible links between Trump's presidential campaign and Russian efforts to disrupt the 2016 election, supporters of the administration took to social media to deflect attention elsewhere.", "Cued, perhaps, by the innumerable talking heads on cable television pointing out that only once before in American history had an FBI director been fired in the middle of his term by the president — namely, when Bill Clinton axed William Sessions on 19 July 1993 — one of the go-to concepts was an implied link between Sessions's firing and the death of longtime Clinton crony and Deputy White House Counsel Vince Foster the following day (20 July 1993).", "For example:", "Clinton cash $675K McCabe is Acting FBI Director.", "Oh, and Clinton fired his FBI head the day before Vince Foster was found dead. pic.twitter.com/gg2kuOwqLD", "— ?AMERICA?FIRST? (@TrueNevvs) May 11, 2017", "Here's another example that was retweeted nearly 4,000 times (including once by President Trump's son, Donald Trump, Jr., who evidently found it compelling):", "President Clinton fired his FBI director on July 19th, 1993, The Day before Vince Foster was found dead in Marcy Park.#ThursdayThoughts pic.twitter.com/wgbv9lAhDV", "— ?STOCK MONSTER? (@StockMonsterUSA) May 11, 2017", "The Sessions/Foster linkage was also promoted in articles on right-leaning blogs and web sites such as 100PercentFedUp.com. Apart from an interminable recitation of an old, discredited conspiracy theory implicating the Clintons in Foster's death, however, the only argument these venues can come up with for there being a connection between the Sessions firing and Foster's death is this:", "President Bill Clinton fired FBI Director William S. Sessions on July 19, 1993.", "Vince Foster was found dead on July 20, 1993.", "Was the suspicious death of Vince Foster and the firing of Republican FBI Director William S. Sessions firing a coincidence? Did President Clinton need an FBI Director who was willing to look the other way when it came to the alleged criminal activities of the Clintons?", "In lieu of an argument, there is only innuendo. In terms of actual evidence, none is offered. In point of fact, a review of the facts of each case leaves no reason to suspect, much less conclude, that they are connected.", "William Sessions, who had experience as both a practicing attorney and U.S. District Judge, was nominated as FBI Director by President Ronald Reagan and sworn in on 2 November 1987. After serving under both Reagan and George H. W. Bush, Sessions was still in the post at the time of Bill Clinton's inauguration in 1993, but was beset by accusations of ethical improprieties. These were laid out in a report by the Justice Department's Office of Professional Responsibility, as follows by the New York Times reported at the time:", "The report found that Mr. Sessions had taken numerous free trips aboard F.B.I. aircraft to visits friends and relatives, often taking along his wife, Alice. The report, which was endorsed officially by Attorney General William P. Barr on his last day in office, detailed a litany of abuses. It is a lacerating portrayal of the Director as an official who was in charge of enforcing the law but who seemed blase about perceptions of his own conduct.", "At the behest of Attorney General Janet Reno, who advised the president that Director Sessions could no longer lead the agency effectively in the wake of the accusations, Clinton asked for his resignation, which Sessions, who denied any wrongdoing, refused to turn over. After a six-month stalemate during which morale at the FBI hit a \"new low,\" according to the New York Times, President Clinton summarily dismissed Sessions on 19 July 1993.", "Vince Foster, who was a childhood friend of Bill Clinton's and helped Hillary Clinton secure a position at the Rose Law Firm in Little Rock, Arkansas, served on President-elect Clinton's transition team after the 1992 election and went on to be the Deputy White House Counsel. Despite having been a successful attorney, the Washington Post reported, Foster found the White House job extremely daunting and suffered from anxiety and depression. Special Counsel Robert B. Fiske, Jr., who later investigated the circumstances surrounding Foster's death, concluded he wasn't emotionally equipped to handle the stress:", "From the pinnacle of the Arkansas legal establishment, Foster leaped into the service of his boyhood friend, Bill Clinton, after Clinton was elected president. According to Fiske, the toll on Foster was intense from the beginning. During the transition period – when he vetted a number of top appointees – Foster complained to his Little Rock physician of depression and anxiety.", "His symptoms grew worse when he got to Washington. In January 1993, Zoe E. Baird was forced to withdraw her nomination as attorney general because she had failed to pay taxes for a nanny; fresh from his inauguration, President Clinton was hit with charges of elitism and corner-cutting and incompetent screening. Foster blamed himself – the Fiske report shows him constantly shouldering blame for mistakes made in the chaotic White House – and the night of the Baird debacle Foster was literally sick from a panic attack.", "The embarrassment was even greater when seven employees of the White House travel office were summarily fired amid hints of financial shenanigans, because it turned out the investigation had been slapdash, the firings hasty, and the odor of cronyism hung over the whole affair. The \"Travelgate\" fallout singed Foster and burned his friend and protege, William Kennedy, also of the counsel's office. Kennedy drew an official reprimand.", "Distraught at the prospect of facing a Congressional hearing, Foster developed insomnia and went deeper and deeper into depression. On 19 July 1993, his doctor prescribed an anti-depressant, which Foster began taking. On 20 July, he left his office after lunch, drove to Fort Marcy Park in Virginia, and shot himself once in the mouth.", "Despite conspiracy theories that swirled at the time (and continue, obviously, to make the rounds to this day), five separate investigations over time have concluded that Foster's death was a suicide.", "Each of the two cases under discussion has its own timeline of events, neither of which intersects in any significant way with the other. Although an effort has been made to link them via innuendo, no plausible reason has been put forward by anyone to think their occurrence one day apart in 1993 is anything other than a coincidence.", "Johnston, David.   \"Defiant FBI Chief Removed from Job by the President.\"\r\n   The New York Times.   20 July 1993.", "Kaczynski, Andrew.   \"Trump Jr. Shares Tweet Linking Clinton's Firing of FBI Director to Death of Vince Foster.\"\r\n   CNN.   11 May 2017.", "Kessler, Glenn.   \"No, Donald Trump, There's Nothing 'Fishy' About Vince Foster's Suicide.\"\r\n   The Washington Post.   25 May 2016.", "Von Drehle, David and Schneider, Howard.   \"Foster's Death a Suicide.\"\r\n   The Washington Post.   1 July 1994.", "Updated to clarify the claim that the two events are linked.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]