["On June 23, Patanjali Ayurved announced the launch of ‘Coronil’ and ‘Shwashari’ as a cure for coronavirus. Baba Ramdev touted the Ayurvedic drug as an effective treatment for the infection. The Ministry of AYUSH, however, halted its promotion and asked Patanjali to first submit reports to prove the drug’s efficacy. A claim subsequently viral on social media suggests that the AYUSH Ministry has certified Coronil and said that the drug adheres to all rules and regulations.", "‘Hindu Army Chief’ Manish Singh Yadav posted the claim on Facebook. He wrote, “आयुष मंत्रालय ने पतंजलि की दवाई ‘कोरोनिल’ को प्रमाणित कर दिया है, बाकायदा एक पत्र जारी कर के कहा है कि दवाई ने सभी नियम, कानून, मापदंडों का पालन किया है. अब कोई रोक नही.” His post drew 8,000 likes and over 1,000 shares.", "Twitter handle @RealPushpendra, which impersonates journalist Pushpendra Kulshrestha, tweeted the same. It was also promoted by two parody accounts of Republic TV anchor Arnab Goswami, @GoswamiArnaw and @Arnab5222.", "Several individuals and pages have also shared a screenshot of a tweet by Patanjali Ayurved’s chairman Balkrishna which carries a letter by the AYUSH Ministry.", "On June 24, Balkrishna had tweeted a copy of an email sent to him by the AYUSH Ministry. The subject line of the email reads, “News item related to “Shwashari Vati” & “Coronyl” for COVID 19 being publicized by Patanjali Yogapeetha, Haridwar – reg.” Balkrishna tweeted the letter as “The resolution of AYUSH controversy, finally!” However, the letter was only an acknowledgement of the documents submitted by Patanjali Ayurved. In a statement released a day earlier, the AYUSH Ministry had directed the company to submits documents to prove the drug’s efficacy. “Ministry will have the study documents verified for validation of the data of the research outcome,” reads the letter.", ".@moayush के विवाद की पूर्णाहुति! The resolution of AYUSH controversy, finally! @yogrishiramdev pic.twitter.com/TkZGkghWiQ", "— Acharya Balkrishna (@Ach_Balkrishna) June 24, 2020", "That Patanjali Ayurved submitted its research for verification was also reported in the media. As per the latest update, Union Minister of State in the AYUSH Ministry Shripad Naik said that the government will look into the report and decide about giving final permissions to the company.", "It is also noteworthy that Patanjali Ayurved had applied for license approval before promotion. However, “a licencing officer from the Uttarakhand government’s Ayurved department (which falls under the AYUSH Ministry) said the approval application for Coronil did not mention coronavirus.” The application only got licence approval as an immunity booster and for cough and fever.", "Patanjali’s Coronil has therefore not been approved as an effective treatment to cure coronavirus infections. Its reports are under review with the AYUSH Ministry. Alt News had recently published a sci-check which inferred that none of the scientific proofs submitted by Patanjali Ayurved suggests the efficacy of Coronil as a treatment for Covid-19. There is currently no cure for coronavirus and vaccine trials are ongoing.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]