["President Joe Biden talks during a CNN town hall event in Milwaukee. (AP Photo/Evan Vucci)", "Economists across the political spectrum back the idea of a substantial spending package to tackle the coronavirus and repair the damage it did to people’s lives and the economy.", "Economists differ greatly on the right amount of money Washington should spend, and how it should target the money.", "President Joe Biden has made beating the coronavirus and repairing the economic damage it unleashed his defining priorities. The central pillar of his strategy is a $1.9 trillion recovery plan.", "At a CNN town hall in Milwaukee, host Anderson Cooper asked Biden if he was committed to passing a $1.9 trillion bill, or if the number was up for negotiation.", "Biden responded as though there was no need for discussion. He said support for his package came from \"economists left, right and center.\"", "\"The overwhelming consensus is: In order to grow the economy a year or two, three, and four down the line, we can’t spend too much,\" Biden said Feb. 16. \"Now is the time we should be spending. Now is the time to go big.\"", "Economists across the political spectrum have indeed embraced delivering substantial relief, but when it comes to the total price tag, there’s more debate than he describes.", "Including among Democrats.", "In early February, former Obama administration Treasury Secretary Lawrence Summers voiced concerns. In a Washington Post op-ed, Summers warned that while the bill had to be big, there was a risk of overshoot. Spending too much on COVID-19, Summers said, would squeeze out money for other big plans, from infrastructure to renewable energy to preschool.", "\"After resolving the coronavirus crisis, how will political and economic space be found for the public investments that should be the nation’s highest priority?\" Summers wrote.", "Summers was not alone.", "The former chief economist for the International Monetary Fund, Olivier Blanchard, said $1.9 trillion was \"too much.\" Blanchard agreed with the plan’s main goals — spending on vaccines and health care, protecting the people who lost jobs and boosting demand. But Blanchard didn’t reach Biden’s total.", "\"When you make the sum of all these needs, which are real and have to be satisfied, you don't get to $1.9 trillion. You get to a smaller number,\" Blanchard said Feb. 8.", "Blanchard’s ballpark number was $1 trillion.", "Desmond Lachman, an economist at the American Enterprise Institute, a market-oriented think tank, agreed that there is consensus across the ideological spectrum in favor of additional economic stimulus. The supporters include Lachman’s onetime colleague at the institute Kevin Hassett, who joined the Trump administration as the chair of the Council of Economic Advisers.", "Hassett told CNN that he broadly supports Biden’s $1.9 trillion package.", "But Lachman said there’s uneven support for that level of spending.", "\"There are many economists who think that a package as large as a $1.9 trillion package is inviting trouble,\" Lachman said.", "Lachman, like the other more cautious economists, worries about overheating the economy with too much cash. The resulting inflation would lead to higher interest rates, which, Lachman argues, would send world financial markets into a tailspin.", "Ever eager to foster stability, the U.S. Federal Reserve offered calming words on that front. Chairman Jerome Powell said Feb. 10 that if a burst of spending drives prices up, he doesn’t think it would last, nor would it automatically trigger a rate increase.", "A recent survey puts some numbers to the range of opinions among economists.", "In January, the Wall Street Journal asked over 60 economists how much stimulus is needed. A bit more than half said less than $1 trillion would do. Just under half preferred an amount between $1 trillion and $2 trillion.", "Now, this was strictly a question about economic stimulus. Biden’s plan includes about $160 billion for coronavirus programs, and other pieces might come under the same umbrella. But at some top-line level, economists disagree over the size of the proposal.", "Jason Furman, chair of the Council of Economic Advisers in the Obama administration, suggested making the Biden plan more flexible. If economic growth remained weak after some initial stimulus, Furman would extend the aid for a longer time. If not, the government could dial back its spending.", "\"These provisions could also phase out aid more quickly than Mr. Biden proposes if the economy rebounds faster than expected,\" Furman wrote Jan. 25, 2021.", "Samuel Hammond with the Niskanen Center, a group named after an economic adviser to President Ronald Reagan, joined over 120 economists in a letter that called for \"substantial\" relief. But Hammond said he agrees with the concerns raised by Summers, and has reservations about a major part of the Biden plan: $350 billion for state and local governments.", "\"I think Larry (Summers) has been making some decent points about COVID relief, and the longer-term benefits of prioritizing public investments rather than a ton of state and local fiscal aid,\" Hammond said.", "The White House press office staff noted that support has come from top Democratic and Republican economists, and they pointed to statements from leading business groups such as the U.S. Chamber of Commerce and the Business Roundtable. But while those statements push for strong action, they are not specific about a dollar figure.", "\"We look forward to working with the new administration and Congress on the details and in ensuring that any additional economic assistance is timely, targeted, and temporary, \" the Chamber of Commerce said Jan. 14.", "That leaves plenty of room for discussion about the scale of the relief package.", "Biden said that economists across the political spectrum supported his COVID-19 relief proposal. There is broad agreement that Washington should spend hundreds of billions of dollars to corral the coronavirus, help small businesses and give assistance to the millions of people who lost their jobs.", "But Biden treated that support as an endorsement of his entire $1.9 trillion plan.", "Many prominent economists have concerns about the price tag, which was the exact focus of the question Biden was answering.", "He glossed over that debate. We rate this claim Mostly False.", "White House, Remarks by President Biden in a CNN Town Hall with Anderson Cooper, Feb. 16, 2021", "U.S. Chamber of Commerce, U.S. Chamber Welcomes President-Elect Biden’s American Rescue Plan, Jan. 14, 2021", "Business Roundtable, Business Roundtable Welcomes President-elect Biden’s COVID-19 Relief Plan, Jan. 15, 2021", "Moody’s Analytics, The Biden Fiscal Rescue Package: Light on the Horizon, Jan. 15, 2021", "Invest in America, 120+ economists call on Congress to pass \"sweeping\"additional COVID relief package, Jan. 28, 2021", "Washington Post, The Biden stimulus is admirably ambitious. But it brings some big risks, too., Feb. 4, 2021", "EconoFact, The Federal Debt and the COVID-19 Recession: Olivier Blanchard, Feb. 8, 2021", "American Enterprise Institute, Biden won’t regret compromising on COVID relief, Jan. 25, 2021", "CNN, Trump advisor calls on Congress to approve Biden's rescue plan, Jan. 22, 2021", "National Interest, Larry Summers Is Right on the Economy for the Wrong Reason, Feb. 10, 2021", "Wall Street Journal, Biden’s Stimulus Should Stay the Course, Jan. 25, 2021", "New York Times, Biden’s Relief Plan Is a Trojan Horse. And I’m OK With That., Jan. 27, 2021", "Wall Street Journal, Forecasters Lift Expectations for 2021 Economic Growth, Feb. 11, 2021", "MarketWatch, Powell says he doesn’t expect a ‘large or sustained’ inflation outbreak, Feb. 10, 2021", "Board of Governors of the Federal Reserve System, Getting Back to a Strong Labor Market, Feb. 10, 2021", "The Economist, Will Joe Biden’s fiscal stimulus overheat the American economy?, Jan. 23, 2021", "Washington Post, We need to fight covid-19, not each other. Here are the keys to compromise on a relief deal., Jan. 27, 2021", "CNN, Trump advisor calls on Congress to approve Biden's rescue plan, Jan. 22, 2021", "Committee for a Responsible Federal Budget, Voices Skeptical of the Size of $1.9 Trillion COVID Relief Plan, Feb. 12, 2021", "WENY News, With Biden going big, Wall Street economists are growing bullish on the US economy, Feb. 11, 2021", "New York Times, The Clash of Liberal Wonks That Could Shape the Economy, Explained, Feb. 8, 2021", "Daniel Mitchell, A Battlefield Conversion on Fiscal Policy for the GOP, Jan. 23, 2021", "Email exchange, Desmond Lachman, resident fellow, American Enterprise Institute, Feb. 17, 2021", "Email exchange, Harvey Rosen, professor of economics, Princeton University, Feb. 17, 2021", "Email exchange, Samuel Hammond, director of poverty and welfare policy, Niskanen Center, Feb. 17, 2021", "Email exchange, Glenn Hubbard, professor of economics, Columbia University, Feb. 17, 2021", "Email exchange, Rosemary Boeglin, assistant press secretary, White House, Feb. 17, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]