["By Robert Farley", "Posted on August 2, 2016", "Donald Trump said he’s worried about a “rigged” general election, citing “precincts where there were practically nobody voting for the Republican” in 2012. Voting experts said such outcomes in certain urban districts were entirely plausible given the demographics.", "Trump’s comments about the potential for a “rigged” election were made during an interview with Sean Hannity on Fox News on Aug. 1 (starting at the 7:22-mark).", "Hannity, Aug. 1: You said at a speech today you’re afraid this election is going to be rigged. Explain.", "Trump: Yeah. Well, I’ve been — I’ve been hearing about it for a long time. And I know last time, there were — you had precincts where there were practically nobody voting for the Republican. And I think that’s wrong. I think that was unfair, frankly, than Mitt Romney. You had areas where a lot of people were curious, “How is that possible?”", "… and I’m telling you, November 8th, we’d better be careful, because that election is going to be rigged. And I hope the Republicans are watching closely, or it’s going to be taken away from us.", "As Trump said, there were numerous media reports in 2012 about voting precincts in Philadelphia and Cleveland in which Romney did not receive a single vote.", "The Philadelphia Inquirer reported on Nov. 12, 2012, that there were 59 voting divisions in the city where “Mitt Romney received not one vote. Zero. Zilch.” In those districts, President Barack Obama got nearly 20,000 votes.", "Although those results sparked concern among some Republicans about vote fraud, the Inquirer article noted that the districts in question — each with several hundred registered voters — were clustered in almost exclusively black sections of Philadelphia where the vast majority of registered voters are Democrats. In one of the divisions, for example, the Inquirer found just 12 Republicans on voter registration lists, and reporters couldn’t locate any who voted for Romney.", "At FactCheck.org, we dealt with this issue and other voting conspiracies contained in a viral email in early 2013.", "Similarly, the Cleveland Plain Dealer found nine precincts in which Obama shut out Romney. Those districts were mostly clustered on the east side of Cleveland — where Obama won 96 percent of the vote.", "Voting experts told us districts with unanimous votes for Obama were not evidence of vote fraud. In fact, they said, based on demographics and party affiliation in urban areas, such votes were expected.", "“Those results seem perfectly plausible without any reasonable suspicion of vote fraud,” Sasha Issenberg, author of “The Victory Lab: The Secret Science of Winning Campaigns,” told us via email.", "Issenberg said some back-of-the-envelope math shows just how unremarkable those results were in Philadelphia and Cleveland. In Ohio, according to exit polls, 96 percent of the African American vote went to Obama; in Pennsylvania, it was 93 percent. Issenberg pointed to one Philadelphia census tract where 95 percent of the population is African American, in addition to those who identify as biracial/multiracial. (Only 49 out of 4,488 people in the tract are white.)", "“In cities like Philadelphia and Cleveland this type of racial polarization isn’t that unusual,” Issenberg said. “Census tracts are much larger than divisions, as precincts are known in Philadelphia — the smallest unit at which votes are reported, usually a few hundred each. Is it hard to imagine that a fraction of a census tract that is 95+ percent black could go 100 percent for Obama when voters across that category statewide are voting at a 93 percent rate?”", "Larry Sabato, director of the Center for Politics at the University of Virginia, said Trump pointing to these voting anomalies as evidence of “rigged” elections is “a laughable and even irresponsible allegation.”", "“With no evidence at all, Trump is charging — in advance of the election — that if he loses, it might well be because the election is rigged. Puh-leaze,” Sabato told us via email. “The precincts that gave Romney no votes or very few votes were nearly all-minority. President Obama received 93 percent of the African-American vote, according to the national exit poll, while Romney received 6 percent. With that kind of backing for Obama, it is almost inevitable that some black precincts would show 100 percent backing for him.”", "Besides, Sabato said, “If you were going to steal an election, why would you concentrate your efforts on precincts where your candidate was already going to receive nearly all the votes? Wouldn’t you logically go to precincts where the pickings weren’t so slim?”", "Philadelphia and Cleveland weren’t the only cities in which voting districts went entirely for Obama.", "In 2008, Jonathan Rodden, a political science professor at Stanford and a fellow at the right-leaning Hoover Institution, collected precinct-level results for more than 165,000 precincts in all states (except Oregon).", "Rodden told us he found there were more than 1,600 precincts around the country in which Obama received 100 percent of the vote.", "“Virtually all of them were in dense city centers populated overwhelmingly by minorities,” Rodden told us via email. “This phenomenon was not limited to one or two cities — it happened in cities throughout the country. Either vote fraud took place in virtually every major city, or the Republican candidate simply performed poorly in city centers. I’m pretty comfortable with the latter interpretation!”", "So Trump was right about there being a number of precincts “where there were practically nobody voting for the Republican.” But that isn’t evidence that vote tallies were “unfair” or “rigged.” Experts said that demographics explain not only how it was possible, but probable.", "https://www.sharethefacts.co/share/4daf1461-5746-45a8-9593-487cce06096f", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]