["The video was published on Facebook here on October 25, 2020. It has been viewed more than 33,000 times before it was removed.", "The 26-second video shows a person stealing a handbag from a woman before mounting a motorcycle in order to flee the scene.", "The post's caption states: “Daylight robbery at JB in front of City Square Mall*”. The same caption is also written in Malaysian language and simplified Chinese characters.", "JB refers to Johor Bahru, the capital of Johor state, in Malaysia.", "The video has been viewed more than 210,000 times after it was posted with a similar claim on Facebook here, here and here; as well as on YouTube here and here.", "The claim is false.", "A reverse image search using keyframes generated from InVID-WeVerify, a digital verification tool, found a screenshot from the video was published on June 26, 2020, in this report by Malaysian Chinese-language daily Sin Chew Daily.", "Below is a screenshot of the video in the the misleading post (L) and the video in Sin Chew Daily’s report (R):", "The report’s Chinese-language title translates to English as: “Video of woman being robbed is widely shared, it turns out to be police filming security promotional video.”", "The report reads in part: “In the video, a Malay woman was robbed by motorcycle riders on Jalan Wong Ah Fook in Johor Bahru. There are two motorcycle riders – one went off the motorcycle and snatched [her belonging], and the other sat on the motorcycle for support.", "“Johor Bahru South police chief Padzli said that police officers from the district headquarters filmed a security promotional video in the downtown area of Johor Bahru from 4 pm to 6 pm yesterday, in order to remind the public of snatchers.", "“He said that the video currently circulating online indeed shows the scene when police officers filmed the video at that time.”", "Johor Bahru South district police posted the promotional video on July 1, 2020, on its Facebook page here.", "The first paragraph of the Malaysian-language caption reads: “Let’s watch a short video ‘Prevent Snatch Crime’ special performance from officers and members of the Johor Bahru South district police headquarters.”", "From the one-minute 33-second to the one-minute 38-second mark, the video shows the same scene seen in the misleading post.", "Below are screenshot comparisons of the video in the misleading post (L) and the police’s video (R) – AFP has circled some similar features in red:", "The scene was filmed here, in front of Johor Bahru City Square shopping mall.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]