["The images were shared in this Facebook post on January 15, 2020. The post had been shared more than 2,000 times before it was deleted.", "Below is a screenshot of the misleading Facebook post:", "The Sinhala text below the two photos translates to English as: \"These innocent animals also like to live.. This is Sri Lanka, not a foreign country.. Poisoned because the crops are destroyed..\"", "The caption of the Facebook post translates to English as: “Did you think this was in Australia, no, no this is Lanka”.", "The photos were also shared alongside similar claims on Facebook here, here, here, here and here.", "However, these images have been shared in a misleading context.", "A reverse image search on the top photo led to this report published by Indian newspaper New Indian Express on March 20, 2017, alongside the headline \"Mystery death of 20 peacocks baffle forest officials in Villupuram”.", "Below is a screenshot of the image featured in the article:", "The photo is captioned: “Carcasses of the peacocks lined up as officials make a spot study”.", "The report reads, in part: “VILLUPURAM: You may call it poaching, hunting or mass elimination of a vermin. But forest and police officials are yet to come to a conclusion on the mystery deaths of 20 peacocks near Vanur here though they have begun a probe.”", "Viluppuram is a municipality in southern India.", "Below is a screenshot comparison of the first photo in the misleading Facebook post (L) and the photo on New Indian Express (R)", "A keyword search on Facebook found that the second photo was published on the platform here on November 17, 2018, by a user in Sri Lanka named Prabath Nadeera Rajapaksha.", "Below is a screenshot of the photo included in Rajapaksha’s post:", "The Sinhala-language caption translates, in part, to: “...Accordingly, we went in search of the sick peacocks that our father had spoken of, in the Thibbatuwewa paddy fields located near Moragollagama. Within minutes we saw several carcasses of animals who had died due to the condition over the past few days. There were about five animals dead. If we had searched the entire area, the number might have increased.\"", "The caption adds that field workers in the area stated that farmers \"had added a pesticide during the paddy cultivation period to minimize the damages to crops by birds such as peacocks.\"", "Moragollagama is a small village located in North Central Province of Sri Lanka.", "Below is a screenshot comparison of the second photo in the misleading post (L) and the photo posted on Rajapaksha’s Facebook account (R):", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]