["About this rating", "A simple prayer request for the Darkhorse Marine battalion fighting in Afghanistan was initially spread via social media in late 2010:", "We are asking everyone to say a prayer for \"Darkhorse\" 3rd Battalion 5th Marines and their families. They are fighting it out in Afghanistan and have lost 9 marines in 4 days. Please repost this.", "Even more than indicated in that Facebook-circulated prayer request, the U.S. 3rd Battalion,  5th Marines (Darkhorse) suffered heavy personnel losses in Afghanistan between October 2010 and its return to Camp Pendleton in April 2011. According to the San Diego  Union-Tribune, thirteen members of the battalion were killed in the October/November 2010 timeframe:", "An infantryman from Camp Pendleton's 3rd Battalion, 5th Marine Regiment was killed in action in Afghanistan, the Pentagon announced [on 8 November 2010].", "Lance Cpl. Randy R. Braggs, 21, of Sierra Vista, Ariz., died Nov. 6 while conducting combat operations in Helmand province, the Department of Defense said.", "Braggs was the 13th member of 3/5 killed since the battalion moved into the Sangin area of northeastern Helmand province in October, including four felled in a single bomb attack on their mine-resistant all terrain vehicle.", "Two other Marines were fatally shot at a patrol base last week in Sangin, the Marines said. Initial reports indicate they were attacked by a rogue Afghan soldier who then fled, according to U.S. and NATO officials in Afghanistan. An investigation into the incident is continuing.", "As noted in an Associated Press account, the area of Afghanistan in which the 3/5 operated is regarded as a particularly key (and violent) area of that country:", "U.S. Marines who recently inherited this lush river valley in southern Helmand province from British forces have tossed aside their predecessor's playbook in favor of a more aggressive strategy to tame one of the most violent places in Afghanistan.", "U.S. commanders say success is critical in Sangin district — where British forces suffered nearly one-third of their deaths in the war — because it is the last remaining sanctuary in Helmand where the Taliban can freely process the opium and heroin that largely fund the insurgency.", "The district also serves as a key crossroads to funnel drugs, weapons and fighters throughout Helmand and into neighboring Kandahar province, the spiritual heartland of the Taliban and the most important battleground for coalition forces. The U.S.-led coalition hopes its offensive in the south will kill or capture key Taliban commanders, rout militants from their strongholds and break the insurgency's back. That will allow the coalition and the Afghans to improve government services, bring new development and a sense of security.", "Another Associated Press report from November 2010 described the difficulty (and heavy casualties) the Marines were encountering during operations in that region of Afghanistan:", "The Marines patrolling through the green fields and tall mud compounds of Helmand province's Sangin district say they are literally in a race for their lives. They are trying to adjust their tactics to outwit Taliban fighters, who have killed more coalition troops here than in any other Afghan district this year.", "\"As a new unit coming in, you are at a distinct disadvantage because the Taliban have been fighting here for years, have established fighting positions and have laid the ground with a ton of IEDs,\" said Lt. Col. Jason Morris, commander of the 3rd Battalion,  5th Marine Regiment. \"You have to evolve quickly because you have no other choice.\"", "Many of the younger Marines also have had to cope for the first time with seeing their best friends die or suffer grievous wounds. Fifteen Marines have been killed and about 50 wounded since the battalion arrived in October [2010] — many by improvised explosive devices or IEDs.", "Between 8 October 2010 and its April 2011 return home, the 3/5 lost 25 Marines while conducting Operation Enduring Freedom combat operations in Helmand province:", "Dark Horse Battalion was rotated back to the U.S. in April 2011. Its place in Afghanistan was taken by the 1st Battalion,  5th Regiment, also from Camp Pendleton.", "Abbot, Sebastian.   \"US Takes on Violent Afghan Valley That Bled Brits.\"\r\n    The Seattle Times.   9 November 2010.", "Kovach, Gretel C.   \"Sangin Losses Mount for Camp Pendleton Battalion.\"\r\n    San Diego Union-Tribune.   8 November 2010.", "Associated Press.   \"Marines Learn Lessons from Tragedy In Afghanistan.\"\r\n    NPR.   12 November 2010.", "Los Angeles Times.   \"Marines From the Dark Horse Battalion Return Home to Camp Pendleton .\"\r\n    11 April 2011.", "San Diego Union-Tribune.   \"Pendleton's 3/5 Battalion Loses Another Marine.\"\r\n    29 December 2010.", "Correction [Jan. 4, 2022]: Added missing name to list of the 25 (not 24) Marines killed in action.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]