["“Barack Obama is asking Africans not to accept the vaccines that will come from America and Europe,” begins the caption of a post that resurfaced on Facebook in December 2020. The claim has been making the rounds online since at least April 2020.", "It features an alleged quote by Obama saying he would be “an accomplice” if he didn’t denounce “this evil act white people want to do to Africans”. Referencing his Kenyan background, Obama purportedly said his African descent would not allow him to let “white people kill Africans with their toxic vaccine”.", "A search using CrowdTangle – a social media monitoring tool –  revealed the same claim was shared on Facebook here, here, here and here.", "Similar posts circulated in French on Facebook (here and here for instance) as well as on Twitter (here, here and here).", "The online claim re-emerged after Western countries started rolling out  Covid-19 vaccines in December 2020, as AFP reported here.", "Since the start of the coronavirus pandemic a year ago, Obama has spoken on several occasions about the novel coronavirus which has caused the death of more than 1.84 million people including nearly 400,000 in the United States as of January 4, 2020.", "However, there is no official evidence that Obama encouraged Africans to refuse vaccination in any of his public speeches.", "His spokesperson, Katie Hill, also denied that he had made the comments, according to the American news agency Associated Press (AP) in April, 2020.", "“With COVID cases surging worse than ever, getting vaccinated is one of the most important things we can do,” Obama also said on his Twitter account on December 21, 2020.", "With COVID cases surging worse than ever, getting vaccinated is one of the most important things we can do. But until the vaccine is widely available, socially distancing and wearing masks will actually save even more lives, and alleviate the pressure on healthcare workers.", "Obama and other former US presidents including George W. Bush and Bill Clinton said they were ready to be vaccinated publicly. The 78-year-old president-elect, Joe Biden – who beat Donald Trump in the presidential race in November 2020 – received the Pfizer vaccine live on television on December 21, 2020.", "The initial appearance of the false Obama quote coincided with the viral broadcast of an interview in April 2020 of two French doctors saying that vaccines should be tested in Africa.", "Their comments sparked outcry in France and French-speaking African countries, with critics accusing the pair of wanting to use Africans as guinea pigs.", "The belief that vaccines cause illness is commonly trumpeted by anti-vaxxers, who have falsely linked vaccines to plans to harm or even kill Africans and to secretly implant microchips into people’s bodies.", "In a case similar to the Obama one, AFP Fact Check debunked false online posts in April 2020 that French microbiologist Didier Raoult had urged Africans “not to take the ‘Bill Gates’ vaccine”.", "Another claim circulating in October 2020 showed a doctored image of a medic holding up a sign dissuading Africans to take the vaccines.", "AFP Fact Check shone a spotlight on the issue of anti-vaccine sentiment in Africa in this analysis piece.", "South Africa – the hardest-hit country on the continent with more than one million cases as of January 7, 2020 – announced that it had secured access to vaccines by entering the Covax program, the World Health Organization's (WHO) mechanism for global vaccine distribution. The government hopes to start vaccinations in February.", "Some African countries, like Madagascar, have been more wary. “We are not yet taking a position on the vaccine. In other words, we are not on the list of future beneficiary countries,” government spokeswoman Lalatiana Rakotondrazafy Andriatongariv said in late November 2020.", "The list of African countries eligible for Covax aid can be found here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]