["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "If you need information on ATM security and safety, it’s best to go to law enforcement or a financial institution – not an unsourced post that your friend shared on social media.", "Recently, a post claiming to be a \"message from a banker\" professes to share with the world a \"useful tip\" while using an ATM.", "The post reads: \"Press (the) ‘cancel’ button twice before inserting the card. If anyone has set up the keypad to steal your pin code, this will cancel that set up. Please make it a habit and part of every transaction that you make. Please share with those about whom you care.\"", "It was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The tip has been shared on social media since at least November 2018, when the same claim was also posted on Twitter.", "While it is true that scams can impact customers using an ATM machine, we couldn’t find any reports from cybersecurity, banking or law enforcement organizations that recommend pressing the cancel button twice to prevent information from being stolen.", "We spoke with Dr. Vassil Roussev, a professor of computer science at the University of New Orleans and the director of the UNO Cyber Center, an institution dedicated to research and instruction in the area of Information Assurance.", "\"There are relatively simple electronic devices made by different criminal groups that get reproduced and sold, and there’s a fairly large number of them, so it is possible that some very simple ones could be disturbed by something like this,\" Dr. Roussev said, \"but it should not, in any way, be taken as a safety precaution. It won’t hurt you, but I would place zero value on this type of advice.\"", "Dr. Roussev explained that many designs, particularly keypad overlays, which attaches a fake keyboard over an ATMs real one, may record everything that is pressed, so pressing cancel twice or 50 times would make zero difference.", "He went on to recommend that people take actual safety precautions, such as not using random ATMs or ones where they don’t trust the physical security, because those are targeted by scammers most often.", "Typically, crooks will use a variety of techniques to capture customers information. Here are some of the most common ones compiled from the American Bankers Association and NCR, an ATM developer.", "Skimming: A slim device containing a microprocessor and flash memory that is attached to a card reader slot that copies card information as it passes the device. Once the information is captured, criminals use the details to create a cloned card.", "Cash trapping:  A contraption inserted into the cash-dispensing slot that blocks an ATM’s shutter so that bills cannot be presented to the customer. The criminal then retrieves the cash once the customer leaves.", "Card trapping: The stealing of the physical card itself through a device fixed to the ATM.", "Unlimited cash-out: Malware manipulates system controls, inflates account balances and removes daily transactions limits, enabling criminals to withdraw an unlimited amount of cash.", "Fake keypads or \"pin-pad overlays\": These could potentially be used to steal a PIN number.", "Hidden camera: To record customer keystrokes, like the entry of a PIN, or the card’s information.", "Here are some of the best practices financial institutions do suggest people exercise when using an ATM:", "• When you’re alone, avoid using ATMs in deserted areas, or ones that are obstructed from view or poorly lit. Use ATM’s in public, well-lit areas, like inside banks or supermarkets.", "• Be aware of your surroundings. If you notice anything out of the ordinary or suspicious cancel your transaction and leave immediately. You can come back later or find another ATM.", "• If it looks like someone has tampered with the ATM equipment in any way, don’t use it and report it.", "• Type in your pin discreetly and shield the screen and keypad so others can’t see.", "• Put your cash, card and receipt away immediately. Count your money later where others can’t see and avoid showing your cash.", "• Take your receipts with you so potential criminals will not know how much you withdrew or how much money is in your account.", "• When using a drive-up ATM, keep your doors locked, windows up and your engine running.", "• When using an enclosed ATM that requires your card to open the door, avoid letting anyone follow you inside.", "• While many ATMs are available 24 hours a day, try to go during the day. If you must go at night, consider taking someone with you.", "ATM scams are diverse and range from simple to very advanced. While pressing the \"cancel\" button twice before using the machine doesn’t have any drawbacks, customers shouldn’t expect it will keep their information safe.", "This claim is Pants on Fire!", "Facebook post, Jan. 16, 2019", "Tweet, Nov. 6, 2019", "American Bankers Association, ATM Security, Accessed Jan. 21, 2019", "Hands on Banking, ATM Security Tips, Accessed Jan. 21, 2019", "Mastercard.com, ATM Safety and Security Tips, Accessed Jan. 21, 2019", "Bank of America, ATM Safety Tips, Accessed Jan. 21, 2019", "NCR, Six types of ATM attacks and fraud, Accessed Jan. 21, 2019", "Debt Management Credit Counseling Corp., Beware of ATM, Debit and Credit Card ‘Skimming’ Schemes, Accessed Jan. 21, 2019", "Interview with Dr. Vassil Roussev, director of the UNO Cyber Center and University of New Orleans professor of computer science, Jan. 22, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]