["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Rep. Mo Brooks, R-Ala., objects to confirming the Electoral College votes from Nevada during a joint session of Congress early Jan 7, 2021. (AP)", "We’ve found no credible reports that people who identify as antifa “orchestrated” the riots at the Capitol.", "What the available evidence shows is that Trump supporters were the ones who violently stormed the Capitol. Videos, pictures and statements from people at the Capitol contradict Brooks’ claim.", "Rep. Mo Brooks, R-Ala., asked people not to \"rush judgment\" on who was behind the riots at the U.S. Capitol on the day Congress convened to affirm President-elect Joe Biden’s election victory.", "\"Please, don’t be like #FakeNewsMedia, don’t rush to judgment on assault on Capitol. Wait for investigation. All may not be (and likely is not) what appears. Evidence growing that fascist ANTIFA orchestrated Capitol attack with clever mob control tactics,\" Brooks tweeted Jan. 7.", "Law enforcement officials are investigating the chaos and violence that transpired Jan. 6 when a mob stormed the federal building and forced Vice President Mike Pence and lawmakers to evacuate their chambers.", "Antifa is short for anti-fascist; the term is often used to describe a loose collection of activists who rally against fascism and far-right groups.", "We reviewed videos, photos, news reports and social media posts around the siege. Our review shows that the rioters were President Donald Trump’s supporters. The evidence that the rioters were part of \"antifa,\" or that the assault was organized by that coalition, is weak. The claim is being made by supporters of Trump in an effort to distance themselves from the lawlessness at the capitol.", "Before the mob breached the Capitol Jan. 6, Trump greeted supporters at a rally and repeated many baseless claims of election fraud.  He told the crowd: \"I know that everyone here will soon be marching over to the Capitol building to peacefully and patriotically make your voices heard.\" But other parts of his remarks had a different tone. \"You'll never take back our country with weakness. You have to show strength and you have to be strong. We have come to demand that Congress do the right thing,\" Trump said.", "Photos show people inside the Capitol waving Trump flags and Confederate flags, donning sweaters, sweatshirts, beanies, red hats, green hats and other garments that said \"Trump\" or his campaign slogans, \"Make America Great Again\" and \"Keep America Great.\"", "Lin Wood, a Trump ally and an attorney who has filed lawsuits seeking to overturn the presidential election, tweeted a photo of a man he described as an antifa activist. But the man supports Trump and the baseless QAnon conspiracy theory; he’s shared those opinions with his own Arizona community for well over a year. He replied to Wood and told him he was wrong, that he was not antifa. (Wood’s account has been suspended.)", "A California Republican official also shared a picture on Twitter claiming that it showed men aligned with antifa. PolitiFact California rated her false claim Pants on Fire, noting that  journalists who track far-right extremism identified one of the men in the picture as a neo-Nazi, not an antifa supporter.", "Facebook posts claimed that a facial recognition firm \"confirmed antifa infiltrated the Trump rally in D.C.\" But that’s not true.", "An attorney for the firm XRVision told PolitiFact in a statement that the company analyzed footage from the Capitol, identified several people and shared that information with law enforcement. The firm concluded that two of the men were affiliated with the Maryland Skinheads and the National Socialist Movements. \"These are two known Nazi organizations, they are not Antifa,\" the statement said.", "Chad Wolf, the acting secretary of the Department of Homeland Security, urged Trump and all elected officials to condemn the violence that took place on the Capitol. His statement mentioned Trump supporters, and not people aligned with the antifa movement.", "\"While I have consistently condemned political violence on both sides of the aisle, specifically violence directed at law enforcement, we now see some supporters of the president using violence as a means to achieve political ends,\" Wolf said.", "Statements from the chief of the U.S. Capitol Police and the acting attorney general said they were investigating the riots. Their statements did not suggest that antifa supporters were involved.", "Brooks sent the following tweets as evidence for his claim that \"antifa orchestrated\" the riots on the Capitol:", "\"1. A Congressman warned me on MONDAY of a growing ANTIFA threat & advised that I sleep in my office rather than leaving Capitol complex & sleeping in my condo. I heeded that advice & have slept on office floor for 4 straight nights.", "\"2. Congressman told me he was warned on TUESDAY by Capitol Police officer that intelligence suggested fascist ANTIFA was going to try to infiltrate the Trump rally by dressing like Trump supporters.", "\"3. Capitol Police advised TUESDAY that it best not to leave Capitol complex.", "\"4. Evidence, much public, surfacing that many Capitol assaulters were fascist ANTIFAs, not Trump supporters. Again, time will reveal truth. Don’t rush to judgment. Don’t be fooled by #FakeNewsMedia whose political judgment drives their reporting. My view: fully prosecute all!\"", "PolitiFact asked Brooks’ press office for the name of the congressman who gave Brooks the warning so we could get more information from that congressman. We also asked whether Brooks himself was alerted by Capitol police about antifa infiltrating the Trump rally. We requested that Brooks also provide any other additional information that supported his claim. We did not hear back.", "Brooks’ suggestions that antifa was behind the riots began Jan. 6 while the House chamber was in lockdown. He tweeted: \"Rumor: ANTIFA fascists in backwards MAGA hats. Time will tell what truth is.\"", "Brooks tweeted, \"Evidence growing that fascist ANTIFA orchestrated Capitol attack with clever mob control tactics.\"", "We’ve found no credible reports that people who identify as antifa \"orchestrated\" the riots at the Capitol, and Brooks did not provide clear and irrefutable evidence.", "What the available evidence shows is that Trump supporters were the ones who violently stormed the Capitol. Videos, pictures, and statements from people at the Capitol directly contradict Brooks’ claim.", "We rate Brooks’ statement Pants on Fire.", "Twitter, @RepMoBrooks tweet, Jan. 6, 2021; tweet, Jan. 7, 2021", "U.S. Capitol Police, Statement of Steven Sund, Chief of Police, Regarding the Events of Jan. 6, 2021, issued Jan. 7, 2021", "PolitiFact, No, facial recognition didn’t confirm antifa infiltrated Trump supporters at the Capitol, Jan. 7, 2021", "Department of Homeland Security, Acting Secretary Wolf Condemns Violence at The U.S. Capitol, Jan. 7, 2021", "Justice Department, Statement of Acting Attorney General Jeffrey A. Rosen, Jan. 7, 2021", "Getty Images, Jan. 6, 2021 Capitol riots photos", "PolitiFact California, High-Ranking California Republican Lawmaker Pushes Misinformation About Storming of U.S. Capitol, Jan. 6, 2021", "Politifact, No evidence Dominion Voting Systems caused widespread tabulation errors that flipped votes for Biden, Nov. 13, 2020", "PolitiFact, Here’s why Georgia’s Republican officials are confident in their presidential election results, Jan. 5, 2021", "PolitiFact, Alleged ‘backdated’ ballots wouldn’t have been counted even if USPS claim were true, Dec. 4, 2020", "Twitter, @USAwolfpack tweet, Jan. 6, 2021", "PolitiFact, Face-painted man in horned fur cap at Capitol riot supports Trump and QAnon, not antifa, Jan. 7, 2021", "PolitiFact, What is QAnon, the baseless conspiracy spilling into US politics?, Aug. 27, 2020", "Archive of Lin Wood Jan. 6, 2021 tweet", "Twitter, @IwriteOk tweet, Jan. 6, 2021", "Twitter, @annamerlan tweet, Jan. 6, 2021", "The Southern Poverty Law Center, Traditionalist Worker Party", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]