["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "State Sen. Alberta Darling, right, looks on at a December 2018 news conference, joined by other Republican legislative leaders. (Photo by Mark Hoffman/Milwaukee Journal Sentinel)", "Wisconsin’s economic development agency has been a lightning rod for years.", "The public-private partnership — officially the Wisconsin Economic Development Corp. — oversees grants and loans given to businesses in exchange for the creation of new jobs. It has drawn criticism for bad loans, failures to verify created jobs, negative state audits and most recently its role in bringing the Foxconn Technology Group plant to Racine County.", "Gov. Tony Evers even pledged to de-fund the agency in his first budget, though he later backed down from that position (earning a Full Flop rating from us).", "Now the relationship between Evers and WEDC has a new wrinkle.", "Addressing the state Legislature’s Joint Finance Committee, state Sen. Alberta Darling, R-River Hills, claimed the Democratic governor had developed quite an affinity for the Republican-appointed head of the agency.", "\"Our Gov. Evers asked the director of WEDC to stay on, because he was really concerned that the good trends that were happening with WEDC would not be able to continue with a really quick turnover,\" Darling, the committee’s co-chair, said at the Sept. 4, 2019, meeting. \"The director to his credit, stayed.\"", "Hmm.", "Unraveling this seemingly simple claim takes us on a meandering path that includes lame-duck laws, appeals courts and resignations.", "Let’s get started.", "This claim centers on Mark Hogan, a former banker appointed as CEO of WEDC in September 2015.", "Hogan was named to the post by Gov. Scott Walker, who had the power to name a CEO with state Senate approval.", "But after Evers defeated Walker in the November 2018 election, Republicans worried he would make good on his pledge to dissolve WEDC. A series of lame-duck bills finalized in December 2018 (while Republicans still controlled all of state government) included a temporary turnover of power: Republicans would oversee WEDC until Sept. 1, 2019.", "Republicans said at the time they wanted to temporarily gain control to show Evers that WEDC works well and persuade him to keep it as is. Hogan said he did not seek the change.", "Meanwhile, Hogan announced in June 2019 that he would be leaving the agency in fall 2019, which officials said he had previously told both Walker and Evers. In an Aug. 26 letter to Evers, Hogan revealed his last day would be Sept. 3.", "Evers tweeted a thanks to the outgoing Hogan that day.", "\"Thank you ... for your leadership and service to our state,\" the governor said. \"I have appreciated you and your candor, collaboration, and dedication to our state. Sending you my sincerest respect and gratitude--Kathy and I wish you the very best in retirement.\"", "The timeline doesn’t allow much space for Evers to extend Hogan's stay, since Hogan left the agency two days after Evers gained oversight power.", "And Evers’ staff said no such request was made — in September or before.", "\"The law required us to keep him on. At no point did the governor ask Mark to stay on post-Sept. 1,\" Evers spokeswoman Melissa Baldauff said in an email. \"There was not a scenario when Mark said he planned to leave earlier and the governor asked him to stay. That never happened.\"", "So what is Darling talking about?", "The complicating factors here are the court challenges to the lame-duck laws.", "A Dane County judge struck down the laws and legislative confirmation of a slew of Walker’s last-minute appointments in March 2019, after which Evers withdrew 82 of those appointments.", "Reporter Scott Bauer of the Associated Press noted on Twitter that ruling also gave Evers power to appoint a new leader for WEDC. But Evers said he had no immediate plans to do so — and never took any such action.", "An appeals court stayed the Dane County ruling six days later, restoring the lame-duck laws and returning WEDC oversight to Republicans until Sept. 1. Three other lawsuits over the lame-duck laws are ongoing, but for now at least most of the laws are in effect.", "Defending Darling’s claim, spokesman Bob Delaporte pointed to Evers’ inaction in the wake of the court case and times the governor spoke positively of Hogan’s work and the relationship between the two.", "\"If the governor’s office never formally asked for Hogan to stay, they were at the very least pleased enough with his performance to never ask him to leave. The governor had an opportunity to make a change at WEDC and didn’t,\" Delaporte said in an email. \"I think it’s fair to assume that if you have the chance to remove someone from an agency and don’t you must like the performance and direction that person is providing.\"", "But that was not Darling’s claim. She claimed Evers asked him to stay on — and continue after the Sept. 1 changeover date. Darling’s office provided no evidence of that.", "Darling told her legislative colleagues the governor asked Hogan to stay on as head of WEDC.", "Though Evers was mostly unable to address Hogan’s post before Sept. 1, court cases did create a brief window where he could have made a change.", "But declining to make a change amid a contentious court battle is not the same thing as asking Hogan to stay on — which implies he intended to leave earlier. Hogan by all accounts simply informed both Evers and Walker that he planned to leave this fall, then did so.", "We rate Darling’s claim False.", "WisconsinEye, Joint Committee on Finance, Sept. 4, 2019", "Email exchange with Melissa Baldauff, spokeswoman for Gov. Tony Evers, Sept. 4-5, 2019", "Email exchange with Bob Delaporte, spokesman for state Sen. Alberta Darling, Sept. 5, 2019", "Wisconsin State Journal, Scott Walker taps retired banking executive, campaign donor to oversee WEDC, Sept. 4, 2015", "Milwaukee Journal Sentinel, Scott Walker signs lame-duck legislation without vetoes curbing his Democratic successor's power, Dec. 14, 2018", "Gov. Tony Evers, twitter, Sept. 3, 2019", "Milwaukee Journal Sentinel, Wisconsin Economic Development Corp. CEO Mark Hogan to leave post later this year, June 25, 2019", "Mark Hogan, letter to Gov. Tony Evers, Aug. 26, 2019", "The Capital Times, Dane County judge temporarily blocks lame-duck laws limiting power of Wisconsin governor, attorney general, March 21, 2019", "Milwaukee Journal Sentinel, Some Wisconsin lame-duck laws back in place after appeals court rules, March 27, 2019", "Scott Bauer, twitter, March 21, 2019", "Scott Bauer, twitter, March 25, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]