["In an unusual role reversal, most Congressional Republicans recently voted against a war funding bill. Some said they opposed the bill because it had so much money for the International Monetary Fund, a coalition of 185 countries that tries to foster global economic growth.\n\n\nAmong the Republicans sounding off was Rep. Lynn Westmoreland of Georgia, who wrote this on his party's blog:\n\n \n\n\"We’re getting an alleged war spending bill that actually spends more money on the International Monetary Fund than on the war,\" he wrote. \"We have the ability to bounce back out of this recession, but we can’t afford to pay for a global bailout – we have more than enough bailouts going on in our own country, thank you very much.\"\n\n\nAll but five of the 178 Republicans in the House voted against the measure on June 16, 2009. The bill is at the White House awaiting President Barack Obama's signature.\n\n \n\nThe IMF's profile has risen in recent months in the wake of the economic crisis, and some financial leaders want the agency to loan more money to jump-start the global economy. We wondered if it was possible that a war funding bill would have more money for the IMF than the wars.\n\n \n\nOverall, the bill costs about $106 billion, according to the House Appropriations Committee. Approximately $82 billion — or about 77 percent — is for war-related items, everything from new machinery to hospitals.\n\n\nAnd for the IMF?\n\n\nZero dollars, according to the Appropriations Committee.\n\n\nSo does that mean Westmoreland's claim is false?\n\n\nNot so fast.\n\n\nThe bill does establish a $100 billion line of credit for the IMF that the agency could use to make loans to other countries. But the Congressional Budget Office has estimated the actual cost to the Treasury at approximately $5 billion. That sum is largely the product of some confusing budgetary gymnastics based on estimates of how dramatically the IMF would have to use the line of credit and how quickly loans would be repaid, the CBO explained on its Web site.\n\n\n\"In forming this estimate, CBO envisioned various potential state of the world economy,\" wrote CBO director Douglas Elmendorf on May 19, 2009. \"In the most likely situations, the IMF would draw against only a small portion of the U.S. commitment and, CBO assumes, the likelihood of those funds being promptly repaid would be high. Thus, the cost of the U.S. commitment would be close to zero in those cases.\"\n\n\nThe CBO said there's a slight chance the IMF would need to loan most or all of the line of credit. In that case, the IMF might not recoup all of the money and the cost to the U.S. Treasury would therefore be higher.\n\n\nCBO noted that no IMF borrower has defaulted on its obligations, but many have had their loans extended or been late on their payments.\n\n\nWe spoke with budget experts who said the CBO's estimate is reasonable because it reflects the likely risk to the taxpayers.\n\n\nLoans are a routine part of the annual appropriations process, and they are typically assigned some cost based on risk, said Brian Riedl, a budget expert at the Heritage Foundation. If no money is paid back, \"that does potentially make it the most expensive part of the bill. But the odds of it becoming the most expensive part of the bill are slim.\"\n\n\nThe real cost to the Treasury Department all comes down to whether other countries pay back those loans, said Edwin Truman, who is an IMF expert with the Peterson Institute for International Economics, an economic think tank.\n\n\n\"Since no country has ever lost money in [IMF's] history, the notion that we will lose $5 billion is a stretch,\" he said.\n\n\nSo as for Westmoreland's claim, he's wrong that the appropriations bill spends more money on the IMF than for the war. Lawmakers aren't literally giving the organization a bundle of cash. But he's right that there's a potential for the U.S. Treasury, over time, to give the IMF quite a chunk of change as a result of the line of credit. However, Westmoreland's claim is based on the premise that countries borrowing from the IMF will never pay those loans back, which is a worst-case scenario that experts say is unlikely to occur. So we rate his claim Barely True.", "Rep. Lynn Westmoreland,\n\nstatement on the war spending bill\n\n, accessed June 22, 2009", "House Appropriations Committee,\n\nsummary of the war spending bill\n\n, accessed June 23, 2009", "Bloomberg News,\n\n\n\nU.S. House Approves War-Spending Bill Amid Dispute Over IM\n\n\nF\n\n, by\nBrian Faler, June 17, 2009", "The Wall Street Journal,\n\nHouse Passes War-Spending Bill\n\n, by Corey Boles, June 16, 2009", "Congressional Budget Office,\n\nexplanation of IMF costs\n\n, accessed June 22, 2009", "Interview with Edwin Truman, the Peterson Institute for International Economics, June 22, 2009", "Interview with Brian Riedl, the Heritage Foundation, June 23, 2009", "Interview with Jim Horney, the Center for Budget and Policy Priorities, June 23, 2009", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]