["As the government shutdown continues into its third week, Republicans and Democrats are still exchanging jabs over who is to blame.", "The National Republican Congressional Committee -- the campaign arm of House Republicans -- asks Americans in a recent web video to tell U.S. Rep. Ann Kuster, D-N.H., along with six other House Democrats, to end what it calls partisan gamesmanship.", "In the accompanying news release, NRCC Communications Director Andrea Bozek said Kuster \"has turned her back on women, children and our nation’s veterans throughout President Obama’s shutdown, and it’s time for her and her liberal allies to stop the partisan games.\"", "\"The House has passed bipartisan bills to help the American people while the shutdown continues, and Kuster has continued to turn a blind eye to those in need of funding.\"", "The other Democratic lawmakers targeted by the ads are U.S. Rep. Carol Shea-Porter of New Hampshire, Elizabeth Esty of Connecticut, Bill Enyart of Illinois, Ann Kirkpartick of Arizona, and Rick Nolan and Tim Walz of Minnesota.", "The NRCC’s video draws on a series of House measures that would have opened specific portions of the government even as the larger shutdown continued.", "When those measures came up for consideration in the House, Kuster \"voted against funding for our nation’s veterans, low-income women and children, the FDA and the National Institutes of Health,\" the NRCC says.", "We wondered if Kuster did indeed vote against funding for programs that support veterans and low-income families, groups for which she’s pledged her support.", "We turned to the House roll call votes for the topics highlighted by the National Republican Congressional Committee.", "In recent weeks, Kuster -- along with virtually every Democrat -- has voted no on the following resolutions. All of these measures would have given agencies in question the same level of funding as in fiscal year 2013, which ended Sept. 30. The resolutions would have extended funding through Dec. 15.", "• House Joint Resolution 72 to approve a continuing resolution for veterans benefits. The resolution passed 259 to 157.", "• House Joint Resolution 77 to provide money for the Food and Drug Administration. The resolution passed 235 to 162.", "• House Joint Resolution 75 to fund the Special Supplemental Nutrition Program for Women, Infants and Children. The resolution passed 244 to 164.", "• House Joint Resolution 73 to give money to the National Institutes of Health. The resolution passed 254 to 171.", "• House Joint Resolution 59 to approve continuing appropriations for fiscal year 2014. The resolution first passed on Sept. 20, in a 230 to 189 vote. Kuster voted against the resolution on that date and on two other dates when the House approved Senate amendments to the resolution.", "Democratic lawmakers have said they won’t support budget bills that cherry-pick which agencies or departments receive money.  Each resolution above passed along strong party lines, as have most of the resolutions that would have directed money to specific departments without ending the shutdown.", "In addition, President Barack Obama has promised to veto any such legislation that makes it to his desk.", "In other words, this has been a unified Democratic strategy to fund the entire government, rather than offering piecemeal funding for limited portions of the government proposed by House Republicans.", "Kuster offered this rationale when we asked her to explain why she voted no on the resolutions highlighted by the NRCC.", "Rob Friedlander, a Kuster spokesman, said the congresswoman believes the right way to support students, veterans, small businesses and middle-class families is to reopen the entire government. He pointed to a recent opinion piece Kuster wrote.", "In that op-ed, Kuster argues that piecemeal funding isn’t a solution to the shutdown because it would leave much of the government closed.", "\"Let me be perfectly clear: these measures are not solutions. They’re cynical political ploys. They’re half-hearted half-measures. They’re empty gestures that attempt to create the appearance of progress where none exists,\" she wrote.", "Friedlander also said that groups representing some of the constituencies named by the NRCC have said they, too, oppose legislation that funds individual agencies in place of reopening the government with a full budget.", "In a letter to U.S. House and Senate leaders, veterans representatives said that short-term continuing resolutions for the Veterans Administration aren’t acceptable because they don’t take into account the effects of inflation, increased demand for services or costs of starting new programs. The letter was co-authored by leaders of AMVETS, Disabled American Veterans, Paralyzed Veterans of America and Veterans of Foreign Wars.", "The groups had more nuanced views on the specific bill -- H.J.R. 72 -- that would have provided money for disability checks and survivors compensation but not reopen other Veterans Administration offices, including information technology, medical research and National Cemetery Administration.", "The Paralyzed Veterans of America, Disabled American Veterans and Veterans of Foreign Wars did not take an official position on the measure, but the groups, to varying degrees, expressed dissatisfaction with that model of legislation.", "\"That (resolution), in general, is bad policy,\" said Carl Blake, legislative director for Paralyzed Veterans of America, which expressed the clearest discomfort of the four groups about the short-term funding approach.", "Meanwhile, a news release from the American Public Health Association said that while the group supports the important research done through the National Institutes of Health, it \"opposes efforts to fund individual agencies at the expense of others.\"", "Finally, the National WIC Association, which advocates for the Special Supplemental Nutrition Program for Women, Infants and Children (WIC), opposed House Joint Resolution 75. While that resolution would have given money for nutrition assistance to low-income women and children, the association called the resolution a way to use mothers and young children as pawns for political ends, and said the program has enough money to operate through October, giving lawmakers enough time to agree on a full budget.", "The National Republican Congressional Committee said Kuster's votes speak for themselves. \"It’s a fact that Kuster voted against funding for our nation’s veterans, low-income women and children, the FDA and the National Institutes of Health,\" said NRCC spokesman Daniel Scarpinato. \"Don’t take my word for it, or some other organization, just take a look at the votes cited in the release.\"", "We disagree; in this case, the context matters.", "Our ruling", "The NRCC said that Kuster has turned \"a blind eye to those in need of funding\" by voting \"against funding for our nation’s veterans, low-income women and children, the FDA and the National Institutes of Health.\"", "The NRCC is correct that Kuster did vote against each of the resolutions that would have temporarily provided funding for veterans, low-income women and children, the FDA and the National Institutes of Health. However this only tells part of the story.", "The Democrats say they are pushing for a measure to fund all of government, not just a few pieces chosen by House Republicans. Notably, a number of advocacy groups whose funding Koster is accused of turning a \"blind eye\" to, are actually on the record saying they agree with Democrats that the government should be funded in its entirety and for a longer period of time, rather than in a short-term and piecemeal fashion.", "We rate this statement Mostly False.", "American Public Health Administation, \"APHA opposes agency-by-agency approach to ending shutdown,\" Oct. 2, 2013.", "Concord Monitor, \"Washington Memo: Mr. Speaker, let us vote to end the shutdown,\" Oct. 10, 2013.", "House Joint Resolution 59, Continuing Appropriations Resolution, 2014, introduced Sept. 10, 2013.", "House roll call vote on H.J. Res. 59, Sept. 20, 2013.", "House Joint Resolution 73, National Institutes of Health Continuing Appropriations Resolution, 2014, introduced Oct. 2, 2013.", "House roll call vote on H.J. Res. 73, Oct. 2, 2013.", "House Joint Resolution 75, Special Supplemental Nutrition Program for Women, Infants and Children Continuing Appropriations Resolution, 2014, introduced on Oct. 3, 2013.", "House roll call vote on H.J. Res. 75, Oct. 4, 2013.", "House Joint Resolution 77, Food and Drug Administration Continuing Appropriations Resolution, 2014, introduced Oct. 3, 2013..", "House roll call vote on H.J. Res. 77, Oct. 7, 2013.", "National Republican Congressional Committee, \"Stop the Games, Annie Kuster\", Oct. 9, 2013.", "National Republican Congressional Committee, \"New NRCC web video: Stop the Games, Ann Kirkpatrick,\" Oct. 9, 2013.", "Politico, \"White House: Obama would veto ‘piecemeal’ funding bills,\" Oct. 1, 2013.", "The Independent Budget, letter to legislative leaders, Oct. 3, 2013.", "Interview with Rob Friedlander, spokesman for Ann Kuster, Oct. 14, 2013.", "National WIC Administration, \"Call your rep now and urge them to: Oppose H J Res 75,\" Oct. 4, 2013.", "Interview with Dave Autry, Deputy National Director of Communications for Disabled American Veterans, Oct. 15, 2013.", "Interview with Carl Blake, National Legislative Director for Paralyzed Veterans of America, Oct. 15, 2013.", "Interview with Raymond Kelley, director of National Legislative Service for the Veterans of Foreign Wars, Oct. 15, 2013", "Interview with Louis Celli, national legislative director for the American Legion, Oct. 15, 2013", "Email interview with Daniel Scarpinato, spokesman for the National Republican Congressional Committee, Oct. 15, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]