["By Saranac Hale Spencer", "Posted on January 31, 2019 | Updated on February 1, 2019", "A claim that the White House may impeach House Speaker Nancy Pelosi is false, but it is still circulating widely online. It stems from a petition created by a conservative commentator and posted on the White House’s web page, “We the People.”", "The president can’t impeach a member of Congress.", "But a headline circulating online claims: “White House to Consider Impeaching Nancy Pelosi for ‘Treason.’” It came from the notoriously unreliable website NewsPunch, which we’ve written about before, and was copied by other sites.", "That headline, and the story that follows it, is wrong since the White House doesn’t have the power to impeach anyone. Impeachment is a process that begins in the House of Representatives, and no member of the House has ever been impeached.", "Most of the 19 federal officials who have been impeached were judges. There were also two presidents, a cabinet secretary, and a senator who were impeached. Only eight of the 19 were convicted by the Senate and removed from office.", "The claim about Pelosi is based on a petition that was posted Jan. 18 on the White House’s interactive web page “We the People” by Marjorie Taylor Greene, who describes herself as a “conservative commentator” on her Twitter page. After posting the petition, she promoted it through a story on a website called Law Enforcement Today, which is run by former police officers.", "That story, which was also copied by other websites, claimed in the headline that police are “seeking the removal of Nancy Pelosi,” but it offered no evidence that police officers are calling for the removal of Pelosi. Rather, it focused on the recent federal government shutdown — and falsely claimed that Pelosi went to Puerto Rico with her Democratic colleagues during that time (she didn’t) — and argued that, “Nancy Pelosi must be impeached, fired, and removed from office, for committing treason.” The story provided a link to the petition.", "Neither Greene nor the operators of the website that published her story responded to our requests for comment.", "Dennis Slocumb, a registered lobbyist for the International Union of Police Associations, told us he was not aware of an effort among officers to remove Pelosi from office. “I have not heard of it at all.” he said. The IUPA is a union that represents law enforcement officers. We also reached out to the Fraternal Order of Police, but didn’t hear back.", "It is, of course, very possible that some of the more than 140,000 people who have signed the petition are police officers, but the petition wasn’t started by police, and it won’t result in the White House impeaching Pelosi.", "Updated, Feb. 1: As a result of our story, Newspunch.com changed its headline and updated its article to say that the White House doesn’t have the power to impeach. In a note to readers, it said: “the headline has been corrected to ‘Petition About Impeaching Nancy Pelosi for “Treason” Goes Viral’ to more accurately reflect the facts.”", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on the social media network.", "Greene, Marjorie. “Police Are Now Seeking The Removal Of Nancy Pelosi.” Lawenforcementtoday.com. 26 Jan 2019.", "“Impeach Nancy Pelosi for crimes of Treason!” Petition. Whitehouse.gov. 18 Jan 2019.", "Greene, Marjorie (@mtgreenee). “Thanks for sharing this, I’m MG, I created the petition. Read my article here explaining why she should be impeached!” 30 Jan 2019.", "Slocumb, Dennis. Legislative director, The International Union of Police Associations. Phone interview. 29 Jan 2019.", "Adl-Tabatabai. “White House to Consider Impeaching Nancy Pelosi for ‘Treason.’” NewsPunch.com. 29 Jan 2019.", "List of Individuals Impeached by the House of Representatives. Office of the Historian and the Clerk of the House of Representative’s Office of Art and Archives. Accessed 30 Jan 2019.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]