["About this rating", "In December 2015, the city of Riviera Beach, Florida replaced \"Old Dixie Highway\" signs with \"President Barack Obama Highway\" signs, renaming a stretch of road to honor the nation's first black president. In January 2018, a year into the Trump administration and following months of protests, discussion, and debate around the removal of Confederate statues and signs, a series of fake news articles were published bearing headlines that heavily insinuated President Donald Trump was ordering that this stretch of Florida highway revert from the \"President Barack Obama Highway\" (or as the articles referred to the thoroughfare, the \"Obama Highway\") back to its old name.", "These headlines and articles appeared on a number of dubious and nearly identically formatted web sites; for example, ConservativeDaily.info, JournalUnited.com, WalkWithTimeAmerica.com, and AmericanPrides.org all published articles under headlines asking if readers supported Trump's \"decision\":", "Trump Orders to Remove Obama Highway Name and Get Back The Previous Name of `Old Dixie’ Highway?Do you support him?", "If you never read past the misleading headlines, you would never know that the articles don't actually report on any official orders to rename this stretch of road, instead expressing an opinion that the highway's name should be changed back and offering a number of extremely questionable arguments as to why it would be justified:", "There is nothing racist with either “Dixie” or Confederate monuments. They are part of the American history and are part of a rich culture that goes beyond whatever bad liberals may want to attach to it.", "To arbitrarily decide that President Obama may be more relevant to American History than hundreds of years of heritage is ludicrous. On top of that, Obama has never done anything for equality in America.", "President Donald Trump did not announce in January 2018 that he was changing the name of the \"President Barack Obama Highway\" in Florida back to the \"Old Dixie Highway.\" This rumor stems from poorly titled opinion pieces and not genuine news articles. It also bears mentioning that Riviera Beach, Florida is far from the only city in the United States with a roadway named in honor of the country's first black president.", "Washington, Wayne.   \"President Obama Highway Signs Replace Old Dixie Ones in Riviera Beach\"\r\n    Palm Beach Post.   17 December 2015.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]