["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "U.S. House Speaker Paul Ryan (foreground) of Wisconsin and fellow Republicans cheer the passage of a tax reform bill on Nov. 16, 2017. The bill contains language about unborn children, raising concern about abortion rights. (Jacquelyn Martin/AP)", "On the morning of Nov. 15, 2017, readers who clicked on the Milwaukee Journal Sentinel’s home page were confronted by a large pop-up ad attacking U.S. House Speaker Paul Ryan that linked a Republican tax reform proposal to abortion:", "The ad was from NARAL Pro-Choice America, formerly the National Abortion and Reproductive Rights Action League. If you clicked on an image at the bottom that said \"Call Rep. Ryan Now,\" a link sent you to a page with more information. That page contained a statement that began with this:", "House Republicans are quickly moving to pass a tax bill with divisive conception language by disguising it as a college savings plan. This is another attempt to ban abortion and rob women of their reproductive rights. Leading the charge has been House Speaker Paul Ryan.", "NARAL made similar claims on social media. And the group said that, besides Ryan, the online ads targeted eight other House Republicans: Rod Blum of Iowa, Steve Knight and Darrell Issa of California, Erik Paulsen of Minnesota, Mike Coffman of Colorado, Barbara Comstock of Virginia, Karen Handel of Georgia and Pat Meehan of Pennsylvania.", "Let’s look at each of the three parts of the attack on Ryan, a Wisconsin Republican.", "1. ‘Ryan is leading the effort’", "The House tax bill was introduced on Nov. 2, 2017, and was approved by the House on Nov. 16, 2017, the day after NARAL’s ad on JSOnline.com. Ryan has long been touting a GOP tax reform proposal, describing it as the first major tax reform since 1986, and promising that its tax cuts and other tax changes would stimulate the economy.", "A spokeswoman in the speaker’s office told us Ryan supports the provision that is targeted by NARAL, which would change so-called 529 college savings accounts. But she said she wasn’t aware of any public statement Ryan has made on that provision, and we couldn’t find any, which indicates Ryan hasn’t taken the lead on pushing that particular provision.", "So, this part of the claim is partially accurate.", "2. ‘Conception language disguised as savings plan’", "People use 529 accounts (529 refers to that section of the tax code) as investment vehicles to save money for college expenses. The savings are for -- as the Internal Revenue Service explains it -- \"a designated beneficiary, such as a child or grandchild.\" A key attraction is that earnings on investments are not subject to federal tax.", "The House tax bill would allow 529 accounts to be opened explicitly for unborn children. That provision says:", "Nothing shall prevent an unborn child from being treated as a designated beneficiary or an individual under this section. The term \"unborn child\" means a child in utero. The term \"child in utero\" means a member of the species homo sapiens, at any stage of development, who is carried in the womb.", "The provision is \"disguised\" in the sense that adding the unborn child language doesn’t enable savers to do anything they can’t already do for future children -- a point U.S. Rep. Judy Chu, D-Calif., raised during a hearing. Expectant parents and other savers can already open a 529 in anyone’s name, including their own, and later change the beneficiary -- for instance, after a child is born.", "Meanwhile, it’s clear the provision is divisive. NARAL is among a number of groups that opposes it; meanwhile, anti-abortion groups support the provision, with one, the Susan B. Anthony List, saying: \"It's a small increment in the momentum that we're building to ensure that one day every child is welcomed and protected under the law.\"", "So, this part of the claim is mostly on target.", "3. ‘Another attempt to ban abortion’", "The third part of the claim, however, goes too far. The 529 provision would not ban abortion; it strictly deals with college savings accounts, not any restrictions on abortion.", "In fact, in announcing its ads, NARAL itself labeled the provision as merely a beginning step, saying:", "The sole purpose of this provision is to codify the radical, anti-choice idea that life begins at conception into law and begin the process of banning abortion altogether ….This is the first time ‘personhood’ language has made it into tax reform legislation, leaving the door open for future laws to use the same, ideological definition of when life begins …", "There is evidence that, as the New York Times reported, \"the provision accomplishes what anti-abortion activists have long sought: It enshrines into federal law the recognition of the unborn.\"", "The anti-abortion group March for Life said in a statement: \"We are heartened to see this bill promote the personhood of an unborn child … and see this as a huge stride toward expanding the child tax credit to recognize life beginning at conception.\"", "Snopes fact checked whether the tax provision attempts to codify \"fetal personhood\" — the legal theory that a fetus has the same legal rights as a person -- and found the claim largely accurate.", "Two experts, echoing others, told us that inserting an unborn child definition into federal law is part of a broader strategy to limit abortion rights in the future.", "\"It is part of the anti-abortion strategy to work on all fronts to establish fetal personhood/citizenship claims,\" said Yale Law School professor Mindy Roseman, whose specialties include reproduction rights.", "The \"unborn child\" or human \"from moment of conception\" language is also in the U.S. Department of Health and Human Services’ strategic plan, said University of Wisconsin-Madison law and bioethics professor Alta Charo, whose specialties include reproductive health.", "Such efforts are aimed, she said, \"at building an impression that everywhere in federal law the embryo and fetus is considered morally and perhaps legally equal to a live-born child. It is like building a wall. At the end, abortion stands out as a singular exception, a single missing brick in the wall, and seems harder and harder to justify either morally or constitutionally.\"", "Ryan’s response", "Asked to respond to NARAL’s ad, Ryan’s office referred us to a statement about the provision issued by House Majority Leader Kevin McCarthy, R-Calif. The statement says in part:", "Today, our tax code doesn’t recognize children with eyes, ears, noses, arms, legs, fingers, and heartbeats as children just because they haven’t yet left the womb ….So our tax plan adds clear language that allows parents to start a college savings account before their son or daughter is born by explicitly and unambiguously declaring these sons and daughters \"unborn children.\"", "Our ruling", "NARAL says Ryan is leading the effort to \"pass a tax bill with divisive conception language by disguising it as a college savings plan\" in \"another attempt to ban abortion and rob women of their reproductive rights.\"", "Ryan is leading the effort to pass the tax bill. But while he supports the college savings plan provision, he hasn’t spoken out publicly to push that provision.", "Conception language in the provision is divisive among anti-abortion and abortion-rights groups. And it is ‘disguised’ in the sense that it inserts the concept of unborn children into federal law without making any material change to what are known as 529 college savings plans.", "The provision would not, however, ban or even restrict abortion rights -- although advocates fear that inserting unborn children language into federal law could be used to erode abortion rights in the future.", "NARAL’s statement is partially accurate, but leaves out important details -- our definition of Half True.", "JSOnline, NARAL ad, Nov. 15, 2017", "NARAL, \"CALL PAUL RYAN: The GOP tax plan shouldn't say when life begins!\" accessed Nov. 15, 2017", "Email, NARAL spokeswoman Maya Hixson, Nov. 16, 2017", "Politico, \"'Unborn children' qualify as college savers in GOP tax plan,\" Nov. 2, 2017", "Brookings Institution, \"Let’s talk about the GOP proposal to give a fetus a tax benefit,\" Nov. 3, 2017", "NARAL, news release, Nov. 14, 2017", "Email, House Speaker Paul Ryan press secretary AshLee Strong, Nov. 17, 2017", "Email, Yale Law School professor Mindy Roseman, Nov. 20, 2017", "Email, University of Wisconsin-Madison law and bioethics professor Alta Charo, Nov. 20, 2017", "NARAL, news release, Nov. 9, 2017", "NARAL, \"‘Personhood’ Measures: Extreme and Dangerous Attempts to Ban Abortion,\" accessed Nov. 17, 2017", "March for Life, statement, Nov. 17, 2017", "Email, Center for Reproductive Rights spokeswoman Carolina Escobar, Nov. 21, 2017", "Congress.gov, H.R. 1", "Vox, \"Republicans’ tax bill is sneakily hacking away at abortion rights,\" Nov. 6, 2017", "CNN Money, \"House tax plan allows unborn children to have college savings accounts,\" Nov. 3, 2017", "CNBC, \"Paul Ryan: Tax reform is our number one priority this fall,\" Sept. 7, 2017", "New York Times, \"Tax Overhaul Bears Gifts for Conservatives, Including Rights for ‘Unborn,’\" Nov. 4, 2017", "Wall Street Journal, \"Five Things College Savers Should Know About the Tax Plan,\" Nov. 3, 2017", "Huffington Post, \"Republicans Sneak Anti-Abortion Language Into Tax Bill,\" Nov. 3, 2017", "Snopes, \"Does the GOP Tax Bill Introduce Anti-Abortion \"Fetal Personhood\" Legislation?\" Nov. 16, 2017", "Internal Revenue Service, \"529 Plans: Questions and Answers,\" Aug. 8, 2017", "Forbes, \"Unborn Children And The College Tax Dodge,\" Oct. 9, 2013", "NBC News, \"Abortion Foes Are Cheering This Provision in New GOP Tax Bill,\" Nov. 2, 2017", "Kevin McCarthy, statement, Nov. 7, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]