["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "In this Aug. 28, 2013, file photo, Joseph Maldonado answers a question during an interview at the zoo he runs in Wynnewood, Okla. (AP)", "New routines have emerged for Americans living under quarantine. Some have started making their own sourdough. Many others have settled into their couches and binge-watched \"Tiger King,\" the Netflix documentary about a former big cat breeder, Joseph Maldonado-Passage, aka Joe Exotic.", "In January, Maldonado-Passage was sentenced to 22 years in prison after he was found guilty in a murder-for-hire scheme.", "Now, some people are saying he’s contracted COVID-19 in custody.", "\"Joe Exotic tests positive for coronavirus in prison,\" reads the headline of an April 3 blog post on studentproblems.com. \"It’s been confirmed.\"", "The story goes on to say that \"the Tiger King has been moved to a prison hospital for treatment.\"", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Maldonado-Passage is in self-isolation, according to his husband, Dillon Passage. But that’s because other inmates at a jail where he was held tested positive for COVID-19, according to an April 1 NBC News story.", "Vanity Fair reported on April 3 that Maldonado-Passage was placed under quarantine after moving to a new detention facility.", "The New York Post reported on April 2 that Maldonado-Passage was transferred from coronavirus isolation to a prison medical center in Fort Worth, Texas. The medical center told the Post that Maldonado-Passage’s condition \"is not public.\"", "\"We speak, like, three to five times every day, but since he’s been moved to this new facility, they are putting him on COVID-19 isolation because of the previous jail he was at, there were cases,\" Passage told Andy Cohen on a SiriusXM show.", "Initial reports from British tabloids said that Maldonado-Passage had contracted COVID-19 in prison, according to Vanity Fair, but the publication says \"that rumor has not yet been proven.\"", "An Oklahoma City Fox News affiliate reported on April 2 that a post on Maldonado-Passage’s Facebook page claims he does not have the disease.", "\"Joe DOES NOT have the COVID-19 virus,\" the Facebook post says. \"He’s in a 14-day quarantine because he was transferred from another facility.\"", "We rate this blog post False.", "Studentproblems.com, Joe Exotic tests positive for coronavirus in prison, April 3, 2020", "Netflix, \"Tiger King,\" visited April 3, 2020", "NBC News, Wildlife park owner ‘Joe Exotic’ sentenced to 22 years in plot to kill animal rights activist, Jan. 20, 2020", "NBC News, Joe Exotic from Netflix’s ‘Tiger King’ is in coronavirus quarantine, his husband says, April 1, 2020", "YouTube, Andy Cohen talks exclusively with \"Tiger King\" Joe Exotic’s husband Dillon Passage, April 1, 2020", "Vanity Fair, Yes, Tiger King’s Joe Exotic is under quarantine amid coronavirus concerns, April 3, 2020", "New York Post, Joe Exotic transferred from coronavirus isolation to prison medical center, April 3, 2020", "Joseph A. Maldonado-Passage Facebook post, April 2, 2020", "Fox 25, ‘Tiger King’ Joe Exotic charging for email, letters under coronavirus quarantine, April 2, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]