["On August 13, IAS officer Sonmoni Borah tweeted a 30-second video. In the video, a man can be seen walking through a crowded arena, with a robot following close behind him. The surrounding onlookers are seen taking pictures of the robot. Borah wrote, “King of Bahrain’s bodyguard robot is going viral on (sic) Social Media!! Technology & AI replacing humans very fast!” (Tweet archive)", "New #Avatar of #Hulk 😅😅?? King of #Bahrain ‘s bodyguard #robot is going viral in Social Media !! Technology & AI replacing humans very fast ! @ipskabra @ParveenKaswan @ipsvijrk#awesome #technology #ArtificialIntelligence #Amir #Wed #ironman pic.twitter.com/ddQ68U8lMX", "— Sonmoni Borah IAS (@sonmonib5) August 13, 2020", "DY365, a regional news channel from Assam, had also shared the video on Facebook as the robot bodyguard of the King of Bahrain. Its caption stated, “An undated video of a robot bodyguard belonging to King of Bahrain is going viral on social media.”", "Viral video | King of Bahrain’s robot bodyguard", "#ViralVideo #Robot #Bodyguard #KingOfBahrain #World #DY365 An undated video of a robot bodyguard belonging to King of Bahrain is going viral on social media", "Posted by DY365 on Thursday, 13 August 2020", "A Twitter user Sanjay Bhutiani tweeted the video and wrote, “The Emir of Bahrain arrived in Dubai with his Robot Body Guard”. The video has been viewed over 1 lakh times as of this writing.", "*The Emir of Bahrain arrived in Dubai with his Robot Body Guard* #Robot #Robitic pic.twitter.com/MPtIHz9fZu", "— sanjay bhutiani (@sanjaybhutiani) August 12, 2020", "In a reply to Bhutiani’s tweet, a person said that the Emir (King) of Bahrain was not in the video which was actually taken during a security exhibition last year. He also stated that the UAE national flag can be seen on the robot’s body. A closer look at the video shows the flag can indeed be seen on the arm and shoulder of the robot.", "We found an article dated February 19, 2019, from the Khaleej Times, which stated that an 8-foot robot named Titan greeted visitors at the UAE International Security Exhibition in Abu Dhabi. According to the report, “Visitors of the ongoing International Defence Exhibition (Idex) in the Capital are amused by the robot greeter, Titan, that comes out after every hour to greet them and welcome them to the region’s largest defence exhibition. Wearing a military vest, the robot Titan, walks through the crowds as he introduces himself in both Arabic and English. Wearing a military vest, the robot Titan, walks through the crowds as he introduces himself in both Arabic and English. Titan, a famous walkaround robot, is 8ft tall and weighs 60 kg. He is the world’s first commercial entertainment robot artist and was developed by the British company Cyberstein.”", "Video: 8-ft Titan robot greets visitors at #UAE defence show #IDEX2019 https://t.co/AIFuu84b4n", "— Khaleej Times (@khaleejtimes) February 18, 2019", "We also found a 3-minute Youtube video which was the full version of the viral clip in question. The video was uploaded by a channel called ‘DUBAI7’ on February 24, 2019. The national flag of the UAE can be seen on the robot’s hands and shoulders in the video.", "Therefore, this video claimed to be of a bodyguard robot of the King of Bahrain is factually incorrect. It is, in fact, from the February 2019 International Security Exhibition held in the UAE.", "Donate Now", "Priyanka Jha specialises in monitoring and researching mis/disinformation at Alt News. She also manages the Alt News Hindi portal.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "Trigger Warning: Sexual Violence A distressing video of a girl forced to take her clothes…", "A clip featuring Pakistan men’s Cricket team captain Babar Azam is viral on social media…", "A 13-second clip featuring Bollywood actor Shah Rukh Khan is being shared on social media…", "Union minister of information and broadcasting Anurag Thakur on September 26 announced Waheeda Rehman as…"]