["By Robert Farley", "Posted on January 13, 2021 | Updated on May 24, 2021", "On the day of the Capitol riot on Jan. 6, the first National Guard members arrived to assist at about 5:40 p.m. By then, most of the violence had subsided.", "In the critical minutes before rioters had breached the Capitol building around 2 p.m., the chief of the U.S. Capitol Police force and the mayor of Washington, D.C., put out urgent requests for guard backup. But it took more than an hour to get formal approval for their deployment, and then nearly three more hours for the first guard reinforcements to arrive.", "The D.C. National Guard reports to the president.", "In a recorded video the following day, President Donald Trump claimed that he “immediately deployed the National Guard and federal law enforcement to secure the building and expel the intruders.” But Trump’s claim that he acted quickly is contradicted by news reports citing unnamed sources who say the president initially resisted efforts to bring in the National Guard at the outset of the Capitol riot.", "The New York Times, citing unnamed Defense Department officials, said it was Vice President Mike Pence, not Trump, who approved deployment of the D.C. National Guard that afternoon. The Times also cited a “person with knowledge of the events” who said Trump “initially rebuffed and resisted requests to mobilize the National Guard “and that the “mobilization was initiated with the help of Pat A. Cipollone, the White House counsel, among other officials.”", "CNN also reported that Trump “initially resisted” deploying the guard, according to an unnamed “source familiar” with the decision to call in the National Guard. Neither report says how long Trump may have resisted the call — minutes, hours? — whether that led to any appreciable delay in activating the guard, or whether an earlier deployment could have averted the worst of the violence.", "Defense Department officials stress that Capitol Police did not request National Guard troops for the Capitol prior to the event — despite repeated offers from the military. The guard is “not designed to be an emergency response force,” one defense official told the Wall Street Journal.", "So why weren’t National Guard troops included in the plans leading up to the rally to guard the Capitol that day? Why did it take so long for the guard to arrive that afternoon? And what was Trump’s role? The answers to those questions are likely to emerge as investigations about the response unfold.", "Here, we present a timeline about the efforts to deploy National Guard troops. We’ll supplement this report as we learn more.", "Dec. 31: Washington, D.C., Mayor Muriel Bowser and Dr. Christopher Rodriguez, the D.C. director of homeland security and emergency management agency, deliver a written request for D.C. National Guard support of the D.C. Metropolitan Police Department for the rally, according to a Pentagon timeline issued Jan. 8. In her letter, Bowser says, “No DCNG personnel shall be armed during this mission, and at no time, will DCNG personnel or assets be engaged in domestic surveillance, searches, or seizures of US persons.”", "That same day, Democratic Rep. Maxine Waters has an hourlong phone conversation with Capitol Police Chief Steven Sund to express her “grave concerns” about proposed security for the rally, given that several right-wing extremist groups were expected to be in attendance. Waters says Sund — who did not request National Guard backup prior to the day of the riot — assured her the Capitol plaza would be “absolutely secured” and that rally attendees “would not be able to get inside or on top of the Capitol building.”", "The Capitol Police has jurisdiction over the federal Capitol building and grounds, while the D.C. police force has jurisdiction over city streets and property.", "Jan. 3: The Department of Defense confirms with Capitol Police that there is no request for DoD support, according to the Pentagon.", "Acting Defense Secretary Christopher Miller meets with “select Cabinet Members to discuss DoD support to law enforcement agencies and potential requirements for DoD support,” the Pentagon says.", "Miller and Gen. Mark Milley, chairman of the Joint Chiefs of Staff, meet with Trump, according to the Department of Defense. Trump agrees to activate the D.C. National Guard to support D.C. police (not Capitol Police) with crowd and traffic control. The Pentagon later tells Pro Publica, “The President had no role in tactical matters as the capabilities deployed and location were dictated solely by the request from D.C. government.”", "D.C. Police Chief Robert Contee says 340 guardsmen will assist with crowd management and traffic control to free up the city police officers to respond to potential acts of violence and other security issues, according to CNN.", "Jan. 4: Capitol Police again confirms there is no need for DoD support in a phone call with Army Secretary Ryan McCarthy, according to the Pentagon. Miller, in consultation with Milley, McCarthy and DoD general counsel, “reviews the Department’s plan to be prepared to provide support to civil authorities, if asked, and approves activation of 340 members of the DCNG to support Mayor Bowser’s request.” The support is mostly for traffic control, crowd control at subway stations and logistics support. Miller also authorizes McCarthy to deploy a “Quick Reaction Force” of 40 National Guard members staged at Joint Base Andrews in Maryland “if additional support is requested by civil authorities.”", "Capitol Police Chief Sund asks the House and Senate sergeant-at-arms about the possibility of placing the D.C. National Guard on standby, in case the Capitol Police needed quick backup. In an interview with the Washington Post published on Jan. 10, Sund says they were hesitant to agree. According to the article, “House Sergeant at Arms Paul Irving said he wasn’t comfortable with the ‘optics’ of formally declaring an emergency ahead of the demonstration, Sund said. Meanwhile, Senate Sergeant at Arms Michael Stenger suggested that Sund should informally seek out his Guard contacts, asking them to ‘lean forward’ and be on alert in case Capitol Police needed their help.” All three officials — Sund, Irving and Stenger — have since resigned.", "Update, Jan. 28: In prepared testimony for her Jan. 26 appearance before a closed session of the House Appropriations Committee – which was obtained by the New York Times — the acting chief of the Capitol Police, Yogananda D. Pittman, confirmed that on Jan. 4 – two days before the riot – “Sund requested that the Capitol Police Board declare a state of emergency and authorize a request to secure National Guard support. The Board denied the request, but encouraged Chief Sund to contact the DC National Guard to determine how many Guardsman could be sent to the Capitol on short notice, which he did.” The Capitol Police Board has three voting members: the House and Senate sergeants-at-arms and the architect of the Capitol. As we noted in our initial report, the House and Senate sergeants-at-arms have since resigned.", "Jan. 5: According to the Pentagon, Mayor Bowser delivers a letter addressed to the U.S. acting attorney general, Miller and McCarthy confirming that there are no additional support requests from the D.C. National Guard. Bowser later says that she already had the support she requested from the National Guard and that any decision to request guard forces to protect the Capitol is not hers. “The Capitol Police and the leadership at the Capitol, they did not make the decision to call in guard support,” Bowser later says in a press conference on Jan. 7. “I cannot order the Army, the National Guard, to the United States Capitol grounds. I can, in the district, with the approval of the secretary of the Army.”", "According to an internal document reviewed by the Washington Post, an FBI office in Virginia issues a warning that extremists are preparing to commit violence in Washington on Jan. 6. According to the bulletin — which Steven D’Antuono, head of the FBI’s Washington field office, said was shared “with all our law enforcement partners” through the joint terrorism task force — “An online thread discussed specific calls for violence to include stating ‘Be ready to fight. Congress needs to hear glass breaking, doors being kicked in, and blood from their BLM and Pantifa slave soldiers being spilled. Get violent. Stop calling this a march, or rally, or a protest. Go there ready for war. We get our President or we die. NOTHING else will achieve this goal.” Sund told the Post he never received nor was made aware of the FBI’s field bulletin.", "Update, Jan. 28: According to a Jan. 5 memo obtained by the Washington Post, the Pentagon restricted the authority of Maj. Gen. William J. Walker, the commanding general of the District of Columbia National Guard, so that he could not deploy the quick reaction force without approval from higher-ups. In an interview published in the Washington Post on Jan. 26, Walker said those required authorizations contributed to delays in the National Guard response the following day. According to the Washington Post, Walker “needed to wait for approval from [former Army secretary Ryan] McCarthy and acting defense secretary Christopher C. Miller before dispatching troops, even though some 40 soldiers were on standby as a quick reaction force. That standby force had been assembled in case the few hundred Guard members deployed that day on the District’s streets to assist police with traffic control and crowd management needed help, Walker said. … Had he not been restricted, Walker said he could have dispatched members of the D.C. Guard sooner.”", "12:40 p.m.: The first protesters arrive at the Capitol, where Congress is meeting in joint session to certify Joe Biden’s election.", "1.p.m.: Trump begins to wrap up his speech at the “Save America” rally at the Ellipse, a park near the White House. He tells rallygoers the presidential election was “stolen” by Democrats and the “fake news media,” and says that he’s going to walk with the crowd to the Capitol “to try and give our Republicans, the weak ones … the kind of pride and boldness that they need to take back our country.” But Trump does not accompany the rally attendees to the Capitol.", "Sund says he already realizes “things aren’t going well,” that the protesters came with riot helmets, gas masks, pepper spray, fireworks, metal pipes and baseball bats. Sund calls Metropolitan Police Chief Contee, who sends 100 officers to the Capitol, with the first ones arriving within 10 minutes, according to Sund’s interview with the Washington Post.", "1:09 p.m.: Sund tells Irving and Stenger by phone that the National Guard is needed. Sund says both men told him they would “run it up the chain.”", "Update, Jan. 28: According to Pittman’s prepared statements, the Capitol Police Board – which at the time included Irving and Stenger — contributed to a delayed response by the National Guard on the day of the riot. Pittman stated that on the afternoon of Jan. 6 Sund “lobbied the Board for authorization to bring in the National Guard, but he was not granted authorization for over an hour.”", "1:26 p.m.: Capitol Police order the evacuation of the Capitol complex.", "1:34 p.m.: In a phone call with Secretary of the Army McCarthy, Bowser requests an “unspecified number of additional forces,” according to the Pentagon timeline.", "1:49 p.m.: Sund, in a phone call with the commanding general of the D.C. National Guard, Maj. Gen. William Walker, requests immediate assistance, and tells him to prepare to bring in the guard.", "About 2 p.m.: Rioters breach the Capitol. In an interview with the Washington Post published on Jan. 10, Sund says, “If we would have had the National Guard we could have held them at bay longer, until more officers from our partner agencies could arrive.”", "2:10 p.m.: Sund says Irving calls him back with formal approval to send in the guard. But as the Washington Post noted, “Sund finally had approval to call the National Guard. But that would prove to be just the beginning of a bureaucratic nightmare to get soldiers on the scene.”", "2:22 p.m.: The secretary of the Army, Bowser, D.C. police leadership and others “discuss the current situation and to request additional DCNG support,” according to the Pentagon timeline.", "2:24 p.m.: Trump tweets, “Mike Pence didn’t have the courage to do what should have been done to protect our Country and our Constitution, giving States a chance to certify a corrected set of facts, not the fraudulent or inaccurate ones which they were asked to previously certify. USA demands the truth!”", "2:26 p.m.: Sund says he joins the conference call to plead for additional backup. “I am making urgent, urgent immediate request for National Guard assistance,” Sund recalls saying. According to Sund and others on the call, the Washington Post reports, Lt. Gen. Walter E. Piatt, director of the Army staff, says he could not recommend that to his boss, McCarthy, because, “I don’t like the visual of the National Guard standing a police line with the Capitol in the background.”", "However, Piatt disputed that, saying in a statement: “I did not make the statement or any comments similar to what was attributed to me by Chief Sund in the Washington Post article — but would note that even in his telling he makes it clear that neither I, nor anyone else from [the Department of Defense], denied the deployment of requested personnel.”", "2:30 p.m.: Miller, Milley and McCarthy meet to discuss the requests from Capitol Police and Bowser.", "3 p.m.: Miller “determines all available forces of the DCNG are required to reinforce MPD [Metropolitan Police Department] and USCP positions to support efforts to reestablish security of the Capitol complex,” according to the Pentagon timeline. Simultaneously, the D.C. National Guard prepares to move 150 personnel to support Capitol Police, pending Miller’s approval.", "3:04 p.m.: Miller “provides verbal approval of the full activation of DCNG (1100 total) in support of the MPD,” according to the Pentagon. In response, McCarthy immediately directs the D.C. National Guard “to initiate movement and full mobilization.” That means the D.C. guard members helping with traffic and crowd control are redeployed to support the Metropolitan Police Department at the Capitol, and the entire D.C. guard begins full mobilization.", "3:19 p.m.: McCarthy explains in a phone call to Sen. Chuck Schumer and House Speaker Nancy Pelosi that Miller has already approved full DCNG mobilization. Miller later releases a statement saying, “Chairman Milley and I just spoke separately with the Vice President and with Speaker Pelosi, Leader McConnell, Senator Schumer and Representative Hoyer about the situation at the U.S. Capitol. We have fully activated the D.C. National Guard to assist federal and local law enforcement as they work to peacefully address the situation.” No mention is made of Trump’s involvement.", "3:36 p.m.: White House Press Secretary Kayleigh McEnany tweets: “At President @realDonaldTrump’s direction, the National Guard is on the way along with other federal protective services.”", "4:17 p.m.: Trump releases a video on social media in which he states, in part, “We had an election that was stolen from us. It was a landslide election and everyone knows it, especially the other side, but you have to go home now. We have to have peace. We have to have law and order. … We love you. You’re very special. You’ve seen what happens. You see the way others are treated that are so bad and so evil. I know how you feel. But go home and go home in peace.”", "5:02 p.m.: 154 members of the D.C. National Guard leave the D.C. Armory.", "5:40 p.m.: The first National Guard personnel arrive at the Capitol. By then, most of the violence had ended.", "6 p.m.: A citywide curfew goes into effect.", "6:01 p.m.: Trump tweets, “These are the things and events that happen when a sacred landslide election victory is so unceremoniously & viciously stripped away from great patriots who have been badly & unfairly treated for so long. Go home with love & in peace. Remember this day forever!”", "6:14 p.m.: Capitol Police, Metropolitan Police and the D.C. National Guard “successfully establish perimeter on the west side of the U.S. Capitol,” the Pentagon timeline states.", "8 p.m.: Capitol Police declare the Capitol building secure.", "8:06 p.m.: Vice President Mike Pence reopens the Senate. “The Capitol is secured and the people’s work continues,” Pence says. “To those who wreaked havoc in our Capitol today, you did not win. Violence never wins. Freedom wins, and this is still the people’s house.” Pelosi brings the House back into session less than an hour later.", "Early the next morning, Pence officially affirmed the election results and that Joe Biden won the presidency.", "In total, five people died as a result of the riot, including Capitol Police Officer Brian D. Sicknick, who was “injured while physically engaging with protesters” and died as a result of those injuries the day after the riot, according to Capitol Police.", "Update, May 24: The Washington Post reported on April 19 that District of Columbia Chief Medical Examiner Francisco J. Diaz found that Sicknick suffered two strokes nearly eight hours after being sprayed with a chemical irritant during the riot. Diaz told the Post that Sicknick died of natural causes, but “all that transpired played a role in his condition.”", "Two Senate committees have announced a joint investigation into security failures related to the Jan. 6 riot.", "“I think that there’s going to be a lot of time for us to figure out what happened,” D.C. Mayor Bowser said on Jan. 7. “Obviously it was a failure or you would not have had police lines breached and people enter the Capitol building by breaking windows and terrorizing the people, the members of Congress who were doing a very sacred constitutional requirement of their jobs. So clearly there was a failure there.”", "Editor’s note: FactCheck.org does not accept advertising. We rely on grants and individual donations from people like you. Please consider a donation. Credit card donations may be made through our “Donate” page. If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, 202 S. 36th St., Philadelphia, PA 19104.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here for more.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]