["The posts, including this one and this one, appeared on Facebook from December 4, 2018, showing Roxas, a political rival of Philippine President Rodrigo Duterte, travelling on Manila’s public train service.", "Here is a screenshot of one of the posts:", "The caption, when translated to English, says: “Oh no, Mar has another new viral picture in the MRT”.", "MRT refers to the Metro Rail Transit, the train system in Manila.", "The MRT has long struggled with maintenance issues, delays, and overcrowding.", "Comments on the posts indicated people suspected Roxas was riding the MRT just for publicity because he was running for senator in the 2019 elections.", "One comment, when translated to English, says: \"So all the time he’s lived in the greater Manila area, he only took the MRT now - nothing to do with the upcoming elections, surely!\"", "A reverse search found the photo was posted to Facebook in 2014 when Roxas was a cabinet secretary in the previous administration of Benigno Aquino.", "The photo was also published in 2014 by different websites, including here and here.", "It was also posted in a 2014 Reddit thread with the comment: “Mar Roxas is pathetic and getting desperate. Apparently taken by a random train rider during the Friday rush hour”.", "The misleading posts have been shared hundreds of times since they were posted.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]