["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "We traced this fabricated claim to a website that produces what it considers satirical content.", "Facebook users recently spotted a suspicious article about the deadly Northern California wildfires, through the social network’s initiative that allows readers to flag fake news.", "Given the steady flow of misleading and intentionally false claims about the cause of the fires, PolitiFact California decided to fact-check the article, which appears to have been posted Dec. 11, 2017.", "It’s from the website USA In Front and includes a sensational headline:", "BREAKING: ILLEGAL MUSLIM FROM IRAN ARRESTED FOR STARTING CALIFORNIA WILDFIRE", "The article lists \"a 23-year-old man named Muhammad Islam\" as \"the actual person responsible for the fire,\" citing Fox News as the source of the information. We found the network never reported that.", "Before we examine the story and what appears to be its clearly false assertion, here’s some background on the destruction of the fires.", "The wind-driven blazes that started Oct. 8, 2017 are the most deadly series of fires in California’s history. They killed 42 people across Northern California and destroyed more than 8,400 homes, businesses and other buildings. Much of the damage was centered in Napa and Sonoma counties.", "Our research", "We started our fact-check by contacting the California Department of Forestry and Fire Protection, or Cal Fire, the agency in charge of investigating the cause of the blazes.", "Cal Fire spokesman Scott McLean said there have been no arrests, contradicting the claim in the article.", "\"All the major fires that occurred in October are still being investigated. No arrests have been made in reference to the October siege,\" McLean wrote.", "We reached out to USA In Front for comment but did not hear back.", "The website lists its owner as USA In Front Inc., though we were unable to find out where it is based. The site appears to allow users to create an account and submit content. It includes articles on news and politics with a right-wing bent with headlines such as \"Poll: Should Barack Obama Lose His Presidential Pension?\" to \"Meet The Most Liberal, Fiscally Irresponsible, and Pro-Death Republican in Texas.\"", "Article’s origin", "We found the story about the arrest of a Muslim man did not start with USA In Front. In October, the fact-checking website Snopes.com, found this tale originated on a site, FreedomJunkshun, that describes its content as satire. Snopes found \"none of the details are based in fact, and the Fox News report mentioned in the article also does not exist.\"", "But what started on the satirical site didn’t stay there.", "The story circulated around the web, and was posted word-for-word on sites such as World Today 365 and USA In Front. Those websites presented the story as news without any mention of its satirical origin.", "When we first examined the article, we noticed a few red flags: It does not have a byline, so there’s no direct way to contact the person that wrote the story. Unlike traditional, credible news articles, the story does not have a date or dateline.", "Additionally, the article fails to cite any specific people as sources.", "This is not the only time USA In Front has been flagged. The national PolitiFact handed out a Pants On Fire earlier this month for the site’s made-up story that Senate Democratic Leader Chuck Schumer had an affair with a teenage cheerleader.", "PolitiFact maintains a list of more than 300 websites, as of November 2017, where it’s found deliberately false or fake stories. The national website describes it this way:", "\"This is by no means a complete list of offenders. Nor does it mean every post on these websites is fake. But in most cases, these sites work hard to fool readers, and you should take that into consideration if should you see a link being shared from one.\"", "Breitbart’s false claim", "The story posted on USA In Front has some parallels to a claim in a Breitbart article PolitiFact California rated False in October. Breitbart’s article said an undocumented immigrant from Mexico \"was arrested on suspicion of arson in (the) Wine Country fires that have killed at least 40 residents.\"", "In reality, an undocumented man had been arrested for an unrelated small fire a week after the deadly blazes started. Sonoma County sheriff’s officials called out Breitbart for fueling the false rumors. State fire authorities said they had not identified an arson suspect nor determined whether arson was the cause of the fires.", "Breitbart’s article, or versions of it, quickly spread across right-wing media outlets, including InfoWars and the Drudge Report, which shared Breitbart's unsubstantiated claims -- as detailed by BuzzFeed News.", "After fact-checkers pointed out the false claim, Breitbart added an \"update\" saying the man was not suspected of starting the deadly fires.", "Our ruling", "A story recently posted on the website USA In Front claimed a Muslim man had been arrested for starting the deadly Northern California wildfires.", "The website and others presented the claim as if it were news, though it originated as a false tale on a satirical website.", "A spokesman for the state’s fire agency, Cal Fire, told us there had been no arrests and that the cause of the fires remains under investigation.", "The article on USA In Front is another example of the many fabricated claims tied to the deadly blazes. It lacks a byline, any specific sources and any disclaimer about its origin as satire. We didn’t hear back from the website.", "Posting the story without this key warning is reckless and perpetuates false and damaging information.", "We rate the claim in the USA In Front article Pants On Fire.", "PANTS ON FIRE – The statement is not accurate and makes a ridiculous claim.", "Click here for more on the six PolitiFact ratings and how we select facts to check.", "Editor’s Note: In December 2016, PolitiFact.com joined a coalition of fact-checkers who agreed to work with Facebook to try to slow the spread of misinformation in people’s news feeds. The above article by PolitiFact California is a result of that partnership.", "Facebook introduced a new tool after the 2016 campaign that allows users to mark a post as a \"false news story,\" and if enough do, the post is sent to fact-checkers such as PolitiFact, Snopes and Factcheck.org.", "If the fact-checkers find the story to be \"false,\" a warning label is attached to the original post in Facebook’s news feed, and Facebook’s algorithm makes it more difficult for the disputed post to spread virally.", "USA In Front, BREAKING: ILLEGAL MUSLIM FROM IRAN ARRESTED FOR STARTING CALIFORNIA WILDFIRE, December 2017", "FreedomJunkshun, BREAKING: Illegal Muslim From Iran Arrested For Starting California Wildfire, Oct. 20, 2017", "Scott McLean, spokesman, California Department of Forestry and Fire Protection, email exchange, Dec. 18, 2017", "Snopes.com, Immigrants Arrested for Starting California Wildfires?, Oct. 20, 2017", "PolitiFact California, Breitbart’s False and inflammatory claim about deadly Wine Country fires, Oct. 17, 2017", "World Today 365, BREAKING: Illegal Muslim From Iran Arrested For Starting California Wildfire, Oct. 20, 2017", "PunditFact, Fake news says Chuck Schumer had affair with teenage cheerleader, Dec. 18, 2017\n\nPunditFact, PolitiFact's guide to fake news websites and what they peddle, April 20, 2017", "PolitiFact, We started fact-checking in partnership with Facebook a year ago today. Here's what we've learned, Dec. 15, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]