["By Angelo Fichera", "Posted on February 21, 2020", "A viral post claims, falsely, that Sen. Bernie Sanders at a recent debate called for a tax rate of 52% on incomes of $29,000 or more to pay for his Medicare for All plan. He didn’t. That figure was floated as a potential marginal tax rate for income above $10 million.", "A viral post on social media falsely claims that presidential candidate Sen. Bernie Sanders recently proposed a 52% tax rate for those making $29,000 annually.", "The post, titled “Bernie Sanders Insane Policies,” correctly notes that Sanders said “at the debate last night” — presumably the Feb. 19 Democratic debate in Las Vegas — that he wants the minimum wage to rise to $15 per hour (a position he’s long held). But it invents a supposed “answer” that Sanders provided in response to a question about how he would pay for Medicare for All, his proposal for a universal government-run health insurance system.", "The claim spread rapidly on Facebook and Twitter after the most recent debate and was propelled by the well-followed Twitter account of the actor James Woods, a supporter of President Donald Trump.", "“His answer was raise taxes to 52% on anybody making over $29,000 per year,” the post erroneously says, before diving into a math equation intended to show that such an exorbitant tax rate would render a higher minimum wage ineffective.", "But Sanders didn’t call for a 52% income tax rate for those making $29,000 at the debate, the transcript shows, or elsewhere that we could find.", "Sanders has put forth several ways to raise revenue to pay for Medicare for All. In one document posted by Sanders, he suggested a potential marginal tax rate of 52% on income above $10 million — meaning taxable income earned after the first $10 million would be taxed at that rate.", "Another Sanders document on financing the plan, from last year, suggests that the rate could be higher for income above $10 million. It suggests “[m]aking the federal income tax more progressive, including a marginal tax rate of up to 70 percent on those making above $10 million, taxing earned and unearned income at the same rates, and limiting tax deductions for filers in the top tax bracket.”", "As for the $29,000 figure, the same financing proposal calls for a potential “4 percent income-based premium paid by employees, exempting the first $29,000 in income for a family of four.” Under a Medicare for All system, health care costs currently paid by individuals, employers, private insurers, and state and local governments would shift to the federal government.", "Sanders has come under criticism from some of his Democratic competitors over the costs of his universal health care plan and how to pay for it. As we’ve explained before, there have been various estimates — including one study published by his 2016 presidential campaign that said the plan would reduce national health spending by $6.3 trillion over 10 years. Others have found national spending would increase by $6.6 trillion over 10 years.", "A recent Yale study — the lead author of which disclosed that she was an “informal unpaid adviser” to Sanders’ office for his 2019 Medicare for All Act — concluded the plan could reduce national health care spending by more than $450 billion annually.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "“Financing Medicare for All.” Office of Sen. Bernie Sanders. 2019.", "“Full transcript: Ninth Democratic debate in Las Vegas.” NBC News. 20 Feb 2020.", "Kiely, Eugene, et. al. “FactChecking the New Hampshire Democratic Debate.” FactCheck.org. 8 Feb 2020.", "Robertson, Lori. “The Facts on Medicare for All.” FactCheck.org. 24 Apr 2019.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]