["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "(Shutterstock)", "A Facebook post gives the impression that Congress is sticking it to ordinary folks when it comes to Social Security and disability benefits, while handsomely taking care of itself.", "\"Congress rejects $336 month increase in SS/SSDI but approves $8,872 month increase for themselves,\" the post says. \"Vote them out!!!\"", "The claim is a head turner, partly because Social Security is so big. The $1 trillion-a-year program helps more than 63 million retirees, the disabled and their families.", "But it’s wrong on both counts.", "FactCheck.org checked the same claim in June, saying it was made in a viral post on Facebook, and found it false. Our friends pointed out that:", "1. Annual cost-of-living adjustments for beneficiaries of Social Security and Supplemental Security Income benefits are determined not by Congress but by the percentage increase in the Consumer Price Index for Urban Wage Earners and Clerical Workers, which is calculated by the federal Bureau of Labor Statistics.", "We found that the cost-of-living increase for 2020, which was announced nearly two months before the post we’re checking, is 1.6%.", "For a worker retiring at full retirement age, the maximum Social Security benefit in 2020 is $3,011 per month, up $150 from 2019.", "2. At the time of the FactCheck.org check, Congress had not decided whether to allow an automatic increase in pay for its members of 2.6% for 2020. That would have meant an additional $4,500 annually — not \"$8,872 monthly.\"", "A deal for the $4,500 pay raise fell apart after a group of freshmen Democrats facing tough re-election campaigns asked their leader not to move forward, the New York Times reported.", "That means the annual salary for members of the House and Senate remains at $174,000. (Leaders earn more.)", "As we’ve reported, under federal law, congressional pay raises are fixed to the Employment Cost Index, which measures changes in wages. The raises are automatic each year unless Congress votes it down — which it has done every year since 2009.", "A Facebook posts says \"Congress rejects $336 (per) month increase in\" Social Security and disability benefits \"but approves $8,872 (per) month increase for themselves.\"", "Cost-of-living adjustments for Social Security are determined by a federal agency using a consumer price index measure, not by Congress. And Congress hasn’t allowed itself a pay raise since 2009.", "We rate the statement False.", "Facebook post, Dec. 2, 2019", "FactCheck.org, \"Post Misleads on Congressional Salaries, Social Security,\" June 14, 2019", "New York Times, \"A Truce Falters, and a Plan to Raise Congress’s Pay Falls Apart,\" June 11, 2019", "Social Security Administration, \"Social Security Announces 1.6 Percent Benefit Increase for 2020,\" Oct. 10, 2019", "PolitiFact, \"No, congressional salaries have not gone up 231% over the last 30 years,\" Aug. 7, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]