["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "\"Outstanding,\" begins a congratulatory message quoting an \"Antifa page.\"", "\"Trump supporters tackled an Antifa thug, unmasked him, duct taped him to an electrical box, placed a dildo on his head & wrote ‘I’m a unicorn’ on him..\"", "The image being shared on Facebook shows, well, a person taped to what looks like an electrical box with the words \"I’m an unicorn!!\" written on the tape.", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The image isn’t from the recent unrest stemming from the death of George Floyd, who was killed after a police officer pressed his knee into Floyd’s neck.", "We did a reverse image search of the photo and found it online as early as 2015 with this caption: \"It’s Friday b—.\" It re-emerged in March 2018 with this caption: \"Me: I’m not gonna drink tonight guys. 4 hours later:\"", "When Snopes fact-checked the image in 2017, the fact-checking website found that the image was part of a street art series created by an artist named Rallitox.", "A photo posted on Rallitox’s Instagram shows the scene from a different angle, and \"Rallitox\" can be seen written below \"I’m an unicorn!!\" The caption says: \"Human sticker serie. I’m aN unicorn!! Berlin 2015.\"", "We rate this post False.", "Facebook post, June 10, 2020", "Imgur, It’s Friday, July 31, 2015", "Me.me, Me: I’m not gonna drink tonight guys, March 19, 2018", "Rallitox Instagram post, Dec. 12, 2019", "Snopes, Did ‘Nazis’ tape an Antifa member to a utility box? May 2, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]