["About this rating", "A man dressed as a town crier announced the arrival of the newest member of the royal family.", "Tony Appleton is a self-proclaimed \"royalist crier,\" but he is not officially connected to the royal family.", "Although most people heard about the arrival of Prince William and the Duchess of Cambridge's third child via news articles and social media posts on the morning of 23 April 2018, some of the public came across the news from a more historically traditional source: a town crier. At least that's how it appeared.", "Photographs and videos of a \"town crier\" announcing the birth of a new prince were shared by outlets such as Metro, the Associated Press and Sky News. CBS News even published the birth announcer's photograph and identified him as the \"official\" town crier:", "CBS made a similar statement during their morning broadcast, when anchor Norah O'Donnell dubbed the crier's announcement the \"official proclamation\":", "CBS News deleted its \"official royal baby proclamation\" tweet but you can't delete live TV pic.twitter.com/hYwwOXu4x8", "— Matthew Champion (@matthewchampion) April 23, 2018", "How about that for a birth announcement. That’s the way they do it there.", "That’s what you call the official proclamation outside St Mary’s hospital in London, the birth of Prince William and Duchess Kate’s new baby born earlier this morning. It is a boy weighing in at 8 pounds 7 ounces.", "The problem is that the man in question is not Buckingham Palace's official town crier, nor was he asked to make any sort of proclamation regarding the latest addition to the royal family.", "The man featured in these photographs is Tony Appleton, an octogenarian and self-proclaimed \"royalist crier,\" who has taken it upon himself to announce, as loudly as he can, important news about the royal family. Although Prince William and Kate Middleton have never asked him to do so, Appleton has been making such announcements since 2013, when he showed up uninvited to announce the arrival of Prince George, as noted in contemporaneous news accounts: \"Appleton, who is 81, has shown up uninvited to every major royal announcement since 2013, when he declaimed the news of Prince George’s birth from the steps of the Lindo wing at St Mary’s hospital, London. That earned him appearances on front pages across the globe, not to mention US news networks such as ABC, Fox and CNN.\"", "Appleton has served as town crier for the nearby city of Romford, but he does not represent the royal family. Appleton admitted as much in 2013, when news outlets were similarly confused by his presence:", "Appleton is in fact a crier, but in Romford, a commuter town just east of London, and in Bury St. Edmunds, a market town in southeastern England — not Buckingham Palace. In interview, he said Wednesday that he simply showed up in costume after getting a tipoff from a British journalist that the Duchess of Cambridge, better known as Prince William's wife Kate, had given birth.", "\"I'm a royalist. I love the royal family,\" he said by telephone from Romford, but he acknowledged he had no official royal role. \"I came unannounced.\"", "That didn't stop him from playing a bizarre cameo role on leading U.S. newscasts in the media frenzy surrounding the baby's birth, nor did it prevent confused American journalists from identifying him as a bona fide mouthpiece for Buckingham Palace.", "\"The royal crier delivering the royal news,\" was how CNN's Anderson Cooper described the scene. On Fox News, Stuart Varney told viewers that Appleton was \"the town crier making the official announcement in a very loud voice, all in his full regalia.\"", "Satter, Raphael.   \"Town Crier's Royal Birth Cameo Confuses US Journos.\"\r\n    Associated Press.   24 July 2013.", "Walker, Tim.   \"Tony Appleton: Unofficial Town Crier to the Royal Family (And Star of US TV).\"\r\n    The Guardian.   28 November 2017.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]