["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Sen. Marco Rubio, R-Fla., makes a point during the CNN Republican presidential debate at the Venetian Hotel & Casino on Tuesday, Dec. 15, 2015, in Las Vegas. (AP Photo/John Locher)", "Bloggers revived an 18-month-old fake news story that greatly distorts Republican Sen. Marco Rubio’s position on abortion.", "\"Rubio: ‘Rape victims should be in custody if there is suspicion that they’re planning abortion,’ \" reads the headline on USPOLN.com (short for U.S. political news).", "USPOLN.com, which describes itself as a \"hybrid news/satire platform,\" published the article May 23, 2017. But the story talks about a statement the Florida senator allegedly made at a New Hampshire town hall during his presidential campaign, which ended more than a year ago. As its source, USPOLN.com links to a Nov. 8, 2015, story on politicono.com, also a regular purveyor of fake news.", "The article was flagged by Facebook users as potentially being fabricated.", "The article drastically veers away from Rubio’s real position on abortion.", "USPOLN.com made up this flippant, over-the-top quote and attributed it to Rubio: \"I’m just totally against the whole shebang, I won’t deny it. I am appalled by how insensitive and self-centered rape victims can sometimes be. I mean, sure, okay, you were just violated in the most intimate way, and sure, you had to undergo a detailed physical examination afterwards, but that doesn’t mean you have the right to kill an innocent baby regardless of what it’s father has done to you, come on.\"", "Reporters and debate moderators asked Rubio about his position on abortion and rape victims on several occasions during his primary campaign. Rubio opposes rape and incest exemptions for abortion. He never said rape victims considering abortion should be jailed.", "In fact, Rubio has cosponsored legislation that bans abortions but includes exemptions for victims of rape and incest. He said he does not support these exemptions but recognizes that they are necessary to get more support for the legislation.", "\"A rape is an act of violence,\" he told MSNBC’s Chuck Todd in August 2015. \"It's a horrifying thing that happens. And fortunately the number of abortions in this country that are due to rape are very small, less than 1 percent of the cases in the world. But they happen and they're horrifying and they're tragic, and I recognize that.\"", "He added, \"That being said, I recognize that in order to have a consensus on laws that limit the number of abortions, a lot of people want to see those exceptions and that's why I've supported those laws in the past, as has every pro-life group in America.\"", "USPOLN.com’s about page includes a disclaimer, warning readers that its articles \"may not be reliable\" and that they should consider \"any and all quotes attributed to actual people complete and total baloney.\"", "Yet a perusal of the comments at the bottom of the article shows that at least some people fell for this explosive fake headline about Rubio.", "We rate this headline Pants on Fire!", "USPOLN.com, \"Rubio: ‘Rape Victims Should Be In Custody If There Is Suspicion That They’re Planning Abortion,’ \" May 23, 2017", "CQ, Rubio presidential campaign transcript search, conducted May 31, 2017", "PolitiFact, \"Rubio would take away right to abortions for rape or incest victims, Murphy says,\" Sept. 23, 2016", "PolitiFact, \"Marco Rubio says Hillary Clinton supports abortions 'even on the due date,' \" Feb. 6, 2016", "Snopes, \"GOP presidential candidate Marco Rubio did not say rape victims belong in custody if it's suspected they're considering abortions,\" Nov. 9, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]