["Jerrilyn Johnson of Racine and granddaughters Dalani Finley, 7, and Dailynn Finley, 10, are masked while out and about Saturday, Aug. 1, 2020, the first day of Gov. Tony Evers' mandate requiring them to be worn indoors. (Rick Wood/Milw. Journal Sentinel)l", "Though very few COVID-19 deaths have been reported in people under 20, it’s more than zero, as initially claimed. Nationwide, 96 people under 18 have died from the virus as of Oct. 12, 2020, CDC data show", "Further, the claim that it is unknown whether people under 20 can spread the virus to older adults is off-base: A CDC report found that in outbreak hotspots throughout the U.S. disease prevalence among older age groups occurred after prevalence rose in younger people.", "As a surge in COVID-19 cases threatens to overwhelm Wisconsin hospitals, Republican lawmakers are still pushing to overturn measures put in place by Democratic Gov. Tony Evers to address it, including the statewide mask mandate.", "That includes state Sen. Van Wanggaard, R-Racine, who told the Milwaukee Journal Sentinel that he would not back a mask mandate even if the outbreak in Wisconsin became 10 times worse. (The mandate survived an initial court challenge Oct. 12, 2020.)", "Wanggaard also sought to downplay the seriousness of the virus in young people as he argued that young people should not have to wear masks.", "He told the Journal Sentinel in an Oct. 7, 2020 video interview that no one under the age of 20 has died of COVID-19, and that \"it has not actually been determined yet\" that anyone under 20 can spread it to an older person.", "This is off-base. Let’s break it down.", "Wanggaard’s first claim is that no one under 20 has died of complications from the virus.", "When pressed, Wanggaard backtracked and said that \"less than a third of a percent\" of those in that age group who have contracted COVID-19 have died.", "This is more accurate. Of the nearly 500,000 cases confirmed among Americans ages 0-17, 96 have died, as of Oct. 12, 2020. But it’s not zero. (To be sure, as of Oct. 12, 2020, there were zero deaths in that category in Wisconsin, but Wangaard did not specify the state and was speaking broadly in the interview.)", "Even if the risk of serious illness is lower among young, healthy people, experts have long raised concerns that they could spread it to older adults who are more susceptible to serious illness and death. Wanggaard disputed that, claiming that it has not been determined whether a young person could spread the disease to an older person.", "When asked for evidence to back up Wanggaard’s statement, a spokesman for the senator said he had Googled and found links to four studies conducted throughout the world that found children were rarely transmitting the virus and did not appear to be \"superspreaders\" -- that is, able to infect a disproportionate number of people.", "But showing that young people rarely transmit the virus does not mean, as Wanggaard said, that we do not know whether they ever can.", "A Centers for Disease Control and Prevention report on transmission dynamics by age group in hotspot areas of the U.S., released Oct. 9, 2020, found that the percentage of people testing positive among older age groups began to increase after it increased among people ages 0-17 and 18-24. That suggests that at least some younger people were passing the virus to older people.", "It would have been fair for Wanggaard to say that the jury may still be out on how much young people drive transmission, especially young children.", "But to say that it is not known whether someone under 20 can infect an older person is misleading at best.", "What’s more, there is no scientific reason to believe that the virus would behave differently once the person infected turned 20 or older. Indeed, there have been numerous outbreaks on college campuses and in elementary and high schools around the country.", "Wanggaard told a reporter that COVID-19 had caused zero deaths in people under 20, later backtracking to say that it had caused very few, and claimed that it is unknown whether a person under 20 can pass the disease to an older adult.", "While it’s correct that deaths among that age group are few, and some studies have found that young children did not account for a disproportionate amount of transmission of the virus, the senator’s statement is too absolute to account for the nuance.", "Our definition of Mostly False is a claim that contains an element of truth but ignores critical facts that would give a different impression.", "That fits here.", "Milwaukee Journal Sentinel, \"Republican lawmakers are in court to end Wisconsin's mask mandate, but they won't talk about it,\" Oct. 8, 2020", "Milwaukee Journal Sentinel, \"Judge denies GOP effort to end Tony Evers' mask mandate, upholding governor's ability to issue health orders,\" Oct. 12, 2020", "Milwaukee Journal Sentinel, State Sen. Van Wanggaard, R-Racine, explains his opposition to mask mandates, Oct. 7, 2020", "Centers for Disease Control and Prevention, Demographic Trends of COVID-19 cases and deaths in the US reported to CDC, updated Oct. 12, 2020", "Wisconsin Department of Health Services, COVID-19: Wisconsin deaths, updated Oct. 12, 2020", "Scientific American, \"How ‘Superspreading’ Events Drive Most COVID-19 Spread,\" June 23, 2020", "Centers for Disease Control and Prevention, Transmission Dynamics by Age Group in COVID-19 Hotspot Counties — United States, April–September 2020, Oct. 9, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]