["This Facebook post, published on June 12, 2019, contains a photo of two dark-coloured parked cars with melted rear bumpers and tail lights.", "The post has a Hindi-language caption, which translates as: “In Saudi Arabia, temperatures went up to 62 degree Celsius as reports are coming in of cars parked in the sun have their fiber parts melting.”", "Below is a screenshot of the misleading Facebook post:", "The same photo has also been shared on Facebook here and here in June 2019 with the caption: “Today It Was 52°C In Saudia Arabia”.", "Other Facebook posts, for example this one published June 28, 2018, say the cars were “melted by scorching heat in Oman”; this post says the cars \"melted in 62 degree heat” but does not say where.", "And this Facebook post, published June 24, 2018, and shared more than 950 times since, combines the same photo with the caption: “Hot Temprature in Arizona due to fire in forest is melting cars”.", "The same photo was also published in this tweet on June 22, 2018 with an incorrect claim that the cars melted due to the weather.", "All these claims are false; the photo actually shows cars melted by a fire at a construction site in Tuscon, Arizona.", "Reverse image searches on Google and keyword searches on Facebook found the same photo published in this Facebook post on June 20, 2018.", "The caption states: \"From across the street where the student housing construction project fire happened last night.\"", "Below is a screenshot of the photo in the Facebook post:", "Keyword searches on Google found this report about a fire in the US city of Tuscon, Arizona, by Tucson News Now, a local news organisation based in Tucson also published on June 22, 2018.", "The report, dated June 22, 2018, is headlined: “Construction site fire in Tucson results in $8-10 million in damages\".", "It states, in part: “The blaze was so hot and bright, it lit up the morning sky and melted cars in a parking lot next door”.", "Below is an image comparing the photo in the misleading Facebook posts (L) with a screenshot of the Tucson News Now report (R), which includes a photo taken from a different angle of one of the melted cars. AFP has circled the matching section in yellow:", "Multiple video reports from the same fire in Tucson by local news channel KGUN9 were published online here on June 19, 2018.", "Here is a Facebook video post by the Tucson Fire department showing the intensity of the fire.", "The caption of the video, which is embedded below, says: “An on-scene look at what our crews battled early this morning during a two alarm fire.", "\"Cranes, cars, trees, and buildings were all damaged due to the extreme temperatures but most importantly, no one was injured”.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]