["About this rating", "Queen Elizabeth II wore a Burmese Ruby Tiara while meeting President Donald Trump in June 2019. The 96 rubies that adorn this tiara are said to symbolically protect the wearer from 96 diseases.", "No evidence exists that the queen specifically chose this tiara as a slight against Trump, and the queen has worn this same tiara on several other occasions and in the company of a wide range of world leaders.", "A rumor started circulating during U.S. President Donald Trump's state visit to the United Kingdom in June 2019 that Queen Elizabeth II had \"thrown shade\" at the American leader by wearing a tiara that symbolically warded off evil and sickness:", "The Burmese Ruby Tiara worn by the Queen on that occasion was commissioned in 1973 and included 96 rubies given to Elizabeth as a wedding present by the people of Burma. The House of Garrard, the jewelry company that made the tiara, recently posted an image of this bejeweled headpiece to their Instagram page and explained that the rubies were originally intended as a symbolic  protection against evil and illness:", "The Queen’s Burmese Ruby Tiara is one of the most symbolic and personal pieces created for Her Royal Highness by the House of Garrard. The 96 rubies mounted in the tiara were originally given to the queen as a wedding gift from the people of Burma, intended as a symbol of protection against illness and evil. #Garrard #royalfamily #heritage #ruby #queenelizabethii", "The Court Jeweler blog elaborated on that topic:", "The new ruby tiara was made by Garrard in 1973. The rubies used in the making of the new piece were also a wedding gift; Elizabeth received them from the people of Burma. The gift included precisely 96 rubies, all of which are now set in the tiara. The Burmese people believe that rubies help protect the wearer from the 96 diseases that can afflict the human body — they definitely wanted to ensure that Elizabeth remained hale and hearty. The rubies and diamonds were set in a series of rose motifs, and if you know your English history, you’ll recognize a heraldic rose that combines white and red petals as the Tudor rose.", "The House of Garrard also posted an image of Queen Elizabeth wearing this tiara during President Trump's state visit in June 2019:", "HM Queen Elizabeth II wore a suite of ruby jewels by Garrard to the State Banquet hosted for the US President yesterday. The Burmese Ruby and Diamond Tiara crafted in 1973 was complemented by a magnificent ruby necklace and matching earrings. #Garrard #royalfamily #queenelizabeth #heritage #highjewellery #tiara", "A post shared by  House Of Garrard (@houseofgarrard) on Jun 4, 2019 at 4:30am PDT", "<!--\nIt's true that the queen wore the Burmese Ruby Tiara during her visit with President Trump. It's also true that this tiara supposedly protects the wearer from sickness. However, no evidence exists that this tiara was purposeful chosen to throw shade at the president of the U.S.\n-->", "If Her Majesty's wearing the Burmese Ruby Tiara were a sign of disrespect, one would expect that headpiece to see infrequent use. However, Elizabeth has worn the tiara on numerous occasions since it was commissioned in 1973, including while meeting world leaders such as South Korean President Roh Moo-hyun, India's President Pratibha Patil, Slovenia's President Danilo Turk, King Abdullah II of Jordan, and French President François Mitterrand. The queen has also worn the tiara during celebratory events such as her silver jubilee in 1977:", "In addition, the queen wore this tiara for an official portrait in 1992. That photograph would subsequently be used on the face of the £10 and £20 banknotes from St. Helena:", "Given that Queen Elizabeth has worn this tiara in the company of a variety of world leaders and for a number of different special occasions, those claiming that she chose to wear it in June 2019 specifically as a slight against President Trump appear to be revealing more about their own political beliefs than the queen's.", "Camponeschi, Claudia.   \"Queen Elizabeth II Burmese Ruby Tiara.\"\r\n    High Jewellery Dream.   26 July 2018.", "The Court Jeweler.   \"The Burmese Ruby Tiara.\"\r\n    22 April 2017.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]