["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "USA Today columnist Kirsten Powers accused Sen. Rand Paul, R-Ky., of denying that he proposed cutting aid to Israel.", "Sen. Rand Paul, R-Ky., has acknowledged that he might need to temper his style during interviews. Paul had several testy encounters in his first week as a presidential candidate. But even the most pleasant demeanor in Washington won’t end the questions about policies he pushed for in the past. Speaking on Fox News Sunday on April 12, columnist and former Democratic operative Kirsten Powers said his views on money for Israel are entirely fair game and she focused on his conversation with NBC’s Savannah Guthrie.", "\"She was asking normal questions, and he actually was lying to her,\" Powers said. \"He's put forward a bill basically saying, I'm going to zero out foreign aid and specifically spoke about Israel, and he's acting all self righteous that he's being asked about it.\"", "In this fact-check, we look at what Paul said during that NBC interview, and whether Powers is correct in saying Paul denied having a bill that would eliminate foreign aid and directly mentioned Israel.", "The interview", "Paul’s session with Guthrie got contentious when she asked him about his policy shifts, especially on Israel.", "Guthrie: \"You have had views on foreign policy that are unorthodox, but you seem to have changed. You said Iran was not a threat and now you say it is. You once proposed ending aid to Israel, and now you support it, at least for the time being. And once offered to drastically cut --\"", "Paul: \"Well, before we go, before we go --\"", "Guthrie: \"Wait, wait. Once wanted to drastically cut defense spending --\"", "Paul: \"Before we go into a litany of --\"", "Guthrie:  \"-- and now you want to increase it 16 percent. So I just wondered if you mellowed out?\"", "Paul: \"Why don’t we let me explain instead of talking over me, okay?\"", "When things settled down, Paul gave this response on Israel.", "Paul: \"My opinion has been we shouldn't borrow money from China to send it to any country. Pakistan, Israel or any other country. But I also realized that things will have to be done gradually and if we are going to try to eliminate or reduce foreign aid, why don’t we start with the countries that hate us or burn our flag. And the one thing that is true is that Israel doesn’t burn our flag. So I haven’t proposed removing aid from Israel, but I still agree --\"", "Guthrie: \"But you once did.\"", "Paul: \"-- with the original precept. Let me answer the question. I agree with my original statement from years ago that ultimately, all nations should be free of foreign aid.\"", "A tale of two budget proposals", "We dug into the question of Paul and money for Israel about a year ago and we can see the two-month period in 2011 when Paul changed his stance.", "In the Internet Archive’s Wayback Machine, we found a 65-page budget proposal released by Paul’s office in March 2011. Citing a pattern of squandered and unwise spending on foreign governments, the report offered a straightforward bottom line on foreign aid: \"Eliminate all international assistance.\"", "The section on Israel says this:", "\"While this budget proposal does eliminate foreign aid to Israel, it is not meant to hurt, negate, or single out one of America’s most important allies. This proposal eliminates all foreign aid to all countries. Israel’s ability to conduct foreign policy, regain economic dominance, and support itself without the heavy hand of U.S. interests and policies, will only strengthen the Israeli community. The elimination of all foreign aid, including provisions to Israel, is not necessarily a new idea. In 1996, during an address before the U.S. Congress, Israeli Prime Minister Benjamin Netanyahu declared that his nation would eventually wean itself from dependence on U.S. foreign aid. Prominent Israeli politicians and economists alike have called for the end of foreign aid. Among them is economist Amon Gafney, who served as governor of the Bank of Israel from 1970 to 1981. He pointed out that foreign aid has caused Israel to suffer from ―Dutch Disease, a situation in which a generous gift brings short-term benefits but impairs a country’s long-term competitiveness.\"", "This was not some trial balloon. Paul put his plan into writing within weeks of arriving at the Senate in January 2011, and he defended his position to eliminate aid to Israel in at least four separate interviews: On Jan. 26, 2011, on CNN, Feb. 3, 2011, with ABC, Feb. 8, 2011, on Fox News and in an interview with Slate, published Feb. 18, 2011.", "Paul was well aware that his view was unpopular. He told several interviewers that out of the $500 billion budget reduction he proposed, he was hearing the most complaints about the money for Israel.", "\"The cuts to that one particular country were three-fifths of 1 percent of it,\" he told ABC.", "Later, he said on Fox News, \"I support Israel as our greatest ally in the Middle East, but at the same time, we can't give them money that we don't have.\"", "You won’t find that proposal on Paul’s official website. By May 2011, Paul had a new budget plan, which we also found via the Internet Archive.", "Here are the title pages of both.", "The new proposal scrapped the section on Israel in its entirety. Indeed, Israel isn’t mentioned anywhere in the 65-page document. Also, Paul’s new bottom line for foreign aid wasn’t to cut it to zero. Rather, the proposal said, \"Freeze foreign aid funding at $5 billion.\" Though the report doesn’t say so explicitly, that would have been enough to cover the outlays for Israel.", "That plan was the one that came up for a vote in the Senate where it was rejected 90-7. Paul has since said that he favors continuing aid for Israel.", "The problem with Powers’ statement is that she said Paul had \"put forward a bill\" that cut all aid to Israel. The language there is sloppy. Paul put forward a concurrent resolution which is a way to capture the sense of the senators. Unlike a bill, if passed, such a resolution would never go before the president and would not have the force of law. Also, Paul changed his budget plan before he submitted it as a resolution.", "Powers told PunditFact that she was thinking of Paul’s first proposal and \"used the wrong terminology.\"", "\"I don't know why I said bill when I knew it was a proposed budget plan,\" Powers said.", "Our ruling", "Powers said that Paul denied having a bill that would cut all foreign aid and specifically mentioned Israel. In Paul’s NBC interview, he said he hadn’t proposed removing aid from Israel. Actually, Paul put forward a budget proposal that cut aid to Israel and stood by it for at least three months before quietly dropping the idea.  The concurrent resolution that Paul proposed and that the Senate voted on did not cut aid to Israel.", "Powers is correct that Paul denied his effort to cut aid to Israel but she mischaracterized the form of his proposal.", "We rate the claim Half True.", "Fox News, Fox News Sunday, April 12, 2015", "PolitiFact, Did Rand Paul propose cutting off aid to Israel?, Aug. 7, 2014", "Politico, Rand Paul clashes with Savannah Guthrie over changing views, April 8, 2015", "Rand Paul-Savannah Guthrie interview, YouTube video, April 8, 2015", "Office of Rand Paul, \"Fiscal Year 2012 Budget of the Federal Government,\" March 2011 (via the Wayback Machine)", "Office of Rand Paul, \"Fiscal Year 2012 Budget of the Federal Government,\" May 2011 (via the Wayback Machine)", "Fox News,Interview with Sen. Rand Paul, Feb. 8, 2011, via Nexis", "Email interview, Kirsten Powers, columnist, USA Today, April 14, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]