["About this rating", "Home Depot co-founder Bernie Marcus endorsed Donald Trump for president and contributed financially to Trump's presidential campaigns.", "Bernie Marcus is no longer the CEO or chairman of Home Depot, having retired from those positions in 2002.", "On 1 June 2016, Home Depot co-founder Bernie Marcus published an essay on the web site Real Clear Politics in which he announced that he was endorsing GOP candidate Donald Trump for President of the United States:", "As a backer of former Republican presidential candidates, I now stand in support of Donald J. Trump because the fate of this nation depends upon sending him, and not Hillary Clinton, to the White House.", "I know Donald Trump, but we’re not close friends. However, I believe he will begin on Day One undoing the damage done by President Barack Obama. I stand ready to help him at every turn.", "While Real Clear Politics correctly identified Bernie Marcus as the \"co-founder of Home Depot\" and \"Chairman of the Marcus Foundation,\" many who shared the above-quoted story incorrectly stated that Marcus was the current CEO and President of Home Depot:", "Bernie Marcus was a co-founder of Home Depot home improvement chain, and he did serve as the company's first CEO, as well as its chairman of the board, for 19 years. However, he retired from both those positions in 2002 and is no longer actively involved in running the company.", "Shortly after Bernie Marcus published his essay endorsing Donald Trump, Home Depot replied to a complaint about his announcement on their Facebook page by noting that Marcus had retired from the company several years earlier:", "Marcus stirred similar controversy in mid-2019 when he mentioned in an interview that he planned to support Trump's re-election bid:", "[Marcus] also has been a major political donor. According to OpenSecrets.org, he was a top contributor to Donald Trump during his presidential run. And Marcus told the AJC that he plans to support the president’s re-election bid. While Trump “sucks” at communication, Marcus said, the president deserves praise for boosting U.S. jobs, confronting China on trade and taking action against Iranian and North Korean aggression.", "\"[Trump's] got a businessman’s common sense approach to most things ... Now, do I agree with every move that he makes? No, I don’t. But the truth is he has produced more than anybody else. He has. If we look at this country, I would say that we are better off today than we were eight years ago or six years ago.”", "“I’ll tell you what he has not done well: His communication sucks. I mean he takes on every battle. He’s fighting. He does things he shouldn’t be doing. ... As president of the United States, I’d rather him do things that are meaningful.”", "That revelation prompted another round of calls for boycotts of Home Depot, even though Marcus is no longer actively involved with the chain:", "Posting under the #boycotthomedepot hashtag, Twitter users have criticized Marcus' hefty donations to Trump, with some saying they plan to cut up their Home Depot cards and others throwing in their lot with competitors like Lowe's and Menards.", "Hey @hgtv this is another one of your sponsors & please just go with @Lowes instead of @HomeDepot from now on because you’re my self-care #BoycottHomeDepot #ImpeachTrump https://t.co/jQjCbBcbQs", "— Tara Dublin (@taradublinrocks) July 1, 2019", "Cutting up my card and never shopping there again. #BoycottHomeDepot https://t.co/HqYzWSHPuE", "— LeeAnn Kendall (@leeannkendall) July 1, 2019", "I guess that guy retired in 2002, but from what I've read about how they treat employees & where they spend their lobby money, I think it's better to #BoycottHomeDepot pic.twitter.com/SnYTR9KxZp", "— dalidaisy (@dalidaisy) June 30, 2019", "Kempner, Matt.   \"Atlanta Billionaire Plans to Give Almost All of It Away.\"\r\n    The Atlanta Journal-Constitution.   30 June 2019.", "Cain, Áine et al.   \"Furious Home Depot Shoppers Say They're Boycotting the Store and Cutting Up Their Cards After one of the Home-Improvement Retailer's Founders Said He'd Donate Some of His Fortune to Trump's Reelection Campaign.\"\r\n    Business Insider.   8 July 2019.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]