["The video was shared here in a Facebook post on June 9, 2019, where it has been viewed more than 1,900 times. The two-minute, 20-second video shows what appears to be a large flow of volcanic lava approaching residential areas.", "The misleading post’s caption says: \"A flow of lava from inside the earth in Austria. Maybe Hell is longing for its inhabitants. My brothers and sisters, let us strengthen our faith to the Almighty God.\"", "The same video has been shared in other Facebook posts, for example here, here, and here, with a similar claim.", "The claim is false; the video is actually 2018 footage of lava flow after a volcano eruption in Hawaii in the United States.", "A reverse image search on Google using keyframes from the footage obtained using InVid, a digital verification tool, found similar footage published in this Daily Mail article dated May 7, 2018.", "The report is headlined: \"Incredible footage shows terrifying wall of lava crawling across Hawaii road and consuming a parked car as hundreds of residents are ordered to evacuate.\"", "The report states: \"Stunning timelapse footage has captured the moment a wall of lava slowly advanced across a Hawaii road amid mass eruptions across the island.", "\"Hawaii's Kilauea volcano has already destroyed 35 homes and buildings and forced 1,700 people to leave their residences since it erupted on Thursday, spewing lava and toxic gas from volcanic vents in a small area of Hawaii's Big Island.\"", "The video published in the Daily Mail report is three minutes and three seconds long, and has a watermark that reads: \"WXCHASING via Storyful\" on the top right-hand corner.", "Here is a May 11, 2019, AFP report about the activity of the Kilauea volcano.", "The Facebook page WXChasing posted a longer version of the footage that appears in the misleading video here on May 7, 2018. It has been viewed 29 million times since.", "The post's caption states: “Unfortunately locking the lava in with a gate doesn't work either. More incredible video from today.”", "The video, which is four minutes and 18 seconds long, is geotagged to Leilani Estates, Hawaii, United States.", "Here is the Google Maps link of the location where the video was taken.", "The sequence seen in the misleading video appears from the start of the WXChasing video to the two-minute, 20-second mark.", "Below are screenshot comparisons of the WXChasing video (L) and the video in the misleading Facebook posts (R):", "Austria does not have any volcanoes, according to the data of the Smithsonian Institution’s Global Volcanism Program.", "The program has a database of volcanoes around the world on its website. Austria is not listed in the database.", "A search for Austria does not return any results. The site says: \"Only countries containing volcanoes in the database will be displayed in the dropdown.\"", "Below is a screenshot of the search page:", "This post was updated on June 26, 2019, to add a Google Maps link of the location where the video was taken and more details about the Global Volcanism Program's search page.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]