["An online publication claims there are more than 15 million Nigerians in the diaspora who send home about US$25 billion every year. We fact-checked.", "In December 2020, Nigeria’s central bank unveiled new rules on remittances allowing people getting cash from friends or family abroad to be paid in US dollars.", "This is meant to make more foreign currency available in the country and ease pressure on the naira.", "In January 2021, the news website Prompt explained the rules. But its report added three claims: “With over 15 million Nigerians in the diaspora and an estimated $25 billion in annual remittances, Nigeria is the fifth largest receiver of diaspora remittances in the world.”", "Is this accurate? We checked.", "There are over 15 million Nigerians in the diaspora", "Africa Check has asked Prompt for evidence of its claims. They haven’t responded, but we’ll update this report if they do.", "“The term ‘diasporas’ has no set definition, and its meaning has changed significantly over time,” says the International Organization for Migration, an agency with 173 member countries.", "But it does then define diasporas, as “migrants or descendants of migrants, whose identity and sense of belonging have been shaped by their migration experience and background”.", "Remittances, the IOM says, are “financial or in-kind transfers made by migrants to friends and relatives back in communities of origin”.", "The World Bank says remittances supplement household incomes, improving welfare and reducing poverty.", "The United Nations Department of Economic and Social Affairs’ (Desa) most recent estimate of Nigeria’s diaspora is 1.7 million as of June 2020.", "The estimate appears in Desa’s International Migration 2020 Highlights report, published in January 2021. The report adds that India has the world’s largest diaspora population, of 17.8 million.", "To make the estimates, Desa used population censuses, registers and nationally representative surveys. (Note: For more on how international migration is measured, see here.)", "The estimates also come from empirical data on country of birth or of citizenship reported by countries or areas of destination, Clare Menozzi, a population affairs officer at the department, told Africa Check.", "“The coverage of the empirical data on origin varies,” she said. “For some countries, it is extremely comprehensive, while for others less so. For many countries in Africa, the data tend to be less complete.”", "(Note: Nigeria’s last census was in 2006, when the population commission recorded 140.4 million people. In 2020, the commission estimated the country's population at 206.3 million.)", "Countries in Desa’s sub-Saharan Africa region have a diaspora population of 28.29 million, the report says. South Sudan (2.58 million), Somalia (2.03 million), the Democratic Republic of Congo (1.83 million) and Burkina Faso (1.60 million) join Nigeria in the top five.", "Others have reported the size of Nigeria’s diaspora differently. Citing money transfer service Western Union, in December the Reuters news agency gave the number of Nigerians living abroad as 5 million.", "In 2017, Abike Dabiri-Erewa, head of the Nigerians in Diaspora Commission, gave the number of Nigerians living abroad as 15 million. Two years later she was reported saying it was 20 million.", "But no source was given for either of these estimates. We have asked the commission for the evidence behind these figures.", "We asked Desa about possible reasons for the discrepancy in figures we were seeing.", "It could be due to differences in definition, Menozzi said. Desa’s diaspora estimates refer “to persons who are considered international migrants from a statistical perspective, namely persons who are foreign-born or foreign citizens”.", "Children of migrants born in countries or areas of destination are not included in this definition.", "“I am wondering, given the size of the diaspora that you are citing, if it is based on a broader definition which often includes persons of a certain ancestry or descent, such as children and grandchildren,” she said.", "In a 2019 paper, the US census bureau also says different definitions have a significant implication on assessing the size of diasporas.", "As we do not have clarity on what Prompt counted, we rate its claim of 15 million Nigerians in the diaspora as unproven.", "Nigerians in the diaspora send back an estimated $25 billion in annual remittances", "The World Bank estimates that Nigeria’s annual remittances in 2020 were  US$21 billion in 2020, down from $23.8 billion in 2019.", "To make its estimate, the bank used its own data and data from the International Monetary Fund’s Balance of Payments Statistics database, central banks and national statistical agencies.", "Nigeria’s central bank data, which is based on transfers to the public from the country’s formal banking system, put direct remittances in 2019 at $19.2 billion. The bank is yet to make 2020 remittance data available.", "But experts told Africa Check that official data on diaspora remittances was incomplete.", "“The data collected by the central bank are of funds sent through the banking system,” said Akinola Owosekun, a professor of economics at Bowen University in Iwo, southwest Nigeria.", "“Nigerians abroad send money to their relatives and friends in Nigeria through some means without using the banks. There is no way to measure the number of dollars that come into this country in cash undeclared.”", "The country’s different exchange rate regimes also encourage informal channels. While remittances benefit the economy, “unaccounted remittances may have an extra impact”, said Philip Alege of the department of economics at Covenant University in Ota, southwest Nigeria.", "The World Bank and the International Monetary Fund say remittances sent through informal channels could be 50% higher than those paid using official systems.", "Nigeria is the fifth largest receiver of diaspora remittances in the world", "A migration brief published by the World Bank and the Global Knowledge Partnership on Migration and Development lists the top five largest recipients of diaspora remittance among low and medium-income countries in 2020.", "India tops the chart with $76 billion, followed by China ($60 billion), Mexico ($41 billion), the Philippines ($33 billion), and Egypt ($24 billion). The top five were the same in 2019.", "Nigeria was seventh in 2020 with $21 billion, after Pakistan ($24 billion). In 2019 it was sixth, with an estimated $23.5 billion in annual remittances.", "When remittances are considered as a share of a country’s gross domestic product, Nigeria is not in the top 10. Tonga tops the list, followed by Haiti, Lebanon and South Sudan.", "But without a definition of the diaspora, and with the challenges of quantifying unofficial payment channels, we also rate this claim as unproven.", "Please complete this form to receive the HTML sharing code.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "For democracy to function, public figures need to be held to account for what they say. The claims they make need to be checked, openly and impartially. Africa Check is an independent, non-partisan organisation which assesses claims made in the public arena using journalistic skills and evidence drawn from the latest online tools, readers, public sources and experts, sorting fact from fiction and publishing the results.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "© 2023 - Africa Check - All rights reserved.", "We will never charge you for verified, reliable information. Help us keep it that way by supporting our work.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "Support independent fact-checking in Africa."]