["A false story of two Muslims teachers fired in Canada’s francophone province of Quebec for refusing to remove their headscarves has been shared throughout Canadian social media since September 10, with more than 2,300 shares in the past two days. Two versions of the story were published on two different websites.", "One article appeared in the Daily Sabah, an online, pro-government media based in Turkey that often focuses on Islam in the West. The other article was published by the Cultural Action Party of Canada, a Canadian online media that regularly posts articles criticizing immigration and Islam.", "This led to the propagation of the same false news by both pro-Islam and anti-Islam Facebook pages, such as “Canadians Against Islamophobia” and “Quran Is The Best Cure For he Soul” on one side, or “Pegida” and “III%,” two anti-immigation groups, on the other.", "The screenshot below shows social media monitoring tool CrowdTangle applied to the Daily Sabah article, and many of the pages that shared the article.", "However, the story is false. Two teachers were not recently fired in Montreal after refusing to remove their headscarf for work, AFP Fact Check confirmed after contacting Canada’s second largest city’s school boards.", "The story seems to conflate two real stories that resulted from Quebec’s recent passing of Bill 21, a secularism law that bans apparent religious signs for all public servants in a position of authority, including judges, bus drivers and teachers.", "The bill caused controversy in Canada’s second most populous province and in the rest of the country, in part because it contravenes Canada’s Charter of Rights and Freedoms, but was forced through Quebec’s legislative body using the notwithstanding clause. The notwithstanding clause is section 33 of Canada’s Constitution. It allows federal, provincial and territorial governments to bypass the constitution on certain matters.", "On September 9, several provincial media recounted two cases of Muslim women whose jobs were threatened by the law passed on June 16, 2019. In one case, a woman was told to remove her headscarf or face termination in Montreal’s Commission Scolaire de Montréal (CSDM).", "Alain Perron, spokesman for the CSDM, did not wish to comment on an individual employee’s file, but said an article in local French-language newspaper Le Devoir was accurate.", "Yves Parenteau, press officer for the Alliance des Professeures et Professeurs de Montréal, the CSDM union, also confirmed the story. He added, “This is the only case (within the CSDM) that was brought to our attention.”", "The second case involves two Muslim women who applied for teaching jobs at the Commission Scolaire de la Pointe-de-l’Île (CSPI), in Montreal’s east end. They were turned down after they stated that they would not remove their hijabs to teach.", "Valérie Biron, communications officer for CSPI, told AFP in an email, “Two people who applied to our school board were wearing apparent religious signs. We informed them of the law, and they refused to remove the religious signs. Therefore, we did not hire them.”", "Michael Cohen, an administrator for English Montreal, an English-language school board, told AFP that his school board has not been placed in a situation where this was an issue, “but it will be very sad when we do.”", "The two articles cite Catherine Beauvais St-Pierre, president of the Alliance des professeures et professeurs de Montréal, stating that St-Pierre had said the two teachers who were fired were first “told to remove their headscarves or face dismissal.”", "St-Pierre did say something akin to the quote attributed to her when talking on a Quebec radio, but in reference to the one professor at her school board who was told to remove her hijab, but was not fired. “I was indeed wrongly cited,” St-Pierre told AFP in an email.", "Bill 21 was amended to include a “grandfather clause” which allows all employees who held their jobs before March 28, 2019, the date of the bill’s first proposal at Quebec’s legislative assembly, to retain them regardless of their choice to wear religious symbols.", "In the case of teachers however, this does not apply to those who were already hired and wish to move to a different school board, which is considered to be a different employer.", "According to Parenteau of the Alliance des Professeures et Professeurs de Montréal, the woman who was told to remove her headscarf or be terminated was already working as a teacher before March 28, but changed school boards after that date, which made the clause void.", "In the case of the two women who were not hired, Bryan St-Louis, spokesman for the Quebec ministry of education, told AFP in an email that “the teachers could not be hired because the Law forbids religious signs for teachers. Since they were not already employed, they were not protected by the acquired rights.”", "“This law has double standards, Parenteau deplored, those with seniority have rights that recent recruits do not, and if you work in a private school rather than a public one, you have other rights,” he said in reference to the fact that Bill 21 does not apply to teachers in private schools.", "When asked to comment on Quebec’s Bill 21 while at a press conference on the federal elections campaign trail on September 12 in Victoria, British Columbia, Prime Minister Justin Trudeau said that he does not believe “any state should legislate on what people can or cannot wear,” while admitting that “it would be counterproductive for the federal government to engage itself into this debate in a cavalier manner.”", "Although a case of two Muslim teachers fired for refusing to remove their hijab could legally happen in the future in Quebec, the story currently circulating is not true.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]