["A photograph of a man, woman and infant hanging dead from a tree has been widely shared on social media. The accompanying claim suggests that the family committed suicide out of hunger during the lockdown imposed to tackle coronavirus. India has been under complete lockdown, barring essential services, since March 25. This has now been extended till May 3. The lockdown has stranded migrant workers across the country without a means to get home or regular meals.", "The image has been shared with the claim that the family was travelling to Gujarat’s Surat on foot. They committed suicide out of starvation, it adds. Below is a tweet by one Alok shared with the caption, “सुरत से आ रहें थे पैदल भुख बरदाश नहीं हुआ तो सूसाईट कर लिए इसकी जिम्मेदार भारत सरकार ….प्रधानमंत्री के राहत कोष , पैसे दे रहे हैं सब कुछ कर रहे हैं क्या राहत लोगों तक पहुंच रही है और अगर पहुंच रही है तो लोग आत्महत्या करने पर मजबूर क्यों हैं.”", "From the Facebook account मौर्य वंश सम्राट अशोक, the post has received 1,000 shares.", "Alt News has received multiple requests on its official mobile application to fact-check the image.", "A reverse image search revealed that the incident is unrelated to coronavirus and dates back to June 2018. Lallantop had reported on the incident when the photograph was viral with the false claim that a farmer had hung himself with his wife and children due to loan distress. In reality, the man committed suicide along with his wife and child because he couldn’t cope with the taunts of his family members. The incident took place in Maharashtra’s Vardha district. According to a policeman from Ashti police station, 37-year-old Anil Narayan Wankhede used to work as an electrician in a company in Madhya Pradesh. He lost his job as the company shut down, forcing the family to return to Anil’s parents’ house in Vardha’s Arvi village. They had nad been living with Anil’s parents and sister for more than two months amid constant taunts for his job loss. Neighbours also complained that they could hear the family getting into frequent brawls. One day, his father threw him out of the house with his wife and child. Anil did not want to shift to his in-law’s house and going back to his parents’ house was not a choice. He took his wife and child to a field, made them drink pesticide, then hung himself and them from a tree.", "The incident was also reported by Marathi media outlets Ain News and Dainik Bhaskar’s Divya Marathi.", "Therefore, a photograph from 2018 was falsely shared as that of a family which committed suicide in Surat due to hunger during coronavirus lockdown.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]