["The photo of Shah, who is chief minister of Pakistan’s Sindh province, was shared more than 4,300 times after being published on Facebook here on May 3, 2020.", "The image features Urdu-language text that translates to English as: “The Chief Minister of Sindh who locked the mosques and got the worshippers beaten with batons after throwing Iftar parties giving a message to the people that corona is his brother.”", "Pakistan has been under various COVID-19 lockdown measures since March 2020. Ahead of the ongoing holy month of Ramadan, authorities did permit mosques to hold prayers and evening congregations, AFP reported.", "The same photo was also shared alongside a similar claim here, here, here and here on Facebook and here and here on Twitter.", "The claim is false; the photo shows an event in 2018.", "Keyword searches also found another photo from the same party published in May 2018.", "Mansoor Khokhar, a former journalist who attended the party, published a photo with Shah on Facebook here on May 23, 2018.", "Below is a screenshot comparison of the photo in the misleading posts (L) and the photo on Khokhar's Facebook page (R) with Shah circled in red by AFP:", "The chief minister’s office also marked the iftar dinner on Twitter here on May 23, 2018.", "Karachi: (May 23rd, 2018) Sindh Chief Minister Syed Murad Ali Shah talks to media after an Iftar party he hosted for members of Sindh Assembly and journalists at CM House. pic.twitter.com/p53f3JoutL", "A Sindh government spokesman, Murtaza Wahab, said that the photo is from 2018 and condemned the posts as political misinformation against Shah and the Pakistan Peoples Party (PPP), the governing political party in Sindh.", "“There is a defamatory campaign going on in social media showing photos of an Iftaar Party attended by CM Sindh & other PPP leaders. Please note that no such event has taken place this year since there is a ban on social gatherings & the photos being circulated are of May 2018,” Wahab said on Twitter on May 3.", "There is a defamatory campaign going on in social media showing photos of an Iftaar Party attended by CM Sindh & other PPP leaders. Please note that no such event has taken place this year since there is a ban on social gatherings & the photos being circulated are of May 2018", "Rasheed Channa, a media consultant in the chief minister’s office, also refuted the claim.", "“These pictures were taken on May 23, 2018 at an Iftar party Sindh Chief Minister Syed Murad Shah had hosted at CM House. Some people have made these pictures viral again with the wrong caption of the Iftar party during the on-going Ramzan. As a matter of fact no such Iftar has been hosted at CM House,” Channa told AFP by phone on May 4, 2020.", "Sindh officials had announced on April 24 that no iftar celebration would be held by the provincial government, according to The News, a Pakistan-based English language newspaper.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]