["The two-minute 19-second video was published in this Twitter post on January 8, 2020. It has been viewed more than 136,000 times.", "The post’s Chinese-language caption translates to English as: \"Breaking: Iran acting foolish again, suddenly launched rocket projectiles at the American base in Iraq! But were basically intercepted by antiaircraft fire, spectacular! Astonishing! Awesome, the United States!\"", "Below is a screenshot of the misleading post:", "The video was also shared with a similar claim here on Facebook; and here and here on YouTube.", "On January 8, 2020, Iran did fire missiles at Iraqi military bases housing US forces in retaliation for the US strike that killed Iranian general Qasem Soleimani the previous week, AFP reported here.", "However, the claim made about the video is false.", "A reverse image search on Google and keyword search found the same footage from ARMA 3 was published in this longer YouTube video on June 24, 2019.", "The two-minute 53-second video has been embedded below.", "The video’s description translates to English as: “Phalanx Tomahawk The moment of a Cius CIWS Phalanx cruise missile being shot down by a BGM-109 Tomahawk ARMA3 cruise missile”.", "At the end of the video, Japanese text appears on the screen which translates to English as: “This video is a fiction. The characters, names, events are fictitious and have nothing to do with reality.”", "Below is a screenshot comparison of the video in the misleading posts (L) and the YouTube video (R):", "The same video was also debunked here by a BBC journalist on January 9, 2020.", "The same video has also circulated in Portuguese and Spanish social media posts with other misleading claims, as debunked by AFP’s Portuguese fact check team here and Spanish fact check team here.", "Bohemia Interactive, the company that developed ARMA 3, confirmed to AFP’s Portuguese team that the video was from the game.", "In an email, the company stated: “We are sure that the YouTube video is from ARMA 3, made by one of our players. It should be noted that our ARMA games can be modified (adapted, NDLR) by their users and that people can create their own scenarios with the game editor. As such, what you are seeing in this video is not the ARMA 3 experience pattern, it seems to be a modified version of the game and a custom scenario made by players.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]