["By Angelo Fichera", "Posted on June 20, 2019", "A viral photo shows a massive crowd at an iconic 1985 concert in London, not at a rally for President Trump in Philadelphia, as a meme claims.", "A meme posted repeatedly on Facebook uses an image that has been edited to transform a scene from a well-known concert in London into a supposed rally for President Donald Trump.", "“No, this is not Live Aid,” the meme claims. “This is a Trump rally in downtown Philly yesterday. Why isn’t the media showing this???”", "The “media” likely isn’t showing it because the photo is, in fact, from the 1985 Live Aid concert in London’s Wembley Stadium. (There was a simultaneous Live Aid show held in Philadelphia.)", "The photo in question has been doctored to display Trump campaign signage over that for the concert. The unadulterated image is available through the photography website Shutterstock; it was also shared in 2014 on a Facebook page dedicated to Live Aid. A similar image from the same vantage point of the concert can be seen on Getty Images.", "The iconic show drew an estimated 72,000 to the London venue on July 13, 1985, for a lineup that included Queen, U2, Elton John and David Bowie. Some 100,000 people also attended the show at Philadelphia’s since-demolished JFK Stadium. The dual-venue event raised millions to assist with the famine in Ethiopia.", "This isn’t the first time that images of crowds have been misused in this way. We recently debunked a false claim that an image showed another Trump rally in Pennsylvania. That picture was actually from Woodstock.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "“1985: Live Aid makes millions for Africa.” BBC. 13 Jul 2019.", "Hale Spencer, Saranac. “Photo Shows Woodstock, Not a Trump Rally.” FactCheck.org. 24 May 2019.", "“Live Aid concert at Wembey.” Getty Images. Accessed 17 Jun 2019.", "“Live Aid Concert at Wembley Stadium, London, Britain – 1985.” Rex Features. Accessed 17 May 2019.", "Thomas, Holly. “33 years later, Queen’s Live Aid performance is still pure magic.” CNN. Nov 2018.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]