["About this rating", "Barrett was a member of a three-judge panel that overturned a lower court's damages ruling in a case involving a jail guard who raped a female inmate.", "The panel on which Barrett sat did not reverse \"the lower court's decision to award money\" to the victim; rather, it held that that the guard alone, and not his employer (the county), was liable for paying damages to the victim.", "In June 2017, a federal jury awarded $6.7 million in damages to Shonda Martin, a woman who testified that she had been raped multiple times by guard Xavier Thicklen while she was being held in the Milwaukee County Jail in 2013:", "Martin arrived at the jail in February 2013 at the age of 19. She soon learned she was pregnant. She testified she could not control her activities or movements in jail; the guards did. Thicklen raped Martin in jail. He had sexual contact with her three times while she was pregnant, including vaginal intercourse, and two times after delivery.", "[Thicklen] told her he was in gray and she was in blue, and his co-workers would believe him and not her. She understood him to mean \"he's in authority and ... he has power over me.\" She understood him to mean his co-workers would believe anything he said; he could falsely say she tried to grab or hit him, or tried to take his taser or gun, and she would be punished. She testified, \"I believed everything he said.... I knew that his authority over me would trump anything that I said.\"", "Martin testified that during each sexual assault, Thicklen was in uniform, armed, and on duty working for County. All five assaults occurred in jail. Every time, he had to use his keys, power, and authority. He told her he would be fired if people found out. He took steps to hide the assaults. For example, he assaulted her off camera. Finally, on December 3, 2013, she reported the sexual assaults when she was concerned he possibly gave her a disease which spread to her child. An investigation began that day. She was transferred the next day. Thicklen was dismissed and prosecuted.", "This case (Martin v. Milwaukee County) came to widespread public attention over three years later, in October 2020, after President Donald Trump nominated U.S. Court of Appeals Judge Amy Coney Barrett to fill a vacancy on the U.S. Supreme Court. Barrett had been involved in an appeal of the case two years earlier, during which, a popular meme held, she had \"reversed the lower court's decision to award\" money to the victim:", "As is often the case, the meme presented a simplified version of facts that could be considered misleading.", "Barrett was part of a three-judge Seventh Circuit Court of Appeals panel that heard an appeal from Milwaukee County. That panel did not \"overturn\" the damages award to Martin; rather, it ruled that because Thicklen's actions in sexually assaulting Martin were outside the scope of his employment, Thicklen alone — and not the county — was liable for paying those damages:", "Here, we may take it as granted that the sexual assaults occurred during the authorized time and space limits of Thicklen's employment (although there may be some question about whether Thicklen was actually authorized to be in the particular locations of the sexual assaults at the times he perpetrated them).", "But even when viewing the evidence in the light most favorable to Martin and the verdict, we hold no reasonable jury could find the sexual assaults were in the scope of his employment ...", "Uncontested evidence at trial demonstrated County thoroughly trained Thicklen not to have sexual contact with inmates. County expressly forbade him from having sexual contact with an inmate under any circumstances, regardless of apparent consent. County's training warned him that such sexual contact violates state law and the Sheriff's Office's mission.", "Martin argues [Thicklen] might have intended to exert power, dominion, and control over her by sexually assaulting her. But that inference, while reasonable, still does not bring the sexual assaults within the scope because under that theory he would still have pursued purely personal goals. Any power, dominion, and control asserted or achieved through these sexual assaults would \"belong to\" and \"benefit\" only him, not County, on these facts. Olson reminds us that an employee's being \"at least partially actuated by a purpose to serve the employer\" is a sine qua non of scope.", "Martin presented no evidence at trial that the sexual abuse was similar in kind to work Thicklen was employed to perform. This case is distinguishable from cases involving excessive force by police officers. Some force, even deadly force, is sometimes permissible for police officers. But the rapes in this case were not part of a spectrum of conduct that shades into permissible zones. Inmate rape by a guard usually involves no gray areas.", "Even though all of the judgments against Thicklen (who was not a party to the appeal) were allowed to stand, in a practical sense the ruling meant the victim would likely collect little in damages, since Thicklen was not required to be indemnified by the county and likely does not possess assets worth anything close to $6.7 million — a fact the panel recognized:", "As an aside, we note our conclusion is consistent with the Wisconsin Supreme Court's understanding of the public policy behind [the state's indemnification statute]. Wisconsin courts have determined that the purpose of the statutory indemnification is to enable public employees to perform their duties without fear of having to pay out of pocket for such performance. Indemnification here would not further this purpose. We have sympathy for Martin, who loses perhaps her best chance to collect the judgment. But [the law] does not make public employers absolute insurers against all wrongs.", "Critics of Barrett's have noted that in a similar case heard by the Indiana Supreme Court in 2018 (Cox v. Evansville Police Department), involving sexual assaults committed by police officers, that court arrived at the opposite conclusion:", "Two on-duty police officers — one in Fort Wayne and one in Evansville — sexually assaulted women, who then brought civil actions against the officers’ city employers. We address two theories of employer liability: (1) the scope-of-employment rule, traditionally called respondeat superior, and (2) the rule’s common-carrier exception, which imposes a more stringent standard of care on certain enterprises. We hold that the cities may be liable under the scope-of-employment rule and that the exception does not apply.", "Resounding in our decision today is the maxim that great power comes with great responsibility. Cities are endowed with the coercive power of the state, and they confer that power on their police officers. Those officers, in turn, wield it to carry out employment duties — duties that may include physically controlling and forcibly touching others without consent. For this reason, when an officer carrying out employment duties physically controls someone and then abuses employer-conferred power to sexually assault that person, the city does not, under respondeat superior, escape liability as a matter of law for the sexual assault.", "Investing officers with considerable and intimidating powers comes with an inherent risk of abuse. When that abuse is a tortious act arising naturally or predictably from the police officer’s employment activities, it falls within the scope of employment for which the city is liable. Thus, if an on-duty police officer commits a sexual assault by misusing official authority, the sexual assault is within the scope of employment if the employment context naturally or predictably gave rise to that abuse of official authority.", "Oddly, perhaps, in 2019 another three-judge Seventh Circuit panel (not including Barrett) similarly reversed a lower court's ruling to hold a Wisconsin county responsible for paying damages over the sexual assault of female inmates by a male jailer:", "Darryl Christensen, a former Polk County jailer, was convicted in 2016 of sexually assaulting five female inmates hundreds of times over a three-year period.", "Two of his victims, identified as J.K.J. and M.J.J., sued Christensen and Polk County over the assaults in federal court.", "The complaint claimed the county sheriff’s department was indifferent to the risk of assault because it allowed one male officer with the ability to prevent the entrance of other jailers to supervise female inmates in areas without cameras. The county also deliberately chose not to accept state training materials regarding sexual assault in jails.", "A jury awarded the women $11.5 million in compensatory and punitive damages, of which the county was responsible for paying $4 million. Given that Christensen was sentenced to 30 years in prison for his conduct, this figure is the only part of the award the women will ever possibly receive.", "But in June [2019], a three-judge panel of the Seventh Circuit reversed the ruling against the county, holding that it could not be held accountable for the actions of a “rogue guard” who knew that he was violating jail policy, his training and the law.", "In that case, however, the full court voted to rehear the issue, and in a non-unanimous decision — with Barrett joining the majority — the court vacated the three-judge panel's opinion and upheld the original jury verdict that held both the county and Christensen liable for the latter's abuse of female inmates:", "“Darryl Christensen’s long-term abuse of J.K.J. and M.J.J. more than justified the jury’s verdict against him. And the jury was furnished with sufficient evidence to hold Polk County liable not on the basis of Christensen’s horrific acts but rather the county’s own deliberate choice to stand idly by while the female inmates under its care were exposed to an unmistakable risk that they would be sexually assaulted — a choice that was the moving force behind the harm inflicted on J.K.J. and M.J.J.,” U.S. Circuit Judge Michael Scudder wrote for the full court’s majority.", "Based on the evidence presented at trial, “the jury was entitled to conclude that if Polk County had taken action in response to the glaring risk that its female inmates’ health and safety were in danger, J.K.J. and M.J.J.’s assaults would have stopped sooner, or never happened at all,” Scudder said.", "His opinion was joined by U.S. Circuit Judges Diane Wood, Michael Kanne, Ilana Rovner, David Hamilton, Amy Barrett and Amy St. Eve.", "U.S. Circuit Judge Michael Brennan, who authored the original opinion, wrote a blistering 62-page dissent, and was joined by U.S. Circuit Judges Diane Sykes and William Bauer.", "“Under the majority opinion, a single subordinate employee may secretly override municipal policy and create a new policy under which that public employer is accountable. That is vicarious liability, a collapse into respondeat superior against which the Supreme Court has repeatedly warned for 60 years,” Brennan said.", "Diedrich, John.   \"Woman Describes Rapes by Milwaukee County Jail Guard and Giving Birth While Shackled.\"\r\n    Milwaukee Journal Sentinel.   5 June 2017.", "Diedrich, John.   \"Jury Awards $6.7M to Inmate Raped by Guard in Milwaukee County Jail, Shackled During Childbirth.\"\r\n    Milwaukee Journal Sentinel.   7 June 2017.", "Bailey, Lorraine.   \"Full Seventh Circuit Finds Wisconsin County Liable in Prison Rape Case.\"\r\n    Courthouse News Service.   15 May 2020.", "Bailey, Lorraine.   \"Full Seventh Circuit Hears Debate Over Municipal Liability in Prison Rape.\"\r\n    Courthouse News Service.   5 December 2019.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]