["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A letter from the conservative group Focus on the Family Action makes a multifaceted attack on Sen. Barack Obama in an attempt to portray him as someone who would be \"the most left-wing president in our nation's history.\" The article, written for the organization's Web site and widely circulated via chain e-mail, tries to paint Obama as bad for families, accusing him of everything from trying to further \"the homosexual agenda\" to being soft on the war against terrorists.", "Focus on the Family Action is the lobbying arm of Focus on the Family, an organization founded by evangelical Christian Dr. James Dobson.", "One of the claims in the article, written by Tom Minnery, senior vice president of Focus on the Family Action, states: \"Then there's his support for teaching schoolchildren — in 2nd grade, no less — about homosexual relationships.\"", "This is a reference to a question that was asked in a Democratic debate in New Hampshire in September 2007. During the debate, Allison King of New England Cable News talked about a controversial fairy tale about a prince who marries another prince that was taught to a second-grade class in Massachusetts. The Dutch tale, called\n\nKing and King,\n\nis about a prince whose mother pressures him to find a princess but who ends up falling in love with and marrying a princess' brother.", "Two parents filed a lawsuit, saying they were upset that a book with homosexual themes was taught to their 7-year-olds without alerting them first. The lawsuit was dismissed.", "King asked if the Democratic candidates would be comfortable having the story read to their children as part of their school curriculum.", "The question was first put to Sen. John Edwards, who responded, \"Yes, absolutely.\"", "Edwards went on to say that he wants his children to understand the discrimination that gay and lesbian couples face.", "Asked how he felt about it, Obama responded, \"You know, I feel very similar to John. You know, the fact is my 9-year-old and my 6-year-old I think are already aware that there are same-sex couples. My wife and I have talked about it. One of the things I want to communicate to my children is not to be afraid of people who are different, because there have been times in our history where I was considered different, or Bill Richardson was considered different.", "\"And one of the things I think the next president has to do is to stop fanning people's fears. If we spend all our time feeding the American people fear and conflict and division, then they become fearful and conflicted and divided.", "\"And if we feed them hope and we feed them reason and tolerance, then they will become tolerant and reasonable and hopeful.\"", "Minnery said that means Obama supports teaching about homosexuality in elementary schools.", "\"That's obviously the agenda of that book,\" Minnery said. \"If you assent to teaching that book, you assent to that agenda. It's the same thing. They didn't say, 'I'm no longer speaking as a Democratic candidate.' \"", "Obama's campaign did not respond to questions about the Focus on the Family Action statement. But there's nothing in Obama's stated education platform that speaks to any initiative to require or encourage teaching second-graders about homosexuality.", "In fact, the question in the debate was whether the candidates would be comfortable if that book was taught to their child in school. Obama said he would be okay with it. Focus on the Family's statement is a stretch at best. We rate the statement Barely True.", "Focus on the Family Action,\n\n\"March 2008 Action Update,\"\n\nby Tom Minnery, March 2008", "Fox News,\n\n\"Democratic Candidates Say They're OK With Second-Grade Teacher Reading Gay Prince Fairy Tale,\"\n\nby Catherine Donaldson-Evans, Sept. 27, 2007", "MSNBC.com,\n\nNew Hampshire Democratic Debate transcript,\n\nSept. 26, 2007", "Politico.com,\n\n\"Romney hits Dems on gay issue,\"\n\nby Jonathan Martin, Sept. 27, 2007", "BarackObama.com,\n\nObama's education platform", "CNSNews.com,\n\n\"Candidates Split on Pro-Gay Book for 2nd Graders,\"\n\nby Pete Winn, Nov. 29, 2007", "Catholic Online,\n\n\"Court rules against Parents in Homosexual Indoctrination Case,\"\n\nby Matthew Cullinan Hoffman, Feb. 5, 2008", "Interview with Tom Minnery of Focus on the Family Action, April 10, 2008", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]