["“If you’re wearing a mask, why would you care if I’m not? Your mask works, right?” says a July 6, 2020 Facebook post.", "The same claim appears on Facebook here, here, here and here.", "Face masks -- which many state and local authorities are either requiring or recommending be worn as coronavirus cases spike in the United States -- are a contentious issue. Some Americans object to the inconvenience of using them or view them as an impingement on their personal freedom.", "Mask wearing has also become political, with President Donald Trump long refusing to wear one -- a stance endorsed by his ardent supporters -- until he was finally pictured publicly using a mask on July 11 when visiting the Walter Reed military hospital.", "The US Centers for Disease Control and Prevention (CDC) emphasizes the danger of asymptomatic transmission of the coronavirus and recommends cloth face coverings as a means to reduce this risk.", "“You could spread COVID-19 to others even if you do not feel sick,” it says. “The cloth face cover is meant to protect other people in case you are infected.”", "The CDC says: “Cloth face coverings are most likely to reduce the spread of COVID-19 when they are widely used by people in public settings.”", "AFP Fact Check has debunked more than 550 examples of false or misleading information about the pandemic. A complete list of our fact checks on the topic in English can be found here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]