["About this rating", "Senator Jeff Flake made the remark attributed to him (in paraphrased form) during a town hall meeting in Mesa, Arizona, on 13 April 2017.", "The full context of Senator Flake's remark showed he was aware that solar energy can be stored and was not suggesting solar power technology was useless at night.", "On 13 April 2017, Senator Jeff Flake of Arizona took part in a town hall meeting with some of his constituents that, like several other such events held by U.S. Congress members in the early part of the year, proved to be something of a contentious one for the Republican U.S. senator:", "Sen. Jeff Flake encountered a raucous audience at a town hall meeting in Mesa, Arizona.", "Constituents peppered the Republican lawmaker with questions about President Donald Trump's actions in office, and his broader agenda on climate change, the president's taxes, the Supreme Court and Planned Parenthood.", "Much like other GOP town halls held since Trump assumed the Oval Office, attendees railed against Flake, many of whom accused him of being a rubber stamp for Trump. Flake, like Reps. Jason Chaffetz, Mike Coffman, and Sen. Mitch McConnell before him, attempted to answer the audience's concerns, though most explanations drew shouts and boos from the crowd.", "Though Flake's town hall did not appear to have a large presence of demonstrators as those of some high-profile congress members in recent months, Flake at times struggled to contend with fits of chanting and jeering from the crowd at the Mesa Convention Center.", "Not all of the questions were hostile, and some constituents applauded Flake for sharing his time. The senator extended the meeting by one hour to take more questions, but the mood frequently returned to a bitter note. \"Can you just remind me when you're up for reelection,\" one woman asked. The audience erupted in cheers at the question.", "During that town hall meeting, Senator Flake engaged in a several-minute exchange with a constituent who urged the lawmaker to support efforts to promote alternative energy sources over fossil fuels and address climate change issues. One small portion of that exchange was later incorporated into an image macro that was widely spread online to make it appear as if the senator were ignorant about the basics of solar power:", "Portraying people as fools for proclaiming that wind and solar power technologies don't work when the wind isn't blowing or the sun isn't shining is a common trope (revealing them to be unaware of the basic fact that energy derived from intermittent production sources is typically stored via batteries or other methods to be used during periods of non-production). However, although Senator Flake did make the statement attributed to him (actually expressed by him as \"you can't tell people we're gonna turn off your power at night because the sun isn't shining\"), in this case that trope has been unfairly applied to him, as his comment has been stripped of context that showed it to be not so foolish or unreasonable.", "As video of the town hall event captures, Senator Flake engaged a constituent (who introduced himself as a major in the U.S. Army Reserve and a recent graduate of Arizona State University with a degree in Sustainability) in a fairly extensive conversation about alternative energy sources, with the constituent advocating the promotion of solar power technologies in Arizona, given that the state is blessed with an abundance of sunshine. In response, the senator didn't disdain the idea by expressing the absurd concept that solar energy wouldn't be available at night. Rather, Flake's contention was that battery technology was not yet sufficiently developed to be able to store enough solar-derived energy to provide \"base load power\" to cities during non-daylight hours, and thus the use of solar energy exclusively was not yet feasible — that if we wished to completely eliminate our use of fossil fuels, for the time being solar power would have to be supplemented by other non-carbon energy sources, such as nuclear power.", "This discussion of alternative energy sources begins at the 13:00 mark in the following video, with Senator Flake's now-infamous comment occurring a 18:20 — after more than five minutes of back-and-forth that established the context in which he made it:", "As the constituent interrupted the senator's remarks by interjecting \"battery ... battery\" (contending solar energy can be harvested and stored), Flake responded by saying that \"what we've gotta do is we've gotta have baseload power now ... you can't tell people we're going to turn off your power at night because the sun isn't shining.\"", "Clearly, Senator Flake was aware that solar-derived energy can be stored in batteries for later use, as the point he was disputing with his constituent was the state of the art in battery technology — Flake maintained batteries couldn't currently provide \"base load power\" levels to cities, while the constituent countered by referencing a solar energy station built by Tesla on the Hawaiian island of Kauai:", "Renewable energy supplies are great because they produce power without filling the air with pollution. Yet, once the sun goes down solar panels become pretty useless. But Tesla and Hawaii have a solution that'll use the sun's rays both day and night using Powerpacks built at the Gigafactory.", "The Kapaia project is a combination 13MW SolarCity solar farm and 53MWh Tesla Powerpack station on the island of Kauai. In partnership with the KIUC (Kauai Island Utility Cooperative) the project will store the sun's energy during the day and release it at night. The station (along with Kauai's other renewable resource solutions including wind and biomass) won't completely keep the island from using fossil fuels but it will temper the need.", "In addition to using Tesla's station to battle the island's incredibly high electric bills, it's also part of a long-term Hawaii-state plan to be completely powered by renewable energy sources by 2045. Kauai has its own goal of using 70 percent renewable energy by 2030. With this project the island is getting closer to that goal and can now produce 100 percent of the energy it needs during high usage mid days and low loads via renewables during a brief period of time.", "Whether Senator Flake was right or wrong about the particulars of the current state of solar energy and battery technologies, he did demonstrate a working awareness of the manner in which energy from the sun is collected and stored, and he did not express a belief that dependence on solar energy would necessarily mean residents would have to go without power at night. The video of the town hall event shows that Senator Flake and a constituent disagreed about the current scalability of power gathered from the sun but were not in disagreement about the existence of solar technologies or the availability of sun-harvested energy at night. Nonetheless, the senator's remarks were misleadingly truncated and altered (replacing \"power\" with \"lights\") and shared online in a form that falsely suggested he did not understand how solar power works.", "Nowicki, Dan.   \"Sen. Jeff Flake Weathers Brutal, 2 1/2-Hour Mesa Town Hall.\"\r\n    The Arizona Republic.   13 April 2017.", "Logan, Bryan.   \"Republican Sen. Jeff Flake Gets Slammed in Raucous Town Hall Meeting.\"\r\n    Business Insider.   14 April 2017.", "Baldwin, Roberto.   \"Tesla's New Solar Energy Station Will Power Hawaii at Night.\"\r\nEngadget.   8 March 2017.", "Kim LaCapria is a former writer for Snopes.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]