["About this rating", "The nomination of Judge Amy Coney Barrett by U.S. President Donald Trump to the U.S. Supreme Court on Sept. 26, 2020, sparked political discourse, debate, and a slew of internet memes and rumors arguing both in favor of and against the conservative legislator.", "As the Senate Judiciary Committee confirmation heated up in mid-October, Snopes readers asked us to verify the authenticity of a letter that was reportedly written by more than 80 Notre Dame colleagues of Barrett asking her to \"halt\" the nomination process in advance of the Nov. 3, 2020, presidential election.", "A link to the letter was shared by a number of public figures on Twitter, including journalist Elizabeth Vargas and MSNBC Anchor Katy Tur, as well as others.", "This letter is indeed real.", "The Oct. 10, letter, which was signed by 88 professors at Notre Dame University with disciplines in law, sociology, economics, theater, and political science, among others, expressed concerns over the timing of Barrett's nomination. Barrett is a law school alumna and has taught as a member of the law school's faculty since 2002. Published in Teacher-Scholar-Activist, an online community for American educators to share “local moves that matter in our communities,” the authors went on to say the following:", "We write to you as fellow faculty members at the University of Notre Dame.", "We congratulate you on your nomination to the United States Supreme Court. An appointment to the Court is the crowning achievement of a legal career and speaks to the commitments you have made throughout your life. And while we are not pundits, from what we read your confirmation is all but assured.", "That is why it is vital that you issue a public statement calling for a halt to your nomination process until after the November presidential election.", "The authors cited three reasons for their request.", "The first was that the general election is currently underway between Trump and his Democratic opponent Joe Biden, noting the “rushed nature” of Barrett’s nomination process. Trump’s announcement of Barrett’s nomination less than a week after the death of former Supreme Court Justice Ruth Bader Ginsburg was an “exercise in raw power politics” that “may effectively deprive the American people of voice in selecting the next Supreme Court Justice.”", "Secondly, the authors highlighted that Ginsburg’s \"dying wish was that her seat on the court remain open until a new president was installed\" — a request she made in the days preceding her death in which she said that her \"most fervent wish is that I will not be replaced until a new president is installed.\"", "Finally, the professors wrote that the nomination comes at a highly politicized era in American politics that includes violence in the streets. Barrett’s confirmation would \"inflame our civic wounds, undermine confidence in the court, and deepen the divide among ordinary citizens.\" Though the authors do not explicitly go into detail describing this “violence,” the 2020 election season coincides with months of civil unrest and nationwide protests following the death of George Floyd, a Black man who died in Minnesota while being held in police custody, and rising concerns over white supremacy dividing the nation.", "Supreme Court justices are nominated by the president and are then confirmed by the U.S. Senate Judiciary Committee through a sometimes lengthy and contentious nomination process. The U.S. Constitution does not specify any qualifications for a justice other than that the candidate must have been trained in law. Once confirmed, a justice will serve until death, as was the case with Ginsburg, who died on Sept. 18, 2020, after serving 27 years on the High Court.", "Justices have the potential to interpret laws in the country at the highest degree, which some argue may be influenced by their political affiliations, particularly on the heels of the 2020 general election.", "In her legislative career, Barrett has upheld high-profile court decisions during her time as a circuit judge on the U.S. Court of Appeals for the 7th Circuit, which resides over Illinois, Indiana, and Wisconsin, that some publications contend are controversial and may hinder her ability to be impartial, pushing “the Supreme Court to the right.”", "Others have argued that her religious ties to a conservative Christian group called People of Praise suggest that she may be swayed in some of her court opinions — particularly those involving access to abortion and women’s rights. Democratic members of the Senate committee argued that the hearings should have been postponed due to the coronavirus pandemic and growing concerns over infection rates in the Republican party, particularly within the president’s cabinet. Republican members, on the other hand, highlighted Barrett’s credentials and intellect.", "In a Twitter thread, White House Press Secretary Kayleigh McEnany countered the Note Dame letter by sharing letters written by \"elected-officials, colleagues, clerks, students and countless others inspired by her work and character.\"", "Oct. 15 marked the fourth and final day of hearings. Members of the Senate Judiciary Committee voted to confirm Barrett’s confirmation and the full Senate voted on Oct. 26 to confirm the new justice to the Supreme Court.", "Williams, Jordan.   \"Notre Dame Faculty in Open Letter Ask Barrett to ‘Halt’ Nomination Process.\"\r\n    The Hill.   13 October 2020.", "Jacobs, Anna.   \"The Amy Coney Barrett Hearings Were Political Theatre.\"\r\n    Al Jazeera.   18 October 2020.", "Naylor, Brian.   \"Amy Coney Barrett’s Supreme Court Confirmation Hearing.\"\r\n    NPR.   15 October 2020.", "\"Internet Pokes Fun at Unflappable Amy Coney Barrett’s Blank Piece of Paper with Memes.\"\r\n    USA Today Sun.   14 October 2020.", "Liptak, Adam.   \"Barrett’s Record: A Conservative Who Would Push the Supreme Court to the Right.\"\r\n    The New York Times .   15 October 2020.", "\"Republicans Tout Credentials; Dems Try Distracting from Judge Barrett’s Qualifications, Temperament.\"\r\n    Committee on the Judiciary.   12 October 2020.", "\"An Open Letter to Judge Amy Coney Barrett From Your Notre Dame Colleagues.\"\r\n    Teacher-Scholar-Activist.   13 October 2020. &nbsp", "\"Barrett Confirmed as Supreme Court Justice in Partisan Vote.\"\r\n      Associated Press.   26 Oct 2020.", "Update [Oct. 27, 2020]: This article was updated to reflect the Senate vote confirming Barrett as the newest justice to join the Supreme Court.", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]