["Rep. Alexandria Ocasio-Cortez, D-N.Y., addresses a Road to the Green New Deal Tour event at Howard University in Washington, May 13, 2019. (AP)", "• The Green New Deal is a nonbinding resolution that cannot become law in its current form.", "• The resolution does not call for most homes to be torn down. It aims to upgrade existing buildings and build new buildings to improve energy and water efficiency.", "• Much of the confusion and misinformation about the resolution stemmed from a botched rollout by its sponsors and relentless attacks from opponents.", "When introduced in early 2019, the Green New Deal resolution immediately sparked conversation and intense criticism, some of it stemming from mistakes made by its sponsor during the rollout.", "An FAQ distributed to the media by staff for Rep. Alexandria Ocasio-Cortez, D-N.Y., one of the Green New Deal sponsors, included language and policies not found in the resolution. The original version of the FAQ, which was quickly retracted, included a goal that continues to attract attention: \"Upgrade or replace every building in U.S. for state-of-art energy efficiency\" over a 10-year-period.", "Close to two years later, social media users continue to refer to that now-retracted sentence about replacing buildings. One Instagram post says, \"The Green New Deal would require that 99% of homes in the country be torn down and rebuilt more ‘energy efficient’ over a ten year period.\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The original FAQ distributed by Ocasio-Cortez’s staff included references to \"farting cows\" contributing to greenhouse gas emissions and the need to guarantee economic security for those \"unwilling to work,\" which were not included in the resolution.  According to the Washington Post, more than a dozen media outlets reported on policies that were listed in the retracted FAQ but not included in the legislation..", "Just this month, President Trump falsely claimed that as part of the Green New Deal, \"They literally want to take buildings down and rebuild them with tiny little windows,\" according to The Hill.", "The final version of Ocasio-Cortez’s FAQ removed the language about \"upgrading or replacing every building\" and instead said one of the goals is, \"upgrading virtually every home and building for energy efficiency.\" That could be accomplished by replacing items such as windows, doors and insulation, as well as electricity and plumbing systems, according to Curbed. The plan would be for the federal government to provide incentives for homeowners to make those improvements.", "The think tank that is helping to develop the Green New Deal acknowledges that making those types of changes to some homes, particularly older ones, could expose bigger structural or safety problems, according to Fast Company. The think tank says it is studying those issues and policies that could address them.", "The Green New Deal is a nonbinding resolution that cannot become law in its current form.", "An Instagram post says, \"The Green New Deal would require that 99% of homes in the country be torn down and rebuilt more ‘energy efficient’ over a ten year period.\"", "An FAQ about the Green New Deal that was later retracted included a goal of upgrading or replacing every building in the U.S. for energy efficiency within 10 years. It did not mention tearing down 99% of buildings.", "The updated version of the FAQ mentions only upgrading buildings for efficiency, which can include replacing elements of the home, such as windows and electrical systems.", "We rate this claim False.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more.", "Curbed, \"A green new home,\" Sept. 25, 2019", "FactCheck.org, \"The facts on the ‘Green New Deal,’\" Feb. 15, 2019", "Fast Company, \"The Green New Deal could change the way America builds — here’s how,\" June 24, 2019", "NPR, Green New Deal FAQ, original document, Feb. 7, 2019", "Rep. Alexandria Ocasio-Cortez, Green New Deal FAQ, Feb. 5, 2019", "U.S. House of Representatives, \"Resolution, recognizing the duty of the Federal Government to create a Green New Deal,\" accessed Oct. 30, 2020", "Washington Post, \"Ocasio-Cortez retracts erroneous information about Green New Deal backed by 2020 Democratic candidates,\" Feb. 12, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]