["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Democractic presidential candidate Bernie Sanders was asked to discuss foreign policy Aug. 30, 2015, on ABC's \"This Week.\" (Screengrab)", "Democratic presidential candidate Bernie Sanders has so far centered his campaign around domestic issues such as income inequality, campaign finance reform and college affordability. In a Sunday interview on ABC’s This Week, however, host Martha Raddatz took the opportunity to ask the Vermont senator about an issue that isn’t even included on his campaign website -- foreign policy.", "Raddatz asked Sanders to explain his vote against the 1991 Gulf war and his opposition to increased military action in Syria and Iraq, compared to his support for military action in Afghanistan after Sept. 11, 2011.", "Sanders said he thought the United States could have forced Saddam Hussein out of Kuwait without invading, and that military action should be \"the last resort, not the first resort.\"", "\"The United States cannot do it alone,\" Sanders added. \"In the Middle East, Saudi Arabia has the third-largest military budget in the entire world. They're going to have to get in and take on ISIS as well as other countries in that region. The United States should be supportive. We should be working with other countries. But the United States cannot always be the only country involved in these wars.\"", "We wondered about Sanders’ claim that Saudi Arabia, with a population roughly the size of Texas, has the \"third-largest military budget in the entire world.\"", "Sanders’ campaign pointed us to the latest statistics from the International Institute for Strategic Studies (IISS), widely cited as an authoritative source for international security statistics. We looked at IISS figures for a separate defense-related fact-check last year.", "According to estimates from the IISS, Saudi Arabia did have the world’s third-largest military budget in 2014, at around $80.8 billion. Its budget was smaller than only those of China and the United States.", "Another reputable group, the Stockholm International Peace Research Institute (SIPRI), catalogues the security expenditures of 171 countries every year.", "On that list, Saudi Arabia ranked fourth in 2014, behind the United States, China and Russia.", "Why the difference? SIPRI estimates that Russia spent around $84 billion on defense in 2014, almost $14 billion more than the IISS estimates it budgeted.", "The dataset’s footnotes, however, make clear that Saudi Arabia likely spent much more than $80 billion on military-related activities in 2014. SIPRI says its numbers \"may not include billions of dollars of military aid for Lebanon and Egypt that was announced in 2013 and 2014.\"", "Saudi Arabia hasn’t always spent this much on its military. Its defense budget has grown fourfold in the last 10 years, from around $20 billion in 2004 to $80 billion in 2014, an increase that reflects the intensification of the Saudis’ military involvement in the rest of the Middle East.", "For the record, SIPRI’s best estimates for military expenditures in North Korea and Iran are significantly below the budget of Saudi Arabia’s defense.", "Our ruling", "Sanders said, \"Saudi Arabia has the third-largest military budget in the entire world.\"", "While there are a few different ways to calculate this statistic, both studies we looked at placed the size of Saudi Arabia’s military budget at or near No. 3 in the world.", "We rate Sanders’ claim True.", "This Week, Aug. 30, 2015", "International Institute of Strategic Studies, \"Military Balance 2015 Press Statement,\" Feb. 11, 2015", "International Institute of Strategic Studies, \"Top 15 Defence Budgets 2014,\" 2015", "PunditFact, \"RT anchor says U.S. spends big on military,\" Apr. 16, 2014", "Stockholm International Peace Research Institute, \"SIPRI Military Expenditure Database,\" 2015", "Email interview with Warren Gunnels, Bernie Sanders campaign, Aug. 30, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]