["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "In this May 21, 2011 file photo, tourists photograph Old Faithful erupting, at Yellowstone National Park, in Mont. Old Faithful is among the park’s hydrothermal features powered by the Yellowstone supervolcano. (AP Photo/Julie Jacobson,File)", "Amid partisan allegations of political disasters, should we be more worried about the natural variety—and cancel any upcoming vacations to the first national park in the United States?", "\"Yellowstone super volcano threat level just increased to ‘high’ by USGS,\" warned the headline on a story posted with a \"preppers\" tag on Oct. 29 on Disclose.tv. (USGS is th acronym for the U.S. Geological Survey, which provides science about natural hazards.) The Disclose.tv website lets users submit and share topics and videos that are supposedly ignored, denied or inadequately covered \"by the mainstream media, governmental institutions and other information keepers.\"", "This story was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Disclose.tv said in an email to PolitiFact that 100 percent of its content is user-generated. But at some point before we reached out, the headline was changed to read, \"Yellowstone super volcano threat level set to ‘high’ by USGS,\" and it said it was posted to \"nature,\" not \"preppers.\"", "The Epoch Times, which posted a story on Oct. 25 about an eruption threat, also updated its coverage, but with a correction.", "\"The Epoch Times published a misleading headline declaring the threat of Yellowstone volcano eruption had increased to ‘high.’ Yellowstone volcano’s ranking of 21st on the U.S. Geological Survey’s assessment has not changed.\"", "Yet another publication, the Post Register in Idaho, reported that the threat had been bumped from \"moderate\" to \"high,\" though the newspaper cautioned that the Yellowstone caldera isn’t expected to \"explode in a mega eruption anytime soon.\"", "Perhaps anticipating—or responding to—confusion over the volano’s threat assessment, USGS published its own article on Oct. 29 that explains what it all means. Here are the facts:", "Earlier this month, the agency released an updated threat assessment for U.S. volcanoes for the first time since the original assessment was published in 2005. The new assessment accounts for new research and observations over the past 13 years.", "In the 2005 assessment, Yellowstone is listed as a \"high threat\" volcano. In the 2018 assessment, Yellowstone is listed as a \"high threat\" volcano.", "Each volcano also has an overall threat score, which considers factors including average recurrence of eruptions, what types of eruptions have taken place and nearby infrastructure. In 2005, Yellowstone was ranked 21. In 2018, Yellowstone was ranked 21.", "\"This qualifies Yellowstone as a ‘high threat’ volcanic system,\" according to the USGS article. \"This is not a change or any sort of upgrade in the threat posed by Yellowstone, and carries no implications for future eruptive activity. It is merely a way to provide a sense of Yellowstone’s threat level compared to other volcanoes in the USA.\"", "It’s also important to note that the assessment is not an indicator of which volcanoes are most likely to erupt, according to USGS. It’s also not a ranking of the most active volcanoes (and \"active\" means that a volcano has erupted in the past 11,650 years).", "Rather, assessments gauge the relative risk a volcano poses to people and property. So if a volcano erupts but no one is living on it, it has a very low threat because no people or property are at risk, according to USGS. Meanwhile, \"a volcano that might experience only small explosions but that is surrounded by towns and near an airport has a higher threat, since lots of people and property are exposed to the hazard (even if the hazard might be a relatively small one.)\"", "We’ll let Michael Poland, a geophysicist with the U.S. Geological Survey and scientist-in-charge at the Yellowstone Volcano Observatory, have the last word.", "\"In a nutshell, this whole ‘bumped Yellowstone’s volcano threat to high’ thing is a massive job of misreporting,\" Poland said in an email. \"The threat level for the caldera system is rated as ‘high’ in a report that was issued by USGS. That report updates an initial report from 2005, in which Yellowstone was also rated ‘high.’ ... Nothing has changed\"", "We rate this statement False.", "Disclose.tv, \"Yellowstone super volcano threat level set to ‘high’ by USGS,\" Oct. 29, 2018", "The Epoch Times, \"USGS updates Yellowstone eruption threat,\" Oct. 25, 2018", "Post Register, \"Yellowstone volcanic threat level bumped to ‘high’ but expert says not to worry,\" Oct. 31, 2018", "Missoulian, \"Volcano threat study shows Yellowstone remains stable,\" Oct. 25, 2018", "U.S. Geological Survey, \"An Assessment of Volcanic Threat and Monitoring Capabilities in the United States: Framework for a National Volcano Early Warning System,\" 2005", "U.S. Geological Survey, \"2018 Update to the U.S. Geological Survey National Volcanic Threat Assessment,\" 2018", "U.S. Geological Survey, \"The USGS volcano threat assessment -- how it was determined, and what does it mean for Yellowstone,\" Oct. 29, 2018", "Email correspondence with Michael Poland, scientist-in-charge at the Yellowstone Volcano Observatory, U.S. Geological Survey, Nov. 2, 2018", "Phone interview with Michael Poland, scientist-in-charge at the Yellowstone Volcano Observatory, U.S. Geological Survey, Nov. 2, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]