["By Caitlin Quinn", "Posted on March 26, 2021", "After the Biden administration said it would spend $86 million to temporarily house immigrants at the southern border in hotels, viral posts — including a tweet by Rep. Madison Cawthorn — falsely claimed the White House has directed “zero dollars” to homeless veterans. The American Rescue Plan includes $750 million to provide housing for veterans.", "To address the surge of immigrants at the U.S.-Mexico border, the Department of Homeland Security said that the Biden administration will spend $86 million to temporarily house migrant families in hotel rooms.", "The March 20 announcement led to a backlash of false claims on social media about the administration’s treatment of homeless veterans.", "On March 21, Republican Rep. Madison Cawthorn of North Carolina tweeted, “The Biden Admin just dropped $86 Million dollars to get hotel rooms for ILLEGAL IMMIGRANTS yet we have zero dollars going to our homeless veterans who are at a high risk of suicide.”", "Social media posts on Instagram and Facebook made similar claims. One Instagram post, which had received more than 110,000 likes, said, “The Biden administration just dished out 86 million dollars for motel rooms to house illegal immigrants. Meanwhile … $0.00 for motel rooms for our homeless vets. Disgusting!”", "But the claim that President Joe Biden has given “zero dollars” to help shelter homeless veterans is false.", "Biden’s American Rescue Plan, which he introduced on Inauguration Day and signed into law on March 11, does provide funding for health services, training and housing for veterans. In a press release issued on March 12, the Department of Veterans Affairs outlined the types of assistance directed to veterans in the plan.", "It includes “$14.5 billion for COVID-19 related health care, including information technology and facility requirements, ensuring access for 9.2 million enrolled Veterans who may have delayed care or have more complex health care needs as a result of the pandemic, as well as resources for Veterans currently receiving housing support and an estimated 37,000 homeless Veterans.”", "The plan sets aside “$750 million for both construction grants ($500 million) and payments ($250 million) to State Homes to greatly improve the living conditions of our most vulnerable Veterans who reside in these facilities.”", "State Veterans Homes are owned and operated by state governments and provide nursing home, domiciliary or adult day care for veterans, spouses and Gold Star parents. There are 149 nursing homes; 53 domiciliary facilities that provide a home, food, clothing and medical services; and three facilities that offer day care programs, including medical and rehabilitation services.", "The $750 million allocated in the American Rescue Plan is in addition to funds that the federal government provides annually for homeless veterans through appropriations bills.", "Those funds support various programs operated by the VA that serve homeless veterans, including “Health Care for Homeless Veterans, Supportive Services for Veteran Families, and the Homeless Providers Grant and Per Diem program, as well as a collaborative program with [the Department of Housing and Urban Development] called HUD-VASH, through which homeless veterans receive Section 8 vouchers from HUD and supportive services through the VA,” according to the Congressional Research Service. “The Department of Labor also operates a program for homeless veterans, the Homeless Veterans Reintegration Program.”", "The Grant and Per Diem program is for short-term assistance – which is most similar to the current emergency situation at the border. It provides about $50 per day for transitional housing. The CRS report describes this program as focusing on “making transitional housing a short-term intervention and helping veterans obtain permanent housing as quickly as possible.”", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "Congressional Research Service. “Homelessness: Targeted Federal Programs.” 18 Oct 2018.", "Congressional Research Service. “State Veterans Homes.” 1 Oct 2020.", "H.R. 1319 – American Rescue Plan Act of 2021. Congress.gov. Accessed 24 Mar 2021.", "Kight, Steph W., “Scoop: ICE securing hotel rooms to hold growing number of migrant families.” Axios. 20 Mar 2021.", "U.S. Department of Veterans Affairs. “American Rescue Plan provides Veterans seamless COVID-19 protections and monetary aid.” 12 Mar 2021.", "U.S. Department of Veterans Affairs. “Geriatrics and Extended Care.” Accessed 26 Mar 2021.", "U.S. Department of Veterans Affairs. Veterans Experiencing Homelessness: “Grant and Per Diem Program.” Accessed 26 Mar 2021.", "U.S. Department of Veterans Affairs. “Veterans Experiencing Homelessness.” Accessed 24 Mar 2021.", "White House. “President Biden Announces American Rescue Plan.” 20 Jan 2021.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]