["Mahashay Dharampal Gulati, Founder and CEO of MDH (Mahasian di Hatti), the iconic spice brand, died on December 3 in a Delhi hospital at the age of 98. Following his demise, a number of social media users began sharing a video, purportedly showing the final moments of the public figure. Those who made this claim include filmmaker Vivek Agnihotri, ABP News anchor Vikas Bhadauria and several others.", "मसाला किंग महाशय धर्मपाल (MDH) की आख़िरी समय की तस्वीरें, आख़िरी समय में भी उनका दिल देश के लिए ही धड़कता रहा. pic.twitter.com/JusNLqvYoO", "— Vikas Bhadauria (ABP News) (@vikasbha) December 4, 2020", "Most overwhelming video you can see today. Even in his last breaths owner of MDH masale Swargiya Dharampal ji’s heart was beating for India. I hope this will inspire you. pic.twitter.com/KmRqS0EpOC", "— Vivek Ranjan Agnihotri (@vivekagnihotri) December 4, 2020", "News 24 and Zee News also broadcasted this footage as the last clip of Gulati before his death. Apart from this, a verified Facebook page named ‘The Sentimental‘ also shared this video.", "This slideshow requires JavaScript.", "BJP Haryana’s social media head Arun Yadav posted the visuals and accompanying claim.", "मसाला किंग महाशय धर्मपाल जी (MDH) की आख़िरी समय की तस्वीरें", "आख़िरी समय में भी उनका दिल देश के लिए ही धड़कता रहा….🇮🇳🇮🇳 pic.twitter.com/ucCa91uzE4", "— Arun Yadav (@beingarun28) December 4, 2020", "A quick look at these visuals confirms that it cannot be recent because no one is seen wearing a mask. It is also worth mentioning that this video was not taken at anyone’s residence, but at a hospital, where there are strict guidelines about the usage of face masks. We further noticed that a user named Gagan Ahuja replied to Vikas Bhadoria’s tweet, saying that the man in the red shirt singing a song is his brother Rakesh Ahuja.", "Alt News found that Gagan had also posted this video on Facebook where he wrote that it was shot at a hospital around the time Gulati had been ill for almost a year. He could barely move his arms and legs. However, when a family friend began singing his favourite song Gulati’s limbs moved and he began clapping to the rhythm of the song almost in a miracle.", "संगीत में अदभुत शक्ति होती है…..लगभग एक वर्ष से बीमार चल रहे महाशियां जी जब हॉस्पिटल में थे और हाथ पैर की मूवमेंट्स बिल्कुल बंद हो गयी थी तब मेरे एक पारिवारिक मित्र Rakesh Ahuja जी जो MDH किंग महाशियां जी के बहुत अजीज़ थे , उनसे मिलने गए और डॉक्टर्स से सलाह के बाद संगीत थेरेपी के तौर पर उनका मनपसंद गीत सुनाया….लगभग दो महीने से हाथों का मूवमेंट बंद था….और फ़िर जो चमत्कार हुआ आप खुद देखिए…. अलविदा जीवंतता … #गगनकीबात", "Posted by Gagan Ahuja on Thursday, December 3, 2020", "Alt News reached out to Rakesh Ahuja, the man singing the song in the video. “I went to Mata Chanan Devi Hospital in Delhi to see Mr Mahashay in September or October last year. He could not even move, his condition was quite poor. Whenever I met him, he always used to ask me to sing this song. It was one of his favourite songs. After speaking to the doctor, I sang this song and he began to move. This is also captured in the video. It kind of worked like musical therapy,” said Ahuja.", "We further spoke with people close to Gulati, and all of them confirmed that the video is not recent. Some said that it is two or three years old, while others stated it was from last year. One of these individuals said that the spice businessman was undergoing treatment at Mata Chanan Devi Hospital in Delhi, where he breathed his last. The hospital management confirmed that these visuals are from the hospital, but said that it was an old video.", "To sum it up, an old clip was falsely shared as the final moments of MDH Founder Dharampal Gulati taken before his death. Journalist Vikas Bhadauria, who had shared the viral claim and video, later issued a tweet clarifying that the clip was two years old.", "Donate Now", "Priyanka Jha specialises in monitoring and researching mis/disinformation at Alt News. She also manages the Alt News Hindi portal.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]