["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Chase Legleitner, a white defendant, and Lamar Lloyd, a black defendant, both pleaded no contest to two counts of armed robbery in separate cases in Florida. A judge sentenced Legleitner to two years in jail and Lloyd to 26 years in prison.", "Both defendants had one prior misdemeanor and had the same number of points on a scoresheet used to determine sentencing.", "A prosecutor said that the two cases were different because Legleitner cooperated with prosecutors to convict co-defendants.", "Research shows African Americans face harsher treatment than whites in the criminal justice system, including longer prison sentences.", "A Facebook post tries to illustrate that point through a graphic comparing the results of two cases overseen by the same judge.", "The post compares the case of Chase Legleitner, a white 19-year-old, with Lamar Lloyd, a black 21-year-old. It says that Legleitner was sentenced to two years in jail while Lloyd was sentenced to 26 years in prison — both by Circuit Court Judge Sherwood Bauer Jr. in the 19th Circuit in Martin County.", "The claim gets the basic facts correct, but it omits an additional difference in the white defendant’s case.", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.) A similar graphic has circulated at least since 2018.", "This claim was also shared by various celebrities commenting on racial injustice in June following the death of George Floyd in police custody.", "The juxtaposition of the two robbery cases is from the Sarasota Herald-Tribune’s award-winning 2016 \"Bias on the Bench\" series. The newspaper examined millions of court documents on crimes in Florida from 2004 through 2016. The investigation concluded that blacks are more likely to be found guilty than whites and usually get longer sentences.", "One article used the sentences for Legleitner and Lloyd as an example to show that Bauer sentenced African Americans to longer terms. Bauer told the newspaper that race is of \"complete insignificance\" in his treatment of defendants.", "Here are the basic facts of the two cases: Legleitner robbed men in a 2008 drug deal. Lloyd robbed a Pizza Hut and gas station the following year. Both men pleaded no contest to two counts of armed robbery and had open pleas, which means they weren’t promised a particular sentence. Each had a single misdemeanor on his record and tallied the same point total on scoresheets used to determine incarceration time. Based on their score of 138 points, the state’s guidelines called for a sentence of just under seven years to life in prison.", "Bauer sentenced Lloyd to 26 years in prison in 2010, and the following year sentenced Legleitner to about two years in jail, including time already served.", "David Lustgarten, the assistant state attorney who prosecuted Legleitner, told PolitiFact that the defendants’ point totals on the scoresheet don’t tell the full story. Lustgarten said he was familiar with the facts of Lloyd’s case.", "Legleitner, he said, was one of about a half dozen defendants who were involved in a scheme to approach other men under the guise of buying drugs, but planned to rob them. Legleitner helped the prosecution build the case against the co-defendants who were armed, including testifying against one at trial.", "\"I told Judge Bauer at sentencing that without his testimony I would have never secured a conviction against the two bad actors,\" Lustgarten said.", "The Herald-Tribune article alluded to the fact that Legleitner cooperated when it stated that \"the prosecutor lobbied hard for leniency.\"", "Legleitner’s defense attorney didn’t respond to our questions.", "Lloyd’s case involved fewer defendants.", "Lloyd’s was a \"clear-cut case,\" said Adam Guzi, who prosecuted Lloyd and recommended a 30-year sentence. Guzi said he had witness accounts from the Pizza Hut and the Sunoco gas station as well as another witness who had spotted the defendants appearing to inspect another restaurant earlier. Prosecutors didn’t need Lloyd’s cooperation to convict the other man, Guzi said.", "Lloyd’s defense attorney, J.D. Lewis IV, said he thought that his client’s sentence was outrageous at the time.", "But asked about the role of race in Lloyd’s sentencing, he told PolitiFact, \"I can’t personally say there is evidence that race was a factor.\"", "In general though, Lewis said he believes that there are racial disparities in the criminal-justice system. \"I would be naive to think racism does not play a part in the criminal justice system,\" he said.", "Following the Herald-Tribune’s series, the 12th judicial circuit wrote a rebuttal, which included an analysis of the two robbery cases handled by Bauer in the 19th circuit. Bauer’s office directed us to part of the rebuttal written by Diamond Litty, public defender for the 19th circuit (Legleitner and Lloyd both had private counsel.)", "The public defender pointed to Lustgarten’s testimony at the sentencing hearing that Legleitner was \"morally cooperative, honest, forthright, and remorseful.\"", "The public defender also noted that Legleitner stole from someone who was a drug user or dealer, while Lloyd stole from employees at work.", "We sent a summary of our findings to Marc Mauer, executive director of the Sentencing Project, a criminal justice advocacy group.", "Mauer questioned why states have a complex scoring system in their sentencing guidelines if it doesn’t pick up significant case distinctions.", "\"In this case, essentially the black defendant gets sentenced by the guidelines system and the white defendant gets the benefit of wide-ranging judicial discretion,\" he said. \"This doesn't necessarily mean that the white defendant ‘got off too easy’—  just as likely that the black defendant got punished too severely.\"", "Prosecutors have long recommended a reduced sentence in exchange for a defendant’s cooperation, Mauer said. But in the era of mandatory sentences and enhanced prosecutorial power, the scale of that benefit has increased dramatically.", "\"So defendants who don't have information to trade or wish to contest the charges are faced with the prospect of a dramatically higher sentence for the same conduct as another who chooses to plead guilty,\" he said.", "A 2000 research report by the National Institute of Justice, a federal agency, concluded that despite decades of reform efforts, in some jurisdictions, blacks and Hispanics received longer sentences or differential benefits from guideline departures than similarly situated white offenders.", "The disparities appeared in Southern and non-Southern jurisdictions, in state and federal court systems, and in jurisdictions with and without sentencing guidelines.", "A Facebook post said a white armed robbery suspect was sentenced to two years in jail while a black armed robbery suspect was sentenced to 26 years in prison by the same Florida judge in two separate cases.", "The post gets the basic facts correct: The two defendants both pleaded no contest to the same crime, both had one prior misdemeanor and both scored the same number of points on a system designed to calculate their sentences.", "But prosecutors said the white defendant got a reduced sentence after cooperating with prosecutors to convict co-defendants, a fact that’s not mentioned in the graphic.", "We rate this claim Mostly True.", "Sarasota Herald-Tribune, Bias on the Bench, 2016", "Online Journalism Awards, Bias on the Bench, 2017", "Sarasota Herald-Tribune, Fact checking the 12th Circuit’s \"final response\" 2017", "Sarasota Herald-Tribune and Palm Beach Post, ‘Our hands are tied’ Nov. 28, 2018", "12th Judicial Circuit, Twelfth Circuit Court Response to Sarasota Herald Tribune \"Bias on the Bench\" Series", "Snopes, Did a Florida Judge Give Vastly Different Sentences to Two Men, Whose Only Difference Was Their Race? Aug. 20, 2018", "TC Palm, Meme criticizing judge about Martin County sentencing goes viral a second time, June 11, 2020", "National Institute of Justice, Thirty Years of Sentencing Reform: The Quest for a Racially Neutral Sentencing Process, 2000", "The Sentencing Project, Report to the United Nations on Racial Disparities in the U.S. Criminal Justice System, April 19, 2018", "Telephone interview, David Lustgarten, assistant state attorney 19th circuit of Florida, June 12, 2020", "Telephone interview, J.D. Lewis IV, defense attorney for Lamar Lloyd, June 12, 2020", "Email interview, Marc Mauer, Sentencing Project executive director, June 15, 2020", "Email interview, Patty Harris, 19th Judicial Circuit of Florida trial courts administrator, June 12, 2020", "Telephone interview, Adam Guzi, former assistant state attorney 19th circuit of Florida now in private practice, June 15, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]