["• The New York Times reported on Sept. 27 that President Trump paid no federal income tax in 11 of 18 years for which the newspaper had obtained records, and in 2016 and 2017, he paid $750 each year.", "• The Times has not issued any corrections on its reporting about Trump’s taxes.", "• Trump has not provided evidence to counter the Times’ reporting and says he cannot release his tax returns because of an ongoing audit.", "The New York Times recently published a blockbuster series of stories detailing for the first time President Donald Trump’s recent tax-return data showing he paid no federal income taxes for 11 years and paid $750 in both 2016 and 2017.", "Now a Facebook post shared thousands of times claims the news organization is taking it all back:", "\"NYT is correcting their lies..Trump paid $1M in 2016 & $3.8M in 2017-18..THEY LIED..AGAIN. INFO ON TWITTER THIS AM,\" reads the Sept. 29 Facebook post.", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The New York Time released a multi-part investigation of Trump’s taxes beginning Sept. 27, based on \"decades of personal and corporate tax records\" for the president\" that were provided by unnamed sources, according to the Times. The newspaper said it is not making the records public in order to protect those who provided them.", "The investigation found that Trump paid little or no federal income taxes for 18 years and his signature businesses have suffered severe losses that helped him achieve a lower tax bill. Despite the Facebook claim that the Times is \"correcting their lies,\" the newspaper has not published any corrections for the Trump tax stories, which it would do if information was found to be inaccurate.", "Trump has disputed the reporting but provided no evidence to support his position. During the first presidential debate on Sept. 29, moderator Chris Wallace asked Trump if the Times stories were accurate.", "\"I paid millions of dollars in taxes. Millions of dollars of income tax,\" Trump replied, according to a transcript of the debate. When Joe Biden interjected, \"Show us your tax returns,\" Trump responded: \"You’ll see it as soon as it’s finished, you’ll see it.\" Trump has for years cited a pending audit as reason for not making his tax returns public.", "Trump likely has paid other types of taxes, but PolitiFact found no evidence he has paid millions in income taxes.", "A Facebook post claims the New York Times \"is correcting their lies\" and that Trump \"paid $1M in 2016 & $3.8M in 2017-18.", "The New York Times has not issued any corrections or retractions about its recent reporting about Trump’s income taxes and there is no evidence that Trump paid millions in taxes in 2016, 2017 and 2018.", "We rate this claim False.", "Facebook post, Sept. 29, 2020", "New York Times, \"18 Revelations From a Trove of Trump Tax Records,\" Sept. 27, 2020", "New York Times, \"An Editor’s Note on the Trump Tax Investigation,\" Sept. 27, 2020", "New York Times, \"Long-Concealed Records Show Trump’s Chronic Losses and Years of Tax Avoidance,\" Sept. 27, 2020", "New York Times, \"Corrections,\" accessed Oct. 6, 2020", "Politifact, \"Fact-checking the first 2020 presidential debate, Joe Biden vs. Donald Trump,\" Sept. 29, 2020", "USA Today, \"Read the full transcript from the first presidential debate between Joe Biden and Donald Trump,\" Sept. 30, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]