["The photo was published here on Facebook on November 12, 2019. The post’s Urdu-language caption translates to English as: \"Last prayers at the site of the demolished Babri Masjid in Ayodhya before it is handed over to the Hindus.\"", "Babri Masjid, or the Babri mosque, refers to the 16th century mosque that has been at the center of deadly religious strife in Ayodhya, a town in the north Indian state of Uttar Pradesh. The mosque was destroyed by Hindus in 1992 over claims that it was built on the birthplace Rama, a Hindu god, and a previously demolished Hindu temple. Thousands of people, mostly Muslims, were killed in the subsequent unrest across India, AFP reported here.", "On November 9, 2019, India’s Supreme Court issued a decision in a long-running ownership dispute over the contested religious site. Here is an AFP report on the court’s ruling, which awarded Hindus control over the site.", "Below is a screenshot of the misleading Facebook post:", "The photo was also published here, here, here and here on Facebook and here, here, here and here on Twitter alongside a similar claim.", "The claim is false; the photo shows Muslims praying on Eid al-Adha in 2008 at Feroz Shah Kotla, a 14th century mosque in India’s capital New Delhi.", "A reverse image search on Google found the same photo was published here on December 12, 2018. It was shared alongside several other archived photos of prayers from across the world to mark the festival.", "Below is a screenshot of the original photo, which is credited to Associated Press photographer Gurinder Osan:", "“In New Delhi, India, Muslims offer Eid al-Adha prayers at the Ferozshah Kotla Mosque on Tuesday, Dec. 9, 2008. (AP Photo/Gurinder Osan),” the photo caption reads.", "A Google user's photo of the same mosque tagged at the mosque's location here on Google Street View  corresponds with the photo in the misleading Facebook post. Below is  a screenshot comparison of the two images:", "Several other photos of the Feroz Shah Kotla mosque published by Getty Images can be seen here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]