["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Mike Collins says some folks don’t have their facts right concerning his position on one issue.", "His critics say he’s talking out of both sides of his mouth and \"already acting like a Washington politician.\"", "Collins, a Republican candidate in Georgia’s 10th Congressional District race, is trying to explain some remarks he made six months ago about his position on whether to raise the federal debt ceiling.", "In a December interview with Roll Call, a news site that extensively reports about the ways of Washington, Collins offered a 15-second clip concerning his thoughts about the proposed debt- ceiling increase that Congress approved in February.", "\"I think we need to raise the debt ceiling at a certain point that we can get business done and start working on a budget to start paying that down and get this economy back rolling,\" he said.", "A few days before the May 20 Republican primary, Collins put together a flier in response to criticism about what he said in the interview. Collins said, in part, that he \"has never said he wanted to raise the debt ceiling.\"", "Is this a contradiction with Collins’ Roll Call interview? PolitiFact Georgia decided to take a look.", "Collins was one of seven Republicans vying for the House seat currently held by U.S. Rep. Paul Broun, a Republican from Athens. Broun ran unsuccessfully for the U.S. Senate.", "Collins finished a very close second in the May 20 primary and is in a runoff in July with Jody Hice for the GOP nomination. The winner will face Democrat Kenneth Dious in the November general election. Collins is the son of former U.S. Rep. Mac Collins.", "Raising the debt ceiling was not a popular position among most conservatives. The U.S. Treasury Department said the United States would reach its borrowing limit by the end of February.", "Broun, like every other Republican House member from Georgia, voted against raising the debt ceiling. At least one of Collins’ opponents thought his remarks in the Roll Call interview could mean trouble for him.", "Less than a week before the primary, candidate Donna Sheldon posted the Collins interview on YouTube.", "\"Mike Collins couldn't be more wrong about raising the debt limit. I will refuse to raise the debt ceiling, and I will fight to cut spending and balance our budget,\" she wrote. \"Elections have consequences. Which position do you think is right for Georgia?\"", "Collins responded with his flier.", "\"Fact: Mike has never said he wanted to raise the debt ceiling and will never say he wants to raise the debt ceiling. He had the first written plan to reduce the debt.\"", "Sheldon accused Collins in a press release of \"a whopper of a provable untruth.\"", "Collins said in a telephone interview with us that he never said he wanted to raise the debt ceiling.", "\"The debt ceiling was going up whether or not I wanted it to,\" he said. \"Did I want to (raise the debt ceiling)? No. We have to have a plan to start bringing it down.\"", "Collins explained in more detail a few days later via email. The candidate said he was not in favor of the legislation that passed to raise the debt ceiling in February. Collins said he would only support a debt-ceiling increase with \"deep spending concessions and a path to pay the debt down.\"", "In November, Collins articulated his position on many issues on his campaign website. On federal spending, Collins wrote: \"I am the only business professional in this race, and will work to ensure Congress passes an annual budget without raising the debt limit.\"", "In January, Collins put together a written plan that said \"our national debt is out of control\" and Congress needs to pass a balanced budget amendment. Collins wrote that he would support a budget plan similar to those proposed by U.S. Rep. Paul Ryan, R-Wis., that would cut federal spending by $5 trillion over the next decade.", "\"Saying that I want to raise the debt ceiling, implying that I support increasing our debt willy-nilly, is a false representation of what I believe, and I don’t think it’s a fair characterization of my stance on the issue,\" Collins said.", "In a follow-up telephone interview, Collins said the questions in the Roll Call interview came in rapid fire, and he conceded \"I could have given a more detailed answer.\"", "To sum up, Collins said in an interview in December that he thought the debt ceiling needed to be increased when it was scheduled to reach its limit in February.", "Collins recently sent a flier claiming that he \"has never said he wanted to raise the debt ceiling.\" Collins said his position was that he would only support a debt-ceiling increase in accordance with deep spending cuts. The debt-ceiling bill that passed in February did not include spending cuts. A month before the Roll Call interview, Collins had written that he would work to pass a budget without raising the debt ceiling.", "Collins said in one interview with PolitiFact Georgia that he could have given a more detailed answer in the Roll Call interview. Collins also could have been more detailed in the flier he sent out to defend himself. He might not have meant what he said, but his opponents have a point. He did say it.", "Our team had a lot of debate about this one. We believe Collins is somewhat accurate, but the claim in his flier omits some critical facts. Under our rating system, we rate Collins’ claim as Mostly False.", "Mike Collins Roll Call interview, Dec. 4, 2013.", "Mike Collins written plan to \"Overhaul D.C.\"", "Mike Collins on the issues.", "Telephone interviews and email exchanges with Mike Collins, May 22 and 29, 2014.", "The New York Times, \"Ryan’s Budget Would Cut $5 Trillion in Spending Over a Decade,\" April 1, 2014.", "Z Politics, \"Mike Collins Quote On The Debt Ceiling,\" May 16, 2014.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]