["About this rating", "When it opened in 1937, the Golden Gate Bridge that connects the city of San Francisco to Marin County, California, was both the longest and the tallest suspension bridge in the world. Although it no longer holds claim to either of those titles (Japan's Akashi Kaikyō Bridge exceeds it in both respects), the Golden Gate Bridge remains one of the Seven Wonders of the Modern World, is one of the most-photographed structures on Earth, and stands as a globally recognized symbol of one American city.", "As reported by the San Francisco Chronicle, the official opening of the Golden Gate Bridge in 1937 was a huge event that spanned nine days of celebrations, with two separate opening days — one for pedestrians and one for cars — drawing hundreds of thousands of bridge-crossers:", "Excitement was so high for the bridge that the Golden Gate Fiesta included nine days of celebrations, and not one opening day but two. The first opening day, May 27, 1937, was limited to pedestrians.", "The organizing committee estimated that 100,000 people would take advantage of the opportunity to stroll across the bridge without interference from cars, but they seriously underestimated the appeal. From 6 a.m. to 6 p.m. that day, more than 200,000 flocked to the bridge for a chance to say they walked across.", "The next day cars were allowed on the bridge. Precisely at 11 a.m. May 28, dozens of U.S. Navy planes would fly over the Golden Gate Bridge, followed by Navy ships of all sizes — three aircraft carriers, 13 heavy cruisers, six light cruisers and six destroyers — passing underneath the bridge.", "In recent years, a photograph said to depict that (first) opening day in 1937 has frequently been shared online with the caption \"The Golden Gate Bridge opening to the public for the first time back in 1937, and yes, it almost collapsed\":", "But this picture doesn't date from 1937, nor did we find any contemporaneous accounts stating that the Golden Gate Bridge \"almost collapsed\" at that time. Although this photograph is displayed in black-and-white and therefore looks fairly \"old\" to modern eyes, it was actually taken in 1987, when an estimated 300,000 people swarmed the bridge during its golden anniversary celebration.", "The original image was captioned as follows: \"Shot from the South Tower facing south down onto the roadway overlooking a mass of people at the 50th anniversary celebration for the Golden Gate Bridge.\"", "The crush of pedestrians who crossed the bridge that day in 1987 did cause it to sag about 7 feet at its mid-section, and some onlookers did fear at the time that the structure was in danger of buckling, but engineers maintained that the combined load was well within the bridge's capacity:", "On May 24, 1987, 300,000 people were stuck in human gridlock for hours while getting a rare chance to cross the 1.7-mile bridge en masse on foot to celebrate the bridge’s golden anniversary. Officials quickly closed the bridge, so a half-million other people waiting to cross never got the chance. Still, the enormous, unprecedented weight caused the middle of the bridge to sag 7 feet.", "“I’m grateful because if the others had gotten out there, maybe the bridge would have fallen down,” Gary Giacomini, then president of the bridge district’s board, told The Associated Press at the time.", "But engineers said afterward that the bridge was never in danger of collapsing.", "Independent engineers agree[d] ... that structurally the bridge was safe during the Golden Gate’s last big celebration.", "“It was probably the biggest load the bridge had ever seen,” said Mark Ketchum, a San Francisco bridge engineer who studied the Golden Gate Bridge from 1989 to 1991. “But it did not exceed the design load capacity of the bridge.”", "On fully loaded suspension bridges the size of the Golden Gate, it’s normal to have “deflections” of up to 10 feet, said Greg Deierlein, a Stanford University professor of civil and environmental engineering.", "Van Niekerken, Bill.   \"Golden Gate Bridge’s 1937 Debut: An Awe-Inspiring Archive Find for the Ages.\"\r\n    San Francisco Chronicle.   27 May 2019.", "Tung, Stephen.   \"The Day the Golden Gate Bridge Flattened.\"\r\n    [San Jose] Mercury News.   13 August 2016.", "Ting, Eric.   \"32 Years Ago, 300,000 People Flattened the Golden Gate Bridge.\"\r\n    San Francisco Chronicle.   25 May 2019.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]