["By Saranac Hale Spencer", "Posted on April 14, 2020", "A conspiracy theory falsely claims Bill Gates is plotting to use COVID-19 testing and a future vaccine to track people with microchips. The Gates Foundation has advocated for expanded testing and has funded vaccine research, but neither of those involves implanted microchips.", "The Bill & Melinda Gates Foundation has committed millions of dollars to research treatments and vaccines for COVID-19 as the pandemic continues to spread across the globe.", "Those endeavors are now fueling a conspiracy theory that falsely claims Bill Gates has plans to use the eventual vaccine to “track people.”", "That claim has circulated in conspiracy theory groups online over the last few weeks, but it recently graduated to a more mainstream audience.", "On April 6, Emerald Robinson, White House correspondent for the conservative website Newsmax, tweeted about Gates with a reference to another debunked conspiracy theory and concluded, “He basically controls global health policy. What’s the plan? Using vaccines to track people.”", "Two days later, Fox News host Laura Ingraham asked U.S. Attorney General William Barr about Gates favoring “what some would say, tracking mechanisms.”", "The claim appears to have developed after Gates participated in a March 18 forum on Reddit. There, he answered a question about maintaining businesses during the pandemic.", "Bill Gates, March 18: Eventually we will have some digital certificates to show who has recovered or been tested recently or when we have a vaccine who has received it.", "The following day, a website called Biohackinfo.com posted a story with the headline: “Bill Gates will use microchip implants to fight coronavirus.” It’s been shared more than 13,000 times on Facebook, according to data from CrowdTangle, and a YouTube video based on the story has been viewed more than 1.8 million times.", "The story cited Gates’ answer in the forum and then declared, “The ‘digital certificates’ Gates was referring to are human-implantable ‘QUANTUM-DOT TATTOOS.'”", "But that’s not true. It’s a mash-up of two unrelated things.", "First, digital certificates are used to send encrypted information over the internet, as in the common case of electronic signatures which are used to verify identity. They were officially defined by what is now called the Telecommunication Standardization Sector in 1988 and have always been virtual, not physical.", "When Gates mentioned their use in the forum, he was referring to digital certificates as part of an effort to create a digital platform that would expand home-based, self-administered testing for COVID-19, the Gates Foundation said in an email to FactCheck.org.", "He referred to the same effort to ramp up home testing at another point in the forum, saying, “The testing in the US is not organized yet. In the next few weeks I hope the Government fixes this by having a website you can go to to find out about home testing and kiosks… Whenever there is a positive test it should be seen to understand where the disease is and whether we need to strengthen the social distancing. South Korea did a great job on this including digital contact tracing.”", "South Korea, which has implemented an extensive testing system, created a website that showed information about where patients who tested positive for COVID-19 had been in order to alert others in the area. Although the information on the site is anonymous, there has been some criticism that it’s an invasion of privacy.", "Still, that’s a long way from “microchip implants.”", "The second part of the claim — and the one that likely led to the microchip assertion — is a reference to unrelated research that was funded by the Gates Foundation and published in December. In an effort to address the problem of poor record-keeping in “low-resource settings,” such as developing countries, that research proposed keeping a record of vaccination on a patient’s skin. It tested an invisible dye that could last up to five years and be read with a specially adapted smartphone.", "Kevin McHugh, a bioengineering professor at Rice University who worked on the study, told us by email that the ink couldn’t be used as a tracking device.", "“These markings were developed to provide a vaccination record and there is no ability to track anyone’s movements,” McHugh said. “This technology is only able to provide very limited (e.g. non-personalized) data locally. These markings require direct line-of-sight imaging from a distance of less than 1 foot. Remote or continuous tracking is simply not possible for a variety of technical reasons.”", "The Gates Foundation confirmed to us by email that this research is unrelated to any measures related to COVID-19 vaccines.", "So, this claim can be added to the heap of bogus conspiracy theories about microchip tracking and Bill Gates.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "Robinson, Emerald (@EmeraldRobinson). “The more you study this virus, the more you find the same name: Bill Gates. He’s the 2nd largest funder of WHO. He’s building 7 vaccine labs. Fauci. Tedros. Event 201. ID2020. He basically controls global health policy. What’s the plan? Using vaccines to track people.” Twitter. 6 Apr 2020.", "Ingraham Angle. Fox News. “Barr talks China’s global impact in exclusive ‘Ingraham Angle’ interview.” YouTube. 8 Apr 2020.", "Gates, Bill. “I’m Bill Gates, co-chair of the Bill & Melinda Gates Foundation. AMA about COVID-19.” Reddit. 18 Mar 2020.", "Wattendorf, Dan. Director of Innovative Technology Solutions, the Bill & Melinda Gates Foundation. “What it will take to make self-administered COVID-19 testing possible.” Gatesfoundation.org. 18 Mar 2020.", "McHugh, Kevin, et al. “Biocompatible near-infrared quantum dots delivered to the skin by microneedle patches record vaccination.” Science Translational Medicine. 18 Dec 2019.", "McHugh, Kevin. Bioengineering professor, Rice University. Email response to FactCheck.org. 8 Apr 2020.", "Bill & Melinda Gates Foundation representative. Email response to FactCheck.org. 9 Apr 2020.", "Fichera, Angelo. “New Coronavirus Wasn’t ‘Predicted’ In Simulation.” FactCheck.org. 29 Jan 2020.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]