["A short video shared tens of thousands of times on social media shows a long line of people waiting inside of an airport with their luggage, while two officers wearing Canadian Border Security Agency (CBSA) uniforms look on.", "The video was shared on Twitter, Instagram, Facebook, and Youtube in late December 2019, with captions such as “A Batch Of Indian Students At Pearson Being Deported Back After Their IELTS Results Were Found to Be Fake.”", "The IELTS, or International English Language Testing System, is an international standardised test used to show proficiency in the English language for non-native speakers, and widely accepted by Canadian academic institutions.", "However, the captions are false. The people shown in the video are not deported out of Canada, but waiting for their visas to get into the country.", "“The video is false and the individuals in the video were not waiting to be deported as the caption erroneously states,” Rebecca Purdy, spokesperson for the CBSA, told AFP in an email.", "“The video depicts a CBSA overflow waiting area at Toronto Pearson International Airport where international students are awaiting study permit processing,” she added.", "CBSA also tweeted a statement denying the accuracy of the video’s caption on its official Twitter account on December 30.", "The #CBSA can confirm that the content and caption of a video circulating on social media are false. The video shows an overflow waiting area at @TorontoPearson where international students are awaiting study permit processing. The individuals are not waiting to be deported.", "Purdy explained that the surge in arrivals captured on the video is due to the beginning of study sessions in January, which causes higher than average movement across borders for students about to begin their semesters.", "The practice of processing visas directly at the airport upon arrival into Canada is common practice, Purdy pointed out. “The CBSA has processed over 243,000 study permits for international students at ports of entry in 2019, with the vast majority being processed at airports across Canada.”", "She added that CBSA is currently exploring ways to expedite visa processing at ports of entry in order to facilitate legitimate travel in the future.", "In 2018, a college in Ontario, the central Canadian province in which the Toronto Pearson airport is located, ordered 400 admitted students to take an IELTS test again after finding inconsistencies in the English level of students who had taken the test in India. This mediatized episode may have provided a basis for the spread of the video in a false context.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]