["A video purportedly depicting the printing of Rs 50 and Rs 200 notes has been shared on social media with the claim that fake Indian currency notes are being manufactured in Pakistan.", "पाकिस्तान में कुटीर उद्योग..", "कृपया इस वीडियो को सभी देखें , अन्यथा यह कार्य उस व्यक्ति के लिए सफल नहीं होगा जिसने चुपके से यह वीडियो लिया है.. pic.twitter.com/2u2DpROI6c", "— 🚩🇮🇳उमा शंकर राघव 🇮🇳🚩8k (@UmaShankar2054) September 11, 2021", "Alt News has also received verification requests for the video on its WhatsApp helpline number (+91 76000 11160).", "This slideshow requires JavaScript.", "in 2019, several individual users shared the clip with the caption – “Small scale industry in Pakistan. pl forward this video to all or else the mission will not be a success for the person who has secretly taken this video.”", "Small scale industry in Pakistan.pl forward this video to all or else the mission will not be a success for the person who has secretly taken this video. 👇👇👇👇👇👇👇🏻", "Posted by Manohar Pv on Wednesday, 15 May 2019", "It was forwarded on WhatsApp as well.", "The video has been doing rounds on social media since January 2019, with the same caption.", "This is horrible! Small scale industry in Pakistan इस वीडियो को सब जरूर देखें एक ने भी छोड़ दी तो वीडियो बनाने वाले का मिशन सार्थक न हुआ समझो ।👇 pic.twitter.com/OzQtv0EADc", "— Riya 🔨 Justice 4 Sri Ram #SaveSabarimala (@riyaOmm) January 13, 2019", "The video was viral both on Twitter and Facebook.", "The video itself gives away the falsehood of the claim.", "1. If one looks closely, the words ‘भारतीय चिल्ड्रन बैंक (Bharatiya Children Bank)’ are printed on the notes.", "2. Some of the notes also have the words ‘Manoranjan Bank of India’ printed on them", "3. Another hint that the notes are fake is the absence of ‘₹’ before the currency value. The comparison of a fake note (left) and a specimen of a real note (right) juxtaposed together gives a clearer picture.", "In 2017, the media had reported that an SBI ATM in Delhi dispensed Rs 2,000 notes with ‘Children’s Bank of India’ printed on them.", "A similar event took place in UP last year. Rs 500 notes were dispensed from a BOI ATM with ‘Children’s Bank of India’ printed on them.", "The Outlook had reported a counterfeit currency racket last year where a stash of Rs 32 lakh ‘Children’s Bank of India’ notes was recovered.", "While the origin of the video could not be established by Alt News, it seems to be taken inside a printing press. Boomlive had reported that a man in the background can be heard speaking Marathi. The video was also debunked by SM Hoaxslayer in 2019 when it was also being shared as ‘fake notes printed in Bangladesh.’", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]