["By D'Angelo Gore", "Posted on April 11, 2019", "The U.S. does not currently have economic “growth over 4 percent,” as White House counselor Kellyanne Conway claimed recently.", "On a quarterly basis, real gross domestic product (which is adjusted for inflation) last grew at an annualized rate of more than 4 percent in the second quarter of 2018. On an annual basis, GDP growth has not been higher than 2.9 percent since President Donald Trump took office.", "Conway made her claim during a CNN interview in which she talked about what she considered to be some of the Trump administration’s economic successes.", "Conway, April 10: I think my job here is to work every day on policy that helps — that helps improve the lives of Americans. … We have growth over 4 percent and we have unemployment under 4 percent. This matters to people.", "The White House did not respond to an email we sent about Conway’s claim.", "Since Trump has been president, there has been just one quarter when the economy grew at an annualized rate of over 4 percent — the second quarter of 2018, at 4.2 percent.", "Most recently, real GDP increased at an annualized rate of 2.2 percent in the fourth quarter of 2018. The U.S. Bureau of Economic Analysis is scheduled to release its “advance” estimate for growth during the first quarter of 2019 on April 26. But, as of April 8, the Federal Reserve Bank of Atlanta’s GDPNow model was projecting growth of 2.3 percent for that quarter.", "There also has not been a single year when growth was 4 percent or more for the full 12 months, as Trump promised as a presidential candidate. GDP growth was 2.9 percent higher in 2018 than it was in 2017, and it was 2.2 percent higher in 2017 than it was in 2016.", "Even the president has acknowledged that annual growth has not reached 4 percent, which he blamed on officials at the Federal Reserve Bank.", "“The world is slowing, but we’re not slowing, and frankly if we didn’t have somebody that would raise interest rates and do quantitative tightening, we would’ve been at over 4 instead of at 3.1,” Trump said in a Fox Business interview that aired March 22.", "But his claim of 3.1 percent annual growth is also spin, as we’ve written before.", "Conway is right about the unemployment rate. As of March, the rate was 3.8 percent — down from 4.7 percent when Trump took office, according to the Bureau of Labor Statistics.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]