["EMILY’s List, one of the 100 largest overall donors to federal elections over the past two decades, according to the Center for Responsive Politics, has set its sights on the race for an open U.S. Senate seat in Wisconsin.\n\nThe group -- whose acronym stands for \"Early Money Is Like Yeast\" -- has raised $8.39 million in the 2011-2012 election cycle alone to elect pro-choice Democratic women to office.\n\nFounded in 1985, the group takes credit for helping elect 16 women to the U.S. Senate and 86 women, including Wisconsin’s Tammy Baldwin, to the U.S. House of Representatives.\n\nEMILY’s List is backing Baldwin’s run for the Senate seat that is being vacated in 2012 by Wisconsin Democrat Herb Kohl. And it is criticizing the Republican Senate hopefuls, including state Assembly Speaker Jeff Fitzgerald, former U.S. Rep. Mark Neumann and former Gov. Tommy Thompson.\n\nIn a Sept. 19, 2011 blog post, EMILY’s List derided all three GOP contenders as \"far-right, conservative white males.\" It focused criticism on Thompson, who was Wisconsin’s governor from 1987 to 2001 before becoming U.S. health and human services secretary under President George W. Bush.\n\nThe group declared that as governor, Thompson \"pushed such strict laws that abortion providers faced potential life imprisonment and women were forced to cross state lines in order to receive attention for life-threatening issues.\"\n\nStrong words and a strong statement.\n\nThe statement contains two parts. We’ll address them one at a time.\n\nAbortion providers facing prison\n\nIn its blog post, EMILY’s List cited a 1998 Wisconsin law signed by Thompson that banned most partial-birth abortions. The law defined the procedure, performed during the second or third trimester of pregnancy, as one \"in which a person partially vaginally delivers a living child, causes the death of the partially delivered child with the intent to kill the child and then completes the delivery of the child.\"\n\nUnder the law, a partial-birth abortion could be performed to save the life of a woman. But anyone who illegally performed a partial-birth abortion could be convicted of a Class A felony, punishable by life in prison.\n\nThat procedure, long controversial, is rarely used -- a point even pro-choice advocates made when fighting the ban.\n\nAt the time, Thompson was quoted as saying: \"This issue has captured our hearts, for the people of Wisconsin will not stand for a procedure so heartless to occur in our state. This is a matter of humanity. Banning partial birth abortions is simply the right thing to do.''\n\nA federal appeals court struck down the Wisconsin law as unconstitutional in 2001. That court cited a U.S. Supreme Court ruling on a similar Nebraska law, which the high court said put an \"undue burden upon a woman's right to make an abortion decision.\"\n\nThat left Wisconsin among 14 states whose partial-birth ban laws have been blocked by courts and are not in effect, according to the Alan Guttmacher Institute, an independent research organization that analyzes data on population growth and reproductive health.", "The institute doesn’t have statistics on partial-birth abortions, per se, but its latest national figures show that 1.5 percent of abortions in 2006 were done during the late second trimester or the third trimester of pregnancy. In any case, partial-birth abortions make up only a portion of the 1.5 percent of all abortions that are performed later in a pregnancy.\n\nSo, although partial-birth abortions were rarely done, Thompson did --as EMILY’s List claimed -- support a law that subjected partial-birth abortion providers to possible life imprisonment.\n\nWomen forced to leave state\n\nThe second claim made by EMILY’s List was \"women were forced to cross state lines in order to receive attention for life-threatening issues.\"\n\nThe group cited news articles about abortion providers around Wisconsin canceling abortion appointments after a federal judge refused to issue a temporary restraining order to prevent the 1998 partial-birth ban law from going into effect.\n\nThe articles quoted providers as saying that women who had scheduled abortions were forced to reschedule them or to get the procedure done out of state. The Milwaukee Journal Sentinel reported at the time that abortion providers throughout Wisconsin put all abortion procedures on hold for a few days as they waited for legal questions about the law to be sorted out.\n\nEMILY’s List did not provide us evidence to show that any women left Wisconsin \"to receive attention for life-threatening issues.\"\n\nThe group’s spokeswoman, Jess McIntosh, said in an email: \"The abortion providers who stopped working told dozens of prospective patients who needed to be seen immediately that they had to travel. Assuming not a single one did that and went on to have the procedure just isn't plausible.\"\n\nIt’s also not likely, however, that all or even most females who were seeking an abortion at the time faced a life-threatening situation.\n\nAsked about the EMILY’s statement, Thompson campaign spokesman Darrin Schmitz said: \"Gov. Thompson is proud of his pro-life record and defense of the unborn.\"\n\nOur conclusion\n\nIn support of Baldwin’s Senate bid, EMILY’s List said Thompson had \"pushed such strict laws that abortion providers faced potential life imprisonment and women were forced to cross state lines in order to receive attention for life-threatening issues.\"\n\nA partial-birth abortion ban that Thompson signed into law as Wisconsin’s governor did contain the life imprisonment provision.\n\nThe law also caused many abortion providers, at least for a few days, to stop performing abortions. That means it was possible some Wisconsin women had to leave the state in order to get an abortion. But there is no proof, as EMILY’s List claimed, that women were forced to leave the state \"to receive attention for life-threatening issues.\"\n\nWe rate the EMILY’s List statement Half True.", "EMILY’s List, \"As Tommy Thompson jumps into Wisconsin Senate race, EMILY’s List asks: Who’s the most conservative of them all?,\" Sept. 19, 2011\n\nEmail interview, EMILY’s List spokeswoman Jess McIntosh, Sept. 28, 2011\n\nEmail interview, Tommy Thompson campaign spokesman Darrin Schmitz, Sept. 28, 2011\n\nInterview, Pro-Life Wisconsin Director of Legislation Matt Sande, Sept. 23 and 28, 2011\n\nInterview and email interview, Planned Parenthood of Wisconsin spokesman Jennifer Lewis, Sept. 23, 2011\n\nWisconsin Legislative Reference Bureau, \"Wisconsin’s partial-birth abortion law,\" June 1998\n\nCapital Times, \"Gov signs partial abortion law,\" April 29, 1998\n\nMilwaukee Journal Sentinel, \"State law not needed,\" April 28, 2007\n\nMilwaukee Journal Sentinel, \"State abortions on hold,\" May 15, 1998\n\nWisconsin State Journal, \"Patients ‘absolutely stunned’ ruling means women who want an abortion must wait or travel,\" May 15, 1998\n\nCapital Times, \"Docs fear felony charges, halt abortions statewide,\" May 14, 1998\n\nCenter for Responsive Politics, EMILY’s List spending by cycle\n\nCenter for Responsive Politics, EMILY’s List listing\n\nCenter for Responsive Politics, Women Vote! 2010 election cycle\n\nInterview, Center for Responsive Politics spokesman Michael Beckel, Sept. 30, 2011\n\nInterview, Department of Health Services staff member Laura Ninneman, Sept. 30, 2011\n\nAlan Guttmacher Institute, \"Bans on ‘partial-birth’ abortion,\" Sept. 1, 2011\n\nAlan Guttmacher Institute, \"Facts on induced abortion in the United States,\" August 2011", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]