["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The truth can be difficult.\n\nSo difficult that even as Gov. Chris Christie said Republican presidential nominee Mitt Romney would \"tell us the hard truths,\" Christie himself slid into misleading territory.\n\n\"Mitt Romney will tell us the hard truths we need to hear to end the debacle of putting the world’s greatest health care system in the hands of federal bureaucrats and putting those bureaucrats between an American citizen and her doctor,\" Christie said during his keynote address Tuesday night at the Republican National Convention in Tampa, Fla.\n\nIn his capacity as a top Romney surrogate, Christie has previously criticized the health care reform passed by President Barack Obama, repeating the thoroughly debunked Republican talking point that the law is \"a government takeover of health care.\"\n\nHere, we decided to check Christie’s statement that the law, formally called the Patient Protection and Affordable Care Act -- or as some call it, Obamacare -- puts federal \"bureaucrats between an American citizen and her doctor.\" (In a separate fact-check, we evaluated Christie’s claim that the United States has \"the world’s greatest health care system.\")\n\nPolitiFact National recently fact-checked a nearly identical statement from Romney and rated it False. Romney said that \"Obamacare puts the federal government between you and your doctor.\"\n\nPolitiFact found Romney’s claim overstated the level of government control under the new law, which keeps intact the private-sector delivery of health care.\n\nThe law requires insurance plans to carry a minimum benefits package and sets up virtual exchanges where individuals can purchase insurance. The law also creates incentives and penalties to promote better care.\n\nBut none of that prevents doctors and patients from making healthcare decisions together, as they do now.\n\nAnd while some doctors are critical of the law, the leading physician advocacy group, the American Medical Association, supports the reform.\n\nThe group’s president, Jeremy Lazarus, said in a June 28 news release after the U.S. Supreme Court upheld the Affordable Care Act that the law \"simplifies administrative burdens, including streamlining insurance claims, so physicians and their staff can spend more time with patients and less time on paperwork.\"\n\nOther physician advocacy groups have also expressed support for the law. But, as PolitiFact noted, there are concerns among specialists about the legislation’s impact, specifically in relation to the Medicare program.\n\nMany opponents of the law have said the 15-member Independent Payment Advisory Board or IPAB  -- which will recommend ways to prevent Medicare’s spending growth from exceeding certain targets -- will lead to health care rationing.\n\nBut the board is specifically forbidden from submitting \"any recommendation to ration health care.\" Though it can decrease government payments to health care providers for services and recommend ways to cut wasteful spending.\n\nIn a March fact-check, U.S. Senate hopeful Joe Kyrillos, whom Christie has endorsed, pointed, in part, to IPAB to support his claim that under the health care law \"the patient-doctor relationship will be eliminated.\" That statement rated a Pants on Fire on the Truth-O-Meter.  \n\nOur ruling\n\nChristie said Romney will be able to tell the hard truths necessary to end the debacle of putting federal \"bureaucrats between an American citizen and her doctor.\"\n\nWe found no solid evidence to support Christie’s sweeping claim, which overreaches on the role of the federal government under the new law.\n\nWith the reform, the private health care delivery system remains in place. While there are significant changes to the health insurance market and incentives and penalties to promote better care, that doesn’t mean the government is inserting itself in between doctors and patients.\n\nWe rate this statement False.\n\nTo comment on this ruling, go to NJ.com.", "https://www.sharethefacts.co/share/53b2a47e-a962-45e1-adcf-140275b44bec", "C-SPAN, 2012 Republican National Convention, Gov. Chris Christie (R-NJ), Aug. 28, 2012\n\nPolitiFact, Health law puts government in between patients and doctors, Mitt Romney says, July 9, 2012\n\nPolitiFact New Jersey, Senate hopeful claims Obama administration’s health care law eliminates doctor-patient relationship, March 26, 2012\n\nPolitiFact, John Raese says health care law forces patients to go to a bureaucrat before a doctor, Oct. 19, 2010\n\nPolitiFact New Jersey, Chris Christie slams health care reform as \"a government takeover of health care,\" Oct. 23, 2011\n\nAmerican Medical Association, AMA: Supreme Court Decision Protects Much-Needed Health Insurance Coverage for Millions of Americans, June 28, 2012\n\nPolitiFact, PolitiFact's Lie of the Year: 'A government takeover of health care', Dec. 16, 2010\n\nFactCheck.org, Romney, Obama Uphold Health Care Falsehoods, June 28, 2012\n\nPolitiFact New Jersey, Scott Garrett claims Affordable Care Act cuts Medicare funding, creates \"rationing board\", Aug. 3, 2012", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]