["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Former Georgia Secretary of State and U.S. Senate candidate Karen Handel has started an “Only in Washington” website highlighting government waste. Handel posted this item on Aug. 7, 2013.", "The race to fill retiring U.S. Sen. Saxby Chambliss’ seat is in full swing with candidates on both sides of the aisle jockeying for early position among their competitors. A common theme, particularly among the GOP candidates, has been the need to rein in wasteful government spending.", "Former Georgia Secretary of State Karen Handel has taken this topic to another level. Handel began a daily blog, titled \"Only in Washington,\" detailing alleged wastefulness by the federal government.", "Handel is planning to chronicle \"42 ridiculous things that happen only in Washington,\" and this week she reached the halfway point. PolitiFact Georgia perused the 20 or so completed entries and found some to be quite interesting.", "For example, Day 8’s item: \"Only in Washington would politicians spend $27 million to teach Moroccans how to make pottery,\" Handel said. \"While Morocco is no doubt a lovely place, we have families in Georgia that are being hurt by high taxes fueling out of control spending … What’s worse is that the program was deemed a failure …,\" she continued.", "Almost $30 million for pottery classes in any country sounded outrageous. We decided to dig a little deeper to determine whether these costs were accurate.", "A press release accompanying each day’s item includes sources that Handel’s team has used to make the statements. For the Day 8 item, the sources included a couple of news stories about the spending that Handel’s spokesman provided. The claim has been repeated by politicos before, including conservative commentator Bill O'Reilly.", "Earlier this year, PolitiFact Wisconsin looked into this claim as a portion of a three-part statement made by a congressman from that state about government spending. The congressman was found to be incorrect for overstating this portion of his claim about the pottery class spending.", "Much of the background about this claim originated from a similar aggregation of alleged wasteful federal government spending done by U.S. Sen. Tom Coburn. Each year, the Republican senator from Oklahoma releases an oversight report of \"unnecessary, duplicative and low-priority projects spread throughout the federal government\" in a document called the Wastebook.", "Coburn’s Wastebook 2012 highlights the pottery classes as an example of wasteful spending, but notes that only part of the $27 million of a U.S. Agency for International Development (USAID) project went toward the classes.", "In 2009, USAID began a $30 million, four-year plan to help increase the economic competitiveness of Morocco. The plan included five projects, with the Morocco Economic Competitive Project accounting for $27 million, or 90 percent of the overall plan. The Competitive Project, scheduled to run through Sept. 30, 2013, initially included a provision for a $7 million, one-year extension. But because of anticipated budget cuts, a change in mission strategy, complications with the task order and poor implementation of some activities, it is unlikely the project will be extended, according to a December 2011 audit report by a federal inspector general.", "The initial goals of the project were to improve the country's business climate, work on ways to use water sustainably for agricultural growth and strengthen workforce development. A key part of the project included training Moroccans to create pottery to sell domestically as well as internationally.", "But the pottery program was riddled with problems, the audit found. For example, a translator hired to translate the instructions from an English-speaking pottery trainer to Arabic-speaking attendees was not fluent in English, which resulted in communication breakdowns. Also, some of the materials used by the pottery trainer were unavailable in Morocco, and participants were unable to replicate the projects. The pottery trainer was forgetful.", "Ultimately, the audit found that the pottery portion of the competitiveness project was poorly implemented, had limited impact and its intended focus on women and youths was not fulfilled.", "In a November 2011 response letter, USAID/Morocco's mission director characterized the pottery training as a \"minor activity\" within the competitiveness project. The pottery training portion of the project represented only one part of the project’s engagement in the country’s pottery sector. In fiscal 2011, that component accounted for 8 percent of annual project spending, the mission director wrote.", "So is Handel’s claim correct?", "The former Georgia secretary of state who’s now a U.S. Senate candidate said that the federal government spent $27 million teaching Moroccans how to make pottery. This claim has been a popular touchstone for conservatives looking to shine a light on government waste.", "But a closer look at the facts shows that the $27 million was for an entire economic development program in Morocco, of which the pottery training was only a fraction of the cost -- about 8 percent of the total program. Some may still consider that amount, $2.2 million, a large expense for pottery training and promotion, but it is not close to the $27 million that Handel claimed.", "Her overall point that the program was a failure is supported by an inspector general’s audit that found that the pottery training was mismanaged, poorly organized and ineffective.", "Her statement contains an element of truth but overstates the cost and ignores critical facts that would give a different impression.", "We rated Handel’s claim Mostly False.", "Karen Handel’s \"Only in Washington, D.C.\" blog", "ZPolitics, \"Only in Washington: Day 8,\" posted Aug. 7, 2013", "PolitiFact Wisconsin, \"Uncle Sam pays for free cell phones, pottery in Morocco, and a watermelon queen’s travels, U.S. Rep. Sean Duffy says, March 10, 2013", "Office of Inspector General, \"Audit of USAID:Morocco’s Economic Competitiveness Project,\" published Dec. 15, 2011", "U.S. Sen. Tom Coburn, \"Wastebook 2012,\" published October 2012", "CNS News, \"U.S. spent $27 million on ‘ineffective’ pottery classes in Morocco,\" Elizabeth Harrington, Oct. 18, 2012", "The Fiscal Times, \"12 incredible examples of government waste this year\"", "Fox News, \"The O’Reilly Factor\": \"Stupid government spending,\" March 12, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]