["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Newark Mayor Cory Booker said in a recent radio interview that one of the nation’s problems is \"sedentary agitation\": Americans get upset, but don’t do anything it.\n\nThe Democrat, further describing his point, told NPR host Michel Martin, \"I worry that we've gotten to the point in our history, and we see this with us involved in two wars, but yet for the first time ever we've gotten tax breaks during wartime. It's never happened in the history of our nation. But we seem to be expecting more but willing to sacrifice less.\"\n\nHave taxes ever been cut during wartime?\n\nPolitiFact New Jersey found taxes have generally increased during war, but there are exceptions -- most notably in the last decade.\n\nThe mayor’s spokeswoman said Booker was \"referring to the tax cuts that were enacted during the tenure of President [George W.] Bush,\" specifically reductions in the federal income tax rate.\n\nIn summer 2001, Bush, a Republican, lowered federal income tax rates and enacted other tax breaks. In 2003, amid wars in Iraq and Afghanistan, Bush signed legislation that sped up the timeline for when those cuts took effect.  \n\nSo, taxes have been cut during wartime recently, but what about historically?\n\nThe national PolitiFact site researched a similar issue two years ago. New York Times columnist Paul Krugman said \"if you want to talk firsts for Bush, this was the first time in American history that a president took us into a war and cut taxes.\"  \n\nLet’s review that article.\n\nPolitiFact started with the Civil War and found that then, as well as during World Wars I and II, taxes increased.\n\nCongress hasn’t officially declared war since World War II, but PolitiFact also looked at taxes during the wars in Korea, Vietnam, the Persian Gulf and Iraq.  \n\nDuring those wars, taxes were cut only once: President John F. Kennedy lowered the income tax rate in a bill that took effect in 1964. But experts dismissed the Kennedy tax cut because it was passed before the conflict in Vietnam seriously escalated -- and when the war intensified, taxes increased.\n\nPolitiFact also noted that in 2009 President Barack Obama signed the economic stimulus package, a bill with hundreds of billions of dollars in tax breaks. But Krugman said Bush was the first president that \"took us into war\" and cut taxes, whereas Obama inherited the wars in Iraq and Afghanistan. Krugman’s statement was rated Mostly True.\n\nWe need to note two differences between what Krugman said and Booker’s statement.\n\nFirst, Krugman made his statement in 2009, before the Bush tax cuts were extended under Obama. And second, Booker did not make the distinction, as Krugman did, that Bush was the first president to take us into war and cut taxes.\n\nSeveral experts we spoke with argued that in extending the Bush tax cuts, Obama maintained the status quo.\n\n\"If a tax rate is scheduled to go up and you don’t allow it to rise, is that a tax cut or the avoidance of a tax increase? I consider it the extension of current law,\" said Scott Hodge, president of the Tax Foundation, a pro-business group.\n\nAs for the stimulus plan, some experts argued that the tax breaks included in the package differ from the Bush tax cuts because of how they worked or because they intended to jumpstart a weak economy.\n\nBut, Roberton Williams, a senior fellow at the nonpartisan Urban Institute-Brookings Institution Tax Policy Center, said they’re still tax cuts\n\n\"I’m of the opinion that if it is in the tax system, and if it raises or lowers your taxes, it is either a tax cut or a tax increase,\" he said.\n\nBut the measures enacted by Obama came during the same wartime -- the \"war on terrorism\" -- when Bush first reduced taxes.\n\nLet’s recap.\n\nBooker claimed that \"for the first time ever we've gotten tax breaks during wartime.\"\n\nThe national PolitiFact website rated a claim that Bush was the first president to lead us into war and cut taxes Mostly True. Booker’s spokeswoman told us the mayor was referring to the Bush tax cuts.\n\nThough Booker didn’t make the same distinction Krugman did regarding Bush, we find his overall point sound. \n\nTaxes technically were cut in 1964. But as the war in Vietnam escalated, taxes increased.\n\nSince the start of the \"war of terrorism,\" taxes have only gone down -- first under Bush, then under Obama.\n\nWe rate Booker’s statement Mostly True.", "To comment on this ruling, go to NJ.com.\n\nCORRECTION: This item has been updated to reflect that the economic stimulus package signed by President Barack Obama included hundreds of billions of dollars in tax breaks, not hundreds of millions.", "NPR’s \"Tell Me More,\" interview with Cory Booker, July 6, 2011\n\nPolitiFact, Krugman says Bush was first president to lead country into war and cut taxes, Nov. 29, 2009\n\nTax Foundation, \"U.S. Federal Individual Income Tax Rates History, 1913-2009\"\n\nThe Library of Congress, \"History of the US Income Tax\"\n\nU.S. Department of the Treasury, \"History of the U.S. Tax System\"\n\nRecovery.gov, The Recovery Act\n\nEmail interview with Anne Torres, spokeswoman for Newark Mayor Cory Booker, July 8, 2011\n\nPhone and email interview with Scott Hodge, president of the Tax Foundation, July 11 & 12 , 2011\n\nEmail interview with Dean Baker, co-director of the Center for Economic and Policy Research, July 11, 2011\n\nInterview with John Irons, research and policy director at Economic Policy Institute, July 12, 2011\n\nInterview with Chris Edwards, director of tax policy studies at the Cato Institute, July 12, 2011\n\nInterview with Roberton Williams, senior fellow at the Urban Institute-Brookings Institution Tax Policy Center, July 12, 2011\n\nU.S. Government Printing Office, Economic Growth and Tax Relief Reconciliation Act of 2001", "U.S. Government Printing Office, Jobs and Growth Tax Relief Reconciliation Act of 2003\n\nThe White House, Fact Sheet on the Framework Agreement on Middle Class Tax Cuts and Unemployment Insurance, Dec. 7, 2010\n\nLos Angeles Times, Bush Breaks With 140 Years of History in Plan for Wartime Tax Cut, Jan. 13, 2003\n\nThe Urban Institute, Bush-Era Tax Cuts Depart From History of America War Finance, April 30, 2008\n\nCommonDreams.org, War and Tax Cuts, July 7, 2004", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]