["About this rating", "It's true that a scene featuring Donald Trump did not appear in the CBC's 2019 Christmas season broadcast of \"Home Alone 2.\"", "The decision to omit Donald Trump's scene in \"Home Alone 2\" was not made December 2019. This version of \"Home Alone 2\" has been airing on the CBC since 2014. The network said that the scene was cut for time, not political reasons.", "During the Christmas holiday in December 2019, many people took to social media to complain that U.S. President Donald Trump's cameo in the movie \"Home Alone 2\" had been omitted from its broadcast on the CBC:", "This edited version of \"Home Alone 2\" was presented as if it were the result of \"Trump Derangement Syndrome.\" President Trump's son, Don Jr., called the CBC's decision to omit Trump's scene \"pathetic.\"", "While many of Trump's supporters accused the CBC of \"censorship,\" or political bias for editing Trump out of \"Home Alone 2,\" the network offered a much more benign explanation: The movie was simply edited for time. Moreover, the edits made to this movie were done in 2014, long before Trump announced that he was launching his presidential campaign.", "When a movie makes its way from the big screen to the small screen, it frequently has to be re-edited. Scenes may be removed if they are not suitable for a television audience, or if the network has to make room for commercials. That's why many television movies are preceded with a disclaimer, stating: \"This film has been modified from its original version. It has been formatted to fit this screen and edited for content.\"", "The CBC said in a statement that the version of \"Home Alone 2\" that aired over the Christmas holiday in 2019 was edited for time. The network added that these edits were done in 2014:", "CBC spokesperson Chuck Thompson said:", "\"As is often the case with feature films adapted for television, Home Alone 2 was edited for time. The scene with Donald Trump was one of several that were cut from the movie as none of them were integral to the plot. These edits were done in 2014, when we first acquired the film and before Mr. Trump was elected president.\"", "Thompson said that a total of about eight minutes were cut from the original theatrical release of \"Home Alone 2.\" Trump's scene was one of many that had to be cut or shortened in order to make room for commercials and to fit the CBC's allotted time slot for the movie.", "You can view Trump's cameo in \"Home Alone 2\" below:", "In short, while it's true that Trump's cameo in \"Home Alone 2\" did not appear in the version of the movie that aired on the CBC in December 2019, this doesn't appear to be an example of \"Trump Derangement Syndrome.\" Rather, when CBC acquired the rights to the film in 2014 (before Trump announced his presidency), the company edited the film for time.", "Davis, Brandon.   \"‘Fox News Host Slams Canadian Network for Cutting Home Alone 2 Trump Cameo.\"     CombicBook.com.   26 December 2019.", "CBC.   \"CBC Edit of Trump Scene From Home Alone 2 Was Done in 2014.\"\r\n    26 December 2019.", "Breuninger, Kevin and Sarah Whitten.   \"‘Home Alone 2’ TV Version Was Edited Years Before Trump’s Election, CBC Says After Right-Wing Outrage.\"\r\n    NBC News.   26 December 2019.", "Roberto, Melissa.   \"CBC Removes Donald Trump's Scene From 'Home Alone 2' Broadcast: Report.\"\r\n    Fox News.   26 December 2019.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]