["About this rating", "Cuomo of New York is scheduled to receive an aggregate $71,000 pay raise that would currently make him the highest-paid governor in the U.S.", "Cuomo was only one of several high-level state officials who received pay increases phased in over three years, which would put them well over $200K in annual salary; the raises were openly recommended by a state compensation board in 2018 and passed by the state legislature in 2019.", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "During the coronavirus pandemic of spring 2020, Gov. Andrew Cuomo of New York remained at the top of the news cycle for two reasons: His state saw by far the largest number of COVID-19 cases and deaths, and his daily press briefings were a staple of television news coverage of the crisis. The New York governor was also praised as a model of political leadership during an emergency by those who were highly critical of President Donald Trump and his handling of the U.S. federal response to COVID-19.", "During that period, a meme circulated via social media stating that Cuomo had recently requested and been granted a $71,000 pay raise that made him the highest-paid governor in the U.S., and that this activity had taken place \"while most NYers were sleeping\":", "It was true that Cuomo had been granted a pay raise that would make him (at least temporarily) the highest-paid governor of any state. But that pay adjustment had been recommended and enacted a year earlier (i.e., in 2019, not 2020), the $71,000 increase was phased in across the span of three years (rather than given all at once), and the matter involved multiple recommendations and approvals from state authorities (largely given because the governor's salary not increased since 1999) which were openly publicized and not hidden from New York residents.", "On April 1, 2019, both houses of the New York Legislature (Assembly and Senate) approved a pay hike that would increase Cuomo's compensation from $179,500 to $200,000 in 2019, $225,000 in 2020, and $250,000 in 2021. In terms of base salary, that raise created the potential for Cuomo to become the nation's highest-paid governor in 2020, out-earning Gov. Gavin Newsom of California (assuming that no other state raised its chief executive's pay to a higher level before then).", "The gubernatorial pay hike was one of several salary increases that had been recommended back in December 2018 by the New York State Compensation Committee, which \"after months of research and public hearings,\" advocated substantial pay raises for multiple high-level state officers -- many of whom would, like the governor, would see phased pay increases eventually garnering them well over $200,000 per year:", "A four-member committee has recommended substantial pay raises for members of the state Legislature, the governor, lieutenant governor, state comptroller and state attorney general.", "The New York State Compensation Committee — consisting of current and former New York state and New York City comptrollers — unveiled their recommendations Monday, December 10, 2018, after months of research and public hearings.", "The Compensation Committee recommends that, starting on Jan. 1 of 2019, state legislators will receive an annual salary of $110,000.", "Beginning on Jan. 1, 2020, lawmakers will receive an annual salary of $120,000 and their outside income would be capped at $18,000, which 15 percent of their legislative pay.", "Beginning on Jan. 1, 2021, lawmakers would receive $130,000 a year and their outside income would be capped at $19,500, which is 15 percent of their legislative pay. This would be the long-term compensation for state legislators moving forward.", "The Compensation Committee is also recommending pay increases for the governor, who would receive an annual salary of $250,000 after a three-year phase-in; the lieutenant governor, who would receive $220,000 after a three-year phase-in; and an annual salary of $220,000 for both the state comptroller and state attorney general after a phase-in period.", "Executive branch commissioners and department heads would also receive pay raises under the plan, with Tier A commissioners making $220,000 after a three-year phase-in.", "As the New York Post reported, some legislators \"grumbled that the [pay raise] measure was thrown in at the last minute\" while they were working overtime to pass a state budget, but Cuomo and others defended it by noting that the compensation committee's recommendations had been published and accepted months earlier:", "Because the governor can’t sign off on his own pay hike, the raise required legislative action.", "The state Senate approved the increase at 2:45 a.m. and the Assembly acted a few hours later.", "Some lawmakers grumbled that the measure was thrown in at the last minute, while they were grappling with the new $175.5 billion state budget.", "“The salary adjustments were done last December by the pay commission which publicized and put out a report, which was accepted by the legislature,” Cuomo said. “That was published and discussed in December, so there’s nothing new on that.”", "Assembly Speaker Carl Heastie (D-Bronx) backed up Cuomo.", "“It has a fiscal component to it, so there’s always the realization to do it,” Heastie told reporters. “We felt that all the statewide officials were able to get raises ... the governor and the lieutenant governor’s salaries aren’t fixed by statute, they have to be done by a concurrent resolution between the Assembly and the Senate and that’s the reason why they were done.”", "Gormley, James.   \"Pay Committee Recommends $50,000 Annual Salary Increase for Lawmakers.\"\r\n    Legislative Gazette.   11 December 2018.", "Davis, Dominic-Madori and Marguerite Ward.   \"Here's the Salary of Every Governor in All 50 US States.\"\r\n    Business Insider.   20 April 2020.", "Centers for Disease Control and Prevention.   \"Coronavirus Disease 2019 -- Cases in the U.S.\"\r\n    Accessed 20 May 2020.", "Feis, Aaron.   \"Andrew Cuomo to Become the Highest-Paid Governor in the US.\"\r\n    New York Post.   1 April 2019.", "Hogan, Bernadette.   \"Andrew Cuomo Defends His Huge Pay Raise.\"\r\n    New York Post.   2 April 2019.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]