["The claim was made in a text graphic published on Facebook here on March 3, 2021.", "“NSW, a state with the largest population in Australia, declared the end of Covid-19 pandemic. Without masks, it saw no confirmed cases of Covid-19 for a month,” the Korean-language post reads.", "NSW refers to New South Wales, a state in southeastern Australia that is home to Sydney.", "The claim was also shared on Facebook here and here.", "However, the claim is misleading.", "As of March 8, 2021, NSW has marked 50 consecutive days of no locally transmitted Covid-19 cases.", "The state, however, has recorded several imported cases from overseas in the same time period, according to government figures. For instance, the state recorded 15 new imported cases between March 1 and 7, 2021.", "There are also no credible reports or official statements to suggest NSW declared the pandemic is over.", "The claim that NSW is “without masks” is also misleading.", "According to the state’s latest public health order dated February 26, 2021, residents are required to wear masks under three circumstances: on public transport and at public transport waiting areas; at airports and on commercial domestic flights; in an indoor area of a place of public worship and members of the congregation are singing.", "“You may be fined $200 [Australian dollars] on the spot for not wearing a face mask,” the order reads.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]