["The one-minute, 30-second video was published on Facebook here on January 17, 2021.", "The post, which claims the footage was recorded in Indonesia’s West Nusa Tenggara province, has been shared more than 500 times.", "The post’s Indonesian caption translates to English as: “Happened in West Nusa Tenggara after vaccine injection”.", "The footage has been viewed nearly 50,000 times after it was published alongside similar claims on Facebook here, here and here; on YouTube here and here; and on TikTok here and here.", "The post circulated days after Indonesia began its mass Covid-19 vaccination drive, which kicked off with President Joko Widodo receiving the first shot on January 13, 2021, as AFP reported here.", "The claim in the misleading posts, however, is false.", "Keyword searches on Google found a longer version of the footage published on Facebook here by Pos Kupang, a local media outlet, on January 13, 2021.", "According to the video’s caption, the footage shows a “patient who collapsed during the first Covid-19 vaccine simulation” in East Nusa Tenggara province — not West Nusa Tenggara province, as the misleading posts claim.", "The post’s caption reads: “The simulation was held at the yard of Sasando Building at the East Nusa Tenggara Governor's Office on Wednesday (13/1) morning. It is planned that 15 officials will receive the first vaccine in the province on Thursday.”", "Below is screenshot comparison between the footage in misleading post (L) and the original video (R):", "Media Indonesia also published a report on the vaccine simulation here on January 13, 2021. The report is headlined: “East Nusa Tenggara Provincial Government Holds Covid-19 Vaccination Simulation”.", "An official from Indonesia’s Ministry of Health confirmed to Tempo.co, a local news outlet, that the man fainted as part of a simulation exercise.", "“This is a vaccination simulation. So, it [includes] a simulation on how to handle a person who suddenly faints,” says Siti Nadia Tarmizi, the ministry’s Covid-19 vaccination spokesperson.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]