["By Angelo Fichera", "Posted on March 23, 2018", "Q: Is the firm that built the pedestrian bridge that collapsed in Miami “a female-led construction company,” as claimed in some viral stories?", "A: No. The company is run by six brothers, and 11 of its 92 management employees are females.", "Using the deadly bridge collapse in Miami as an entry point to discuss “things that women shouldn’t do,” as one story puts it, several online posts are claiming that the construction company that built the structurally flawed bridge at the Florida International University is “female-led.” Six people were killed in the March 15 accident.", "“A Female-Led Construction Company Built The Florida Bridge That Collapsed,” reads the headline on the March 19 minuteman-militia.com story, which Facebook users flagged as potentially false. “Though MCM is owned by five brothers, a lot of people one rung down the ladder from them are women,” it says. “Some of the construction workers are even women.”", "Another story appeared on dangerous.com, the website of conservative commentator Milo Yiannapolous, who asserted similar claims in a live Facebook video.", "“The tragic bridge collapse of Florida International University a few days ago, it turns out, has a feminist dimension — because of course it does,” he said in the video shared with his more than 2 million Facebook followers. “It turns out that the company MCM that built this bridge, although it’s owned by men — because of course it is — it’s run by women, including the CEO. Some of the construction workers were even female.”", "The stories — without evidence — leave the false impression that female employees were responsible for the bridge collapse, even though the National Transportation Safety Board has not yet determined an official cause.", "In a statement emailed to FactCheck.org by a company spokesman, MCM President Jorge Munilla said the stories circulating “spewed hate against women and minorities while promoting white supremacy, which we will not tolerate as a company.”", "MCM’s website shows that Munilla and his five brothers run the company, and two other men are on the executive management team.", "MCM does have women in construction management jobs, project executive positions and as department heads, company spokesman Donald Silver said in an email. In all, 11 of the 92 employees in management positions are women, Silver said.", "Silver confirmed that photos published in some of the stories were of actual MCM employees but included captions that “are not accurate.” The photos were taken from the company’s social media pages, which it has since suspended.", "“This was done out of an abundance of caution for the safety of our staff due to a fabricated article making the rounds on junk news sites featuring the photos and names of MCM female employees,” the company told us.", "And no one holds the title of CEO, Silver said. (MCM’s partner in the project — FIGG Bridge Engineers, which specializes in bridge design — is run by President and CEO Linda Figg.)", "In an apparent attempt to connect women executives to the accident, the stories use a legitimate quote from Leonor Flores, a female project executive for MCM, that was published in a story on Florida International University’s website before the collapse.", "Flores, who is a university alumna, spoke of sharing her line of work with her 12-year-old daughter as they watched the installation of the 950-ton pedestrian bridge, which was intended to connect the university’s campus and the city of Sweetwater.", "“It’s very important for me as a woman and an engineer to be able to promote that to my daughter because I think women have a different perspective,” Flores said. “We’re able to put in an artistic touch and we’re able to build too.”", "The Minuteman Militia story mocked Flores’ quote, saying it shows she wants only to make bridges “look pretty. Nothing else matters.”", "There’s no evidence that Flores was involved in the university’s project. FIU updated its story after the bridge collapse, and it now says, “To clarify, Leonor Flores did not work on the FIU-Sweetwater UniversityCity Bridge project in any capacity.”", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to help identify and label false stories flagged by readers on the social media network.", "“A Female-Led Construction Company Built The Florida Bridge That Collapsed.” minuteman-militia.com. 19 Mar 2018.", "“Board of Directors.” Munilla Construction Management. Accessed 21 Mar 2018.", "Kiah, Clara-Meretan. “Community gathers to watch 950-ton bridge move across Southwest 8th Street.” Florida International University. 14 Mar 2018.", "Knight, Dillon. “Female-Led Construction Company Was Responsible for Deadly Florida Bridge Collapse.” dangerous.com. 19 Mar 2018.", "“Linda A. Figg.” State of Alabama Engineering Hall of Fame. Accessed 22 Mar 2018.", "National Transportation Safety Board. “NTSB Investigation of Bridge Collapse Continues.” 21 Mar 2018.", "Silver, Donald. Spokesman, Munilla Construction Management. Emails sent to FactCheck.org. 22 Mar 2018.", "Viglucci, Andres. “‘Instant’ bridge aims to make a dangerous crossing safer for thousands of students.” The Miami Herald. 10 Mar 2018.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]