["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "In her book\n\nGoing Rogue\n\n, Sarah Palin laments her campaign not hitting harder on Barack Obama's relationship with ACORN.", "\"On the campaign trail many had been hesitant to talk about legitimate fears that Obama's past comments and associations with anti-capitalist radicals would influence his economic policy,\" Palin wrote. \"The press gave the impression it was the wrong thing to do. I was 'going rogue\" when I answered reporters' questions about candidate Obama's associations and pals. I wish we had talked more about them, and about Obama's close relationship with ACORN, the voter-fraud specialists. But we did not elaborate on any of that during the campaign.\"", "That didn't jibe with our recollections from covering the campaign. So we did a quick search of our e-mail inbox to refresh our memory. Here's some -- but not all - of what we got from the McCain-Palin campaign:", "Oct. 10, 2008\n\n: MEMO: Barack Obama & ACORN", "This is a memo from the McCain-Palin campaign that begins, \"Today, the McCain campaign outlined the intimate and longstanding relationship between Barack Obama and the Association of Community Organizers for Reform Now (ACORN). Given ACORN’s recent efforts to engage in voter fraud and to disrupt our political system, Obama’s affiliation with this group raises serious questions about his judgment and ability to lead this nation.\" It goes on to highlight Obama's efforts directing Project Vote in 1992 as well as his work as a lawyer handling a case for ACORN. (We took a look at a few of the claims from Republicans about Obama's alleged ties to ACORN and found\n\nsome were more legitimate than others\n\n.)", "Oct. 10, 2008\n\n: McCain-Palin 2008 Launches New\n\nWeb Ad\n\n: \"ACORN\"", "The ad describes Obama as a man with vast ambition whose \"ties to ACORN run long and deep. He taught classes for ACORN. They even endorsed him for president.\" The ad also accuses the Obama campaign of paying more than $800,000 to an ACORN front for get-out-the-vote efforts. \"Too risky for America,\" the ad concludes.", "Oct. 11, 2008\n\n: All: Please see statement by McCain-Palin spokesman Michael Goldfarb on Barack Obama and ACORN", "In it, Goldfarb responds to a statement from the Obama campaign the previous week that \"Barack Obama never organized with ACORN.\" Goldfarb repeats many of the same ties alleged before, adding \"he and unrepentant terrorist William Ayers funneled nearly $200,000 (to ACORN) from the Woods Foundation.\" Says Goldfarb: \"It is clear that Barack Obama is not being honest about his association with ACORN, just as he has not been honest about his association with unrepentant terrorist William Ayers.\"", "Oct. 15, 2008\n\n: Subject: Obama Misleads on ACORN Tonight", "This is the campaign's \"fact-check\" based on a statement made by Obama during a debate with McCain, that \"The only involvement I've had with ACORN is, I represented them alongside the US justice department in making Illinois implement a motor voter law that helped people get registered at DMVs.\" The response, sent by Brian Rogers of the McCain campaign, includes five points highlighting the \"full extent\" of Obama's relationship with ACORN.", "Oct. 16, 2008\n\n: All: Please see statement by campaign manager Rick Davis on FBI investigation of ACORN.", "An excerpt from the statement:", "\"To date, in public announcements including last night's debate, Barack Obama has attempted to conceal and distort his and his campaign's relationship with a group that is currently engaging in systematic voter fraud. Barack Obama's campaign must fully disclose the true nature of his association with ACORN, including:", "·\n\nThe total disclosure of all funds, including $832,000 from Barack Obama's campaign to ACORN and ACORN affiliations like Citizens Services, Inc.\n\n\n·\n\nAny and all information the Obama campaign has related to ACORN's database of registered voters compiled during this election cycle.\n\n\n·\n\nThe total disclosure of coordination between Barack Obama's campaign, ACORN, and ACORN affiliations over the entirety of this election cycle.\n\n\n·\n\nThe truth behind ACORN's hiring of get-out-the-vote workers on Barack Obama's behalf in Ohio during this election cycle.\"", "Oct. 17, 2008:\n\nAll: Please join us for a conference call at 11:30am ET with campaign manager Rick Davis to discuss Barack Obama's association with ACORN and the nationwide investigation of ACORN's practices.", "Oct. 30, 2008\n\n: Press release: McCain-Palin 2008 will hold a press conference call with Rick Davis, McCain-Palin 2008 Campaign Manager, to discuss the true extent of Barack Obama's relationship with ACORN and yesterday's sworn testimony of a former ACORN employee.", "In addition to these e-mails, we note that McCain three times raised the issue of Obama's alleged ties to ACORN during the\n\nthird presidential debate\n\non Oct. 15.", "Said McCain: \"We need to know the full extent of Sen. Obama's relationship with ACORN, who is now on the verge of maybe perpetrating one of the greatest frauds in voter history in this country, maybe destroying the fabric of democracy. The same front outfit organization that your campaign gave $832,000 for 'lighting and site selection.' So all of these things need to be examined, of course.\"\n\n\nAnd then later: \"Well, again, while you were on the board of the Woods Foundation, you and Mr. Ayers, together, you sent $230,000 to ACORN.\"", "And lastly: \"All of the details need to be known about Sen. Obama's relationship with them and with ACORN and the American people will make a judgment.\"", "In her book, Palin says she wishes the campaign had talked more about \"Obama's close relationship with ACORN. ... But we did not elaborate on any of that during the campaign.\"", "So let's recap. The McCain-Palin campaign: sent out a memo to the media detailing Obama's alleged ties to ACORN; launched a Web ad about it; released several statements from campaign staffers; sent out \"fact-checks\" about it after a debate; held media conference calls with campaign staff to discuss it; issued several press releases about it; and McCain mentioned the issue several times during a debate.", "That sounds like a lot of elaborating to us. We rule Palin's statement False.", "Media Matters,\n\n\"Rogue Facts: Media Matters' ongoing list of falsehoods in Palin's memoir,\"\n\nNov. 15, 2009", "New York Times,\n\n\"On Obama, Acorn and Voter Registration,\"\n\nby Stephanie Strom, Oct. 10, 2008", "New York Times,\n\nTranscript of the third presidential debate between Senators John McCain and Barack Obama in Hempstead\n\n, N.Y, Oct. 15, 2008", "YouTube,\n\nMcCain-Palin 2008 Web ad: \"ACORN,\"\n\nOct. 10, 2008", "John McCain campaign Web site,\n\nCampaign Memo on ACORN\n\n, Oct. 10, 2008", "ACORN Web site, The Truth about ACORN and Barack Obama, accessed Oct. 14, 2008", "Project Vote Web site\n\n, accessed Oct. 14, 2008", "Chicago magazine,\n\nVote of Confidence\n\n, January 1993", "PolitiFact,\n\n\"Sorting out the truth on Obama, ACORN,\"\n\nby Angie Drobnic Holan, Oct. 17, 2008", "Chicago Sun Times,\n\nStrong, silent type; Obama's legal career: He was 'smart, innovative, relentless,' and he mostly let other lawyers do the talking\n\n, Dec. 17, 2007", "Los Angeles Times,\n\nObama's law days effective but brief\n\n, April 6, 2008", "King County Prosecuting Attorney Dan Satterberg,\n\nstatement on ACORN\n\n, July 26, 2007", "The Associated Press,\n\n7 charged with voter registration fraud\n\n, July 26, 2007", "Federal Election Commission, Obama campaign expenditure reports, accessed via CQ Moneyline on Oct. 17, 2008", "Crain's Chicago Business, \"40 Under Forty,\" Sept. 27, 1993, accessed via Nexis", "ACORN v. Edgar, No. 95 C 174, No. 95 C 281, No. 95 C 433, No. 95 C 1387, UNITED STATES DISTRICT COURT FOR THE NORTHERN DISTRICT OF ILLINOIS, EASTERN DIVISION, 880 F. Supp. 1215; 1995 U.S. Dist. LEXIS 4007, March 28, 1995, Decided , March 31, 1995", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]