["About this rating", "Around 1999, diver Franck Goddio uncovered ruins of a lost city, Heracleion.", "The discovery was not made in 2017.", "On 8 October 2017, TheDailyBerries.com published an article about a purportedly recent discovery of a \n\"lost city\" called Heracleion:", "Off the coast of Egypt divers have discovered something that was thought to be lost a long time ago. It was said that the ancient city of Heracleion was lost under the sea for good. Well 1200 years later, off the bay of Aboukir, this ancient city has finally been discovered. The city dates back to the 6th century B.C. and holds some of the most beautiful artifacts you could imagine. Things like grand statues of gods and goddesses standing well over 15 feet tall and carved out of red granite, treasures of gold and rare stones, elaborate temples and enormous tablets. This find is enormous in the historical preservation community and has been commissioned by museums around the world. Take a look at this incredible city found underwater", "[...]", "The divers and their team of researchers carefully lift the statue to the surface in order to preserve and protect this piece of history. It will reside safely in a museum.", "Garcinia Cambogia – Garcinia Cambogia Save is the leading Garcinia Cambogia distributor in the country and has helped over 100,000 successfully lose weight.", "Egypt's lost, sunken city of Thonis-Heracleion (dubbed \"Atlantis\" by some publications) is thought to have been subsumed by the Mediterranean over time due to soil erosion and rising sea levels, and all but forgotten for several hundred years after that — until its rediscovery in 2000. Since then, it has been discussed, written about, and featured in museum collections. A non sequitur about \"Garcinia Cambogia\", which appears to be a weight-loss pill, suggests that TheDailyBerries.com's purpose is not to share information about this purported lost city, but instead to simply trick people into being exposed to advertisements for a dubious supplement.", "The claim cites an September 2017 post by Buzznicked.com, which again references a \"very recent\" find (also includes a mention of \"Garcinia Cambogia\"):", "Divers Just Made The The Most Unbelievable Discovery In The Ocean", "Off the coast of Egypt divers have discovered something that was thought to be lost a long time ago. It was said that the ancient city of Heracleion was lost under the sea for good. Well 1200 years later, off the bay of Aboukir, this ancient city has finally been discovered.", "Some posts included an image of a diver measuring the leg of a statue, which appears in the July/August 2000 issue of print magazine Ancient Egypt and on the web site of French underwater archaeologist Franck Goddio, who originally rediscovered the sunken city:", "Prior to its discovery in 2000 by the European Institute for Underwater Archaeology (IEASM), directed by Franck Goddio, no trace of Thonis-Heracleion had been found. Its name was almost razed from the memory of mankind, only preserved in ancient classic texts and rare inscriptions found on land by archaeologists. The Greek historian Herodotus (5th century BC) tells us of a great temple that was built where the famous hero Herakles first set foot on to Egypt. He also reports of Helen’s visit to Heracleion with her lover Paris before the Trojan War. More than four centuries after Herodotus’ visit to Egypt, the geographer Strabo observed that the city of Heracleion, which possessed the temple of Herakles, is located straight to the east of Canopus at the mouth of the Canopic branch of the River Nile.", "It is true Thonis-Heracleion was excavated and its submerged ruins uncovered, but was first rediscovered in 2000; the story was repurposed into a clickbait-and-switch in an attempt to sell a questionable weight-loss supplement in 2017.", "Goddio, Franck.   \"Sunken Civilizations.\"\r\n    Franck Goddio, Underwater Archeologist.   Accessed 16 October 2017.", "Page, Thomas.   \"The Secrets Of A Lost Egyptian City Were Underwater.\"\r\n    CNN.   5 May 2016.", "BBC.   \"Spectacular Finds Of Lost City Revealed.\"\r\n    7 June 2001.", "Huffington Post.   \"Heracleion Photos: Lost Egyptian City Revealed After 1,200 Years Under Sea.\"\r\n    29 April 2013.", "Ancient Egypt.   \"Searching For Sunken Cities.\"\r\n    July/August 2000.", "Atlas Obscura.   \"The Lost City Of Heracleion.\"\r\n    Accessed 16 October 2017.", "The Daily Berries.   \"What Scientists Just Found Deep In The Ocean Is Seriously Unbelievable. I’m Still In Shock.\"\r\n    8 October 2017.", "Buzznicked.   \"Divers Just Made [The] Most Unbelievable Discovery In The Ocean.\"\r\n    17 September 2017.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]