["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A baseless conspiracy theory about Wayfair, an online home goods retailer, is spreading widely on social media, claiming the company has been trafficking children through its website. An image being shared on Facebook seems to try to support that theory by connecting Wayfair to Ghislaine Maxwell, who was recently arrested on grounds she helped financier Jeffrey Epstein sexually abuse minors.", "\"Wayfair president of operations Bill Hutcherson with Ghislaine Maxwell a known sex trafficker who was involved with Epstein,\" reads a description of the photo, which shows Maxwell and a man.", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The photo was taken by Getty Images photographer Mark Mainz in December 2003 in New York City. The caption says: \"Socialite Ghislaine Maxwell with an unidentified male companion attends the opening of the Asprey Flagship store on 5th Avenue.\" (See other photos from that night here.)", "Tatler identifies the man as George Bamford, founder of Bamford Watch Department.", "Wayfair doesn’t list a president of operations on its website though there is a \"vice president of operations product innovation\" named Doran Robinson, a different person than the man who appears in the photo with Maxwell. It also lists a chief operating officer named Thomas Netzer. No one named \"Bill Hutcherson\" is listed among Wayfair’s executive leadership team.", "We rate this post Pants on Fire.", "Facebook post, July 12, 2020", "BuzzFeed News, The conspiracy theory about Wayfair spreading fast among lifestyle influencers on Instagram, July 13, 2020", "New York Times, Ghislaine Maxwell tried to hide when the FBI knocked, prosecutors say, July 13, 2020", "Getty Images, Asprey Flagship Store Opening on 5th Avenue, Dec. 8, 2003", "Tatler, Asprey’s New York flagship launch, April 28, 2004", "Bamford Watch Department, visite July 14, 2020", "Wayfair, Executive leadership, visited July 14, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]