["About this rating", "The agricultural industry tests for an invasive insect known as spotted wing drosophila using a solution of water and salt or sugar to force bugs out of potentially infested fruit.", "Experts note that while this method is used by agriculturalists to test for the flying pests, there is no conclusive or published scientific evidence that proves its legitimacy.", "Several now-viral videos posted to Twitter, Facebook, and TikTok in May 2020 showed small insects crawling along the outside of strawberries after the fruit had been soaked in a saltwater solution. Collectively, the videos received hundreds of thousands of views and sparked many questions about the methodology.", "Social media users filled a bowl with water and table salt. Once the salt had dissolved, strawberries were said to have been submerged in the solution for \"about 30 minutes\" after which point small \"worms\" could be seen crawling around the outside of the berry.", "Though it is true that strawberries and other fruit may house small insects and the saltwater method is largely used by the agricultural industry as a way to detect such infestations, entomological experts at Oregon State University told Snopes that there is no scientific evidence that suggests a saltwater solution can, in fact, force pests out from infested berries.", "The insect in question is an invasive flying pest called spotted wing drosophila (SWD), or Drosophila suzukii. Endemic to Asia, SWD was first detected in North America in California in 2008 and has since spread to many regions of the United States where the insects are known to infect fruit crops and berries, according to Michigan State University (MSU). Female flies lay their eggs in fruit where they will ultimately hatch into a delectable habitat prime for larval feeding. If the pest is not controlled through mitigation measures, MSU adds that it is possible fruit may be harvested with larvae inside.", "A male and female SWD. Public Domain", "Despite a lack of published scientific evidence, the saltwater method is one most often employed by commercial growers in order to determine whether an SWD infestation has occurred, but berry lovers of any sort can also use it to detect creepy crawlies.", "\"A backyard gardener can easily open up a suspect fruit and see 3- to 5-millimeter whitish larvae with the naked eye. Larvae will move when exposed to light,\" notes a guide published by Oregon State University (OSU). \"Alternatively, a handful of fruit can be placed in a plastic bag, crushed, mixed with either a salt or vinegar solution, and then closely examined for larvae.\"", "To do so, a salt or brown sugar solution should be prepared at least 24 hours before use to ensure that the salt or sugar dissolves entirely. Add to 1 gallon of water a full cup of salt, or 2.5 cups of light brown sugar, and shake well — a well-dissolved solution increases the chance of larvae floating to the surface of the solution. Fruit should be crushed and fully submerged in the solution, which will prompt larvae to exit, float to the surface and eventually drown. Either sugar or salt will work, but the former will keep larvae alive longer and allow for a longer period of time to see movement.", "Spotted wing drosophila larvae seen in a strawberry. Hannah Burrack/NC State", "Although the saltwater method is used to detect pest infestations, experts note that it is largely unnecessary as commercial growers conduct rigorous testing to determine whether SWD larvae are present before the fruit is accepted by stores. In fact, most fruit is known to contain small insects otherwise undetected by the human eye. [As in the case of some of the circulated videos, some pests found on strawberries were not SWD but likely small insects that live on the outside of the fruit.]", "\"Such washing with salt would not be necessary under [sic] these circumstances. Strawberries are also quite porous, and I would not want to eat fruit that was soaked or washed in salty water,\" said Bernadine Strik, a berry crops expert with the OSU Extension Service.", "Testing fruit for insects is different than washing it, adds Strik. According to the Centers for Disease Control and Prevention, water alone should suffice. If SWD-infested berries are ingested, they are unlikely to do any harm. Iowa State University Extension and Outreach notes that infested fruit is safe to eat, and ingestion poses no known risk to human health.", "Dreves, Amy, Cave, Adam, Lee, Jana.   \"A Detailed Guide for Testing Fruit for the Presence of Spotted Wing Drosophila Larvae.\"     Oregon State University Extension Catalog.   October 2014.", "Isaacs, Rufus, et al.   \"SWD Management Recommendations for Michigan Blueberry.\"     Michigan State University Extension Catalog.   June 2014.", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]