["About this rating", "On 6 April 2019, the \"Taters Gonna Tate\" website falsely reported that Rep. Alexandria Ocasio-Cortez (D-New York) had proposed a \"nationwide ban\" on motorcycle use in the U.S.:", "Junior Congresswoman Alexandra Ocasio-Cortez has made a lot of waves recently with her Green New Deal nonsense and child-like proposals and speeches.  Well, it’s no different this afternoon as the political pixie announced her intention to draft legislation banning motorcycles from use in the United States of America.", "The Senorita of Socialism threw out all manner of statistics regarding deadly accidents and injuries, relaxed traffic rules and tolls for bikers, as well as a not-so-veiled jab at a core demographic of President Trump’s supporters :", "Ocasio-Cortez, who at 29 is the youngest woman ever to serve in Congress, is the frequent target of inflammatory clickbait, hoaxes, and conspiracy theories. Perhaps because so much media attention of varying quality is devoted to her, readers questioned whether it was true that she was seeking a motorcycle ban.", "This claim about a nationwide motorcycle ban is a fabricated one that originated solely with the \"Taters Gonna Tate website, which is part of the America's Last Line of Defense (LLOD) network of junk news sites that promulgate political misinformation under the guise of proffering \"satire.\"  The site carries a disclaimer noting that nothing published there is to be believed, stating on its \"About\" page that \"Everything on this website is fiction.\"", "Saslow, Eli.  \"‘Nothing on This Page Is Real’: How Lies Become Truth in Online America.\"\r\n   The Washington Post.   17 November 2018.", "fallisgunnington.   \"Ocasio-Cortez Proposes Nationwide Motorcycle Ban.\"\r\n    Taters Gonna Tate.   6 April 2019.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]