["About this rating", "On 10 December 2015, the web site News10Live published an article titled \"Man Strangles Girlfriend to Death for Refusing to Make Eye Contact with Him While Talking to Her.\"", "The article (which was appended with a photograph of a man who appeared to be visually impaired) claimed an individual named Ralph Holden strangled his girlfriend for refusing to make eye contact with him. As the photograph implied, doing so would be challenging due to the fellow's assumed impairment (which as shown is actually an example of a wall-eyed, not cross-eyed, condition):", "A 28-year-old Michigan man, Ralph Holden, was arrested and booked on charges of first-degree murder after his girlfriend was found dead in their 82nd St. home over the weekend ... [police] found 26-year-old Wendy Miller unresponsive on the kitchen floor. Holden immediately confessed to police that he killed his girlfriend, but the reason stunned investigators ... \"According to Holden's confession, he complained that Miller would not make eye contact with him when he was trying to have a conversation with her. I mean, have you seen this guy's eyes? I don't mean to be rude, but nobody would know which way he was looking or which eye to make contact with. It’s just a real shame.\"", "According to the 911 transcripts, a neighbor reported the disturbance saying she heard shouting were Holden continued to demand from his girlfriend, “look at me, look at me, look at me!”  The neighbor could hear Miller crying, “I am but you never believe me!”", "The image was old, and first published to the internet as early as July 2009; whether the image was digitally altered was unclear. However, the photograph was definitively not a mugshot taken after a December 2015 crime.", "Moreover, the web site News10Live (created to look like a local television news web site) featured other fabricated news stories which originally appeared on similar fake news sites like Newswatch33 and Now8News. Among the articles on the News10Live page were claims the Earth would go dark for 15 days, that the forceful ejection of an Xbox game killed a player, that a homeless couple was discovered living in the attic of a Walmart, that a girl was electrocuted by earbuds on a charging iPhone, that Starbucks beverages contained semen, and that a rapist dressed as a clown doll to hide in a child's bedroom.", "[article-meta]", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]