["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Sarah Ponder of Austin told us how she reached her estimates for the sign she carried at the July 1, 2013, rally against abortion restrictions at the state Capitol. (Sue Owen photo/Austin American-Statesman)", "Amid thousands of protesters at the Texas Capitol, Sarah Ponder of Austin carried a sign with a financial comparison: \"$800,000: 1.6 million condoms, 90K months of the pill, 20 full-time sexual health educators or 1 medically unnecessary & hypocritical special session,\" it read.", "The July 1, 2013, rally took place the first day of the 2013 Legislature’s second special session, called by Gov. Rick Perry after a filibuster and demonstrators kept legislation restricting abortions from winning final Senate approval.", "Ponder, who works for an education technology company, said she wanted to show that the money likely to be spent on the special session could instead pay for measures she said would be more effective at reducing abortions: providing substantial contraception aids or paying 20 educators’ salaries for a year.", "We shopped around, comparing the costs of a special session to Ponder’s alternatives.", "In a June 26, 2013, news story Ponder sent us, Waco ABC affiliate WXXV-TV said, \"Each special session could cost taxpayers more than $800,000,\" based on per-diem payments to legislators to cover their food and expenses.", "Other news stories we found typically gave either a per diem cost of $800,000, a per diems-plus-overhead cost of $1 million or both.", "Per diems are the biggest cost of Texas special sessions, which can last up to 30 days. At the current per diem rate of $150, with 182 lawmakers eligible (31 senators, 150 representatives and the lieutenant governor), 30 days of payments would equal $819,000.", "Not all lawmakers take the payments, though. June 18, 2013, news stories from the Dallas Morning News and Houston Chronicle indicated that during the year’s first special session, six or eight senators and 26 House members declined some or all of the payments. Dewhurst spokesman Travis Considine told us by phone that Dewhurst turned down all per diem payments for both special sessions. If 33 lawmakers rejected the payment on days their chambers did not convene, the state might have shelled out $716,100 on per diems during the session.", "Other costs bring the total up. Legislative Budget Board staff spokesman John Barton told us by email that, wrapping in overhead costs such as utilities, security, printing and staff support, a 30-day special session could cost $1 million to $1.2 million.", "Ponder emailed us a March 12, 2012, news story from The Week, a news magazine, that said generic-drug versions of birth control pills cost $9 a month and brand-name pills cost $90 a month.", "The National Campaign to Prevent Teen and Unplanned Pregnancy offers information at bedsider.org on the availability and costs of contraceptive options. The group is a nonprofit that produces research frequently used by teen pregnancy prevention organizations.", "The campaign’s site gives the same $9-$90 range cited in The Week’s article, with explanatory details.", "Oral contraception pills, containing hormones that prevent egg production or fertilization, are usually taken once a day. \"A woman without insurance using generic birth control pills will typically pay about $25 a month,\" according to the site. The group’s chief program officer, Bill Albert, told us by phone that information on the site is updated and current.", "With Medicaid or private insurance, according to the site, women can get the pill free or for just the cost of their co-pay (the fixed amount an insured patient pays out-of-pocket each time he or she gets a medical service). \"For most people,\" the Bedsider article said, the co-pay \"ranges from $5 to $35.\"", "Federal funding makes free or low-cost pills available to many, the site said.", "Without insurance, generic pills at pharmacies can cost $10-$20 a month, the site says, or $20-$30 a month from Planned Parenthood, with name-brand pills selling for $60-$90 a month at pharmacies. The site says its information came from a survey of Planned Parenthood clinics and birth control manufacturers.", "Ponder told us she chose an average cost per condom of 50 cents by looking at items for sale on Amazon.com.", "Bedsider.org gives prices from a survey of online retailers: 30 cents to $1.54 apiece for male condoms at national chain pharmacies and 18 cents to 60 cents apiece at Walmart. As with the pill, the site said, condoms can be obtained for free or at reduced costs at clinics.", "But also as with the pill, there are more expensive options available. In a December 2009 article, Consumer Reports rated 22 types of condoms on strength, reliability and whether holes were present in the material; the best seven ranged from 71 cents to $1.10 each.", "To check options that are widely available, we visited a CVS pharmacy on South Congress Avenue and found prices from 79 cents to $4.35 apiece.", "Ponder said she estimated from personal knowledge that the annual salary of an entry-level sexual health educator at a nonprofit organization might be about $35,000 to $40,000.", "Francine Gertz, human resources manager for the City of Austin’s health and human services department, told us by phone that the city employs health educators in programs such as its adolescent health initiative, which according to its website provides education and presentations for students, parents and others.", "The entry-level salary for a first-level public health educator -- a job that requires a four-year degree and two years of experience -- is $40,000, Gertz said, and a second-level public health educator with 13 years of experience might earn $54,000.", "Texas Workforce Commission spokeswoman Lisa Givens suggested by email that we look at a couple of the federal government’s occupation categories. One was \"health educators,\" which encompassed broad job titles such as community health worker and narrow ones such as early breastfeeding care specialist. According to the federal Bureau of Labor Statistics’ website, most people employed in this category nationwide earned about $53,000 a year as of May 2012.", "Job search website Indeed.com, whose data has been cited by Forbes and U.S. News and World Report magazines, says the average annual salary for a \"sexual health educator\" in Texas is $50,000 (compared with $52,000 nationally). Such averages are based, the site says, on \"salary information extracted from over 50 million job postings from thousands of unique sources over the last 12 months.\"", "Now, let’s take another look at that sign.", "A 30-day special session might cost $716,100 to $819,000 in per diems alone; Ponder assumed an $800,000 cost.", "And how do the alternative expenditures on her sign price out?", "Like Ponder, we found estimates saying a month of oral contraceptive pills could cost $9 to $90, but we also read that a typical cost would be $25. Ponder went with the $9 figure and said $800,000 would buy 90,000 months of pills. We calculate that $800,000 would pay for 88,900 months of pills at $9 or 32,000 months at $25.", "That’s a difference of 4,700 years. To phrase it another way, $800,000 would buy 32,000 women a month’s worth of pills at $25 or 88,900 women’s pills for a month at $9.", "Condoms, Ponder estimated, would cost about 50 cents on average. With $800,000, we calculate, you could indeed provide 1.6 million 50-cent condoms. Using Bedsider.org’s range, we figure $800,000 would buy 2.7 million condoms at 30 cents each or 520,000 condoms at $1.54 each.", "To predict that $800,000 would pay for 20 full-time sexual health educators, Ponder said she estimated an annual salary for an entry-level position at a nonprofit at $35,000 to $40,000. That doesn’t contradict what we found, because the salaries we gathered covered a spectrum, from $40,000 for a city job requiring two years’ experience to $54,000 for veteran educators. We calculate that $800,000 would pay 20 educators at $40,000 or 16 educators at the Texas average salary of $50,000 listed by Indeed.com.", "Our ruling", "Ponder used a conservative estimate for the cost of the second special session, presuming it runs for the full 30 days. She used the lowest price we found for the pill, a mid-range price for condoms and a salary that doesn’t seem out of line for an entry-level sexual health educator position, so it’s probably true that under certain circumstances, you could pay for the items on her sign with $800,000 apiece.", "Then again, it might be fairer to estimate the pill at $25 a month instead of $9, which means you could only pay for 32,000 months of contraception, not the 90,000 months she cited. And unless you only wanted to hire newly-graduated sexual health educators, you might have to pay them more like $52,000 per year, which would cover 16 instead of 20 educators.", "So an adjusted version of the sign might read: \"$800,000: 1.6 million condoms, 32,000 months of the pill, 16 full-time sexual health educators\" instead of \"$800,000: 1.6 million condoms, 90K months of the pill, 20 full-time sexual health educators.\"", "We rate Ponder’s claim as Mostly True.", "Interview and email interview, excerpted, with Sarah Ponder, July 1, 2013", "WXXV-TV news story, \"2nd special session could cost taxpayers additional $800K,\" June 26, 2013", "Austin American-Statesman, news story, \"Special session drags on, with legislators questioning focus, cost,\" June 6, 2013", "KUT-FM news story, \"As Special Session Lengthens, Cost to Texas Taxpayers Grows,\" June 7, 2013", "Dallas Morning News news story, \"Texas lawmakers draw extra pay for special session while far from Capitol,\" June 18, 2013", "Houston Chronicle news story, \"Lawmakers collect pay for expenses in recess,\" June 18, 2013", "Texas Ethics Commission, Chapter 50. Legislative salaries and per diem, accessed July 1, 2013", "Email interview, excerpted, with Travis Considine, spokesman for Lt. Gov. David Dewhurst, July 2, 2013", "Email interview, excerpted, with John Barton, communications officer, Legislative Budget Board, July 1, 2013", "The Week news story, \"The cost of birth control: By the numbers,\" March 12, 2012", "Associated Press news story, \"Birth control prices range widely from $100 to $1,000,\" March 9, 2012", "National Campaign to Prevent Teen and Unplanned Pregnancy website bedsider.org, accessed online July 2, 2013", "Telephone interview with Bill Albert, chief program officer, National Campaign to Prevent Teen and Unplanned Pregnancy, July 2, 2013", "Consumer Reports review, \"Top condoms,\" December 2009", "Telephone interview with Francine Gertz, human resources manager, City of Austin health and human services department, July 3, 2013", "Email interview, excerpted, with Lisa Givens, director of communications, Texas Workforce Commission, July 2, 2013", "U.S. Bureau of Labor Statistics web page, \"Occupational Employment and Wages, May 2012: 21-1091 Health Educators,\" accessed online July 3, 2013", "Indeed.com search results, \"Sexual Health Educator Salary in Texas,\" accessed online July 2, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]