["Randy Bryce, a candidate for Paul Ryan's U.S. House seat, has emphasized his union credentials. (Campaign photo)", "A first-time-ever claim will almost always get our attention.", "One was made by Randy Bryce, a Democrat who is running for the southern Wisconsin U.S. House seat being vacated by Republican Paul Ryan, the House speaker.", "Bryce, a union ironworker, was interviewed by CNN talk show host Don Lemon on March 14, 2018. Asked about the surprise win that night by Democrat Conor Lamb in a special House election in Pennsylvania, Bryce said:", "Well, he ran a very pro-union campaign. Being a union member, that’s something that’s been very important for me, standing up for working people. I mean, our campaign staff was the first to unionize in the history of politics. So, that’s something I’m very proud of.", "First ever?", "Like us on Facebook. Follow us on Twitter: @PolitiFactWisc", "Bryce's evidence", "Bryce’s campaign spokeswoman, noting it’s hard to prove something has never occurred before, told us she was not aware of any previous campaign staffs that unionized before Bryce’s campaign workers joined the Campaign Workers Guild and forged a contract with Bryce in December 2017. The deal was announced three months later.", "The union itself is new, having started organizing in early 2017. So we sought out experts in labor history.", "Asking the experts", "Of the 12 labor history experts we contacted (see the list of sources accompanying this article), none said they were aware of any previous campaign staffs that had been unionized.", "But none could say for sure that it had never happened.", "More fact checks on unions:", "Scott Walker: Did FDR oppose collective bargaining for government workers?", "Alberta Darling: Wisconsin lawmaker voted to allow using tax money to pay for Viagra for public school employees?", "Here are some of their responses:", "I suspect there have been staff who joined unions, but he (Bryce) may be the first to recognize and bargain with them.  I don’t know of anyone who’s studied this question. -- University of Minnesota history professor William Jones", "I think we can say it’s true for contemporary politics. I am not going to vouch for anything prior to the National Labor Relations Act (signed in 1935) because I’m not sure we would know. -- Kate Bronfenbrenner, labor education research director at Cornell University", "I don’t know for sure, but it seems unlikely that in 200+ years no one did this before. -- Ruth Milkman, sociologist of labor and labor movements at City University of New York Graduate Center", "I don’t know of any, but that doesn’t mean they don’t exist. There is no central database for local unions, and many do not affiliate with a national union. Campaign staffs could have been unionized and we would never know. -- Rutgers University labor studies professor Dorothy Sue Cobble", "We also checked with the National Labor Relations Board, which also does not keep such records.", "The Office and Professional Employees International Union wasn’t able to help us and we didn’t hear back from the American Federation of Labor and Congress of Industrial Organizations (AFL-CIO).", "Our rating", "Bryce says: \"Our campaign staff was the first to unionize in the history of politics.\"", "The dozen experts we consulted said they were not aware of any previous campaign staff unionizing, though they could not state flatly that it had never occurred.", "If new information surfaces, we’ll reconsider this rating. For now, we rate it Mostly True.", "CNN, Don Lemon interview of Randy Bryce (2:00), March 14, 2018", "Email, Randy Bryce campaign spokeswoman Lauren Hitt, April 16, 2018", "Campaign Workers Guild, \"Our Victories,\" accessed April 23, 2018", "Campaign Workers Guild, news release, Feb. 12, 2018", "Email Campaign Workers Guild spokeswoman Meg Reilly, April 22, 2018", "Huffington Post, \"Why The First Unionized Political Campaign Is A Game-Changer For The Left,\" Feb. 13, 2018", "Bloomberg, \"Campaign Workers Unionize Just in Time for Midterm Elections,\" Feb. 12, 2018", "The Nation, \"Randy Bryce’s Campaign Is Not Just Pro-Union—It’s Unionized,\" Feb. 12, 2018", "Email, University of Minnesota history professor William Jones, April 20, 2018", "Email, National Labor Relations Board staff, April 24, 2018", "Email, University of Iowa history professor and labor history expert John McKerley, April 22, 2018", "Email, Georgetown University history professor, Joseph McCartin, expert on U.S. labor, social and political history, April 20, 2018", "Email, University of Washington political science professor and labor studies director Michael McCann, April 22, 2018", "Email, Office and Professional Employees International Union spokeswoman Nicole Korkolis, April 23, 2018", "Email, University of Toledo law professor and labor expert Joseph Slater, April 20, 2018", "Email, Northwestern University professor of American history and labor union history expert Kevin Boyle, April 22, 2018", "Email, City University of New York Graduate Center sociologist of labor and labor movements Ruth Milkman, April 20, 2018", "Email, Cornell University labor education research director and industrial and labor relations professor Kate Bronfenbrenner, April 22, 2018", "Email, University of Maryland history professor Julie Greene, expert in labor history, April 22, 2018", "Email, Cornell University Institute for Public Affairs visiting professor and former deputy U.S. secretary of labor Seth Harris, April 21, 2018", "Email, Vanderbilt University history professor and labor history expert Jefferson Cowie, April 22, 2018", "Email, Rutgers University labor studies and history professor Dorothy Sue Cobble, April 21, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]