["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "In an Aug. 2, 2013, press release forwarded to us by a reader, U.S. Rep. Jeb Hensarling, R-Dallas, objected to the IRS enforcing Obamacare -- a law he claimed the IRS chief said his employees don’t want applied to themselves.", "That week, Hensarling said, \"the acting chief of the IRS said he – and the majority of IRS employees – would rather stay with his current plan than switch to Obamacare.\"", "Did the IRS boss say most agency workers would rather not be included in Obamacare?", "The 2010 Affordable Care Act, known as Obamacare, isn’t a health plan itself. It requires Americans to have health insurance or pay a fine.", "The act also sets up online marketplaces, which start opening Oct. 1, 2013, where people can shop for health care plans. Starting in 2014, the IRS gets the job of confirming taxpayers have health insurance and assessing a financial penalty if they don’t.", "One Obamacare provision requires members of Congress and their aides -- even though they already had health insurance through their employer, Uncle Sam -- to get coverage through the online exchanges, though how that will happen is in flux.", "A bill filed by U.S. Rep. Dave Camp, R-Mich., would require all federal employees to get coverage through the exchanges. The National Treasury Employees Union -- whose members include about 80,000 of the IRS’ 90,000 employees, according to a June 10, 2013, Bloomberg news story -- has urged its members to oppose Camp’s bill.", "Hensarling spokeswoman Sarah Rozier told us the congressman’s claim referred to Aug. 1, 2013, testimony by acting IRS Commissioner Daniel Werfel to a House committee, after Werfel was asked by another Texan why IRS union members opposed Camp’s bill.", "Notably, however, the question posed by U.S. Rep. Sam Johnson, R-Plano, contained an inaccuracy that’s also present in Hensarling’s statement and in a claim by Florida Republican U.S. Sen. Marco Rubio that PolitiFact recently found flawed.", "Here’s what Werfel was asked, according to CSPAN video:", "Johnson: Now, Mr. Werfel, last week your employees who are a member of the National Treasury Employees Union sent a form letter for union members to send in to ask they be exempt from the exchanges. Why are your employees trying to exempt themselves from the very law that you’re tasked to enforce?", "On Aug. 1, 2013, PolitiFact rated as Mostly False Rubio’s claim that the union was \"begging to be let out from under this law.\" The others also cite the existing Obamacare law: Hensarling referred to a \"switch to Obamacare\" and Johnson said \"exempt ... from the very law.\"", "But that premise is flawed, because the union is not objecting to Obamacare -- which doesn’t target Americans who already have insurance.", "In contrast, the union was objecting to the Camp bill, under which federal employees would have their current health plans taken away and then, like other Americans who lack insurance, buy plans through the exchanges.", "Here’s the IRS chief’s response to Johnson:", "Werfel: Well, I don’t want to speak for the NTEU, but I’ll offer a perspective as a federal employee myself and a federal employee at the IRS. And that is we have right now, as employees of the government or the IRS, affordable health care coverage. And I think the ACA was designed to provide an option or an alternative for individuals that do not.", "And all else being equal, I think if you’re an individual who’s satisfied with your health care coverage, you’re probably in a better position to stick with that coverage than go through the change of moving into a different environment and going through that process.", "So I think, for a federal employee, I think more likely, and I would -- can speak for myself, I’d prefer to stay with the current policy that I’m pleased with rather than go through a change if I don’t need to go through that change. And -- but, if I’m an individual that doesn’t have affordable health care coverage, or I’m unhappy with my coverage, then it’s my understanding the exchanges would offer a competitive alternative to look at, and that might be something someone might want to pursue.", "But I think the IRS employees as a whole, I think what the NTEU is saying is they’re pleased with their health care coverage, they prefer to stay in their current health care coverage.", "Boiled down, Werfel said federal employees already have affordable insurance and he thinks the Obamacare law set in motion programs designed for people who don’t. He said that he and IRS union members would prefer to keep their current policies rather than make a change (in context, the change proposed by Camp’s bill).", "Rozier told us Hensarling accurately summarized Werfel’s comments.", "Our ruling", "Hensarling said that \"the acting chief of the IRS said he – and the majority of IRS employees – would rather stay with his current plan than switch to Obamacare.\"", "Werfel did say that he and other IRS workers would prefer no change in their insurance coverage. But the context for that statement is not as Hensarling suggested. IRS and other federal workers are not objecting to the law known as Obamacare but to proposed legislation designed to take away their current employer-provided insurance and make them buy coverage through exchanges created by Obamacare.", "We rate Hensarling’s partly accurate claim, which leaves the misimpression that IRS workers are scrambling to get out from under a law that actually applies to the nation’s uninsured, as Half True.", "Press release, U.S. Rep. Jeb Hensarling, R-Dallas, Aug. 2, 2013", "Bloomberg news story, \"IRS Firings for Employee Misconduct Reach 11-Year Low,\" June 10, 2013", "Telephone and email interviews, excerpted, with Sarah Rozier, communications director for U.S. Rep. Jeb Hensarling, R-Dallas, Aug. 6-9, 2013", "U.S. House of Representatives, Ways and Means Committee, \"Hearing on the Status of the Affordable Care Act Implementation,\" Aug. 1, 2013", "Telephone interview with Clay Sanford, IRS media relations specialist for North Texas, Aug. 7, 2013", "Congressional Budget Office, \"CBO's February 2013 Estimate of the Effects of the Affordable Care Act on Health Insurance Coverage,\" Feb. 5, 2013", "U.S. Census Bureau, \"Income, Poverty, and Health Insurance Coverage in the United States: 2011,\" September 2012", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]