["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Speaking about a recent federal advisory on marijuana, Dr. Jerome Adams, the surgeon general, put a new spin on long-standing admonitions about the drug.", "\"Marijuana has a unique impact on the developing brain. It can prime your brain for addiction to other substances,\" Adams said at a substance abuse conference sponsored by Oxford House, a recovery center network.", "This is a reiteration of the old \"gateway\" argument: the idea that marijuana is frequently an entree to using other, harder drugs. And the surgeon general’s emphasis comes just as many states are loosening restrictions around its medicinal and adult recreational use.", "But marijuana research is limited, and this particular hypothesis is fairly controversial. We decided to put Adams’ claim to the test. Is his central thesis –  marijuana has a \"unique impact\" on developing brains and can \"prime your brain for addiction\" – accurate?", "We contacted the surgeon general’s office, which directed us to statements from the National Institute on Drug Abuse. NIDA noted that marijuana may have a gateway effect, but that most people who use the drug don’t progress to other, harder substances; and that alcohol and nicotine appear to have a similar impact. But the surgeon general’s office was also unequivocal on a related point: \"From a public health perspective, no amount of drug use is safe for the developing brain.\"", "So how fair is Adams’ statement? When we interviewed experts, the responses were all over the map – reflecting just how contested this issue is and how difficult it is to speak definitively about marijuana’s impact.", "The gateway effect?", "The idea that marijuana can \"prime your brain for addiction\" has some basis: namely, the results of some studies conducted with rodents.", "There are findings to suggest that early exposure to the drug may \"sensitize animals to the effects of other drugs,\" noted Joshua Isen, an assistant professor at the University of South Alabama, who researches adolescent marijuana use.", "For instance, Adams’ office noted that preclinical studies indicate exposure to THC – marijuana’s main psychoactive compound –  during a period roughly equivalent to adolescence in rats resulted in greater self-administration of heroin when the animals reach adulthood.", "In addition, THC exposure yielded changes in their brains’ reward system – in other words, yes, priming the brain for the rewarding effects of opioids.", "But, Isen said, it’s scientifically problematic to draw a line from the effects seen in rodents to what might be happening to a human. Ethical considerations about human research make it more or less impossible to do a randomized controlled trial – the gold standard of scientific research – that would measure how marijuana does or doesn’t affect a still-developing brain.", "\"We should remain agnostic about the surgeon general’s claim,\" Isen argued.", "Other experts suggested otherwise, saying that since animal research is the best we can get, it’s worth taking seriously – and it is fairly conclusive.", "Jonathan Caulkins, a drug policy researcher at Carnegie Mellon University in Pittsburgh, Pa., took a more optimistic view of that research, arguing that the animal evidence is \"very clear\" when it comes to marijuana’s neurological impact. He called it a fair basis for the surgeon general’s warning.", "\"What we know is strong enough to say that exposure during adolescence when the brain is developing is a risk,\" said Susan Weiss, a scientific adviser to the NIDA director.", "But how meaningful of a risk – and how it compares to other drugs – is exceptionally tough to say, given the limitations on research. Studies on actual humans are limited because people who use marijuana at a young age may be exposed to other risk factors, such as peer influences using harder drugs, or sociodemographic factors that might predispose them to abuse or addiction.", "As Dr. Sue Sisley, an Arizona-based psychiatrist who tracks the state of marijuana research, put it: \"I don’t see very much good, rigorous data to confirm either way.\"", "What about uniqueness?", "In the most narrow sense, marijuana indeed has a \"unique\" effect on the brain. It elicits a response from what are called \"endocannabinoid receptors.\" Other drugs don’t – they interact with different brain receptors. So, certainly, marijuana affects development using a different (or \"unique\") neurological mechanism than the ones used by, say, nicotine or alcohol.", "And, as best as science can tell us, marijuana harms developing brains, both Weiss and Sisley said. From a common sense, public health perspective, young people in particular should be exceptionally cautious when it comes to using the drug.", "But – and this is important context – marijuana is not the only substance that has this potential \"priming\" for subsequent addiction. The surgeon general’s office acknowledged this finding when we asked follow-up questions. That same context, though, is missing from Adams’ public statement.", "\"It seems that early exposure to many substances can make it likely someone will be addicted to other substances,\" Weiss said. She acknowledged that rodent studies do also suggest nicotine may have a priming effect, albeit via a different neurological route.", "On a practical level, Isen said, while one could highlight the distinct scientific effect marijuana has, \"there is no evidence that marijuana has a uniquely deleterious effect on the developing brain - certainly not more than other substances such as alcohol.\"", "Our ruling", "Speaking about the risks associated with marijuana, the surgeon general said it \"has a unique impact on the developing brain\" and \"can prime your brain for addiction to other substances.\"", "The implications are tricky, and it’s important to note the significant limitations on marijuana research, as well as how it compares to other drugs. It may have its own, unique mechanism of \"priming\" adult addiction.", "Still, other substances have similar effects – even if they take a different brain path to get there. And since this idea about marijuana’s priming effect is central to Adams’ broader public health campaign, emphasizing that nicotine and alcohol also could function in this manner matters even more.", "This statement is partially accurate, but it leaves out important details and context. We rate it Half True.", "Surgeon General Jerome Adams, remarks at Oxford House World Convention, Aug. 30, 2019.", "National Academies of Science, \"The Health Effects of Cannabis and Cannabinoids,\" January 2017.", "National Institutes of Health, \"Is Marijuana A Gateway Drug?\" September 2019.", "Office of the Surgeon General, \"U.S. Surgeon General’s Advisory: Marijuana Use and the Developing Brain,\" August 29, 2019.", "Email Interview with Jonathan Caulkins, H. Guyford Stever Professor of Operations Research at the Carnegie Mellon University Heinz School of Public Policy and Management, Oct. 29, 2019.", "Email Interview with Joshua Isen, assistant professor of psychology at the University of South Alabama, Oct. 30, 2019.", "Email Interview with Hugh Garavan, professor of psychiatry and psychology at the University of Vermont, Oct. 29, 2019.", "Email Interview with Sue Sisley, psychiatrist and marijuana researcher, Oct. 29, 2019.", "Telephone Interview with Susan Weiss, scientific adviser to the director of the National Institute for Drugs and Alcohol, Oct. 30, 2019.", "Email interview with Office of the Surgeon General, Nov. 1, 2019.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]