["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Democratic pundit Hilary Rosen isn’t buying all the talk about newly re-elected New Jersey Gov. Chris Christie being a moderate Republican. In a roundtable discussion on CNN’s State of the Union, Rosen painted Christie as out of touch when it comes to women’s reproductive issues.", "\"Women consistently bring Democrats over the top in these purple states,\" Rosen said during the Nov. 10 show. \"When you look at Chris Christie and you try and take that forward, you’ve got an anti-choice candidate who has vetoed Planned Parenthood funding five times over the course of his governorship.\"", "With four budgets under his belt, did Christie really veto money for Planned Parenthood five times?", "Rosen tweeted us a story from LifeNews.com, which opposes abortions, and a (Newark) Star-Ledger newspaper editorial that referenced five vetoes. We looked into it ourselves and found Christie has used his executive power several times to deny funding for family planning clinics, including but not exclusively limited to Planned Parenthood. As a result of the cuts at least six clinics have closed, including two affiliated with Planned Parenthood, our colleagues at PolitiFact New Jersey found.", "The vetoes have been a real sore spot between the governor and the Democrat-led Legislature since Christie took office.", "So how many were there exactly?", "It depends on how you count them.", "We compiled a timeline using clips from the Star-Ledger and interviews with Planned Parenthood representatives. We could not reach a Christie spokesperson by our deadline.", "In March 2010, Christie proposed his first budget recommendations amid a $10 billion shortfall with across-the-board cuts, including an $820 million cut for schools. This budget, which outlined Christie’s priorities but still needed approval from the Democratic legislators, also included the elimination of $7.5 million for \"family planning services.\"", "Legislators then responded by passing a bill to add that funding back in the budget. But Christie struck back.", "On June 23, 2010, Christie vetoed SB 2139, which aimed to restore $7.5 million in grants for the state’s 58 women’s health and family planning centers, including Planned Parenthood. In his veto letter, Christie cited the state’s budget bind and the existence of other clinics that could perform these services.", "\"Reproductive health services will continue to be available in each of New Jersey’s 21 counties, including Planned Parenthood clinics, local health department clinics, free standing clinics and hospital-based clinics,\" he wrote. \"Nearly 95,000 women will still receive care through these family planning sites.\"", "The Legislature tried again the next year. Again Christie said no. Christie vetoed $7.5 million for the family planning centers in the 2011-12 state budget.", "Same story in 2012. The Legislature passed a supplemental bill, AB 788, to restore the money for family planning centers, but Christie vetoed it.", "Lastly, on June 29, 2013, Christie vetoed a measure, SB 2825, from Democrats that again tried to restore the $7.5 million for family planning services.", "That's four clear vetoes, plus the original cut.", "Additionally, in 2011 and again in 2013, Christie vetoed proposals to expand the state's Medicaid program to cover family planning services for people who earn up to 200 percent of the federal poverty level. Services would have included things such as birth control and cervical exams but not abortion, according to the Star-Ledger.", "The Medicaid expansion would not have directly provided money for Planned Parenthood, but it \"would have provided a new revenue stream to allow Planned Parenthood health centers to see additional patients and offer additional services, said Ed Remsen, executive director of Planned Parenthood Action Fund of New Jersey.", "So that could be two additional vetoes, depending on how you count it.", "Marie Tasy, executive director of New Jersey Right to Life, pointed out that Christie has maintained funding for other health services and that he defeated a female candidate who made this an issue, suggesting that Rosen’s theory about women not liking Christie rings hollow.", "Our ruling", "Rosen said Christie \"vetoed Planned Parenthood funding five times over the course of his governorship.\"", "Rosen is largely correct, though different people might come to a different figure. We rate her claim Mostly True.", "Interview with Ed Remsen, executive director of Planned Parenthood Action Fund of New Jersey, Nov. 10, 2013", "Interview with Liz Clark, Planned Parenthood spokeswoman, Nov. 10, 2013", "Interview with Michele Jaker, Planned Parenthood Action Fund of New Jersey lobbyist, Nov. 10, 2013", "Interview with Marie Tasy, executive director of New Jersey Right to Life, Nov. 10, 2013", "Star-Ledger, \"Dems defy Christie on family programs,\" June 29, 2010", "Star-Ledger, \"Christie vetoes bill to expand Medicaid to more women seeking family-planning services,\" Feb. 3, 2011", "Star-Ledger, \"Christie signs budget after series of deep cuts,\" July 1, 2011", "Star-Ledger, \"Christie’s budget, cut by cut,\" March 17, 2010", "Star-Ledger, \"Gov. Chris Christie signs $31.7B budget with spending cuts,\" June 29, 2012", "PolitiFact New Jersey, State Sen. Loretta Weinberg says six of New Jersey’s 58 family planning centers closed because of budget cuts, June 10, 2011", "PolitiFact New Jersey, \"Cory Booker blasts Chris Christie for slashing funding to Planned Parenthood, causing a reduction in health services,\" Sept. 4, 2012", "Star-Ledger editorial, \"Calling Christie’s bluff on women’s health care,\" June 18, 2013", "Star-Ledger, \"Christie signs budget, stresses conservatism in Vernon,\" June 29, 2013", "LifeNews.com, \"Gov. Christie Vetoes Bill Funding Planned Parenthood for Fifth Time,\" July 1, 2013", "Senate Bill S-2139, vetoed by Gov. Chris Christie", "Senate Bill SCR-210, a bill to override Gov. Chris Christie’s veto", "Senate Bill S-788, vetoed by Gov. Chris Christie", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]