["State Sen. Kevin de León, D- Calif., speaks during the first day of the Democratic National Convention in Philadelphia, Monday, July 25, 2016. AP Photo/Carolyn Kaster", "UPDATE: Since publication, California’s economy moved up to the fifth largest in the world, according to data by the U.S. Department of Commerce and reported in May 2018 in the Sacramento Bee. Its 2017 GDP was $2.747 trillion, surpassing the United Kingdom’s $2.625 trillion GDP.", "State Senate leader Kevin de León spotlighted California’s economic and social achievements during his speech this week at the Democratic National Convention in Philadelphia.", "The Democrat from Los Angeles touted the state’s newly established $15 per hour minimum wage, efforts to keep college affordable and California’s hundreds of thousands of clean energy jobs.", "\"We’ve made unprecedented progress in every area,\" De León told a cheering crowd. \"And when we elect Hillary Clinton as our next president, I know that our progress will be America’s progress.\"", "The state senator then repeated a talking point California leaders love to make on national and international stages, about the size of the state’s economy:", "\"These are the progressive policies that have made California the sixth largest economy on planet Earth,\" De León said.", "We won’t wade into the debate over whether progressive or other policies have positioned the state’s economy on such a high perch.", "But we will examine the provocative \"sixth largest economy on planet Earth\" claim by itself.", "State Senate leader Kevin de León makes the \"sixth largest economy\" claim at the 1:45 minute mark in this video.", "Our research", "State leaders have made this hypothetical comparison for years, examining California’s gross domestic product against nations across the globe.", "With nearly 40 million people, the state has a larger population than many countries. It also boasts a diverse set of industries from technology to tourism and entertainment.", "In June, Gov. Jerry Brown’s administration released figures showing California, with a GDP of more than $2.4 trillion in 2015 had jumped two spots in these unique world rankings ahead of France and Brazil and into sixth place behind the United Kingdom.", "First on the list is the United States, followed by China, Japan and Germany.", "California’s place on the list has fluctuated over time. It had been 10th as recently as 2012 due to the effects of the financial and housing slumps.", "The rankings use International Monetary Fund data. California is the only state on the list of nations.", "Experts have said California’s rise in the rankings reflects its strong economic growth compared with the rest of the world. They have cited Silicon Valley’s continued tech boom as a critical factor.", "\"It speaks to California doing relatively well in a sluggish global economy,\" Jeff Michael, director of the University of the Pacific’s Center for Business and Policy Research, told the Sacramento Bee in June.", "A more complex picture", "De León’s statement, made in a short 4-minute speech, did not include much context.", "When adjusting for the state’s high cost of living, California’s GDP ranking drops to 11th in the world, according to the California Legislative Analyst’s Office.", "A tweet on June 14, 2016 from the California's nonpartisan Legislative Analyst's Office.", "Carson Bruno, who studies California policy at the conservative Hoover Institution, says there’s a lot missing from the \"sixth largest economy claim.\"", "In California, \"housing costs more; electricity and gas cost more; and even most goods and services cost more than the national average,\" he wrote in a post on RealClearMarkets.com. \"In many respects California's cost of living is much more like a Western European nation than it is like the rest of the U.S. The widely reported global rankings ignore this reality.\"", "De León’s spokesman did not respond to a request for comment.", "Our rating", "State Senate leader Kevin de León recently claimed at the Democratic National Convention that California has \"the sixth largest economy on planet Earth.\"", "This hypothetical comparison rests on California’s $2.4 trillion GDP, which moved slightly above that of France and Brazil in 2015 to sixth in the world.", "The ranking, and De León’s statement, however, ignore California’s sky high cost of living and Silicon Valley’s role in the state’s economic growth. The state’s GDP drops several places when adjusted for cost of living.", "De León’s statement, while accurate, could have used this additional information or clarification.", "We rate his claim Mostly True.", "MOSTLY TRUE – The statement is accurate but needs clarification or additional information.", "Click here for more on the six PolitiFact ratings and how we select facts to check.", "Share the Facts Widget Embed", "Kevin de León, Democratic National Convention speech, July 25, 2016", "California Department of Finance, Gross State Product, Comparison to Other Major Countries, accessed July 2016.", "Sacramento Bee, California economy surges to No. 6 in global rankings, June 14, 2016", "California Legislative Analyst’s Office, tweet, June 14, 2016", "RealClearMarkets.com, Carson Bruno, Is California Really the 6th Largest Economy in the World?, July 14, 2016", "Los Angeles Times, California's economy (maybe) moves to world's sixth largest", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]