["In November 2013, a list of 16 claims about South Africa under the African National Congress - all of them negative - began doing the rounds on Facebook. Within days the list had attracted more than 2,000 comments, been “liked” 1,600 times and had been shared on the Facebook pages of more than 12,000 people.The list appears to be a shortened version of a blog post published on 8 May 2013 which derisively referred to the “the ANC’s list of achievements”.A version of the list also appears to have been circulated via email. In August 2013, Business Day reported that a Democratic Alliance councillor in South Africa’s Eastern Cape province, Stanford Slabbert, had been expelled from the party after forwarding an “offensive and racist\" email that included some of the claims contained in the blog post.So what are the facts? Is there any truth to the claims? Africa Check readers asked us to investigate.", "Unemployment in South Africa has increased by 60% in the past 19 years.", "South Africa has one of the highest unemployment rates in the world.", "South Africa is the rape capital of the world.", "South Africa’s education department is ranked 140th out of 144 countries.", "South Africa is the country where the most car hijackings take place.", "South Africa is one of the ‘top ten’ countries with the highest murder rates.", "South Africa has the most corrupt government in the world.", "South Africa now has ten times more people in squatter camps than in 1994.", "South Africa has 1000% more illegal immigrants than it did in 1994.", "South Africa has the largest number of convicted criminals in its parliament.", "25% of South African schoolgirls are HIV positive.", "South African schoolgirls had 100,000 abortions last year.", "In 19 years the rand has weakened from R3.41 to R10.00 to the dollar.", "The petrol price went from R1.73 to R12.83 per litre in the past 19 years.", "Please complete this form to receive the HTML sharing code.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "For democracy to function, public figures need to be held to account for what they say. The claims they make need to be checked, openly and impartially. Africa Check is an independent, non-partisan organisation which assesses claims made in the public arena using journalistic skills and evidence drawn from the latest online tools, readers, public sources and experts, sorting fact from fiction and publishing the results.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "© 2023 - Africa Check - All rights reserved.", "We will never charge you for verified, reliable information. Help us keep it that way by supporting our work.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "Support independent fact-checking in Africa."]