["About this rating", "On Oct. 4, 2019, the Potatriots Unite website published an article positing that U.S. House Speaker Nancy Pelosi had diverted $2.4 billion from Social Security in order to cover the costs of an impeachment investigation into President Trump:", "Pelosi Diverts $2.4 Billion From Social Security To Cover Impeachment Costs", "Freedom isn’t free, the saying goes. And neither is the opposite of freedom, which for today’s purpose, is the impeachment of President Donald Trump. Counting legal fees for a slew of legal teams, experts, time, maintenance, and constant deliveries of Chardonnay, you and I, Mr. and Mrs. Taxpayer, are looking at about 2 and a half billion dollars. Hope your boss can give you a raise.", "This item was not a factual recounting of real-life events. The article originated with a website that describes its output as being humorous or satirical in nature, as follows:", "Everything on this website is fiction. It is not a lie and it is not fake news because it is not real. If you believe that it is real, you should have your head examined. Any similarities between this site’s pure fantasy and actual people, places, and events are purely coincidental and all images should be considered altered and satirical.", "In January 2020, a variant appeared in the form of a viral YouTube video declaring that \"Pelosi Steals Closer To $5 Billion From Social Security To Pay For Impeachment - Not $2.4 Billion\":", "The video derives its premise and many of its claims from the Potatriots Unite article, which, although the page itself is shown on the screen, the video maker does not acknowledge is fictional.", "Why We Include Humor and Satire in Snopes.com", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]