["About this rating", "On Jan. 18, 2021 — also known as MLK Day in commemoration of late civil rights leader the Rev. Martin Luther King Jr. — his daughter Bernice King posted a message on Twitter that quickly went viral. King's post bemoaned how the praise received after her father's death did not reflect how he was treated in his life. She said:", "A number of people shared this tweet on MLK Day in the form of a screenshot on numerous social media accounts including on Instagram, where many posted it again on Instagram stories. They also noticed something unusual: Instagram had flagged their story with a note saying, “See why this may be misleading.”", "According to these users, clicking on the note led to a post stating “False Information: Leading health organizations say information in this post may mislead people about vaccines.” Evidently, since the post itself had nothing to do with vaccines, some users assumed that there was a glitch, while others claimed this was Instagram’s attempt at censorship.", "We spoke to Instagram user alexys_davis who saw the flag go up on their account on MLK Day after reposting the King tweet. The flag remained on the story all day, according to this user. When we checked again on Jan. 21, the user said that the flag was no longer there, and we verified this by sharing the same post on a personal account. Since Instagram stories disappear after 24 hours, we could only rely on screenshots from MLK Day as evidence that such flagging had indeed occurred.", "We reached out to Facebook — Instagram's parent company — and received confirmation from a spokesperson for Instagram that those posts had indeed been flagged on that day.", "“Our systems mistakenly labeled screenshots of this Tweet as vaccine misinformation,” said Raki Wane. “We have now removed the incorrect label on these posts.”", "Given that Facebook/Instagram confirmed that King’s tweet had been temporarily flagged due to an error in their system, we rate this claim as “True.”", "Nur Nasreen Ibrahim is a reporter with experience working in television, international news coverage, fact checking, and creative writing.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]