["About this rating", "A bill passed by the New Jersey state Senate would require candidates for President or Vice-President to disclose their tax returns as a condition of having their names listed on ballots.", "The bill still needs to be passed by the state Assembly and signed by the governor to become law.", "One of the many controversial aspects of Donald Trump's political career has been his continued refusal to release his tax returns to the public, despite his having promised to do so multiple times (starting before he even announced his candidacy for the 2016 presidential campaign).", "Candidates for the office of President of the United States are required to file public financial disclosure reports with the Federal Election Commission (FEC).  Although the FEC disclosure regulations don't specifically require candidates to make their tax returns public, every major party presidential nominee since 1976 has done so voluntarily (with the exception of Gerald Ford, who didn't release his actual tax returns in 1976 but did at least provide summary data about his federal taxes for the previous nine years).", "Some major party presidential nominees have released tax returns from multiple years, while others have released only a few years' worth, but Trump remains the only one in the last several decades who has not disclosed any tax returns at all.  (A portion of Trump's 2005 federal tax return was leaked to the public.)", "Now, some individual states are making efforts to require presidential candidates to release their tax returns.  On 21 February 2019, for example, the New Jersey state Senate passed a bill (S119) that would require candidates for President or Vice-President to provide the Division of Elections with copies of their federal income tax returns for the five most recent taxable years, and agree to disclose those returns to the public, as a condition of having their names listed on ballots.", "And, in order to preclude candidates from skirting that regulation through succeeding at write-in campaigns, that same bill would prohibit New Jersey electors from casting Electoral College ballots for any candidates for President or Vice-President who have not provided copies of their tax returns.", "Not surprisingly, reaction to the bill was divided along partisan lines:", "State Senate Majority Leader Loretta Weinberg, D-Bergen, said there are two reasons releasing tax returns should be mandatory for those seeking the White House. One, she said, is that voters deserve to know every candidate “without compromise.”", "“They must know, unequivocally, that the person they vote for is invulnerable to blackmail, coercion or intimidation of any kind due to financial liabilities,” Weinberg said.", "Two, she said, is that voters have the right to know that “no action taken by an administration is motivated by personal financial gain, as opposed to the good of the republic.”", "Still, state Sen. Joseph Pennachio, R-Morris, said Democrats are showing hypocrisy because New Jersey’s governor and state lawmakers are not required to release their returns. Pennachio suggested an amendment to the bill requiring them to be included, but it was shot down.", "“Clearly, their bill is nothing more than a thinly veiled political stunt to keep President Trump off the ballot,” Pennachio said. “It shows that they are unwilling to hold themselves to the same standard”", "The New Jersey bill still needs to be passed by the state Assembly and signed by the governor before becoming law, and even then it would be subject to legal challenges.  Former New Jersey governor Chris Christie vetoed a similar bill in 2017, declaring it to be \"clearly unconstitutional\" and a \"transparent political stunt masquerading as a bill.\"", "Likewise, the California state legislature passed a similar tax disclosure measure in 2017, but it was vetoed by Gov. Jerry Brown on the grounds that \"it may not be constitutional\" and would set a \"‘slippery slope’ precedent.\"", "In 2018, the state Senates of  Maryland and Rhode Island passed similar measures, but in both cases those bills failed to clear committee in the House.", "In 2019, the Judiciary Committees of the Hawaii state Senate and House of Representatives have both cleared bills requiring executive branch candidates to disclose their federal income tax returns, but neither body has put it to a floor vote yet.", "Even if the New Jersey bill were enacted, it is unlikely to sway the 2020 presidential election by denying President Trump a spot on the ballot, given that the state provides only 14 electoral votes and  voted overwhelmingly Democratic in the 2016 election.  But that handful of electoral votes could be the difference in a race as close as the one in 2000 was, and of course the effect would be magnified if other states enacted similar legislation prior to the election.", "Johnson, Brent.   \"Christie Kills Bill Forcing Trump to Release Tax Returns in N.J. If He Runs Again.\"\r\n    NJ.com.   1 May 2017.", "Johnson, Brent.   \"N.J. Dems Could Boot Trump from Ballot in 2020 with This Law.\"\r\n    NJ.com.   22 February 2018.", "Silverstein, Jason.   \"The Many Times Donald Trump Promised He Was Going to Release His Tax Returns.\"\r\n    [New York] Daily News.   16 April 2017.", "Siders, David.   \"Jerry Brown Vetoes Bill to Pry Loose Trump's Tax Returns.\"\r\n    Politico.   16 October 2017.", "McCammond, Alexi.   \"The Big Picture: The State Efforts to Keep Trump Off the 2020 Ballot.\"\r\n    Axios.   24 June 2019.", "Gregg, Katherine.   \"R.I. Bill Would Require Presidential Hopefuls to Release Tax Returns.\"\r\n    Providence Journal.   19 June 2018.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]