["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Sen. Rand Paul, R-Ky., discussed health insurance policy with John Oliver on \"The Daily Show.\"", "During a recent appearance on The Daily Show, guest host John Oliver and Sen. Rand Paul, R-Ky., engaged in a lively exchange on health insurance and why people buy it or not.", "Paul, an eye surgeon, is strongly opposed to President Barack Obama’s health care law. During the interview, Oliver pressed him on how to get more Americans signed up for insurance.", "Paul indicated that the biggest issue is affordability, particularly for young, healthy and relatively affluent people.", "According to the most recent statistics, he said, \"85 percent of people had insurance, so 15 percent didn't. So what you need to do is look at who are the 15 percent, and why don't they have insurance? Of the 15 percent who didn't have insurance, half of them made more than $50,000 a year. Why didn't they buy insurance? Because of the expense. They were young healthy people.\"", "In this fact-check, we’ll check his claim that half of the uninsured made more than $50,000 a year. In a separate report, we’ll look at whether the cost of insurance is the biggest barrier to uninsured Americans.", "We’ll start by noting that Paul is very close to the mark when he says 15 percent of Americans don’t have insurance. The most recent Census Bureau statistics for 2011 show that 15.7 percent of Americans are uninsured.", "What about the income breakdown for that 15 percent? There are a few different ways to slice the data, but none produces a number for $50,000-plus earners that reaches the 50 percent level Paul offered on The Daily Show.", "In a September 2012 paper, the Employee Benefits Research Institute looked at 2011 census data on health coverage. It found that 28 percent of the uninsured earned at least $50,000. That’s quite a bit lower than what Paul had indicated.", "The highest plausible percentage cited by our experts -- who included both liberals and conservatives -- used census data for households rather than for individuals. Using this method, 37.5 percent of the uninsured live in a household with an income above $50,000.", "Why the variation between household and individual data? Uninsured young adults who are roommates might live in a household where all roommates collectively make more than $50,000, even if each roommate individually earns much less. This type of living arrangement tends to boost the count of uninsured adults who \"earn\" more than $50,000, even if they really don’t make that much individually.", "This difference in counting methods matters in this sort of statistical comparison because people without health insurance \"are more likely to be living in less-common housing arrangements -- more in multi-generation families, more living with people who aren't related to them,\" said Hanns Kuttner, a senior fellow at the Hudson Institute.", "When we showed our calculations to Paul’s office, communications director Moira Bagley said there’s significant uncertainty in the Census data due to \"inexact data collection\" that \"under-reports the numbers of people who actually have health insurance.\"", "This refers to an argument made by some critics of Obamacare that the Census Bureau undercounts Medicaid recipients compared to the total cited by the Centers for Medicare and Medicaid Services. Subtracting these uncounted Medicaid recipients leaves the pool of uninsured Americans relatively better off.", "However, each of the seven ideologically diverse health policy experts we talked to for this story used the census numbers when we asked them to evaluate Paul's claim, and none expressed concerns about the ability of the census data to fairly evaluate the question.", "Our ruling", "Paul said that of the roughly 15 percent of Americans who don’t have health insurance, \"half of them made more than $50,000 a year.\" In reality, if you measure what individuals make, Census data shows that 28 percent of uninsured Americans earn $50,000. By another measure, using household income, almost 38 percent of uninsured Americans earn at least $50,000. Both of these figures are pretty far from the 50 percent Paul cited in the interview. We rate his claim False.", "Rand Paul, interview on Comedy Central’s The Daily Show, Aug. 12, 2013", "Kaiser Family Foundation, \"The Uninsured: A Primer,\" October 2012", "Employee Benefit Research Institute, \"Sources of Health Insurance and Characteristics of the Uninsured: Analysis of the March 2012 Current Population Survey,\" September 2012", "Thomas P. Miller, \"What DO We Know About the Uninsured?\" July/August 2008", "U.S. Census Bureau, press release for \"Income, Poverty and Health Insurance Coverage in the United States: 2011,\" Sept. 12, 2012", "U.S. Census Bureau, \"Annual Social and Economic (ASEC) Supplement, Table HI01. Health Insurance Coverage Status and Type of Coverage by Selected Characteristics: 2011,\" accessed Aug. 13, 2013", "PolitiFact, \"Newt Gingrich says a \"large number\" of the uninsured make more than $75,000,\" June 15, 2011", "Weekly Standard, \"The Real Number of Uninsured Americans: It's nowhere near 50 million Americans,\" Dec. 29, 2010", "Email interview with Gail Wilensky, former head of Medicare and Medicaid under President George H.W. Bush, Aug. 13, 2013", "Email interview with Jonathan Oberlander, health policy professor at the University of North Carolina School of Medicine, Aug. 13, 2013", "Email interview with Jonathan Gruber, economist at the Massachusetts Institute of Technology, Aug. 13, 2013", "Email interview with Thomas P. Miller, resident fellow at the American Enterprise Institute, Aug. 13, 2013", "Email interview with Henry Aaron, senior fellow at the Brookings Institution, Aug. 13, 2013", "Email interview with Edwin Park, vice president for health policy at the Center on Budget and Policy Priorities, Aug. 13, 2013", "Email interview with Hanns Kuttner, senior fellow at the Hudson Institute, Aug. 13, 2013", "Email interview with Moira Bagley, communications director for Sen. Rand Paul, Aug. 14, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]