["About this rating", "On July 26, 2020, a message was posted to Twitter claiming that U.S. President Donald Trump's 2020 election campaign had announced that conservative commentators Diamond and Silk, musician Ted Nugent, and actors Scott Baio and Antonio Sabato Jr. would be speaking via Zoom at the Republican National Convention:", "This message went viral as social media users mocked the Trump campaign for inviting what some would consider \"D-List\" celebrities to speak at the GOP convention, which is scheduled for August. But while Baio, Nugent, Sabato, and Diamond and Silk are all supporters of Trump, the Trump campaign has not officially announced this lineup of speakers at the convention.", "Mike Sington, the Twitter user who originally posted this message, confirmed to The Associated Press that this tweet was intended to be a joke.", "The Trump War Room, a Twitter account managed by the president's campaign, labeled the message as \"fake news\":", "The schedule for the 2020 Republican National Convention has undergone some changes this year, in large part because of the ongoing COVID-19 crisis. The convention was scheduled for Aug. 24-27 in Charlotte, North Carolina, and Jacksonville, Florida, but the Florida portion of event has been canceled.", "As of this writing, a pared-down version of the convention will still take place in Charlotte, but much of the event is expected to take place online. The RNC has not announced a list of guest speakers for the event, and Trump is expected to only make a virtual appearance:", "The Charlotte Observer writes:", "On Thursday President Trump abruptly canceled the four days of celebratory pomp and speeches in Jacksonville, scheduled to take place in just a month. He cited the dangers of the coronavirus, which is surging in Florida.", "GOP officials confirmed Friday that the shorter business portion of the event will still take place in Charlotte on August 24. That includes the actual nominations of the president and vice president.", "[...]", "Trump is not expected to be in Charlotte. In Thursday’s announcement, he said he could do “tele-rallies.” A GOP official said organizers are still planning four nights of convention programming, even virtual, though details aren’t final.", "Meanwhile, the Democratic National Convention is also expected to be a largely virtual affair.", "Although the RNC has not announced that Nugent, Baio, Sabato, or Diamond and Silk would be speaking at the 2020 RNC — as of this writing, no announcements concerning guest speakers have been made — this fictional lineup isn't far-fetched. Baio and Sabato both spoke at the 2016 RNC.", "Merry, Stephanie.   \"Who Are Scott Baio and Antonio Sabato Jr. and Why Are They at the Republican Convention?\"\r\n    The Washington Post.   18 July 2016.", "O'Reilly, Andrew and Paul Steinhauser.   \"Trump Announces Jacksonville Part of GOP Convention Will be Canceled Over Coronavirus Concerns.\"\r\n    Fox News.   24 July 2020.", "Seitz, Amanda.   \"Tweet Falsely Claims Announcement of RNC Speaker Lineup.\"\r\n    The Associated Press.   27 July 2020.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]