["This campaign image bears the logo of V15, a group that mobilized anti-Likud voters. Some have linked U.S. State Department funds to that effort.", "Did President Barack Obama spend U.S. taxpayer dollars trying to toss Israeli Prime Minister Benjamin Netanyahu out of office?", "That’s a claim floating around conservative media websites in recent days. A conservative blog called Fire Andrea Mitchell was one of several to relay a Fox News report about alleged back-door funding in the recent Israeli elections. On March 16, 2015, the blogger wrote \"Obama has been sending taxpayer dollars, at least $350,000 to fund anti-Likud, anti Netanyahu groups in Israel for tomorrow’s election.\"", "Fox News said a congressional investigation into the matter is underway, and presidential contender Sen. Ted Cruz, R-Texas, along with Rep. Lee Zeldin, R-N.Y., sent a letter about this to federal officials \"to express our strong concerns over recent media reports.\"", "What are the facts of the matter?", "The basis of the claim", "In September 2013, the State Department funded two projects run by OneVoice, a New York nonprofit. The OneVoice mission is clear -- to advance a two-state solution in Israel and the Palestinian territories.", "\"Through OneVoice, young grassroots activists in Israel and Palestine are equipped with the knowledge and skills to be heard as they build momentum and a constituency for the two-state solution locally and internationally,\" the organization wrote in its 2013 annual report.", "Affiliates OneVoice Israel got $233,500 from the State Department to spend in Israel and OneVoice Palestine got another $115,776 to spend in the Palestinian Territories. That adds up to a little more than $349,000.", "The question is: Do those contributions amount to funding \"anti-Likud, anti-Netanyahu groups in Israel for tomorrow’s election\"?", "How OneVoice says the money was spent", "Given that residents of the Palestinian Territories can’t vote in national Israeli elections, it’s hard to see how money spent there would influence voters in Israel. That leave us to account for $233,500.", "Payton Knopf, senior director of global communications for OneVoice, said the money helped fund a series of \"town-hall style meetings on university campuses and provided support to the Knesset Caucus for the Two-State Solution in organizing a meeting with 300 Israeli students and (Palestinian Authority President Mahmoud) Abbas in February 2014.\"", "Knopf told us the State Department money was spent by November 2014 -- nearly four months ago. OneVoice, he said, never \"spent any U.S. government funds in connection with the recent elections in Israel.  Claims to the contrary are simply wrong.\"", "There are two important points to unpack there. If OneVoice says it spent the money by November 2014, that would be before the Israeli elections were even scheduled. That happened in December after Netanyahu called for early elections.", "The State Department said in a briefing that \"no payment was made to OneVoice after November 2014.\"", "That would contradict the way the claim in the blog was phrased. \"Has been sending\" says the money continues to flow. In this case the money was spent and disbursed months ago.", "Second, while Netanyahu waffled on the notion of a two-state solution in the run-up to the Israeli elections, the prime minister had been on record supporting a two-state strategy in November and the months before it.", "Where it gets complicated", "Put aside OneVoice’s explanation for a second.", "In January 2015, after the Israeli elections had been scheduled, OneVoice announced a partnership with V15, a new Israeli voter mobilization project. The partnership’s mission, as stated in its press release, was to \"disrupt the status quo.\"", "Using methods honed from the Obama campaign, including a key staffer from the president’s 2012 field operation, V15 aimed to put a center-left coalition into power. While its leaders officially denied that they opposed Netanyahu, it was a difference without a distinction. V15 wanted a government that would do more than Netanyahu’s Likud Party to negotiate with the Palestinians.", "(All you have to do is read parts of V15’s statement after Netanyahu’s victory to know where the group stands: \"A confusing night turned into a painful morning,\" the group said, according to a translation from Arutz Sheva. \"It was painful not because we lost, but because we have no faith in the winners.\")", "So the connecting of the dots goes like this. Obama’s State Department gives OneVoice money. OneVoice trains student activists. Later, OneVoice strikes up a partnership with V15, which is aided by a former Obama campaign hand. V15, a voter mobilization project, wants to \"disrupt the status quo.\" The status quo in this case is Netanyahu.", "A limited money trail", "The connections between OneVoice, Obama and V15 may raise plenty of questions, but they don’t prove that U.S. tax dollars funded \"anti-Likud, anti Netanyahu groups in Israel for tomorrow’s election.\"", "Gerald M. Steinberg is a professor at Bar Ilan University and head of NGO Monitor, a project that aims to prevent nonprofit meddling in Israeli affairs.", "Steinberg is suspicious that State Department dollars helped V15, at least indirectly, but he can’t know for sure based on the information available.", "In a draft report Steinberg shared with PunditFact, all he has are questions.", "\"Did OneVoice use U.S. government funds to launch V15? If not, and since money is fungible, did U.S. government funds free up other OneVoice financing to facilitate V15? Full transparency on the parts of the U.S. State Department, OneVoice, and V15 is necessary to verify or disprove the allegations and claims.\"", "IRS regulations prohibit a not-for-profit OneVoice from campaigning directly for or against a candidate from office. But there are allowances when it comes to campaigning for issues (a two-state solution) or for promoting civic engagement, which would include voting. It’s worth noting that about a month before the election, the parent organization of OneVoice created PeaceWorks Action, a 501(c)4 group. That IRS designation allows it to engage in outright political lobbying.", "Funding OneVoice was entirely in line with the administration’s agenda. As far back as 2009, Hillary Clinton said in her Senate confirmation hearing to be secretary of state that in pursuit of a state for Palestinians \"we will exert every effort to support the work of Israelis and Palestinians who seek that result.\"", "Our ruling", "A conservative blog claimed, \"Obama has been sending taxpayer dollars, at least $350,000 to fund anti-Likud, anti Netanyahu groups in Israel for tomorrow’s election.\"", "First, there is the matter of the dollar amount. If any U.S. money was used to mobilize anti-Likud voters, it would have been in Israel. A more accurate figure would be $233,500.", "Next, there is a matter of the blog’s tense. \"Has been sending\" says the action is continuing. In this case, the money stopped flowing in 2014, before elections were called in Israel.", "Finally, the allegation that the money was spent to fund anti-Likud, anti-Netanyahu groups in Israel for the election is based on speculation. Yes, Obama sent money to OneVoice, a group that promoted a two-state solution. And yes that group partnered with a different group V15 that wanted Netanyahu defeated. But there is no paper trail that the money given to OneVoice was spent on an electoral ground game. It would be naive to ignore that OneVoice’s policy positions mesh well with V15’s voter mobilization, but that’s different from saying that American taxpayer dollars were spent by V15.", "That may change as more evidence comes to light.", "PunditFact’s rulings are based on when a statement was made and on the information available at that time. This claim rates Mostly False.", "Fire Andrea Mitchell, Obama funneled $350,000 federal funds to anti-Likud One Voice Movement and Victory 15, March 16, 2015", "Fox News, Source: Senate panel probing ‎possible Obama administration ties to anti-Netanyahu effort, March 15, 2015", "One Voice Movement, website", "One Voice, 2013 Annual report", "U.S. State Department, Daily press briefing, Jan. 28, 2015", "U.S. State Department, Daily press briefing, Jan. 29, 2015", "One Voice, Press release: OneVoice Israel Partners with V15 to Change Status Quo, Jan. 27, 2015", "Haaretz, The Obama campaign strategist who could break the Israeli elections wide open, Jan. 26, 2015", "Office of Sen. Ted Cruz, Letter to IRS re: OneVoice, March 3, 2015", "Fox News, Obama-linked nonprofit filed for new IRS status after accusation of meddling in Israeli election, March 17, 2015", "USAspending.gov", "NGO Monitor, About", "Polititainment, Israel Rejects Progressive Insurgency, March 18, 2015", "U.S. State Department, Investing in People in The Middle East and North Africa", "Congressional Research Service, Foreign Assistance Act of 1961: Authorizations and Corresponding Appropriations, July 29, 2011", "Kansas University, Funding opportunities bulletin, June 2013", "Ryan Jabloski, How Foreign Aid Affects Election Outcomes,  2013 International Political Economy Society Conference", "Washington Post, U.S. Funds Enter Fray In Palestinian Elections, Jan. 21, 2006", "U.S. Agency for International Development, Middle East", "Congressional Research Service, Democracy Promotion: Cornerstone of  U.S. Foreign Policy?, Dec. 26, 2007", "Congressional Research Service, U.S. Public Diplomacy: Background and Current Issues , Dec. 18, 2009", "Congressional Research Service, Israel: Background and U.S. Relations, Feb. 27, 2015", "Congressional Research Service, Israeli-Arab Negotiations: Background, Conflicts, and U.S. Policy , Jan. 29, 2010", "White House Press Office, Remarks by the president on a new beginning - Cairo University, June 4, 2009", "Time, Interview with President Barack Obama, Jan. 15, 2010", "One Voice Israel Facebook page", "Christian Science Monitor, In Israeli leftist stronghold, optimism – but votes for Netanyahu, too, Nov. 17, 2015", "Email interview, Payton Knopf, senior director of global communications, One Voice, March 19, 2015", "Email interview, Gerald M. Steinberg, professor, Bar Ilan University, March 20, 2015", "Email interview, Samantha Sutton, spokeswoman, U.S. State Department, March 20, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]