["About this rating", "The problem of gun crime in the United States, and in particular mass shootings in schools and other public places, has defied universally accepted solutions for the past couple of decades.", "One common proposition, particularly popular among conservatives, is that the primary cause of such shootings is a disintegration of traditional morality and Christian values in the United States.", "That viewpoint found its way into a Texas U.S. Senate election debate in September 2018, when incumbent Republican senator Ted Cruz argued that \"removing God from the public square\" and \"losing the moral foundation of much of our society\" were partly to blame for school shootings:", "Let me say, as the father of two daughters, there is something deeply wrong that we have these shootings. There are a lot of things behind it that have nothing to do with government. They have things to do with things like removing God from the public square, like losing the moral foundation of much of our society, like losing the binds of community and family.", "On Twitter, John Rehling criticized what he perceived as Cruz's argument, offering some comparative statistics on religious affiliation and gun crime in Japan and the state of Texas:", "Ted Cruz said that school shootings take place because we removed \"God from the public square.\" Texas is 93% Christian and has a fatal school shooting every year. Japan is 2% Christian and has never had a school shooting. Worst theory ever", "Ted Cruz said that school shootings take place because we removed \"God from the public square.\"", "Texas is 93% Christian and has a fatal school shooting every year.", "Japan is 2% Christian and has never had a school shooting.", "Worst theory ever.#TXSenateDebate", "— JRehling (@JRehling) September 22, 2018", "Rehling's tweet was later reposted by the pro-science Facebook page Skepticus, garnering further exposure for his claims:", "The numbers included in Rehling's tweet were very accurate (although not perfectly so), and the best evidence we found in some instances actually offered stronger support for his overall argument: Christians do indeed make up a large majority of residents of Texas, where on average even more than one fatal school shooting takes place every year.", "Christians likely make up even less than two percent of the population in Japan, which has no recorded instance of a fatal school shooting, and which has a rate of gun death more than 500 times lower than that seen in the United States.", "\"93 percent Christian\"", "This number appears to be a slight exaggeration, but Rehling's broader point, that Texas is  overwhelmingly Christian, still stands.", "According to the Pew Research Center's 2014 \"Religious Landscape Study,\" 77 percent of Texans identified as Christian, with evangelical Protestants (31 percent) and Catholics (23 percent) making up the bulk of that contingent. This rate of Christian affiliation ranked joint seventh-highest in the United States. (Louisiana had the highest at 86 percent, and Vermont the lowest at 54 percent.)", "\"A fatal school shooting every year\"", "No official government database tracks shootings that take place in schools or colleges in the United States, so it's not possible to arrive at a definitive number, but the rate mentioned by Rehling for Texas (one fatal school shooting per year) appears to be a slight underestimation.", "Perhaps the most reliable and comprehensive unofficial source of data on school shootings is the Gun Violence Archive (GVA), which defines a school shooting as \"an incident that occurs on property of the elementary, secondary or college campus where there is a death or injury from gunfire.\"", "According to GVA data, Texas experience:", "So between January 2015 and October 2018, an average of 2.5 fatal school shootings took place in Texas per year, leading to an average of five deaths per year (although the latter figure is heavily skewed by the May 2018 Santa Fe high school shooting, in which 10 people were killed).", "If one limits the numbers to only include fatal shootings in elementary, middle, and high schools, seven such incidents were recorded between 2015 and 2018, leaving an average of 1.75 shootings per year.", "Another comprehensive database is the one maintained by Everytown for Gun Safety. Although Everytown is not impartial on the issue of gun violence (they advocate for stricter gun control laws), their database contains good references and sourcing for every such incident, and it also records shootings at colleges as well as elementary and high schools.", "According to Everytown, Texas schools experienced:", "Based on those figures, an average of exactly one fatal school shooting per year took place between 2013 and 2018, with an average of 2.5 deaths per year. If one includes suicides, two fatal school shootings occurred per year between 2013 and 2018, accounting for 3.7 deaths per year.", "Although methodologies and figures vary, Rehling's claim of \"a fatal school shooting every year\" in Texas appears to be a very conservative estimate, and likely a significant understatement. Our determination, based on the reliable data sources we consulted, actually provides greater support for Rehling's broader argument.", "\"2% Christian\"", "This figure actually appears to be a somewhat generous estimate of the prevalence of Christianity in Japanese society. According to the Pew Research Center's \"Global Religious Landscape\" study, 1.6 percent of people in Japan identified as Christians in 2010.", "A November 2017 Pew Research Center presentation cited two sources which gave even lower estimates. According to the University of Michigan's Japanese General Social Survey, 0.7 percent of Japanese people identified as Christians in 2015, and according to Japanese government research from 2015 the figure was 1.5 percent.", "Although Rehling's figure of \"2% Christian\" appears to be a slight overstatement, our determination once again actually offers greater support to his broader argument.", "\"Has never had a school shooting\"", "We could find no record of a shooting (fatal or otherwise) having taken place at a school or university in Japan in recent memory. Rehling's assessment is accurate: what is a frequent phenomenon in the United States, including Texas, simply does not happen in Japan.", "On the whole, Japan has among the lowest rates of gun crime in the developed world. For example, the rate of gun deaths per 100,000 people was 0.02 in Japan in 2014, according to GunPolicy.org, a research initiative run by the University of Sydney, Australia. In the United States, the gun death rate was 10.54 in 2014, a figure that's more than 500 times higher.", "A 2016 article on the Japan Times news website asked \"What are the chances of a mass shooting in Japan?\" and outlined the strict laws and procedures surrounding gun ownership there:", "In Japan, citizens are banned from possessing, carrying, selling or buying handguns or rifles. Importing gun parts is also prohibited under the Firearm and Sword Control Law. Only licensed hunters are allowed to own shotguns, and the screening process is very strict.", "Applicants are required to obtain a license from a local government and undergo background checks by police as well as mental and drug tests at hospitals. The gun license must be renewed every three years, and applicants are required to again undergo the various tests.", "Shotgun owners are also required to store their weapons in a specified locker at their home and report its location to police. Ammunition must be kept in a separate locked safe.", "Pew Research Center.   \"Religious Landscape Study.\"\r\n    2014.", "Pew Research Center.   \"The Global Religious Landscape.\"\r\n    December 2012.", "Yoshida, Reiji.   \"What Are the Chances of a Mass Shooting in Japan?\"\r\n    The Japan Times.   13 June 2016.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]