["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "• There is no evidence that a helicopter transporting U.S. service members was recently shot down in Afghanistan.", "• Similar claims have been circulating on the internet as far back as 2017.", "• In 2011, insurgents in Afghanistan shot down a helicopter and killed 30 U.S. service members, including several Navy SEALs.", "When a national tragedy happens, it’s not uncommon for social media users to post requests for thoughts and prayers. It’s puzzling, however, when there is no record of the recent tragedy.", "This seems to be the case with social media claims about a downed U.S. military helicopter.", "A Facebook post on June 6 asks users to acknowledge the deaths of 30 U.S. service members killed in Afghanistan.", "\"I am asking everyone to please take a moment of silence for the United States Navy Seal Team and their families,\" the post says. \"Their helicopter was shot down yesterday in Afghanistan and they lost 30 members of the team.\"", "This attack was not lost in the news of 2020. It happened in 2011.", "On Aug. 6, 2011, in what History.com referred to as the \"the costliest day in SEAL Team Six history,\" insurgents in Afghanistan shot down a Chinook transport helicopter, killing 30 U.S. service members and eight Afghans.", "Twenty-two of the service members who died were Navy SEALs (not 30, as the post says). Most were members of SEAL Team 6, the unit that carried out the mission to kill Osama bin Laden. (Officials said none involved in the raid died in the helicopter attack.)", "So it really happened, but not \"yesterday.\"", "This request for prayers has been circulating for years. Back in September 2017, the fact-checking organization Snopes.com explained that a nearly identical social media post was based on an outdated event.", "The Taliban claimed responsibility for the attack. American officials would say only that insurgents shot down the helicopter.", "A social media post about a helicopter crash in Afghanistan says it happened \"yesterday.\" But the attack was in 2011, not 2020.", "We rate this claim Mostly False.", "Snopes.com, \"Prayer Request for 30 SEALs Killed in Afghanistan,\" Sept. 25, 2017", "ABC News, \"30 Americans Killed Including 22 SEALs When Afghan Insurgents Shoot Down Helicopter,\" Aug. 6, 2011", "History.com, \"The Costliest Day in SEAL Team Six History,\" Aug. 22, 2018", "CNN, \"U.S. official: Killed forces were reinforcing troops in Afghanistan,\" Aug. 7, 2011", "Washington Post, \"22 Navy SEALs among 30 U.S. troops killed in Afghanistan as NATO helicopter is shot down,\" Aug. 6, 2011", "CBS News, \"22 Navy SEALs dead in Afghan chopper crash,\" Aug. 6, 2011", "New York Times, \"Copter Downed by Taliban Fire; Elite U.S. Unit Among Dead,\" Aug. 6, 2011", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]