["The graphic was shared in this Facebook post on May 7, 2020.", "It bears a logo that reads “TV48” and claims that COVID-19 lockdown measures in certain areas, including in the capital Manila, have been extended until May 30.", "Below is a screenshot of the misleading post:", "The text overlaid in the graphic states: “Enhanced Community Quarantine EXTENDED Until May 30, 2020”.", "The extension, according to the graphic, supposedly applies to the following areas: “NCR / CALABARZON/ BENGUET/ PANGASINAN / BATAAN / BULACAN / NUEVA ECIJA / PAMPANGA / TARLAC / ZAMBALES / ILOILO / CEBU / CEBU CITY / DAVAO DEL NORTE / DAVAO CITY / ORIENTAL MINDORO / OCCIDENTAL MINDORO / ALBAY / CATANDUANES / ANTIQUE”.", "The post’s caption states: “ECQ extended until may 30 2020 / #stayathome”.", "Enhanced Community Quarantine (ECQ) refers to the COVID-19 lockdown measures that the Philippine government imposed on the main island Luzon on March 17, 2020.", "The measures, which were initially bound to lapse on April 13, were extended to April 30, and then again to May 15 in certain areas, according to this government press release.", "The same graphic was also shared here and here on Facebook. Another version of the graphic claiming the lockdown was extended to May 25 was published on Facebook here, here and here.", "The claims, however, are false.", "The graphic was manipulated from an original report published on Facebook here on April 24, 2020, by Nueva Ecija TV48, a provincial television station in the Philippines. The original graphic accurately reported at the time that the government had extended COVID-19 restrictions in certain areas until May 15.", "On May 6, TV48 disowned the doctored graphic claiming the lockdown was extended to May 30, saying in a Facebook statement that it was “fake news”.", "“The management of Nueva Ecija TV48 announces that reports using the station logo about the Enhanced Community Quarantine being extended until May 30, 2020 are fake news,” the station’s Tagalog-language statement reads in part.", "Below is a screenshot of the statement, showing a side-by-side comparison of the original graphic and the doctored image stamped “FAKE NEWS”:", "As of May 10, the Philippine government has not announced any lockdown extension after May 15.", "In this video posted to Facebook on May 7, 2020, the presidential communications agency told the public to keep following ECQ guidelines but did not mention a lockdown extension.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]