["By D'Angelo Gore", "Posted on November 28, 2018", "President Donald Trump wrongly tweeted that the largest federal appellate court, the U.S. Court of Appeals for the 9th Circuit, is “overturned more than any circuit in the country, 79%.”", "During the 2017 term, the Supreme Court reviewed just 15 of the thousands of cases ruled on by the 9th Circuit, which covers nearly a dozen Western states and territories. The high court ended up reversing 12 rulings, affirming two and splitting 4-4 on another. That’s a reversal rate of 80 percent, which was not the highest of any appellate court.", "Even though they had a smaller number of rulings reversed, three other appellate courts (the 1st Circuit, 3rd Circuit and 6th Circuit) had higher percentages of their Supreme Court-reviewed decisions overturned, according to SCOTUSblog statistics.", "In fact, over an even longer period of time, from 2006 to 2015, the 9th Circuit’s reversal rate of more than 81 percent was only the second highest, according to a 2016 journal article written by U.S. Circuit Judge Timothy B. Dyk. The 6th Circuit, at nearly 84 percent, had the highest reversal rate during that time span.", "It’s possible Trump was referring to the percentage of 9th Circuit rulings that were reviewed and reversed between 2010 and 2015, which still wouldn’t be the highest. Even Fox News, from which he got the 79 percent figure, said the president’s tweet was wrong.", "Trump’s most recent attack on the 9th Circuit came after U.S. District Judge Jon Tigar issued an order that temporarily blocks the Trump administration from prohibiting certain migrants from applying for asylum in the United States.", "In a Nov. 22 tweet responding to Chief Justice John Roberts, who criticized the president for calling Tigar an “Obama judge,” Trump claimed that the 9th Circuit Court “is out of control, has a horrible reputation” and “is overturned more than any Circuit in the Country, 79%.”", "Justice Roberts can say what he wants, but the 9th Circuit is a complete & total disaster. It is out of control, has a horrible reputation, is overturned more than any Circuit in the Country, 79%, & is used to get an almost guaranteed result. Judges must not Legislate Security…", "— Donald J. Trump (@realDonaldTrump) November 22, 2018", "To be clear, Trump’s tweet refers to the record of the 9th Circuit Court of Appeals. But Tigar sits on a district court for the Northern District of California. The White House says it will appeal Tigar’s court order, which will be reviewed by 9th Circuit Court of Appeals.", "The White House did not tell us Trump’s source for the 79 percent figure, although he seemed to attribute it to Fox News in another tweet attacking the 9th Circuit. But that media outlet has since written that the figure doesn’t mean what the president said it does.", "“While Trump was correct that 79 percent of the Ninth Circuit Court’s ruling that the Supreme Court heard were overturned – at least between 2010 and 2015 – its reversal rate is not the absolute highest in the country,” Fox News reporter Andrew O’Reilly wrote the day Trump sent his tweet. “That title would go to Sixth Circuit, which serves Ohio, Michigan, Kentucky and Tennessee, with an 87 percent average between 2010 and 2015.”", "We would also point out that the Supreme Court consistently overturns the majority of the lower court decisions that it reviews, and it reviews only a very small percentage of the rulings issued by circuit courts each year. The Supreme Court doesn’t have to agree to hear a case, nor are all cases appealed to the high court.", "So, it’s debatable how meaningful reversal statistics are in the first place.", "That said, there is another metric that provides support for a similar claim that Republican Sen. Ben Sasse made three days after Trump sent his tweets.", "In congressional testimony in 2017 and 2018, Vanderbilt University law professor Brian T. Fitzpatrick told members of separate House and Senate subcommittees that he thought it was better to consider “how often is a Circuit reversed as a percentage of the total appeals it decides.” He then explained that the 9th Circuit had 2.5 reversals for every 1,000 appeals it terminated between October 1994 and October 2015.", "That was the highest such rate of the 11 regional circuit courts that Fitzpatrick studied, though he excluded the Federal Circuit Court and the District of Columbia Circuit from his analysis for having “non-comparable specialized dockets,” he said.", "A Sasse spokesman told us the senator was relying on Fitzpatrick’s research when Sasse told Chris Wallace, the host of “Fox News Sunday,” that the 9th Circuit gets “turned over at a rate higher than any other circuit in the nation.” Sasse broached the subject after Wallace asked him about the “dust-up” between Trump and Chief Justice Roberts.", "To be fair, though, Sasse should have stipulated that his claim was based on an aggregate figure. Fitzpatrick told lawmakers that was important to note because “the Ninth Circuit did not have the highest reversal rate every single year over the last twenty years.”", "But Trump, unlike Sasse, referred to a different kind of reversal rate than Fitzpatrick’s figure. That makes the president’s claim, and the data behind it, problematic.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]