["The Violent Crime Control and Law Enforcement Act of 1994, also known as the crime bill, was the most comprehensive piece of anti-crime legislation in American history. Drafted by then-Sen. Joe Biden, chairman of the Judiciary Committee, the bill was the government's response to a 1991 peak in crime rates.", "The nonpartisan Brennan Center for Justice reported 5,856 crimes were committed per 100,000 people that year. Violent crime was also highest at 716 crimes per 100,000 people.", "The bill earmarked $9.7 billion in funding for prisons and $6.1 billion for preventative programs, featured a federal assault weapons ban, expanded the federal death penalty and provided for 100,000 new police officers, according to government transparency website, GovTrack. The bill was signed into law by President Bill Clinton after passing through Congress with mostly Democratic support and achieving near-unanimous approval in the Senate, according to its website.", "But aside from historic policy changes, the bill's passage ushered a new phrase into the public conscious: \"super predator.\"", "More:From QAnon to 1994 crime bill: These questions from Trump, Biden town halls really lit up social media", "During the last presidential debate on Oct. 22, President Donald Trump accused Democratic presidential nominee Biden of describing Black people as \"super predators.\"", "\"He never did a thing except in 1994, when he did such harm to the Black community. And they were called, and he called them, super predators,\" Trump said of Biden's history with the Black community, according to a transcript.", "That night, Facebook user Christina Smith posted about the phrase and its relationship to the crime bill.", "\"1994 CRIME BILL Biden called Black people SUPER PREDATORS!!!!\" she wrote.", "Despite Trump's words, Smith told USA TODAY she got the information from another source. She also alluded to her support for Trump.", "\"Y’all lie all the time about Trump, and NEVER FACT CHECK WHEN THE POST LIE ABOUT TRUMP,\" Smith wrote.", "The term \"super predator\" was coined in 1995 by Princeton University professor John DiIulio. It came to define a generation of \"radically impulsive, brutally remorseless youngsters, including ever more preteenage boys, who murder, assault, rape, rob, burglarize, deal deadly drugs, join gun-toting gangs and create serious communal disorders,'' according to a 2001 report by the New York Times. DiIulio has said he regrets inventing a theory that \"took on a life of its own.\"", "Trump accused Biden of labeling members of the Black community with the phrase, but this is inaccurate.", "While Biden did warn of \"predators\" during a 1993 speech advocating for the crime bill, he did not refer to Black people as \"super predators.\"", "\"Unless we do something about that cadre of young people — tens of thousands of them born out of wedlock, without parents, without supervision, without any structure, without any conscious developing — because they literally have not been socialized, they literally have not had an opportunity ... we should focus on them now. If we don't, they will — or a portion of them will — become the predators 15 years from now,\" Biden said, according to a video recording provided by C-SPAN.", "In fact, Hillary Clinton, not Biden, is responsible for linking \"super predator\" to the 1994 bill.", "During a 1996 campaign speech for President Bill Clinton, the then-first lady used the term to describe \"gangs\" of kids without empathy, while crediting the crime bill's allowance for more police officers for a reduction in crime, gangs and drugs.", "\"We need to take these people on, they are often connected to big drug cartels, they are not just gangs of kids anymore. They are often the kinds of kids that are called super predators. No conscious, no empathy,\" Clinton said, according to a video recording provided by C-SPAN.", "The term resurfaced during the 2016 Democratic presidential primaries, when then-candidate Clinton endured criticism for her support of the bill, USA TODAY reported.", "The scrutiny continued into the 2020 election cycle.", "Neither Clinton nor Biden singled out the Black community in their speeches. Still, the crime bill has been criticized for disproportionately affecting minority communities. Biden called a provision of the bill relating to drug offenses a mistake during Thursday's presidential debate, per a transcript.", "We rate this claim FALSE, based on our research. Biden did not refer to members of the Black community as \"super predators\" during or after the passage of the 1994 crime bill. First lady Hillary Clinton associated the phrase with the bill, two years after it was signed, but Black people were not directly referenced.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]