["By Angelo Fichera", "Posted on March 16, 2020", "A viral image circulating online is falsely advising social media users that gargling water with salt or vinegar “eliminates” the coronavirus. There is currently “no specific medicine recommended to prevent or treat the new coronavirus,” according to the World Health Organization.", "It’s worth reiterating again: Beware of posts on social media claiming to offer tips or cures for the novel coronavirus.", "One of the latest falsehoods concerning the coronavirus to spread widely on Facebook and Instagram tells users, wrongly, that simply gargling water with salt or vinegar “eliminates” the virus.", "The viral image spreading the claim erroneously purports that, “before it reaches the lungs,” the coronavirus “remains in the throat for four days” and that drinking a lot of water “and gargling with warm water & salt or vinegar eliminates the virus.”", "The World Health Organization, however, notes that “to date, there is no specific medicine recommended to prevent or treat the new coronavirus,” which causes the COVID-19 disease.", "While saline water or water with vinegar is sometimes used to help soothe a sore throat, “it doesn’t kill the virus,” Charles Dela Cruz, an associate professor of medicine in pulmonary and critical care at Yale University, told us.", "“You’re not rinsing it away so it doesn’t go to your lungs,” Dela Cruz, also director of the university’s Center for Pulmonary Infection Research and Treatment, said in a phone interview.", "The U.S. Centers for Disease Control and Prevention  reports that symptoms — often fever, cough or shortness of breath — appear within 14 days of exposure.", "As for actual advice, Dela Cruz said “the key is to limit getting infected.” He emphasized health officials’ guidance that people should frequently wash their hands with soap and water; avoid touching their faces; and avoid large crowds and close contact with people who are sick.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "“Coronavirus disease (COVID-19) advice for the public: Myth busters.” World Health Organization. Accessed 16 Mar 2020.", "“Coronavirus Disease 2019 (COVID-19) | How to Protect Yourself.” U.S. Centers for Disease Control and Prevention. Accessed 16 Mar 2020.", "“Coronavirus Disease 2019 (COVID-19) | Symptoms.” U.S. Centers for Disease Control and Prevention. Accessed 16 Mar 2020.", "Dela Cruz, Charles. Associate professor of medicine in pulmonary and critical care, Yale University. Phone interview with FactCheck.org. 16 Mar 2020.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]