["About this rating", "Freshman Congresswoman Alexandria Ocasio-Cortez, D-New York, is the youngest woman elected to serve and is outspoken about progressive values. She is also the frequent target of smears.", "In a version of one such smear, launched on Sept. 11, 2019, various websites and social media users twisted comments she had made months prior to make them appear she had suggested the public should no longer see images from the 9/11 terrorist attacks on the U.S.", "\"Ocasio-Cortez Says we Shouldn’t Show the Public Photos of 9/11 Anymore,\" one such headline stated. \"AOC says remembering the 9/11 attacks is an incitement of violence against Ilhan Omar and other Progressive women of color,\" tweeted one social media user.", "But that's not what Ocasio-Cortez said. And though many of these posts were made on the 18th anniversary of the Sept. 11, 2001, attacks, she made the relevant comments in April 2019.", "In her statement, Ocasio-Cortez was blasting yet another bad-faith interpretation of comments made by her fellow freshman congresswoman, Ilhan Omar. The Democrat from Minnesota is one of the first Muslim women to serve in Congress and the first to wear a hijab, or a religious head covering, while doing so.", "Omar had given a speech in March 2019 at a banquet hosted by the Council on American-Islamic Relations (CAIR) in which she talked about the rise of Islamophobia and the erosion of the Muslim community's civil liberties after 9/11, stating that the community as a whole was being punished for the actions of a few.", "\"CAIR was founded after 9/11 because they recognized that some people did something, and that all of us were starting to lose access to our civil liberties,\" Omar said. (CAIR was actually founded prior to the attacks.)", "On April 11, 2019, the New York Post ran a front-page image of the World Trade Center in Lower Manhattan burning after being hit by jetliners on 9/11. The Post paired that image with a portion of the remark made by Omar, taken out of context, to give the impression that Omar had shown disrespect for that tragedy.", "This is ugly pic.twitter.com/R2XVyS4dq8", "— Harry Siegel (@harrysiegel) April 11, 2019", "It was that cover of the Post that Ocasio-Cortez was responding to when she made the following comment on April 11, 2019:", "Printing on the front page to circulate all around New York City an image that is incredibly upsetting and triggering for New Yorkers that were actually there, and were actually in the radius, that woke up one morning or were in their schools and didn't know if they were going to see their parents at the end of the day — to elicit such an image for such a transparently and politically-motivated attack on Ilhan — this is, we are getting to the level where this is an incitement of violence against progressive women of color. And if they can't figure out how to get it back to policy, we need to call it out for what it is. Because this is not normal, and this is not a normal level of political debate or rhetoric. As wild as it can get sometimes, this is something beyond what is normal.", "Ocasio-Cortez was responding to the cover of the New York Post on April 11, 2019, which was also criticized by others when it was published for being incendiary and displaying anti-Muslim bigotry. She was not stating that the public should not view images from the terrorist attacks. We thus rate this claim \"False.\"", "Ingber, Sasha. \"'New York Post' Denounced for Publishing Sept. 11 Photo with Rep. Ilhan Omar's Words.\"\r\n  NPR. 12 April 2019.", "Rosenberg, Eli. \"A 'Pure Racist Act’: N.Y. Post Slammed for Using 9/11 to Attack Rep. Omar Over Speech on Islamophobia.\"\r\n  The Washington Post. 11 April 2019.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]