["About this rating", "On 10 September 2018, newspapers such as the UK's Sun and the New York Post published the same story under the headline “Young Blood Could Be the Secret to Long-lasting Health: Study” -- a headline which implied that a recently published scientific study had made a significant development in the field of medicinal blood drinking. The story, whose virality was ensured by an accompanying picture of bloody vampire teeth, opened with these claims:", "Drinking young people’s blood could help you live longer and prevent age-related diseases, a study has found. Blood factors taken from younger animals have been found to improve the later-life health of older creatures.", "The study, published in Nature, was conducted by researchers from University College London (UCL), who said it could reduce the chances of developing age-related disorders.", "This reporting has several things wrong with it right off the bat. First, nobody is advocating for the “drinking” of blood — the idea as posited would be to inject it via transfusion. Second, the study referenced by the Post and the Sun, authored by geneticist Linda Partridge, did not itself investigate blood transfusions for human longevity purposes but rather included a discussion of blood transfusions in animal studies as part of a larger review of the state of the longevity and aging fields. Third, “blood factors” refer to specific components of blood, not to blood as a whole.", "Partridge’s paper referenced one specific animal study to conclude that “Blood factors obtained from young individuals [can] improve late-life health in animals.” The animal study Pardridge cited, titled “Human umbilical cord plasma proteins revitalize hippocampal function in aged mice” and published in Nature in 2017, suggested that the injection of a specific component of human blood derived from human umbilical cords could prevent cognitive decline in mice, an important finding that could have relevance for neurodegenerative diseases such as Alzheimer's:", "Here we show that human cord plasma treatment revitalizes the hippocampus and improves cognitive function in aged mice. Tissue inhibitor of metalloproteinases 2 (TIMP2), a blood-borne factor enriched in human cord plasma, young mouse plasma, and young mouse hippocampi, appears in the brain after systemic administration and increases synaptic plasticity and hippocampal-dependent cognition in aged mice ...", "Our findings reveal that human cord plasma contains plasticity-enhancing proteins of high translational value for targeting ageing- or disease-associated hippocampal dysfunction.", "To be clear, the mice used in this study were not “drinking” blood:", "To assess whether human cord plasma revitalizes aspects of brain function, plasma pools were created from [human umbilical] cord, young adult, and elderly donors and injected intravenously into aged NSG mice every fourth day for 2 weeks.", "Additionally, these mice were not simply injected with a syringe of raw blood, but rather with purified versions that isolated specific chemicals from the blood:", "Cord (live umbilical venous collection at birth), young, and elderly blood was collected for the isolation of ethylenediaminetetraacetate (EDTA)-plasma under Stanford Institutional Review Board consent and approval ... Isolated plasma was stored in aliquots at −80 °C until analysis or before pooling and dialysis to remove EDTA for treatment experiments where indicated.", "In her paper, Partridge made it clear that while such work was interesting, much work would need to be done to assess the viability of such a treatment in humans, arguing that “application to humans will require better biomarkers of disease risk and responses to interventions, closer alignment of work in animals and humans, and increased use of electronic health records, biobank resources and cohort studies.”", "Not to be dissuaded by this vitally important caveat, the Post and Sun articles attempted to muddy the waters further by linking the paper written by Partridge to the controversial, unpublished, and unrelated work of the Peter Thiel-backed company Ambrosia LLC, suggesting that Partridge’s work is part of Theil’s effort to inject humans with young blood to extend health and longevity:", "The research is part of a wave of studies and trials backed by PayPal co-founder Peter Thiel at a San Francisco start-up called Ambrosia. Separate trials by Ambrosia involved 70 participants, all 35 or older.", "After being given plasma — the main component of blood — from volunteers ages 16 to 25, researchers noted improvements in biomarkers for various diseases. Ambrosia currently offers teenage blood plasma to customers at a cost of $8,000 for 2½ liters.", "First, Ambrosia LLC did not “back” Partridge's study in any way. Via email, Partridge told us her study was not funded or connected to the Thiel-backed startup. Second, the “results” the Post and Sun story referenced with respect to Ambrosia were not taken from any actual published study, but from a talk the founder of Ambrosia gave at a TechCrunch conference in 2016. As such, it cannot be critically evaluated as scientific development at this time.", "The clinical trial run by Ambrosia LLC, which cost $8,000 to join, has been controversial in the scientific community for several reasons, most notably the fact that the study design lacked a control group. Arne Akbar, an immunologist at the University College London, argued to New Scientist in 2017 that “There is no telling what [results come] down to the placebo effect.”", "Derek Lowe, in a blog post for the Science Translational Medicine's \"In The Pipeline\" blog, expressed concerns about the demographics of the clinical trial, which he described as “shady”:", "A company called Ambrosia is signing up 600 patients 35 or older, running them through a battery of tests, and giving them a one-time infusion of young plasma. It will cost you $8000 to participate in this, which makes the whole thing seem suspiciously like a profit-making enterprise, and the design of the study makes it hard to say what’s going to be learned. There’s no control group, and the patients are apparently going to be a pretty heterogeneous bunch. The one thing they’ll have in common is that they have eight grand to spend.", "Regardless of the merits of Ambrosia's efforts, no study has concluded that “drinking” a “young person’s blood” provides anti-aging health benefits. As such, we rank the claim false.", "du Cann, Gerald.   \"Young Blood Could Be the Secret to Long-Lasting Health: Study.\"\r\n    New York Post.   10 September 2018.", "Partridge, Linda et al.   \"Facing Up to the Global Challenges of Ageing.\"\r\n    Nature.   5 September 2018.", "Castellano, Joseph et al.   \"Human Umbilical Cord Plasma Proteins Revitalize Hippocampal Function in Aged Mice.\"\r\n    Nature.   27 April 2018.", "ClinicalTrials.gov.   \"Young Donor Plasma Transfusion and Age-Related Biomarkers (NCT02803554).\"\r\n    Accessed 11 September 2018.", "Adee, Sally.   \"Human Tests Suggest Young Blood Cuts Cancer and Alzheimer’s Risk.\"\r\n    New Scientist.   31 May 2017.", "Lowe, Derek.   \"A Shady Trial?.\"\r\n    In The Pipeline (Science Translational Medicine blog).   4 August 2016.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]