["The video was shared by numerous accounts, including the Facebook page Gossip Mill in a post which we've archived here. This version of the video has been shared more than 10,000 times and viewed more than 340,000 times. The video was shared with the caption: “Man Spotted Barking Like Dog In Lekki, Lagos!!!”", "The same video has been shared by dozens of YouTube channels with tens of thousands of views between them. One of the uploads, archived here, claims to show a “Yahoo boy” who barked “like a dog to death in lagos”. Internet fraudsters in Nigeria are popularly known as “Yahoo boys”.", "Another was shared with the caption “video of a young ‘Yahoo boy’ fraudster barking like a dog till he gave up the ghost”. We’ve archived some of the others here, here and here.", "The same video has been circulating on WhatsApp in Nigeria and was also posted on Twitter, where it was viewed more than 7,000 times.  Numerous online newspapers and blogs have also shared it, including here and here.", "AFP analysed the video, using the InVid tool, and found the footage was originally uploaded onto Instagram by a Nollywood actor, King Patto, and showed him acting a scene in an upcoming film. His post can be found here.", "King Patto added a caption warning against internet fraud to the original video that appears to have been taken out of context. “YAHOO BOY BARK TO DEATH IN LAGOS... SAY NO TO YAHOO PLUS + ❌❌❌,” the actor wrote in a post shared from the Lekki district of Lagos.", "The producer of the movie Damilola Adekoya has posted the same video, saying “it’s a film” set to be released, titled “Olajimi”.", "We also found this Facebook post sharing a “behind the scenes” clip of the filming, which shows a camera crew alongside the man sitting on the floor by the car.", "Internet fraud is a major issue in Nigeria. A recent dispute among prominents artists saw some accused of glamorising and supporting the practice. The Economic and Financial Crimes Commission (EFCC) in May arrested and charged a popular Nigerian musician by the stage name Naira Marley for internet fraud. He pleaded not guilty.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]