["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A throwaway line in a blog posting in May — which turns out to be wrong — provided just enough fodder to allow political pundits to brand a top White House official with the political scarlet letter A, for ACORN.", "Under the spotlight is Patrick Gaspard, director of the White House Office of Political Affairs. It's a high-level position. In fact, that's the title Karl Rove held in President George W. Bush's White House (though senior adviser David Axelrod is probably closer to Rove's role for President Barack Obama). Gaspard had kept a very low media profile until this week, when some political pundits began calling him ACORN's man in the White House.", "The hosts of\n\nFox and Friends\n\nran with the claim about Gaspard's alleged ties to ACORN in a Sept. 29, 2009, interview with Fox News commentator Glenn Beck.", "\"The White House political director is a fellow by the name of Patrick Gaspard,\" said host Steve Doocy. \"And he apparently has been in bed with ACORN and, in fact, Bertha Lewis, who heads up ACORN. He, Mr. Gaspard, was her right-hand man.", "\"So does ACORN have somebody in the White House in one way or another?\" Doocy asked.", "\"The answer to that is yes,\" said Beck. \"You know what's really weird is he was also one of the top guys at SEIU (Local 1199 of the Service Employees International Union, United Healthcare Workers East, the largest local union in America). SEIU and ACORN, the same organization . . . The president has zero credibility when he says, 'I haven't been following this ACORN thing.' This is his army, SEIU and ACORN.\"", "Fox News host Sean Hannity also ran with the story.", "\"And now questions are being raised about a top White House adviser's connections to the group,\" Hannity said on his Sept. 28 show. \"Now the director of the White House Office of Political Affairs, Patrick Gaspard, is said to be closely affiliated with ACORN and, according to the\n\nAmerican Spectator,\n\nhe previously worked as the political director for none other than Bertha Lewis, who is now the chief organizer of ACORN.", "\"Sounds like ACORN has somebody on the inside of the White House. Now there's a real comforting thought.\"", "The accusations about Gaspard's employment at ACORN have their roots in an article written by Matthew Vadum for the\n\nAmerican Spectator\n\non Sept. 28 under the headline,\n\n\"ACORN's Man in the White House.\"\n\nVadum is a senior editor at Capital Research Center, a Washington, D.C., think tank that studies the politics of philanthropy.", "\"Newly discovered evidence shows the radical advocacy group ACORN has a man in the Obama White House,\" Vadum's article begins.\n\n\n\"This power behind the throne is longtime ACORN operative Patrick Gaspard.\"\n\n\n\"Evidence shows that years before he joined the Obama administration, Gaspard was ACORN boss Bertha Lewis's political director in New York.\"", "So what is the evidence?", "Vadum cites a May 16, 2009, posting from ACORN founder Wade Rathke's \"Chief Organizer\" blog. Rathke resigned last year as \"chief organizer\" for ACORN amid speculation about his role in helping to conceal from the full board almost $1 million embezzeled from ACORN by his brother. Bertha Lewis, then head of New York ACORN, took Rathke's place.", "In May, Rathke wrote this on his blog: \"Tell me that 1199's former political director, Patrick Gaspard (who was ACORN New York's political director before that) didn't reach out from the White House and help make that happen, and I'll tell you to take some remedial classes in 'politics 101.'\"", "The part in parenthases comes from Rathke.", "But current ACORN officials say Rathke was wrong.", "\"He (Gaspard) never worked for us,\" said Brian Kettenring, a spokesman for ACORN.", "It's a case of mistaken identity, Kettenring said. Rathke worked for ACORN national and not ACORN in New York. He clearly confused Gaspard with someone else, Kettenring said.", "Scott Levenson with the Advance Group, which does PR work for ACORN, echoed that in an e-mail saying, \"There is NO accuracy to the fact that Patrick Gaspard ever worked for ACORN.\"", "And so we e-mailed Rathke.", "\"I misspoke,\" Rathke responded.", "Rathke also addressed the issue in a postscript to a blog posting on Sept. 29.", "\"Patrick was never on the staff of ACORN,\" Rathke wrote. \"I double checked with people I still know there, and it appears that I dropped a stitch there.  Hopefully my misstatement won’t lead to the White House throwing him in front of the bus in this rush to neo-McCarthyism that has become so prominent. In this case, my memory tricked me.  I’m glad to carry the weight and simply say I made a mistake, and damned if I’m not sorry and hope no damage is done to a good man doing a hard job.\"", "Interestingly, Gaspard's brother, Michael Gaspard, works for the Advance Group. And again, the Advance Group in New York does communications work for ACORN. But Kettenring said he was not aware that Michael Gaspard has, himself, actually done any work for ACORN.", "But back to Patrick Gaspard. The White House provided a resume for him going back 20 years. It showed he worked for SEIU and the Howard Dean campaign, among other places, but had not worked for ACORN.", "We're not saying Gaspard has had no interaction with ACORN, or that he doesn't have ties to ACORN's Bertha Lewis. They both were involved in New York politics and SEIU and ACORN officials run in similar circles.", "In fact, in an April 28, 2009, story in\n\nRoll Call\n\n, Lewis is quoted as saying that while \"we don't have our own special ACORN entrance at the White House or our own special hot line,\" she did say she has particularly good relationships with Housing and Urban Development Secretary Shaun Donovan and Gaspard. The conservative\n\nRed State\n\nrecently ran a story that Gaspard's contact info appears in Lewis' Rolodex, for whatever that's worth.", "But the claim here wasn't just that the two are friends. It's that Gaspard was employed by ACORN as Bertha Lewis' political director in New York. ACORN officials say he was not. And the source of that information, ACORN founder Wayne Rathke, said he misspoke when he made that claim in a blog posting.", "For their part, Doocy, Beck, Hannity and others are relying on the reporting of Vadum in the\n\nAmerican Spectator\n\n. And Vadum relied on Rathke's blog posting. So the mistake is understandable. But in their zeal to paint an \"A\" on Gaspard's sweater, the pundits never made an effort to find out if it was right. And it wasn't. We rule the statement False.", "American Spectator,\n\n\"ACORN's Man in the White House,\"\n\nby Matthew Vadum, Sept. 28, 2009", "Wade Rathke: Chief Organizer Blog,\n\n\"SEIU's Good Obama Bet,\"\n\nMay 16, 2009", "Wade Rathke: Chief Organizer Blog,\n\n\"Getting Leveraged on Heath Care,\"\n\nby Wade Rathke, Sept. 29, 2009", "YouTube,\n\nSean Hannity and Rep. Mike Pence talk about Patrick Gaspard and ACORN\n\n, Sept. 28, 2009", "New York Daily News,\n\n\"Haitian American labor leader Patrick Gaspard in key job with Barack Obama,\"\n\nby Jared McCallister, June 27th 2008", "City Hall News,\n\n\"Rising Stars: 35 under 40 The Next Generation of Political Leaders in New York,\"\n\nAugust 2006", "Obama-Biden Transition Web site,\n\n\"Press release: President-elect Obama and Vice President-elect Biden Announce Key White House Staff\"", "PolitickerNY.com,\n\n\"Patrick Gaspard Writes Poems, Collects Comics, Kills for Obama,\"\n\nby Jason Horowitz, June 23, 2009", "Red State,\n\n\"A Review of ACORN CEO Bertha Lewis’s Rolodex Suggests Strong White House Ties,\"\n\nby Erik Erickson, Sept. 22, 2009", "Politico,\n\n\"ACORN attack misses mark,\"\n\nby Ben Smith, Sept. 29, 2009", "Roll Call, \"Politics and Poker,\" by Josh Kurtz, April 28, 2009", "Interview with Brian Kettenring, a spokesman for ACORN, Sept. 29, 2009", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]