["28 countries are members of the EU.", "Correct.", "168 countries are members of the WTO.", "Broadly correct. There are 164 full members of the WTO.", "15% of world trade is conducted through the EU.", "EU members are responsible for an estimated 15% of the global trade in goods (so excluding services). But only trade between two EU member states would count as being conducted through the EU—so the actual figure for goods will be lower than this.", "98% of world trade is conducted through the WTO.", "WTO members are responsible for 98% of world trade, but it’s misleading to say all of this trade is done “through” the WTO. Estimates suggest around three quarters of trade is done on WTO terms (not including trade between EU countries). Instead, many WTO member trade with each other via separate trade agreements.", "33,000 people are employed by the European Commission, and 7,500 by the Parliament.", "Roughly correct, although that’s not all staff employed by the EU. The total administrative staff is around 60,000.", "The WTO has 625 staff.", "Correct. It was 627 at the end of 2018.", "The EU spends £8 billion on overhead each year.", "The EU spent £8.5 billion on administrative costs in 2018. That’s 6% of its total budget.", "The WTO spends £0.15 billion per year on overhead costs.", "This is the WTO’s total budget for 2019.", "The EU’s founding principle is free trade among its members.", "This was one of the EU’s founding principles. Since 1992, it is also committed to European citizenship; a common foreign and security policy; and cooperation between EU governments on justice and home affairs.", "The WTO’s founding principle is to ensure that free trade flows as smoothly, predictably and freely as possible.", "Its founding and guiding principles “remain the pursuit of open borders, the guarantee of most-favoured-nation principle and non-discriminatory treatment by and among members, and a commitment to transparency in the conduct of its activities.”", "A Facebook post makes a number of comparisons between the EU and the World Trade Organisation (WTO). A lot of the information is, in isolation, broadly correct.", "However the comparison is not particularly helpful because the EU and the WTO are very different organisations in terms of what they do.  Nor are they two separate and competing ‘clubs’: both the UK and the EU itself are members of the WTO.", "The WTO sets the basic rules of trade for most countries in the world and acts as a forum for countries to negotiate deals on trade. The WTO does not have institutions and WTO staff provide only technical and professional support to governments, who make the decisions. Countries often have a number of international trade agreements on top of their membership of the WTO.", "The EU is a much more developed political and economic union of 28 countries. As well as setting rules which allow tariff- and barrier-free trade between members, the EU’s remit extends to setting laws and regulations, with its own courts, parliament and civil service. This partly explains why it has more staff and a bigger budget.", "Despite the fact that the comparison isn’t entirely meaningful, let’s look at each of the claims in turn.", "Honesty in public debate matters", "You can help us take action – and get our regular free email", "I’m in", "It’s correct that there are 28 member states of the EU, including the UK. An additional four countries are not in the EU but are part of its single market.", "There are 164 members of the WTO, and a further 23 “observers” who are almost all expected to start the process of becoming full members within five years.", "The post says 15% of global trade is done through the EU, and 98% is done through the WTO, including the EU. It’s not clear what this means, but it probably refers to the fact that EU countries account for 16% of the world’s imports and exports, and WTO members (including the EU) account for 98%.", "But it’s misleading to say 98% of trade happens through the WTO, as the post claims.", "That’s because, while the WTO sets some baseline rules of trade for its members, countries often negotiate trade agreements with one another on top of this, with the aim of creating better terms of trade for both sides. WTO countries without these agreements are said to trade on WTO terms. These are the terms on which the UK would initially trade with most of the world if it had a no deal Brexit.", "So we could reasonably understand trade through the WTO to mean only trade done on WTO terms. Trade done between WTO members via a free trade agreement is not in any meaningful sense done through the WTO, as the rules of that agreement supersede the basic WTO terms of trade.", "By that logic, it’s also not the case that 16% of global trade is done via the EU. Trade is only really done through the EU if it’s two EU countries trading with one another—as this means both sides are governed by the rules of the EU’s single market and customs union. Trade that EU countries do with, for example, the USA is not done through the EU—as EU rules don’t apply to the USA.", "The WTO told us that roughly half of world trade in terms of value is done on WTO terms with no tariffs, another quarter is on WTO terms with tariffs, and the last quarter is done as part of trade agreements.", "However, because some of the trade done via trade agreements is potentially still traded on the same terms as if it was on WTO terms, they estimate that 17% of world trade uses a trade agreement to reduce tariffs.", "So there is a way you could say 83% of world trade is done via the WTO, but not in the way described by the graphic.", "These calculations don’t include any trade between two EU countries (because the WTO treats the EU as a single trading bloc in its calculations).", "And it’s important to note that the amount of trade done on WTO terms varies between different countries. For example, over two thirds of EU member states’ trade is with other EU countries—meaning not on WTO terms. Over half of the UK’s trade is currently not done on WTO terms. A number of major economies also conduct the majority of their trade with the least developed economies using preferential trade agreements.", "Another way to look at it is in terms of how many WTO countries the UK (as an EU member) currently has a trade agreement with. The EU trades with 105 of the 135 other members of the WTO through a trade deal or “preferential trade agreement”, rather than on WTO terms. No country trades exclusively on WTO terms.", "If the UK left the EU with no deal, it would automatically trade with most countries in the world on WTO terms, meaning increased barriers to trade with many countries.", "The total administrative staff of the European Union is 60,000, higher than the 40,500 claimed in the post.", "The post seems to just add up the staff who work for the European Commission (32,000 people) and the European Parliament (7,500 – not including the MEPs), and is roughly right about both. But there are a range of other agencies and bodies across the union which is why the total staff is higher than 40,500 as the post suggests.", "The post’s claim that the EU spends £8 billion a year on “overhead” presumably refers to its administrative costs. The EU spent £8.5 billion of its budget on administrative costs in 2018, using the average exchange rate for 2018. That’s around 6% of the EU’s total annual budget.", "In 2018, the WTO employed 627 people, and its total budget for 2019 is around £160 million (or £0.16 billion) using the exchange rate from January 2019.", "The EU administrative budget will be higher than the WTO’s for a few reasons. The EU has a much larger scope than just dealing with trade regulation. Also the WTO is set up in such a way that requires more direct input from representatives of national governments (rather than, like the EU, having its own institutions and civil servants to carry out business). The relatively small WTO secretariat is limited to providing technical and professional support to governments.", "The WTO’s website states that its founding and guiding principles “remain the pursuit of open borders, the guarantee of most-favoured-nation principle and non-discriminatory treatment by and among members, and a commitment to transparency in the conduct of its activities.”", "The European Union’s website states: “Free trade among its members was one of the EU's founding principles. This is possible thanks to the single market.", "“Beyond its borders, the EU is also committed to liberalising world trade.”", "The European Economic Community (the precursor to the EU) was founded in 1957 as an economic union, which gradually developed wider aims. For example, the 1992 Maastricht Treaty set out three “pillars” of the European Union—a European Community (or European citizenship); a common foreign and security policy; and cooperation between EU governments on justice and home affairs.", "Update 16 August 2019", "We changed the headline to clarify some ambiguous wording: \"98% of world trade is not done via the WTO\" could be read as suggesting that only 2% is.", "This article is part of our work fact checking potentially false pictures, videos and stories on Facebook. You can read more about this—and find out how to report Facebook content—here.\n\n        For the purposes of that scheme, we’ve rated this claim as mixture\n            because the figure about how much trade is done via the WTO is incorrect, and the graphic provides no context about the differences between what the WTO and EU do.", "Full Fact fights for good, reliable information in the media, online, and in politics.", "Bad information ruins lives. It promotes hate, damages people’s health, and hurts democracy. You deserve better.", "Full Fact, 17 Oval Way, London, SE11 5RR", "Full Fact is a registered charity (no. 1158683) and a non-profit company (no. 06975984) limited by guarantee and registered in England and Wales. © Copyright 2010-2023 Full Fact. Thanks to Bytemark for donating our web hosting.\n                        \n                        Privacy, terms and conditions."]