["This image of multiple saffron-robed Buddhist monks lying on a roadside was posted on Facebook on September 28, 2019, and has been shared more than 130 times since.", "Below is a screenshot of the Facebook post:", "Translated to English, the Sinhalese-language text superimposed across the image reads:", "“This is not the work of the Pohottuwa’s patriotic Karuna", "\"You slaves, there is not a single individual who harmed our religion in the pohottuwa.”", "The Sinhalese caption reads: “True true, the man who committed the highest number of Buddhist monk killings is not with the pohottuwa now.”", "“Pohottuwa” means flower bud in Sinhalese, and it is the official symbol of the Sri Lanka Podujana Peramuna (SLPP),  a political party led by former president Mahinda Rajapaksa.", "“Karuna” refers to Vinayagamoorthy Muralitharan, who is also known as Karuna Amman, a former rebel commander of the Liberation Tigers of Tamil Eelam (LTTE) in Sri Lanka’s Eastern province.", "Muralitharan has been linked to the Aranthalawa Massacre, in which LTTE militants killed 33 Buddhist monks on a bus in Eastern province on June 2, 1987. The politician denies the accusation.", "Having broken away from LTTE in 2004, Muralitharan, as well as his Tamil National Freedom Front party, is currently supporting Rajapaksa’s party.", "The claim is misleading; the image used in the post shows casualties of a road accident in Cambodia in 2019, not the killings of Buddhist monks.", "A reverse image search on Google led to this photo published on the website of the Cambodian Police on June 30, 2019.", "Below is a screenshot from the Cambodian police’s website:", "According to a Cambodian police report, on June 30, 2019, a truck slammed into a tuk tuk transporting several young Buddhist monks on a road in Koh Kong province, killing a man and injuring five monks.", "Koh Kong province is located in southwest Cambodia.", "The same picture was also published in this July 1, 2019, article by the Khmer Times, a Phnom Penh-based English-language publication.", "The article is headlined: “Monks injured and killed in fatal Koh Kong traffic accident”.", "Below is a screenshot comparing the image in the misleading post image (L) and the photo in the Khmer Times (R):", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]