["By D'Angelo Gore", "Posted on January 24, 2020", "President Donald Trump, who last year froze hundreds of millions of dollars in security aid for Ukraine, claimed “they got all” of it “long before schedule.” That’s false.", "The freeze that Trump directed lasted about two months last summer and not all of the money was later disbursed on time. Congress had to grant an extension to ensure the government could spend any federal funds on assistance for Ukraine that had not been contracted out by Sept. 30, which was the original deadline set by Congress.", "In fact, the Los Angeles Times reported in November that the Department of Defense still had not disbursed more than $35 million of its $250 million in security assistance for Ukraine. And, as of December, there were still $20 million in unobligated defense funds for the U.S. ally, the newspaper discovered.", "A Pentagon official told us that, as of Jan. 23, the department had “executed 99.8% of the funds” for Ukraine and was “working to obligate the remainder.”", "Trump’s decision to hold up the funding, and then ask Ukrainian President Volodymyr Zelensky to investigate Democratic presidential candidate Joe Biden and his son, Hunter, is one reason a majority of House members voted to impeach Trump in December. The Senate, which will either convict or acquit the president, began its impeachment trial this week.", "When the trial started on Jan. 21, Trump was in Davos, Switzerland for the annual World Economic Forum. A day later, during a press conference with other administration officials, the president made the claim about Ukraine getting its U.S. assistance on time.", "Trump, Jan. 22: Now, here’s the other thing: They [Ukraine] got their money long before schedule. They got all their money. What nobody says — this is very important to me: Why isn’t Germany paying? Why isn’t UK paying? Why isn’t France paying? Why aren’t the European nations paying? Why is it always the sucker — United States?", "It’s not true that Germany, France, the United Kingdom and other European nations don’t provide aid to Ukraine. As we have written before, the European Union and European financial institutions have contributed more than $16.4 billion in grants and loans to Ukraine since 2014, when Russia annexed Crimea and launched a conflict in the Donbas region in eastern Ukraine.", "And Ukraine did not receive its aid from the U.S. “long before schedule.”", "For fiscal year 2019, Congress authorized $391 million in security assistance, including training, equipment and other support, for Ukraine. Of that amount, $250 million was appropriated to the Defense Department for the Ukraine Security Assistance Initiative, and $141.5 million was allocated to the State Department for the Foreign Military Financing program. The funds were meant to be spent by those departments by Sept. 30, 2019.", "In June, the Defense Department announced its plans to provide the $250 million in security assistance to Ukraine. However, in July, Trump directed the White House Office of Management and Budget to put the aid on hold. He also had OMB block the assistance from the State Department.", "It wasn’t until about two months later, on Sept. 11, when the White House — under pressure from members of Congress and administration officials — released the money.", "But because the Defense Department was required to wait another 15 days before it could begin obligating the funds, it wasn’t able to spend all of the money before the end of September, when the federal fiscal year ends.", "Congress had to add a provision to a continuing appropriations bill — which Trump signed into law on Sept. 27 — allowing the unspent funds to be used in fiscal year 2020.", "Mark Sandy, the deputy associate director for national security at OMB, testified at his Nov. 16 deposition that approximately $35 million had been left unobligated by the Defense Department. Those funds, he said, “would have expired” if not for Congress stepping in.", "Then, three days later, the Los Angeles Times reported that those funds still had not been spent, according to Pentagon documents the newspaper reviewed. And the following month, on Dec. 12, the Times reported that about $20 million in aid “still hasn’t reached Ukraine.”", "That demonstrates all funds did not go out on schedule, as the president said.", "In an email, a Pentagon spokesperson told us that, as of Jan. 23, all but 0.2% of the $250 million in security assistance for Ukraine has been obligated.", "In a Dec. 11 letter to the Government Accountability Office, which later ruled that the aid freeze violated federal law, general counsel for the OMB, Mark Paoletta, said the State Department obligated the $141.5 million for Ukraine before Sept. 30.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]