["The video has been viewed more than 400,000 times since it was published here on Facebook on January 4, 2021. It has been shared more than 4,000 times.", "The Burmese-language title of the video translates as: “The mummy of a Burmese prince in the United States”.", "“In Myanmar, the practice of mummification was not encouraged due to religious traditions. However, the art of mummification existed in Burma,” the narrator says.", "“There are people who believe that there is a corpse of a Burmese prince more than 700 years ago in a museum in the United States. Only this photo was found as evidence of the Burmese prince's mummy”.", "The video claims that the picture shows the mummy of a Burmese prince named Thiha Thu, which was purportedly found near the Dala township of Yangon, the largest city in Myanmar, by an American archaeologist in 1950.", "The narrator also says that the mummy was put in a “glazed earthen jar” before it was brought to the US.", "The same video was posted here on Facebook and here on YouTube.", "However, the claim is false.", "A reverse image search on Google found this image on stock photo website Shutterstock about a 'catacomb saint' displayed at a church in Tyrol State of westen Austria.", "The caption of the stock photo reads: “Catacomb saint, Christian martyr, in a glass coffin in the baroque church of St. Jacob and St. Leonard, Hopfgarten im Thale, Brixental, Tyrol, Austria”.", "The bodies of 'catacomb saints', believed to be early Christian martyrs, were exhumed from the Roman catacombs and brought to churches in northern Europe from the sixteen century.", "The skeletons were considered a “grandiose statement” by Catholic churches whose relics were lost or destroyed during the Protestant Reformation, art historian and author Paul Koudounaris told Smithsonian magazine in a 2013 interview.", "Below is a comparison of the photo in the misleading video (L) and the photo in the Shutterstock gallery (R):", "In an interview with AFP on January 7, 2020, Pastor Sebastian Kitzbichler, the priest of the church, confirmed that the picture was indeed taken at the church in Hopfgarten in Austria's western Tyrol state.", "The priest said the corpse, which is located in the main church, is known as “Christian martyr”.", "AFP also found a street view image on Google Maps which includes an identical view of the glass coffin of the catacomb saint.", "Below is a screenshot comparison of the photo in the misleading video (L) and the photo in the Google map photo (R):", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]