["According to the description on YouTube, Dr Soumya Swaminathan “addresses the world in a promotional video\" about the safety of vaccines. But it then accuses her of hypocrisy: \"Five days later, here is her diametrically different opinion behind closed doors at the Global Vaccine Safety Summit,\" which took place in Geneva, Switzerland.", "The video was shared on Facebook in the United States here, here and here.", "Swaminathan, a pediatrician, has served on several WHO advisory committees and is a globally recognized researcher on tuberculosis and HIV.", "She spoke on December 3, 2019, the second day of the summit. Comparing the full video of her speech, available here, to the footage posted on YouTube, it is clear that a section has been cut.", "Swaminathan's remarks were addressed to other WHO experts, with the apparent aim of improving communication and public knowledge about the introduction of new vaccines.", "She spoke for about five minutes at the Geneva event.", "The misleading video splices a WHO clip of Swaminathan discussing the safety of vaccines with footage from her Geneva comments.", "It opens with the doctor saying that “vaccines are very safe,” then moves at 1’30” to video of her speaking in Geneva: “I think we cannot overemphasize the fact that we really don’t have very good safety monitoring systems in many countries, and this adds to the miscommunication and the misapprehensions because we’re not able to give clear-cut answers when people ask questions about the deaths that have occurred due to a particular vaccine, and this always gets blown up in the media.”", "At 2’07’’ in Swaminathan’s remarks, there is a sudden cut in the video.", "Although the next sentence is presented as a continuation, it actually occurred later. The edited video leaves out 35 seconds of her comments, between 29’50’’ and 30’25,’’ in which she stresses the need for better communication and transparency about new vaccines.", "In the removed section, Swaminathan does not appear to be doubting the safety of vaccines, but rather the effectiveness of public information campaigns about their implementation.", "The video’s claim that Swaminathan spoke to officials “behind closed doors” is also false. The full Geneva conference remains available on the official WHO website.", "Earlier in the WHO chief scientist’s full remarks, around 25’20,’’ she calls vaccine skeptics and critics “very, very damaging.” As an example, she points to the HPV (Human Papillomavirus) vaccine in India, where implementation was delayed by more than a decade because of misinformation about the immunization.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]