["“#EdoDecides2020 was meant to be an election? It is anything but…,” reads a tweet by Chidi Odinkalu, a lawyer and former chairman of Nigeria’s National Human Rights Commission. It has since been viewed more than 15,000 times since it was published on September 16, 2020.", "A two-minute video clip included in the tweet is captioned “War in Edo State”, with a photo of firearms beneath it. An image of Edo-born former national chairman of Nigeria’s ruling All Progressives Congress (APC) party, Adams Oshiomole, features in the top right-hand corner; and a mugshot of an unidentified man in the top left-hand corner.", "The clip, however, is not recent and was taken more than a year ago. It has been shared misleadingly to create the impression of widespread violence ahead of elections in Edo on September 19, 2020.", "Although the state has seen politically-fuelled clashes in recent months, there is no “war” taking place there, as the video claims.", "Using the InVID WeVerify tool, AFP Fact Check ran a reverse image search on keyframes of the video and found a longer version of the footage published on YouTube on March 7, 2019.", "“Since yesterday March 6, 2019, we have been receiving videos from Akwa Ibom State, alleging over hundred thugs from Benin, Edo state Nigeria were been intercepted at Akwa Ibom border and they were later arrested by SARS officers at Akwa Ibom border (sic),” the video caption reads.", "Speaking in local parlance, a man behind the camera is heard telling the men on the ground that “Oshiomole sent you” to “kill Akwa Ibom people”.", "Both Edo and Akwa Ibom states are in southern Nigeria.", "One of the detained men in the video clip identifies himself as Daniel and explains that his group was told by a man named Tony Kabaka to travel from Edo to observe the election in Akwa Ibom.", "Kabaka is a prominent member of the APC in Edo and a loyalist of Oshiomole, who was removed from the party’s chairmanship position in June 2020 by a local court. Oshiomhole also served two terms as governor of Edo.", "General governorship elections were held in a majority of Nigerian states on March 9, 2019, excluding Edo and Ondo, which run different election calendars.", "Reports at the time (here and here) quoted police officials saying they had arrested 153 people from Edo on suspicion of plotting to disrupt the general elections across the state border in Akwa Ibom. However, “preliminary investigations” revealed the suspects were on their way to a youth rally and nothing incriminating was found on them.", "Meanwhile, the accompanying image showing rifles is also unrelated to the 2020 governorship poll in Edo.", "AFP Fact Check ran a reverse image search on the photo and found it has circulated online since at least 2015 when it was published in this article by RiskScreen.", "False claims have been spreading on social media as the Edo elections have drawn nearer. AFP Fact Check recently debunked a claim that the APC candidate at the poll was hospitalised after a court removed Oshiomole.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]