["A video is viral with the claim that BJP leader and ex-chairman of the Haj committee Inayat Hussain was smeared with ink and beaten with slippers in Indore for extending his support to the National Register of Citizens (NRC) and the Citizenship Amendment Act (CAA).", "“ब्रेकिंग न्यूज़- CAA NRC NPR का खुला समर्थन करने की वजह से इंदौर में भाजपा नेता तथा हज कमेटी के पूर्व चेयरमैन इनायत हुसैन के चेहरे पर पोती गई स्याही, चप्पलों से हुई पिटाईऐ ऐसेगय्यूर मुसलमानों को बहुत बधाई बहुत हार्ड,” reads the message in Hindi.", "ब्रेकिंग न्यूज़- CAA NRC NPR का खुला समर्थन करने की वजह से इंदौर में भाजपा नेता तथा हज कमेटी के पूर्व चेयरमैन इनायत हुसैन के चेहरे पर पोती गई स्याही, चप्पलों से हुई पिटाई ऐसे गय्यूर मुसलमानों को बहुत बधाई बहुत हार्ड👍@007AliSohrab @ProfNoorul pic.twitter.com/PfB6lCAITZ", "— Tabish Khan 🇮🇳 (@tabishkhanss) January 24, 2020", "The claim is viral on Twitter, Facebook and WhatsApp.", "Shocking if true! BJP leader Inayat Hussain’s supporters blackened his face for supporting CAA in Indore!", "What do you think? pic.twitter.com/NIdP8nHgpA", "— Einstein 🇮🇳 (@DesiPoliticks) January 24, 2020", "The video has also been shared with an English caption – “Indore mein BJP neta Inaayat Hussain ka swaagat kiya gaya.” Alt News has received multiple requests on its official mobile application to fact-check the video.", "Alt News broke down the video into multiple keyframes and did a reverse image search on Yandex. We found one of the keyframes on a News18 Urdu report from March 13, 2018. A further keyword search with date filter on Twitter led us to a tweet by News18 Rajasthan which carried the same video. The tweet was posted on March 12, 2018.", "#अजमेर दरगाह के #खादिम के मुंह पर कालिख पोती, #चप्पल से पिटाई, देखिये पूरा वीडियो- https://t.co/InGagDc81V pic.twitter.com/lU9lyZWNp7", "— News18 Rajasthan (@News18Rajasthan) March 12, 2018", "According to the report, the incident is from Ajmer Dargah. “A Khadim named Sheikh Bunty smeared ink on the Secretary of the institution, Abdul Majid Chishti and hit him with sandals. A case was registered against Sheikh Bunty, who is the nephew of the former secretary of the institution, Sheikh Habibur Rahman. It is said that the incident was related to embezzlement. The matter is under investigation,” says the report.", "To sum up, an old, unrelated video of an altercation at Ajmer Dargah is viral as BJP leader Inayat Hussain being assaulted for supporting NRC and CAA. The man who was assaulted is secretary of Ajmer Dargah, Abdul Majid Chishti.", "Donate Now", "Co-founder, Alt News Co-Founder Alt News, I can be reached via Twitter at https://twitter.com/zoo_bear", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]