["About this rating", "Steve Bannon, the former executive chairman of Breitbart News who served as U.S. President Donald Trump's chief White House strategist, was arrested on Aug. 20, 2020, on charges he defrauded donors to a \"We Build the Wall\" fund-raising campaign. Social media users soon started sharing an image that supposedly showed a message Bannon posted to Facebook. The message predicted members of President Barack Obama's administration would end up in federal prison by the end of Trump's first term:", "This is not a genuine post from Bannon.", "The meme image went viral possibly in part because the opposite of the \"prediction\" came true. In August 2020, as Trump's first term drew to a close, multiple members of his administration, not Obama's, had been charged with various crimes:", "Bannon was charged with defrauding donors who contributed to a fundraising campaign to build a wall on the U.S.-Mexico border. According to USA Today, at least seven people connected to the Trump campaign have faced various criminal charges.", "But Bannon did not create the above-displayed meme.", "The message was originally posted to a \"Steve Bannon\" Facebook page in March 2017, but it doesn't appear this page was officially connected to Bannon. The page has since been deleted, but archived versions show a few peculiar artifacts. For starters, the page was not verified. A number of contemporary comments on it also claimed it was not Bannon's real account. When the message above was posted in 2017 to the \"Conservative Treehouse,\" a pro-Trump website, a number of commentators chimed in to say the Facebook account was fake.", "Most importantly, however, Bannon does have a genuine verified Facebook page. His official page is at the URL Facebook.com/SteveKBannon, not Facebook.com/Steve-Bannon, the URL of the impostor account.", "Rawnsley, Adam and Will Sommer.   \"The Cesspool That Spat Out Trump’s New Conspiracy About Cops.\"     Daily Beast.   9 June 2020.", "Fernandez, Marisa.   \"All the Trump Associates Convicted or Sentenced in the Mueller Investigation.\"\r\n    Axios.   20 February 2020.", "Johnson, Kevin.   \"How many Trump Advisers Have Been Criminally Charged? Manafort, Stone and Steve Bannon Makes 7.\"\r\n    USA Today.   20 August 2020.", "Feuer, Alan; Rashbaum, William; Haberman, Maggie.   \"Steve Bannon Is Charged With Fraud in We Build the Wall Campaign.\"\r\n    New York Times.   20 August 2020.", "Treehouse Conservatives.   \"March 7th – 2017 Presidential Politics – Trump Administration Day #47.\"\r\n    Mother Jones.   17 March 2017.", "Corn, David and A.J. Vicens.   \"Here’s Evidence Steve Bannon Joined a Facebook Group That Posts Racist Rants and Obama Death Threats.\"\r\n    Mother Jones.   18 November 2016.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]