["A 2006 federal law required a double-layered fence along hundreds of miles of the U.S.-Mexico border. But that law has since undergone significant changes. (U.S Fish & Wildlife Service photo)", "U.S. Sen. Ted Cruz, R-Texas, says President Barack Obama’s border policies aren’t just bad, they’re illegal.", "\"Existing law right now requires 700 miles of double-layered border fencing,\" Cruz, a presidential candidate, said during a recent radio interview on \"The John Fredericks Show,\" broadcast in Portsmouth. \"The Obama administration refuses to do that. They’ve built only 36 miles.\"", "We wondered if the law requires that the U.S.-Mexico border have a 700-mile span of \"double-layered fencing\" in which two barriers are set up, one in front of the other.", "Rick Tyler, a Cruz campaign spokesman, backed the senator’s statement by pointing us to the Secure Fence Act of 2006, which required that at least two layers of reinforced fencing be installed along five sections of the U.S.-Mexico border.", "Those sections totaled about 850 miles, although the fenced area would be somewhat less, because other means could be used to secure the border in areas with steep terrain. In areas of steep terrain, \"other means\" could be used to secure the border, the nonpartisan Congressional Research Service said in an April 2015 report.", "The bottom line is, the law mandated a double-layered fence along a stretch of at least 700 miles, covering more than one-third of the roughly 1,900 miles of the U.S.-Mexico border.", "But the law was amended in 2008 and loosened the fence requirements that Cruz continues to describe.", "The current law, contained in the Consolidated Appropriations Act of 2008, still mandates the construction of a fence covering \"not less than 700 miles\" of the border. But - key to this fact check - it erased the requirement that the fence be double-layered.", "Instead, the law mandates that \"reinforced fencing\" be erected. That generally means a barrier that’s more durable and sturdy than a typical fence, but the law doesn’t specify the barrier’s height or that it be constructed from wire mesh or another material, according to the  Congressional Research Service report.", "The new law \"now mandates only a single layer of reinforced fencing (while not precluding additional layers from being deployed, if deemed appropriate),\" the report says.", "So what has been built? The Department of Homeland Security says it has fencing on 650 miles, according to the research service. About 350 miles of that fencing is designed only to deter pedestrian crossings and contains only one barrier layer. Another 300 miles is covered by a \"vehicle fence\" - barriers designed to stop cars and trucks from crossing the border but not people traveling by foot.", "Only 36 miles are covered by double-layered fencing, according to Homeland Security tallies.", "\"DHS (the Department of Homeland Security) believe they have all the fencing that they need and that any additional fencing would not contribute to border security,\" Marc Rosenblum, deputy director of the U.S. Immigration Program at the Migration Policy Institute, told us in an interview.", "Others disagree, saying the barrier is not enough. Mark Krikorian, executive director of the Center for Immigration Studies, which urges tighter immigration policies, noted the vehicle fencing provides no deterrent for people on foot.", "\"Your grandma could hop them,\" Krikorian told us in an email.", "Our ruling", "Cruz says, \"Existing law right now requires 700 miles of double-layered border fencing.\" He complains that Obama is ignoring the mandate.", "Such a law was passed in 2006 but no longer is on the books. It was amended in 2008, before Obama took office, and the double-layered fencing requirement was removed. About 650 miles of fencing now stands, of which 36 miles is double-layered.", "Cruz’s statement is long past its expiration date. We rate it False.", "Sen. Ted Cruz comments on the John Fredericks Show, Dec. 17, 2015. (His statement is at just over 90 seconds into interview).", "Email from Rick Tyler, Ted Cruz presidential campaign spokesman, Dec. 22, 2015.", "Interview with Marc Rosenblum, deputy director of the U.S. Immigration Program at the Migration Policy Institute, Dec. 21, 2015.", "Email from Mark Krikorian, executive director of the Center for Immigration Studies, Dec. 17, 2015.", "The Congressional Research Service, \"Barriers along the U.S. borders: Key authorities and requirements,\" April 8, 2015.", "PolitiFact, \"Obama says border fences is ‘now basically complete,’\" May 16, 2011.", "PolitiFact, \"More border security and patrols under Obama than previous presidents, says Debbie Wasserman Schultz,\" July 1, 2013.", "PolitiFact, \"Wayne LaPierre says Obama ignores border fence law,\" Feb. 20, 2013.", "PolitiFact, \"Sen. Jeff Sessions says immigration bill has provision that lets Janet Napolitano skip fence,\" June 27, 2013.", "Associated Press, \"Bush signs U.S.-Mexico border fence bill,\" Oct. 26, 2006.", "The Washington Post, \"Bush signs bill authorizing 700-mile fence for border,\" Oct. 26, 2006.", "Breitbart, \"House Homeland Security Committee aides say no fence for border, because its’ too expensive,\" Jan. 26, 2015.", "The Daily Caller, \"New GOP border security bill removes border fences,\" Jan. 21, 2015.", "Dallas Morning News, \"Fact Check: Republicans who deem border fence inadequate should put part of blame on Hutchison,\" May 21, 2011.", "Congressional Research Service, \"Border security: Barriers along the U.S. international border,\" March 16, 2009.", "Center for Immigration Studies, \"House border bill advances without improvement,\" Jan. 24, 2015.", "Department of Homeland Security, \"Securing and managing our borders,\" accessed Dec. 22, 2015.", "Department of Homeland Security, \"Border security in the 21st century,\" accessed Oct. 9, 2014.", "The Secure Fence Act of 2006, accessed Dec. 22, 2015.", "Congressional Record, \"Consolidated Appropriations Act, 2008,\" Dec. 18, 2007.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]