["About this rating", "Bernie Sanders achieved a surprise victory at the Clark County Democratic Convention on 2 April 2016, and it's possible (but not guaranteed) that he will be awarded more national delegates based on the outcome of that single county's convention.", "Sanders did not belatedly achieve a favorable result that applies statewide, nor did he reverse or \"flip\" the overall Nevada caucus results to a win.", "On 20 February 2016, presidential candidate Hillary Clinton was declared the winner of Nevada's Democratic caucuses, edging rival Vermont senator Bernie Sanders out in what was a contentious night on many levels.", "Social media remained a major source for election updates among followers of politics, and many Twitter users in particular were hampered by that platform's 140-character limit (which sometimes led to misleading or incomplete information, particularly when a link was tweeted). On 2 April 2016 Sanders supporters began tweeting that the senator from Vermont had actually \"won Nevada\" more than a month after the state was called for Clinton. Much of the nuance of whatever had happened was elided due to character constraints:", ".@BernieSanders Makes Epic Comeback To Win Nevada https://t.co/50pwDvDKId", "— The Young Turks (@TheYoungTurks) April 5, 2016", "lol wait did Bernie Sanders just retroactively win Nevada — Matt Binder (@MattBinder) April 3, 2016", "Here's how @BernieSanders took Nevada from @HillaryClinton https://t.co/7fwX2aRwn9", "— Millennials 4 Bernie (@Bernlennials) April 3, 2016", "However, as of 9 April 2016, sites that track delegate counts weren't reflecting any retroactive win in Nevada for Bernie Sanders:", "In fact, the referenced scenario didn't actually encompass Sanders' having \"flipped\" Nevada to retroactively claim a win after having run second to Hillary Clinton there in February 2016. As explained by the Las Vegas Sun, the events that led many to believe Sanders had actually won Nevada involved the second part of a three-step process, in which county conventions select delegates to send to the Democratic state convention in May 2016, not to the Democratic national convention in July 2016 (although, confusingly, some of the former could be among the latter):", "Vermont Sen. Bernie Sanders scored a surprise victory over former Secretary of State Hillary Clinton at the Clark County Democratic Convention, where Sanders won the largest number of delegates a month after losing the Nevada caucuses. By early evening [on 2 April 2016], the delegates had been counted and Sanders announced as the winner.", "The county convention was the second in a three-step process for Nevada to choose its delegates to send to the Democratic National Convention this summer. The first was the February caucuses, the results of which are used to apportion 23 of the delegates Nevada will send to the national convention. The second step, the county convention, is when delegates are selected to the state convention in May. The third step is the state convention, when 12 more delegates are apportioned based on attendees' preferences.", "Nearly 9,000 delegates were elected on caucus day in late February, but only 3,825 showed up to [the] convention. An additional 915 elected alternates and 604 unelected alternates also turned out to support their favored candidate.", "The final delegate count was 2,964 for Sanders and 2,386 for Clinton. That means the Sanders campaign will send 1,613 delegates to the state convention, while the Clinton campaign will send 1,298.", "\"We pretty much won Nevada,\" said Sanders' state director, Joan Kato, smiling as the results were announced.", "What that means is the delegates from Clark County — along with the delegates selected by Nevada's other counties — will attend the state convention in May, where they will help select delegates to go to July's Democratic National Convention in Philadelphia. But, because of the way delegate-selection rules work in Nevada, they will only get to decide the proportion of 12 delegates — five pledged party leaders and elected official delegates and seven at-large delegates — that go to each candidate. Apportionment of 23 delegates, known as “district-level” delegates, is already decided, as they are based proportionally on the Feb. 20 caucus results in each district. In the February caucuses, Clinton had won 55 percent of delegates to the county convention — 4,889 to Sanders' 4,026.", "What all that means, in short, is that Sanders will have a larger number of delegates (2,124) attending the state convention in May than Clinton will (1,722), and thus he may be able to \"flip\" a few of those remaining 12 convention delegates. But most likely all that will happen is that Sanders will go from an estimated 20-15 deficit to a more narrow 18-17 delegate split, which is not a \"win\" for him. The Washington Post echoed that thought, describing Sanders' gains as preliminary and likely insufficient to give Sanders a win in Nevada:", "The upshot is that Sanders picked up some of the dozen delegates who were considered unbound during [the] conventions, the rules of which were the source of a good deal of controversy among Clinton and Sanders partisans even before the events began.", "Jon Ralston, a veteran Nevada reporter, said on his blog that [the convention] action is \"expected to switch two delegates to Sanders, giving Clinton an 18 to 17 lead in Nevada, but that is still pending the results of the state convention next month, when those 12 slots could again change ... Ah, the caucus process.\"", "Clinton spokesman Brian Fallon emphasized that the results could change again and noted some irregularities in the process. Regardless, he said, Clinton still has more delegates in Nevada than Sanders.", "Sanders campaign manager Jeff Weaver said his team believes Sanders has at least narrowed the gap to a single delegate — and he raised the possibility that his candidate could actually come out of Nevada with more delegates than Clinton when all is said and done.", "Reno television station KRNV noted that Hillary Clinton was at a disadvantage because many of her delegates failed to appear at the Clark County Democratic Convention, something that had happened in 2008 as well:", "On February 23rd, Democrats across the Silver State made a choice. They picked Hillary Clinton as the one they thought should be their party's nominee for President. But Bernie Sanders could end up receiving more Nevada delegates than Clinton. How is that possible? Welcome to Nevada's Democratic caucus process. It's one that is controversial as some voters love it, while others hate it.", "In a surprising reversal, Senator Bernie Sanders won the support of 55 percent of Nevada's delegates in the second of a three tier system of picking delegates. As for that vote on February 20th, Political Science Professor Fred Lokken exlains adding, \"It was the start of a process and in the process apparently things can change the will effect what you thought the winners and losers were going to be.", "Bernie Sanders delegate Paul Catha said it wasn't that Clinton delegates in Clark County changed their minds and switched over to support Sanders. He and others said Clinton delegates just didn't show up. He has a theory about that adding, \"They may not be as passionate about here. Not that they don't think she is a good candidate, they're just not to the same level of excitement as Bernie Sanders supporters.\"", "The numbers support his theory. In February nearly 9,000 Clinton delegates were elected in February but only 3,825 showed up. An additional 915 elected alternates and 604 un-elected alternates showed up in Clark County.", "Political Science Professor Fred Lokken said this has happened to Clinton in Nevada before when she was running against Barack Obama. He said, \"This happened to Hillary Clinton in 2008. There should have been a firewall this time to make sure it didn't happen again. So, there's a responsibility that falls on her organization.\"", "In short, Sanders did gather more support in Nevada at the second-tier Clark County convention on 2 April 2016, and most predictions hold that the events of that day will likely apportion two more delegates to Sanders. However, the county convention did not nullify the outcome of the 20 February 2016 caucus, and while Sanders did improve his campaign's standing in Nevada, he didn't \"flip\" Nevada in his favor, as Nevada's final \"delegate math\" won't be decided until the state convention on 14 May 2016.", "Burton, Michael.    \"Bernie Sanders Gets More Delegates Than Hillary Clinton at Clark County Convention.\"\r\nKTNV [Las Vegas].    2 April 2016.", "Cahill, Tom.    \"Bernie Sanders Wins the Nevada Caucus After All.\"\r\nUS Uncut.    3 April 2016.", "Hendry, Terri.    \"Bernie Sanders Upset in Nevada; How It Happened.\"\r\nKRNV [Reno].    4 April 2016.", "Messerly, Megan.    \"Sanders Wins Most Delegates at Clark County Convention.\"\r\nLas Vegas Sun.    2 April 2016.", "Wagner, John.    \"A Scrappy Sanders Campaign Narrows the Nevada Delegate Count Six Weeks After the Caucuses.\"\r\nThe Washington Post.    3 April 2016.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]