["The claim was published here by a New Zealand-based Facebook user on July 20, 2020. It has been shared more than 430 times.", "The post states: “Only 56 million more cases of COVID to go until we reach 2009 H1N1 swine flu figures!? / No shutdown, No masks, No media hysteria #Wakeup”.", "H1N1 is a strain of influenza virus believed to have emerged in Mexico in 2009. It caused a global flu pandemic in 214 countries. The WHO estimates that “between 105 000 and 395 000 people” were killed over a two-year period.", "COVID-19 was declared a pandemic by the WHO in March 2020. The first major outbreak of the disease was in the Chinese city of Wuhan in December 2019.", "The misleading post appears to be referencing US swine flu cases. During the 2009-2010 pandemic, the US Centre of Disease Control (CDC) reported here that there were an estimated 60.8 million cases. As of August 3, there were more than 4.5million confirmed COVID-19 cases in the US, according to Johns Hopkins University. This means, as referenced in the post, that currently there are approximately 56 million fewer COVID-19 cases in the US than there were swine flu cases during the 2009-2010 pandemic.", "A similar claim was shared tens of thousands of times on Facebook here, here and here.", "The claim, however, is misleading.", "In a press conference on April 13, 2020, the WHO said COVID-19 is ten times more deadly than swine flu, as stated in this AFP report.", "“We know that COVID-19 spreads fast, and we know that it is deadly; 10 times deadlier than the 2009 flu pandemic.", "“We know that the virus can spread more easily in crowded environments like nursing homes...We know that in some countries, cases are doubling every 3 to 4 days,\" said WHO chief Tedros Adhanom Ghebreyesus.", "Associate Professor Helen Petousis from The University of Auckland told AFP: “COVID-19 is a far more serious disease [than Swine Flu]”.", "In an email on July 29, 2020, she said: “The mortality rate of Swine Flu was around 1/100, the mortality rate for COVID-19 reported infections is around 2-3 per 100. Between 150,000 and half a million people were estimated to have died from Swine flu, so far COVID-19 deaths have well surpassed this at over 600,000.", "“We are only a few months in, and the cases are escalating.”", "She also said that in comparison to swine flu, “a greater proportion of COVID-19 cases are serious and need hospital treatment”.", "“COVID-19 outbreaks can quickly overwhelm health services through sheer numbers and when this happens there is an increase in death from other causes as well.", "“We have no vaccine against COVID-19. In the case of influenza, we adapt the annual flu vaccine to the circulating strains,” she added.", "As of August 3, 2020, COVID-19 has infected 17.9 million people globally, according to the Johns Hopkins University tally.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]