["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "State Senator Patrick Gallivan speaks at a press conference in Albany. (Dan Clark/Buffalo News)", "New York remains one of two states that can prosecute 16- and 17-year-old defendants as adults in criminal courts.", "Some Albany lawmakers want all of them treated as children in Family Court instead. They're pressing to include a measure to accomplish that as part of state budget negotiations. They want separate facilities for those sentenced to serve time, saying that separating them from criminals 18 and over in prison would lower the recidivism rate for the younger offenders. Lowering the age of criminal responsibility would lead to shorter sentences for the younger offenders.", "Opponents of the measure, however, warn about a blanket policy that treats every 16- and 17-year-old offender as a child. They want judges to be able to decide who to treat as adults in cases involving serious crimes like murder or sexual assault. The two sides are still negotiating.", "State Sen. Pat Gallivan, a Republican from Elma, says such a broad proposal may not be necessary because New York state usually treats 16- and 17-year-old defendants differently than adults.", "\"When you have roughly 30,000 individuals arrested a year for crimes that are 16 or 17, over 95 percent of them do not result in a criminal conviction,\"Gallivan said at a news conference. \"Only 1.5 percent of them ultimately go to state prison. So, I would make an argument that we are already treating them differently.\"", "Is Gallivan right on the numbers?", "A commission's report", "The senator’s data comes from a 2014 report by Gov. Andrew M. Cuomo’s Commission on Youth, Public Safety, and Justice. The commission convened to make recommendations on raising the age of criminal responsibility. The report shows about 33,000 cases resolved in 2013, with almost 2.7 percent receiving a sentence to state prison.", "That data has since been updated by the state Division of Criminal Justice Services, which reported close to 35,000 resolved cases involving 16- and 17-year-old defendants in 2013.", "Only 1,689 cases, or 4.8 percent, resulted in a criminal conviction, according to the data. Some 5,215 other cases resulted in a youth offender adjudication, given when someone is found guilty but a judge seals the record at sentencing.", "In all, 838 cases resulted in a state prison sentence, 2.4 percent of the cases resolved that year. Some 1,808 cases, about 5 percent, resulted in a jail sentence for lesser convictions.", "Defendants in the remaining cases were either found not guilty or received different sentences like probation or a fine. Or else they received a conditional discharge, allowing them to avoid incarceration or other punishment as long as they complied with conditions set by the court.", "More recent data", "There were 24,572 cases resolved involving 16- and 17-year-old defendants in 2016. Only 1,012 cases, or 4.1 percent, resulted in a criminal conviction. Some 3,802 resulted in a youthful offender adjudication.", "The state said 581 cases, or 2.4 percent of all cases, resulted in a state prison sentence, while 1,072 cases resulted in a local jail sentence.", "Our ruling", "Gallivan, a former Erie County sheriff and captain in the State Police, said of \"30,000 individuals arrested a year for crimes that are 16 or 17, over 95 percent of them do not result in a criminal conviction. Only 1.5 percent of them ultimately go to state prison.\"", "State data shows close to 96 percent of cases involving 16- and 17-year-old defendants did not result in a criminal conviction last year. Only 2.4 percent of these cases received sentences to state prison. That drops to less than 1.5 percent if you exclude youth offender adjudications. The state says both categories of offenders should be included in sentencing data.", "Gallivan is slightly off on the numbers, but his claim that few of these cases result in a conviction - and even fewer receive a state prison sentence - is correct.", "His statement is accurate but needs additional information. We rate it Mostly True.", "State Sen. Pat Gallivan holds a press conference, March 27, 2017", "Gov. Andrew M. Cuomo’s Commission on Youth, Public Safety, and Justice 2014 Report", "Data obtained from the NYS Division of Criminal Justice Services:", "2013 and 2016 cases resolved involving 16 and 17 year olds from DCJS", "2015 cases resolved involving all adults, including 16 and 17 year olds from DCJS", "Email and phone conversation with Jim Ranney from Sen. Pat Gallivan’s office", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]