["The photo was first published in this Facebook post on May 20, 2019, and has been shared more than 3,400 times. It has started to circulate again more widely in Africa, including Nigeria, Kenya, South Africa and Benin.", "It shows people standing in front of dozens of shelters made with wooden boards and plastic sheets on an abandoned railway line.", "“THIS IS LOS ANGELES, CALIFORNIA,” the caption on the post reads. “And they made us to believe that we can only find shanties & slums like this in Africa. This is what they hide from us until you go there and see for urself (sic).”", "Similar claims are made in other Facebook posts, some archived here, here and here.", "Many of the comments suggest some Facebook users believed the picture was shot in Los Angeles, while others were sceptical, even dismissive, about the claim.", "While the photo is real, it was not shot in Los Angeles. It was taken five years ago and shows a slum between the Porte de Clignancourt and the Porte de la Chapelle on the outskirts of Paris.", "A reverse image search on Yandex web browser led us to a Daily Mail story published on December 18, 2015, alongside the photo with a watermark for Associated Press (AP) in the bottom left-hand corner. The story reports on the living conditions of Roma communities in the French capital.", "AP's archives confirm the photo was taken on the same day by  Jacques Brinon.", "“Roma stand through their makeshift camp set up next to the Paris ring road, Friday, Dec.18, 2015,” the caption reads. “Roma, mostly from Romania and Bulgaria, are among Europe's most marginalised minorities.”", "A similar photograph was taken of the same camp by Florian David for AFP a few months earlier, on September 30, 2015.", "Using Google Street View, AFP Fact Check confirmed that the AP picture was indeed shot in the north of Paris.", "Some visible features in the picture such as rail lines and wall paintings match with those seen on Google Street View's historical images of the camp from 2015.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]