["About this rating", "Pelosi did indeed give Philonise Floyd a folded American flag after he testified at a House committee meeting on June 10, 2020.", "However, anyone can present a folded flag to any person, regardless of his/her relation to a veteran, and for any reason.", "On June 10, 2020 — one day after the funeral of George Floyd, a Black man who died in the custody of Minneapolis police and sparked a national reckoning over racism and police brutality — Floyd's younger brother, Philonise Floyd, testified before the U.S. House Judiciary Committee. In the roughly five-minute speech, he described his sibling's death as one in a series of senseless killings of Black men by American cops and asked the committee to \"stop the pain\" for families like his.", "\"People of all backgrounds, genders and races have come together to demand change — honor them, honor George, and make the necessary changes that make law enforcement the solution and not the problem,\" he testified. \"The people marching in the streets are telling you enough is enough.\"", "Hours after the testimony, U.S. House Speaker Nancy Pelosi, who is not a member of the committee, tweeted the below-displayed post to publicize his participation in the hearing and to apparently show her followers that she supported him.", "The tweet quickly drew criticism online among supporters of U.S. President Donald Trump, veterans, and their families who alleged the tweet and its photos showed Pelosi inappropriately giving a folded American flag in a presentation case to Philonise Floyd; they claimed such a gesture was reserved only for the relatives of members of the U.S. Armed Forces or police officers after they die. \"What a slap in the face to service members,\" one person tweeted.", "Peggy Hubbard, who is a retired Navy veteran, former police officer, and Republican candidate in Illinois' 2020 Senate race, added to the criticism with a viral Facebook video in which she made vague references to a group of people who have disrespected the flag (presumably during protests against police brutality in the wake of George Floyd's death) and claimed Democrats had committed an offense by giving Philonise Floyd a folded American flag that is \"preserved for veterans.\" She said:", "Nancy Pelosi presented George Floyd's family with the ... same flag that these assholes burned, the same flag that they stood on and peed on, the same flag that they wiped their butts on, she turns around and gives this man, a convicted felon, never served in the military, never did a good thing for our country ... and [Pelosi] turns around and gives his family the American flag. ...", "Just obliterated the honor of the men and women that bled and died for that uniform for our country, who died protecting that flag and you go give that asshole a folded flag — as if.", "That video and other posts on the matter included references to George Floyd's past arrests and incarcerations as part of what appeared to be an effort to deny him martyrdom and criticize the House speaker and other Democratic leaders' connection to the Floyd family. (Here's a detailed investigation into George Floyd's criminal history and psychologists' explanation for why people often draw attention to the arrest records of Black men who die in police custody.)", "Readers asked Snopes to investigate the claim about the folded flag — many of whom asked whether the photograph with Pelosi was \"real\" or digitally manipulated in any way — and we found the assertion contains some truth and some falsehood.", "Firstly, we considered procedures by the U.S. Department of Veterans Affairs (VA), which gifts American flags during funeral services to the relatives of the deceased who fit the below-displayed categories (as outlined on the VA's website) and who make the request.", "Veteran who served during wartime", "Veteran who died on active duty after May 27, 1941", "Veteran who served after January 31, 1955", "Peacetime Veteran who was discharged or released before June 27, 1950 after serving at least one enlistment, or for a disability incurred or aggravated in line of duty", "Certain persons who served in the organized military forces of the Commonwealth of the Philippines while in service of the U.S. Armed Forces and who died on or after April 25, 1951", "Certain former members of the Selected Reserves", "Floyd did not qualify for such a ceremony. He was born in North Carolina, spent most of his life in Houston, and died in Minneapolis on May 25, 2020, after a police officer knelt on his neck for nearly nine minutes. At no point did he serve in the U.S. military, which includes the Army, Marine Corps, Navy, Air Force, Space Force, Coast Guard, National Guard, and Air National Guard.", "Next, to get to the bottom of the claim, we considered two key questions: Did Pelosi indeed present a folded American flag to a relative of George Floyd like her tweet suggests? And, if so, did she break U.S. Flag Code, which is a set of federal advisories for how people should display and care for the American flag?", "For the former, we analyzed the account from where the tweet originated. With more than 4.8 million followers, it is the verified account for which Pelosi promotes her public appearances, media interviews, and political agenda, and it is linked with her official website as U.S. House speaker.", "The tweet on June 10, 2020, was posted roughly one hour after Pelosi called for the removal of 11 statutes representing Confederate leaders and about 30 minutes before the Twitter account circulated an interview Pelosi gave to CNN. And in that footage, Pelosi is wearing what appeared to be the same outfit (a blue shirt, off-white blazer with a lapel gold pin, and blue mask) she wore when photographed giving the alleged folded American flag to Philonise Floyd.", "In a call to Snopes on June 17, 2020, Pelosi's Deputy Chief of Staff Drew Hammill confirmed the account that tweeted the photo was the House Speaker's official Twitter channel and, yes, she had given Philonise Floyd a folded American flag on June 10, 2020, after his testimony in front of the House committee that day.", "To explore whether Pelosi had broken federal guidelines for how to handle the flag, we reviewed Title 4 and Title 36 of U.S. Code, which designates \"The Star-Spangled Banner\" as the national anthem and advises how Americans should treat the flag. Among other things, the statutes state: \"No disrespect should be shown to the flag of the United States of America.\"", "Here's what's key in the analysis: No language in the federal statutes prohibits government officials — or anyone — from presenting a folded flag to any American for any reason. Also, the statutes do not prescribe symbolic meaning to the 13 steps people traditionally use to fold a flag into a triangle, like the one Philonise Floyd received. (Read more about that misconception here.)", "John Raughter, the deputy director of communications for the American Legion, summed up the matter in an email to Snopes. He said while the folded flag has come to represent a veteran funeral rite, the federal advisories do not say who can, or cannot, receive one as a gift, nor under what cases the flag should be folded into a triangle and stored in a display case. Raughter said in an email:", "We encourage the display of the flag of the United States by all citizens of the United States. Now while there is no rule for it, traditionally a flag is folded into a triangle when it is not flown and may be stored in a presentation case if a particular flag has special meaning.", "So presenting someone with a flag, folded into a triangle and placed into a display case is an honorable way of presenting and maintaining the flag of the United States.", "To that point, anyone can buy a display case for an American flag via Amazon or other retailers, and Pelosi and other members of Congress allow constituents to purchase American flags via their offices, including flags that have flown over the Capitol. The Architect of the Capitol (AOC), which is the federal agency in charge of maintaining the Capitol building, oversees that federal flag-buying system, fulfilling an average of more than 100,000 flag requests from House and Senate offices annually, per the AOC's website.", "Hammill said the allegation that Pelosi had broken some sort of federal guideline governing the use of the American flag is \"completely false\" and \"flag code is completely consistent\" with the House Speaker's actions. He added:", "It's not a foggy area at all. Members of Congress routinely request flags. ...This is done almost every single day by members of Congress.", "Also, while evaluating Pelosi's alleged actions, this is important: Anyone who does break the U.S. Flag Code and gets caught won't face fines or jail time because the Supreme Court has ruled that the First Amendment's right to free speech covers any politically motivated violations of the statutes. In other words, if the code did indeed prohibit Pelosi from presenting a folded flag to George Floyd's family, like the above-mentioned claims falsely assert, she could not face any penalties legally. The AARP states on its website:", "The code, which was drawn up at the first National Flag Conference in Washington in 1923, is part of the law of the land. But it is not enforced, nor is it enforceable. It is merely a set of guidelines, letting Americans know what to do — and what not to do — with our red, white and blue national emblem.", "There is no Flag Police. You will not be arrested for wearing a flag-embossed T-shirt on Independence Day — or any other day of the year.", "In sum, given the photographic evidence of Pelosi giving Philonise Floyd a folded American flag and her official Twitter promoting those images — and the fact that the flag-giving ceremony is not reserved only for the relatives of veterans; members of Congress routinely provide constituents flags that have been flown over the Capitol — we rate this claim a \"Mixture\" of truth and falsehood.", "Leepson, Marc.   \"5 Myths About the American Flag.\"\r\n   AARP.   16 June 2020.", "C-Span.   House Judiciary Committee Hearing on Police Reform.\r\n   10 June 2020.", "Berman, Mark.   \"Protests Spread Over Police Shootings. Police Promised Reforms. Every Year, They Still Shoot and Kill Nearly 1,000 People.\"\r\n   The Washington Post.   8 June 2020.", "U.S. Department of Defense.   \"Our Forces.\"\r\n   Accessed 16 June 2020.", "4 USC Ch. 1: The Flag.   \"From Title 4 — Flag and seal, seat of government, and the states.\"\r\n   Accessed 16 June 2020.", "Dateway.net.   \"Pelosi Gifts George Floyd's Brother Folded American Flag Reserved Only For Fallen Veterans.\"\r\n   16 June 2020.", "36 USC Ch. 1: The Flag.   \"From Title 36 — Patriotic and National Observances, Ceremonies, and Organizations.\"\r\n   Accessed 16 June 2020.", "U.S. Department of Veterans Affairs.   \"Office of Procurement, Acquisition and Logistics.\"\r\n   Accessed 16 June 2020.", "Architect of the Capitol.   \"Capitol Flag Program\".\r\n   Accessed 17 June 2020.", "This report was updated on June 17, 2020 to include an interview with Pelosi's Deputy Chief of Staff.", "Jessica Lee is Snopes' Senior Assignments Editor with expertise in investigative storytelling, media literacy advocacy and digital audience engagement.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]