["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Sen. Barack Obama took several swipes at Sen. Hillary Clinton, his rival in the race for the Democratic nomination, at a Feb. 10, 2008, campaign rally in Alexandria, Va.", "In one, he used an example of something she said to illustrate his point that Americans \"don't want political talk.\"", "\"I think part of what the American people are looking for right now is straight talk,\" Obama said. \"They don't want political talk. I'll just give you one example. Sen. Clinton and I were debating and she was asked about the bankruptcy law that she voted for in 2001. . . . During the debate she said, you know, 'I voted for it, but I hoped it wouldn't pass.' That was a quote on live TV. That kind of talk, I think it makes people not trust government.\"", "Problem is, that's not what she said.", "Obama is referring to a Jan. 15, 2008, Democratic debate in Las Vegas when Clinton was asked by moderator Tim Russert if she regretted her vote in favor of the 2001 bankruptcy bill.", "Here's what Clinton said: \"Sure I do, but it never became law, as you know. It got tied up. It was a bill that had some things I agreed with and other things I didn't agree with, and I was happy that it never became law. I opposed the 2005 bill as well.\"", "The 2001 bankruptcy bill was intended as a dramatic overhaul of the bankruptcy laws, making it harder for people to eliminate debts in bankruptcy court and keeping wealthy debtors from using their homes as a shield for assets. It was hugely backed by the banking, credit card and retail credit industries. It passed the Senate, 83-15, on March 15, 2001, with the yes vote of Clinton, but because of differences in the House legislation, it never became law.", "Four years later, bankruptcy reform finally did become law. Clinton missed that vote; Obama opposed it.", "But back to the 2001 bill. Clinton said she was \"happy that it never became law.\" He says she said, \" 'I voted for it, but I hoped it wouldn't pass.' \" The thing is, being happy about something after it happens is not the same as hoping along the way that it wouldn't happen. And yet, the latter is how Obama characterizes Clinton's words.", "We need to be clear on this point, given that Obama sets up his charge against Clinton as an example of \"political talk\" and follows it up with, \"That kind of talk, I think it makes people not trust government.\"", "Absolutely, Clinton said she regretted her vote. And, had Obama phrased his charge differently, he would have a case here. But because he portrays her wording as a precise quote, and is so incorrect about it, we give him a False.", "GovTrack.us.,\n\nS. 420--107th Congress (2001): Bankruptcy Reform Act of 2001,\n\nMarch 15, 2001", "Las Vegas Sun,\n\nDemocratic debate transcript,\n\nJan. 15, 2008", "Associated Press, \"Senate passes bankruptcy overhaul bill,\" by Marcy Gordon, March 16, 2001", "U.S. Senate,\n\nS. 256,\n\nBankruptcy Abuse Prevention and Consumer Protection Act of 2005, April 20, 2005", "U.S. Senate,\n\nS. 256 roll call votes,\n\nMarch 10, 2005", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]