["About this rating", "People for the Ethical Treatment of Animals (PETA) reported that Costco had informed the group it was temporarily halting sale of Chaokoh coconut milk, citing PETA's report of the use of mistreated monkeys in producing it. As of this writing, the product is not shown as available for purchase on Costco's website.", "Costco hasn't publicly confirmed that it stopped selling Chaokoh because of reports of monkey labor and abuse.", "In early November 2020, Snopes readers inquired about news stories reporting that the big box wholesale chain Costco had halted sale of the Chaokoh brand of coconut milk, due to reports from animal advocacy group People for the Ethical Treatment of Animals (PETA) that the product is made using mistreated, exploited monkeys.", "PETA, which has been campaigning for stores to drop the brand after the group investigated, reported on Oct. 28, 2020, that Costco had dropped Chaokoh coconut milk from its sales.", "“No kind shopper wants monkeys to be chained up and treated like coconut-picking machines,” PETA's president Ingrid Newkirk said in a statement. “Costco made the right call to reject animal exploitation, and PETA is calling on holdouts like Kroger to follow suit.”", "PETA investigators reported that monkeys are used in the production of coconut milk in Thailand, and that the animals are treated with cruelty. They are taken away from their families at a young age and kept chained and confined, except when they are forced to climb coconut trees to pick coconuts. Some are used in circus-type performances and some have their teeth removed if they bite their owners in response to maltreatment.", "Costco hasn't confirmed PETA's claim that monkeys were mistreated, however, and has not commented publicly on the subject. We asked Costco whether it had stopped selling Chaokoh due to monkey labor and cruelty, but didn't get a response in time for publication.", "But PETA made public a letter it said it received from a Costco executive stating that the company has temporarily ceased purchasing the brand's coconut milk until Costco can be assured monkeys are not used in the production of the coconut milk.", "According to USA Today, which was first to report the story, \"Costco follows Walgreens, Food Lion, Giant Food and Stop & Shop\" in halting the sale of coconut milk brands made from coconuts picked in Thailand by, PETA alleges, mistreated and exploited monkeys.", "Theppadungporn Coconut Co. Ltd, the Thai maker of Chaokoh coconut milk, denied that monkeys were used in the production of its product, telling USA Today that it had the coconut plantations audited and no monkey labor was found.", "In late January 2021, USA Today reported retail chain Target said it had dropped the brand from store shelves as of November 2020.", "Updated to note Target announced it dropped the brand.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]