["By Angelo Fichera", "Posted on December 21, 2020", "President Donald Trump and tens of thousands of others have shared a false claim on social media that there were “13 MILLION” more votes cast in the 2020 election than eligible voters who participated. That falsehood rests on a flawed calculation.", "In the latest of an unrelenting series of falsehoods on social media about the presidential election, a viral story is erroneously claiming that there were “13 MILLION” more votes counted in the election than the number of eligible voters who participated.", "The story appeared on Dec. 20 on the Gateway Pundit, a website with a history of spreading misinformation. “REVEALED: ‘Simple Math’ Shows Biden Claims 13 MILLION More Votes Than There Were Eligible Voters Who Voted in 2020 Election,” its headline reads.", "President Donald Trump amplified the story to his more than 88 million Twitter followers and the story has been shared more than 18,000 times on Facebook, according to CrowdTangle analytics data.", "But the story’s claim rests on a flawed basis, not “simple math.”", "Premised on a tweet from a former intelligence official named Bill Binney, the Gateway Pundit story cites a Washington Post story that reported that an estimated 66.2% of the voting-eligible population participated in the 2020 election — the highest since 1900.", "The Gateway Pundit then cites a World Population Review page to calculate that there are 213.8 million registered voters in the country.", "With that comes the making of the bogus calculation (emphasis theirs).", "Gateway Pundit, Dec. 20: Using the numbers as of today, which are materially similar to Binney’s, we find a huge issue.  If we have 213.8 million registered voters in the US and 66.2% of all voters voted in the 2020 election, that equals 141.5 voters who voted in the 2020 election (Binney shows 140 million which is materially the same).", "If President Trump won 74 million votes, then that leaves only 67.5 million votes remaining for Biden.  This means 13 million duplicate or made up ballots were created and counted for Biden!", "But as we said, the Washington Post story estimated that 66.2% of the voting-eligible population (around 239.2 million people, according to the United States Elections Project) voted, not 66.2% of registered voters. So the Gateway Pundit is wrongly using the estimated turnout among eligible people and trying to apply it to something else: an estimate of registered voters. Not everyone in the voting-eligible population is registered to vote.", "Also, it’s worth noting that the World Population Review information on registered voters isn’t completely up-to-date, if one did want to compare it to the total votes cast.", "For example, it lists Texas’ voter registration as 16,211,198 as of March 1. That was true at the time. But the state’s November update put the number of registered voters at 16,955,519 — so that state alone is missing more than 744,000 voters.", "The fact is, there were about 81.3 million votes cast for President-elect Joe Biden and 74.2 million votes for Trump. And there is no evidence that 13 million of Biden’s votes were from “duplicate or made up ballots.”", "Attorney General William Barr on Dec. 1 told the Associated Press that “to date, we have not seen fraud on a scale that could have affected a different outcome in the election.” At a Dec. 21 press conference, Barr said (at 27:40) that he stood by his earlier remarks.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here for more.", "“2020 November General Election Turnout Rates.” United States Elections Project. Updated 7 Dec 2020.", "“Attorney General Barr Announces Criminal Charges in 1988 Pan Am Flight 103 Bombing.” C-SPAN. 21 Dec 2020.", "Balsamo, Michael. “Disputing Trump, Barr says no widespread election fraud.” Associated Press. 1 Dec 2020.", "“November 2020 Voter Registration Figures.” Texas Secretary of State’s Office. Accessed 21 Dec 2020.", "“Number Of Registered Voters by State 2020.” World Population Review. Accessed 21 Dec 2020.", "Schaul, Kevin, et. al. “2020 turnout is the highest in over a century.” Washington Post. Updated 18 Dec 2020.", "“Turnout and Voter Registration Figures (1970-current).” Texas Secretary of State’s Office. Accessed 21 Dec 2020.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]