["Chandrayaan-2 (in English, Moon Chariot 2) is India’s second lunar exploration mission, which launched on July 22, 2019. Here is an AFP report about the launch.", "Doctored Apollo 17 image", "One image was published here on Twitter on July 27, 2019. The caption states: \"Chandrayan 2 photo\".", "It shows what appears to be an astronaut in a spacesuit next to a lunar rover, with a distant view of Earth in the background. Below is a screenshot of the image:", "But Chandrayaan-2 is an unmanned mission.", "This picture is actually a composite image based on a colourised 1972 photo of Apollo 17 astronaut Harrison Schmitt, taken by crewmate Eugene Cernan. The photo is shown below:", "The photo appears on the NASA website here with the caption: “The image shows Schmitt on the left with the lunar rover at the edge of Shorty Crater, near the spot where geologist Schmitt discovered orange lunar soil. Forty five years later, Cernan and Schmitt are still the last to walk on the Moon.”", "Below is a side by side comparison of part of the image from the misleading Facebook post (L) and the original photo (R):", "Another reverse image search found the top half of the image in the misleading Twitter post was extracted from this image created by graphic artist Hana Gartstein.", "Below is a screenshot of the image on NASA's Astronomy Picture of the Day website, dated March 2, 2007:", "Animated NASA video", "The second image was published on Facebook here on July 28, 2019.", "The caption states: \"First photograph of earth, sent by Chandrayan 2 - What an eye-catching visual it is\".", "Below is a screenshot of the misleading post:", "The image is in fact a screenshot from an animated video produced by NASA in 2005 which shows the effect of magnetic fields on visual phenomena.", "It was previously circulated alongside a claim that it depicted the aurora borealis phenomenon from space. This claim was debunked by Snopes in March 2018.", "Below is a screenshot comparison of the image shown in the misleading post (L) and a screenshot of the NASA video (R):", "The image appears at the one minute five second mark of the video from NASA published on its official YouTube channel here. The video is embedded below.", "Digital illustration of Earth", "The third image was published in this Facebook post on July 28, 2019.", "The caption states: \"First photograph of earth, sent by Chandrayan 2. #photography, #earth, #chandrayan2.\"", "Below is a screenshot of the misleading post:", "The image is in fact a digital picture of the Earth published on the online art community DeviantArt on December 22, 2010 and credited to Jesper Ullbing.", "Below is a side-by-side comparison of the image in the misleading Facebook post (L) and the image posted on DeviantArt (R):", "According to a Tineye search, the fourth image has been circulated online since at least September 2010. Some sites have offered the image as a free screen background for mobile phones.", "Mobile phone wallpaper illustration", "The fourth image was published here on Facebook on July 28, 2019.", "The caption states: \"Good morning. Wish you a happy Sunday.\n\tFirst picture of Sunrise on earth from India's Chandrayan-2. #suninstagram #chandrayan2.\"", "Below is a screenshot of the misleading post:", "This digital illustration of the Earth has been shared online since at least 2004, when it was offered as a mobile phone wallpaper on a personal blog.", "Below is a screenshot comparison of the image in the misleading Facebook post (L) and the image on the blog (R):", "Illustrator's digital image of Earth", "The fifth image was published here on Facebook on July 27, 2019.", "The caption states: \"First photograph of earth, sent by Chandrayan 2 - What an eye-catching visual it is\".", "Below is a screenshot of the misleading post:", "The image is in fact an illustration available on Shutterstock, credited to illustrator Alan Uster. It has circulated online since at least 2014, according to Tineye.", "Below is a screenshot of the image on Shutterstock:", "On August 4, 2019, the Indian Space Research Organisation published a number of photos actually taken by the Chandrayaan-2 mission. They can be found on Twitter here, here, here, here and here.", "#ISRO\n\t\tFirst set of beautiful images of the Earth captured by #Chandrayaan2 #VikramLander\n\t\tEarth as viewed by #Chandrayaan2 LI4 Camera on August 3, 2019 17:28 UT pic.twitter.com/pLIgHHfg8I", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]