["About this rating", "The Social Security system has been a contentious political issue ever since it was proposed by President Franklin D. Roosevelt and implemented in 1935. Arguments regarding how the system should be used, administered, and funded — and even whether it should exist at all — have been the subject of debate for many decades now:", "Examples:   [Collected via e-mail, October 2005]", "SOCIAL SECURITY:Franklin Roosevelt, a Democrat, introduced the Social Security (FICA) Program. He promised:", "1.) That participation in the Program would be completely voluntary,", "2.) That the participants would only have to pay 1% of the first $1,400 of their annual incomes into the Program,", "3.) That the money the participants elected to put into the Program would be deductible from their income for tax purposes each year,", "4.) That the money the participants put into the independent \"Trust Fund\" rather than into the General operating fund, and therefore, would only be used to fund the Social Security Retirement Program, and no other Government program, and,", "5.) That the annuity payments to the retirees would never be taxed as income.", "Since many of us have paid into FICA for years and are now receiving a Social Security check every month — and then finding that we are getting taxed on 85% of the money we paid to the Federal government to \"put away,\" you may be interested in the following:", "Q: Which Political Party took Social Security from the independent \"Trust\" fund and put it into the General fund so that Congress could spend it?", "A: It was Lyndon Johnson and the Democratically-controlled House and Senate.", "Q: Which Political Party eliminated the income tax deduction for Social Security (FICA) withholding?", "A: The Democratic Party.", "Q: Which Political Party started taxing Social Security annuities?", "A: The Democratic Party, with Al Gore casting the \"tie-breaking\" deciding vote as President of the Senate, while he was Vice President of the U.S.", "Q: Which Political Party decided to start giving annuity payments to immigrants?", "MY FAVORITE :\nA: That's right! Jimmy Carter and the Democratic Party. Immigrants moved into this country, and at age 65, began to receive SSI Social Security payments! The Democratic Party gave these payments to them, even though they never paid a dime into it!", "Then, after doing all this lying and thieving and violation of the original contract (FICA), the Democrats turn around and tell you that the Republicans want to take your Social Security away!", "And the worst part about it is, uninformed citizens believe it!", "Perhaps we are asking the wrong questions during this 2004 election year!", "Variations: A version of this piece circulated via e-mail in 2005 opened with the following introduction:", "Dear Friends:Many years ago in Seattle, two wonderful neighbors, Elliott and Patty Roosevelt came to my home to swim on a regular basis. They were a great couple full of laughter and stories that today I continue to marvel at. Both are now deceased, but their stories remain. During the years of our friendship we had many, many discussions about his parents (President Franklin D. and Eleanor Roosevelt) and how his father and mother never intended for the Social Security and Welfare programs to turn out the way they are today. Elliott used to say that if his mother returned to earth and saw what the politicians had done to their programs she would have burned all of them in hell.", "Here is a story I received today regarding the Social Security Program and I immediately thought of Elliott's comments. Hope you will read this and think about it.", "In this vein, the above-quoted item seeks to enumerate (and assign blame for) alterations to Social Security that have supposedly betrayed the intent of the system as originally conceived back in the 1930s. Most of the entries contained therein, however, are inaccurate regarding what changes were made and/or who was responsible for making them:", ". . . participation in the Program would be completely voluntary", "There was no provision in the Social Security Act of 1935 (nor has there ever been any provision) for the payment of Social Security payroll taxes (now commonly known as FICA, from an acronym for the Federal Insurance Contributions Act) to be voluntary. Since the inception of the Social Security program, the law has required that payroll taxes for persons working at jobs covered by Social Security \"shall be collected by the employer of the taxpayer by deducting the amount of the tax from the wages as and when paid.\"", "It is true that Social Security provisions originally applied only to \"workers in commerce and industry (except railroads) under age 65 in the continental United States, Alaska and Hawaii, and on American vessels,\" and thus those who worked in fields not designated as \"commerce and industry\" (e.g., government workers, farm workers, doctors, lawyers) neither paid into the Social Security fund nor received benefits from it. Nearly all of those exemptions have been since phased out:", ". . . participants would only have to pay 1% of the first $1,400 of their annual incomes into the Program", "Social Security taxes were never limited to the first $1,400 of annual income, nor was there any provision in the Social Security Act of 1935 to permanently fix the tax rate at 1%. The Social Security Act of 1935 set the original rate at 1% of the first $3,000 of annual income, with provisions to gradually increase that rate to 3% over the next twelve years:", "1) With respect to employment during the calendar years 1937, 1938, and 1939, the rate shall be 1 per centum.\n(2) With respect to employment during the calendar years 1940, 1941, and 1942, the rate shall 1 1/2 per centum.\n(3) With respect to employment during the calendar years 1943, 1944, and 1945, the rate shall be 2 per centum.\n(4) With respect to employment during the calendar years 1946, 1947, and 1948, the rate shall be 2 1/2 per centum.\n(5) With respect to employment after December 31, 1948, the rate shall be 3 per centum.", "These figures have been adjusted many times over the years. Under the Federal Insurance Contributions Act, as of 2005 participants pay 6.2% of the first $90,000 of their income (with their employers contributing a like sum) into what is commonly known as OASDI (from an acronym for Old Age Survivors and Disability Insurance, the official name of the basic retirement benefits portion of the Social Security program).", ". . . the money the participants elected to put into the Program would be deductible from their income for tax purposes each year", "The original Social Security Act of 1935 specifically stated that Social Security payroll taxes were not to be allowed as income tax deductions:", "For the purposes of the income tax imposed by Title I of the Revenue Act of 1934 or by any Act of Congress in substitution therefor, the tax imposed by section 801 shall not be allowed as a deduction to the taxpayer in computing his net income for the year in which such tax is deducted from his wages.", "Social Security payroll taxes have never been deductible from income for tax purposes, either when the program was originally instituted or at any time since.", ". . . the money the participants put into the independent \"Trust Fund\" rather than into the General operating fund, and therefore, would only be used to fund the Social Security Retirement Program, and no other Government program", "The Social Security Trust Fund was established in 1939 to receive monies collected for Social Security through payroll taxes. The monies in this fund are managed by the Department of the Treasury; they are not, nor have they ever been, put into the \"general operating fund.\"", "However, whether the Social Security Trust Fund can truly be said to be \"independent\" is problematic. The Social Security Act specifies that the monies in the fund may only \"be invested in securities backed by the full faith and credit of the Federal government,\" such as treasury bills, treasury notes, and treasury bonds, as well as special issue bonds. So, essentially, the government can \"invest\" Social Security funds by lending them to itself, then spending that money on programs not related to Social Security (e.g., defense, foreign aid, education). The government \"pays back\" this money when the Social Security program redeems the bonds, but critics of the program contend Social Security will eventually fall into deficit by 2018, and the Treasury won't have the necessary cash on hand to redeem the bonds and pay back the fund. As the Social Security and Medicare Trustees themselves noted in their 2005 Annual Report:", "In 2005 the Social Security tax income surplus is estimated to be more than offset by the shortfall in tax and premium income for Medicare, resulting in a small overall cash shortfall that must be covered by transfers from general fund revenues. The combined shortfall is projected to grow each year such that by 2017 net revenue flows from the general fund to the trust funds will total $515 billion, or 2.3 percent of GDP. Since neither the interest paid on the Treasury bonds held in the HI [Hospital Insurance] and OASDI Trust Funds, nor their redemption, provides any net new income to the Treasury, the full amount of the required Treasury payments to these trust funds must be financed by some combination of increased taxation, increased Federal borrowing and debt, or a reduction in other government expenditures. Thus, these payments along with the 75 percent general fund revenue contributions to SMI will add greatly to pressures on Federal general fund revenues much sooner than is generally appreciated.", "A somewhat dated but detailed article about how the Social Security trust funds are invested can be found here.", ". . . the annuity payments to the retirees would never be taxed as income", "It is true that Social Security benefits were not originally considered taxable income. However, that status was not due to any promise or act on the part of President Roosevelt, nor was it specified in the Social Security Act (or any other law); it was the result of a series of rulings by the Treasury Department in 1938 and 1941 that excluded Social Security benefits from federal income taxation. Those rulings were overriden by amendments to the Social Security act enacted in 1983.", "Q: Which Political Party took Social Security from the independent \"Trust\" fund and put it into the General fund so that Congress could spend it?A: It was Lyndon Johnson and the Democratically-controlled House and Senate.", "As noted above, the monies paid into the Social Security trust have never been \"put into the general fund.\" The requirements for how the Social Security Trust Fund is to be financed and invested have not changed since the fund's inception in 1939. The reference to Lyndon Johnson indicates that someone was probably confused by a change implemented at the end of the Johnson administration (1969) that altered how the fund was accounted for in the federal budget but did not change the actual operations of the fund itself:", "Beginning in fiscal year 1969, Social Security and other Federal programs that operate through trust funds were counted officially in the budget. This was done administratively by President Johnson. At the time Congress did not have a budget-making process. In 1974 Congress adopted procedures for setting budget goals through passage of annual budget resolutions. Like the budgets prepared by the President, these resolutions were to reflect a \"unified\" budget that included trust fund programs such as Social Security in the budget totals.Beginning in the late 1970s, Social Security faced financial problems, and over a period of time legislation was enacted to restore the financial health of the program. However, because the Federal budget deficit remained large, interest in reducing Social Security spending continued. This routine consideration of Social Security constraints led to concerns that cuts in Social Security were being proposed for budgetary purposes rather than programmatic ones.", "In response to this concern, a series of measures were enacted in 1983, 1985, and 1987 making the program a more distinct part of the budget and permitting Congressional floor objections (points of order) to be raised against budget bills containing Social Security changes.", "This method of accounting for the Social Security Trust Fund in the federal budget was reversed in 1990.", "Q: Which Political Party eliminated the income tax deduction for Social Security (FICA) withholding?A: The Democratic Party.", "As noted above, Social Security withholding has never been deductible from income for tax purposes. The original Social Security Act of 1935 specifically stated that monies paid into Social Security via payroll taxes were not to be allowed as income tax deductions.", "Q: Which Political Party started taxing Social Security annuities?A: The Democratic Party.", "Prior to 1984, income derived from Social Security benefits was exempt from taxation. Amendments to the Social Security Act passed by Congress in 1983 allowed for 50% of Social Security benefits to be considered taxable income for taxpayers whose total income exceeded specified thresholds.", "Responsibility for this change cannot fairly be assigned to either political party. The idea originated with a proposal issued by the bipartisan Greenspan Commission, which had been created by President Ronald Reagan, a Republican. The amendments were passed by a House of Representatives in which the Democrats held a clear majority of the seats (296-166), but the proposed amendments received \"Yea\" votes from members of both parties, and they were signed into law by President Reagan.", "Q: Which political party increased the taxes on Social Security annuities?A: The Democratic Party, with Al Gore casting the \"tie-breaking\" deciding vote as President of the Senate, while he was Vice President of the U.S.", "In 1993, Congress passed legislation that increased the percentage of Social Security benefits subject to taxation from 50% to 85%. As with the 1983 amendments to the Social Security Act, this increase applied only to taxpayers whose total income exceeded specified thresholds.", "This change to Social Security was but one element of the massive Omnibus Budget Reconciliation Act (OBRA) introduced in Congress in 1993. OBRA was barely passed by a 218-216 vote in the House of Representatives, with not a single Republican voting in favor of it (although 41 Democrats voted against it). Likewise, the Senate vote on OBRA was deadlocked at 50-50 (again, with not a single Republican voting in favor of it, although 6 Democrats voted against it) until Vice-President Al Gore (a Democrat) cast the deciding \"Yea\" vote. The bill was signed into law by President Bill Clinton (also a Democrat).", "Q: Which Political Party decided to start giving annuity payments to immigrants?A: That's right! Jimmy Carter and the Democratic Party. Immigrants moved into this country, and at age 65, began to receive SSI Social Security payments! The Democratic Party gave these payments to them, even though they never paid a dime into it!", "No one — whether he be a citizen, immigrant, or illegal alien — is eligible to collect Social Security benefits unless he (or someone else, such as a parent or spouse) has paid into the system. Someone has confused Social Security itself with Supplemental Security Income (SSI) — the latter is a federal welfare program \"designed to help aged, blind, and disabled people, who have little or no income\" by providing \"cash to meet basic needs for food, clothing, and shelter.\" Immigrants can qualify for SSI benefits under certain conditions, but SSI is financed by general revenues and not Social Security taxes. SSI was not enacted by the administration of President Jimmy Carter (a Democrat); it was created and signed into law in 1972, during the administration of President Richard Nixon (a Republican).", "Additional information:", "Riedl, Brian and David John.   \"Social Security's Fictitious Trust Fund.\"     Knight-Ridder Tribune.   10 November 2004.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]