["By Sydney Nixon", "Posted on July 1, 2020", "A Christian blogger writing for The Daily Jot accused former President Barack Obama in 2017 of running a “shadow government.” The blog post has been recirculating lately on social media, but it is falsely attributed to the late Pulitzer Prize-winning columnist Charles Krauthammer.", "After a period of relative silence since leaving office in January 2017, former President Barack Obama returned to the political stage in mid-April to endorse his former vice president, Joe Biden, in the 2020 presidential election. Then, on May 8, during a call with former members of his administration, Obama publicly criticized President Donald Trump’s response to COVID-19 as “an absolute chaotic disaster.”", "Now, a viral post, shared widely on Facebook, is claiming that Obama — through Organizing for Action, the nonprofit established during his second term — is “working to disrupt everything that our current president’s administration is trying to do.”", "The post attributes the claims to conservative columnist Charles Krauthammer.", "But Krauthammer, who died in 2018, did not write the article and Organizing for Action no longer exists.", "The same attribution was debunked by Snopes in 2017, but has resurfaced since Obama has taken an active role in the presidential election.", "The false attribution of the article apparently began when the website Nesara-Republic Now-Galactic News published a piece titled “The Enemy Amongst Us!!” on Oct. 11, 2017. It claimed the piece had appeared in the New York Post and attributed it to Krauthammer, a Pulitzer Prize-winning contributor to the Washington Post who was a staple on Fox News.", "When questioned about the origins of the article by Snopes, one of Krauthammer’s research assistants said, “Dr. Krauthammer did not write it and has nothing to do with it.” Moreover, “The Enemy Amongst Us!!” isn’t listed on the New York Post’s author page for Krauthammer.", "The text — except for the introductory and closing paragraphs — was mainly taken from a blog post by Bill Wilson dated Feb. 13, 2017, and titled “The perilous times we live in” on The Daily Jot, Wilson’s website. The Daily Jot describes its content as “News Analysis from a prophetic Christian Worldview.”", "The Facebook post, which features a photo of Obama over the headline “TRAITOR,” claims Organizing for Action is “the shadow government organization aimed at resisting and tearing down the Constitutional Republic we know as AMERICA.”", "In January 2013, during his second term, Obama launched OFA, which described itself as a 501(c)(4) “social welfare” organization that advocated for Obama’s national agenda, including “gun violence prevention, sensible environmental policies to address climate change and immigration reform.”", "OFA merged in 2019 with the National Redistricting Action Fund, a group run by Eric Holder, Obama’s former Attorney General. The merged organization, the National Democratic Redistricting Committee, is leading a campaign called All On The Line to promote redistricting reform and participation in the 2020 census.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "All On The Line website. Accessed 1 Jul 2020.", "Biography | Charles Krauthammer. CharlesKrauthammer.com. Accessed 1 Jul 2020.", "“Charles Krauthammer: The Eemy Among Us on civil war.” Nesara-Republic Now-Galactic News. 13 Oct 2017.", "Evon, Dan. “Did Charles Krauthammer Write an Op-Ed Called ‘The Enemy Among Us?’” Snopes. 24 Oct 2017.", "“Frequently Asked Questions.” Organizing for Action. 2013.", "Hartzell, Katherine. “Obama’s Criticism Didn’t Set a Presidential Precedent.” FactCheck.org. 27 May 2020", "Scott, Eugene. “Barack Obama’s endorsement of Joe Biden, annotated.” Washington Post. 14 Apr 2020.", "Thrush, Glenn., Reid J. Epstein and Byron Tau. “Obama unveils ‘Organizing for Action’.” Politico. 17 Jan 2013.", "Trott, Bill. “Conservative U.S. commentator Charles Krauthammer dies.” Reuters. 21 June 2018.", "Wilson, Bill. “The perilous times we live in.” The Daily Jot. 13 Feb 2017.", "Wilson, Reid. “Obama political arm to merge with Holder-run group.” The Hill. 21 Feb 2019.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]