["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Former DNC deputy chair Keith Ellison, now Minnesota’s attorney general, was accused of abuse by his ex-girlfriend in 2018.", "No evidence has been released, and he was appointed chair before the allegations came out, not after.", "In 2018, former Minnesota Democratic congressman Keith Ellison, now the state’s attorney general, was accused by his ex-girlfriend of being physically abusive.", "We recently came across a Facebook post that shares a photo of Ellison and another image of a woman with bruises and cuts on her face alongside text that says, \"He says it won’t happen again.\"", "RELATED: No, that badly bruised woman in photo was not former U.S. Rep. Keith Ellison’s girlfriend", "A caption below both photos reads:", "\"Democrat KEITH ELISON (sic) the first MUSLIM in Congress beats his girlfriend and the dems make him the Deputy Chair of the DNC. Let that sink in..\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Ellison previously served as deputy chair of the Democratic National Committee before he stepped down in November 2018 after winning the race for Minnesota’s attorney general.", "But the post falsely insinuates that he was appointed deputy chair after being accused of abuse, when he had held the position since 2017, before the allegations came to light.", "The rest is also murky.", "The woman in the shared photo is not his ex. We ran a reverse-image search and found that the picture has appeared online since at least 2012, and has often been used on various websites as a visual representation of domestic abuse with the same caption tag, \"He says it won’t happen again,\" attached.", "In September 2018, Ellison’s former girlfriend, Karen Monahan, alleged that he had physically abused her.", "In August of that year, Monahan’s son wrote a lengthy Facebook post that claimed he saw a video of Ellison abusing his mother. Monahan confirmed her son’s account. She hasn’t released the video.", "In a statement, Ellison acknowledged the two were in a relationship that ended in 2016, but denied abusing her or that such a video existed.", "Monahan retained a lawyer to represent her around October 2018, but little information has come out since.", "Nevertheless, the post inaccurately suggests Ellison is guilty and that Democrats made him the DNC’s deputy chair after the allegations became public knowledge.", "We rate this Mostly False.", "Facebook post, Feb. 2 2020", "PolitiFact, No, that badly bruised woman in photo was not former U.S. Rep. Keith Ellison’s girlfriend, Sept. 27, 2019", "Tin Eye, reverse-image search, Feb. 26, 2020", "Star Tribune, U.S. Rep. Keith Ellison's ex-girlfriend posts medical record alleging abuse, Sept. 19, 2018", "Vox, The latest developments in the abuse allegations against Rep. Keith Ellison, explained, Sept. 25, 2018", "New York Times, Representative Keith Ellison Denies Domestic Abuse Allegations, Aug. 13, 2018", "New York Times, Keith Ellison’s Campaign Overshadowed by Ex-Girlfriend’s Allegations, Oct. 15, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]