["A 1.39-minute video is viral on social media in which a man can be seen inside a prison cell while a voice-over narrates his feelings. Many users claimed that the man seen in the video was V D Savarkar who had been interviewed by a British journalist inside cellular jail. User Sameer Thakkar tweeted the clip with this claim. It received over 1.3 lakh views. Notably, Thakkar is followed by Prime Minsiter Narendra Modi on Twitter.", "ॐ HINDUTVA", "Rare footage of BBC by a British journalist who filmed “Swatantrya Veer Savarkar.” in Cellular Jail.", "All those insulting him are intending to insult the freedom movement of India and undermine the revolutionaries who led to Independent India. pic.twitter.com/wHcko9Hikh", "— Sameet Thakkar (@thakkar_sameet) November 20, 2022", "The video is viral on Facebook and Twitter with the same claim.", "Twitter user @rakesh_bstpyp, who identifies himself as a newspaper editor, had shared the same clip with a similar claim on November 14, 2021.", "एक ब्रिटिश पत्रकार ने अंडमान की सेल्युलर जेल में कालापानी की सजा काट रहे महान देशभक्त वीर सावरकर का दुर्लभ वीडियो फुटेज पोस्ट किया है। जो उस समय के जीवन को दिखाता है, आप एक बार यह दुर्लभ फुटेज देखने के बाद पता चलेगा वीर सावरकर जी वीर नही, महावीर परमवीर थे । pic.twitter.com/wIykbaoxAK", "— राकेश कुमार (@rakesh_bstpyp) November 14, 2021", "We also discovered that this video had been shared in May, 2020 (post 1, post 2, post 3) as well.", "Alt News received requests on its WhatsApp number (+917600011160) and official Android app to fact-check this video.", "This slideshow requires JavaScript.", "When we searched the keywords ‘Savarkar Andaman jail’ on YouTube, the first result that appeared was a March 2020 fact-check of this very claim by The Lallantop. This fact-check states that the viral video is actually a clip extracted from a film. We scrolled through the suggested videos and found a 40-minute film uploaded by the official channel of the ministry of information and broadcasting titled, ‘Life of Shri Vinayak Damodar Savarkar.’ It was uploaded on August 14, 2014.", "The viral part starts at the 1:45 mark on the video, where the title sequence reading ‘Veer Savarkar’ is seen. The video description mentions that the film depicts various important events in Savarkar’s life. In the original clip, the visuals between the 25 and 30-minute mark are the ones that appear in the viral video. Therefore, the clip in question was made by cropping scenes from this part of the film.", "We also noticed that there is a Films Division watermark at the 1:28 mark.", "When we searched the keywords ‘Veer Savarkar’ on Films Division, we discovered that there are three versions of a film made on Savarkar. All three mention that this is a 1983 film directed by Prem Vaidya.", "Hence, it is clear that", "1. The viral video does not feature Savarkar himself. This is actually an actor portraying the historical figure in a movie commissioned by the Indian government.", "2. It was not shot by a British journalist, but is a scene from a film directed by Prem Vaidya.", "Donate Now", "A journalist and a dilettante person who always strives to learn new skills and meeting new people. Either sketching or working.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]