["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "President Donald Trump speaks during an interview with Laura Ingraham on Fox News on Sept. 1, 2020. (Screenshot from YouTube)", "In an interview with Fox News’ Laura Ingraham, Trump misconstrued data on coronavirus deaths. As of Sept. 3, 185,092 Americans had died due to COVID-19.", "A CDC report found that 6% of people who died from COVID-19 only had the virus. The majority had other conditions as well, but that doesn’t mean COVID-19 wasn’t to blame.", "The National Center for Health Statistics told us that COVID-19 was responsible for nearly all of the deaths involving the virus.", "In the past week, President Donald Trump has repeatedly spread a false claim that COVID-19 is not as deadly as his own public health agencies have reported.", "He retweeted a now-deleted post that alleged the Centers for Disease Control and Prevention \"quietly updated\" the number of coronavirus deaths. He shared another tweet from a senior legal adviser for his reelection campaign that linked to an article whose headline said \"only 9,210 Americans died from COVID-19 alone.\"", "And, in a Sept. 1 interview with Fox News’ Laura Ingraham, Trump said it himself:", "\"I saw a statistic come out the other day, talking about only 6% of the people actually died from COVID, which is a very interesting — that they died from other reasons.\"", "\"Well, they had comorbidities, which you’ve gotten criticized for,\" Ingraham responded.", "She’s right — the president misconstrued data on coronavirus deaths. As of Sept. 3, CDC data show 185,092 Americans had died due to COVID-19, and some estimates put the death toll higher.", "Trump’s claim traces back to a report from the National Center for Health Statistics (NCHS), which is part of the CDC. Each Wednesday, the agency releases new provisional death counts for the coronavirus. The data is based on death certificates.", "In that report, the NCHS notes in a section titled \"Comorbidities\" that, \"for 6% of the deaths, COVID-19 was the only cause mentioned.\"", "\"For deaths with conditions or causes in addition to COVID-19, on average, there were 2.6 additional conditions or causes per death,\" the report says.", "Those lines have inspired a rash of claims on social media, including those retweeted by the president, that say the CDC \"adjusted\" its coronavirus death counts and the disease is not as deadly as previously thought.", "Those assertions are false — we rated a related Facebook post Pants on Fire. Several other fact-checkers have also debunked them.", "Let’s recap why they’re wrong.", "Comorbidities are conditions that patients experience in tandem with a primary condition. Think of conditions like cancer or diabetes, which the CDC has said put people more at risk of death if they contract the coronavirus.", "The NCHS report shows that the vast majority of coronavirus-related deaths occur in patients with comorbidities. But that doesn’t mean COVID-19 was a non-factor.", "\"The point that the CDC was trying to make was that a certain percentage of them had nothing else but just COVID-19,\" said Dr. Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases, in a Sept. 1 interview with \"Good Morning America.\" \"That does not mean that someone who has hypertension or diabetes who dies of COVID didn’t die of COVID-19 — they did.\"", "\"The numbers that you’ve been hearing, the 180,000-plus deaths, are real deaths from COVID-19. Let there not be any confusion about that.\"", "So why do 94% of death certificates that mention COVID-19 also list other conditions?", "When a coronavirus patient is admitted to the hospital, the virus is listed on their medical record. Since the coronavirus attacks the lungs, perhaps they develop respiratory failure, which would also be listed on their record. Unfortunately, they die after going into cardiac arrest, so doctors take note of that, too.", "RELATED: No, the CDC did not ‘quietly adjust’ US coronavirus deaths", "All three of those conditions would be listed on the patient’s death certificate, but COVID-19 started the process.", "\"The people dying were not going to die but for the acquisition of COVID,\" said Dr. Myron Cohen, director of the Institute for Global Health and Infectious Diseases at the University of North Carolina at Chapel Hill.", "Jeff Lancashire, acting associate director for communications at the NCHS, told us in an email that 92% of the death certificates that mention the coronavirus state that COVID-19 was the \"underlying cause of death.\"", "\"The underlying cause of death is the condition that began the chain of events that ultimately led to the person’s death,\" Lancashire said.", "We reached out to the White House and the Trump campaign for a comment, but we haven’t heard back.", "Trump’s claim is inaccurate and ridiculous. We rate it Pants on Fire!", "Factba.se, accessed Sept. 3, 2020", "PolitiFact, \"No, the CDC did not ‘quietly adjust’ US coronavirus deaths,\" Aug. 31, 2020", "YouTube video from Factbase Videos, Sept. 1, 2020", "Centers for Disease Control and Prevention, CDC COVID Data Tracker, accessed Sept. 3, 2020", "Centers for Disease Control and Prevention, Coronavirus Disease 2019 (COVID-19): About CDC COVID-19 Data, July 13, 2020", "Centers for Disease Control and Prevention, Coronavirus Disease 2019 (COVID-19): People with Certain Medical Conditions, Aug. 14, 2020", "Centers for Disease Control and Prevention, Coronavirus Disease 2019 (COVID-19): Social Distancing, July 15, 2020", "Centers for Disease Control and Prevention, Instructions for Completing the Cause-of-Death Section of the Death Certificate, accessed Aug. 31, 2020", "Email from Dr. Myron Cohen, director of the Institute for Global Health and Infectious Diseases at the University of North Carolina at Chapel Hill, Aug. 31, 2020", "Email from Jeff Lancashire, acting associate director for communications at the National Center for Health Statistics, Aug. 31, 2020", "Facebook post from Dr. Mark Halstead, Aug. 30, 2020", "The Gateway Pundit, \"SHOCK REPORT: This Week CDC Quietly Updated COVID-19 Numbers – Only 9,210 Americans Died From COVID-19 Alone – Rest Had Different Other Serious Illnesses,\" Aug. 29, 2020", "National Center for Health Statistics, Provisional Death Counts for Coronavirus Disease 2019 (COVID-19), Sept. 2, 2020", "The New York Times, \"The True Coronavirus Toll in the U.S. Has Already Surpassed 200,000,\" Aug. 13, 2020", "Tweeted video from \"Good Morning America,\" Sept. 1, 2020", "Factcheck.org, \"CDC Did Not ‘Admit Only 6%’ of Recorded Deaths from COVID-19,\" Sept. 1, 2020", "Snopes, \"Did CDC ‘Quietly Update’ COVID-19 Deaths To Say Only 6% Are Legitimate?\" Sept. 3, 2020", "Health Feedback, \"False claim shared by President Trump that only 6% of CDC-reported deaths are from COVID-19 is based on flawed reasoning,\" Aug. 31, 2020", "Check Your Fact, \"FACT CHECK: DID THE CDC REVISE ITS COVID-19 DEATH COUNT TO SHOW THAT ONLY 9,210 PEOPLE ‘ACTUALLY DIED’ FROM COVID-19?\" Aug. 31, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]