["By D'Angelo Gore", "Posted on January 9, 2017", "On Twitter, President-elect Donald Trump falsely wrote that a reporter “totally changed a 16 year old story that he had written in order to make me look bad.” As we have written before, the reporter never changed his story about the 9/11 terrorist attacks.", "Trump’s tweet was in response to a speech given by actress Meryl Streep at the Golden Globe Awards on Jan. 8. Streep, who supported Hillary Clinton for president, said that “it kind of broke my heart” when she saw “that moment when the person asking to sit in the most respected seat in our country imitated a disabled reporter.” She did not mention Trump by name.", "Trump tweeted that he “never ‘mocked’ a disabled reporter” but did show him “groveling” as he “totally changed a 16 year old story that he had written in order to make me look bad.”", "Meryl Streep, one of the most over-rated actresses in Hollywood, doesn't know me but attacked last night at the Golden Globes. She is a…..", "— Donald J. Trump (@realDonaldTrump) January 9, 2017", "Hillary flunky who lost big. For the 100th time, I never \"mocked\" a disabled reporter (would never do that) but simply showed him…….", "— Donald J. Trump (@realDonaldTrump) January 9, 2017", "\"groveling\" when he totally changed a 16 year old story that he had written in order to make me look bad. Just more very dishonest media!", "— Donald J. Trump (@realDonaldTrump) January 9, 2017", "Streep and Trump were both referring to New York Times investigative journalist Serge Kovaleski, a disabled reporter who suffers from arthrogryposis, which primarily restricts joint movement in the limbs.", "Kovaleski co-authored a story for the Washington Post in 2001 that said “a number of people” in Jersey City, New Jersey, were “allegedly seen celebrating” the terrorist attacks on Sept. 11, 2001. During the Republican primary, Trump cited that story as evidence for his discredited claim that he saw on television “thousands and thousands” of people in New Jersey celebrate the terrorist attacks.", "Trump made his claim about the celebrations during a speech in Alabama on Nov. 21, 2015. Two days later, Trump tweeted a link to Kovaleski’s Post article from Sept. 18, 2001, and demanded an apology from those who wrote that his statement was false.", "Via @washingtonpost 9/18/01. I want an apology! Many people have tweeted that I am right! https://t.co/CpsMxs54qv pic.twitter.com/wrDEhXJlvR", "— Donald J. Trump (@realDonaldTrump) November 23, 2015", "But as we have written, the Post never reported that there were “thousands” of people in New Jersey “celebrating” the attacks, as Trump originally claimed. The story, written by Kovaleski and Fredrick Kunkle, said that “In Jersey City … law enforcement authorities detained and questioned a number of people who were allegedly seen celebrating the attacks and holding tailgate-style parties on rooftops while they watched the devastation on the other side of the river.”", "In interviews after Trump made his claim, Kovaleski and Kunkle both said that they couldn’t recall if the allegations about the tailgate-style celebration were ever substantiated.", "In a CNN story published Nov. 24, 2015, Kovaleski was quoted saying that he and Kunkle “did a lot of shoe leather reporting in and around Jersey City and talked to a lot of residents and officials. … But I do not recall anyone saying there were thousands, or even hundreds, of people celebrating.”", "And in an update to its story from Nov. 22, 2015, the Washington Post Fact Checker quoted Kunkle saying that he could never confirm the reports of celebrations.", "“I specifically visited the Jersey City building and neighborhood where the celebrations were purported to have happened. But I could never verify that report,” Kunkle told the Post.", "Then, during a campaign rally in South Carolina on Nov. 24, 2015, Trump, while making a jerking motion with his arms, paraphrased Kovaleski as saying, “I don’t know what I said. I don’t remember.”", "Many, including Streep, saw that as Trump imitating Kovaleski’s disability, which Trump has denied he was doing.", "We don’t know what Trump’s intentions were, and readers can judge the video of Trump’s remarks for themselves. But we can say that Trump is wrong to claim that Kovaleski “totally changed a 16 year old story that he had written in order to make me look bad.”", "Politifact Rating:", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]