["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "We checked a claim by Sen. Chuck Schumer, D-N.Y., about how raising the minimum wage to $10.10 an hour would affect the number of households in poverty.", "During an appearance on MSNBC, Sen. Chuck Schumer, D-N.Y., touted one of President Barack Obama’s key agenda items -- raising the federal minimum wage from $7.25 an hour to $10.10 an hour.", "Raising the minimum wage to $10.10, Schumer said, \"is important for one reason, and very important to us, which is, it's the bare minimum. You work 40 hours a week, you get out of poverty.\"", "The trouble with Schumer’s claim is that the accepted definition of poverty is actually a sliding scale that depends on the size of a family.", "We’ll walk you through the math.", "What raising the minimum wage means", "Earning $10.10 an hour for 40 hours a week, 52 weeks a year, produces a yearly gross income of $21,008.", "But people earning that amount also have a good chance of getting money back from the government through the Earned Income Tax Credit -- a provision of tax law that encourages work by low-income Americans. If your income is low enough -- but if you have a paying job -- the government supplements your income through refundable tax credits.", "Using the calculator at the IRS website, we created some sample taxpaying households. Both have two parents, only one of whom worked, and no complicated tax quirks. One had two children and the other had three.", "When we input the new minimum-wage level annual income of $21,008, the calculator told us that the EITC would provide an additional $5,370 to the family with two children and $6,040 to the family with three children. (EITC benefits are capped at three children.)", "So, combined, a hypothetical family of four would get $26,378 in gross income, and a hypothetical family of five would get $27,048. (The size of the tax credit can vary a bit depending on the taxpayer’s situation, but this at least shows the scale we’re talking about.)", "Is this enough to \"get out of poverty\"?", "Would this be enough to escape poverty? As we noted earlier, the size of the family makes a big difference.", "The poverty level is not a single threshold, but rather a series of them scaled to the size of the household. (Caution for any statistical geeks reading this: There are actually two poverty federal levels, one calculated by the Census Bureau and one by the Department of Health and Human Services. They track each other pretty closely, but there are some small differences. We calculated our data both ways, and our overall conclusions held regardless of which measure we used. For simplicity, though, we’re only going to show our calculations for the HHS poverty line.)", "Using the HHS numbers for 2014, the poverty line is $11,670 for a one-person household, $15,730 for a two-person household, $19,790 for a three-person household, $23,850 for a four-person household, and up from there with the addition of each new person.", "Since the new $10.10 wage would be fully phased in by 2016 (if it’s passed by Congress) we estimated what these poverty guidelines would be in 2016. We did this by increasing the 2014 guidelines by the same percentage as the guidelines increased between 2012 and 2014, which is the most recent two-year period.", "This produced the following estimated poverty guidelines for 2016:", "Persons in household", "Poverty guideline", "1", "$12,193", "2", "$16,354", "3", "$20,516", "4", "$24,678", "5", "$28,839", "6", "$33,003", "7", "$37,165", "8", "$41,329", "So if one breadwinner earns a total of $26,378, then the new $10.10 wage, plus an EITC refund, is indeed enough to lift households of one, two, three, and four people beyond the poverty level. But it would be too small to lift the households of five people or more. (The additional EITC refund for a third child isn’t large enough to make a difference.)", "In other words, while raising the wage to $10.10 does get a lot of households out of poverty, it isn’t quite the guarantee that Schumer suggests.", "In addition, raising the minimum wage to $10.10 doesn’t get any one-person households out of poverty, because even the current federal minimum wage of $7.25 does that.", "To measure how \"right\" or \"wrong\" Schumer’s claim is, we wanted to measure what proportion of minimum-wage-worker households included one person, two persons, and so on. But experts told us there is no readily available data on this point. So we used the next best data we could find -- the Census Bureau’s distribution of impoverished households by the size of household.", "The three household sizes that get boosted out of poverty due to a wage hike to $10.10 -- households of two, three and four people -- collectively account for 46 percent of all households in poverty, according to this Census data.", "The remaining 54 percent either are out of poverty already at the current minimum wage (one-person households) or wouldn’t exceed the poverty line even after getting a raise to $10.10 an hour (households of at least five people).", "By that measure, Schumer is right a little less than half the time. These are estimates, but experts said these estimates are reasonable given the available data.", "A spokesman for Schumer said the statistic came from calculations by the Council of Economic Advisers, an office within the White House. (You can see a chart on page 6 in the slide show here.)", "The White House chart hangs its poverty-lifting claim on data for a four-person family, which squares with what we found. The problem with Schumer’s claim is that he glossed over some caveats and made too sweeping a case for the power of a $10.10 wage increase to knock out poverty.", "Our ruling", "Schumer said a new minimum wage of \"$10.10 is important for one reason … It's the bare minimum. You work 40 hours a week, you get out of poverty.\"", "Raising the wage to $10.10 an hour does indeed put two-, three- and four-person households with one working member above the poverty line for the first time. But it doesn’t achieve a similar feat for one-person households (which already exceed the poverty line under the old, $7.25 wage) or for households of five or more people (who still wouldn’t earn enough with the $10.10 wage to escape poverty).", "Since the households helped by the $10.10 wage account for 46 percent of all impoverished households, Schumer is right slightly less than half the time. We rate his claim Half True.", "UPDATE, May 8, 3:15 p.m.: This item has been updated to clarify what calculations we made when determining the percentage of minimum wage workers's households who would be lifted out of poverty due to a rise to $10.10.", "Chuck Schumer, comments on MSNBC, May 5, 2014", "FamiliesUSA, \"Federal Poverty Guidelines,\" accessed May 7, 2014", "Department of Health and Human Services, \"2012 HHS Poverty Guidelines,\" accessed May 7, 2014", "U.S. Census Bureau, \"Poverty Thresholds 2008,\" accessed May 7, 2014", "U.S. Census Bureau, \"Poverty Thresholds 2012,\" accessed May 7, 2013", "University of Wisconsin Institute for Research on Poverty, \"What are poverty thresholds and poverty guidelines?\" accessed May 7, 2014", "Internal Revenue Service, EITC calculator, accessed May 7, 2014", "Internal Revenue Service, \"EITC, Earned Income Tax Credit, Questions and Answers,\" accessed May 7, 2014", "Council of Economic Advisers, \"The Economic Case for Raising the Minimum Wage,\" Feb. 12, 2014", "U.S. Census Bureau, \"Families with Related Children Under 18 by Number of Working Family Members and Family Structure,\" 2012", "Email interview with Michael Wiseman, public policy professor at George Washington University, May 7, 2014", "Email interview with Timothy M. Smeeding, director of the Institute for Research on Poverty at the University of Wisconsin, May 7, 2014", "Email interview with Matt House, spokesman for Chuck Schumer, Mat 7, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]