["The photo was shared here on March 2, 2016 by a Facebook page with more than 5,100 followers.", "Below is a screenshot of the midleading Facebook post:", "The caption states: “Once in lifetime photo....Amazing!!!! surfing with whales”.", "The same photo has been shared with a similar claim on Facebook here, here and here. It was also shared on Twitter here.", "Some Facebook users left comments on one of the posts which indicated they believed the photo was real.", "Below is a screenshot of some of the comments under one of the Facebook posts:", "But the photo has been doctored from a 2006 photo of a surfer to include the whale.", "A reverse image search on Google found a mirrored version of the misleading photo showing a man surfing in this 2006 blog post.", "Below is a screenshot comparison of the photo in the misleading posts (L) and the photo published on the blog (R):", "The photo published in the blog post is credited to photographer Tim McKenna.", "A keyword search on Google found this 2016 post by Tim McKenna on Instagram about the photo.", "I don’t usually post photos that have been manipulated by graphic artists in Photoshop. However this one has been going around numerous instagram accounts for a few months now so since it's April fools' day I am going to take the opportunity to give some info on the image. I shot the original photo of Tahitian surfer Manoa Drollet @dmanoa nearly 10 years ago , on July 28 th , 2006 at #teahupoo #tahiti. Manoa was actually nominated for biggest barrel of the year at the XXL awards in 2007 , now the @wsl @wslbigwaveawards Digital graphic artist Julian Herbrig @care4art took the original photo and flipped it. Regular foot Manoa Drollet ends being a goofy foot charging a massive right hander. He then added an aerial drone photo of a Blue whale in the face of the wave. Although we do see many humpback whales cruise by Teahupoo in winter time, I have never witnessed a blue whale in French Polynesia and certainly not trying to drop in at Teahupoo ! Certainly is catchy ! #fake #surfing #whale #bigwaves #ps #tahiti #photoshop #whalebodysurfing", "A post shared by  Tim McKenna Photography (@timmckenna) on Apr 1, 2016 at 10:36am PDT", "In the lengthy caption, McKenna states he captured the photo of surfer Manoa Drollet surfing in 2006, and digital graphic artist Julian Herbrig subsequently edited it to include the image of the whale.", "The caption states: “I shot the original photo of Tahitian surfer Manoa Drollet @dmanoa nearly 10 years ago , on July 28 th , 2006 at #teahupoo #tahiti.”", "“Digital graphic artist Julian Herbrig @care4art took the original photo and flipped it. Regular foot Manoa Drollet ends being a goofy foot charging a massive right hander.”", "“He then added an aerial drone photo of a Blue whale in the face of the wave. ”", "“Although we do see many humpback whales cruise by Teahupoo in winter time, I have never witnessed a blue whale in French Polynesia and certainly not trying to drop in at Teahupoo ! Certainly is catchy !”", "Another reverse image search found the photo of the whale was taken from a 2005 photo published here on the website for Iceland-based tour company Gentle Giants.", "The web article, published on July 22, 2005, states: “MINKE CLOSE UP. Our passengers onboard this afternoon really enjoyed the trip onboard Faldur, after a long search for the whale. They finally spotted this friendly Minke Whale which gave thim the show a good Minke should!! These photos are taken from the Crows Nest at Faldur by our guide Linda Guðrúnardóttir.”", "Below is a set of comparison of the misleading photo (L) and the photo in the Gentle Giants post (R):", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]