["UK sick pay is 28 weeks. The EU does not set a minimum sick pay.", "Correct.", "In the UK we get 5.6 weeks of paid holiday. The EU sets paid holiday at four weeks.", "Correct. Those are minimum standards.", "In the UK we get 52 weeks of maternity pay. The EU sets maternity pay at 14 weeks.", "This is incorrect for the UK. Maternity pay can be for up to 39 weeks. The EU minimum standard is 14 weeks of paid maternity leave.", "The UK minimum wage is £8.21, and is soon to be £10.50. The EU hasn’t set a minimum wage.", "That’s the minimum wage for people over 25 in the UK. The Conservatives have pledged to raise the minimum for every over 21 to £10.50 by 2024 but it’s not yet law. It’s correct that the EU doesn’t set a minimum wage.", "In response to the Labour party claiming that the new withdrawal agreement puts workers’ rights at risk, a number of tweets and Facebook posts have highlighted a selection of minimum employment standards in the UK, and contrasted them with lower levels enforced by the EU.", "What is it that @UKLabour are trying protect? 🥀", "🇬🇧 Sick Pay: 28 weeks", "🇪🇺: None set", "🇬🇧 Holiday Pay: 5.6 weeks", "🇪🇺: 4 weeks", "🇬🇧 Maternity Pay: 52 weeks", "🇪🇺: 14 weeks", "🇬🇧 Minimum Wage: £8.21 soon be be £10.50", "🇪🇺: None set", "Twitter user, 21 October 2019", "The posts get it right on most claims, but overstate how long maternity pay can last in the UK.", "It’s important to remember that the EU minimum standards are just that, minimums, which all member states must meet. They limit how far member states can reduce employment protections in their own countries, and in some cases set new standards which they must meet. They also extend far beyond the five points mentioned in the post.", "It’s also true that in some of the examples mentioned, the UK has introduced or changed its minimum standards as a result of EU regulations. Under the terms of Boris Johnson’s new withdrawal agreement, the UK wouldn’t necessarily have to keep up with future standards set by the EU.", "Honesty in public debate matters", "You can help us take action – and get our regular free email", "I’m in", "It’s correct that those in the UK can get statutory sick pay if they’re too ill to work for up to 28 weeks. (The rules are slightly different for some agricultural workers.)", "The EU does not set a minimum sick leave or sick pay legislation for its member states.", "Almost all workers in the UK are entitled to 5.6 weeks of paid holiday per year, which is equivalent to 28 days if you work a five day week. Employers can choose to include bank holidays as part of those 28 days of annual leave.", "The EU does enforce a minimum of four weeks’ paid holiday leave, which it introduced in 1993. Those four weeks were put into UK law in 1998, before which there had been no general regulations on entitlement to paid leave (although it was in some workers’ contracts).", "Paid leave was increased to 5.6 weeks in Great Britain in 2009, as some employers were including bank holidays in this paid leave, meaning the number of paid days that could be taken out of choice by the employee was less than four weeks. Workers in Northern Ireland also get 5.6 weeks of paid leave now too.", "So UK legislation effectively guarantees workers the EU minimum of four weeks of paid annual leave, which they can take at their own discretion, plus eight bank holidays (as there are in England and Wales) as paid leave.", "The tweets and Facebook posts get it on wrong maternity pay. In the UK, you can get maternity pay for up to 39 weeks, not 52 as the post claims (it is probably referring to maternity leave, which can be up to 52 weeks in the UK).", "You get 90% of your average weekly earnings (before tax) for the first six weeks, and £148.68 or 90% of your average weekly earnings (whichever is lower) for the next 33 weeks. Maternity pay is taxed.", "There are certain conditions that come with this. For example, you must have worked for the employer for at least 26 weeks and be earning at least £118 a week. Those who don’t qualify may be eligible for maternity allowance.", "Currently, EU legislation means workers are entitled to paid maternity leave for a minimum of 14 weeks. It is mandatory to take at least the first two weeks. This was introduced in 1992. This leave must be paid at “an adequate allowance subject to national legislation”.", "It’s correct that minimum wage is £8.21 for those aged 25 and over in the UK, as of April 2019 (these rates change every April). We saw one version of these claims that said the minimum wage was £7.05—that’s not the minimum wage for any age group.", "The posts say it is “soon to be” £10.50. At the 2019 Conservative Party Conference, the Chancellor Sajid Javid pledged that the living wage would increase to £10.50 an hour for those over the age of 23 by 2021, and those over 21 by 2024. This has not yet been put into law.", "There is no EU-wide legislation for a minimum wage for member states, and as of January 2019, 22 of the 28 countries had one.", "Full Fact fights for good, reliable information in the media, online, and in politics.", "Bad information ruins lives. It promotes hate, damages people’s health, and hurts democracy. You deserve better.", "Full Fact, 17 Oval Way, London, SE11 5RR", "Full Fact is a registered charity (no. 1158683) and a non-profit company (no. 06975984) limited by guarantee and registered in England and Wales. © Copyright 2010-2023 Full Fact. Thanks to Bytemark for donating our web hosting.\n                        \n                        Privacy, terms and conditions."]