["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Stop, drop and roll?", "Houston businessman and first-time candidate Farouk Shami wasn't successful in his bid for the Democratic gubernatorial nomination, but we're still, um, singing his praises for a song his campaign debuted the night before the primary election.", "From a March 1 press release issued by his campaign: \"In a last-minute push to win supporters and motivate Texans to go to the polls tomorrow, Farouk Shami has publicly released the song 'Farouk' ...\"", "Playing on the well-worn lyric \"the roof is on fire,\" 17-year-old Houston hip-hop artist J. Xavier penned a catchy refrain that stuck: \"Farouk, Farouk, Farouk is on fire, serving da community his number one desire.\"", "We wonder: Was Shami ever on fire?", "First, let's review the lyrics the campaign sent in March.", "Who got da new solutions for Texas... Farouk! / when it comes to da state who's gon rep it... Farouk! / now say it Farouk Farouk Farouk is on fire / serving da community his number one desire...", "Came to America 44 years ago / 71 dollars to his name now dat's pocket change / kinda like President Obama a few years ago, in his mind frame it's time to change / creating Texas jobs & reforming health care / he cares if nobody else cares, elsewhere / providing quality education / preserving our environment / Farouk is on fire please call da fireman / his drive is inspiring / lives he inspire them...", "Xavier, a Houston native, wrote \"Tell Your Mama to Vote for Obama\" during the 2008 presidential campaign, but that song made no reference to pyrotechnics.", "However, chants of \"fired up, ready to go\" were often heard during Obama's campaign rallies.", "Shami falls in line with a other office-seekers who have dabbled with fire. The late Reagan Brown, who once served as state agriculture commissioner, infamously stuck his hand in a fire-ant mound as a campaign stunt in 1982, only to have the fiery pests swarm up and bite his arm.", "What about Shami's personal relationship with fire?", "On Nov. 19, the Houston Chronicle reported that Shami had come \"under fire\" when a conservative commentator claimed his support for Palestinian rights put him opposition to Israel. The Chronicle later pointed out that Shami could fire his employees, some of whom quit rather than be fired.", "We couldn't reach Shami to gauge if he was ever truly \"on fire.\"", "But seeing as we've previously rated a Shami statement as Pants on Fire, he definitely was en fuego here.", "So, we must rate J. Xavier's statement as True.", "And we wish you a happy April Fools' Day.", "Farouk Shami for Governor, Press release: Farouk Shami campaign releases new song, March 1, 2010", "J. Xavier, Farouk is on Fire (video), added to YouTube March 2, 2010", "J. Xavier, Go Tell Ya Mama, Vote 4 Obama (video), added to YouTube March 10, 2008", "PolitiFact Texas, Farouk Shami says Bill White is discriminating, taking jobs from blacks and to give to friends, Jan. 26, 2010", "Noo Day Entertainment, Arist: J. Xavier, accessed March 31, 2010", "The Washington Post, In Greenwood, shouts of 'Fired up' comes home, Jan. 22, 2008", "The Houston Chronicle, Democrat's heritage may stop some voters, Nov. 18, 2009", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]