["Former Texas Rep. Tom Delay appeared on CNN's \"State of the Union\" on Aug. 31, 2014.", "CNN State of the Union host Candy Crowley consulted an interesting source to discuss Texas Gov. Rick Perry’s indictment on charges of abusing his power: former House Majority Leader Tom DeLay, a fellow Texas Republican who has been embroiled in a criminal election law violation for the past 12 years.", "Perry’s charges are nothing short of a political witch hunt, DeLay said, just like his own. Crowley pushed back on the suggestion.", "\"The point is the prosecutor who brought the indictment is not a Democrat in any way anybody can see, and in fact has ties to Republicans,\" Crowley said.", "\"That’s not true. Candy, that’s not true,\" DeLay said. \"He has ties to Obama. He has ties to the Democrats.\"", "\"And he has ties to Republicans, yes?\" Crowley asked.", "\"Well yeah, but that has nothing to do with this,\" DeLay said. \"What has to do with this is you take a law and you twist it so you can get the indictment. That is prosecutorial misconduct, whether you’re a Republican or a Democrat.\"", "We wanted to look into the special prosecutor’s political connections, since Crowley and DeLay seemed to be on different pages.", "True colors", "The special prosecutor, who was not identified on air, is San Antonio lawyer Michael McCrum.", "A grand jury indicted Perry based on charges brought forth by McCrum that Perry misused his power, after Perry threatened to veto the budget of an Austin prosecutor if she did not resign after her DUI was caught on tape.", "Our partners at PolitiFact Texas laid out the legal history of the case against Perry, noting how the prosecutor, Lehmberg, recused herself from the case, and the public integrity unit she leads was uninvolved in picking McCrum.", "McCrum was selected by Judge Bert Richardson, a Republican appointee of President George W. Bush. Richardson and McCrum both worked as prosecutors in San Antonio, according to the Texas Tribune.", "McCrum has been tight-lipped in press accounts and did not respond to our request for an interview.", "Solomon Wisenberg, a former Texas prosecutor who worked with McCrum and considers him an \"old friend,\" called the allegation against McCrum \"pathetic on its face.\"", "\"Mike would not be engaged in a political witch hunt. The idea that he’s politically motivated is ridiculous,\" Wisenberg said. \"I don’t really consider him as a political person.\"", "The records show McCrum has steered clear of partisanship, even as he has attracted support from both sides of the aisle over 25 years.", "In 1989, McCrum served as a federal prosecutor in the Western District of Texas, according to his resume.", "In 2000, McCrum opened his own private practice in San Antonio, focusing on criminal defense.", "In 2009, President Barack Obama nominated McCrum to be the U.S. attorney in San Antonio, according to the Texas Tribune. His nomination was called a \"consensus choice\" by justice trade publication Main Justice, and Republican Sens. John Cornyn and Kay Bailey Hutchison and House Democrats supported McCrum for the job.", "But McCrum withdrew his name in 2010, as the prolonged nomination process stalled his law practice, according to the Wall Street Journal.", "The White House did not provide comment.", "McCrum does not appear to vote in primaries and has donated to candidates of both parties. The Austin-American Statesman detailed McCrum’s political donations: In 2007, he contributed $300 to a Republican 4th Court of Appeals candidate, $500 to a former Democratic congressman, and $500 to Republican Bert Richardson’s unsuccessful re-election bid as state district judge.", "This record of bipartisanship is not unusual nor undesired in special prosecutors, said Wisenberg, who considers himself a conservative and opposes the prosecution against DeLay. He pointed out that special prosecutor Ken Starr, famous for investigating President Bill Clinton, also had ties to both parties, and DeLay did not oppose him.", "The ruling", "DeLay said it’s \"not true\" that McCrum isn’t a Democrat, saying \"he has ties to Obama (and) he has ties to Democrats.\"", "McCrum has loose ties to Obama and Democrats -- and he has Republican ones, too.", "News reports and McCrum’s political record show he is not expressly partisan, having contributing a few hundred dollars to a few people on both sides of the aisle.", "There's a sliver of truth in DeLay's statement, but it ignores critical facts that would give a different impression. We rate it Mostly False.", "Interview with Solomon Wisenberg, former Texas prosecutor, Aug. 31, 2014", "Interview with Craig McDonald, director of Texans for Public Justice, Aug. 31, 2014", "Twitter, David Axelrod, Aug. 16, 2014", "Breitbart, Javier Manjarres: Perry Indictment A Political Witchhunt, Aug. 18, 2014", "PolitiFact, Sarah Palin incorrect Rosemary Lehmberg's office convened grand jury that indicted Rick Perry, Aug. 17, 2014", "Elect Judge Bert Richardson, Experience, 2014", "McCrum Legal, Michael McCrum, 2011", "Texas Tribune, Formidable Lawyer at Center of Perry Prosecution, Aug. 18, 2014", "Main Justice, Texas GOP Senator Advanced Gay U.S. Attorney Candidate, Nov. 2, 2009", "Wall Street Journal, Perry Charges Put Spotlight on Prosecutor, Aug. 19, 2014", "Austin American-Statesman, Rick Perry prosecutor called ethical, fair, Aug. 20, 2104", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]