["By Eugene Kiely", "Posted on March 24, 2020", "Over the weekend, the Biden campaign posted a video that claims the Trump administration silenced Dr. Nancy Messonnier for “speaking out” about the new coronavirus at a Feb. 25 press briefing. But the campaign’s support for the claim is awfully thin.", "Messonnier, director of the National Center for Immunization and Respiratory Diseases, has regularly led press briefings at the Centers for Disease Control and Prevention, and she continued to do so even after the Feb. 25 briefing.", "The Biden campaign video, which was posted on March 21, features Ron Klain, who served as former Vice President Joe Biden’s chief of staff and later as the Obama administration’s Ebola response coordinator.", "In the video, Klain accuses the president of responding slowly to the coronavirus pandemic and failing to listen to experts. The video plays an audio clip of Messonnier speaking about the coronavirus on Feb. 25.", "“It’s not so much a question of if this will happen anymore but rather more of a question of exactly when this will happen,” Messonnier said, “and how many people in this country will have severe illness.”", "Her frank assessment reportedly angered the president, according to a Washington Post story cited by the Biden campaign.", "“Starting the next day,” Klain says in the video, “Dr. Messonnier no longer appeared at public briefings of the White House coronavirus task force. The president and the White House sent a clear message to scientists in the government — there would be a price for speaking out and speaking up.”", "But it’s misleading to suggest that, as a result of her Feb. 25 remarks, “Dr. Messonnier no longer appeared at public briefings of the White House coronavirus task force.”", "Messonnier is not a member of the task force, which was announced nearly a month earlier on Jan. 29, and she never attended a coronavirus task force press briefing after the group was formed.", "We searched C-SPAN, Department of Health and Human Services, CDC and White House websites and found that she did not attend any of the task force press briefings — either before or after her Feb. 25 remarks.", "The Biden campaign provided no evidence that she did, either. Instead, it cited the fact that Messonnier had attended Health and Human Services Secretary Alex Azar’s Jan. 28 press briefing on COVID-19. “After this [Feb. 25] incident she appeared in no more briefings with Sec. Azar, a core member of the White House task force,” Biden spokesman Andrew Bates told us in an email.", "But that Jan. 28 briefing was held one day before the task force was created.", "The White House coronavirus task force, from Jan. 29 to Feb. 25, made three public appearances that we could find. Two were press briefings on Jan. 31 at the White House and Feb. 7 at HHS, and one was a briefing to the nation’s governors on Feb. 9 at the National Governors Association winter meeting.", "The CDC was represented at each of those briefings by CDC Director Dr. Robert Redfield, who is a member of the White House coronavirus task force. Redfield also attended the task force meeting on Feb. 26 — the day after Messonnier’s remarks — so there was no change in the CDC’s representation at the White House task force press briefings.", "It’s also wrong to suggest that the Trump administration silenced Messonnier to send a message to government scientists that “there would be a price for speaking out and speaking up.”", "Messonnier has regularly conducted CDC press briefings — including the Feb. 25 briefing that was cited in the Biden video — and that didn’t change in the days immediately following those remarks.", "Since Feb. 25, Messonnier led CDC briefings on Feb. 28, Feb. 29, March 3 and March 9. She also has appeared in videos on the CDC’s Twitter page on March 9, March 13 and March 14. Those videos have received between approximately 126,000 to 238,000 views.", "The Biden campaign also cited a New York Times story on March 8 that quoted former CDC Director Thomas Frieden as saying, “Nancy Messonnier told it like it is. And she was 100 percent right, and they silenced the messenger.” But Messonnier led the CDC press briefing the day after the Times story appeared, and she continued to provide a frank assessment of the impact of the outbreak in the U.S.", "“This virus is capable of spreading easily and sustainably from person to person based on the available data,” she said in the March 9 briefing, according to a transcript that was released the next day. “The report of the World Health Organization mission to China describes the virus as being highly contagious. And there’s essentially no immunity against this virus in the population because it’s a new virus. Based on this, it’s fair to say that as the trajectory of the outbreak continues, many people in the United States will at some point in time either this year or next be exposed to this virus and there’s a good chance many will become sick.”", "This isn’t the first time that the Biden campaign has accused the Trump administration of silencing experts during the coronavirus outbreak.", "Biden, who is currently the leading Democratic presidential candidate, claimed in a Feb. 28 interview with CNN that “Dr. Fauci is not allowed to speak publicly,” referring to Dr. Anthony S. Fauci, the director of the National Institute of Allergy and Infectious Diseases. As we wrote shortly after those comments, government scientists were told to clear their public appearances through the coronavirus task force, which is headed by Vice President Mike Pence, but Fauci had spoken about the pandemic in numerous public appearances.", "In fact, Fauci usually attends the White House coronavirus task force briefings, despite frequently contradicting the president.", "It’s worth noting that Fauci did not attend the March 23 briefing — a day after Science magazine published an interview with the NIAID director in which he admitted that Trump has given inaccurate information at the press briefings. “But I can’t jump in front of the microphone and push him down,” Fauci said of Trump. “OK, he said it. Let’s try and get it corrected for the next time.”", "There has been speculation that Trump is losing patience with Fauci’s candid remarks. It remains to be seen whether that is the case or not.", "As for Messonnier, the Biden video misleads when it says she “no longer appeared at public briefings of the White House coronavirus task force” after her Feb. 25 remarks, when in fact she never appeared at those briefings previously.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]