["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "In this Aug. 24, 2018, file photo, Paul Davis, the Democratic candidate in the 2nd Congressional District in Kansas, answers questions during a news conference in Topeka, Kan. (AP)", "As we close in on the last month before the midterms, the ad wars continue to escalate.", "Political groups are pouring money into congressional districts to make their candidates look good, or more often, opposing candidates to look bad.", "It is going on all over the country, but Paul Davis’ campaign claims that an outside GOP PAC is spending the most in Kansas’ 2nd Congressional District.", "In a recent tweet, Davis, the Democrat running for the seat that includes Topeka, Lawrence and communities west of Kansas City, said that \"the House GOP super PAC in DC is spending more to help my opponent than anyone else.\"", "It is true that the Congressional Leadership Fund - the leading GOP super PAC affiliated with House Republican leadership - is pouring money into the district, but the Davis campaign is exaggerating. Davis is one of the top targets of the super PAC, but he's not No. 1.", "Here, we look at just how much is being funneled into the district from CLF and how it measures up to other House races around the country.", "The Davis campaign told us the claim is based off a CNN report released in late September.", "In the report, CNN examined the top districts where the Congressional Leadership Fund was spending its money on ad buys.", "It found that, as of Sept. 21 (when the report was published), CLF had poured $1.9 million into the district, nabbing the top spot on its list.", "Colorado’s 6th Congressional District and California’s 48th followed with $1.6 million and $1.5 million spent by CLF.", "Most of the television advertising were attacks on Democrats.", "This is definitely visible in KS-2. In September alone, the PAC aired four attack ads against Davis.", "We checked the OpenSecrets.org database, a widely cited campaign finance tracking resource published by the Center for Responsive Politics.", "Interestingly, the database shows that so far in the race, CLF has spent more than $3.2 million, nearly double CNN’s estimate, but still doesn’t list the district as the top one for the group's spending.", "Besides more than $6 million spent attacking Jon Ossoff, who lost to Republican U.S. Rep. Karen Handel in a 2017 special election, the top Democrat CLF is spending against is Democrat Joe Radinovich, who is running against Republican candidate Pete Stauber in Minnesota's 8th District. So far, CLF has spent nearly $3.9 million against him.", "But while Davis isn't the top Democrat that CLF is spending money against (he comes in at No. 7), the KS-2 race overall takes 4th place when factoring in the money the super PAC has spent in support of Watkins.", "Races", "CLF $ Against", "Democrats", "CLF $ For", "Republicans", "Total $ Spent", "1. California 39th", "$3,839,570", "$94,442", "$3,934,012", "2. Minnesota 8th", "$3,893,273", "$8,660", "$3,901,933", "3. California 25th", "$2,880,372", "$584,715", "$3,465,087", "4. Kansas 2nd", "$2,937,462", "$390,063", "$3,327,525", "5. California 45th", "$3,068,325", "$241,959", "$3,310,284", "6. New York 27th", "$3,013,190", "$117,732", "$3,130,922", "7. Pennsylvania 18th", "$3,077,399", "$1,047", "$3,078,446", "8. California 10th", "$3,067,550", "$6,153", "$3,073,703", "9. California 48th", "$2,791,949", "$80,687", "$2,872,636", "10. Minnesota 3rd", "$2,664,035", "$63,944", "$2,727,979", "The Davis campaign says that the House GOP super PAC is spending more to help out Watkins than anyone else.", "The Republican Super PAC is airing a torrent of attack ads against Davis and spending a lot of money in the district. But records show that Davis is not the top taget for CLF, though the district is listed among the top 5. Still, that doesn’t make Watkins the top recipient of such efforts.", "We rate the statement Mostly False.", "Davis campaign Tweet, Oct. 11, 2018", "Email interview with Kerry Gooch, Davis campaign spokesperson, Kerry Gooch, Oct. 12-16 2018", "KSNT, \"Kansas 2nd District top target in the country for GOP Super PAC spending,\" Sept. 24, 2018", "CNN, \"Republican super PAC boosts spending in Likely and Lean Republican districts,\" Sept. 21, 2018", "Congressional Leadership Fund, YouTube channel, Accessed Oct. 16, 2018", "Center for Responsive Politics, \"OpenSecrets database, 2018 Outside Spending, by Race,\" Accessed Oct. 15, 2018", "Center for Responsive Politics, \"Super PAC spending,\" Accessed Oct. 16, 2018", "Center for Responsive Politics, \"Congressional Leadership Fund spending,\" Accessed Oct. 18, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]