["About this rating", "A middle school in Minnesota piled “outdated” books in the categories of poetry, literature, history, and geography in a recycling dumpster after failing to fine new homes for them in what school officials said was a normal \"weeding out\" procedure.", "A complete list of all the discarded titles was not available, so it was unclear why each of these books was deemed \"outdated.\" It was also not clear whether new or updated books on similar subjects would replace the discarded books.", "In July 2020, a viral photograph that showed numerous school library books piled in a recycling bin inflamed some book enthusiasts around the United States after a Facebook post speculated that nonfiction books related to certain topics were intentionally thrown out by the school in order to \"erase history.\"", "The books were confirmed to have been disposed of by a media specialist who works for Sunrise Park Middle School in White Bear, Minnesota. However, school officials said that it is a normal procedure to rid the library of books that may no longer contain relevant information.", "Ryan Swanson, a White Bear resident, told Snopes that he took the photographs on July 9, 2020, after seeing a comment in a local Facebook group.", "\"There were hundreds and hundreds of books in the dumpster — too many for me to take all of them home. I kept about 30 books and went home to share what I had just seen in hopes of alerting others in the community,\" Swanson told Snopes. \"It made me quite upset to see books regarding American history, the U.S. Constitution, founding fathers, Native American history and culture, the Holocaust, past Republican presidents, and even Mr. Roger's autobiography.\"", "Snopes spoke with Sunrise Park Middle School Principal Christina Pierre who said that the books had been discarded in the recycling bin as part of a regular “weeding out” process to get rid of “outdated content.”", "Books are considered outdated if they contain or depict information that is no longer accurate, such as those that refer to Russia as the U.S.S.R. Pierre added that books were also “weeded out” if they had not been checked out by a student for several years. However, books that were the only copies on a particular topic were said to have been kept in the school library.", "Snopes asked the principal how many books the library currently stocks on subjects such as Native American history; we also asked for clarification on which book titles were chosen for donation and why. Pierre replied that \"weeding is done in sections\" based on the Dewey Decimal System and those categorized in the 800s and 900s were tossed out. According to the Online Computer Library Center, these categories include poetry and literature as well as history and geography, respectively.", "When asked to comment directly on allegations that the school was attempting to \"erase history,\" Pierre replied that \"history is an important part of our middle school curriculum\" and provided examples of history-related projects that middle school students participate in.", "There is not a direct replacement process for the discarded books, but the school's \"intent is to maintain a collection that covers a wide range of topics from a variety of perspectives.” Books were only chosen for recycling after all other options had been exhausted, added Pierre.", "“Our preference is to donate as many books as possible,” said Pierre, adding she sent the following statement to families of the middle school:", "Before removing the outdated books, the proper book disposal protocol was followed by checking in with a partner organization “Better World Books” to donate as many of the materials as possible, giving books to teachers in the district for classroom purposes and distributing them to Little Free Libraries placed throughout the White Bear area.", "Additionally, Sunrise’s media specialist had also reached out to multiple other organizations to donate the books that either didn’t meet a specified criterion because of the outdated content, required a fee or aren’t accepting donations with COVID-19 restrictions.", "As a school community, we place great value on taking all of the steps possible that we can to repurpose our outdated materials when following the weeding and book removal procedures. The weeding procedure is important to help us find a new home for books 10 years and older to ensure that materials are keeping up to date with the needs of ever-changing curriculum, school goals and student needs.", "White Bear residents were said to have collected some of the discarded books with the intention of finding them a new purpose. By the following morning, Swanson said that all of the books were gone.", "Semenov, Rose.   \"Principal Responds After Photos of School Library Books in Dumpster Cause Social Media Stir.\"\r\n    FOX 9 KMSP.   10 July 2020.", "\"800 Literature (Belles-lettres) and Rhetoric.\"\r\n    Online Computer Library Center.", "\"900 History, Geography, and Auxiliary Disciplines.\"\r\n   Online Computer Library Center.", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]