["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The Volusia County Republican Party says that the federal government is promoting Islam to public school children.", "\"The United States Department of Education has introduced an Islamic indoctrination program for the public schools, called ‘Access Islam,’\" states the mass email sent by the party April 2.", "The email said that classroom instructions have students learning \"the core duties of Muslims\" and \"what it means to proclaim faith or belief as a Muslim.\"", "\"The Education Department offers no similar learning material for Christianity, Judaism, Hinduism or any other major world religion. Just Islam,\" the email said.", "This claim earns a failing grade, though.", "Access Islam is a real program for school teachers looking to offer lesson plans on the religion of Islam. But to say it’s part of an \"indoctrination program\" delivered from the federal government isn’t accurate.", "Here’s your tutorial on the facts.", "Teaching Islam", "To support its claims, the party points to a March 28 video by the Christian Action Network, a group that says its goal is to \"protect America’s religious and moral heritage through educational efforts.\"", "The video, narrated by network founder Martin Mawyer, criticizes Access Islam, a program produced by PBS’ Thirteen/WNET New York. The program received grant money from the federal government about a decade ago.", "The network recently sent a letter to Education Secretary Betsy DeVos asking her to denounce the program and remove it from any government website.", "We looked at several of the lesson plans and videos from Access Islam, which draws from the PBS series Religion and Ethics Newsweekly.", "Much of the content provides educational information about religious traditions and holidays. Other video segments explained the tensions between Somali Muslim immigrants and other residents in Maine; how students learn in a madrassah, and the challenges faced by Muslims to differentiate themselves from terrorists.", "Lesson plans include facts such as that Muslims pray five times a day, cultural variations and what the First Amendment says about religion.", "It’s unclear how many schools have used the materials, and there is certainly no requirement that schools do. Mawyer told PolitiFact he found a few examples including the state of Indiana, which listed Access Islam in a resource guide for teachers of world history. The guide includes a disclaimer that the Indiana department hasn’t evaluated the materials which \"are not intended to represent the best or only approach to any particular issue.\"", "In Florida, high school history standards include lessons about Islam such as a comparison of Islam, Judaism and Christianity and key developments in Islamic history.", "The Florida Department of Education said whether to use Access Islam is a decision for local school districts.", "Access Islam is not part of the resource list given to Volusia County Schools World History teachers however teachers can choose their own resources as long as they conforms to the standards, a district spokesperson said.", "Broward, Pinellas and Hillsborough school districts don’t use the Access Islam curriculum, district spokespersons said.", "The U.S. Education Department granted $166,000 in fiscal year 2005 and $8,000 in fiscal year 2006 for the program, but we could find no recent involvement by the department. In case there was any tinge of partisan politics, the grants came while George W. Bush, a Republican was president. Spokespersons for the department and PBS did not respond to our questions by our deadline.", "Experts on whether program is ‘indoctrination’", "We asked four experts to review the Access Islam materials and all said they did not consider the materials to be \"indoctrination\": Linda K. Wertheimer, journalist and author of the book Faith Ed, Teaching About Religion In An Age of Intolerance; Mark Fowler, Tanenbaum Center for Interreligious Understanding deputy chief executive officer; Charles C. Haynes, Vice President of the Newseum Institute’s Religious Freedom Center and Diane Moore director of Harvard Divinity School’s Religious Literacy Project.", "Haynes said the claim that the lessons are indoctrination is \"completely unfounded.\"", "\"Nothing in these lessons crosses the constitutional line dividing education and indoctrination,\" he said. \"Students learn the basic tenets and practices of Muslims and then are assessed on what they have learned. Students are not asked to affirm or reject any religious teachings. Nor are students required to participate in any religious or devotional activities.\"", "Wertheimer said the lessons are a clear example of teaching \"about\" religion.", "\"It is not preaching or promoting Islam over other faiths,\" she said. \"In fact, the lesson plans include questions about comparing and contrasting beliefs and practices of Islam to those of other faiths.\"", "Indoctrination has as its motivation having children choose a faith over another, Fowler said. But the lessons he reviewed didn’t ask students to choose a religion or rank them, he said.", "Moore said that the videos present individual Muslims’ personal experience of their faith.", "\"When any religious tradition is only represented in its positive light, it can feel like indoctrination to those who don't believe the tradition has merit or has equal credibility to one's own faith,\" she said. \"This is why it is so important to make the distinction between teaching about a religion and teaching religion, and the Access Islam site makes this distinction in its first lesson on the First Amendment.\"", "Our ruling", "The Republican Party of Volusia County says \"The United States Department of Education has introduced an Islamic indoctrination program for the public schools, called ‘Access Islam.’", "The Access Islam program was created by a New York PBS station about a decade ago and received some funding from the federal education department during the George W. Bush administration. The program includes educational lesson plans and videos about various topics related to Islam including how Muslims pray, but the materials we reviewed didn’t appear to try to convince students to become Muslims or to argue that Islam is a better religion than other world religions.", "We rate this claim False.", "Volusia County Republican Party, Email, April 2, 2017", "Christian Action Network, Video, March 28, 2017", "Change.org petition by Martin Mawyer, \"Dump ‘Access Islam’ from public schools,\" 2017", "Thirteen WNET New York, \"Access Islam,\" Accessed April 3, 2017", "CPALMS, Florida state standards, Accessed April 3, 2017", "Volusia County Republican Party, Website, Accessed April 3, 2017", "U.S. Department of Education, \"International Research and Studies Program Fiscal year 2005 new grants,\" 2005", "Dictionary definitions of indoctrination, Merriam-Webster, Oxford, Cambridge and Dictionary.com, Accessed April 3, 2017", "Indiana Department of Education, Resource guide, Updated October 2016", "Fox News, \"US taxpayer dollars funding Islam indoctrination program?\" March 29, 2019", "Tribune News Service, \"Public Schools Struggle With Teaching Islam Around the Country,\"", "USA Today, \"Lawmakers fear Islamic 'indoctrination' in schools,\" Sept. 10, 2015", "Education Week Global Learning blog \"Four reasons why you should teach about religion in school,\" April 5, 2014", "Washington Post op-ed by Linda K. Wertheimer, \"Public schools shouldn’t preach. But they should teach kids about religion,\" Sept. 8, 2015", "Florida Today, \"'Pro-Islam' textbook stirs debate in Brevard — again,\" April 1, 2017", "Interview, Meghan Collins, Florida Department of Education spokeswoman, April 3, 2017", "Interview, Linda K. Wertheimer, former Boston Globe education editor and author of Faith Ed, Teaching About Religion In An Age of Intolerance, April 3, 2017", "Interview, Mark Fowler, Tanenbaum Center for Interreligious Understanding deputy chief executive officer, April 3, 2017", "Interview, David R. Brockman, Department of Religious Studies Dedman College Southern Methodist University adjunct lecturer, April 3, 2017", "Interview, Diane Moore, Director, Religious Literacy Project at Harvard divinity school, April 3, 2017", "Interview, Nancy H. Wait, Volusia County Schools spokeswoman, April 3, 2017", "Interview, Lisa Wolf, Pinellas County schools spokeswoman, April 3, 2017", "Interview, Tanya Arja, Hillsborough County schools spokeswoman, April 3, 2017", "Interview, Nadine Drew, Broward county schools spokesman, April 5, 2017", "Interview, Charles C. Haynes, vice president Newseum Institute’s Religious Freedom Center, April 3, 2017", "Interview, Tony Ledbetter, Volusia County Republican Party chairman, April 3, 2017", "Interview, Martin Mawyer, Christian Action Network founder and lawyer, April 3, 2017", "Interview, Adam Baker, Indiana Department of Education spokesman, April 4, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]