["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A fake news story on NotAllowedTo.com claimed that a Canadian fisherman caught a 3,000-pound shark in Lake Michigan.", "A story that fishermen caught a 3,000-pound white shark in Lake Michigan is fake news.", "NotAllowedTo.com ran a post on June 22 that said a Canadian tourist and his friend from Chicago had caught a shark responsible for the deaths of 100 people who went missing over the past decade. The catch and deaths are fabricated.", "The story is a shorter version of a June 20, 2016, post published on World News Daily Report, a satirical news site.", "\"We’ve heard a few times about this story, and there's no fact to it,\" said Christopher Yaw, a spokesperson for the District Nine Coast Guard.", "Great white sharks can’t swim in freshwater, as it dilutes their internal salt levels. That dehydrates them and decreases their buoyancy, so that they sink.", "The story quotes a biology professor at the University of Illinois on the rarity of the find, but a search of his name on the university’s database yielded no results.", "The post claims there was a 1916 shark attack in Lake Eerie that led to a 14 year swimming ban, but we found no traces of this attack or a ban. The most famous actual 1916 attack occurred on the Jersey Shore, in salt water.", "We also found no credible reports of disappearances on the lake.", "A disclaimer at the bottom of the story calls NotAllowedTo.com a satire entertainment website.", "\"We make no representation as to the completeness, accuracy or currency of any information on this Web Site,\" a disclaimer reads.", "This claim is bogus. We rate it Pants on Fire!", "NotAllowedTo.com, \"3,000-Pound Great White Shark Captured in Great Lakes,\" June 22, 2017", "Phone interview with Christopher Yaw, spokesperson for District Nine Coast Guard, July 11, 2017", "WorldNewsDailyReport.com, \"Fisherman captures 3,000-pound great white shark in great lakes,\" June 20, 2016", "Snopes.com, \"Fisherman Captures 3,000-Pound Great White Shark in Great Lakes?\" June 22, 2016", "National Geographic News, \"Great whites may be taking the rap for bull shark attacks,\" Aug. 2, 2002", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]