["“CORONAVIRUS LOOPHOLE!!!!! If you don’t have insurance and can’t afford to take the $3200 test for the virus ($1000 with insurance), DONATE BLOOD. They HAVE to test you for the virus in order to donate blood. Tell your friends! Tell your family!!!!!” said one tweet, which was retweeted nearly 100,000 times and liked more than 300,000 times before a user deleted it.", "“I don’t want to contribute to hysteria or medical misinformation,” the user -- whose location is given as New York -- wrote on Twitter, explaining why she deleted the tweet about blood donation allegedly leading to testing.", "But images of the deleted tweet are being shared on Facebook here, here and here.", "And other tweets from accounts identified as being US-based that carry the same or similar messages continue to circulate online.", "Both America's Blood Centers (ABC) -- whose member organizations collect nearly 60 percent of the US blood supply -- and the American Red Cross, which collects around 40 percent, said they do not test for COVID-19.", "“Blood centers are not testing individuals or screening directly for coronavirus,” ABC Chief Executive Officer Kate Fry told AFP by phone.", "All donors are however screened for general health and wellness, including a temperature check, Fry said.", "“We are encouraging healthy individuals to come donate, but if people are not feeling well, they should stay home,” she said.", "ABC has warned that “concerns over the coronavirus are negatively impacting the nation’s blood supply.”", "The American Red Cross told AFP by email that it “is not testing people or donated blood for COVID-19.”", "“It’s important to emphasize that there are no data or evidence that this coronavirus can be transmitted by blood transfusions,\" it said.", "While urging those who are healthy to donate blood, the Red Cross has asked people to postpone doing so for 28 days if they have been diagnosed with the virus, or been in contact with someone who has or is suspected of having it.", "The requested waiting period also applies to people who have traveled to China, Iran, Italy or South Korea -- countries in which the virus is widespread.", "The novel coronavirus has spread from China around the world, killing more than 4,500 people and wreaking havoc on the global economy.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]