["President-elect Joe Biden speaks during an event at The Queen theater in Wilmington, Del., Jan. 7, 2021. (AP)", "Biden’s figure is correct. Trump wasn't an official plaintiff in all of them; some were his allies or supporters echoing Trump’s claims.", "The lawsuits failed for various reasons. Some had errors in the filings, others lacked standing. Mainly, the allegations lacked proof.", "A day after a mob of President Donald Trump’s supporters stormed the U.S. Capitol, President-elect Joe Biden spoke about the importance of democratic institutions. He said that one of those pillars was the judiciary system.", "Trump was \"truly stunned when the judges he appointed didn't do his bidding and instead acted with integrity, following the Constitution, upholding the rule of law,\" Biden said.", "\"In more than 60 cases, in state after state after state, and then at the Supreme Court, judges, including people considered ‘his judges, Trump judges,’ to use his words, looked at the allegations that Trump was making and determined they were without any merit,\" Biden said Jan. 7, at an event where he introduced Judge Merrick Garland as his nominee for U.S. Attorney General.", "Is that accurate? Yes. More than 60 lawsuits brought by Trump and his allies failed because they were unable to prove their allegations. Some lawsuits were dismissed due to errors in the filings and other procedural issues.", "PolitiFact reached out to Biden’s transition team and the Trump campaign but did not hear back.", "Marc Elias, a lawyer who has filed and defended cases on behalf of Democrats, keeps a tally on the outcome of the election cases.", "\"It is 63 losses by Trump and his allies,\" Elias told PolitiFact the morning of Jan. 8. \"We treat each case separately — so if there is a federal case and a state case, we treat them as two cases. We only ever count a case one time — so if there is an appeal or remand, we do not treat that as a separate loss.\"", "The one case where Trump found success didn’t involve an allegation about fraud. The case centered on reducing the amount of time Pennsylvania voters had to fix errors on their mail-in ballots. The matter involved a small number of ballots that didn’t change the outcome.", "News outlets, including Fox News and the Wall Street Journal, have reported that Trump and supporters of his campaign have been routinely defeated in court. \"Judges have denied or dismissed dozens of cases backed by Trump and his allies, who have pushed unsupported charges of widespread fraud in battleground states,\" said a Jan. 7 Fox News report.", "The lawsuits collapsed as Trump and his allies failed to prove the fraud they alleged. Plaintiffs in some lawsuits lacked standing to sue, and some were also riddled with errors. In one case, an affidavit that attempted to cite results from precincts in Michigan cited Minnesota data instead.", "At least 86 judges — from state courts to the U.S. Supreme Court — have rejected at least one post-election lawsuit filed by Trump or his supporters, according to a review of court filings by the Washington Post, published Dec. 12. Around that time, more than 50 cases had failed or been tossed out of court, the Post found.", "The Post analysis found that 38 judges appointed by Republicans were among the 86 judges who had rejected lawsuits. The U.S. Supreme Court, which includes three Trump-appointed justices, rejected Texas Attorney General Ken Paxton’s challenge to election results in four states.", "Judge Stephanos Bibas, a Trump appointee to the U.S. Court of Appeals for the Third Circuit, said in dismissing one Pennsylvania challenge: \"Free, fair elections are the lifeblood of our democracy. Charges of unfairness are serious. But calling an election unfair does not make it so. Charges require specific allegations and then proof. We have neither here.\"", "Biden said that in more than 60 cases, judges \"looked at the allegations that Trump was making and determined they were without any merit.\"", "Biden’s figure is correct. Trump wasn't a plaintiff in all of them, some were his allies or supporters echoing Trump’s claims. The lawsuits failed for various reasons: some had errors in the filings, others lacked standing. Mainly, the allegations lacked proof.", "We rate Biden’s claim True.", "Washington Post, ‘The last wall’: How dozens of judges across the political spectrum rejected Trump’s efforts to overturn the election, Dec. 12, 2020", "PolitiFact, A day of crisis at the US Capitol, fact-checked, Jan. 6, 2021", "Email interview, Marc Elias, lawyer for Democrats litigating election cases, Jan. 8, 2021", "Rev.com, Joe Biden Introduces DOJ Nominees, Merrick Garland Transcript, Jan. 7, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]