["About this rating", "On 2 May 2018, a Facebook user shared a warning about Neutrogena Makeup Remover Cleansing Towelettes, claiming that the product caused a violent allergic reaction:", "Within a few days, the post was shared tens of thousands of times. Several users shared the post on Neutrogena's Facebook wall, but the brand did not immediately respond to those posts. According to Neutrogena.com, ingredients for Neutrogena Makeup Remover Cleansing Towelettes are as follows:", "Water, Cetyl Ethylhexanoate, Isostearyl Palmitate, Pentaerythrityl Tetraethylhexanoate, Isononyl Isononanoate, Cyclopentasiloxane, Hexylene Glycol, PEG-4 Laurate, PEG-6 Caprylic/Capric Glycerides, Sucrose Cocoate, Carbomer, Sodium Hydroxide, Benzoic Acid, Dehydroacetic Acid, Phenoxyethanol, Iodopropynyl Butylcarbamate, Fragrance (EU 1279)", "The ingredients list is not very much different from products made by competitors, such as Aveeno or Olay.", "The Neutrogena claims are similar to 2016 rumors about baby wipes, and as with similar rumors about baby diapers and wipes, it is virtually impossible to attribute any single reported reaction to a single topical product used on anyone's skin, infant or adult. Anecdotal reports are difficult to verify, because contact dermatitis can be caused by any of thousands of known allergens and irritants. Furthermore, reactions to any substance used in skincare products can be highly personal, and a substance that irritates the skin of one individual can potentially be tolerated by a majority without incident.", "We searched for corroborating information indicating that Neutrogena Makeup Remover Cleansing Towelettes are causing a high number of allergic reactions, but were unable to turn up anything relating to that particular product. We contacted Neutrogena to ask about rumor involving Makeup Remover Cleansing Towelettes, but have not yet received a response.", "Bell, Natalie.   \"Five Natural Ingredients That Can Irritate Your Skin.\"\r\n    FutureDerm.   20 August 2012.", "Miranda, Leticia.   \"People Say These Neutrogena Products Are Leaving Their Face Burning And Irritated.\"\r\n    BuzzFeed.   6 May 2016.", "Rambharose, Amber.   \"Sorry, But Makeup Wipes Are the Actual Worst.\"\r\n    Glamour.   23 August 2017.", "Mayo Clinic.   \"Contact Dermatitis.\"\r\n    Accessed 7 May 2018.", "Neutrogena.com.   \"Makeup Remover Cleansing Towelettes.\"\r\n    Accessed 7 May 2018.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]