["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Anita Perry said she supported new abortion restrictions advanced by the Republican-majority Legislature and signed into law this summer by her husband, Gov. Rick Perry.", "\"And I believe there are only four countries in the world that allow abortions after 20 weeks,\" Anita Perry said, adding that Texas belonged in the same category prior to the changes in law.", "Her four-count, part of a Sept. 28, 2013, public interview at the Texas Tribune Festival, aligned with a similar claim made in August 2013 by former Republican U.S. Senate candidate Carly Fiorina of California, who said in defense of the change in Texas law: \"There are only four countries in the world that have -- that legalize abortion after five months -- China, North Korea, Canada and the U.S.\"", "Setting five months as equal to 20 weeks, after which the changed Texas law restricts abortions, PolitiFact rated Fiorina’s claim as Half True after identifying wrinkles including a couple of additional countries allowing abortions after 20 weeks of gestation.", "What the laws say", "U.S. requirements for legally obtaining an abortion vary by state, but the national standard was handed down from the Supreme Court in Roe v. Wade in 1973. Lawmakers and physicians refer to the point at which a fetus can survive outside the uterus as \"viability.\" The decision sets the standard that women can choose to have an abortion until the point of viability. In citing the leading obstetrics publication as a guide, the ruling suggests viability starts at 24 weeks into the gestation period, which starts on the first day of the woman’s last menstrual period.", "So women in the United States can get an abortion for any reason, not necessarily medical, until at least 24 weeks of gestation. This is known as elective abortion. After 24 weeks, or whenever the resident’s state prohibits elective abortion, the woman can get a therapeutic abortion under a few exceptions: life in danger, physical health or mental health.", "China, North Korea and Canada do not have federally enforced limits on elective abortion. Gestation period restrictions in Canada, unlike the other two nations, are regulated at the local level, Johanna Fine, a Center for Reproductive Rights spokeswoman, told PolitiFact. Provinces can range from 10 to 20 weeks for the maximum gestation period.", "So this gets us to the mentioned four nations.", "However, according to the Center for Reproductive Rights, which published a 2013 chart that several reproductive rights experts referred PolitiFact to, Singapore and the Netherlands also fit the criteria. Both nations allow unrestricted abortion through Week 24 of gestation, after which therapeutic abortion is possible.", "Anita Perry’s statement, like the claim by Fiorina, also leaves off an important qualifier. She did not mention that dozens of countries permit abortions after 20 weeks for different reasons. Common exceptions to the gestational period requirement mean women may be able to get therapeutic abortions based on physical health, mental health or socioeconomic status.", "Just 29 countries (meaning independent states and semi-autonomous regions whose populations exceed 1 million) outlaw abortion entirely, with no exceptions to save the woman’s life. Thirty-seven other countries that routinely outlaw abortion, including Paraguay, Afghanistan and Uganda, make clear exceptions to save mothers.", "Another 59 will do so in general to preserve pregnant women’s physical health on a broader scale, with Israel, New Zealand and others also accepting mental health reasons as valid exceptions. India and Japan belong to a group of 13 countries that grant even wider exceptions that include access to the procedure for socioeconomic reasons based on factors like age of the woman or very low income.", "The remaining 61 countries legalize elective abortions with varying gestational period requirements, with the United States, Canada, North Korea, China, Singapore and the Netherlands being the six countries with the widest acceptable time periods.", "\"It’s not so much whether abortion is legal; it’s under what circumstances it's legal,\" Mindy Roseman, the Human Rights Program academic director at Harvard Law School, told PolitiFact. \"Even where abortion is highly restricted, it’s legal for the health of the woman.\"", "By email, Perry spokesman Josh Havens said the initial PolitiFact article on Fiorina’s claim \"pretty much covers\" the Anita Perry claim.", "Our ruling", "Perry said only four countries allow legal abortions past 20 weeks into the gestational period.", "The United States, Canada, North Korea and China fit that measure, but Singapore and the Netherlands do as well. Also, far more countries permit abortions in certain circumstances in which the pregnancy would damage the woman’s well-being, be it physical, mental or economic.", "We rate this partially accurate claim as Half True.", "HALF TRUE – The statement is partially accurate but leaves out important details or takes things out of context.", "Click here for more on the six PolitiFact ratings and how we select facts to check.", "Truth-O-Meter article, \"Only four countries 'legalize abortion after 5 months,' Carly Fiorina says,\" PolitiFact, Aug. 22, 2013", "ABC, \"This Week,\" Aug. 18, 2013", "Abortion Rights Coalition of Canada, \"Abortion Law and Policy: Comparisons Between the U.S. and Canada,\" Feb. 2006", "Abortion Rights Coalition of Canada, \"How to Get an Abortion in Canada,\" Feb. 2006", "Center for Reproductive Rights, \"The World’s Abortion Laws Map 2013 Update,\" June 2013", "Email interview with Jessica Rodgers, National Right to Life spokeswoman, Aug. 20, 2013", "Email interview with Marjorie Dannenfelser, Susan B. Anthony List president, Aug. 21, 2013", "FindLaw, \"Roe v. Wade, 410 U.S. 113 (1973),\" accessed Aug. 21, 2013", "Government of the Netherlands, \"Abortion,\" accessed Aug. 21, 2013", "Guttmacher Institute, \"State Policies in Brief: An Overview of Abortion Laws,\" Aug. 1, 2013", "Telephone interview with Johanna Fine, Center for Reproductive Rights spokeswoman, Aug. 20, 2013", "Telephone interview with Mindy Roseman, Human Rights Program academic director at Harvard Law School, Aug. 20, 2013", "Reproductive Health Matters, \"Second Trimester Abortion Laws Globally: Actuality, Trends and Recommendations,\" 2010", "Singapore Attorney General’s Chambers, \"Termination of Pregnancy Act,\" revised March 30, 1987", "Email, Josh Havens, deputy press secretary, Gov. Rick Perry, Oct. 4, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]