["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "This story appeared on the website NewsExaminer, but it doesn't check out as real.", "Perhaps you have seen in your social media feeds an article headlined, \"Christian Pastor in Vermont Sentenced to One Year in Prison After Refusing to Marry Gay Couple.\" It received about 5,000 Facebook shares as well as interactions on other social media platforms.", "Is it real? We decided to take a closer look.", "The article was published at a site called NewsExaminer on July 10. It says that a pastor from Proctor, Vt., was sentenced to a year in federal prison after refusing to marry gay couples. It came just days after the Supreme Court ruled, 5-4, that same-sex marriage would be allowed in all 50 states. (The ruling didn’t legalize same-sex marriage in Vermont, which approved it on its own in 2009.)", "But the bottom line is that the NewsExaminer is a fake-news site, and has been classified as such by Snopes, the urban legends site. Through a posting to an NBC copycat website with the url www.nbc.com.co, the article gained traction through mistaken association with the genuine NBC News site.", "The article cites several individuals involved in the case, but none seem to exist.", "The Christian pastor who was sentenced, Paul Horner, is actually a recurring name used in stories published by the National Report and other fake news sites. According to Snopes.com, the character Paul Horner has been used in past articles about everything from the British street artist Banksy to a Dolphin mascot for a Christian organization. (We’ve previously run into the Zelig-like Horner in such articles as this one and this one.)", "The Hon. Myron Danus, the judge who supposedly made the ruling, is also fictitious. We checked the Vermont Court Administration Office in Montpelier, the U.S. District Court in Rutland County, and the Rutland County District Court to check if there is any judge by that name in the state, and there isn’t.", "Though the LGBT Pride Center referenced in the article is real -- or at least there is an organization with a similar name -- Gwen Hawkins, the supposed president of the organization, does not exist. Instead, the Pride Center of Vermont lists Kim Fountain as its executive director.", "We also couldn’t find a record for the Vermont Family Research Committee or its purported president, Steve Shand.", "There is one element of the article that is accurate: The town of Proctor exists. It is a small town in Rutland County, Vt.,with a population of just under 2,000. It is, as the article accurately says, \"home to the Vermont Marble Museum, and the only marble bridge in America.\"", "However, the Christian Proctor Church is as fake as its pastor. According to the Proctor Town Offices, the town has only three churches: St. Dominic’s, Union, and St. Paul’s.", "Our ruling", "Posts about a Christian pastor in Vermont being sentenced to one year in prison after refusing to marry a gay couple have circulated on the Internet. However, the article was published at a known fake-news site, and we found no evidence to support the existence of key elements of the story, including the pastor, church, or the judge referenced in the article. We rate this claim Pants On Fire.", "NewsExaminer, \"Christian Pastor in Vermont Sentenced to One Year in Prison After Refusing to Marry Gay Couple,\" July 10, 2015.", "Phone interview with employee of the Proctor Town Offices", "Snopes.com, \"Shotgun Wedding\", July 10, 2015", "Pride Center of Vermont", "United States District Court, District of Vermont-Rutland", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]