["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A man wearing mask to protect against the spread of COVID-19 is reflected next to a sign requiring face coverings at a business in San Antonio on June 24, 2020. (AP)", "The study was done on influenza, which spreads in ways similar to COVID-19, but it makes no mention of COVID-19.", "The study was published by the CDC and supported by WHO, but it was done by the University of Hong Kong.", "One of the study’s authors told us the claim is incorrect.", "As Americans argue over whether face coverings stop the spread of COVID-19, a video shared on Facebook makes a stark claim about masks and viruses generally.", "A 2020 study from the U.S. Centers for Disease Control and Prevention and the World Health Organization, the video declares, \"proves face masks do not prevent the spread of a virus.\"", "The video was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "One of the study’s authors, University of Hong Kong public health professor Ben Cowling, told PolitiFact that the claim amounts to an \"incorrect interpretation\" of the study, \"confusing absence of evidence with evidence of absence.\"", "Virologist Angela Rasmussen, a research scientist at Columbia University, said of the study cited in the video: \"The bottom line is that this paper doesn’t prove that face masks don’t prevent transmission, but that the available data didn’t show a statistically significant effect.", "\"The available data is incomplete and more studies need to be done to better understand whether masks are effective at reducing community transmission or not. That is why I continue to wear a mask in public places.\"", "As we’ve reported, facial coverings are not in themselves totally effective in fighting the coronavirus, and there is a need for more study. But health officials largely agree that wearing any kind of face mask, coupled with social distancing and frequent hand-washing, is more protective than going unmasked.", "The CDC generally recommends wearing masks in public settings where other social distancing measures are difficult to maintain, such as grocery stores, pharmacies, and gas stations.", "As the CDC puts it: \"Your cloth face covering may protect them. Their cloth face covering may protect you.\"", "The 15-minute video was narrated and posted by Ben Swann, who describes himself as a \"journalist who speaks truth to power!\" Swann, who has 486,000 Facebook followers, runs TruthInMedia.com, which says it provides \"content focusing on issues that impact humanity.\"", "The video was also shared the same day on YouTube by RT, a news network formerly known as Russia Today that is funded by the Russian Federation.", "In February 2018, YouTube began labeling state-funded posts and videos promoting conspiracy theories. The step was significant, the Wall Street Journal reported at the time, in part because YouTube has been a major conduit for RT, \"which U.S. intelligence officials called ‘the Kremlin’s principal international propaganda outlet.’\"", "The study cited in the video was conducted by researchers at the University of Hong Kong — not by the CDC and WHO, as the video claims — although there are affiliations.", "First published in February, the study appears in the May edition of Emerging Infectious Diseases, a peer-reviewed journal published by the CDC. The study says it was \"conducted in preparation for the development of guidelines by the World Health Organization on the use of nonpharmaceutical interventions for pandemic influenza in nonmedical settings,\" and was supported by the WHO.", "The CDC confirmed it did not participate in the study and would not comment on it, but a spokesman cited a separate CDC study published in July. It looked at clients exposed to two hair stylists who were symptomatic with confirmed COVID-19. Among 139 clients who wore face masks while the stylists also wore face masks, there were no symptomatic secondary cases reported. Among 67 clients who tested for COVID-19, all test results were negative. \"Adherence to the community’s and company’s face-covering policy likely mitigated spread of COVID-19,\" the study said.", "WHO did not provide comment before we published.", "The study cited in Swann’s video amounts to a review of research on personal protective equipment and influenza spread. It does not mention coronavirus or COVID-19.", "After reviewing 10 studies on randomized and controlled trials that were published from 1946 to 2018, the study determined there was \"no significant reduction in influenza transmission with the use of face masks.\" That was regarding masks worn by infected persons or by persons in the general community.", "\"We did not find evidence that surgical-type face masks are effective in reducing laboratory-confirmed influenza transmission, either when worn by infected persons or by persons in the general community to reduce their susceptibility,\" the researchers wrote. \"However, as with hand hygiene, face masks might be able to reduce the transmission of other infections and therefore have value in an influenza pandemic when healthcare resources are stretched.\"", "Cowling, one of the study’s authors, told us that because COVID-19 spreads in similar ways as to influenza, the study findings should apply to COVID-19.", "But University of San Francisco research scientist Jeremy Howard cautioned that influenza and COVID-19 are different diseases, \"and we do not know whether evidence from influenza trials are relevant to COVID-19.\"", "The \"we did not find evidence\" phrase doesn't prove either that masks are effective or ineffective, Howard said. He added that it’s important to note that none of the 10 trials reviewed was done during a pandemic.", "Rasmussen reiterated that \"this was a systematic review of other published studies and it tells us much of what we already know: there’s not a good evidence base for masks outside of a healthcare setting, but there are still many knowledge gaps, especially regarding mechanisms of transmission.\"", "Texas A&M University-Texarkana virologist Ben Neuman said the study reflects the understanding of masks in the early phase of the pandemic, but scientific opinion has shifted because of several important papers published since then.", "\"The kicker is,\" he added, \"just weeks later, a group with the same senior author, plus some coronavirus specialists, produced a paper demonstrating that masks are indeed highly effective in stopping infected people from releasing airborne viruses.\"", "The post claims a CDC study proved that masks do not prevent COVID-19. But it wasn’t a CDC study, and it didn’t \"prove\" that masks were ineffective. Scientists are still studying masks and the prevention of COVID-19. We rate the statement False.", "Facebook, post (archived here), July 23, 2020", "Lead Stories, \"Fact Check: New CDC And WHO Study Does NOT Prove 'No Evidence' Face Masks Prevent Virus,\" July 26, 2020", "Centers for Disease Control and Prevention’s Emerging Infectious Diseases, \"Nonpharmaceutical Measures for Pandemic Influenza in Nonhealthcare Settings—Personal Protective and Environmental Measures,\" May 2020", "YouTube, RT post of video, July 23, 2020", "Email, Ben Cowling, professor of public health, University of Hong Kong, July 30, 2020", "Email, University of San Francisco research scientist Jeremy Howard, July 29, 2020", "Email, virologist Angela Rasmussen, associate research scientist at Columbia University, July 30, 2020", "Email, Centers for Disease Control and Prevention spokesman Scott Pauley, July 31, 2020", "Centers for Disease Control and Prevention, \"Absence of Apparent Transmission of SARS-CoV-2 from Two Stylists After Exposure at a Hair Salon with a Universal Face Covering Policy — Springfield, Missouri, May 2020,\" July 17, 2020", "Email, Texas A&M University-Texarkana virologist Ben Neuman, July 30, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]