["The image was published on Facebook here on March 4, 2021. “Is this #Takbier available in Indonesia? I want to try a halal beer,” the Indonesian-language caption reads.", "The image purports to show two bottles of “TAKBIER”, emblazoned with Saudi Arabia’s flag. The description on the bottle reads: “100% halal”. On the right-hand side of the bottles, an image of Saudi Crown Prince Mohammed bin Salman is displayed.", "Drinking alcohol is generally prohibited in Islam.", "The image also appeared in other Facebook posts, such as here, here, here and here alongside a similar claim.", "The claim, however, is misleading.", "The image is actually taken from this article from German-language satire website Noktara.de published on May 13, 2018. The article's headline translates to English as: “Takbier: Saudi Arabia produces official World Cup beer.”", "Noktara.de writes on its “Disclaimer” page: “If you should read our articles on Noktara.de, you have to have a sense of humour. You must not take the articles seriously. These contributions are popularly known as satire. No matter how realistic it looks, we made fun of it. Texts, images and screenshots were created by our editors.”", "Below is a screenshot comparison of the misleading Facebook post (L) and the image seen in the Noktara.de article (R):", "The photo of Mohammed bin Salman was taken from an unrelated event. It was originally published in this Flickr album from the White House on May 20, 2017. It shows the Saudi crown prince shaking hands with former US secretary of state Rex Tillerson.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]