["The 30-second video was posted on Facebook here on August 28, 2019, where it has been viewed more than 2,500 times.", "The English language caption of the post says: “Kashmir people in flight to Rahul: Modi is doing good for us. Why do you want to visit Kashmir and trouble us? Please go back.!”", "Below is a screenshot of the post:", "The video has also been shared in Facebook posts here and here, alongside similar claims.", "Nowhere in the 30-second clip does the woman mention Modi or tell Gandhi not to visit Kashmir.", "This is a full transcript of the remarks by the woman in the video: “Very young kids who study in the school are not able to move out of their homes. When they go out, they cannot find each other. My brother is a heart patient. He went to look out for his children, his whereabouts were not known for 10 days. We are in deep trouble.”", "The original video was posted on Twitter here by News18 journalist Arun Kumar Singh on Twitter on August 24, 2019.", "\"A women is apprising @RagulGandhi of her difficulties on-board a return flight from Srinagar,\" the Hindi-language tweet says.", "श्रीनगर से वापस आते वक्त फ्लाइट में एक महिला @RahulGandhi से अपनी मुश्किल बताते हुए। pic.twitter.com/f8mzgaskhx", "A video of the woman from a different angle was posted here the same day on the verified Twitter account of Radhika Khera, the media coordinator for Gandhi’s Indian National Congress party.", "The accompanying Hindi caption says: “Hear the pain of Kashmir.”", "कश्मीर का दर्द सुनिए... pic.twitter.com/FRyg1Chifg", "The incident occurred on August 24, when Rahul Gandhi and several other Indian politicians were returning from Srinagar after local authorities denied them entry to the city.", "It's been 20 days since the people of Jammu & Kashmir had their freedom & civil liberties curtailed. Leaders of the Opposition & the Press got a taste of the draconian administration & brute force unleashed on the people of J&K when we tried to visit Srinagar yesterday. pic.twitter.com/PLwakJM5W5", "Several Indian media outlets reported the discussion onboard the Srinagar-New Delhi flight here, here, and here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]