["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The two-minute video is hilarious. And unsettling.", "A young woman and a male coworker, who appear to be about the same age, are examining their paychecks when the woman discovers she makes only 78 percent as much on payday as her cubicle mate.", "\"That’s so weird because we have the same job,\" the woman says. \"That’s not fair.\"", "In protest, the woman then proceeds to do only 78 percent of her job, much to the dismay of her male co-workers and bewildered bosses. The comedic attack on the gender wage-gap struck a nerve. As of this week, it had 9.7 million views, thanks to social media sites.", "It was released on the site BuzzFeed in conjunction with Equal Pay Day (April 14th ) and entitled \"One Woman Discovers the Wage Gap.\"", "PolitiFact couldn’t resist. We’ve been here before. But it ‘s worth another visit based on the viral dissemination of the video.", "The bottom line is this. There is a gender wage-gap. But it is not 22 percent for men and women of the same age performing the same job. That is an urban myth perpetuated by politicians and advocacy groups misreading Census data compiled on cumulative earnings by men and women.", "PolitiFact has given you the nuts and bolts about gender wage-gap statistics  in past fact-checks. You can read the two most important works in this area here and here.", "Basically, there is a wage gap. That is a fact. But it tends to diminish when you compare women and men in the exact same jobs who have the same levels of experience and education.", "The video implies the woman and her better-paid cubicle-mate are otherwise equals. Their cubicles are at least identical and the co-workers appear to be about the same age.", "We reached out to the folks at BuzzFeed. They shared word from the video’s producer, Chantel Houston, that a research team had looked at information from the White House and four other sources before deciding to go with the 78 percent statistic.", "This included a 2014 report in the liberal groupThink Progress, which cited 2013 data from the U.S. Census Bureau showing that the average woman working full-time and year-round was making 78 percent of what a man with similar employment. The report said that was a slight but not statistically different increase from 77 percent in 2012, and not far off the wages in 2007.", "The double-digit gender pay-gap relying on U.S. Census Bureau data has been widely reported. That data has shown women’s total wages were about 23 percent lower than the total amount of men's wages. But that large discrepancy was due in part to the fact that men generally work more hours.", "The Census Bureau did not attempt to look at equal pay for the same work or the same number of hours worked. Other data -- including hourly wages tracked by the Bureau of Labor Statistics, as well as data comparing the same jobs -- yield much smaller wage gaps.", "BuzzFeed actually looked at some sources that got it right, but then produced a misleading video.", "For example, BuzzFeed reviewed a CNN Money report from last October, which said that 78 percent stat was \"an aggregate of all men and women in the workplace\" that doesn't take into account important variables like education level, total hours worked, type of work and job tenure.", "A wage gap does exist, the show’s audience heard. But CNN Money talked about a study from the American Association of University Women that controlled for college major, occupation, age, geographical region, hours worked and more, and found there was still a 7 percent wage gap between male and female college grads a year after graduation.", "In addition, the video’s researchers said they reviewed a recent report from the Pew Research Center, which says women have to work about 60 extra days, or about three months, to earn what men did by the end of the previous year, based on the White house estimate that full-time working women earn 77 percent of what their male counterparts earn.", "But for young women, the wage gap is even smaller – at 93 percent – meaning they caught up to their same-aged male counterparts by roughly the last week in January of this year, the Pew Research Center estimates. Some studies put the real gender-based wage gap at half that. And some studies show that highly educated single women in urban areas actually make more than their male counterparts.", "Our ruling.", "The BuzzFeed video takes a legitimate statistic and illustrates it in a way that makes it sound much more dramatic than it actually is.", "The 78 percent  figure is real, but for culmulative wages.  It does not factor in occupations held, hours worked or length of tenure. And, unlike the video, the Census data never attempted  to compare equal pay for equal work.", "Using this statistic to illustrate the gender pay-gap is misleading.", "We rate it Mostly False.", "President declares April 14th, 2015 National Equal Pay Day", "Email with Ashley McCollum, chief of staff, BuzzFeed", "Email with Catherine Bartosevich, BuzzFeed", "\"Chart of the Week: In 2014, Women Continue to Earn Less Than Men,\" The White House blog by Tanya Somanader, October 31, 2014", "\"Behind the 78 cent wage gap: Women make 78 cents for every dollar made by men. But the wage gap isn't that simple,\" CNN Money, October 10, 2014", "\"The Gender Wage Gap Didn’t Budge Last Year,\" Think Progress, By Bryce Covert, September 16, 2014", "The Wage Gap, State by State, National Women’s Law Center", "\"On Equal Pay Day, key facts about the gender pay gap \" Pew Research Center", "Politico, March 24, 2014 \"Jimmy Carter: Religion part of pay inequity,\"", "U.S. Census Bureau, Current population reports, Consumer Income, issued September 2011 \"Income, poverty and health insurance coverage in the United States: 2010.\"", "The Institute for Women’s Policy Research, April 2013 \"The gender wage gap by occupation.\"", "Film clip, The Carter Center Conference, \"Conference mobilizes faith groups to advance women's rights,\" June 28, 2013", "The Universal Declaration of Human Rights, Article 23", "PolitiFact, \"Barack Obama ad says women are paid ‘77 cents on the dollar for doing the same work as men,’\" Louis Jacobson, June 21, 2012", "United Nations 2011-2012 report, \"Progress of the World’s Women: In Pursuit of Justice\"", "Email from Steven Hochman, aide to former President Jimmy Carter, April 1, 2014.", "U.S. Census Bureau, \"Income, Poverty, and Health Insurance Coverage in the United States: 2010,\" September 2011", "Institute for Women's Policy Research, \"The Gender Wage Gap by Occupation,\" April 2011", "Bureau of Labor Statistics, \"Table 1. Median years of tenure with current employer for employed wage and salary workers by age and sex, selected years, 1996-2010,\" accessed June 21, 2012", "Institute for Women's Policy Research, \"Obama is Right About His Wage Gap Statistics,\" June 13, 2012", "Washington Post Fact Checker, \"The White House’s use of data on the gender wage gap,\" June 5, 2012", "Bloomberg, \"Shining Shoes Best Way Wall Street Women Outearn Men,\" March 16, 2012", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]