["The election do-over involves the election for alderman in Aberdeen, Miss., population 5,326. A judge found irregularities in the paperwork for 66 of the 84 absentee ballots cast, or 78%. The race had been decided by 37 votes, 177-140.", "The judge found “significant evidence of voter fraud” on the part of two people who notarized paperwork for absentee ballot applications. He ordered one of them arrested.", "Fallout from an election for alderman in Aberdeen, a Mississippi city of 5,000 described by the visitors bureau as \"historically significant, architecturally magnificent,\" produced this headline on social media:", "\"Massive 78% Of Mail-In Ballots Proved Fraudulent, Judge Orders Election Do-Over.\"", "Among those sharing the headline from the National Pulse website was its editor, Raheem Kassam. He is co-host of the War Room, a podcast led by Steve Bannon, a former Trump White House aide and strategist.", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The headline leaves out where the fraud took place or what election they were talking about. If you saw only the headline, you might think it would involve the presidential election. (Kassam and the National Pulse have promoted claims of election fraud in the 2020 presidential election.)", "If you clicked, you’d see the relevant details. A judge ordered a new election for Aberdeen’s alderman seat after finding that 66 of the 84 absentee ballots cast, or 78%, contained irregularities.", "The judge also found evidence of fraud by two people who notarized paperwork for absentee ballots and ordered one of them arrested.", "A Democratic runoff election for Ward 1 alderman in Aberdeen was held June 16, 2020. Nicholas Holliday was officially declared the winner over Robert Devaull by 37 votes, 177-140, by the local Democratic Executive Committee.", "Holliday in effect won the seat, because no independents or Republicans had filed to run in the July 6 general election.", "Devaull challenged the result, claiming numerous irregularities in the election, including that absentee ballots were improperly accepted or rejected.", "But the executive committee upheld Holliday as the winner at a hearing on July 15. Devaull sued Holliday and the committee two days later.", "The lawsuit alleged a number of election irregularities, including 60 absentee ballots that were counted that had not been properly filled out, and four absentee ballots that had similar errors but were rejected.", "The lawsuit also alleged that then-Mayor Maurice Howard said during the executive committee hearing that he had \"dismissed\" some of the witnesses the committee had subpoenaed to appear at the hearing.", "The Mississippi Supreme Court appointed Judge Jeff Weill of Hinds County to the case. A hearing was held before him and three members of the elections commission of Monroe County, where Aberdeen is the county seat, on Jan. 4 and 5.", "Weill issued a 64-page order on Feb. 26, ordering that a new election be held. No date was set.", "According to the ruling:", "Of the 66 absentee ballots that Weill found contained irregularities, 50 were wrongly accepted or wrongly rejected.", "That included 35 that were accepted but should have been rejected and 15 that were rejected \"seemingly arbitrarily,\" in that they appeared to have the same types of errors as the 35.", "There were also irregularities in 16 of the 19 \"challenged\" ballots, all of which were absentee ballots, and they should have been rejected.", "In many cases that had irregularities, a voter signed an absentee ballot application saying the reason for requesting an absentee ballot was that he or she was age 65 or over, or would be out of town on election day; but the witness part of the application indicated the reason was that the voter was disabled.", "There were also other errors cited in the ruling, such as applications that did not state any reason for requesting the absentee ballot.", "Weill also issued an arrest warrant for Dallas Jones, saying \"it distinctly appeared\" she helped people vote absentee illegally \"and conspired with unknown others to accomplish same.\"", "The order noted that Jones initially testified that she was called by Ald. Lady Garth to Garth’s home to correct her father’s absentee ballot paperwork, and while there notarized \"about 30-something ballots.\" But later, Jones testified that she had only handled the ballot of Garth’s father in Garth’s home.", "Jones also testified that she went to the homes of some voters, but either didn’t witness or didn’t recall if she witnessed them signing their absentee ballot applications.", "Lou Ela Hoskins C. Stephens, another woman who notarized absentee ballot paperwork, testified that she witnessed the signatures of each person whose paperwork she notarized, and that each of them are family members, but that she couldn’t remember the names of which family members they were.", "There is \"significant evidence of fraud\" by both women and the \"unnamed co-conspirators with whom they coordinated their efforts,\" Weill wrote.", "Garth became Aberdeen’s acting mayor after Howard pleaded guilty on Feb. 1 to embezzlement by a public official, which resulted in his removal from office. The State Auditor’s Office charged Howard in October 2019 with claiming reimbursements from taxpayer funds for trips he never took.", "A headline widely shared on Facebook stated: \"Massive 78% of mail-in ballots proved fraudulent, judge orders election do-over.\"", "It wasn’t the election you might have been thinking about.", "A judge ordered a new election for an aldermanic seat in a small Mississippi city after ruling that 78% of the 84 absentee ballots cast for that seat contained irregularities. The judge also found \"significant evidence of fraud\" on the part of two people who notarized paperwork for absentee ballots and ordered one arrested.", "The sparse headline needs additional information, which is our definition of Mostly True.", "Facebook, post, March 3, 2021", "The National Pulse, \"Massive 78% Of Mail-In Ballots Proved Fraudulent, Judge Orders Election Do-Over,\" March 3, 2021", "WCBI-TV, \"Notary Arrested, Charged With Voter Fraud In Connection With Aberdeen Alderman Election,\" March 1, 2021", "WCBI-TV, \"Acting mayor of Aberdeen says racism, toxic environment behind accusations from State Auditor’s Office,\" Feb. 4, 2021", "State of Mississippi Judiciary, Robert Devaull lawsuit, July 17, 2020", "WCBI-TV, \"State Auditor accusing 3 Aberdeen aldermen of illegal donation of public funds, demands they each pay back $9K,\" Feb. 3, 2021", "Monroe Journal, \"Judge rules for new Aberdeen Ward 1 alderman election,\" March 1, 2021", "Monroe Journal, \"Election contest filed for Aberdeen Ward 1 run-off,\" July 22, 2020", "Monroe Journal, \"Aberdeen mayor pleads guilty to embezzlement,\" Feb. 1, 2021", "WTVA-TV, \"Unofficial winners in Aberdeen Democratic primary runoff,\" June 19, 2020", "Mississippi Secretary of State, Aberdeen Democratic runoff election results certification, June 21, 2020", "Mississippi State Auditor, news release, Oct. 31, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]