["About this rating", "The Golden State Warriors were one win away from a National Basketball Association Championship when they stepped onto the court on 9 June 2017 for Game 4 of the NBA playoffs, but the Cleveland Cavaliers had other plans.", "Although one one could credit dominant performances by players such as LeBron James and Kyrie Irving for the Cavs's victory, a few questionable officiating choices led some Warriors fans to place the blame squarely on the shoulders of NBA referees. This gave The Kicker, a satirical sports web site, ample opportunity to lampoon the refs.", "The web site published multiple stories about NBA referees — one claimed that they played in a regular Bingo game with the Cavaliers' Kyle Korver, while another reported that they arrested all members of the Cleveland team. But evidently, the most believable story was their claim that NBA refs received a $10 million bonus after the series went to Game 5:", "The utterly impartial referees were rewarded for their dispassionate and equal-sided officiating in a Finals series that looked as if it was heading to a four-game sweep with a $10 million bonus.", "“Is this an incentive to give the team that’s down 3-0 a bit of a boost by handing out technical fouls like a busy suburban family handing out Snickers bars on Halloween? No, I don’t think so,” NBA commissioner Adam Silver said.", "This is not a genuine news item, nor is this an accurate quote from NBA commissioner Adam Silver. The Kicker is a satire web site that is part of the Above Average comedy network.", "Although the web site does not contain a disclaimer specifically stating that its content is fictional, the publication's humorous intent is noted in several locations. For instance, at the bottom of this article is a joke stating that the site's author's \"can't play sports, but (they) can make jokes about them,\" and the web site's tagline is \"For fans. For fun.\"", "The alleged quote from Silver does not appear in any credible publication.", "The story about NBA referees being awarded a $10 million bonus after the NBA Finals extended to Game 5 is a piece of satire. However, like most satire, it is rooted in some truth; ESPN reported that the Warriors would miss out on more than $20 million if the playoffs ended after Game 4:", "The Golden State Warriors are two games from pulling off a complete sweep of the NBA playoffs, something that has never been done. It would be a tremendous accomplishment, but it could also prove costly.", "Team executives have said in the past that they'd rather win than think about the money they're leaving on the table by not taking a series longer. But the money is hardly something to sneeze at.", "In fact, a Game 5 in Oakland alone comes close to paying Steph Curry's salary for the entire 2016-17 season: $12.1 million. All told, sweeping the series in Cleveland and not returning twice to the Bay Area, as the Warriors did last year for Games 5 and 7, would cost the Warriors' ownership group more than $22 million.", "Vardon, Joe.   \"Referees Say 'My Bad' Over Mysterious Draymond Green Technicals Situation in NBA Finals.\"\r\n    Cleveland.   10 June 2017.", "Rovell, Darren.   \"How much would a sweep cost the Warriors? Try $22M.\"\r\n    ESPN.   7 June 2017.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]