["“In 2017, we recorded an inflow of foreign direct investment amounting to R17 billion.”", "“The World Bank's annual Doing Business Report currently puts South Africa number 82 out of 190 countries that they have tracked with regard to being able to do business in an efficient way.”", "“Over the past five years, we’ve made significant progress with the provision of infrastructure. More than R1.3 trillion has been invested.”", "“ Over the past five years..more than R1.3 trillion has been invested to build [infrastructure including] hundreds of thousands of new homes...”", "“Over the past five years... more than R1.3 trillion has been invested to build [infrastructure including electrifying] more than a million homes.”", "“We have launched the Youth Employment Service, which is placing unemployed youth in paid internships in companies across the country.”", "“Every month 17.5 million social grants are provided to South Africans.”", "\"Over 700,000 children [accessed] early childhood education in the last financial year...\"", "“Over the past five years… [we’ve built] two new universities.”", "“We launched the Safe initiative in August last year...”", "“... Since we launched the initiative, 699 schools have been provided with safe and appropriate sanitation facilities and projects and a further 1,150 schools are either in planning, design or construction stages.”", "“In the past year we had 10 million tourists who came to our country, which is a huge increase .”", "Please complete this form to receive the HTML sharing code.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "For democracy to function, public figures need to be held to account for what they say. The claims they make need to be checked, openly and impartially. Africa Check is an independent, non-partisan organisation which assesses claims made in the public arena using journalistic skills and evidence drawn from the latest online tools, readers, public sources and experts, sorting fact from fiction and publishing the results.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "© 2023 - Africa Check - All rights reserved.", "We will never charge you for verified, reliable information. Help us keep it that way by supporting our work.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "Support independent fact-checking in Africa."]