["Citizen TV, Kenya’s largest station by viewership, reported the forecasts in a story noting “Kenya’s last recession was recorded in 1992.”", "In a report on a recent World Bank review of Africa’s economic prospects, the Citizen TV website claimed that Kenya’s last recession was in 1992.", "A recession is defined as an economic contraction over six months, or two consecutive quarters of the year. Kenya only started reporting quarterly fluctuations in its economy in the year 2000.", "According to the country’s statistics bureau, Kenya’s most recent recession was in 2002, when GDP fell in both the second and third quarters.", "Kenya was one of a clutch of African countries whose 2020 economic growth could “remain positive” even as it slowed substantially, the World Bank said in its biannual review of the continent’s prospects.", "This was because their economies were “more diversified” and less reliant on natural resources, the development lender said in its October 2020 edition of Africa Pulse.", "Citizen TV, Kenya’s largest station by viewership, reported on the forecasts in a website story headlined “Kenya tipped to escape recession on economic diversity”.", "It noted: “Kenya’s last recession was recorded in 1992.” Is this accurate?", "When Africa Check asked the station for the source of its claim, Citizen TV directed us to a World Bank chart plotting changes in Kenya’s gross domestic product, or GDP, since 1961. GDP measures the size of a country’s economy. It is the market value of all goods and services produced in a given period, usually a year.", "The bank’s data shows that in 1992, GDP contracted by -0.8%. But the chart does not not give GDP figures for each quarter – three months – of the year. Africa Check has previously looked into the definition of a recession and most experts we spoke to agreed it was two or more consecutive quarters of negative growth.", "The Kenya National Bureau of Statistics (KNBS) also defines a recession as “two consecutive quarters” of negative GDP growth, Benjamin Muchiri, the bureau’s senior manager of national accounts, told Africa Check.", "Kwame Owino, chief executive of the Institute of Economic Affairs, a Kenyan think tank, said the best data on historical economic growth would be in the statistics bureau’s annual economic surveys.", "According to the bureau's 1993 economic survey, Kenya’s economy grew by 0.4% in 1992 – better than the World Bank’s -08% contraction. But the survey also does not break this growth down by quarters.", "Muchiri explained why. “The earliest quarterly GDP available for Kenya is around 2000 and therefore we cannot tell from KNBS quarterly statistics if there were any two consecutive quarterly GDP contractions in 1992,” he said.", "“However, the year's real GDP growth rate was 0.4%, raising the possibility that there were contractions in more than one quarter.” But more research would be required to establish if this was indeed the case, he said.", "Annual KNBS data shows that since 1990, Kenya’s economy has contracted in only one year – in 2000, when it shrank by -0.3%. In 2002 this was revised to -0.2%. (Note: GDP figures are routinely restated as new economic data becomes available.)", "But the bureau’s quarterly data, from 2000 on, reveals that Kenya last recorded a recession in 2002. “We had two consecutive contractions in 2002, of -1.2% in the second quarter and -2.5% for the third quarter,” Muchiri said.", "This data appears in the bureau’s first quarterly GDP report for 2007. But the contractions were for GDP at market prices. When inflation is taken into account, giving real GDP, the contractions were -1.7% and -2% respectively.", "Because both seasonally adjusted and non-adjusted figures were “showing a recession, there is no contradiction”, Muchiri told Africa Check.", "While we have not seen data that proves or disproves that Kenya’s last recession was in 1992, official data does show there was one 10 years later. We therefore rate Citizen TV’s claim as incorrect.", "Reporting on a World Bank economic forecast for Africa, Kenya's largest TV station claimed on its website that the country last posted a recession, or two consecutive quarters of negative growth, in 1992.", "While a recession may or may not have been recorded in 1992, the country’s national data agency told Africa Check it did not have quarterly data for the years before 2000.", "Its earliest available official quarterly data shows Kenya’s most recent recession was in 2002.", "Further reading:", "https://africacheck.org/2018/09/21/analysis-when-is-a-recession-not-a-recession/", "Please complete this form to receive the HTML sharing code.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "For democracy to function, public figures need to be held to account for what they say. The claims they make need to be checked, openly and impartially. Africa Check is an independent, non-partisan organisation which assesses claims made in the public arena using journalistic skills and evidence drawn from the latest online tools, readers, public sources and experts, sorting fact from fiction and publishing the results.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "© 2023 - Africa Check - All rights reserved.", "We will never charge you for verified, reliable information. Help us keep it that way by supporting our work.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "Support independent fact-checking in Africa."]