["The first four of more than 500 police, firemen and deputy sheriffs in St. Joseph County to receive Asian flu vaccine bare their arms for Dr. William J. Stogdill in South Bend, Ind., on Aug. 30, 1957. (AP)", "Most of the numbers listed in the post are wrong.", "Regardless, it’s too soon to compare the number of COVID-19 deaths to deaths from longer-running pandemics.", "A Facebook user suspecting a conspiracy suggests that despite global shutdowns to stem COVID-19 spread , this virus isn’t as deadly as four other historic outbreaks.", "\"In 1957, Asian flu killed 1 million people. In 1968, Hong Kong flu killed 1 to 4 million people. Swine flu caused 18,000 deaths, bird flu caused 75,000 deaths,\" the April 6, 2020, post says. \"All these viruses killed more people than coronavirus and yet they've never, ever shut anything down. So, what are the government not telling the public? Or, am I the only one confused by this?\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "As for the number of deaths, the numbers in the Facebook post are correct with respect to one outbreak. All of the other numbers are largely inaccurate.", "More importantly, it is too early to say what the final death toll will be for COVID-19. The pandemic is still raging and hasn’t run nearly as long as the other four outbreaks.", "\"The coronavirus pandemic has just begun,\" Dr. Amesh Adalja, an infectious diseases specialist at Johns Hopkins University’s Center for Health Security. \"The numbers for the influenza pandemics are their complete impact over a full season and therefore not comparable to the numbers that have accrued thus far for the coronavirus pandemic.\"", "We’ll cite the outbreaks as they are referred to by the federal Centers for Disease Control and Prevention.", "This new influenza A, known as the Asian flu, was first reported in Singapore in February 1957, Hong Kong in April 1957 and in coastal cities in the United States in summer 1957, according to the CDC.", "Total estimated deaths: 1.1 million, roughly what the Facebook post claims, including 116,000 in the United States.", "What the post calls the \"Hong Kong flu\" was an influenza A that is believed to have originated in Hong Kong and was first noted in the United States in September 1968, according to the CDC.", "Total estimated deaths, according to the CDC: 1 million, including 100,000 in the United States.", "The post claimed the figure was 1 million to 4 million, a range Britannica.com also uses. The encyclopedia doesn’t cite a source for that range. Other sources, including GlobalSecurity.org, refer to 1 million deaths or in the range of 750,000 to 1 million deaths (Medscape medical website, Nieman Foundation for Journalism).", "The H1N1 influenza virus was discovered in the United States in the spring of 2009 and spread around the world. The World Health Organization declared an end to the pandemic in August 2010, according to the CDC. It was originally referred to as \"swine flu\" because many genes in the virus were similar to influenza viruses that normally occur in pigs in North America.", "Total estimated deaths: 151,700 to 575,400, far more than the 18,000 claimed in the post. An estimated 12,469 deaths occurred from April 2009 to April 2010 in the United States.", "What the post refers to as \"bird flu\" was not a pandemic and is an outlier in this context. Says the CDC: Avian influenza A outbreaks occur in poultry from time to time, and some of those outbreaks have been associated with illness and death in people in Asia, Africa, Europe, the Pacific, and the Near East. \"While very rare, some avian influenza A viruses have also caused illness in people in North America.\"", "The post claims 75,000 deaths from bird flu. But only 455 human deaths from avian influenza A (H5N1) were reported to the World Health Organization from 2003 to Jan. 20, 2020. None of the deaths were in the United States.", "The coronavirus surfaced in China in late December. According to the World Health Organization, there were 67,594 deaths, including 8,358 in the United States, as of April 6, 2020, the date of the Facebook post.", "There were 1,210,956 confirmed cases globally as of that date, which creates a case fatality rate of 5.6%.", "That’s up from a 3.4% rate cited by Tedros Adhanom Ghebreyesus, the World Health Organization’s director-general, at a news conference on the coronavirus on March 3, 2020.", "So far, it’s dramatically higher than the case fatality rates for the three pandemics listed in the Facebook post, all of which were in a range of 0.5% or less, according to the New England Journal of Medicine and Yanzhong Huang, senior fellow for global health at the Council on Foreign Relations and director of the Center for Global Health Studies at Seton Hall University.", "But the rate can vary considerably during an outbreak, the World Health Organization told us.", "At this relatively early stage, estimating the case fatality rate is difficult for several reasons, according to an article The Lancet, a British medical journal:", "The virus and its clinical course are new, and we still have little information about them.", "Health care capacity and capability factors, including the availability of health-care workers, resources, facilities, and preparedness, affect outcomes.", "An unknown number of COVID-19 cases are uncounted, including people with the virus who don’t have symptoms, or people who are misdiagnosed.", "A Facebook post that questions the lethality of COVID-19 cites specific figures in claiming that the Asian, Hong Kong, swine and bird flus each \"killed more people than coronavirus.\"", "The post is correct on the number of people killed only for the Asian flu.", "What the post calls the Asian, Hong Kong and swine flus each killed more people worldwide than COVID-19 has so far. But raw-number comparisons are meaningless, given that those pandemics each ran well over a year, and the COVID-19 outbreak is only four months old.", "We rate the statement False.", "Facebook, post, April 6, 2020", "Lead Stories, \"Fact Check: Comparing Other Virus Death Counts To COVID-19 Does NOT Signal Government Secrets Hoax Alert,\" April 9, 2020", "New England Journal of Medicine, \"A Novel Coronavirus Emerging in China — Key Questions for Impact Assessment,\" Feb. 20, 2020", "Centers for Disease Control and Prevention, \"1957-1958 Pandemic (H2N2 virus),\" Jan. 2, 2019", "GlobalSecurity.org, \"1968 Hong Kong Flu,\" accessed April 14, 2020", "Centers for Disease Control and Prevention, \"Avian flu past outbreaks,\" April 10, 2017", "Email, Dr. Amesh Adalja, infectious diseases specialist at Johns Hopkins University’s Center for Health Security, April 13, 2020", "Centers for Disease Control and Prevention, \"1968 Pandemic (H3N2 virus),\" Jan. 2, 2019", "CNBC, \"The coronavirus may be deadlier than the 1918 flu: Here’s how it stacks up to other pandemics,\" March 26, 2020", "Emerging Infectious Diseases, \"Influenza Pandemics of the 20th Century,\" January 2006", "Email, Carla Drysdale, World Health Organization communications officer, April 13, 2020", "Britannica.com, \"1968 flu pandemic,\" March 25, 2020", "Emerging Infectious Diseases, \"Estimating Risk for Death from 2019 Novel Coronavirus Disease, China, January–February 2020,\" June 2020", "Wall Street Journal, \"Is the Coronavirus as Deadly as They Say?\" March 24, 2020", "PolitiFact, \"Donald Trump wrong saying Barack Obama did nothing about swine flu,\" March 6, 2020", "Medscape, \"What are the mortality rates associated with influenza?\" Jan. 8, 2020", "World Health Organization, \"Cumulative number of confirmed human cases for avian influenza A(H5N1) reported to WHO, 2003-2020,\" Feb. 28, 2020", "World Health Organization, \"Coronavirus disease 2019 (COVID-19) Situation Report – 77,\" April 6, 2020", "World Health Organization, \"WHO Director-General's opening remarks at the media briefing on COVID-19,\" March 3, 2020", "Journal of Infectious Diseases, \"Global Mortality Impact of the 1957-1959 Influenza Pandemic,\" March 2016", "Email, Christian McMillen, University of Virginia history professor and author of \"Pandemics: A Very Short Introduction,\" April 11, 2020", "The Lancet, \"The many estimates of the COVID-19 case fatality rate,\" March 27, 2020", "The Lancet, \"Estimates of the severity of coronavirus disease 2019: a model-based analysis,\" March 30, 2020", "Email, Yanzhong Huang, senior fellow for global health at the Council on Foreign Relations and director of the Center for Global Health Studies at Seton Hall University, April 11, 2020", "Nieman Foundation for Journalism at Harvard University, \"A Century of Flu Pandemics,\" accessed April 14, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]