["By Vanessa Schipani", "Posted on May 6, 2016", "During floor addresses urging Congress to act on President Obama’s $1.9 billion request for emergency funds to combat the Zika virus, a number of senators made claims that were either misleading or lacked context:", "Prior to 2015, Zika outbreaks had occurred in regions of Africa, Southeast Asia and the Pacific Islands, according to the Centers for Disease Control and Prevention. But in May 2015, the Pan American Health Organization confirmed locally transmitted Zika infections in Brazil. There are now 45 countries and territories worldwide with active Zika transmission, according to the CDC, including Puerto Rico and the U.S. Virgin Islands.", "Scientists believe Zika spreads in three ways – through mosquito bites, via sexual contact with a male, or from mother to child during pregnancy. The virus may also be spread through blood transfusions. The CDC points to two species of mosquito – Aedes aegypti and Aedes albopictus– as the main culprits of Zika transmission, though experts are unsure about Aedes albopictus and its capacity for spreading Zika. Commonly called the yellow fever and Asian tiger mosquitoes respectively, these insects also spread the dengue and chikungunya viruses.", "Previously thought to be a harmless virus that causes no symptoms in most cases, Zika can lead to microcephaly and other birth defects, the CDC recently confirmed. Microcephaly is a neurological condition where an infant is born with an abnormally small head and often incomplete brain development.", "Zika also “very likely” triggers Guillain-Barré syndrome, a condition that causes muscle weakness and sometimes paralysis, says the CDC. Most people fully recover from GBS, which is also likely triggered by other infections, but some have permanent damage. About 5 percent of people with the condition have died from it.", "In a Feb. 22 letter to House Speaker Paul Ryan, President Obama asked Congress to consider a $1.9 billion request for emergency funds “to respond to the Zika virus both domestically and internationally.” Obama’s proposal includes using the money to develop vaccines, therapeutics and diagnostics for Zika as well as provide aid to U.S. states and territories for health services and mosquito control.", "Republican leaders in Congress have yet to act on Obama’s request. This brought many Democratic senators and Sen. Marco Rubio, a Republican from Florida, to the Senate floor on April 28 to urge action before the mosquito season reaches its peak in summer.", "But Senate Majority Whip John Cornyn, a Republican from Texas, argued (at 37:25 in the video) that Obama’s proposal should go through the regular channels. “It doesn’t take a lot of thought to realize that this is a request for a blank check without regard for the accountability that comes from what we call the regular order here — the appropriations process in the Senate,” he said during his floor address.", "We take no position on whether Obama’s proposal provides enough accountability – that is, whether it outlines in enough detail how the $1.9 billion in emergency funds will be spent. We also take no position on whether his funding request should go through regular or emergency channels. But we can provide context for the claim that there have been “900 cases of Zika” on “American soil.” We can also say it’s unlikely that Zika “will be everywhere in the United States,” as Heitkamp claimed.", "During her Senate floor address, Heitkamp used (at 8:55) the following anecdote in an effort to convince Congress to pass Obama’s funding request:", "Heitkamp, April 28: I don’t think a lot of people in the United States of America would call the state of North Dakota the tropics. I hold up today the first noted case of a pregnant woman who’s been infected by Zika. She was travelling, probably bitten by a mosquito, somehow contracted the Zika virus. She will now live in fear that the baby she’s carrying will suffer the birth defects that we know are associated with this potential pandemic. Where’s the answer for her? The answer that the North Dakota epidemiologist gave for her, which is good advice, is don’t travel anywhere where we have Zika virus infections. I guess she’s not leaving her house because the way this is spreading, and the way this is moving, that will be everywhere in the United States of America.", "During his floor address, Rubio similarly claimed (at 43:40) Zika “can be in any state in the country, any state in the country. … I hear it’s only in certain states that are warm – that’s not true. It can be in any state in the country.”", "But public health officials and scientists currently project otherwise. During a recent interview with Tom Frieden, head of the CDC, Time reporter Alexandra Sifferlin asked, “Puerto Rico is expected to get hit hard with Zika. But experts are saying it won’t likely spread widely in the continental U.S. Why?” Frieden responded by noting the differences in infrastructure between the continental U.S. and Puerto Rico:", "Frieden, April 21: The way Zika spreads is primarily through the bite of the Aedes aegypti mosquito in places that don’t have screens and air-conditioning. So while we anticipate that there could be local clusters of Zika in the United States – and there have already been several sexually transmitted cases of Zika – widespread transmission generally occurs in places with many more of these types of mosquitoes and much less air-conditioning and screening.", "In an April 30 interview with CNBC, Denise Jamieson, chief of the women’s health and fertility branch of the CDC, also said, “We know from other related diseases that are carried by same mosquitoes, that we are likely to see a small number of cases in the continental United States.”", "Likewise, Reuters reported on April 17 that Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases, “expected to see someone bitten by a mosquito [in the U.S.] contract Zika but did not expect a large number of people to fall ill.” Fauci told Reuters: “It would not be surprising at all – if not likely – that we’re going to see a bit of that. We’re talking about scores of cases, dozens of cases, at most.”", "A paper published in the Lancet on Jan. 14 states that “Argentina, Italy, and the USA have more than 60% of their populations residing in areas conducive to seasonal Zika virus transmission.” To come up with this projection, Kamran Khan, an infectious disease expert at the University of Toronto, and others adapted seasonal models for the dengue virus to Zika, as Aedes aegypti transmits both viruses.", "This doesn’t mean 60 percent of the U.S. population will get Zika – it means that 60 percent of the population live in areas where mosquitoes that transmit the virus tend to thrive during the summer. The CDC provides maps for the estimated ranges of Aedes aegypti and Aedes albopictus in the U.S. These mosquitoes primarily thrive in the southern U.S. states and Puerto Rico, and thus, do not tend to live in all 50 states.", "Yet, according to the Annenberg Science Knowledge survey conducted in March, “44 percent of respondents incorrectly thought that the mosquito that carries Zika can be found in every state of the continental United States.”", "The CDC does note that its maps “are not meant to represent risk for spread of disease” because the shaded areas don’t show the exact locations or quantities of mosquitoes – just the best estimate of the insects’ potential range. In fact, in his interview with Time, Frieden urged Congress to pass Obama’s $1.9 billion proposal, in part, to improve these mosquito surveillance maps.", "But the CDC also states that “areas with past outbreaks of chikungunya and dengue are considered at higher risk for Zika. These include U.S. territories like Puerto Rico, the U.S. Virgin Islands, and Guam. Local outbreaks have also been reported in parts of Hawaii, Florida, and Texas.” But overall, “dengue rarely occurs in the continental United States,” says the CDC. The same goes for chikungunya.", "In order for an outbreak to occur in the continental U.S., four things must happen, says the CDC: (1) People infected with Zika must enter the U.S. (2) The mosquitoes that transmit the virus must bite an infected person during the first week of infection when Zika can be found in the person’s blood. (3) The infected mosquito must live long enough for the virus to multiply and for it to bite another person. (4) This cycle must repeat multiple times to start an outbreak.", "In other words, just having people with Zika return to the U.S. is not enough — the mosquitoes must also do their part. And in regions where the mosquitoes are less likely to thrive, there’s less of a chance for this cycle to repeat enough times to cause an outbreak.", "But what about sexual transmission leading to outbreaks? Much is still not known about Zika transmission via sexual contact. But Sifferlin at Time also asked Frieden, “Is it possible that Zika is transmitting more via sex than we currently realize?” He responded by stating, “Not in the U.S. I think we would know it was doing that in the U.S. … The cases we’ve seen have all been from men around the time they were symptomatic. It doesn’t suggest that it’s likely to have been a major cause of the number of cases.”", "Overall, conclusively predicting the spread of Zika is difficult because of the countless variables involved, including mosquito behavior, human behavior and seasonal variation. But based on current estimates, public health officials and scientists don’t believe Zika will be “everywhere in the United States of America,” as Heitkamp claimed.", "During their April 28 Senate floor addresses, a few Democrats also cited the CDC’s April 20 statistics on U.S. Zika cases. But several of them also failed to provide details on how, where and to whom these cases apply.", "For example, Sen. Elizabeth Warren from Massachusetts said “nearly 900 cases of Zika have already been reported on American soil.” Likewise, Sen. Barbara Mikulski from Maryland said that “there have been close to 900 cases confirmed in the United States of America.” Sen. Patty Murray from Washington state similarly said “the CDC reported nearly 900 cases of Zika here in the United States and three U.S. territories.”", "To be clear, the total number of cases they cite is correct. As of April 20, the CDC reported 891 cases of Zika in U.S. states and territories. On May 4, the CDC updated its numbers to reflect an increase of 242 Zika cases in the United States, bringing the total to 1,133.", "Here’s a bit more context on the latest numbers: Out of those 1,133 cases, 472 were travel-associated cases in the continental U.S., the CDC reported. These individuals caught Zika when they were visiting active Zika transmission regions or via sexual contact after their partner traveled to an active Zika zone and caught the virus. Of these 472 cases, 44 were pregnant women, 10 were by sexual contact, and one individual developed GBS.", "As of May 4, the CDC reported that no individuals had acquired Zika from mosquitoes located in the continental United States.", "Conversely, U.S. territories reported only three travel-related cases and 658 locally acquired cases. The vast majority of these local cases (629) have occurred in Puerto Rico. American Samoa and the U.S. Virgin Islands also reported 14 and 15 local cases, respectively. Puerto Rico and the Virgin Islands also have confirmed two and one travel-related cases, respectively. Out of the 661 total cases in U.S. territories, 59 occurred in pregnant women, and five people have developed GBS. As of April 29, there also has been one Zika-related death in Puerto Rico, according to CNN and other news outlets.", "As for the case Heitkamp referenced in North Dakota, Laura Cronquist, an epidemiologist at the North Dakota Department of Health, told us by email that the pregnant woman didn’t have symptoms, but did test positive for the Zika virus. Thus, she was considered an “asymptomatic Zika virus infection,” but not a “case” of Zika. The CDC defines a case as an individual having symptoms AND testing positive for the virus. We reached out to the CDC for comment on this, but haven’t heard back.", "During her floor address, Sen. Amy Klobuchar from Minnesota was off slightly on the Puerto Rico numbers (474), but more precisely explained that “the virus has already infected nearly 400 Americans who have traveled abroad from 40 states, including my home state of Minnesota. Over 500 people in Puerto Rico have the disease. Nearly all of them contracted the virus locally.”", "As we’ve already said, projections are never definite, but experts believe Puerto Rico will be hit harder by the virus than the continental U.S. this summer, much like the numbers above indicate. For this reason, the senators and politicians could have provided more context when they noted nearly 900 cases of Zika in the United States.", "Editor’s Note: SciCheck is made possible by a grant from the Stanton Foundation.", "https://www.sharethefacts.co/share/46c6675b-568f-48cf-b86f-3f7329f69cb1", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]