["By Caroline Wallace", "Posted on April 21, 2017", "Q: Did the Supreme Court rule that public schools cannot teach students about Islam?", "A: No. That false claim was spread by a network of fake news websites.", "Did the Supreme Court just shut down the teaching of Islam in our schools? Did Judge Gorsuch cast the deciding vote?", "No, the Supreme Court hasn’t decided that students can’t be taught about Islam in public schools. On April 11, fake news websites began publishing a bogus story that said “[t]he court ruled 5-4, with Justice Gorsuch casting the tie-breaker, that the only Islam taught to our children in public schools will be the history of Radical Islam and what they can do to help stop it.”", "It alleged that newly installed Justice Neil Gorsuch wrote the majority opinion, and then provided a faux excerpt that was filled with errors: “We should [sic] be teaching any religions in this country besides standard Judeo-Chritianity [sic], as our founders wanted, and we certainly shouldn’t be filling the children with lies about Islam being a ‘religion of peace’ when they see the carnage on the news almost every day.”", "Suspicious Facebook users have rightly flagged the bogus story as potentially fake, using the social media site’s improved tools for reporting a hoax.", "Gorsuch hasn’t yet authored an opinion for the court. He was confirmed by the Senate on April 7 and was sworn in on April 10. He didn’t hear his first cases as a member of the court until April 17, nearly one week after the fake news story began circulating. And the court’s hearings list for the session beginning April 17 doesn’t include any cases dealing with Islam being taught in public schools.", "The made-up story originated on a website known as the Resistance, or America’s Last Line of Defense. The headline was “BREAKING: First Full Supreme Court Ruling in Over a Year Has Obama FURIOUS.”", "The Resistance, as we’ve written before, admits to pushing fake news on its website. A disclaimer on its “about us” page says: “The Resistance may include information from sources that may or may not be reliable and facts that don’t necessarily exist. All articles should be considered satirical and any and all quotes attributed to actual people complete and total baloney. Pictures that represent actual people should be considered altered and not in any way real.”", "Other fake news websites picked up the phony story and posted it with the same text under different headlines, such as “Supreme Court rules against Islam being taught in public schools.”", "For the record, the court long ago established in the 1963 case Abington School District v. Schempp that teaching public school students about religion was acceptable.", "At the time, Associate Justice Tom Clark wrote in his majority opinion: “It might well be said that one’s education is not complete without a study of comparative religion or the history of religion and its relationship to the advancement of civilization. It certainly may be said that the Bible is worthy of study for its literary and historic qualities. Nothing we have said here indicates that such study of the Bible or of religion, when presented objectively as part of a secular program of education, may not be effected consistently with the First Amendment.”", "The court has not voted to change that.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to help identify and label viral fake news stories flagged by readers on the social media network.", "De Vogue, Ariane and Dan Berman. “Neil Gorsuch confirmed to the Supreme Court.” CNN. 7 Apr 2017.", "Totenberg, Nina. “Justice Gorsuch Finds His ‘Easier’ Solution Has Few Takers On 1st Day.” NPR. 17 Apr 2017.", "Supreme Court of the United States. 2016 Term Opinions of the Court. Accessed 19 Apr 2017.", "Supreme Court of the United States. Hearing List for the Session Beginning April 17, 2017.  Accessed 19 Apr 2017.", "Haynes, Charles, and Thomas, Oliver. “Finding Common Ground: A First Amendment Guide to Religion and Public Schools.” First Amendment Center. 2007.", "First Amendment Center. “Is it Constitutional to Teach about Religion in a Public School?” Newseum Institute. Accessed 19 Apr 2017.", "First Amendment Center. “Teaching about Religion.” Newseum Institute. 16 Sep 2002.", "Brown, Matthew. “Supreme Court ruling 50 years ago set modern course for religion in public schools.” Deseret News. 14 Jun 2013.", "American Civil Liberties Union. “Joint Statement of Current Law on Religion in the Public Schools.” Accessed 20 Apr 2017.", "School District of Abington Township, Pennsylvania v. Schempp. 374 U.S. 203. Supreme Court of the United States. 1963.", "Stryker. “BREAKING: First Full Supreme Court Ruling In Over A Year Has Obama FURIOUS.” America’s Last Line of Defense. 11 Apr 2017.", "A. D. “Supreme Court Decides The Fate Of Islam Taught In Public Schools.” The Federalist Tribune. 13 Apr 2017.", "Alexandra. “Supreme Court Rules Against Islam Being Taught in Public Schools.” Blue Vision POST. Accessed 19 Apr 2017.", "America’s Last Line of Defense. “About Us.” Accessed 19 Apr 2017.", "Gross, Zachary. “Phony Prayer Rug Story.” FactCheck.org. 24 Jan 2017.", "FactCheck.org Rating:", "Read More", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]