["About this rating", "Kroger sent letters to some employees stating that they had been overpaid emergency pay during the pandemic and must pay it back.", "According to a company spokesperson, Kroger is no longer requiring employees to repay the money.", "It's unclear why the letters went out in the first place or what the specific source of the issue/problem was.", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "In late May 2020, Snopes readers submitted screenshots of a letter purportedly sent from Kroger grocery stores to an employee amid the COVID-19 coronavirus pandemic. The letter claimed that the worker had been \"overpaid your Emergency Pay in the gross amount of $461.60.\" Readers asked whether the letter was authentic.", "Grocery store workers have been deemed an essential part of the workforce during the pandemic. Their close contact with the public has also placed in them in harm's way, and some have died as a result. Kroger and other large grocery store chains have come under scrutiny for how they treat workers during the ongoing pandemic.", "In March 2020, the store chain announced that workers officially diagnosed with COVID-19 could qualify for 14 days emergency sick leave. But some criticized that move as insufficient. Shortly after, Kroger announced it would expand the paid sick leave to include employees who were simply experiencing COVID-19 symptoms, or who were self-isolating to protect themselves from the illness.", "But two months after these announcements, some employees reported receiving letters from Kroger stating that they were \"overpaid\" under the coronavirus emergency leave policy. Basically, that meant they had taken time off from work under the policy, but that Kroger had retroactively deemed them to have not met the qualifications to do so, according to Jonathan Williams, communications director for United Food and Commercial Workers (UFCW) Local 400, the labor union representing the workers. It's unclear why the company deemed those employees unqualified for the pay.", "One such letter was posted on social media (as pictured above), went viral, and resulted in another round of outrage directed at Kroger. A spokeswoman for Kroger confirmed to Snopes via email that the company did send letters to a \"small number of associates,\" but that the grocery store chain would no longer be requiring those employees to pay for the sick leave taken.", "In a statement, Williams said UFCW Local 400 was glad to hear that Kroger changed course on collecting what it described as overpay but added the union \"will also investigate any incidents in which a member may have already paid some money back to the company to ensure they are made whole. We are pleased Kroger has come to its senses. Now they can focus their attention on extending 'hero pay' until this crisis is over.\"", "\"Hero pay\" refers to an extra $2 an hour that had been added to Kroger employees' paychecks as a form of hazard pay associated with working during the pandemic. Kroger ended the extra pay on May 17.", "Because Kroger did send letters to some employees stating they were required to return what was described as overpaid emergency pay, but changed course and stated this repayment was no longer required, we rate this claim \"Mixture.\"", "Jaffe, Sarah. \"What Happened to Kroger’s 'Hero Pay'?\"\r\n  Dissent Magazine. 14 May 2020.", "Coolidge, Alexander. \"Oops: Kroger Overpaid Some Workers and Demanded Repayment, Now Says 'Nevermind'.\"\r\n  Cincinnati Enquirer. 19 May 2020.", "Bhattarai, Abha. \"‘It Feels Like a War Zone’: As More of Them Die, Grocery Workers Increasingly Fear Showing Up at Work.\"\r\n  Washington Post. 12 April 2020.", "Kroger. \"Kroger Family of Companies Announces Appreciation Bonus for Associates and Expands 14-Day COVID-19 Emergency Leave Guidelines.\"\r\n  21 March 2020.", "Gibson, Kate. \"Kroger Ending $2 an Hour 'Hero Pay' Bonus for Workers.\"\r\n  CBS News. 12 May 2020.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]