["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "On CNN, former Obama administration budget director Peter Orszag said Medicare spending is actually lower than it was a year ago -- a break with history. We checked to see if he was correct.", "There’s broad agreement that one of the biggest challenges for the nation’s future fiscal health is rising federal spending on Medicare, the health insurance program for Americans age 65 and older. That’s why a recent claim that the costs are slowing down caught our attention.", "On the Dec. 15, 2013, edition of CNN's State of the Union, Peter Orszag said, \"Medicare costs have slowed down dramatically. In fact, the first two months of this fiscal year, Medicare costs were down even in nominal terms relative to the previous year.\" Orszag is the former director of the Office of Management and Budget for President Barack Obama.", "We wondered whether this was correct. Earlier this year, the Congressional Budget Office -- Congress’ nonpartisan budget-analysis arm -- projected that the cost of Medicare would rise (from 3 percent of gross domestic product today to 4.9 percent of GDP in 2038) due in large part to the aging of the baby-boom generation.", "So Orszag’s claim that Medicare costs are slowing down is notable and surprising.", "Initially, we had trouble finding monthly data for Medicare expenditures, but when we contacted Orszag, he pointed us to a CBO document, the \"Monthly Budget Review for November 2013.\" (Orszag knows his CBO documents -- before taking the reins of OMB, he was CBO’s director.)", "In the document Orszag cited, CBO reported that, according to preliminary data, outlays for Medicare fell from $101 billion in October-November 2012 to $96 billion in October-November 2013. And the year-on-year decline was actually a little bit bigger once CBO smoothed out some calendar oddities.", "This fits the bill for what Orszag claimed -- a year-over-year decline in \"nominal\" Medicare costs. In fact, Orszag told PolitiFact, this decline is \"all the more remarkable because the number of beneficiaries is rising.\"", "In the meantime, while an absolute decline in Medicare expenditures is especially notable, there is evidence that something less dramatic, but still noteworthy, has been underway for even longer -- a slowing of the growth of Medicare costs. That is, Medicare expenditures have recently been rising, but at a slower rate than in the past. This isn’t as favorable for getting the federal budget into balance as an absolute decline would be, but it’s still an important step in that direction.", "This trend is documented in an August 2013 CBO working paper, written by a pair of present or former CBO health care analysts, Michael Levine and Melinda Buntin. They concluded that the growth in spending per beneficiary in Medicare’s fee-for-service program \"has slowed substantially in recent years,\" specifically from 2000 to 2010. The authors said the slowdown \"has been widespread, extending across all of the major service categories, groups of beneficiaries that receive very different amounts of medical care, and all major regions.\"", "That said, the authors noted that their understanding of why this expenditure slowdown occurred \"remains incomplete.\"", "And that is a problem that limits the usefulness of the data points Orszag offered on CNN.", "For starters, past performance does not equal future performance, noted Joseph Antos, a health care specialist at the conservative American Enterprise Institute. The pattern Orszag cites \"does not mean a slower trend will last,\" Antos said.", "And while Gail Wilensky, who headed Medicare and Medicaid under President George H.W. Bush, said she sees the recent data as a positive development, she added wistfully, \"If only anyone knew why and whether it will last.\"", "Orszag doesn’t dispute their words of caution. \"I agree it's unclear how long it will last, but I am more hopeful than some others,\" he said, arguing that the decline in expenditures is \"consistent with major structural changes in the sector that I see happening every day. ... The bottom line is that it's not guaranteed to continue, but it's a huge deal if it does.\"", "Our ruling", "Orszag said, \"Medicare costs have slowed down dramatically. In fact, the first two months of this fiscal year, Medicare costs were down even in nominal terms relative to the previous year.\" He’s right about the nominal decline in total Medicare expenditures over the past year, and he’s right that per-beneficiary spending declined broadly between 2000 and 2010. Determining the reasons why it’s happening remains a work in progress, but that doesn’t detract from the statement’s factual accuracy. We rate it True.", "Peter Orszag, interview on CNN's State of the Union, Dec. 15, 2013", "Congressional Budget Office, \"Monthly Budget Review for November 2013,\" Dec. 6, 2013", "Michael Levine and Melinda Buntin \"Why Has Growth in Spending for Fee-for-Service Medicare Slowed?\" (Congressional Budget Office working paper), August 2013", "Congressional Budget Office, \"Federal Spending on the Government’s Major Health Care Programs Is Projected to Rise Substantially Relative to GDP,\" Sept. 18, 2013", "Becker's Hospital Review, \"CMS: Health Spending Growth to Stay Slow in 2013,\" Sept. 18, 2013", "Health Affairs, \"National Health Expenditure Projections, 2012–22: Slow Growth Until Coverage Expands And Economy Improves,\" September 2013", "Email interview with Don McLeod, spokesman for the Centers for Medicare & Medicaid Services, Dec. 17, 2013", "Email interview with Joseph Antos, health care scholar at the conservative American Enterprise Institute, Dec. 17, 2013", "Email interview with Gail Wilensky, former head of Medicare and Medicaid under President George H.W. Bush, Dec. 17, 2013", "Email interview with Melinda B. Buntin, chair of the health policy department at Vanderbilt University School of Medicine, Dec. 17, 2013", "Email interview with Peter Orszag, vice chairman of corporate and investment banking and chairman of the financial strategy and solutions group at Citigroup, Dec. 17, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]