["By Robert Farley", "Posted on May 17, 2019", "President Donald Trump and his son Eric both took shots this week at New York City Mayor Bill de Blasio, saying crime has risen in the city under his leadership. That’s wrong, according to crime data kept by the New York Police Department.", "Major felony offenses have dropped every year de Blasio has served as the city’s mayor, according to New York Police Department data. Other felonies are down. Misdemeanors are down. Arrests are down.", "According to FBI crime data, New York City had a lower violent crime rate than all but two other cities with a population over 1 million in 2017.", "Nonetheless, in a Twitter spat with de Blasio on May 14, Eric Trump claimed that under de Blasio’s leadership “crime is up” in New York City.", "Spare me? First you have never created a job in your life. Second, our great city has gone to shit under your leadership. Crime is up, the men & women of the NYPD detest you, homelessness is rampant, our streets are dirty and people are leaving our city in record numbers. https://t.co/3Fn1glQJEa", "— Eric Trump (@EricTrump) May 14, 2019", "Two days later, de Blasio, a Democrat, announced his bid for the presidency. That prompted President Trump to sarcastically tweet that “if you like high taxes & crime, he’s your man.”", "The Dems are getting another beauty to join their group. Bill de Blasio of NYC, considered the worst mayor in the U.S., will supposedly be making an announcement for president today. He is a JOKE, but if you like high taxes & crime, he’s your man. NYC HATES HIM!", "— Donald J. Trump (@realDonaldTrump) May 16, 2019", "Whether “NYC HATES HIM! [de Blasio]” as the president claims, is a matter of opinion, of course. De Blasio was reelected mayor in 2017 with 66 percent of the vote, but according to an April Quinnipiac poll, 76 percent of New Yorkers didn’t want him to run for president, and only 42 percent approve of how he is handling his current job as mayor. .", "We’ll get to some of the other claims made by the Trumps about de Blasio’s record, but let’s start with crime in New York City, which data indicate is historically low.", "As a mayoral candidate in 2013, de Blasio vowed to end the controversial stop-and-frisk policy, a get-tough-on-crime tactic of stopping people for suspicious activity that was begun under former Mayor Rudy Giuliani and expanded under former Mayor Michael Bloomberg. As it faced court challenges, the policy was well on its way out by the time de Blasio took office in early 2014, but it was greatly reduced during de Blasio’s tenure.", "According to online “Stop, Question and Frisk” data kept by the NYPD, those kinds of stops were at nearly 700,000 in 2011, but had declined to about 192,000 in 2013, the year before de Blasio took office, and to nearly 46,000 in 2014. They continued to decline under de Blasio’s time as mayor, dipping to about 11,000 in 2018.", "Although many critics warned it would spur a return to higher crime rates, that didn’t happen.", "“Crime is definitely not up under de Blasio,” said Patrick Sharkey, a sociology professor at New York University, who created a website that tracks data on murder for large cities.", "“The best measure of crime that we have is the murder rate,” Sharkey told us. “Under de Blasio, the murder rate has stayed very consistent but overall, it has fallen slightly — it rose a bit in 2015 and 2016 and fell in 2017 and 2018. Last year was the lowest point for the city’s murder rate on record. Over 2,000 people were murdered in New York City in each year of the early 1990s, and last year there were 295 murders.", "“New York City is now one of the 3 or 4 safest big cities (500,000 or more people) in the country,” Sharkey said in an email. “Perhaps more important, de Blasio has overseen a complete transformation of policing in the city. He ended the use of stop, question, and frisk as a central tactic of policing — about 12,000 people were stopped by the NYPD last year, compared to roughly 700,000 at the peak before he took office. Arrests are down and summonses are also way down. I view the transformation of policing (and the criminal justice system) in NYC as a proof of concept for cities trying to find ways to keep violence low while also reducing the impact of the [criminal justice] system and the harm done by aggressive policing.”", "According to data from the NYPD, the total number of the seven major felony offenses — murder/manslaughter, rape, robbery, felony assault, burglary, grand larceny and grand larceny of a motor vehicle — has gradually declined every year under de Blasio’s time as mayor. Those types of crime dropped from 111,335 in 2013, the year before de Blasio took office, to 95,883 in 2018. That’s a nearly 14 percent drop.", "The number of murders, 295 in 2018, was up three from 2017, but down nearly 12 percent from the number in 2013. Robberies, burglaries, and grand larcenies and car thefts are all down. The number of felony assaults has remained about the same. And the number of rapes — 1,794 in 2018 — has gone up 30 percent since 2013.", "The total number of “Non Seven Major Felonies” is also down. Those crimes — which include possession of stolen property, forgery/identity theft, arson, sex crimes, felony drug and weapons offenses, and criminal mischief — dropped 8.6 percent between 2013 and 2018, to 52,667.", "And the number of misdemeanors declined 24.4 percent between 2013 and 2018, to 271,630. That includes possession of stolen property, drugs and weapons, as well as driving while intoxicated and criminal trespass.", "The number of arrests is also down. According to data kept by the state, total arrests in New York City have declined every year under de Blasio, going from 313,513 in 2013 to 205,556 in 2018 — a 34 percent drop. Broken down, there was a nearly 13 percent drop in felony arrests over that period and a 43 percent drop in misdemeanor arrests.", "In 2017, the latest full year available for city-specific data from the FBI’s Uniform Crime Report, New York City had the third lowest violent crime rate among the 11 cities with a population of more than 1 million. The city’s violent crime rate that year — 539 violent crimes per 100,000 population — was the lowest since at least 1985, the last year available on the UCR’s online search tool.", "“Crime rates are down for murder and most other interpersonal crimes of violence and theft (other than rapes — where the reporting rate by victims may have increased),” Andrew Karmen, a professor at John Jay College of Criminal Justice in New York City, told us via email.", "Those declines came even as de Blasio greatly scaled back “the harsh tactics pursued by Mayors Giuliani and Bloomberg for 20 years” — “excessive stopping and frisking” and “excessive arresting for minor quality of life infractions,” Karmen said.", "“In other words, even though the NYPD under de Blasio’s two [police] commissioners was compelled to cut back on the two ‘get tough’ approaches touted by Giuliani and Bloomberg as absolutely necessary to maintain public safety, the crime rates in NYC have continued to drift downward, as they have since 1990,” Karmen said. “They certainly have not shot up as hardliners predicted and as Trump has mistakenly tweeted.”", "As for Eric Trump’s claim that “people are leaving our city in record numbers,” the city’s population of 8.4 million in 2018 was nearly identical to what it was in 2013, the year before de Blasio took office, according to U.S. Census estimates. But there’s more to the story than that.", "After rising during de Blasio’s first couple years in office, New York City’s total population declined between 2016 and 2017, and again between 2017 and 2018 — the first time the city had seen a decline in total population in more than a decade.", "Although the city’s population has remained about the same during de Blasio’s time in office, the city has been “losing” people in the sense that there are more people moving out of the city than are moving in from other parts of the United States, explained Frank Donnelly,  the geospatial data librarian at Baruch College CUNY and co-author of the 2018 paper, “New Yorkers on the Move: Recent Migration Trends for the City and Metro Area.”", "But that’s not new under de Blasio. The net domestic out-migration, as it is called, is a long, historical trend, Donnelly told us via email.", "So how has the population of New York City mostly climbed over the last decade despite the net domestic out-migration? “In the 21st century this loss has been offset by natural increase (more births than deaths in the city) plus a large influx of foreign migrants,” Donnelly explained. “These outweigh any loss in domestic migration and have been the reason why NYC has been growing.”", "In the last two years, foreign immigration has dipped (from 63,223 in 2016 to just under 50,000 in 2017 and 2018) and net domestic out-migration has climbed (from 71,314 in 2013, the year before he took office, to 137,191 in 2018). “This tipped the scales from growth to loss,” Donnelly said.", "But for Eric Trump to claim that people are “leaving the city in record numbers” is embellishment, Donnelly said. “Domestic out-migration this decade hasn’t been as high as it was in the late 20th century,” Donnelly said, as “lots of young people have been moving to the city, offsetting people moving out to some degree.”", "“Most experts would agree that NYC population growth has been strong in the 21st century – certainly not the high growth you see in cities down South and out West, but exceptional for an older Northeastern city that’s built out and densely populated,” Donnelly said.", "As for Eric Trump’s claim that “you have never created a job in your life,” we assume Trump was talking about as an employer. But what about de Blasio’s record as mayor? Responding via Twitter, de Blasio said, “NYC’s jobs are at record highs.”", "We have long cautioned readers about taking boasts of all-time highs in employment with a grain of salt, that it is not such a remarkable accomplishment when the population continues to rise. We also have repeatedly warned that elected officials often get too much credit and blame for employment trends, which are often driven by forces outside their control.", "With those caveats, we note that the number of people employed in New York City increased from 4,087,900 in January 2014 — the month de Blasio took office — to 4,650,400 in April, according to the Bureau of Labor Statistics. That’s a 13.8 percent increase, better than the national 9.8 percent increase over the same period.", "The unemployment rate in New York City went from 8.1 percent in January 2014, when de Blasio took office, and has steadily declined to 4.3 percent in April. Nationally, the unemployment rate went from 6.6 percent in January 2014 to 3.6 percent in April.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]