["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Jeb Bush says that the federal government needs to start deporting criminals.", "\"The federal government right now does not deport criminals,\" he said at a town hall in New Hampshire on Aug. 19. \"I don't believe that we should take people that are here in the shadows and deport them all -- the cost of that would be in the hundreds of billions of dollars, it would rip up communities -- it's not appropriate. But criminals should be deported, and right now the Obama administration is not doing that.\"", "Bush was essentially bashing GOP frontrunner Donald Trump for his immigration plans, which include deporting millions of illegal immigrants. But is Bush correct that Obama's administration is not deporting criminals? In a word, no.", "Deportations under Obama", "The Bush campaign sent us news articles and reports including a fact-check by PolitiFact showing that tens of thousands of criminal illegal immigrants have avoided deportation. This has been a particularly hot topic since a convicted felon who had previously been deported five times murdered a woman in San Francisco this summer.", "The Atlanta Journal-Constitution has written stories about criminals who have avoided deportation. For example, a West African drifter who spent 15 years in state prison for sexually battering a woman walked out of an Atlanta jail and ignored orders to report to federal immigration authorities seeking to deport him and instead disappeared.", "The newspaper reported in May 2015 that U.S. Immigration and Customs Enforcement authorities based in Atlanta were hunting 8,647 fugitives with criminal convictions ranging from minor drug offenses to murder in Georgia, North Carolina and South Carolina.", "But while there are cases of criminals who have avoided deportation, there are still tens of thousands of people who have, in fact, been deported.", "The Immigration and Customs Enforcement, called ICE, removed 315,943 illegal immigrants in fiscal year 2014. About two-thirds were caught while attempting to cross the border, while one-third were removed from the interior.  About 85 percent of all interior removals were individuals previously convicted of a crime.", "That means that 86,923 convicted criminals were deported for a crime outside of breaking an immigration law.", "The ICE removal statistics did not provide details about the types of crimes committed, except to state that about 1 percent were suspected or confirmed gang members. We were not able to get complete data from ICE by our deadline to show what percentage of deported illegal immigrants had been convicted of felonies.", "However, the New York Times published an analysis in April 2014 based on government data obtained under the Freedom of Information Act. The newspaper found that since Obama had taken office, \"two-thirds of the nearly two million deportation cases involve people who had committed minor infractions, including traffic violations, or had no criminal record at all. Twenty percent — or about 394,000 — of the cases involved people convicted of serious crimes, including drug-related offenses, the records show.\"", "The Transactional Records Access Clearinghouse at Syracuse University published an analysis in 2014 that looked at deportations during the previous year. It found that 1,172 were deported for homicide, 3,325 for sexual assault, and 47,249 for traffic offenses.", "The deportation guidelines changed in November 2014, when Homeland Security Secretary Jeh Johnson issued a memo saying that the new top priority would include those suspected of terrorism, gang members and convicted felons. The second priority level includes those convicted of serious misdemeanors. The guidelines are more narrow and specific than the ones it replaced from 2010-11.", "The Migration Policy Institute estimated that 13 percent of illegal immigrants fall into the new priorities compared with 27 percent previously.", "These policies have come in for criticism by those who would like to see more vigorous enforcement of immigration law.", "\"It’s true that a large percentage of the people deported have criminal convictions,\" said Jessica Vaughan, an expert at the Center for Immigration Studies, which advocates for low levels of immigration. \"It’s also true that the Obama administration is choosing not to deport many convicted criminals, and also choosing to release many deportable criminals, while offering them generous due process (which they often abuse) instead of using the most efficient due process that is more likely to result in deportation.\"", "Our ruling", "Bush said, \"The federal government right now does not deport criminals.\"", "Bush points to reports that many criminal illegal immigrants have been released, and there is evidence that it sometimes happens. But it is an exaggeration to say that none are deported. Last year, ICE deported about 86,000 illegal immigrants convicted of previous crimes.", "We rate this claim False.", "U.S. Customs and Immigration Enforcement, ICE immigration removals, fiscal year 2014", "Migration Policy Institute, \"Deportation and discretion,\" October 2014", "Migration Policy Institute, \"Understanding the potential impact of executive action on immigration enforcement,\" July 2015", "Transactional Records Access Clearinghouse, \"Secure communities and ICE deportation: a failed program?\" April 8, 2014", "Congressional Research Service, \"Sanctuary jurisdictions and criminal aliens: in brief,\" July 24, 2015", "U.S. Rep. Bob Goodlatte press release, \"Implementation of Priority Enforcement Program endangers our communities,\" June 23, 2015", "U.S. Department of Homeland Security, Memo about prosecutorial discretion, Nov. 20, 1014", "New York Times, \"More deportations follow minor crimes, records show,\" April 6, 2014", "The Hill, \"DHS document: 68,000  illegal immigrants with convictions released in 2013,\" March 31, 2014", "The Hill, \"Fed data:1,400 released immigrants convicted of new crimes,\" July 14, 2015", "Washington Times, \"3,700 illegal immigrant threat level 1 immigrants released into U.S. by DHS,\" June 3, 2016", "House Judiciary Committee, Breakdown of crime data, Fiscal year 2014", "PolitiFact, \"Heritage analyst: Obama administration released 134,000 criminal aliens,\" July 16, 2015", "Atlanta Journal-Constitution, \"Secrecy clouds convicts on the lam,\" (Accessed in Nexis) May 24, 2015", "Interview, Jennifer Elzea, U.S. Customs and Immigration Enforcement spokeswoman, Aug. 25, 2015", "Interview, Marc Rosenblum, Migration Policy Institute deputy director of the U.S. Immigration Policy Program, Aug. 24, 2015", "Interview, Jessica Vaughan, Center for Immigration Studies Director of Policy Studies, Aug. 24, 2015", "Interview, Matt Gorman, Jeb Bush campaign spokesman, Aug. 25, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]