["About this rating", "In mid-July 2015 a video began making the online rounds, accompanied by claims that it depicted a man who had consumed 24 cans of Red Bull energy drink in a short period of time. (One 250ml can of Red Bull contains about 80mg of caffeine, while a typical cup of brewed coffee has about 95 to 200 mg of caffeine.)", "WARNING: Graphic video may disturb sensitive viewers.  Caution is advised before viewing.", "The outcome of drinking 24 cans of RED BULL quickly", "The \"24 cans of Red Bull\" was a familiar trope in mid-2015 due to recent reports in the UK press that a 31-year-old British woman had managed, through the help of hypnosis, to kick a 24-can-a-day Red Bull habit that was having profound effects on her health (and finances):", "A mother-of-four whose addiction to Red Bull saw her drinking 24 cans of a day claims she has been cured of her habit by hypnosis.", "Sarah Weatherill, 31, became so dependent on the energy drink she was told if she cut down too quickly she could suffer a seizure as her body was so used to the caffeine.", "The law student spent a staggering £5,460 every year on the popular energy drink since she became hooked in 2009.", "Her habit was at its worst the following year when she was studying for a law degree and wanted to stay awake to revise for exams.", "She soon became dependent on the drink and couldn't get out of bed unless she knew she had some in the fridge.", "She also became lethargic, depressed, had heart palpitations and was constantly feeling anxious as her £105-a-week habit spiralled out of control.", "She finally decided to do something about the problem after she realised the constant need for the Red Bull was severely damaging her health.", "However, the video shown above has nothing to do with the effects of consuming large quantities of caffeine or energy drinks.  What it depicts is a flail chest, a condition usually seen after automobile accidents or other forms of blunt trauma, when a segment of the rib cage breaks and becomes detached from the rest of the chest wall.  In flail chest patients, pressure changes associated with respiration that the rib cage normally resists produce the motion seen in the video above, as demonstrated here:", "During normal expiration, the diaphragm and intercostal muscles relax increasing internal pressure, allowing the abdominal organs to push air upwards and out of the thorax. However, a flail segment will also be pushed out while the rest of the rib cage contracts.", "Although we haven't identified the precise source of this video, it's said to have captured the victim of an automobile accident being treated by emergency medical personnel shortly before his death.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]