["About this rating", "Seven of the eight claims outlined in a flyer about Derek Chauvin are partially or completely true based on verifiable evidence.", "However, the phrasing of some claims in the flyer is subjective, and some of those claims include outdated details or information that contradicts news reports and other evidence. In particular, the second claim, which alleges that the restraint technique Chauvin used on George Floyd before he died was not part of the Minneapolis Police Department's (MPD) training, was demonstrably false. At the time of Floyd's death in May 2020, the department's policy manual permitted officers to use what it called a \"non-deadly force option\" by kneeling on a suspect's neck in situations they deemed appropriate.", "Rumors are surging in the wake of George Floyd's death and resulting protests against police violence and racial injustice in the United States. Stay informed. Read our special coverage, contribute to support our mission, and submit any tips or claims you see here.", "George Floyd, a 46-year-old Black man, died in Minneapolis on May 25, 2020, after a white police officer, Derek Chauvin, pinned him to the ground and kneeled on his neck while Floyd repeatedly said, \"I can't breathe.\" A bystander recorded the confrontation in a video that swiftly spread across social media as a deadly example of what many viewers dubbed racism by American cops.", "The footage ultimately sparked an international reckoning over racism, marked by weeks of protests that largely began peaceful during the day and then escalated to chaos at night, with many U.S. cities reporting property damage, fires, and violent clashes between law-enforcement officers and protesters.", "At the center of the civil rights movement were four former police officers charged in Floyd's death — particularly Chauvin, 44, whom authorities arrested and charged with second-degree murder and manslaughter. A judge ruled he would stand trial on his own, separate from the other three defendants, beginning March 8, 2021, according to The Associated Press. (No, he did not commit suicide, like some rumors online claim.)", "Photo by Ramsey County Sheriff's Office", "What follows is everything we know about Chauvin, a 19-year veteran of the Minneapolis Police Department (MPD), based on court records, news reports, and police documents — evidence that pieces together a policing record that includes complaints against him, as well as several shootings of civilians.", "We should note at the outset that the office of Chauvin's former attorney, Tom Kelly, did not respond to Snopes' request for comment and his current attorney, Eric Nelson, declined to be interviewed.", "Additionally, Sgt. John Elder, a spokesman for MPD, declined to answer questions about Chauvin's career with that department (which ended with Chauvin's termination the day after Floyd died), asserting that, \"We don’t comment on former employees,\" and \"Anything we say\" could affect the current investigation into Floyd’s death.", "To structure our examination into Chauvin's career with MPD, we measured the validity of each point in the below-displayed flyer titled \"Who is Derek M. Chauvin?\" that went viral shortly after Floyd's death.", "That's a question the jury trial will legally determine. Prosecutors have charged Chauvin with second-degree murder and manslaughter after they say he kept Floyd pinned to the ground and knelt on his neck for almost eight minutes, including for nearly three minutes after Floyd became non-responsive.", "Prosecutors also charged the three officers who watched the fatal confrontation between Floyd and Chauvin — Tou Thao, J Alexander Kueng and Thomas Lane — with aiding and abetting second-degree murder (maximum prison sentence is 40 years) while committing a felony, and with aiding and abetting second-degree manslaughter (maximum prison sentence is 10 years).", "As of this writing, they were scheduled to be tried together — separate from Chauvin's case — beginning Aug. 23, The Associated Press reported.", "According to the complaints, which will serve as the basis to prosecutors' arguments to try to convince jurors to convict the former police officers, Lane and Kueng responded to a 911 call reporting that someone had used a counterfeit $20 bill at a South Minneapolis convenience store.", "According to video evidence cited in the court documents, upon arriving at the scene the two officers approached Floyd, who was sitting in the driver's seat of a vehicle also occupied by two other persons.", "As Lane began speaking with Floyd, the officer pulled his gun out and instructed Floyd to show his hands. Floyd complied with the order, whereupon the officer holstered his gun. Lane then ordered Floyd out of the car and \"put his hands on Floyd, and pulled him out of the car,\" handcuffing him, the complaint stated.", "Minutes later, while the officers tried walking Floyd to their squad car, \"Floyd stiffened up and fell to the ground,\" and told the officers he was claustrophobic, the court documents allege. Chauvin and Thao arrived at the scene at that point.", "The officers tried again to get Floyd into a squad car but were unsuccessful in doing so, according to the complaints. While the officers tried to force Floyd into the vehicle, he began asserting that he could not breathe.", "\"Floyd did not voluntarily sit in the backseat and the officers physically struggled to try to get him into the vehicle,\" read the complaint outlining the charges against Chauvin. It continued:", "The defendant pulled Mr. Floyd out of the passenger side of the squad car at 8:19:38 p.m. and Mr. Floyd went to the ground face down and still handcuffed. ...The defendant placed his left knee in the area of Mr. Floyd's head and neck. Mr. Floyd said, \"I can't breathe\" multiple times and repeatedly said, \"Mama\" and \"please,\" as well. At one point, Mr. Floyd said \"I'm about to die.\" The defendant and the other two officers stayed in their positions.", "Floyd was later pronounced dead at a hospital. The Hennepin County Medical Examiner's office, which encompasses Minneapolis, ruled Floyd's manner of death a homicide.", "It is important to note here: In the county office's preliminary autopsy report, medical investigators said Floyd's underlying health conditions, such as coronary artery disease and hypertensive heart disease, contributed to his death in similar ways as Chauvin's restraint. But an autopsy commissioned by Floyd's family had different results; it determined he did, in fact, die of asphyxiation. (Read more about those findings here.)", "All of that said, in reference to the first claim in the flyer, attorneys representing Chauvin are likely to argue in the upcoming trial that he did not murder Floyd but rather operated within the law as an officer. Prosecutors and viewers of the viral video have said otherwise.", "You can read the full charges against Chauvin here; Thao here; Kueng here, and Lane here.", "The second claim in the flyer (that the restraint technique used was not part of MPD training) was false.", "At the time of Floyd's death, MPD's Policy & Procedure Manual (which governs everything from how officers should dress on the job to what tactics are OK to use during arrests) included the below-displayed section obtained by Snopes.  In other words, department policy permitted officers to use what it considered a \"non-deadly force option\" by kneeling on a suspect's neck if they had received lessons in how to do so without applying pressure to the suspect's airway. Officers could use \"light or moderate pressure\" to get someone under \"control\" or \"adequate pressure\" to make someone unconscious in situations they deemed appropriate.", "However, in the aftermath of Floyd's death, MPD agreed to ban officers from using chokeholds and neck restraints at the request of state authorities. As a result of that change, the police manual now reads:", "The Minnesota Police and Peace Officers Association (MPPOA), which provides legal services to police by drawing from about a dozen attorneys, is providing legal representation for Chauvin.", "And initially, yes, the association had assigned Tom Kelly to Floyd's case. Kelly was one of the defense attorneys who represented St. Anthony, Minnesota, police officer Jeronimo Yanez, who was acquitted on all charges in connection to the fatal shooting of Philando Castile, a Black man, during a traffic stop in 2017.", "But on June 3, 2020, Eric Nelson of the Halberg Criminal Defense firm took over Chauvin's case, Reuters reported. Kelly told that news outlet the association had originally assigned the case to him because he was the on-call attorney at the time of Chauvin's arrest. But he gave up the case for medical-related reasons.", "In short, Kelly, a lawyer who indeed argued Yanez's case, also represented Chauvin — but only for about nine days. The flyer's claim was outdated.", "By and large, this assertion is true. Below, we lay out everything we know about the shooting of Leroy Martinez in 2011, which the flyer claimed was \"an inappropriate police shooting\" involving Chauvin and resulted in MPD placing him on administrative leave.", "According to news reports, on Aug. 8, 2011, Chauvin and other officers chased down Martinez, 23, in a public housing complex in South Minneapolis after they said they heard gunshots and saw Martinez running with a gun. (The Indian County-Today news outlet confirmed that Martinez is an Alaskan Native.)", "One of the officers shot Martinez in the torso, and as he recovered in the hospital, Martinez faced second-degree assault charges in connection with a shooting that had taken place before police arrived on the scene. Here's how The Star Tribune newspaper reported the incident:  According to that newspaper's coverage, a witness who said she watched the shooting from her balcony in the housing complex maintained to journalists that police weren't telling the full story. The witness said Martinez had thrown down his gun and was holding his hands in the air when one of the officers (not Chauvin) shot him, after warning that he would open fire.", "All officers involved, including Chauvin, were placed on three-day administrative leave, which is standard procedure in officer-involved shootings, and eventually exonerated of any wrongdoing.", "Whether the flyer is correct in describing the shooting as \"inappropriate\" is a subjective issue. The police chief at the time said he believed the officers acted \"appropriately and courageously,\" suggesting they had acted within department policy under the circumstances, The New York Times reported.", "This claim in the flyer is largely true. Here's what we know about that incident:", "While responding to a call of domestic violence at a South Minneapolis apartment in May 2008, Chauvin opened fire on a 21-year-old Black man, Ira Latrell Toles. The Associated Press reported at the time:", "For a period of time there was an open 911 line into the residence and the 911 operator could hear a woman yelling for someone to stop hitting her, police said. Officers were refused entry when they arrived at the residence but could hear the assault continuing so they forced their way in. Police say Toles tried to run from officers, and when they tried to subdue him he tried to take an officer's gun. They say the officer shot him to prevent that from happening. The two officers on the scene are on paid administrative leave, which is standard in shootings. Police have not released their names.", "Toles, who survived the shooting and later faced criminal charges, recalled the incident differently.", "Following Floyd's death, he told The Daily Beast that yes, the mother of his child had called police on him that night, and that he had locked himself in the bathroom with an unlit cigarette after officers broke down the apartment door. Then, Toles alleged, Chauvin busted in the bathroom door and started hitting the 21-year-old without warning.", "Chauvin later told investigators that, because Toles supposedly failed to comply with officers' commands, he attempted to hit the young man in the head with the butt of his handgun and then opened fire when he thought Toles reached for his gun, The Star Tribune reported. Toles’ ex-girlfriend reported that Chauvin fired his firearm “about two seconds” after he entered the bathroom after Toles.", "In summary, the flyer's point is accurate, with the caveat that only Toles' account suggested that he was unarmed at the time of the confrontation.", "This claim is true. In 2006, Chauvin and five other officers opened fire on a truck in South Minneapolis while investigating a reported stabbing, killing 42-year-old Wayne Reyes.", "According to MPD's account of the incident, Reyes pulled out a shotgun when police pulled him over to ask him questions about the reported assault; the officers believed Reyes had stabbed his girlfriend and another friend in a domestic dispute, according to news reports.", "In total, the six officers fired 42 rounds in four seconds, according to the The Washington Post. Reyes (who the Canadian national news outlet, APTN News, reported was a member of the Leech Lake Ojibwe Band in Minnesota) was struck multiple times and died. However, it was unclear if Chauvin fired any of the fatal shots.", "In the end, a grand jury ruled the officers' actions appropriate, and Chauvin was recommended for a Medal of Valor following the shooting, according to The Star Tribune.", "In reference to the flyer accusing Chauvin and the other officers of striking Reyes with 16 bullets, exactly, no reports corroborated that number. Otherwise, however, the claim about Reyes circulating after Floyd's death was accurate.", "This accusation is largely unproven based upon the available evidence.", "Here's what we can confirm: Roughly four years into Chauvin's MPD career, in 2005, he and another officer used a squad car on duty to chase a car that ended up crashing into another vehicle, killing three people, according to news reports.", "But we have not yet uncovered further details on why the officers were chasing the car, or whether the other drivers (and their conditions) were major factors in the collision.", "So in reference to the flyer, while it was true Chauvin and another officer were involved in a deadly car chase, no trusted evidence showed the officers' actions indeed caused the three fatalities.", "Although MPD has not fulfilled requests for records to determine why, or under what circumstances, conduct complaints were filed against Chauvin prior to Floyd's death, this claim was somewhat true.  Snopes obtained Chauvin's Employee Complaint Profile Card, which provided few details other than a tally of 17 complaints against him throughout his MPD career.", "The only allegation that resulted in disciplinary action (two letters of reprimand) was filed in 2007, when Chauvin allegedly pulled over a woman for going 10 mph over the speed limit, frisked her, and put her in his squad car, according to news reports. The woman's baby and dog were reportedly inside the vehicle during the traffic stop.", "Another complaint was filed by a 48-year-old man who said officers (one of whom was later identified as Chauvin) banged on his car window with a flashlight and attempted to force him to the pavement during a traffic stop in 2013, The Star Tribune reported. The man, a mental health worker, said he was driving home from working a double shift at Hennepin County Medical Center and believed officers had mistaken him for someone who had been using his name.", "In other words, it was undetermined based on verifiable evidence whether all the complaints against Chauvin accused him of using excessive use of force, or whether they included allegations that he had violated other aspects of MPD policy. Anyone can file a complaint against a police officer for any reason.", "Also unclear was whether, or to what extent, the complaints were connected to the incidents described above that resulted in civilian deaths or injuries.", "After graduating high school in 1994, Chauvin worked restaurant jobs as a prep cook, joined the U.S. Army, and eventually attended St. Paul's Metropolitan State University, The Star Tribune reported. There, his focus shifted to police work -- he eventually earned a degree in law enforcement -- and he joined MPD's ranks in 2001, at age 25.", "We also know that Chauvin and Floyd both worked at the same Minneapolis nightclub, El Nuevo Rodeo. Maya Santamaria, who owned the building that housed the club, confirmed with Snopes that both men worked at the business during periods that overlapped (Chauvin worked as an off-duty police officer), but it was unknown whether they ever ran into each other or were introduced.", "MPD leaders commended Chauvin's work at various points throughout his career, according to the news archives. For example, they awarded him a Medal of Commendation in 2008 after he apparently disarmed a man during one of his nightclub security shifts.", "In 2010, Chauvin married his wife, Kellie Chauvin. The two had met at Hennepin County Medical Center, where she worked as a radiologic technician and he brought someone one night for a health check before an arrest, she told The Pioneer Press for a story about her preparation to compete in Mrs. Minnesota America.", "Additionally, the couple owned and rented two homes in Woodbury, a suburb east of St. Paul, before they bought a home in Oakdale, Washington County, according to property records compiled by The Star Tribune. In 2011, they also bought a townhouse near Orlando, Florida, where voting records showed Derek Chauvin is registered to vote.", "Just weeks after Floyd's death, Kellie Chauvin filed for divorce and sought to change her last name. As of this writing, the court sealed access to records in the case, citing privacy and safety concerns.", "Nonetheless, the couple's financial situation emerged in international news headlines in July, when authorities accused them of failing to report income from various jobs.", "Washington County prosecutors charged Derek and Kellie Chauvin with aiding and abetting tax evasion and tax fraud. According to the criminal complaint, they failed to report more than $460,000 in Minnesota income over five years and failed to pay almost $38,000 in taxes owed during that time frame, according news reports.", "Lastra, Ana and Eric. Rasmussen.   \"George Floyd, Fired Officer Overlapped Security Shifts at South Minneapolis Club.\"     KSTP-TV.   28 May 2020.", "Richmond, Todd.   \"Officer Accused in Floyd’s Death Opened Fire on 2 People.\"     The Associated Press.   29 May 2020.", "Evelyn, Kenya.   \"George Floyd Killing: Two Officers Involved Previously Reviewed for Use of Force.\"     The Guardian.   28 May 2020.", "Van Berkel, Jessie.   “George Floyd’s Death Returns Spotlight to Sen. Amy Klobuchar Prosecutor Past.\"     [Minneapolis] Star Tribune.   29 May 2020.", "Bierschbach, Briana.   \"Minneapolis Police Officer Derek Chauvin in Custody After Death of George Floyd.\"     [Minneapolis] Star Tribune.   29 May 2020.", "[Minneapolis] Star Tribune.   \"Buildings Damaged in Minneapolis, St. Paul after Protests.\"     29 May 2020.", "Xiong, Chao and Paul Walsh.   \"Ex-Police Officer Derek Chauvin Charged with Murder, Manslaughter in George Floyd Death.\"     [Minneapolis] Star Tribune.   29 May 2020.", "Furber, Matt et. al.   \"Minneapolis Police, Long Accused of Racism, Face Wrath of Wounded City”.     The New York Times.   27 May 2020.", "Scher, Isaac.   \"The Police Officer Who Knelt on George Floyd’s Neck Has Been Involved in Shootings and Was the Subject of 10 Complaints.\"     Business Insider.   28 May 2020.", "Melendez, Pilar.   \"Minneapolis Man: Cop Who Kneeled on George Floyd ‘Tried to Kill Me’ in 2008.\"     The Daily Beast.   29 May 2020.", "Pioneer Press.   \"Minneapolis Police Officer Involved in Weekend Shooting ID'd.\"     26 May 2008.", "Minneapolismn.gov.   “MPD Frequently Requested Public Information”.     Accessed 29 May 2020.", "WCCO-TV.   \"Lawyer: Wife of Charged Ex-MPD Officer Derek Chauvin Files for Divorce\".     29 May 2020.", "This report was updated to include information about Chauvin and his jury trial set to begin in spring 2021 that emerged after the initial publication of this report.", "Jessica Lee is Snopes' Senior Assignments Editor with expertise in investigative storytelling, media literacy advocacy and digital audience engagement.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]