["“Burning 80 Trump Ballots,” Eric Trump wrote in a November 4, 2020 tweet that has been retweeted more than 30,000 times, spreading a claim from a now-suspended account that included a video clip of the alleged incident, which is no longer viewable.", "Donald Trump, his campaign and his supporters have repeatedly made unfounded allegations of 2020 election fraud, and such claims continue to circulate online as ballots are counted in key battleground states that will determine who wins the presidency.", "The ballot burning claim was also made on Facebook here and on Instagram here, accompanied by what seems to be the same video spread by Eric Trump, who is executive vice president of the Trump Organization, the family business.", "“Donald Trump, gotta do what you gotta do,” a person says in the video while holding up what appears to be a ballot, before placing it in a plastic bag.", "“Got around 80,” says the person, who then lights the bag on fire.", "But the documents in the bag were not ballots completed by voters.", "The City of Virginia Beach responded to Eric Trump’s tweet, saying: “Those were sample ballots,” and linking to a statement.", "“A concerned citizen shared a video with us that ostensibly shows someone burning ballots. They are NOT official ballots, they are sample ballots,” the statement said, referring readers to “the attached freeze frame image and photo of the official ballots, which have the bar codes.”", "AFP Fact Check has previously debunked false claims made by Eric Trump here and here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]