["Democratic presidential candidate Mike Bloomberg speaks during a rally in Houston on Feb. 27, 2020. (AP)", "• Bloomberg, one of the world's richest men, does have more wealth than roughly the bottom 125 million Americans.", "• That said, the roughly 123 million Americans at the bottom of the wealth spectrum are collectively $44 billion in the red, so Bloomberg is not alone — millions of Americans can also say they're richer than more than 100 million Americans.", "Sen. Bernie Sanders, I-Vt., hammered home his message against billionaire Mike Bloomberg at a Democratic presidential debate.", "\"Mike Bloomberg owns more wealth than the bottom 125 million Americans,\" Sanders said during the Feb. 19 debate in Las Vegas. \"That’s wrong. That’s amoral.\"", "We wanted to know if Bloomberg, the former mayor of New York, was really richer than 38% of the country.", "After digging into the data, we found that Sanders was basically correct about how Bloomberg’s fortune compares with the rest of the country. The facts behind this claim, in many ways, underscore Sanders' broader message about income inequality. That said, some quirks in how wealth is distributed among households mean that millions of American — not just Bloomberg — own more wealth than millions of their compatriots.", "Let’s walk through the numbers.", "Bloomberg’s net worth, as listed by Forbes magazine’s richest list, was $64.2 billion at the time of the Feb. 19 debate. That was enough to rank him as the 12th-richest person in the world, according to Forbes.", "The other half of the comparison is more complicated.", "The Sanders campaign’s source is a column by Matt Bruenig of the People’s Policy Project, a think tank that has \"a special focus on socialist and social democratic economic ideas.\"", "Bruenig was more specific than Sanders, writing that by his calculation of Federal Reserve \"summary extract public data,\" Bloomberg owns nearly six times as much wealth as the bottom 38% of households. (The \"bottom 38%\" here refers to the lowest 38% of households in wealth.)", "When we contacted Bruenig, he said he used the Federal Reserve’s Summary Extract Public Data, which is offered for researchers to make calculations using statistical software. Bruenig provided us the code that he used with Python, a programming language.", "Bruenig said he sorted all households from those with the least wealth to those with the most wealth. He then added the wealth of the bottom 38% of American households to get $11.4 billion.", "Then, he determined how many household units this accounted for and found the answer to be 47.8 million. You can then multiply the 47.8 million households by 2.63 (the average number of people per household) to come up with 125.7 million people.", "Matthew Gross, a doctoral candidate at the University of Michigan with data-analyzing experience, helped PolitiFact replicate Bruenig’s math. (He was recommended by Fabian T. Pfeffer, a University of Michigan sociologist who specializes in wealth inequality.)", "Gross found that the bottom 38% had about $6 billion in wealth, rather than Bruenig’s $11.4 billion, but either way, this was enough to verify the calculation that Bloomberg had more wealth than the bottom 38% of American households combined.", "Specifically, Gross found that the aggregate wealth of the bottom 37% of households is -$44 billion. That means these households have more debt than they have assets. Meanwhile, he found that the 38th percentile alone owns about $50 billion. Together, then, percentiles 0 through 38 collectively own about $6 billion in wealth, which is less than Bloomberg had.", "In a technical sense, however, tens of millions of Americans join Bloomberg in owning more wealth than the bottom 37% of households combined, since the bottom 37% are collectively in the red.", "Sanders said, \"Mike Bloomberg owns more wealth than the bottom 125 million Americans.\"", "The numbers check out. It’s worth noting, however, that since the bottom 37% of households — a number that adds up to roughly 123 million Americans — are collectively $44 billion in the red, millions of Americans are also richer than the collective bottom 37% of households.", "We rate the statement Mostly True.", "Bernie Sanders, remarks in the debate in Las Vegas, Feb. 19, 2020", "People’s Policy Project, \"Bloomberg Is Wealthier Than The Bottom 125 Million Americans,\" Feb. 19, 2020", "Federal Reserve Board, Survey of Consumer Finances index page, accessed Feb. 28, 2020", "Pew Research Center, \"The number of people in the average U.S. household is going up for the first time in over 160 years,\" Oct. 1, 2019", "Forbes, \"Real Time Billionaires,\" accessed Feb. 19, 2020", "Email interview with Matt Bruenig, president of the People’s Policy Project, Feb. 20, 2020", "Email interviews with Matthew Gross, doctoral candidate at the University of Michigan, Feb. 25-28, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]