["“BJP/RSS workers celeberating their victory by attacking a Church in Manglore, Police arrested them all. Media is present but not showing on News Channels Immediate.” A video is viral on social media in which police can be seen beating up people inside a church. It is being claimed that this video is of an instance of BJP/RSS cadre attacking a church in Bangalore after BJP emerged as the single largest party in the 2018 Karnataka state elections.", "BJP/RSS workers celeberating their victory by attacking a Church in Manglore, Police arrested them all.", "Media is present but not showing on News Channels Immediate 1/2 pic.twitter.com/hd9C95eauc", "— #Ramadan (@New_Shahbazkhan) May 17, 2018", "https://platform.twitter.com/widgets.js", "A longer version of the video with a similar claim was shared on a page called “Muslim-Pro” and has been viewed over 44000 times.", "Bjp and sanghi cadres attacked church in Mangalore to install bhagwa and bjp flags Police arrested all of them.", "Posted by Muslim-Pro on Wednesday, 16 May 2018", "This video is viral on all forms of social media including Facebook, Twitter and WhatsApp. The screenshot below illustrates how widely it is being shared on Facebook.", "An attack on a church involving as much police as can be seen in the video above will always be reported by at least some sections of the media if not all. When we looked up reports of any such incident, we could not find anything in recent past. Therefore, the claim didn’t add up. When we looked for similar incidents on YouTube, we stumbled upon a 2008 report by Al Jazeera which includes the viral video being shared presently.", "As mentioned in the Al Jazeera report, the incident happened in the St Sebastian Church in Permannur in Mangalore. The Al Jazeera report is dated October 5, 2008. Daijiworld.com which focuses on news from coastal Karnataka reported this incident on September 15, 2008. Later, witnesses blamed Bajrang Dal for the attack on the church in their testimonies before Justice B.K. Somasekhara Commission of Inquiry.", "A video of an incident from 2008 is being shared as a present incident to create an impression that members of the Sangh Parivar, who in the past have attacked religious institutions of the minority community, have gained additional courage because of BJP emerging as the single largest party.", "Donate Now", "Co-Founder Alt News, I can be reached via E-mail at [email protected] and on Facebook at https://fb.com/freethinker.", "Follow @free_thinker", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]