["About this rating", "Just after a devastating attack in Nice, France, on 14 July 2016 — in which dozens of people were killed and still more wounded when a man identified as French-Tunisian drove a huge truck through a large crowd watching fireworks — rumors spread thick and fast, as they do after any mass casualty event.", "Nine hundred kilometers away in Paris, Bastille Day celebrants saw smoke begin to billow up around the Eiffel Tower — the result of an accidental explosion of fireworks being trucked across the nearby Jena Bridge — and must have thought Paris itself was under attack. But it wasn't, and the structure itself was never in flames.", "Fear-mongering extremist and conspiracy web sites seized upon photos and video of the event, however, misleadingly presenting them as \"evidence\" that the entire country was under coordinated attack. The Paris Police were quick to douse this speculation via social media. \"Don't spread false rumors,\" read a boldface tweet from the Préfecture de police. \"No fire at the #TourEiffel. An accidental truck fire took place at Jena Bridge. It has been put out.\"", "Ne propagez pas de fausses rumeurs. Aucun incendie à la #TourEiffel. Un incendie accidentel de camion a eu lieu pont d'Iéna. Il est éteint.", "— Préfecture de police (@prefpolice) July 14, 2016", "No injuries were reported in the Paris fireworks explosion.", "Sassard, Sophie and Bernouin, Michel.  \"Truck 'Terrorist' Kill 80 in Nice Bastille Day Crowd.\"\r\n  Reuters.  14 July 2016.", "Dean, Jon.  \"Panic As Huge Plumes of Smoke Billow from Eiffel Tower as Nice Terror Attack Unfolds.\"\r\n  Daily Mirror.  14 July 2016.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]