["About this rating", "In November 2017, an image purportedly showing a screenshot from popular video game Call of Duty: WWII which shows two lynched men hanging from a tree was circulated on social media along with calls for a boycott of the Activision game.", "The image is real. YouTube user \"TmarTn2\" uploaded several videos of himself playing Call of Duty: WWII shortly after its release in November 2017. (The scene can be glimpsed at the 13:40 mark here.)  However, the still does not show the dialogue between the two soldiers:", "Stiles: Those are civilians. This is a war crime.", "Aiello: No shit, college. We're fighting Nazis here.", "We reached out to the two companies behind the game, Activision and Sledgehammer Games, for additional comment on the scene. Sledgehammer Games senior creative director Bret Robbins previously commented on some of the disturbing imagery:", "\"We didn't want to shy away from history. We wanted to be very respectful of it,\" senior creative director Bret Robbins said during a recent interview.", "\"Some very, very dark things happened during this conflict and it felt wrong for us to ignore that.\"", "It's not just a matter of accepting the reality of the Holocaust. The game's 1940s setting is rife with intolerance, from the open hostility of Nazi atrocities to the more insidious reality of living in the \"free world\" before the Civil Rights movements of the '60s.", "\"Unfortunately, there was anti-Semitism,\" Robbins said. \"There was racism. It's actually a very big part of our story, the fact that that stuff existed, it was real, and our characters deal with it.\"", "Rosenberg, Ryan.   \"'Call of Duty: WWII' Won't Ignore the Holocaust Anymore.\"\r\n    Mashable.   26 April 2017.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]