["By Sydney Schaedel", "Posted on March 18, 2020", "Viral posts on social media claim COVID-19 is no worse than other outbreaks that have occurred in “every election year,” suggesting that the new coronavirus is being “hyped” to hurt President Donald Trump. But most of the dates cited to defend those conclusions about previous outbreaks are misleading or incorrect.", "A viral image of a whiteboard sign claiming to have been “Posted at a Doctors office today” purportedly lists disease outbreaks that occurred in “every election year” since 2004. The image says the new coronavirus is “being hyped as The Black Plague.” One Facebook post that shared the photo includes a comment that the new coronavirus “is hyped to make Trump look bad.”", "But the dates listed for the outbreaks of most of the diseases are incorrect; the impact of those diseases was not widely felt in federal election years.", "The image, which appears in numerous Facebook posts, shows a handwritten sign that reads, in part, “Every election year has a disease.” It then lists: “SARS-2004 Avian-2008 Swine-2010 MERS-2012 Ebola-2014 Zika-2016 Ebola-2018 Corona-2020”", "The list focuses on presidential election and midterm election years. It leaves out the 2006 midterm election year.", "We looked at the websites of the World Health Organization and the Centers for Disease Control and Prevention to find when the diseases began and when they became widespread.", "The first disease listed on the posts is SARS, or Severe Acute Respiratory Syndrome, and it is listed beside the year 2004. In reality, the first diagnosed cases of SARS occurred in November 2002 in China, according to the CDC. By May 2003, the disease had been contained in the United States, so it was no longer spreading. The 2004 presidential election was in November, a year and a half later.", "“Avian,” short for the avian flu, or H5N1, is listed on the posts alongside the year 2008, but that influenza was first detected in humans in 1997, according to the CDC. It reemerged in 2003, but the first infection in North America wasn’t until January 2014 in Canada. The CDC reports “to date, there have not been any reports of HPAI Asian H5N1 virus infections in people in the United States and Asian H5N1 has never been detected in U.S. birds or poultry.” No part of the avian flu timeline aligns meaningfully with the November 2008 presidential election.", "The posts list “Swine-2010,” short for swine flu, or 2009 H1N1. The CDC’s timeline of the 2009 H1N1 pandemic notes that the disease emerged in California in April 2009. By December 2009, a vaccine was widely available, and by January 2010, “activity declined to levels below baseline, but persisted for several more months at lower levels.” The WHO announced the end of the pandemic in August 2010. The 2010 midterm election was three months later in November.", "MERS, or Middle East Respiratory Syndrome, was first reported in Saudi Arabia in 2012, which is the year listed in the posts. But according to the CDC, only two patients have ever tested positive in the United States, and that didn’t happen until 2014, long after the 2012 presidential election.", "The viral image listing Ebola as occurring in 2014 makes sense. The West Africa Ebola outbreak began in December 2013 and had spread to the capitals of Guinea, Liberia and Sierra Leone by July 2014.", "However, only 11 people were ever treated for Ebola in the U.S. Only two of them — nurses who were treating a man who had the disease and had just arrived in Texas from West Africa — contracted the disease in the U.S.", "Zika is another disease that has been around for many years, much like the avian flu. According to the WHO, it was first identified in Uganda in 1947. In the posts, Zika is listed alongside the year 2016, which more or less coincides with the most recent global outbreak. The disease became widespread in Central and South America in late 2015 to early 2016, and the WHO declared a public health emergency in February 2016. The disease continued to spread in 2016, including to the U.S.", "It’s unclear why Ebola is listed again beside the year 2018. It’s true that outbreaks of the disease in the Democratic Republic of the Congo continued in 2017 and 2018, but fewer than 100 people were infected, which pales in comparison to the 28,610 people infected in the 2014 West African epidemic.", "The novel coronavirus, which causes the COVID-19 disease, began in the central Chinese city of Wuhan in 2019. The CDC announced the first U.S. case in Washington state on Jan. 21. As of March 18, there were more than 7,000 cases reported in the U.S. and more than 100 deaths.", "Michael Levy, an associate professor of epidemiology at the University of Pennsylvania, told us that epidemics are becoming more frequent. “As we become more numerous on the planet, there are more opportunities for pathogens to emerge,” he said in a phone interview.", "The posts also claim the novel coronavirus “has a contagion factor of 2.” This refers to the number of people to which an infected person can transmit the disease, also known as the R0 number. The WHO estimates this number to be 1.4 to 2.5 for COVID-19, but estimates vary because the disease is so new.", "The posts use upper-range estimates for the contagion factor of the other diseases. It says that SARS has an R0 of 4. According to the WHO, SARS has an R0 in the range of 2 to 4. The posts also claim that the R0 for measles is 18. Measles is most often cited as having an R0 range of 12 to 18, and studies have found that estimates could vary more widely.", "The posts also claim that the “cure rate” for people under 50 infected with COVID-19 is 99.7%, which would equate to a death rate of 0.3%. But the data to confirm or debunk this statistic doesn’t exist yet.", "As we previously reported, we know the number of reported cases and how many people have died. But there are unreported cases, so we don’t know how many people have the disease. For instance, there are people who have mild cases and don’t seek treatment or don’t even know they have it. But, as Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases, stressed to Congress, even an estimated 1% fatality rate is 10 times that of the seasonal flu, whose mortality rate is about 0.1%. And  there may be unreported deaths mistakenly attributed to other causes.", "Finally, the posts claim that the spread of COVID-19 is leveling off. This is false. According to the WHO, new cases had leveled off in China in late February, but according to the CDC, “states [in the U.S.] where community spread is occurring are in the acceleration phase.”", "COVID-19 is “definitely not leveling off in the U.S.,” Levy said. He noted that China has seen new cases of the disease level off largely because “drastic measures were taken.”", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "“Cases in U.S.” Centers for Disease Control and Prevention. Accessed 18 Mar 2020.", "CDC Timeline. Centers for Disease Control and Prevention. 17 Mar 2020.", "“CDC SARS Response Timeline.” Centers for Disease Control and Prevention. 16 Apr 2013.", "“Consensus document on the epidemiology of severe acute respiratory syndrome (SARS).” World Health Organization. Accessed 16 Mar 2020.", "Disease Outbreaks by Year. World Health Organization. 17 Mar 2020.", "Guerra, Fiona et. al. “The basic reproduction number (R0) of measles: A systematic review.” The Lancet: Infectious Diseases. July 2017.", "“Highly Pathogenic Asian Influenza A(H5N1) Virus.” Centers for Disease Control and Prevention. 12 Dec 2018.", "Hirshler, Ben. “Timeline: Zika’s origin and global spread.” Reuters. 14 Dec 2016.", "“History of Zika virus.” World Health Organization. Accessed 16 Mar 2020.", "Levy, Michael. Associate professor of epidemiology, University of Pennsylvania. Phone interview with FactCheck.org. 16 Mar 2020.", "“MERS in the U.S.” Centers for Disease Control and Prevention. 2 Aug 2019.", "Rieder, Rem. “Trump and the Coronavirus Death Rate.” FactCheck.org. 5 Mar 2020.", "Rolling updates on coronavirus disease (COVID-19).” World Health Organization. Accessed 11 Mar 2020.", "“Situation Summary.” Centers for Disease Control and Prevention. 15 Mar 2020.", "“Statement on the meeting of the International Health Regulations (2005) Emergency Committee regarding the outbreak of novel coronavirus (2019-nCoV).” World Health Organization. 23 Jan 2020.", "“WATH LIVE: CDC, NIH director testify before House on Coronavirus response (Day one).” YouTube. 11 Mar 2020.", "“Years of Ebola Virus Disease Outbreaks.” Centers for Disease Control and Prevention. 15 Oct 2019.", "“2009 H1N1 Pandemic Timeline.” Centers for Disease Control and Prevention. 8 May 2019.", "“2014-2016 Ebola Outbreak in West Africa.” Centers for Disease Control and Prevention. 8 Mar 2019.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]