["“#Depression is a state of low mood that affects a person’s thought, behaviour, feeling & sense of well-being. One must take up activities that keep him or her boosted in order to cope with depression. #SwasthaBharat #MentalHealth #LetsTalk“.", "The Ministry of Health & Family Welfare (MoH&FW) Twitter account posted the aforementioned text as a public awareness measure on depression. An infographic accompanied the tweet that advised a list that included ‘following a routine, travelling, being creative, taking multivitamins, thinking positively, practicing yoga, staying clean, sleeping for a minimum of eight hours, eating fruits and going for a walk’ as measures to help cope with depression.", "#Depression is a state of low mood that affects a person’s thought, behaviour, feeling & sense of well-being. One must take up activities that keep him or her boosted in order to cope with depression. #SwasthaBharat #MentalHealth #LetsTalk pic.twitter.com/6eElyQe4Rm", "— Ministry of Health (@MoHFW_INDIA) June 16, 2018", "The tweet also suggested that “Depression is a state of low mood that affects a person’s thought, behaviour, feeling, entrance of well-being. One must take up activities that keep him or her boosted in order to cope with depression.”", "A few days later, the National Health Portal (NHP), a government body, released a statement on their website elaborating on the mental health disorders, mainly: anxiety, depression & sleep disorders.", "In one of the sections, they maintained that mental exercises that included “training to ‘tune’ to the happenings inside & outside the body” is an effective way to deal with mental health illnesses. But, the NHP doesn’t mention how to practice this ‘tuning’. The NHP article states:", "“It is also necessary that, for the mental faculties to grow, they must be constantly trained and tuned to the happenings inside and outside the body. Practice helps to develop our faculty and allows it to remain in a state of excellence. We know that practice makes a man perfect. And thus he is able to counter innumerable challenges which are an inevitable part of life. Be it fire or be it nanotechnology, no great invention or discovery has come without overcoming challenges and more so not without the sanity of a balanced mind. We must therefore keep facing challenges if we want our mind to remain healthy.”", "The NHP article also emphasized on ‘food for thought’. It stated:", "“As in the case of maintaining general hygiene for physical health, developing a healthy mind is through imbibing good food for thought or ‘ChaitikAhaar’. This food for thought can be imbibed by participating in healthy discussions, socializing, meeting new people and meditating. Good and healthy food for thought is as important as nutritious food for body.”", "The NHP also blamed socio-economic problems like ‘poor socioeconomic state, a broken family and professional difficulties’ and, added that clean and positive surroundings can help heal these problems. Lastly, they also added that homeopathy can correct these issues.", "WHO acknowledges that depression is the most common mental health disability. It can be as debilitating as any physical disability. Everyday actions such as going to work, or, even getting out of bed for the day, can be an effort.", "Both MoH&FW and NHP suggested that mental health disorders like depression can be coped with lifestyle choices such as keeping healthy. They also suggested that depression can be caused by socio-economics which can lead to a low emotional state like sadness. Both of the aforementioned are untrue.", "The contributing factors to depression are, social, psychological as well as biological. It is true that people who have undergone adverse life events can develop depression but there are a range of genetic and environmental predispositions which can act as contributing factors.", "There are several studies that have identified various genes that have a major role in major depressive disorder (MDD), commonly known as depression. A study on adoption and twin studies in the America Journal of Psychiatry published in 2000, concluded that while environment was significant to the cause of depression, it is reliant on genetic heritability from biological parents. It is informative to study twins separated and raised in different environments, especially monozygotic (identical) twins as they have similar genetic makeup. The study concluded that major depression is inheritable from genes and its inheritability results from genetic influences.", "Hence, depression has a distinct molecular physiology and genetics. A lowered emotional state such as sadness (due to the environment), is not the causing factor without the inherited genes that are linked with depression.", "Contrarily, sadness is an emotion and can be experienced by healthy individuals. Hence, sadness alone, or from the NHP statement ‘negativity’ alone cannot be a cause of depression.", "While, NHP quoted statements from WHO on mental health; WHO, nowhere suggested that mental health can be ‘maintained’ by ‘tuning’ exercises, the meaning of which is not explicitly described. A statement by WHO on mental health recognises the importance of scalable psychological interventions as well as antidepressant medications (such as selective serotonin re-uptake inhibitors and tricyclic antidepressants) in case of depression. In contrast, the NHP provided no suggestions of seeking professional help similar to the statements by WHO.", "A study in the prestigious journal ‘Science’, published in 2018, suggested that there is a shared genetic basis or heritability in major common disorders of the brain and this heritability (inherited from parents’ genes) depended on how early the onset of the disorder started in an individual. Hence, the study concluded that genes have a huge role in not just depression, but in several other mental health disorders.", "While some of the options in the MoH&FW tweet can help alleviate one’s low emotional state such as sadness; lifestyle choices, such as being creative or travelling, cannot be categorised as effective treatments for dealing with depression.", "In addition to that, there was no advices for proven & effective treatments available for clinical depression. The only mention related to medications was of multivitamin pills which, according to a study, have failed to show any efficacy in treating or in decreasing its prevalence.", "The NHP’s suggestion for treatment – homeopathy, is scientifically unproven to treat depression from a physiological perspective. Several studies, both as individual studies specifically for depression and a meta-analysis of several studies, conducted on homeopathic treatments, concluded that homeopathy is ineffective for depression. In an earlier article on Alt News, we have described the working principles of this unscientific model of therapy.", "Although, treatments like homeopathy may have an impact as a placebo (a non-treatment or a sham treatment creating an effect like the real drug). If that is the case, a study that systematically tests homeopathic remedies against the most commonly prescribed drugs in anxiety and/or depression must be considered.", "We found a thorough review in the British Medical Journal that conducted a meta-analysis of clinical trials in humans for the efficacy of homeopathy and found only one study on depression that compared the drug diazepam (not the first choice for treating depression but prescribed for clinical anxiety) with homeopathic treatment. This study, from France, which was in favour of homeopathy for depression was retracted from publication because of low methodological quality. Even though retracted, this study is still used to substantiate arguments on homeopathy till date by homeopathic websites and blogs.", "In contrast, a study published in 2018, in The Lancet, compared efficacy of 21 antidepressant drugs, against placebo, for the acute treatment for major depressive disorder. This study by a collaborative team of psychiatrists and scientists across the UK, USA, France, Switzerland, Germany, The Netherlands and Japan concluded that all 21 antidepressants tested were more efficacious than a placebo drug.", "The suggestions for depression in the ministry’s tweet and, also, in the statement by the NHP indicates the extent of misinformed medical advice passed from the health advisors of the ministry to the general population. Carelessly, equating socio-economics as the only cause for mental health issues, without considering the research behind these illnesses, is grave medical negligence and lack of diligence coming from the Ministry of Health & Family Welfare, the mainstream health ministry in India.", "The National Health Portal claims to be a portal to establish a single point access for authenticated health information for citizens, students, healthcare professionals and researchers. Its unconditional support for homeopathy while neglecting all the proven treatments available is irresponsible, misleading and indicates disregard for the evidence-based practice and the profession of medicine.", "In conclusion, depression is a seriously debilitating illness similar to other types of disability and can lead to suicide. Although, it is important to have a healthy lifestyle and nutrition, these changes cannot cure depression. If you think you have depression, approach a medical professional for diagnosis and, if diagnosed, ask about the treatment options available. For more information, refer to WHO website pages on depression.", "Donate Now", "Alt News Science is no longer edited by Dr. Sumaiya Shaikh", "From 2017-2021, Dr. Shaikh was the Founding-Editor for Alt News Science. Her main role is as a neuroscientist researching violent extremism and psychiatry.", "Follow @Neurophsyik", "A video of a ladder moving on its own, purportedly from Jharkhand, is viral on…", "In a 2-minute video, a man recommends a “technique” to prevent infection from Omicron, the…", "A video of a set of iron nails that appear to melt after being placed…", "Several social media users have shared an image that shows two columns — ‘Cepa/variante’ (Spanish…", "A 90-second video of a man dissecting a banana has been shared on the internet…."]