["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Wagner has voted against the Affordable Care Act numerous times.", "She also has co-sponsored alternative legislation that would protect those with pre-existing conditions even if the Affordable Care Act was struck down.", "With the elections around the corner, Missouri’s 2nd Congressional District is in the eye of the storm.", "Democratic challenger Jill Schupp and incumbent Republican U.S. Rep.  Ann Wagner are battling for the district that includes parts of St. Louis, St. Charles and Jefferson counties. The Cook Political Report says the race is a toss-up.", "In one of Schupp’s attacks in a video on Facebook, Schupp stated: \"Rep. Wagner doesn't want you to know that she's voted five times against protecting pre-existing conditions.\"", "In a time when people with pre-existing conditions are vulnerable, is it really true that she voted against these protections?", "Let’s take a look.", "Introduced in 2010, the Affordable Care Act was designed to broaden the reach of health care coverage. In the past decade, gaps in health coverage have decreased.", "Republicans in Congress and the Trump administration oppose the law and have taken steps to repeal the Affordable Care Act. One protection at the core of the Affordable Care Act outlaws denying coverage to those who live with pre-existing conditions.", "A pre-existing condition is a health problem that was around before someone’s health coverage began. According to the liberal Center for American Progress, Missouri’s 2nd Congressional District has more than 320,000 people living with pre-existing conditions.", "We asked Jill Schupp’s campaign to provide evidence of Wagner’s votes. Schupp’s communications director Natalie Edelstein provided five unsuccessful attempts by the Republican-led House to repeal the Affordable Care Act while President Barack Obama was in office.", "In 2013, Wagner voted to repeal the account restrictions in the Patient Protection and Affordable Care Act (HR 25).", "In 2014, Wagner voted to repeal the Patient Protection and Affordable Care Act (HRs 96).", "In 2015, Wagner voted to repeal the Affordable Care Act (HR 596).", "In 2015, Wagner voted for a proposed amendment that repealed the Affordable Care Act (HR 27).", "In 2015, Wagner voted again on the budget above which would establish a reserve fund and allow health care spending to be adjusted.", "These votes are in line with Schupp’s claim. It’s worth noting that one of the votes is a second vote on the same budget. Also, only one of these is an actual vote to directly repeal the ACA, H.R. 596; the rest are mainly budget votes that cut or redirect funding to the ACA.", "HealthReformVotes.org, a website that tracks votes concerning health care reform, cites Wagner’s vote to repeal the Affordable Care Act as unfavorable to consumers.", "We asked Wagner’s campaign to comment on this claim. Press secretary Arthur Bryant sent a history of Ann Wagner’s votes, as well as legislation Wagner has co-sponsored to keep people insured.", "Here are the votes sent by Wagner’s campaign from 2019:", "Wagner voted on HR 5 which would guarantee that no Americans could be denied coverage or charged higher premiums as a result of their health status.", "Wagner voted to recommit the Protecting Americans with Preexisting Conditions Act of 2019, which would make it clear that pre-existing conditions protections cannot be waived under current law.", "Alongside colleagues in Congress, Wagner introduced the Protecting Patients with Preexisting Conditions Act in 2019. The act would amend the Health Insurance Portability and Accountability Act to guarantee coverage even if the Affordable Care Act is completely repealed.", "The act also seeks to outlaw discriminatory premium rates. As it stands, the Protecting Patients with Pre-existing Conditions Act was introduced a year ago and hasn’t been acted on since.", "Another piece of legislation Wagner co-sponsored, HR 1066, aims to keep pre-existing conditions protections in place.", "Wagner also co-sponsored the Maintaining Protections with Preexisting Conditions Act of 2018. PolitiFact found that this (as well as another bill) has loopholes in denying coverage if companies do not have the capacity to do so.", "Schupp stated in a Facebook post that \"Ann Wagner doesn’t want you to know that she’s voted five times against protecting people with pre-existing conditions.\"", "Wagner has repeatedly voted for legislation that repealed the Affordable Care Act, which establishes protections for those with pre-existing conditions. If the repeals had been successful, the protections for pre-existing conditions would be gone.", "Wagner’s introduction of various bills as alternatives to the Affordable Care Act that would guarantee protections suggests that’s not the whole story. She has co-sponsored legislation to keep protections in place, but there are loopholes that could jeopardize coverage if the Affordable Care Act was dismantled.", "We rate this statement Mostly True.", "American Progress, \"The Chaos of Repealing the Affordable Care Act During the Coronavirus Pandemic\" Oct. 1, 2020", "American Progress, \"Number of Americans with Preexisting Conditions by District for 116th Congress\" Oct. 2, 2019", "Office of the Assistant Secretary of Planning and Evaluation, \"Health Insurance Coverage for Americans with Pre-Existing Conditions: The Impact of the Affordable Care Act\" Jan. 5, 2017", "American Journal of Public Health, \"Repealing the Affordable Care Act Essential Health Benefits: Threats and Obstacles\" Aug. 2017", "Kaiser Family Foundation, \"Protecting People With Pre-Existing Conditions Isn’t As Easy As It Seems\" Oct. 5, 2020", "Health and Human Services, \"Pre-Existing Conditions\" Jan. 31, 2017", "HealthReformVotes.org, \"Rep. Ann Wagner: key health care votes\" accessed Oct. 15, 2020", "The United States Government, \"Affordable Care Act of 2010\" accessed Oct. 12, 2020", "American Progress, \"10 Ways the ACA Has Improved Health Care in the Past Decade\" Oct. 13, 2020", "United States House of Representatives Clerk, \"FINAL VOTE RESULTS FOR ROLL CALL 88\" Mar. 21, 2013", "United States House of Representatives Clerk, \"FINAL VOTE RESULTS FOR ROLL CALL 177\"", "Apr. 10, 2014", "United States House of Representatives Clerk, \"FINAL VOTE RESULTS FOR ROLL CALL 58\"", "Feb. 3, 2015", "United States House of Representatives Clerk, \"FINAL VOTE RESULTS FOR ROLL CALL 141\"", "Mar. 25, 2015", "United States House of Representatives Clerk, \"FINAL VOTE RESULTS FOR ROLL CALL 142\" Mar. 25, 2015", "United States House of Representatives Clerk, \"Roll Call 4 | Bill Number: H. Res. 5\" Jan. 3, 2019", "United States House of Representatives Clerk, \"Roll Call 140 | Bill Number: H. Res. 274\" Apr. 2, 2019", "United States House of Representatives Clerk, \"Roll Call 189 | Bill Number: H. Res. 357\" May 09, 2019", "United States House of Representatives Clerk, \"Roll Call 195 | Bill Number: H. R. 986\" May 09, 2019", "Ann Wagner Press Release, \"WAGNER INTRODUCES BILL TO PROTECT PATIENTS WITH PREEXISTING CONDITIONS\" Aug. 6, 2019", "Ann Wagner Press Release, \"WAGNER INTRODUCES BIPARTISAN ALTERNATIVE TO HELP AMERICANS KEEP HEALTH INSURANCE\" May 14, 2020", "United States Congress, \"H.Res.5 - Providing for consideration of the resolution (H. Res. 6) adopting the Rules of the House of Representatives for the One Hundred Sixteenth Congress; providing for consideration of the bill (H.R. 21) making appropriations for the fiscal year ending September 30, 2019, and for other purposes; and providing for consideration of the joint resolution (H.J. Res. 1) making further continuing appropriations for the Department of Homeland Security for fiscal year 2019, and for other purposes.\" accessed Oct. 26, 2020", "United States Congress, \"H.R.986 - Protecting Americans with Preexisting Conditions Act of 2019\" May 15, 2019", "Ballotpedia, \"Missouri’s 2nd Congressional District\" accessed Oct. 26, 2020", "United States Congress, \"H.Con.Res.25 - Establishing the budget for the United States Government for fiscal year 2014 and setting forth appropriate budgetary levels for fiscal years 2015 through 2023.\" accessed Oct. 6, 2020", "United States Congress, \"H.Con.Res.96 - Establishing the budget for the United States Government for fiscal year 2015 and setting forth appropriate budgetary levels for fiscal years 2016 through 2024\" accessed Oct. 6, 2020", "United States Congress, \"H.R.596 - To repeal the Patient Protection and Affordable Care Act and health care-related provisions in the Health Care and Education Reconciliation Act of 2010, and for other purposes.\" accessed Oct. 6, 2020", "United States Congress, \"H.Con.Res.27 - Establishing the budget for the United States Government for fiscal year 2016 and setting forth appropriate budgetary levels for fiscal years 2017 through 2025.\" accessed Oct. 6, 2020", "PolitiFact, \"Is the fight to repeal and replace the Affordable Care Act Dead?\" Mar. 29, 2017", "PolitiFact, \"Freitas has backed plans that undercut coverage of preexisting conditions\" Sept. 3, 2020", "PolitiFact, \"Did the Affordable Care Act create preexisting condition protections for people in employer plans?\" May 21, 2019", "PolitiFact North Carolina, \"Fact check: Did Tillis vote to 'take away' coverage for pre-existing conditions?\" Feb. 27, 2020", "PolitiFact, \"Pre-existing conditions: Does any GOP proposal match the ACA?\" Oct. 17, 2017", "PolitiFact Pennsylvania, \"Controversial healthcare ad: Did Barletta vote to ‘strip coverage’ for pre-existing conditions?\" Oct. 12, 2018", "PolitiFact, \"Upton voted a dozen times in support of repealing the Affordable Care Act\" Oct. 28, 2020", "New York Times, \"What Happens if Obamacare is struck down?\" Mar. 26, 2019", "CommonWealth Fund, \"The Affordable Care Act at 10 Years: What’s the Effect on Health Care Coverage and Access?\" Feb. 26, 2020", "Cook Political Report, \"2020 House Race ratings\", Oct. 21, 2020", "Interview, Natalie Edelstein, communications director for Jill Schupp, Oct. 1, 2020", "Interview, Arthur Bryant, press secretary for Ann Wagner, Oct. 26 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]