["The claim was published in this article on September 7, 2020.", "The article, titled “UN Forced to Admit Gates-funded Vaccine Is Causing Polio Outbreak in Africa”, states in part: “The United Nations has been forced to admit that a major international vaccine initiative is actually causing a deadly outbreak of the very disease it was supposed to wipe-out. / While international organisations like the World Health Organization (WHO) will regularly boast about ‘eradicating polio’ with vaccines—the opposite seems to be the case, with vaccines causing the deaths of scores of young people living in Africa.”", "It also referenced this September 1, 2020, WHO report on “circulating vaccine-derived poliovirus cases” in several African countries, such as Sudan, Chad and Cameroon.", "An identical claim has also been shared on this website; on Facebook here, here and here; on Twitter here, here and here; and on Reddit here, here and here.", "According to the World Health Organization (WHO), polio is a “highly infectious viral disease that largely affects children under 5 years of age.” The disease is not curable, but can be prevented through two types of polio vaccines.", "However, the claim that these vaccines actively cause polio outbreaks is misleading.", "Poliovirus in vaccines is not cause of disease", "The claim is “plain wrong,” Oliver Rosenbauer, a spokesperson for the WHO’s polio eradication effort, told AFP in a phone interview on September 14, 2020.", "\"There are these things called vaccine-derived poliovirus outbreaks. And they emerge in areas where you have immunity gaps,” Rosenbauer said. “What this mainly is, is a factor of low vaccination coverage. Not really a side effect of vaccination.”", "Genetically different poliovirus", "The US Centers for Disease Control and Prevention (CDC) states here that “polio vaccination protects people against naturally occurring polioviruses and vaccine-derived polioviruses”.", "However, vaccines would only work effectively in environments with high population immunity. The WHO explains here that in areas with low vaccination coverage, poliovirus found in vaccines can, over a period of time, undergo genetic changes and affect under-immunised communities.", "The WHO writes: “Oral polio vaccine (OPV) contains an attenuated (weakened) vaccine-virus, activating an immune response in the body ... On rare occasions, if a population is seriously under-immunized, an excreted vaccine-virus can continue to circulate for an extended period of time… In very rare instances, the vaccine-virus can genetically change into a form that can paralyse – this is what is known as a circulating vaccine-derived poliovirus (cVDPV) ... Circulating VDPVs occur when routine or supplementary immunization activities (SIAs) are poorly conducted and a population is left susceptible to poliovirus, whether from vaccine-derived or wild poliovirus. Hence, the problem is not with the vaccine itself, but low vaccination coverage.”", "Dr. Lulu Bravo, executive director of the Philippine Foundation for Vaccination, also refutes the claim, telling AFP in a text message that outbreaks occur “because of undervaccination, less than 90-95% coverage in the population”.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]