["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "President Donald Trump congratulated House Republicans for passing a replacement for Obamacare. (Mark Wilson/Getty Images)", "Democrats savaged the Republican legislation, pushed by President Donald Trump and House Speaker Paul Ryan, that would replace Obamacare.", "\"Under ‘Trumpcare,’\" U.S. Rep. Gwen Moore of Wisconsin declared in a May 4, 2017 news release, \"being a victim of domestic violence or sexual assault could be considered pre-existing conditions.\"", "The claim by Moore, who has talked publicly about being a victim of domestic violence and sexual assault herself, cuts to one of the big fears around health care -- that having something that is considered a pre-existing condition means a person has to pay more for insurance, or could be denied coverage altogether.", "Typically, this refers to things such as diabetes or cancer.", "But sexual assault or domestic violence?", "Obamacare vs ‘Trumpcare’", "The Affordable Care Act (Obamacare) is the 2010 legislation adopted under President Barack Obama. It prohibits insurance companies from denying coverage -- or charging higher premiums -- because a person has a pre-existing medical condition.", "Under the American Health Care Act (sometimes called \"Trumpcare\"), insurers would still be prohibited from denying coverage based on a pre-existing condition. The bill was narrowly approved by the House of Representatives and could be changed in the Senate.", "But in its current form, the bill would give states the option to allow insurers to charge people with pre-existing conditions higher prices.", "Republicans argue those people would be protected, because those states would have to set up high-risk pools to insure people with pre-existing conditions. But many analysts believe the law would still leave those people more vulnerable to cost increases that could make their plans unaffordable.", "(The day after the House passed the bill, GOP Wisconsin Gov. Scott Walker said he would consider allowing insurers to charge higher prices. But later that day -- in an indication of how politically touchy the issue is -- he backed away from that comment after it drew criticism.)", "Pre-existing conditions", "Bloggers claimed that under the GOP bill, sexual assault is a pre-existing condition, which PolitiFact National rated Mostly False. PolitiFact National spelled out what would happen under the GOP bill regarding sexual assault and experts told us that the same would apply to domestic violence.", "In a nutshell:", "The bill does not single out any specific medical event or diagnosis as a pre-existing condition.", "Conditions stemming from a sexual assault or domestic violence, such as post-traumatic stress disorder or certain sexually transmitted diseases, could be judged to be a pre-existing condition.", "States would have the option to allow insurers to charge higher prices to people with an existing condition, possibly making coverage unaffordable.", "Our rating", "Moore says that \"under ‘Trumpcare,’\" the Republican replacement for Obamacare, domestic violence and sexual assault \"could be considered pre-existing conditions\" -- something that could trigger higher insurance prices for those victims.", "Moore’s claim goes too far. Simply being a victim of domestic violence or sexual assault would not mean a person had a pre-existing condition.", "But it is important to know that conditions stemming from those assaults, such as post-traumatic stress disorder, could.", "For a statement that contains an element of truth but ignores critical facts that would give a different impression, our rating is Mostly False.", "Gwen Moore, news release, May 4, 2017", "Email, Gwen Moore communications director Eric Harris, May 4, 2017", "New York Magazine, \"In Trump’s America, Being Sexually Assaulted Could Make Your Health Insurance More Expensive,\" May 4, 2017", "PolitiFact National, \"Headlines that say GOP bill makes sexual assault a pre-existing condition are misleading,\" May 5, 2017", "PolitiFact National, \"Michelle Obama claims that domestic violence counts as a pre-exisiting condition in some states,\" Sept. 21, 2009", "PolitiFact Florida, \"Does the GOP's new health care bill still cover pre-existing conditions, as Trump claims?\" May 1, 2017", "PolitiFact North Carolina, \"Does new version of the AHCA protect coverage for pre-existing conditions?\" May 4, 2017", "Email, Georgetown University Center on Health Insurance Reforms research professor Sabrina Corlette, May 5, 2017", "Email, Goodcare president Katy Votava, May 5, 2017", "Milwaukee Journal Sentinel, \"Will health care fight backfire on GOP?\" May 8, 2017", "Email, University of California, San Francisco Institute for Health Policy Studies director Claire Brindis, May 5, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]