["About this rating", "On Jan. 30, 2021, Snopes readers sought information to confirm or deny whether the Black Lives Matter movement — an international collection of groups advocating against racism in policing — was nominated for a Nobel Peace Prize.", "The answer was yes, a Norwegian member of parliament nominated the movement for the award in late January, according to multiple reputable news outlets and the movement's official Twitter account.", "Confirming that announcement, The Guardian reported on Jan. 29:", "In his nomination papers, the Norwegian [member of parliament] Petter Eide said the movement had forced countries outside the US to grapple with racism within their own societies.", "'I find that one of the key challenges we have seen in America, but also in Europe and Asia, is the kind of increasing conflict based on inequality,' Eide said. 'Black Lives Matter has become a very important worldwide movement to fight racial injustice.'", "Eide is a member of Norway's Socialist Left Party and the former secretary-general for Amnesty Norway. He previously nominated human rights activists from Russia and China for the Nobel Peace Prize, The Guardian reported.", "Any member of a national assembly or a head of state can submit nominations, under statutes governing the Nobel Foundation. The deadline for submission annually is February 1, about three days before Eide's nomination made headlines. After the nomination period closes, the five-member Norwegian Nobel Committee narrows the list of nominees and announces winners in October.", "We should note: The Nobel Foundation does not publicly reveal the names of nominees or nominators. However, we considered Eide's media interviews and The Guardian's citation of his nomination papers substantial evidence that he did, in fact, make the nomination.", "Snopes attempted to reach Eide for an interview about his decision to nominate Black Lives Matter, and we have not heard back. We will update this report when or if we hear from him.", "Black Lives Matter, a decentralized coalition of various social justice and political groups, formed in 2013 to protest a grand jury's decision to acquit George Zimmerman of homicide charges in the fatal shooting of Trayvon Martin, a Black teenager. The movement against systemic racism grew in size and recognition over the years and cities worldwide erupted in protest over the death of George Floyd, a Black man, in summer 2020.", "Speaking to USA TODAY on Jan. 30, Eide said his nomination was not a comment on domestic American politics but rather an appropriate recognition of a fight for racial justice, similar to the U.S. civil rights movement of the '50s and '60s and the anti-apartheid movement in South Africa.", "\"It’s a long-shot to see them receive the prize, but it’s quite important that we spark this discussion. That’s a contribution in itself,\" he told the news outlet.", "In fall 2020, after former U.S. President Donald Trump touted his nomination for the same prize as a \"big thing,\" Snopes did a deep analysis of the nomination process and criteria. Turns out, nominators represent a wide range of viewpoints and expertise, and the list of nominees is not always composed of worthy individuals. Read that full investigation here.", "In sum, it was true that Black Lives Matter was nominated for a Nobel Peace Prize in late January 2021, considering the citation of nomination papers and Eide's statements in reputable news reports, as well as the above-displayed tweet. No evidence existed to delegitimize the accuracy of his quotes or the news reports.", "Jessica Lee is Snopes' Senior Assignments Editor with expertise in investigative storytelling, media literacy advocacy and digital audience engagement.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]