["By Jessica McDonald", "Posted on October 14, 2020", "At campaign rallies and in tweets, President Donald Trump falsely said the World Health Organization changed its position and “admitted that Donald Trump was right” about lockdowns. But the agency has said no such thing.", "The president first made the inaccurate claim in a tweet just before the start of an Oct. 12 rally in Sanford, Florida.", "The World Health Organization just admitted that I was right. Lockdowns are killing countries all over the world. The cure cannot be worse than the problem itself. Open up your states, Democrat governors. Open up New York. A long battle, but they finally did the right thing!", "— Donald J. Trump (@realDonaldTrump) October 12, 2020", "At the rally, Trump echoed that sentiment after stating that former Vice President Joe Biden would institute a lockdown if elected president.", "Trump, Oct. 12: Biden would terminate our recovery, delay the vaccine, prolong the pandemic, and annihilate Florida’s economy with the draconian unscientific lockdown. That’s what he wants to do, lock it down. Lock it down, everybody. …", "But the World Health Organization, did you see what happened? They just came out a little while ago and they admitted that Donald Trump was right. The lockdowns are doing tremendous damage to these Democrat-run states where they’re locked out, sealed up, suicide rates, drug rates, alcoholism, death by so many different forms.", "We’ve previously explained that Biden said in an Aug. 21 interview with ABC News that he would shut down the country if that’s what scientists advised. He has since emphasized that he doesn’t think a lockdown would be necessary.", "A day after the Florida rally, Trump repeated the claim in a tweet attacking National Institute of Allergy and Infectious Diseases Director Dr. Anthony Fauci — who has pushed back against a Trump television ad that Fauci said took his words “out of context.”", "“WHO no longer likes Lockdowns – just came out against. Trump was right,” he wrote. “We saved 2,000,000 USA lives!!!”", "In another rally that night in Johnstown, Pennsylvania, the president again said that the WHO “said Trump was right” and boasted about having saved 2 million lives.", "The Trump campaign told us that the president was referencing statements recently made by WHO officials and directed us to two news articles highlighting comments by Dr. Mike Ryan, the executive director of the WHO’s health emergencies programme, and David Nabarro, one of the WHO’s special envoys on COVID-19.", "In one of the articles cited by the campaign, Ryan was quoted as saying this during an Oct. 9 press briefing: “What we want to try and avoid — and sometimes it’s unavoidable, we accept that, but what we want to try and avoid are these massive lockdowns that are so punishing to communities, to societies and everything else.”", "Nabarro’s remarks came from an Oct. 8 interview with the British magazine The Spectator. While Nabarro spoke at length, news outlets focused on his plea to world leaders to “stop using lockdown as your primary control method.”", "But Trump’s description of their remarks is inaccurate and incomplete. Neither man mentioned Trump or the U.S., and the WHO told us that its position on lockdowns has not changed — it has never recommended them as the primary strategy to control the virus, but recognizes that in some cases they may be needed.", "Trump also incorrectly suggested that “Democrat-run states” are currently in lockdown, when no state is shut down the way many were in the spring.", "Confusingly, Trump simultaneously claimed that 2 million American lives were saved — a dubious estimate — even though the stay-at-home orders most states issued this spring likely limited the number of COVID-19 deaths.", "While Trump’s takeaway from Ryan and Nabarro’s comments was that the WHO was reversing itself, that’s an inaccurate interpretation.", "“WHO has never advocated for national lockdowns as a primary means for controlling the virus. Dr Nabarro was repeating our advice to governments to ‘do it all,’” the agency’s press office told us in an email.", "“Governments, employers, communities should apply a package of proven public health measures that we know are effective for preventing transmission, including hand and respiratory hygiene, physical distancing, mask wearing, staying home if you’re sick, etc. as well as having robust systems for testing, isolating, tracing and quarantining, etc.,” the statement continued. “Measures to control COVID-19 depend on local risk assessments. Movement restrictions may be among a range of measures that governments can consider in certain geographical areas.”", "“If clusters and outbreaks do appear, they should be slowed and then suppressed promptly and that is why localised and targeted movement restrictions, implemented jointly by local actors and national authorities, are needed from time to time,” the press office added.", "Nabarro’s statements in the interview are entirely consistent with that assessment. He explained that the WHO backed a “middle way” strategy involving a robust testing, contact tracing and isolation system, along with getting the public on board with physical distancing, wearing masks and other similar measures.", "“If we can combine those various steps, what we call ‘doing it all,’ in our organization’s speak, then we can get on top of it,” he said, noting that that is exactly what many East Asian countries have done, along with Germany and parts of Canada.", "“We think lockdowns only serve one purpose, and that is to give you a bit of breathing space to stop everything,” Nabarro said. “The virus stops moving, and while you’ve got that breathing space, you should really be building up your testing, building up your contact tracing, building up your local organization.”", "Later, he emphasized that point again, saying, “We in the World Health Organization do not advocate lockdowns as a primary means of control of this virus. The only time we believe a lockdown is justified is to buy you time to reorganize, regroup, rebalance your resources, protect your health workers who are exhausted.”", "In an Oct. 13 Twitter thread, the agency also iterated its position, noting that lockdowns were not ideal, but might be necessary.", "“We understand that sometimes such measures – although not sustainable – are needed to swiftly suppress the virus and avoid health systems being overwhelmed,” the WHO said. “Lockdowns are not sustainable solutions because of their significant economic, social & broader health impacts. However, during the #COVID19 pandemic there’ve been times when restrictions were necessary and there may be other times in the future.”", "Related to Trump’s claim about the WHO is the idea that certain states — namely, Democratic states — are in lockdown and should reopen. But that’s a straw man argument, as no state is still under a highly restrictive stay-at-home order.", "According to a New York Times tracker, many states still have some kind of restriction in place, such as closures or capacity limits on certain businesses, most commonly restaurants and bars or entertainment venues and cinemas that are at higher risk for spreading the virus.", "These limits, however, are quite different from the more stringent orders 42 states and territories implemented in March through May, which frequently involved closing all nonessential businesses and required people to stay at home unless they were out for an essential activity.", "Previously, the president has inaccurately said that Michigan is “closed,” as we’ve written, even though the governor lifted the state’s stay-at-home order on June 1.", "As for New York, Gov. Andrew Cuomo announced new temporary restrictions for specific hotspot areas on Oct. 6, but this doesn’t mean the entire state is under a lockdown. Only six portions of five counties, which are concentrated in the New York City area, are affected.", "In the worst-off areas in New York, identified as “red zones,” only essential businesses can remain open; dining is limited to takeout only; in-person schools are closed; and there’s a capacity limit for houses of worship.", "The targeted approach, which the state developed with public health experts, is consistent with the WHO’s advice to keep movement restrictions localized.", "At the same time Trump is disparaging lockdowns in his tweets and rallies, he also mentions that 2 million American lives were saved — an odd feature to highlight, since state-issued stay-at-home orders likely helped avoid COVID-19 deaths.", "“We saved 2 million lives,” Trump said during his Johnstown rally. “They said 2.2 million people, we saved 2 million lives and you know we get nothing.”", "As of Oct. 14, more than 216,000 Americans have died from COVID-19, according to the Johns Hopkins University COVID-19 tracker — although the true death toll is almost certainly higher.", "We’ve explained before that an early model from Imperial College London projected in March that the U.S. could lose 2.2 million people to the pandemic. But that high death toll assumed no mitigation measures were used at all — and that people also wouldn’t modify their behavior.", "In other words, it’s not necessarily a realistic benchmark against which to measure the administration’s success.", "Research does support the idea that lockdowns — which were instituted by states, not Trump — saved lives earlier this year, although it’s hard to say how many.", "A paper published in the journal Nature concluded that lockdowns prevented some 60 million infections in the U.S., but didn’t venture a guess as to how many deaths were averted.", "Similarly, Columbia University researchers estimated that if the U.S. had implemented social distancing one week earlier in March, 36,000 fewer people would have died.", "Editor’s Note: Please consider a donation to FactCheck.org. We do not accept advertising. We rely on grants and individual donations from people like you. Credit card donations may be made through our “Donate” page. If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, 202 S. 36th St., Philadelphia, PA 19104.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here for more.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]