["The 55-second video has been viewed more than 270 times after it was published on Facebook here on April 11, 2020.", "The footage shows health care workers examining ripped protective gowns. Some of the workers' remarks in French translate to English as “As we can see; Here it is; The new blouses. They are torn apart, is it normal?”", "The post’s caption, written in both English and simplified Chinese, reads: “Medical protective clothing made in China”.", "Below is a screenshot of the misleading post:", "The posts circulated as countries worldwide face shortage of medical protective equipment due to the COVID-19 pandemic, which has resulted in at least 2.5 million infections globally, according to John Hopkins University figures as of April 22, 2020.", "The footage was also shared alongside a similar claim here on Facebook and here on Twitter.", "The claim is false. A keyword search found that Le Parisien, a French daily newspaper, published the same video on YouTube here on April 6, 2020.", "The footage appears in the first 23 seconds of the video. It is titled “Coronavirus: torn overcoats delivered to a hospital in Marseille”. The video’s description reports that the footage was filmed at a hospital under the Assistance Publique – Hôpitaux de Marseille (AP-HM) authority.", "The video was credited to Cyril Navarro-Diaz, who published it here on Facebook on April 5, 2020. The French-language caption translates to English as: \"Yesterday at the Timone... Let's not forget!!! Let's never forget!!!\" The caption refers to the Timone Hospital in Marseille.", "In an email to AFP, a spokesperson for AP-HM clarified the protective gear seen in the footage was produced in France, adding that it became damaged in storage before the COVID-19 crisis.", "“Apparently the boxes were stored in a humid place, which damaged the overcoats inside,” the hospital authority wrote on April 6, 2020.", "On the same day, the hospital authority published an official press release which stated that the gowns became damaged in storage before the pandemic.", "AP-HM also provided more details about the damaged equipment in a separate email to AFP on April 15, 2020.", "“This batch of 20,400 over-blouses, 300 of which were defective because they were badly stored (explanation given by the AP-HM at their press conference on 6 April) had been produced in France and not in China,” the hospital wrote.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]