["Sen. Richard Durbin, D-Ill. | Ashlee Rezin/Sun-Times", "Following last month’s Democratic National Convention, U.S. Sen. Dick Durbin said Democrats would better handle the coronavirus and the nation’s economy if they take control of the Senate next year.", "\"We have a worse economy than any other country in the world that’s going through COVID-19 by a factor of three,\" Durbin said on the \"Connected to Chicago\" podcast hosted by WLS-AM’s Bill Cameron.", "While the U.S. economy has been struggling in the aftermath of shutdowns caused by the pandemic, the Aug. 23 claim drew a very stark comparison between the U.S. and the rest of the world that we had never heard. So we decided to check it out.", "Asked repeatedly to provide records, studies or any other support to back up the claim, Durbin’s staff did not respond.", "So we turned to experts and myriad data collected by economists to compare the U.S. economy to other countries. Experts we interviewed agreed the most effective measure is gross domestic product, or GDP.", "\"I don’t think it’s true that our economy is worse than any other country by a factor of three,\" said Harry Holzer, a Georgetown University public policy professor who has studied the effects of COVID-19 on the economy.", "One publication experts commonly use for such comparisons is Our World in Data, a nonprofit based at Oxford University, which compiles and republishes statistics collected worldwide.", "On Sept. 1, Our World in Data published an examination of the health and economic impacts of the pandemic among 38 countries based on available GDP for the second quarter, which ended June 30. In it, the U.S. ranked above 24 other countries in a comparison to the same period in 2019.", "Among the two dozen countries doing worse than the U.S were the United Kingdom, Spain, France, Canada and Mexico, according to the study. Peru experienced the worst economic decline at 30% for the second quarter. The U.S sustained a GDP decline of 9.5%, the report said.", "Since Durbin made his claim about the U.S. having the worst economy during a discussion about unemployment, we decided to check that indicator to see whether the senator might have meant the U.S. jobless rate was three times worse than anywhere else in the world.", "In June, Holzer published a report with the Brookings Institution examining how COVID-19 had affected health and employment in 25 wealthy nations. He found the increase in unemployment during the first months of the pandemic was larger in the U.S. than in any of the other countries he reviewed. From January to April, data in his report shows, the U.S. unemployment rate quadrupled to 14.7%.", "That doesn’t mean the jobless rate here was several times worse than any other nation’s, or even increased at triple the rate of all other countries. For instance, Canada’s unemployment rate jumped to 13% in April, more than double where it stood in January. While the U.S. experienced a somewhat sharper increase, it was not worse by a factor of three, as Durbin stated.", "We did find an assertion similar to Durbin’s made at the Democratic convention by former president Bill Clinton.", "\"Donald Trump says we’re leading the world,\" Clinton declared. \"Well, we are the only major industrial economy to have its unemployment rate triple.\"", "PolitiFact found Clinton’s claim about the unemployment rate to be Mostly True.", "Holzer, who served under Clinton as chief economist at the U.S. Department of Labor, said if Durbin was attempting to repeat Clinton’s claim, \"he mangled it.\"", "Durbin said, \"We have a worse economy than any other country in the world that’s going through COVID-19 by a factor of three.\"", "As of August, when Durbin made his remarks, available data for the second quarter showed U.S. GDP declined by 9.5% relative to the same period last year, better than two dozen other countries around the world. And while other economic indicators such as unemployment rates showed the U.S. economy suffered staggering losses, they were not worse by a factor of three, according to published data and experts.", "We rate Durbin’s claim False.", "FALSE — The statement is not accurate.", "Click here for more on the six PolitiFact ratings and how we select facts to check.", "Connected to Chicago, WLS, Aug. 23, 2020", "Phone interview: Harry Holzer, professor of public policy at Georgetown University, Sept. 8, 2020", "Economic decline for the second quarter of 2020, Our World in Data, Sept. 1, 2020", "\"The COVID-19 crisis: How do U.S. employment and health outcomes compare to other OECD countries?\" Brookings Institution, June 2, 2020", "\"Bill Clinton mostly accurate on international unemployment comparison,\" PolitiFact, Aug. 18, 2020", "Zoom interview: Andrew T. Levin, professor of economics at Dartmouth College, Sept. 22, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]