["The article by Alternative News Network dates from May 29, 2017 and has been shared thousands of times on Facebook pages including ‘Illuminati Exposed (This is the resistance)’, which has more than one million followers.", "The article headlined ‘Courts quietly confirm MMR vaccine causes autism’ says: “courts, governments and vaccine manufacturers have quietly conceded the fact that the Measles Mumps and Rubella (MMR) vaccine most likely does cause autism and stomach diseases”. It repeats claims published in a 2013 article by The Liberty Beacon website. A second article citing The Liberty Beacon is also circulating in French.", "“Pharmaceutical companies have even gone so far as to pay out massive monetary awards, totaling in the millions, to the victims in an attempt to compensate them for damages and to buy their silence,” Alternative News Network says.", "The article bases these claims on two cases dating back to 2012 where children were awarded hundreds of thousands of dollars by the US National Vaccine Injury Compensation Program.", "In the first case, the parents of Ryan Mojabi, then aged nine, claimed that their son suffered “a severe and debilitating injury to his brain, described as Autism Spectrum Disorder” after receiving several vaccinations between 2003 and 2005, including “more specifically, measles-mumps-rubella (MMR) vaccinations” (see below).", "In fact, the US court found no link between the MMR vaccination and autism, contrary to what Alternative News Network says.", "The court actually found that Ryan suffered encephalitis (inflammation of the brain) within five to fifteen days of his first MMR vaccination on December 19, 2003. They awarded nearly a million dollars in compensation to Ryan’s family.", "Brain damage is a very rare possible side effect of the MMR vaccine, according to the US Centers for Disease Control and Prevention’s website.", "In the second case, the Alternative News Network says a girl named Emily -- daughter of Jill Lowrie -- “won compensation following vaccine-related brain injury that, once again, involved MMR and resulted in autism”.", "This claim was reported in a Huffington Post article in January 2013. Its author David Kirby said the US vaccine court awarded Emily’s family millions of dollars after they alleged she was \"severely injured by a reaction to the DTaP vaccine at 15 months (when MMR, HiB and prevnar were also given)\". He added that Emily \"has seizure disorder and PDD-NOS, a form of ASD (autism spectrum disorder)\".", "But the US Department of Health and Human Services (HSS) \"did not admit that vaccination caused encephalopathy or autism\", he says.", "The alleged link between the MMR vaccination and autism is added into the Alternative News Network’s article, published four years later.", "However, the ruling in Emily’s court case does not mention the words ‘MMR’ or ‘autism’. It actually says her mother, Jillian, claims she suffered brain inflammation after receiving a diphtheria, tetanus and a cellular pertussis (DTaP) vaccination.", "The ruling refers to Jillian Lowrie rather than ‘Jillian Moller’, as the woman is named in the Huffington Post article, but includes the same dates and first names for the woman and child.", "Emily was awarded a lump sum of more than one million dollars, plus several hundreds of thousands of dollars for \"lost future earnings\", \"pain and suffering\" and \"life care expenses\", as the Huffington Post article mentions.", "The US ‘vaccine court’ – the National Vaccine Injury Compensation Program – was rolled out in the 1980s when lawsuits against vaccination companies and healthcare providers \"threatened to cause vaccine shortages and reduce U.S. vaccination rates, which could have caused a resurgence of vaccine preventable diseases\", the programme says on its website.", "Brain inflammation is recorded in fewer than one in 10 million doses, the French medical agency (ANSM) says. “The risk of developing brain inflammation after receiving a vaccine is much lower than the risk of developing it because of natural infections,” ANSM added.", "It’s worth noting that many people with autism do suffer from brain inflammation, as this 2015 study says. But “it would be false to say that the measles vaccination can cause autism because inflammation of the brain can cause autistic spectrum problems,” said professor Kumaran Deiva, head of paediatric neurology at Bicêtre hospital in France.", "“You will not find, except well-established genetic causes, any viral infection which causes autism,” he told AFP. “Inflammation of the brain can cause autistic traits, but not ‘real’ autism, which is characterised by language, behaviour and social interaction difficulties.”", "Alternative News Network also bases its claims on a study published in The Lancet medical journal in 1998 by British doctor Andrew Wakefield. The site says that Ryan Mojabi and Emily Moller’s cases “confirmed Dr. Wakefield’s original concern” about the link between the MMR vaccination and autism.", "However, Andrew Wakefield was struck off as a doctor in the UK and the study was retracted from The Lancet in 2010 after it was found the study included falsified data.", "The World Health Organization (WHO) warned that the study caused “panic that led to dropping immunization rates” and “subsequent outbreaks” of diseases. “There is no evidence of a link between MMR vaccine and autism or autistic disorders,” it added.", "The number of measles cases rocketed by 50 percent last year, the WHO said on February 14. Cases of the disease had already spiked 30 percent between 2016 and 2017.", "“The increase in measles cases is deeply concerning, but not surprising,” Dr Seth Berkley, CEO of Gavi, the Vaccine Alliance said. He said, “complacency about the disease and the spread of falsehoods about the vaccine in Europe” had contributed to its spread.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]