["The claim: The U.S. House of Representatives introduced an assault weapons ban bill", "The Facebook page Military Arms Channel stated in a post in March that a bill introduced in the House of Representatives, if passed, would ban assault weapons.", "The post called on its audience to contact their representatives in protest. It garnered 12,000 shares and more than 800 comments and attracted the attention of gun rights groups including the Firearms Policy Coalition, the Gun Owners of America and the National Rifle Association.", "Many of these organizations exaggerated the extent of the legislation, falsely claiming the bill would allow the federal government to repeal the Second Amendment and seize guns possessed illegally without prior notice or the right to due process.", "But the Facebook post on the Military Arms Channel is valid.", "Rep. Hank Johnson, a Georgia Democrat who sits on the House Judiciary Committee, on Jan. 30 introduced H.R. 5717, which would, among other items, ban the purchasing and possession of assault weapons. Sen. Elizabeth Warren, D-Mass., introduced in February the Senate version of the bill, S.3254.", "\"The Gun Violence Prevention and Community Safety Act will save lives and make our country safer – without infringing on any law-abiding individual’s right to own firearms,\" Johnson said in a news release issued as the bill was filed. \"This comprehensive bill is a compilation of the best ideas to create a workable set of laws that will strengthen life-saving background checks, protect communities with bolstered enforcement, improve mental health services and fuel research to make guns safer.”", "The legislation introduced a variety of reforms with the intent to \"end the epidemic of gun violence and build safer communities by strengthening Federal firearms laws and supporting gun violence research, intervention, and prevention initiatives.\"", "The bill addresses background checks, taxes on firearms and goods related to firearms, gun storage, accessibility of guns on school campuses and more.", "It would require state law enforcement authorities to be notified when a background check is denied and mandate the attorney general to issue an annual report to Congress detailing the number of background check denials.", "It would also necessitate all firearm owners to obtain a federal firearms owner’s license, although purchases made before the enactment of the bill are exempt.", "And the bill, as correctly stated by the Military Arms Channel, would make it illegal “to import, sell, manufacture, transfer, or possess, in or affecting interstate or foreign commerce, a semiautomatic assault weapon.”", "Gun-rights advocates and gun-control advocates have long argued over the definition of what constitutes a semiautomatic assault weapon. The bill defines a semiautomatic assault weapon as any firearm with the capability to “accept a detachable magazine” and either a pistol grip, forward grip, grenade launcher, barrel shroud, threaded barrel or a folding, telescoping or detachable stock.", "The ban has a few exceptions. Law-enforcement officers can possess these firearms as can those who are providing security at nuclear energy facilities. Firearms that are “manually operated by bolt, pump, lever or slide action,” have “been rendered permanently inoperable” or are antique are exempt from the ban as well.", "The bill has not yet passed the Democrat-controlled House. In order to become law, the Republican-controlled Senate would have to pass it and the president would have to sign it.", "It has 18 co-sponsors, all Democrats, including Rep. Joseph Kennedy of Massachusetts, Rep. Mike Quigley of Illinois, Rep. Anthony Brown of Maryland and Rep. Joseph Morelle of New York.", "The Gun Violence Prevention and Community Safety Act of 2020 is not the first of its kind. Congress enacted a 10-year assault weapon ban that was in effect from 1994-2004. Democrats also attempted to pass an assault weapons ban in 2013 following the Newtown shootings at Sandy Hook Elementary School.", "Just as Johnson's bill has not passed the House, Warren's bill has not passed the Senate.", "Rep. David Cicilline, D-R.I., sponsored in February 2019 a semiautomatic assault weapon ban that the House didn't pass.", "The claim on the pro-gun Facebook page that an assault weapons ban bill was introduced in the House is TRUE. If passed, H.R. 5717 would ban semiautomatic assault weapons."]