["About this rating", "In July 2015, many online viewers were intrigued by a meme reporting that Brian May, the lead guitarist for the band Queen, is also an astrophysicist.", "While Brian May's educational history is certainly no secret, interest in the rock legend's other life as an astrophysicist was renewed when the musician visited the team behind NASA's New Horizons interplanetary space probe to discuss results from the probe's recent fly-by of Pluto:", "As lead guitarist for the legendary rock group Queen, Brian May has spent an entire career in the spotlight. But May traded the music for his other passion — science — and spent some time backstage with the New Horizons team as it dived into the first results from the Pluto flyby.", "May, who has a doctorate in astrophysics, was awed by the opportunity to meet the team and sift through images and other Pluto system data in real time. And he'll have other opportunities down the road, as mission principal investigator Alan Stern added May as a New Horizons science collaborator.", "May also wrote about his time with the New Horizon's team in a blog post  on his web site dated 20 July 2015:", "I had an unforgettable 3 days with the amazing New Horizons team. I’m still 'coming down’. Alan Stern, leader of the Science Team at APL in Laurel, Maryland, personally made sure I was treated like one of the family, as a collaborator, and I felt privileged to the nth degree.", "I was, of course, as always, obsessed with finding stereoscopic opportunities while I was there, and the Gods of the Underworld must have been with me, because I was there when the first 2 by 2 mosaic full-planet picture was downloaded from the probe, and assembled into exactly the required highish res partner to the iconic ‘last-look’ photo which preceded the final fly-by. Baseline must be a few hundred thousand miles, but I’ll need to check that. Of course the New Horizons guys were already doing serious science on this image as it arrived, but I was able to assemble the two images to make the most satisfying stereo view I can ever remember making. I got some help making some prints on site, so I was able to show this 3-D to the entire team through the lenses of some OWLS I took over.", "So this is definitely the first REAL high quality stereo image of Pluto in history. And we can say it’s officially NH approved !", "No fiddling this time. The right image is the ‘last-look’ photo from 15th July, and the left image is the ‘two-by-two downloaded from NH on the 17th.", "All I did was fine-adjust the orientations to match up, and match up the colouring by eye.", "According to May's official biography, he was working toward his PhD in astrophysics when he put his education on hold to go on tour with Queen after the group's \"popularity first exploded.\" In 2007, more than 30 years after May left school to pursue a career as a musician, he turned in his 48,000-word thesis for the Imperial College, London:", "It's been the longest gap year ever. It was a tough decision back then to leave my studies for music.", "I'm so proud to be here today. Astronomy has always interested me. I used to love sitting at home and watching Sir Patrick Moore on the Sky at Night.\"", "https://youtu.be/E-zurr9PHKg", "In terms of educated rock guitarists, music fans may also recall that Tom Scholz, founder of the popular band Boston, holds a master's degree in mechanical engineering from the Massachusetts Institute of Technology and worked for Polaroid Corporation as a senior product design engineer prior to hitting it big in the music world.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]