["About this rating", "According to one government database, the U.S. has had at least one shooting on K-12 school properties every March from 2003 through 2009, and every March since (but not including) 2010.", "However, the way that various U.S. government agencies and organizations define a \"school shooting\" varies greatly, making any numerical claims problematic. Also, by the standards of one key government database, the U.S. had eight — not zero — school shootings in March 2020.", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "To prevent the spread of the COVID-19 coronavirus disease, state leaders across the U.S. ordered widespread school closures in March 2020. In the weeks that followed, millions of students spent their days at home instead of in classrooms. Some teachers and staff moved lessons online, and administrators locked the doors to school buildings so the general public could not enter.", "The closures were among the most dramatic steps by state leaders to combat the novel coronavirus that has killed more than 58,300 people globally as of this writing in mid-April 2020. About 56.6 million students registered for elementary or secondary school classes in the U.S. at the start of the 2019-20 academic year, according to the National Center for Education Statistics.", "While a disruption to students' learning, the shutdowns in America may have provided an unintended benefit, beyond limiting people's exposure to the virus. On April 13, 2020, a journalist tweeted to his some 49,600 followers: \"Last month was the first March without a school shooting in the United States since 2002.\"", "The reporter, Robert Klemko, quickly gained Twitter popularity among Americans who believe federal and state leaders should enact stricter gun laws, including former U.S. Secretary of State Hillary Clinton. \"It shouldn't have taken a pandemic to make this possible,\" her Twitter account wrote in a retweet of Klemko's post.", "Meanwhile, Facebook users shared screenshots of Klemko's tweet, and one Instagram account for a website that brands itself as a fact-checking service on that platform posted a photograph of a law-enforcement officer monitoring students boarding a school bus with Klemko's claim as overlay text. Among media sites, CBS News published a story stating the assertion as fact.", "\"My teens said this is the first time they have relaxed. No need to be hyper vigilant of every unusual sound, can just focus on school work,\" one person tweeted. \"Both grew up with regular Active Shooter Drills since kindergarten.\"", "The claim about school shootings since 2002 is twofold: It asserts that no school shootings occurred in the U.S. in March 2020 and that every March between 2003 and 2019 documented at least one such incident. But because agencies across government and the news media do not share a consistent way for tracking and defining school shootings, the truth of both assertions depends on whom you ask.", "The U.S. Secret Service and FBI, for example, provide an explanation of factors that contribute to school shootings but do not keep a running list of all on-campus gun crimes. Academics and school officials often rely on news media reports for their research, though journalists may not cover every shooting.", "The nation's biggest guns-rights group, the National Rifle Association, does not publish a running tally of shootings in schools, yet it has convened researchers to compile recommendations on how to avoid such incidents, like other organizations. Meanwhile, a leading opponent of the NRA — the lobbyist group Everytown for Gun Safety — has tracked all \"incidents of gunfire\" in K-12 schools and colleges, including suicides; shootings in which no one suffered injuries; and cases where the victims or gunmen may not have any connection to the school, since 2013.", "Those prominent advocacy groups aside, the least partisan and most comprehensive source of school-shooting data appears to be the \"K-12 School Shooting Database\" sponsored by the U.S. Center for Homeland Defense and Security (CHDS) and the Federal Emergency Management Agency (FEMA). Updated daily by emergency-management researchers, the database records \"each and every instance in which a gun is brandished, fired, or a bullet hits school property for any reason, regardless of the number of victims, time of day, or day of week,\" according to its stated methodology. Its website summarizes the tricky situation analyzing school-shooting data as follows:", "Without a common methodology for data collection, individual data sources are limited in both validity and utility. Furthermore, there is no consensus for what actually defines a school shooting ... Based on the differences among all available reporting platforms, there is currently no single source for objective and accessible data from which school administrators, law enforcement, and public officials can draw to inform their decisions.", "With that as background, administrators of the CHDS-sponsored K-12 database documented eight incidents fitting its definition of a \"school shooting\" in March 2020. Local news media reports affirm those findings. The incidents include:", "Regarding the claim that March 2020 was the first March without a school shooting since 2002, the data is more murky. The CHDS-sponsored database lists at least one incident in U.S. K-12 schools in March of every year from 2003 through 2009, and every year from 2011 through 2020, but none in 2010. Supporting that finding, tallies of K-12 school shootings by the for-profit National School Safety and Security Services consulting firm and the advocacy group the National School Safety Center do not show a March 2010 incident.", "However, those sources only consider shootings on U.S. elementary, middle and high school properties. If you expand the scope of research to also include shootings on college campuses, Ohio State University documented a deadly shooting on March 9, 2010. According to the New York Times' coverage of the incident, officials said a custodian of the school shot and killed a co-worker before killing himself in a maintenance building. Another person was wounded in the gunfire.", "We reached out to Washington Post reporter Klemko — the author of the viral claim — to understand where he got his numbers. He said he did include cases involving post-secondary institutions, rather than only focusing on K-12 schools.", "But unlike other datasets, he said he only considered shootings in which students, teachers, or staff were the targets of the gunfire or the perpetrators. In other words, he said he did not consider cases where people trespassed on school property and opened fire at other people who aren't part of the school community. He also did not consider cases in which persons (no matter their affiliation with the school) accidentally discharged a gun or shootings on school properties outside of school hours or on weekends.", "\"I used shootings on school property, k-12, vocational schools, colleges and universities, where students or staff were intentionally shot at, or doing the shooting,\" he wrote in an email. \"Where government and private data were inconclusive, news reports filled the gaps.\"", "Looking at the comprehensive standards by which the CHDS-sponsored database documents shootings, he said \"it's a mistake\" to consider the database's definition of a \"school shooting\" as the most fair. \"Few Americans would agree, for example, that an incident where a safety officer accidentally fires a gun in an office, injuring no one, constitutes a school shooting,\" he said. \"Likewise, few would agree that adults trespassing on school grounds and exchanging gunfire when school is not in session and no children are present, is a school shooting.\"", "In sum, given the absence of a universal definition of \"school shooting\" in the U.S., and given that a government database and news media reports show at least eight shootings did occur on school properties in March 2020, we rate this claim as \"Mostly False\".", "Simone Burns, Asia.   \"3 in hospital after shooting in DeKalb elementary school parking lot\".\r\n   The Atlanta Journal-Constitution.   31 March 2020.", "KNOE 8 News.   \"Monroe Police have made multiple arrests in connection to a parking lot shooting at Roy Shelling Elementary School\".\r\n   24 March 2020.", "KTBS 3 ABC.   \"Shreveport high school parking lot shooting, 1 wounded\".\r\n   19 March 2020.", "McCord, Cory.   \"Man wanted, accused of deadly shooting during pickup football game at Atascocita HS\".\r\n    KHOU 11.   15 March 2020.", "London, Derry.   \"SRO accidentally fires gun inside elementary school\".\r\n   News 4.   13 March 2020.", "Lee, Lauren.   \"None hurt, suspect in custody after bullet strikes school van in Shenango\".\r\n   Pittsburgh Post-Gazette.   10 March 2020.", "Smalls II, Isaiah.   \"He brought a gun to school. He ended up shooting the maintenance man in the eye, cops say\".\r\n   Miami Herald.   6 March 2020.", "Scudder, Charles.   \"Student in custody after gun was 'accidentally discharged' at North Forney High School\".\r\n   The Dallas Morning News.   2 March 2020.", "Purdum, Todd.   \"Shooting at School Leaves 2 Dead and 13 Hurt\".\r\n   The New York Times.   6 March 2001.", "U.S. Department of Homeland Security, United States Secret Service.   \"Protecting America's Schools: A U.S. Secret Service Analysis of Targeted School Violence\".\r\n   Accessed 16 April 2020.", "Federal Bureau of Investigations.   \"The School Shooter: A Thread Assessment Perspective\".\r\n   Accessed 16 April 2020.", "The Washington Post. \"Robert Klemko\".\r\n   Accessed 14 April 2020.", "Education Week.   \"Map: Coronavirus and School Closures\".\r\n   13 April 2020.", "National Center for Education Statistics.   \"Fast Facts\".\r\n   Accessed 14 April 2020.", "Johns Hopkins University and Medicine.   \"Coronavirus COVID-19 Global Cases by the Center for Systems Science and Engineering.\"\r\n   Accessed 14 April 2020.", "Lewis, Sophie.   \"March 2020 was the first March without a school shooting in the U.S. since 2020\".\r\n   CBS News.   14 April 2020.", "Riedman, David, and Desmond O’Neill.   \"CHDS – K-12 School Shooting Database\".\r\n   Center for Homeland Defense and Security.   15 April 2020.", "Hutchinson, Asa.   \"The National School Shield: Report of the National School Shield Task Force\".\r\n   National Rifle Association.   2 April 2013.", "Everytown for Gun Safety.   \"Gunfire on School Grounds in the United States\".\r\n   Accessed 16 April 2020.", "Riedman, David, and Desmond O’Neill.   “CHDS – K-12 School Shooting Database.\"\r\n   Center for Homeland Defense and Security.   16 April 2020.", "Riedman, David, and Desmond O’Neill.   “CHDS – K-12 School Shooting Database.\"\r\n   Center for Homeland Defense and Security.   16 April 2020.", "National School Safety Center.   “The National School Safety Center’s Report on School Associated Violent Deaths”.\r\n   Accessed 16 April 2020.", "National School Safety Center.   “The National School Safety Center’s Report on School Associated Violent Deaths”.\r\n   Accessed 16 April 2020.", "National School Safety and Security Services.   “School-related deaths, school shootings, & school violence incidents: 2009- 2010 School Year Incidents Identified by National School Safety and Security Services, Inc”.\r\n   Accessed 16 April 2020.", "National School Safety and Security Services.   “School-related deaths, school shootings, & school violence incidents: 2009- 2010 School Year Incidents Identified by National School Safety and Security Services, Inc”.\r\n   Accessed 16 April 2020.", "Urbina, Ian.   “Ohio State Employee Kills Co-Worker, Then Self, Police Say”.\r\n    The New York Times.   9 March 2010.", "Urbina, Ian.   “Ohio State Employee Kills Co-Worker, Then Self, Police Say”.\r\n    The New York Times.   9 March 2010.", "Jessica Lee is Snopes' Senior Assignments Editor with expertise in investigative storytelling, media literacy advocacy and digital audience engagement.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]