["About this rating", "In late January 2017, news outlets across the United States reported on a purported \"can you hear me?\" telephone scam. According to those reports, the scam begins with an unsolicited phone call to the putative mark. After the caller makes contact they ask the recipient \"Can you hear me?\" to elicit a response of \"yes,\" and a potential onslaught of unauthorized charges ensues.", "On 26 January 2017, CBS News reported the workings of the scam thusly:", "Virginia police are now warning about the scheme, which also sparked warnings by Pennsylvania authorities late last year. The \"can you hear me\" con is actually a variation on earlier scams aimed at getting the victim to say the word \"yes\" in a phone conversation. That affirmative response is recorded by the fraudster and used to authorize unwanted charges on a phone or utility bill or on a purloined credit card.", "\"You say 'yes,' it gets recorded and they say that you have agreed to something,\" said Susan Grant, director of consumer protection for the Consumer Federation of America. \"I know that people think it's impolite to hang up, but it's a good strategy.\"", "But how can you get charged if you don't provide a payment method? The con artist already has your phone number, and many phone providers pass through third-party charges.", "At first glance, the warning sounded reasonably valid: major news outlets covered it, and a Better Business Bureau satellite office reported the scam as well. But a closer examination revealed some questionable elements.", "Primarily, we haven't yet been able to identify any scenario under which a scammer could authorize charges in another person's name simply by possessing a voice recording of that person saying \"yes,\" without also already possessing a good deal of personal and account information for that person, and without being able to reproduce any other form of verbal response from that person.", "Moreover, even if such a scenario existed, it's hard to imagine why scammers would need to utilize an actual audio recording of the victim's repeating the word \"yes\" rather than simply providing that response themselves. As far as we know, phone companies, utilities, and credit card issuers don't maintain databases of voice recordings of their customers and use them to perform real-time audio matching to verify identities during customer service calls.", "In all the news reports we found, interviewees merely reported having been asked the common question (\"Can you hear me?\") but did not aver that they themselves had fallen prey to scammers:", "Lori Goodwin, who lives in Tampa, has been getting about three of these calls every week for the last several months.", "\"If you hear someone say 'I can't hear you' or 'Can you hear me,' the first reaction you have is to say 'Yes,'\" she said. \"It's almost instinctual, so that's what they're looking for.\"", "Goodwin said she's always just hung up the phone, but she didn't realize until recently how dangerous those calls can be.", "When Mary Kuczborski of Clinton Township answers her phone, she doesn't expect to be hit with questions.", "But that's what happened Thursday evening.", "\"When it came on it was a gentleman, nice voice, and he says, 'can you hear me?,'\" Kuczborski said.", "Mary was the latest intended victim of a nationwide scam. Asking 'can you hear me?' is aimed at getting the victim to say 'yes.'", "The response is recorded by the scammer and then used to authorize unwanted charges on phone or utility bills or credit cards.", "Consumer protection experts say it may be rude, but if you get a 'can you hear me' call, the right response is to just hang up.", "Mary was a little more colorful.", "\"Now, what do you want? And it went click,\" she said.", "BBB of Western Pennsylvania warned of the scam on 18 October 2016 but described no specific instances of individuals being scammed. That BBB satellite referenced the organization's nationwide Scam Tracker, but all related entries we found there were submitted by people already aware of news reports about the purported scam:", "A CBS News report on the purported \"Can you hear me?\" had prompted police warnings in 2016, but yet again we found no indication that anyone who had actually been scammed out of money by saying \"yes\" to a caller had stepped forward. (It's not uncommon for police departments to spread dubious crime warnings on a \"better safe than sorry\" basis, such as one about a $100 bill carjacking ploy.)", "The \"Can you hear me?\" scam for now seems to be more a suggestion of a hypothetical crime scheme than a real one that is actually robbing victims of money. In messages we left with the BBB, the FTC, and the Consumer Federation of America, we asked a question absent from all the news reports we've encountered about this scam: \"Are there any documented cases of people being victimized in this manner?\" We have not yet received any affirmative response to those queries.", "Jackson, Curtis.   \"Nationwide 'Can You Hear Me' Phone Scam Targets Michigan Residents.\"     WXYZ.   26 January 2017.", "Kristof, Kathy.   \"Beware New 'Can You Hear Me' Scam.\"     CBS News.   26 January 2017.", "Trimble, Grady.   \"'Can You Hear Me?' Phone Scam Reaches Tampa.\"     WTSP.   26 January 2017.", "Better Business Bureau of Western Pennsylvania.   \"BBB Scam Alert: Can You Hear Me?\"     18 October 2016.", "Better Business Bureau.   \"Scam Tracker.\"     Accessed 27 January 2017.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]