["About this rating", "In October 2019, we received multiple inquiries from readers about the veracity of reports that Canadian Prime Minister Justin Trudeau was about to be embroiled in a major sex scandal involving his tenure as a teacher at the West Point Grey Academy in Vancouver between 1998 and 2001.", "On Oct. 7, for example, the Buffalo Chronicle website published an article under the headline \"Trudeau is Rumored to Be in Talks With an Accusor to Suppress an Explosive Sex Scandal,\" which reported that:", "Less than two weeks ahead of federal elections that have already been looking conclusively grim for Prime Minister Justin Trudeau, rumors of an explosive sex scandal are percolating at the highest echelons of Canada's media establishment.", "Ottawa's longest-tenured political observers had been expecting a career-ending expose in Saturday's edition of The Globe and Mail -- but that story never came. Sources are now telling The Chronicle that Trudeau is in private talks with the principal source of that piece to suppress explosive sex allegations that, if made public, would likely force Trudeau to resign his office.", "Trudeau's accuser is said to be a former student at West Point Grey Academy and the daughter of a wealthy Canadian businessman. Sources tell The Chronicle that she is being represented by counsel and is being offered monetary compensation in exchange for a pending, but not yet signed, non-disclosure agreement.", "On Oct. 6, a Facebook page called \"The Global Informer\" posted a meme featuring a photograph of Trudeau along with the claim he \"Ended teaching job due to having inappropriate relations with student\":", "On Sep. 30, the Canadian magazine Frank, which publishes a mixture of political satire, news and gossip, posted an article reporting a slightly different version of the rumor:", "Another account has it that Trudeau left the [school] in a hail of bullets because he'd been getting a legover with a certain 'Gloria W.,' who also happened to be the mother of one of his students. When Gloria's husband took his sad tale of cuckoldry to school brass, Trudeau 'fessed up and resigned ...", "As the website Canadaland reported, the evidence-free rumors of Trudeau's alleged sexual relations with either a student or a student's mother were accompanied by additional evidence-free rumors that the Liberal Party prime minister had attempted to cover up the story.", "On Oct. 4, the Canadian columnist and political consultant Warren Kinsella tweeted out a photograph of Trudeau posing alongside several young women, an image that reportedly came from the 2000 edition of the West Point Grey Academy yearbook. Kinsella hinted that the next day's Globe and Mail newspaper might feature a related story about the Canadian prime minister, writing \"I always encourage people to read the Toronto Sun. Naturally, but they might also want to read the Globe and Mail tomorrow. My Spidey sense is tingling\":", "I always encourage people to read @TheTorontoSun, Naturally,but they might also want to read the @globeandmail tomorrow too. My Spidey sense is tingling.#elxn43 #cdnpoli pic.twitter.com/vLzMnHiB6a", "— Warren Kinsella (@kinsellawarren) October 4, 2019", "When no such story emerged on Oct. 5, some observers claimed this was evidence that Trudeau or his representatives had sought to suppress its publication, or that a non-disclosure agreement was hastily being arranged in order to silence the person with whom Trudeau was purported to have had a sexual relationship. Hence the Buffalo Chronicle's claim, quoted above, about the non-appearance of an expected Globe and Mail piece on the putative scandal.", "Canadian political reporters were certainly looking into the West Point Grey Academy rumors in early October 2019, but as of Oct. 9 nothing had emerged publicly to substantiate those rumors.", "In a press conference on Oct. 4, the Globe and Mail's Marieka Walsh invited Trudeau to address the allegations (without repeating them), and asked him why he had left his teaching post at the school. Trudeau responded: \"I moved on, and I have great memories of an excellent time teaching in Vancouver in public and private schools.\"", "Walsh later followed up by asking the prime minister whether he had signed a non-disclosure agreement about his departure from the school. Trudeau answered with an unequivocal \"No.\" Walsh asked again why he had left the school, and Trudeau answered \"Because I was moving on in my career\":", "<span data-mce-type=\"bookmark\" style=\"display: inline-block; width: 0px; overflow: hidden; line-height: 0;\" class=\"mce_SELRES_start lazy_load_iframe\">﻿</span>", "Similarly, the headmaster of West Point Grey Academy at the time Trudeau worked there, Clive Austin, responded to multiple inquiries from reporters, writing in a statement that:", "I can tell you with complete certainty that there is no truth to any speculation that he was dismissed ... [He] told me he had enjoyed his first few years of teaching, yet was considering a return to Montreal in a year or so to continue his university studies ... I wished Justin well, and with a smile, said I thought he'd one day find himself in politics at some level. As far as I was concerned we parted company on good terms.", "Previously, Trudeau had said that he left the West Point Grey Academy in part due to a disagreement with administrators over school policies, and in particular after an episode involving the student newspaper, of which he was the staff moderator. In his 2014 memoir \"Common Ground,\" Trudeau wrote of the subject that:", "Sometimes my teaching methods put me at odds with the conservative West Point Grey administrators. The most significant event concerned a student I'll call Wayne, who regularly defied the school's dress code by wearing his tie loose and dangling a chain from his belt. He was a smart, confident kid who chose to adopt a rebel pose. One day, after receiving the umpteenth dressing-down about his attire, Wayne said to me, \"It's not fair. I'm always being called out for my appearance, but the same rules say that the girls' kilts are supposed to be no more than an inch above their knee. They flout that rule and get away with it. It's a double standard.\"", "I was in charge of the in-house student newspaper, a task I undertook with the clear intention to turn it into something kids actually wanted to read, not just a glossy feel-good pamphlet for proud parents. I suggested to Wayne that he write an article on the unfair double standard he had grumbled about. He did, and his article reasonably theorized that perhaps the predominantly male teachers felt uncomfortable pointing out to teenaged female students that their skirts were way too short. It was the sort of thing that everyone knew but no one admitted, until Wayne mentioned it.", "When Wayne's article appeared in the school paper, the administration didn't react as well as they could have, in my opinion. They not only disciplined Wayne for lacking respect but also discontinued the student newspaper, which convinced me that West Point Grey was not the best fit for me as a teacher, nor I for them. Shortly after, I took a teaching position in the Vancouver public school system.", "No publicly available evidence supports any claim that Trudeau had a sexual relationship with either a student or a student's mother while he was a teacher at West Point Grey Academy between 1998 and 2001, nor that such an episode contributed to his departure from the school's teaching staff.", "The reports and social media posts which made that claim either did not cite any sources or cited only anonymous and unspecified sources. Furthermore, Trudeau has given plausible explanations for his departure which do not involve any sex scandal, namely that he was disillusioned with school administrators' conservative approach to certain policies and that he simply wanted to move on in his career -- two different but not contradictory reasons.", "That Trudeau's departure from the school had nothing to do with any sex scandal was corroborated by a statement issued in October 2019 by the school's principal during the period in question.", "Furthermore, no publicly available evidence supports the claim that Trudeau or his representatives have endeavored to suppress or cover up the supposed sex scandal. The fact that in October 2019, Canadian reporters made public their investigations and inquiries into the rumors actually undermines the credibility of the claims, since no reporting has yet emerged which would corroborate the allegations against Trudeau.", "The \"sex scandal\" claims appear to be no more than gossip and unsubstantiated rumor, published only two weeks before Canada's 2019 federal election, but we cannot definitively dismiss this particular set of allegations against Trudeau. Because the claims have been so vague and lacking in factual specifics (no names, dates, places, or firsthand accounts have been published) it has not yet been possible to test their credibility and therefore not possible to either corroborate or refute them. If that changes, we will update this fact check accordingly.", "We submitted questions to both the Canadian Liberal Party and the Office of Prime Minister Trudeau. The Office of the Prime Minister directed us to put our questions to the Liberal Party, from whom we did not receive a response.", "The Buffalo Chronicle.   \"Trudeau is Rumored to Be in Talks With an Accusor to Suppress an Explosive Sex Scandal.\"     7 October 2019.", "Frank Magazine.   \"Justin, You Old Dog!\"     30 September 2019.", "Ling, Justin.   \"Rumours of a Suppressed Globe Story About Justin Trudeau Are Bullshit.\"     Canadaland.   8 October 2019.", "Malcolm, Candice.   \"Trudeau's Yearbook Tells a Bigger Story.\"     Toronto Sun.   30 September 2019.", "Trudeau, Justin.   Common Ground.     HarperCollins, 2014.   ISBN 9780062376701.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]