["About this rating", "The design of the character \"Sonic\" in a live-action movie based on the video game was a source of substantial ridicule after Paramount Pictures released a trailer for \"Sonic the Hedgehog\" at the end of April 2019:", "Fans were so disappointed with the appearance of Sonic that director Jeff Fowler announced that the character was going to be redesigned before the movie's release:", "Thank you for the support. And the criticism. The message is loud and clear ... you aren't happy with the design & you want changes. It's going to happen. Everyone at Paramount & Sega are fully committed to making this character the BEST he can be... #sonicmovie #gottafixfast ?✌️", "— Jeff Fowler (@fowltown) May 2, 2019", "In June 2019, social media users started sharing a \"leaked\" image which supposedly showed Sonic's redesign:", "Just cancel the goddam movie pic.twitter.com/NLKHJyaXax", "— Boss Ben ♏️ (@BossBen_) June 9, 2019", "This is not an official image released by Paramount Pictures of the revamped Sonic character. This image was actually created by artist Damir Martin. A watermark for Martin's website, damirgmartin.com can be seen in the bottom right-hand corner of the image.", "Martin posted some additional images of this artwork on ArtStation.com and explained that his version was partly inspired by the logo for Sega, the video game company that created Sonic:", "I might create a \"making of\" blog entry where I'll dive bit deeper behind creative decisions and share what I learned while I was making this character. For example, The ribbed suit design is not done by chance. It's inspired by \"Sega\" logo.", "Just like the original Sonic, my version has gloves which are equipped with composite padding to help Sonic avoid injuries as he's blasting around at supersonic speeds. Movie version Sonic might be impervious to road rash, mine is not.", "I had to sacrifice certain recognizable details to be able to move away from the cartoony original look and make it more physical and plausible. Shoes are completely redesigned and I shaped wording \"Sonic\" into the side of the sole for the heck of it :)", "As of this writing, Paramount Pictures has not released any images or videos showing Sonic's new look. The movie was also delayed three months and is scheduled for release in February 2020.", "Pulliam-Moore, Charles.   \"You Can't Unsee the First Sonic the Hedgehog Trailer.\"\r\n    Gizmodo.   30 April 2019.", "Whitten, Sarah.   \"Sonic the Hedgehog’ Director Promises Sonic Redesign After Fan Backlash, But Changes Could Be Costly for Paramount.\"\r\n    CNBC.   3 May 2019.", "Heater, Brian.   \"Sonic the Hedgehog Movie Is Getting Delayed to Redesign the Title Character.\"\r\n    Tech Crunch.   24 May 2019.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]