["[THREAD] Let's see if we can crowd source a #factcheck of this video. Follow this thread & help us verify if the video is fact or fiction ?? https://t.co/ujA3xOXNrn", "Its an Ethiopian Airline aircraft yes, but not the one that went down. The 737 Max is a single aisle aircraft, the one on the video is two aisles,a wide body aircraft, possibly a 787 or Airbus A350.", "That looks similar to an Ethiopian Airlines 787 interior (https://t.co/Y92jsWF6tX), the uniform matches too. It's clearly not the 737 MAX 8 accident, because that was a single aisle aircraft and the one in these photos is a dual-aisle aircraft.", "The Ethiopian aircraft which went down, a 737 Max is a single aisle plane; while the video in question features a double aisle, wide body aircraft possibly a 787.", "Plus the video looks i have been shot at night and the tragic incident happened in the morning hours Ethiopian (EAT) time.", "Please complete this form to receive the HTML sharing code.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "For democracy to function, public figures need to be held to account for what they say. The claims they make need to be checked, openly and impartially. Africa Check is an independent, non-partisan organisation which assesses claims made in the public arena using journalistic skills and evidence drawn from the latest online tools, readers, public sources and experts, sorting fact from fiction and publishing the results.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "© 2023 - Africa Check - All rights reserved.", "We will never charge you for verified, reliable information. Help us keep it that way by supporting our work.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "Support independent fact-checking in Africa."]