["The video was posted March 18, 2021 on YouTube, where it has been viewed more than 50,000 times.", "“Just in: Jay Sonza confirmed Pacquiao violated COMELEC rules. Sorry but you’re disqualified Manny!” the Tagalog-language title reads.", "Jay Sonza is a former broadcaster with a history of posting misleading claims online, according to Philippine fact-checking organisation Vera Files.", "COMELEC is the Philippine Commission on Elections, a government body tasked with enforcing election law, including for the upcoming presidential race in May 2022.", "“It appears people’s champ and senator Manny Pacquiao has been disqualified and will face charges, according to… Jay Sonza,” a man narrating the video in Tagalog says. “(Pacquiao) clearly violated the rules and regulations of Comelec for the 2022 election, according to Sonza.”", "World boxing champion and elected senator Manny Pacquiao has played coy with his 2022 plans, neither confirming nor denying whether he is seeking the presidency, local media Inquirer.net reported.", "An identical video has emerged on Facebook and in blog posts, including here, here and here.", "However, the claim is false; Pacquiao has not been disqualified from the 2022 presidential race, according to COMELEC.", "“The link you provided clearly states that it was only reporting Jay Sonza’s OPINION. It’s still wrong,” COMELEC spokesman James Jimenez told AFP in a Viber message on March 19, 2021.", "“Jay Sonza obviously does not speak for the Comelec.”", "“Sen. Pacquiao is not even a candidate yet. And in any case, the campaign period hasn’t even begun so the premature campaigning rules supposed to have been violated are still NOT IN EFFECT.”", "The period for filing 2022 candidacies is set for October 1-8, 2021, according to COMELEC’s election calendar. The campaign period for candidates running for national posts does not begin until February 8, 2022.", "Misrepresented social media post", "The video also misrepresents what Sonza actually said in his Facebook post published on March 16, 2021.", "While the post includes a Pacquiao campaign banner that Sonza alleges shows an “election violation,” it does not claim the senator has been disqualified from running in 2022.", "“I saw this yesterday in one part of my property near the road, and this tarpaulin has been set up by whoever has been ordered by Manny Pacquiao. Maybe they set this up at night because it wasn't there yesterday,” the Tagalog-language post reads.", "“Maybe this is what (Pacquiao) means when he says they are busy going around the country. Comelec, here's exhibit A of (Pacquiao's) election violation. I took a photo of it first before I had it removed, witnessed by village officials”.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]