["About this rating", "An image purportedly showing a foot after it was surgically modified to resemble a high heel shoe has been circulating online for several years along with the claim that this skin stiletto was the result of a procedure called \"Cinderella surgery\":", "The image is actually a distorted version of artist Matilde Pernille's digital work entitled \"Fake VI.\" When it was posted to her 500px photography page in 2013, it was tagged with the keywords \"manipulation,\" \"fake,\" and \"photoshop.\"", "Although this image was digitally manipulated, at least one podiatrist truly does perform \"Cinderella procedures.\" However, the results of these cosmetic foot surgeries are not nearly as extreme as those shown above -- it is a surgery to remove bunions. The New York Times reported in 2014:", "For Dr. Sadrieh (who was wearing made-to-order Gucci brogues), foot surgery is a fusion of medicine and fairy tale. At his practice, you don’t have a bunionectomy; you have a Cinderella procedure.", "“I had never met a patient who asked for a hallux valgus correction with osteotomy and screw fixation,” he said. “So I decided to create a name that captures the result of the procedure, without all the Latin. The point of the Cinderella: being able to put a shoe on that didn’t fit comfortably before.", "He also has coined the Perfect 10! (aesthetic toe-shortening — once administered, he said, to a 17-year-old fashion model, so she could wear the shoes her career demanded); Model T (toe-lengthening); and Foot Tuck, a fat-pad augmentation that he said helps with high heels.", "Pernille's artwork likely started to become associated with \"Cinderella Surgery\" shortly after the New York TImes piece on Sadrieh came out. When the web site Health 24 News later published an article on the same topic, this doctored image was predominantly featured.", "Pernille wasn't the first to imagine a woman's foot morphing into a high heel shoe made of flesh and bone. Artist Julie Rapp's created a similar image in 2001 for a piece called \"Overstepping\":", "The morphing of shoe and foot that Julie Rrap has made in Overstepping exaggerate the implants, injections and surgical enhancements which have reshaped the female form today. Her high-heeled feet represent a possible endpoint for the idea of the malleable and fashionable body, aimed at the true fashion victim. For those who prefer comfortable shoes, this sci-fi melding of skin and stiletto is more mutilation that enhancement.", "Health 24.   \"The Last Frontier: Cinderella Cosmetic Foot Surgery\"\r\n    22 April 2014.", "Stover, Laren.   \"Make Them Fit, Please!\"\r\n    New York Times.   22 April 2014.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]