["By Rem Rieder", "Posted on February 28, 2020", "In an interview with Fox News’ Sean Hannity, newly crowned coronavirus point man Mike Pence spun the facts in claiming he moved decisively when confronted with a disturbing HIV outbreak in a rural Indiana county when he was governor of the state.", "“We worked the problem early in the year from a law enforcement standpoint, from a health standpoint,” the vice president told Hannity on Feb. 27. “I don’t believe in needle exchanges as a way to combat drug abuse, but in this case, we came to the conclusion that we had a public health emergency, and so, I took executive action to make a limited needle exchange available.”", "But Pence’s fellow Hoosier Pete Buttigieg, the former South Bend mayor now seeking the Democratic presidential nomination, says there’s more to the story. “He was dragged kicking and screaming into that,” Buttigieg told CNN’s Don Lemon on Feb. 27. “Had he acted earlier, I believe that the worst parts of the HIV epidemic could have been avoided.”", "Buttigieg is right. An unusually high number of HIV cases in Scott County, Indiana, was first spotted by health authorities in November 2014. Pence did not declare a public health emergency and authorize a needle exchange program for the county until March 26, 2015.", "A 2018 study by Yale University researchers, published in the medical journal The Lancet HIV, concluded prompt action could have dramatically reduced the seriousness of the outbreak.", "“The upper bound for undiagnosed HIV infections in Scott County peaked at 126 around Jan 10, 2015, over 2 months before the Governor of Indiana declared a public health emergency on March 26, 2015,” the study said, concluding that “an earlier public health response could have substantially reduced the total number of HIV infections (estimated to have been 183–184 infections by Aug 11, 2015).”", "“It was a total collapse of public health leadership and a dereliction of duty in Indiana,” one of the study’s authors, Yale epidemiologist Gregg Gonsalves, told the Washington Post. “They could have avoided this epidemic if science took the lead instead of ideology.”", "While it can’t really be known what would have happened if Pence and others had acted differently, the paper uses mathematical modeling to conclude better surveillance and earlier public health actions would have lessened the epidemic.", "“A comprehensive response, including access to clean syringes for people who inject drugs, as well as therapies such as buprenorphine and methadone, could avoid new outbreaks of HIV and HCV in at-risk counties in the first place,” Gonsalves told Yale News in 2018.", "With Pence’s new responsibilities in dealing with the coronavirus, his response to the HIV crisis in Scott County has returned to the spotlight. Pence told Hannity that he thinks one of the reasons President Donald Trump picked him to head the administration’s coronavirus response was his experience in handling the HIV episode.", "The outbreak of HIV was linked to extensive use by Scott County residents of a prescription opioid painkiller called Opana, which was taken off the market in 2017. Needle-sharing was common in the area, where many members of a family often live in the same house.", "Experts say that in situations like the one in Scott County needle exchange programs are essential. But Pence, a social conservative, was very much opposed to them, seeing them as contributing to drug abuse. (According to the Centers for Disease Control and Prevention, however, syringe services programs “do not cause or increase illegal drug use.”) It took much lobbying by other officials to get Pence to give the program — which was illegal in Indiana — the green light.", "On March 23, 2015, months after the outbreak began, Pence said he was going home to pray on the issue, according to the New York Times. Soon afterward he declared a public health emergency and approved the program. “It was disappointing that it took so much effort to bring the governor on board,” Ed Clere, a Republican state representative who championed the needle exchange, told the Times in 2016.", "Even as he announced the new approach, Pence made clear his reluctance to adopt it. “I do not enter into this lightly,” he said. “I don’t believe effective anti-drug policy involves handing out drug paraphernalia.”", "Once launched, the program was considered a success. According to the New England Journal of Medicine, 97,000 syringes were distributed to the 277 people who signed up. They were taking a median of five injections a day, according to the publication.", "Despite the criticism, Pence continues to talk positively about his reaction to the HIV crisis.", "“Indiana would go on to change the law to mirror what action I had taken,” he told Hannity. “It was a moment where we had brought — we had brought all of the resources to bear, first from a health perspective, a law enforcement perspective, and I’m glad to say that we got all of those people treated. Everyone was able to get support and help and we move forward and the community recovered.”", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]