["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The debate over whether President Barack Obama should approve the Keystone XL pipeline often turns to jobs, but should it? Liberal CNN Crossfire host Van Jones says the pipeline is not the jobs creator supporters talk it up to be.", "\"Every time we have a show, somebody says something ... about Keystone, and somehow Keystone is going to create all these jobs,\" Jones said in the Feb. 3 episode of Crossfire. \"Then it turns out, look at the actual numbers. It turns out the actual numbers are 3,900 temporary jobs in the construction sector and 35 permanent jobs.\"", "Ralph Reed, a conservative activist who founded the Faith and Freedom Coalition, said Jones’ claim is unfair because a long-anticipated report by the U.S. State Department says the project will create 42,000 jobs. Reed went on to say the report cleared the main argument against the project, that it’s bad for the environment.", "We are fact-checking claims from each pundit about the project. Here, we’ll focus on Jones’ claim about the project creating \"35 permanent jobs.\"", "The proposed Keystone XL pipeline would stretch 875 miles from Western Canada to Steele City, Neb., where it would connect with existing pipelines and usher up to 830,000 barrels of oil per day to refineries on the Gulf Coast.", "Because TransCanada’s project crosses international borders, the company had to file an application for a presidential permit. As part of the process, the president directs the Secretary of State to determine whether the project \"serves the national interest.\" Secretary of State John Kerry has not yet issued a recommendation to Obama based on the study.", "Obama is under political pressure from all sides, with environmentalists and Democrats like Jones on one side who want him to shut it down and Republicans and some Democrats supportive of organized labor on the other who say it would strengthen the country’s energy independence and, yes, create jobs.", "When the State Department released its 11-volume report about the pipeline’s impact Jan. 31, 2014, the big headline in most news coverage centered on its finding that the pipeline project would not significantly contribute to carbon pollution. Some see that as giving Obama an opening for approval.", "With that backstory out of the way, let’s crack open the chapter on jobs.", "There’s plenty of debate over how many jobs the project would create during construction.", "The State Department report puts the total at 42,100 jobs, though the definition of a job in this sense is a position filled for one year. Much of the construction work would come in four- or or eight-month stretches. About 10,400 seasonal workers would be recruited for construction, the State Department said.", "When looked at as \"an average annual job,\" it works out to about 3,900 jobs over one year of construction or 1,950 jobs each year for two years.", "The rest of the jobs would be the result of spillover spending (formally called indirect or induced economic activity) as Keystone workers buy equipment and materials to complete the project and spend their money on an array of services, including food, health care, and arts and entertainment. As you might expect, it’s much harder to measure the widespread effect on job creation.", "There’s no doubting that most of the economic activity comes during construction. Jones honed in on jobs after construction, which aren’t really a source of sharp debate.", "\"There’s very few jobs operating pipelines,\" said Ian Goodman, president of the Goodman Group Ltd., an energy and economic consulting firm in Berkeley, Calif. \"That’s one of the reasons why pipelines are attractive to the oil industry. They’re relatively inexpensive to build and operate.\"", "The report says the project would provide jobs for about 35 permanent employees and 15 temporary contractors.", "The full-timers would be \"required for annual operations, including routine inspections, maintenance and repair.\" Some would work in Canada. The U.S. employees would work at pump stations along the pipeline route as well as a Nebraska office.", "The project’s impact on housing, property taxes and service industries once in operation? Not much. Not much is known about the contractors’ workload except they would provide additional specialized support.", "Still, arguments about the relatively small number of permanent jobs from the pipeline often belie the nature of construction jobs, which are comprised of temporary projects by definition, said Matt Dempsey, a spokesman for a coalition of pro-Keystone groups known as Oil Sands Fact Check.", "\"You build it, you move on,\" Dempsey said.", "Our ruling", "Jones said the Keystone pipeline will only result in 35 permanent jobs after construction.", "The numbers, as reported by the State Department, back him up, though that’s the nature of any big construction project, be it a highway or monument.", "Jones’ claim is True.", "CNN.com, Crossfire transcript, Feb. 3, 2014", "Interview with Van Jones and his assistant Colin Holtz, Feb. 4, 2014", "The New York Times, \"Report opens way for approval of Keystone pipeline,\" Jan. 31, 2014", "U.S. Department of State, \"Final Supplemental Environmental Impact statement for Keystone XL pipeline,\" January 2014 (chapter on socioeconomic impact)", "Interview with Sean Sweeney, director of the Global Labor Institute at the Cornell School of Industrial and Labor Relations, Feb. 6, 2014", "Interview with Ian Goodman, president of the Goodman Group Limited, Feb. 7, 2014", "Interview with Matt Dempsey, Oil Sands Fact Check spokesman, Feb. 10, 2014", "PolitiFact, \"Obama says Keystone XL would mean ‘maybe 2,000 jobs,’\" July 31, 2013", "Washington Post, \"President Obama’s low-ball estimate for Keystone XL jobs,\" July 20, 2013", "PolitiFact Georgia, \"Isakson: Keystone pipeline to employ 20,000,\" April 11, 2012", "Sierra Club, Keystone XL 101, 2013", "Cornell Global Labor Institute, \"Pipe Dreams? Jobs Gained, Jobs Lost by the Construction of Keystone XL,\" January 2012", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]