["About this rating", "Magnus Söderlund did not propose or advocate cannibalism as a solution to climate change during a Sept. 3 interview on the Swedish television channel TV4. Rather, he explained that his research into the issue was intended to provoke thought and gauge where audiences would \"draw the line\" in their willingness to consume various kinds of meat.", "We have not yet obtained video footage or a copy of Söderlund's presentation, so we cannot yet definitively determine what he did or did not say in it. Söderlund himself rejected claims he had advocated or proposed cannibalism in his presentation, and told us he had merely gauged the audience's response to the theoretical prospect of eating human flesh.", "In September 2019, we received multiple inquiries about news reports that claimed a scientist in Sweden had proposed, advocated or suggested that people should turn to cannibalism as a way of combating climate change.", "The Epoch Times published an article with the headline \"Swedish Researcher Advocates Eating Human Flesh to Combat Climate Change Food Shortages,\" which went on to report that:", "\"Climate change alarmism has taken a macabre turn that looks like satire, but isn’t. It happened in Sweden. At a summit for food of the future (the climate-ravaged future) called Gastro Summit, in Stockholm on Sept. 3 to 4, a professor held a PowerPoint presentation asserting that we must 'awaken the idea' of eating human flesh in the future, as a way of combating the effects of climate change.", "\"In a talk titled 'Can You Imagine Eating Human Flesh?', behavioral scientist and marketing strategist Magnus Soderlund from the Stockholm School of Economics argued for the breaking down of ancient taboos against desecrating the human corpse and eating human flesh. He refers to the taboos against it as 'conservative' and discusses people’s resistance to it as a problem that could be overcome, little by little, beginning with persuading people to just taste it.\"", "That Epoch Times article informed several other reports, such as the one posted by Fox News, whose headline claimed \"Swedish Scientist Floats Eating Human Flesh as Solution to Global Climate Change,\" and the London Evening Standard, whose headline read \"Scientist Suggests 'Eating Human Meat' to Tackle Climate Change.\"", "The right-leaning website Breitbart posted an article with the headline, \"Swedish Scientist Proposes Cannibalism to Fight Climate Change,\" and Hannity.com, the website of Fox News anchor Sean Hannity, reported that:", "\"A European scientist speaking at a summit in Sweden last week suggested a controversial new trend to combat climate change: consuming human flesh as an alternative to animal products.\"", "All these reports presented Söderlund as having proposed, suggested, or advocated for humans eating other humans as a way to combat the effects of climate change. In reality, the evidence for this is lacking.", "Most reports based their claims on Söderlund's Sept. 3 interview on the TV4 television channel, which can be viewed in full (and in Swedish) below:", "James Savage, CEO and publisher of The Local, a network of English-language news websites in Europe with headquarters in Stockholm, provided Snopes with a translation of the most relevant portions of the TV4 interview, adding that it would not be accurate to say Söderlund \"advocated\" cannibalism in his remarks.", "In the interview, Söderlund told the host his Gastro Summit presentation was \"part of a series of investigations into different kinds of food to see where to draw the line.\" He added:", "\"When it comes to human flesh there are various taboos that are hard to break, and it’s probably the case that human flesh will never be a large scale thing in the West or in our time. [But] given that there are so many taboos, it’s important to understand why we don’t want to do something. You could say this [presentation] is part of a study into things that people avoid doing.\"", "In light of the taboo around eating human flesh, Söderlund said, \"It would be difficult for anyone who wanted to break into the human flesh business.\"", "At one point in the interview, the interviewer asked Söderlund how likely he thought it was that eating human flesh would catch on, in the same way that eating insects has been touted as a possible means to lower carbon emissions and combat food shortages. Söderlund responded that he thought cannibalism was unlikely to become appealing:", "\"Two and a half billion people eat insects more or less regularly, but they’re not in the Western world. And surveys that have been carried out on people’s attitudes to insects as food show that very few people think [eating insects] is attractive and want to try it, and you’d have to assume that human flesh would have an even bigger ‘yuck factor.'\"", "He later added: \"But if we need to turn over every stone when it comes to climate and sustainability, it’s still worth raising this question.\"", "Contrary to the claims made in various news reports, Söderlund did not advocate or propose or suggest cannibalism as a solution to the challenges of climate change in his TV4 interview. Rather, he explained that the purpose of his research and his Gastro Summit presentation was to stimulate thinking about what people would and would not be willing to do or consume in order to combat climate change, or in the event of food shortages brought on by climate change.", "This is much less clear. The Epoch Times article included descriptions of Söderlund's Sept. 3 presentation at the Gastro Summit in Stockholm, using terms that suggested the author had watched a video of it:", "\"At a summit for food of the future (the climate-ravaged future) called Gastro Summit, in Stockholm on Sept. 3 to 4, a professor held a PowerPoint presentation asserting that we must 'awaken the idea' of eating human flesh in the future, as a way of combating the effects of climate change ...", "\"He can be seen in his video presentation and on Swedish channel TV4 saying that since food sources will be scarce in the future, people must be introduced to eating things they have thus far considered disgusting — among them, human flesh ...", "\"In his talk, Soderlund asks the audience how many would be open to the idea. Not many hands go up. Some groaning is heard.\"", "We have not yet found publicly available video footage of Söderlund's presentation at the Gastro Summit on Sept. 3, nor a copy of any slideshow or PowerPoint presentation. We asked the author of the Epoch Times article for further details about the source of her descriptions, but we did not receive a response in time for publication. The event's organizers told us they did not have a copy of the presentation, and Söderlund himself indicated that the presentation was not readily available to him, for technical reasons.", "However, Söderlund did provide a firm and categorical rejection of claims that he had \"advocated\" or \"proposed\" eating human flesh as a solution to climate change, and reiterated that his presentation — which involved a survey of attendees — was designed only to gauge where the audience would \"draw the line\" in their willingness to eat various kinds of meat, and to \"ask questions\" about this issue. In an email, Söderlund wrote:", "I am afraid that there have been several misunderstandings in the reporting on this issue. This is what happened: since many persons are expressing that they do not want to eat traditional meat anymore, one may wonder what we should eat instead. To collect some views on this, I had a chance to ask questions to an audience at a food fair; I showed a meat product and asked if the participants would consider eating it while I varied the content (cow, vegetarian substitute meat, insects etc). Human content was included in one version as an extreme case — to see where the limit is.", "Then, the issue ended up on various sites with alternative views on facts. I believe that the issue has somehow been hijacked by people who do not believe that global warming and other climate issues should be taken seriously — and, given this, it may indeed be useful to refer to events indicating that climate activists have completely crazy ideas (such as that we should eat each other).", "Just for the record: I do not want to eat human meat, I do not want to be eaten, I do not think that eating humans influences the climate, I am not an activist, I am just a researcher who thinks that it must be possible to ask questions about also the dark sides of what we humans do and do not do.", "Notwithstanding Söderlund's clear and detailed account of his presentation, without being able to examine a copy of that presentation, or watch a video of it, we can't determine definitively what he did and did not say. Until and unless that material becomes available to us, this element of the claim remains unproven. If that changes, we will update this fact check accordingly.", "However, we can say that Söderlund did not advocate or propose cannibalism as a solution to climate change in his TV4 interview. Rather, he merely discussed it and explained that his research involved asking questions about it. For those reasons, this element of the claim is false. On the whole, therefore, we issue a rating of \"Mixture.\"", "Farber, Celia.  \"Swedish Researcher Advocates Eating Human Flesh to Combat Climate Change Food Shortages.\"\r\n  The Epoch Times.  4 September 2019.", "Gaynor, Gerren Keith.  \"Swedish Scientist Floats Eating Human Flesh as Solution to Global Climate Change: Reports.\"\r\n   Fox News.  9 September 2019.", "Drake, Matt.  \"Scientist Suggests 'Eating Human Meat' to Tackle Climate Change.\"\r\n  The Evening Standard.  6 September 2019.", "Tomlinson, Chris.  \"Swedish Scientist Proposes Cannibalism to Fight Climate Change.\"\r\n  Breitbart.  6 September 2019.", "Hannity.com.  \"Green New Meal: Scientist Says 'Consuming Human Flesh' May Be Needed to Fight Climate Change.\"\r\n  9 September 2019.", "van Huis, Arnold; Oonincx, Dennis.  \"The Environmental Sustainability of Insects as Food and Feed. A Review.\"\r\n  Agronomy for Sustainable Development.  15 September 2017.", "Berger, Sebastian et al.  \"When Utilitarian Claims Backfire: Advertising Content and the Uptake of Insects as Food.\"\r\n  Frontiers in Nutrition.  2 October 2018.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]