["People wait in line to drop off their mail-in-ballots for the general election on Nov. 3, at the Miami-Dade County Elections Department, Wednesday, Oct. 14, 2020, in Doral, Fla. (AP)", "Slightly less than 1% of mail in ballots had been rejected in Miami-Dade County as of the morning of Oct. 30.", "The most common reason that a ballot was rejected was due to having no signature on the envelope.", "The county contacts voters to give them a chance to “cure” or fix their ballot if the signature was missing or didn’t match.", "Democrats and Republicans are scrutinizing voter turnout in Miami-Dade County, the county with the largest number of registered voters in Florida, for clues about which way the swing state will land in the presidential contest.", "A Facebook post misleads about the proportion of mail ballots rejected so far.", "\"Miami-Dade reporting 23% of early ballots being rejected for missing signatures,\" states an Oct. 29 Facebook post which is a screengrab of a tweet. The author of the tweet later deleted the tweet.", "This Facebook post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The text in the post says \"early ballots\" but it appears to be a reference to mail-in ballots, as evidenced by the fact that it included a link to a Miami-Dade Democrats page about how voters can \"cure\" or fix their mail in ballot if a voter forgot to sign the envelope or their signature didn’t match.", "As of the morning Oct. 30, the county had received 449,645 vote by mail ballots, including 3,308 that were rejected, said Suzy Trutie, spokesperson for Miami-Dade Supervisor of Elections. That comes to slightly less than 1%.", "About 2,313 of those rejected ballots were missing a signature on the ballot envelope. The signature did not match on 569 ballots. Smaller numbers of ballots were rejected for other reasons including that some voters had moved out of the county.", "When mail ballots are rejected for missing a signature or a signature mismatch, the county contacts the voters to give them the opportunity to submit an affidavit to \"cure\" or fix their ballot. So far, about 2,016 of those ballots have been cured.", "The 23% statistic could have come from a misinterpretation of an Oct. 16 op-ed in the Tampa Bay Times by University of Florida professor Daniel A. Smith and Dartmouth College professor Michael C. Herron.", "\"Although Miami-Dade County accounts for only 7.2% of mail ballots cast by Florida voters, it accounts for nearly 23% of the state’s mail ballots received without signatures,\" they wrote.", "The purpose of that part of the op-ed was to point out the variability in ballots being received without signatures — as of earlier this month. The op-ed didn’t state that 23% of ballots in Miami-Dade had been rejected.", "RELATED: Ask PolitiFact: Is it too late to mail in your ballot?", "A Facebook post said  \"Miami-Dade reporting 23% of early ballots being rejected for missing signatures.\"", "A spokesperson for the county elections office said that less than 1% of mail ballots have been rejected, including many that were missing signatures. Voters still have time to fix their ballot if they omitted their signature, and many have.", "We rate this claim False.", "Facebook post, Oct. 29, 2020", "Witty P. Paul, Tweet, Oct. 29, 2020", "Email interview, Suzy Trutie, spokesperson for Miami-Dade County Elections Department, Oct. 30, 2020", "Miami-Dade County, Vote by mail ballot, Accessed Oct. 30, 2020", "AP, False posts spread about ballots without signatures in Miami-Dade County, Oct. 29, 2020", "Michael Herron and Daniel A Smith op-ed Tampa Bay Times, Rejected mail ballots pile up in Florida, Oct. 16, 2020", "Telephone interview, Michael Herron, Dartmouth government professor, Oct. 30, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]