["Holding up three fingers, Gov. Chris Christie wanted the crowd to listen a second time to a statistic about the number of \"college ready\" students in Camden.", "\"How bad has it been in Camden? How ‘bout this -- Last year, only three students graduated college ready,\" Christie said during his Jan. 14 \"State of the State\" address. \"I want you to listen to that again. In the entire public school system in Camden last year, only three students graduated college ready.\"", "The Republican governor’s claim refers to a statistic recently cited by Camden Superintendent Paymon Rouhanifard in regard to students whose SAT scores met the \"SAT College and Career Readiness Benchmark\" developed by the College Board, which administers the standardized test.", "That benchmark -- a combined score of 1550 -- indicates a 65 percent likelihood of achieving a B- average or higher during a student’s first year at a four-year college, which in turn is associated with a high likelihood of college success, according to the College Board. The highest possible score on the SAT is 2400.", "Christie said \"three students graduated college ready\" in Camden in 2013, but the actual statistic is related to the number of 12th-graders enrolled in Camden during the 2011-12 school year who took the SATs and hit that benchmark, according to data provided by the school district.", "Of the 214 students who took the exam, only three students reached that benchmark, the data shows.", "It’s worth noting that many other Camden students didn’t take the SATs at all. In addition to those 214 test-takers, there were 255 12th-graders enrolled that year who did not take the exam, the data shows. The district does not track how many students take the ACT, district spokesman Kevin Shafer said.", "Rouhanifard acknowledged how many Camden students go on to college without reaching that SAT benchmark or without taking the SATs. \"A lot more than three students are going to college,\" he said.", "Still, the superintendent noted how once Camden students begin attending Camden County College, for example, a large number of them need to take remedial courses. The statistic about the SAT benchmark indicates that \"the rigor isn’t always there and students aren’t always prepared,\" he said.", "But some education experts were divided last week over the value of using that SAT benchmark.", "Paul Reville, a professor at the Harvard Graduate School of Education, said the benchmark was a \"useful indicator for policy makers and others to use,\" and he said Christie was making a valid point about the failure to adequately prepare urban youth for college or careers.", "\"The fact is that overall there are far too many students coming out of Camden and virtually every other urban center who are neither prepared for college nor career, and that’s a crisis,\" Reville said.", "\"And so in that regard, irrespective of what rhetoric he might be using or facts to support it, I think the governor’s on target in pointing to this as a challenge that we need to deal with,\" he added.", "But Christopher Tienken, an assistant professor of education administration at Seton Hall University, argued that the benchmark does not account for other factors, such as a student’s grade point average.", "\"I think we need to use multiple measures,\" Tienken said. \"Putting all your eggs in the standardized testing basket, I think you run the risk of really misidentifying whether students are college ready or not.\"", "In a statement, the College Board said it developed the benchmark to help school officials and others evaluate the effectiveness of academic programs to better prepare students for college, but the group also said falling below that benchmark does not mean students will not be successful.", "\"If a student does not meet the SAT benchmark score of 1550, it does not mean he or she can’t or won’t be successful in college,\" the statement read.", "The governor’s office did not respond to requests for comment.", "Our ruling", "In his \"State of the State\" address, Christie said: \"In the entire public school system in Camden last year, only three students graduated college ready.\"", "But that statistic does not refer to high school graduates in 2013. It refers to the three 12th-graders enrolled during the 2011-12 school year who took the SATs and received a combined score of at least 1550, a benchmark developed by the College Board to measure college readiness.", "Since Christie’s statement is \"accurate but needs clarification or additional information,\" we rate it Mostly True.", "To comment on this story, go to NJ.com.", "You Tube, NJTV News Special Report: The State of the State 2014, Jan. 14, 2014", "Associated Press, Only 3 students scored college-ready in Camden, Dec. 18, 2013", "New Jersey Education Association, NJEA calls out Christie for ‘college ready’ comment, Jan. 15, 2014", "Philadelphia Inquirer, Camden schools' turnaround man, Jan. 17, 2014", "Philadelphia Inquirer, A look at what SAT report on Camden means, Dec. 22, 2013", "Philadelphia Inquirer, Camden schools chief reports from his 'listening tour', Dec. 19, 2013", "E-mail interview with College Board media representatives, Jan. 21-22, 2014", "College Board, 2013 SAT Report on College & Career Readiness, Sept. 26, 2013", "College Board, SAT Benchmarks: Development of a College Readiness Benchmark and its Relationship to Secondary and Postsecondary School Performance, accessed Jan. 20, 2014", "College Board, SAT Report: Only 43 Percent of 2012 College-Bound Seniors Are College Ready, Sept. 24, 2012", "New Jersey Department of Education, NJ School Performance Reports, accessed Jan. 22, 2014", "New Jersey Department of Education, NJ School Performance Reports -- Interpretive Guide, April 2013", "College Board, The SAT College and Career Readiness Benchmark: User Guidelines, accessed Jan. 22, 2014", "The Star-Ledger, While U.S. SAT scores dip across the board, N.J. test-takers hold steady, Sept. 15, 2011", "E-mail and phone interviews with Christopher Tienken, assistant professor of Education Administration at Seton Hall University, Jan. 23, 2014", "E-mail and phone interviews with Paul Reville, the Francis Keppel Professor of Practice of Educational Policy and Administration at Harvard Graduate School of Education, Jan. 22-23, 2014", "E-mail interviews with Camden School District officials, Jan. 23, 2014", "Interview with Camden Superintendent Paymon Rouhanifard, Jan. 24, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]