["About this rating", "On March 9, 2021, two days after an interview aired featuring Prince Harry and Meghan Markle talking to Oprah Winfrey about some of the racism they faced from the royal family, and a day after \"Good Morning Britain\" host Piers Morgan derided the royal couple's claims, social media users started sharing a video that they claimed provided some insight into why Morgan seemingly had a grudge against Markle.", "This is a genuine video of Morgan talking about his relationship with Markle.", "The video comes from a 2018 episode of Ireland's \"The Late Late Show\" with host Ryan Tubridy. Morgan explained that he and Markle had a \"good friendship\" that started after he messaged the \"Suits\" star on Twitter. After a few exchanges, they met up at a pub in London. At the end of the night, according to Morgan, Markle got in a cab to a party where she would end up meeting Prince Harry. Markle and Morgan had plans for dinner the following night, but Markle never showed.", "Morgan said:", "She then said I’m coming to London to watch tennis with Serena Williams. She said would you like to meet up for a drink ... We had two hours in a pub. She had a couple of dirty martinis and a couple of pints. We got along brilliantly. Then I put her in a cab. And it turned out to be a cab that took her to a party where she met Prince Harry. And then the next night, they had a solo dinner together and that was the last I ever heard from Meghan Markle. And I have never heard from her again. Meghan Markle ghosted me…I really liked her this is why it hurts. No... I really liked her. I just think she’s a slight social climber, I’m afraid... I didn’t really like being ghosted like that. I thought it was a strange thing to do.”", "Morgan has told this story on several different occasions. In the following clip from \"Meghan Markle: An American Princess,\" Morgan doesn't use the word \"ghost,\" but he says that his drinks with Markle were interrupted when she started receiving texts from Prince Harry:", "While talking to \"Access Hollywood\" in 2018, Morgan repeated this story and said again that Markle \"ghosted\" him.", "Morgan's account of Markle ghosting him came to light again in March 2021 after the \"Good Morning Britain\" host derided the claims made by Markle during a controversial interview she did with Oprah Winfrey. When his co-hosts confronted Morgan the following day, he walked off the set:", "On March 9, 2021, \"Good Morning Britain\" announced that Morgan was leaving the show.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]