["About this rating", "In June 2017 a Mississippi chapter of the Ku Klux Klan distributed a flyer to some residents of Mobile, Alabama that — in an effort to recruit \"white Christians\" — praised the policies of Donald Trump.", "The document was not an \"ad\" placed in a newspaper, and the incident took place in 2017 and not 2018.", "In April 2018, several Facebook accounts began sharing memes alleging that an ad placed in a newspaper by the Ku Klux Klan had praised President Donald Trump's policies:", "The image included with this text was a genuine photograph of a flyer produced and distributed by the American Christian Nights, a Mississippi-based chapter of the Ku Klux Klan. It was not, however, a newspaper ad, nor was it from 2018.", "The pictured \"ad\" began with the word \"Trump\" in large bold letters followed by a series of bullet points praising the president's efforts to \"stop illegal immigration\" and \"the influx of muslems [sic].\"   The flyers were placed in plastic bags (not a newspaper) that were filled with white rice (a white supremacist symbol commonly included with KKK recruitment flyers) and left outside the homes of residents in a Mobile, Alabama neighborhood.", "A 19 June 2017 report from AL.com described the incident and included a photograph of the flyer which was later reproduced in the memes:", "The Mobile Police Department is investigating a series of KKK fliers praising President Donald Trump being distributed in a west Mobile neighborhood this past weekend. On Monday afternoon, Mobile Police Department spokesman Donald Wallace confirmed that they are investigating the incident.", "The KKK fliers, sent in clear ziploc bags, with a letter and white rice inside, appeared outside of homes in the Autumn Ridge neighborhood just before 4:00 p.m. on Saturday (June 17) afternoon. [...] At this time the Mobile police said the investigation is ongoing.", "We reached out to the Mobile Police Department to confirm the details of these reports and to see if any follow-up investigation had been undertaken. A summary of the case provided to us by the department confirmed the incident but suggested the investigation had concluded that no crime had been committed:", "On June 17, 2017 police responded to the 6700 block of Harness Way for a suspicious call. Upon arrival, the complainant stated he found a Ziplock bag with rice and a flyer from the American Christian Knights KKK. Upon further investigation, officers observed several more of the flyers throughout the neighborhood including Autumn Ridge Apartments.", "No additional complaints were received after the initial report. The type of incident/offense remained suspicious circumstances. Distributing the flyer was not considered a crime, especially being that no threat/harm to others was made.", "Stokes, Prescotte III.   “KKK Fliers Praising President Donald Trump Surface in West Mobile.”\r\n    AL.com.   19 June 2017.", "Appelbaum, Binyamin.   “Debt Concerns, Once a Core Republican Tenet, Take a Back Seat to Tax Cuts.”\r\n    The New York Times.   1 December 2017.", "Omar, Mohamed.   “KKK Flyers in Bags with Rice Spotted in B.C.”\r\n    Huffington Post.   4 October 2016.", "Toler, William, R.   “KKK Recruiting in Richmond County?”\r\n    Richmond County Daily Journal.   11 December 2017.", "Lawson, Adam.   “KKK Fliers Delivered to Gaston County Driveways.”\r\n    Gaston Gazette.   30 January 2017.", "Ouriel, Andy.   “KKK Fliers Dispersed in Perkins.”\r\n    Sandusky Register.   1 April 2017.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]