["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Miss Universe 2013 Gabriela Isler, from Venezuela, adjusts her crown after winning the pageant in Moscow, Russia, on Nov. 9, 2013. (AP)", "During a forceful, even mocking address on foreign policy, Hillary Clinton lit into some of Donald Trump’s past comments -- including one in which he recalled the time he held the Miss Universe pageant in Russia in 2013.", "Trump, the presumptive Republican presidential nominee, \"says he has foreign policy experience because he ran the Miss Universe pageant in Russia,\" Clinton said during her address on June 2, 2016.", "Is that correct? We found that the attack is pretty close to the mark, though somewhat overstated.", "Clinton’s barb stemmed from an interview Trump did with Fox News’ Bret Baier on May 6, 2016.", "At one point in the interview -- around the 16:40 mark here -- Baier asked Trump about whether he had ever met Russia’s president, Vladimir Putin, which is an issue Trump had been coy about in previous interviews. Trump told Baier that once again he would have no comment on the question, in order to protect Putin’s confidences.", "Trump went on to say, however, \"I know Russia well. I had a major event in Russia two or three years ago, Miss Universe contest, which was a big, big, incredible event. An incredible success.\" (Trump sold the pageant in 2015.)", "We won’t gauge whether experience putting on a beauty pageant can give someone important foreign-policy insights -- something Clinton was clearly skeptical of during her speech. But it is true that Trump mounted the event in Russia in 2013. (As Politico’s Michael Crowley reported, Trump \"watched 86 contestants don shimmering evening gowns and skimpy swimsuits for what he would call ‘the world’s biggest and most iconic beauty contest.’ \")", "So Clinton certainly has a point that Trump referenced his leadership of the Miss Universe pageant as a credential, and we didn’t notice any subsequent efforts by Trump to backtrack on what he said.", "However, Clinton overstated the case modestly when she accused Trump of claiming the pageant as \"foreign policy experience.\"", "Trump definitely cited his pageant experience as evidence that he could work with Russia and Putin -- but the discussion with Baier never broadened out to foreign policy generally. Later in the exchange, for instance, he said that \"they (Russia) want to be friendly with the United States ... (but) they really dislike Obama.\"", "So Trump didn’t say that the pageant helped him understand foreign policy overall. But he did say that it would help him get along with Russia.", "Our ruling", "Clinton said that Trump \"says he has foreign policy experience because he ran the Miss Universe pageant in Russia.\" Trump did cite that as evidence of how he could navigate a relationship with Russia and work with its president, Putin, but he didn’t go so far as to say it bolstered his foreign policy experience more generally. We rate Clinton’s statement Half True.", "https://www.sharethefacts.co/share/49b62c1b-fce5-4519-b03d-70250070d1a0", "Hillary Clinton, foreign policy speech, June 2, 2016", "Donald Trump, interview with Fox News’ Bret Baier, May 5, 2016", "Washington Post Fact Checker, \"Here’s a guide to Clinton’s claims about Donald Trump,\" June 2, 2016", "Politico, \"When Donald Trump brought Miss Universe to Moscow,\" May 15, 2016", "USA Today, \"Trump attributes Russia knowledge to hosting Miss Universe pageant there,\" May 6, 2016", "Business Insider, \"Donald Trump just sold off the entire Miss Universe Organization after buying it 3 days ago,\" Sep. 14, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]