["About this rating", "The Kola Superdeep Borehole, a Soviet engineering project that occurred from the late 1960s to the early 1990s, is the deepest artificially created hole on Earth. Some of the rocks they drilled through contained ancient fossil plankton.", "However, the project's termination had nothing to do with fossils, and everything to do with the fact that it became too hot to drill any deeper. Further, almost all of the pictures used in the advertisement and in the clickbait article that it links to are completely unrelated to the Kola Superdeep Borehole.", "If, in the course of your online browsing, you were to run into an ad with impressive pictures of massive mines and cool looking fossils that advertises an article titled \"Deepest Hole on Earth Permanently Sealed After Finding 2 Billion Year Old Fossil,\" you might think that this item represents a recent event, that it involves impressive looking open-pit mines, and that cool pictures of fossils are the result of the dig. You could be forgiven, as well, if you assumed that there was some sort of link between the fossils and the sealing of this hole.  None of those assumptions would be true.", "The article the ad advertises is about a Soviet engineering project, the Kola Superdeep Borehole, that occurred from the late 1960s to the early 1990s. That article is found on a website named \"Explored Planet.\" The advertisement itself makes use of several photos unrelated to that topic:", "In the above ad, the image on the left is the Mir Mine in Russia. At 1,722 feet deep, it is far from the deepest hole on Earth. The fossil pictured in the top right of the ad is an organism known as a crinoid, which could never have been found in the Kola Borehole because that hole was driven through rocks that formed over a billion years before crinoids even evolved. The image on the bottom right, however, is related: It is the actual sealed-off top of the Kola Borehole.", "While the Cold War saw a much more famous technological race to the moon, there was also a Cold War era competition to see who could drill deep enough to approach the mantle.", "\"During the Cold War,\" BBC Future reported in 2019, \"there was a race by the superpowers to drill as deep as possible into the Earth’s crust – and even to reach the mantle of the planet itself.\"", "As described by the Smithsonian, \"The Kola Superdeep Borehole was just 9 inches in diameter, but at 40,230 feet reigns as the deepest hole.\"", "As reported in a 1984 Scientific American feature, the rocks \"through which the borehole passes encompass 1.4 billion years of earth history\":", "The sedimentary and volcanic rocks found at depths of up to 6,800 meters ... date from the Proterozoic era, which began 2.4 billion years ago. The deeper granitic strata … were laid down as long ago as 2.7 billion years during the Archean era, the first era of geologic time.", "Some of those sedimentary and volcanic rocks contain evidence of plankton fossils, as mentioned in the Explored Planet article's point about \"2-billion-year-old microscopic plankton fossils.\" However, these fossils and/or their discovery had nothing to do with the end of the Kora Borehole project. Extreme heat forced an end to drilling, as explained in Smithsonian Magazine:", "The Kola hole was abandoned in 1992 when drillers encountered higher-than-expected temperatures—356 degrees Fahrenheit, not the 212 degrees that had been mapped.", "The heat wreaks havoc on equipment. And, the higher the heat, the more liquid the environment, and the harder to maintain the bore, said Andrews. It’s like trying to keep a pit in the center of a pot of hot soup.", "Because the ad, and the meandering clickbait it links to, discuss a factual scientific project, but because they mislead readers with unrelated photos and confusing headlines, we rank its claims a \"Mixture.\"", "Snopes debunks a wide range of content, and online advertisements are no exception. Misleading ads often lead to obscure websites that host lengthy slideshow articles with lots of pages. It's called advertising \"arbitrage.\" The advertiser's goal is to make more money on ads displayed on the slideshow's pages than it cost to show the initial ad that lured them to it. Feel free to submit ads to us, and be sure to include a screenshot of the ad and the link to where the ad leads.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]