["“BREAKING: Botswana President In Plane Crash”, reads the headline on an article published by the website Zimbabwehuchi, which we’ve archived here. The article itself then goes on to say that Masisi was reported to have crashed in a helicopter, not a plane.", "The article has been shared hundreds of times on Facebook, according to social media analysis tool CrowdTangle, including this post which was shared more than 200 times. “Yet another sad day in Africa as the helicopter carrying President Masisi of Botswana is reported to have crashed Francistown.More prayers are needed,” reads the caption.", "The Zimbabwehuchi article included this image similarly reporting that Masisi’s helicopter had crashed, which was produced by Botswana’s Sunday Standard and Telegraph newspapers and shared more than 900 times from their Facebook page.", "When posted on Facebook, the Zimbabwehuchi article appears with an image of a crashed helicopter, although this does not appear in the article itself.", "A reverse image search showed that this image was used in a July 16 report by US news outlet NBC about a helicopter crash in Hayward, California that killed a flight instructor and critically injured his student.", "Masasi’s helicopter did not crash, although it did run into trouble.", "Botswana’s government released a statement on July 20 saying the helicopter had to “make an immediate precautionary landing” as the pilots were waiting to land at Francistown airport.", "While taxiing for landing, “the pilots reported an engine fire indication were upon [sic] they promptly executed an engine shut down and landing on runway 13 at the airport,” reads the statement.", "None of the passengers or crew were injured in the landing but an investigation would be carried out to determine the cause, it added.", "PRESS RELEASE ON PRESIDENTIAL HELICOPTER pic.twitter.com/8u2qGCOPCB", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]