["About this rating", "On 13 January 2017, the Now44News web site published an article reporting that a Texas woman performed a sex act on a putative robber in order to distract the intruder and buy time for her family to escape:", "\"He was armed and dangerous but so is my mouth” ... Jennifer Bail is a hero to her family of four after doing the unthinkable to save their life.", "A Texas woman is a hero to her family of four after giving a robber head long enough to distract him so that her husband could hit him in the back of the head with a chair while the children escaped.", "“To say I’d do anything for my children would be an understatement at this point. Plus he wasn’t a minute man so it was a lot of work.” – Jennifer", "Jennifer’s husband Raymond only had one thing to say about the ordeal ...", "“She’s never gave me head like that, but we will talk about that later. For now I’m just glad our children our safe.”", "There was no truth to this story, which was nothing more than a fabrication originating with the Now44News junk news site.", "Now44News was nearly identical to known hoax purveyor Now8News, both of them junk news sites that masqueraded as the online arms of local television news outlets in order to spread hoaxes and generate ad revenues.", "The image of \"Jennifer Bail\" that accompanied the article looked quite obviously like a mug shot, and in fact it depicted a Connecticut woman named Sharon Csapilla who was arrested for an unrelated crime in 2015. The unfortunate Csapilla's flattering photograph was previously appropriated by fake news hucksters for a false tale about a woman's stabbing her boyfriend in the face over an Instagram selfie.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]