["About this rating", "The presidency and policies of Donald Trump engendered a number of protests and outbursts by Hollywood celebrities in 2017 and 2018 which challenged the role of civility, good taste, and decorum in political speech.", "In May 2017, comedian Kathy Griffin apologized after posing for a photo shoot in which she symbolically brandished a fake, bloody, severed head made to look like that of the 45th President.", "At the Tony Awards in June 2018, actor Robert DeNiro got a standing ovation for a brief speech in which he twice exclaimed, \"Fuck Trump.\"", "The following month, videos emerged which appeared to show comedian George Lopez urinating on Donald Trump's star at the Hollywood Walk of Fame in Los Angeles, California. One widely-shared clip, posted by the \"DrunkAmerica.com\" Facebook page on 11 July, blurred out parts of Lopez's midriff, giving the impression that the comedian was exposing himself while symbolically urinating on the president's section of pavement on Hollywood Boulevard.", "The video came with the caption, \"George Lopez Urinates on Trump's Star in Hollywood\":", "In reality, Lopez was not actually urinating on Trump's Hollywood star, although the blurring in this particular video gave that clear impression.", "The original footage was first published by the celebrity gossip web site TMZ. In the absence of any pixellation, it can clearly be seen that Lopez was in fact using a small bottle of water to mimic urinating as part of a prank:", "﻿", "This fact didn't stop TMZ from later manufacturing some mischievous ambiguity of its own about what exactly Lopez was holding in his hands. In a later Twitter video, TMZ also pixellated that area of Lopez's body, hiding the fact that he was actually only using a bottle of water, while also creating the misleading (but sensationalist) impression that he was, in fact, in full micturation:", "George Lopez makes a mess all over Trump's Hollywood star! ? https://t.co/m4zgDA5CPz pic.twitter.com/XOgLS79vbc", "— TMZ (@TMZ) July 12, 2018", "In what appeared to have been a later edit, the DrunkAmerica.com Facebook page did acknowledge, in the post accompanying its video, that \"apparently it’s fake urine,\" adding, \"whether it is or not he’s still an idiot.\"", "Associated Press.  \"Kathy Griffin Apologizes for Trump Photo: 'I Went Too Far.'\"\r\n  Snopes.com.  30 May 2017.", "Italie, Leanne.  \"Robert De Niro Bleeped at Tony Awards for Trump F-Bomb.\"\r\n  Associated Press.  11 June 2018.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]