["About this rating", "On 11 April 2017, the World News Daily Report (WNDR) web site published an article positing that many large \"chunks of frozen human waste\" fell from an airliner onto the top deck of a cruise ship:", "Passengers of a cruise ship sailing off the coast of Hawaii had an extremely unpleasant surprise this morning, when chunks of frozen human waste fell on them from the sky.", "A Boeing 777 airplane belonging to the Taiwanese airline EVA Air, dumped human excreta midair while traveling from Japan to Hawaii.", "Unfortunately, the content of the toilet tank was jettisoned into the sky while the plane was flying over the cruise liner Lady of the Pacific, which was hit by “large chunks of blue ice”.", "The top deck of the ship was literally covered with chunks of blue ice containing human excreta.", "Hundreds of passengers were standing on the top deck at the time, and many were hit by ice projectiles weighing up to 10 lbs.", "North Pacific Cruise Lines, who own and operate the Lady of the Pacific, confirmed they would file a lawsuit against the Taiwanese airline.", "The incident described in the WNDR report did not happen. Although leaks in airliner sewage tanks or drain tubes occasionally result in chunks of what is called \"blue ice\" (i.e., frozen mixtures of blue waste treatment liquid, water, and human waste) accidentally falling onto the ground from planes passing overhead, the intentional mid-flight dumping of an airliner's sewage tank (as described in the WNDR article) is not possible, as Slate noted:", "Do airplanes ever dump their waste while in flight? Not intentionally. Airliner toilets use either a “closed waste system,” which works much like a common house toilet and flushes the wastewater into an onboard sewage tank, or the more modern “vacuum waste system,” which sucks wastewater into the tank. While up in the air, the latter is powered by the difference between the air pressure outside the airplane and inside the cabin, and produces a roaring vacuum whenever a passenger activates the flush. (The noise may make it seem like the toilet is flushing your waste out into the atmosphere, but it’s not.) Under normal circumstances, the ground crew disposes of the sewage after the plane lands. Even if the pilot and flight attendants wanted to empty a tank midflight, they couldn’t, as the valve is located on the outside of the plane, and can only be opened by the ground crew.", "Moreover, the details of the article don't check out: EVA Air does not currently fly to Hawaii from Japan (or from anywhere else), there is no North Pacific Cruise Line, nor does any recognized cruise fleet include a registered ship named Lady of the Pacific.", "Even absent those other clues, the fact that this story was a fabricated one is evident because its sole source was World News Daily Report, a fake news site whose disclaimer (barely) notes that its content is \"satirical\" in nature.", "Wickman, Forrest.   \"Look Out Below!\"\r\n    Slate.   28 February 2012.", "World News Daily Report.   \"Plane Accidentally Empties Toilet Tank Over Cruise Ship, 23 Injured.\"\r\n    11 April 2017.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]