["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Commenting on a mask mandate, Nehls made references to un-American and communist dictators.", "Nehls did not say mask wearing is un-American and did not say people who wear masks are communists.", "In a tight contest for an open House seat in the Houston area, Democrat Sri Preston Kulkarni is attacking his Repubican opponent, Fort Bend County Sheriff Troy Nehls, over his response to COVID-19 safety precautions.", "In a Facebook ad, he claims Nehls \"called wearing masks 'un-American' and called those who do 'communists.'\"", "But the attack gets the facts wrong.", "Kulkarni, a former U.S. foreign-service officer, and Nehls are running for the seat being vacated by Republican Pete Olson, who decided not to run again.", "The race is one of 18 pivotal House and Senate contests up for election on Nov. 3 that PolitiFact is tracking. It’s rated a tossup by the Cook Political Report.", "We rated Half True a super PAC’s claim that Kulkarni attended \"notorious desert drug parties\" and was arrested for cocaine. The party reference was to Burning Man, the Nevada arts and spirituality festival; and his drug arrest was when he was 18.", "Kulkarni’s campaign cited comments Nehls made in a post on his campaign Facebook page on April 22, the day that Judge Linda Hidalgo, the top official in neighboring Harris County, issued an order that residents age 10 and over wear a face covering when outside the home, or face a fine of up to $1,000.", "Nehls wrote, in part:", "\"I encourage people to wear a mask if they have one, I encourage people to wash their hands frequently, I encourage people to do the right thing to help protect our most vulnerable, but this government MANDATE from Harris County is unnecessary, unconstitutional, and unAmerican. It’s an unprecedented overreach which looks more like a communist dictatorship than a free Republic.\"", "The broader context of Nehls’ comment makes clear that he was not referring to the wearing of masks, or to the people who wear them, as Kulkarni’s ad suggests. Nehls was describing the Harris County order as un-American.", "Kulkarni claimed that Nehls \"called wearing masks 'un-American' and called those who do 'communists.'\"", "Nehls called Harris County’s mask mandate un-American and compared it to a communist dictatorship. He was not talking about masks or people who wear them.", "We rate the statement False.\n\nThis fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here for more.", "Facebook, ad (archived here), Oct. 23, 2020", "Facebook, Troy Nehls post, April 22, 2020", "Email, Sri Preston Kulkarni campaign spokesman Jack Doyle, Oct. 26, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]