["About this rating", "In the late 2000s, Al Gore made a series of high-profile statements suggesting the possibility that Arctic sea ice could be completely gone during the summer by around 2013 or 2014.", "Gore did not himself make these predictions but said (in some cases erroneously) that others had, and he never referred to a year-long lack of ice for both poles but instead largely referenced Arctic sea ice in the summer.", "In the years 2007, 2008, and 2009, Al Gore made statements about the possibility of a complete lack of summer sea ice in the Arctic by as early as 2013. While Gore attributed these predictions to scientists, they stemmed from a selective reading of aggressive estimates regarding future melting. The comments became a popular talking point for human-cause climate change deniers in 2014 and onward when the predictions, which in some cases were overstated, did not pan out:", "On 10 December 2007, in his Nobel prize acceptance speech, Gore said:", "Last September 21, as the Northern Hemisphere tilted away from the sun, scientists reported with unprecedented distress that the North Polar ice cap is \"falling off a cliff.\" One study estimated that it could be completely gone during summer in less than 22 years. Another new study, to be presented by U.S. Navy researchers later this week, warns it could happen in as little as 7 years.", "Here, Gore referred to a National Oceanic and Atmospheric Association (NOAA) announcement and two different climate studies, one of which became the source for his most aggressive statements. On 21 September 2007, NOAA did announce that sea ice had hit its lowest recorded point in history.", "The second, more aggressive estimate for when summer sea ice would disappear in the Arctic came from a conference talk at the 2007 American Geophysical Fall Meeting, which was undertaken by researchers associated with the Naval Postgraduate School and was presented later that week. The BBC reported that the study did make the prediction that Gore claimed:", "Scientists in the US have presented one of the most dramatic forecasts yet for the disappearance of Arctic sea ice.", "Their latest modelling studies indicate northern polar waters could be ice-free in summers within just 5-6 years. Professor Wieslaw Maslowski told an American Geophysical Union meeting that previous projections had underestimated the processes now driving ice loss.", "The BBC article also noted that Maslowski’s group, frequently cited by Gore, often made predictions that were more aggressive than their peers': \"Professor Maslowski's group, which includes co-workers at NASA and the Institute of Oceanology, Polish Academy of Sciences (PAS), is well known for producing modelled dates that are in advance of other teams.\"", "On 13 December 2008, Gore appeared to have made a similarly flawed statement while speaking at the opening of a German natural history museum. Although transcripts and clear audio are hard to find, one video of the event documented Gore's saying that \"The entire North polar ice cap may well be completely gone in 5 years.” Given the dates presented, it is likely that Gore was once again referring to Maslowski’s data, and unless he preceded his statement with some qualification not captured by the video, Gore's statement either intentionally or accidentally neglected to mention that this prediction, aggressive as it was, concerned only summer sea ice.", "On 14 December 2009, during a speech at the Copenhagen Climate Conference, Gore cited newer research from the same group, saying: \"These figures are fresh. Some of the models suggest to Dr [Wieslav] Maslowski that there is a 75 per cent chance that the entire north polar ice cap, during the summer months, could be completely ice-free within five to seven years.\"", "That statement put Gore in hot water when Maslowski told rhe Times of London that his data did not allow for such a prediction:", "“It’s unclear to me how this figure was arrived at,” Dr Maslowski said. “I would never try to estimate likelihood at anything as exact as this.”", "Mr Gore’s office later admitted that the 75 per cent figure was one used by Dr Maslowksi as a “ballpark figure” several years ago in a conversation with Mr Gore.", "The claim that Gore “predicted” an ice-free Arctic in 2014 is a simplification of these events. However, Gore was definitely guilty in these cases of cherry-picking science or playing loose with the details of that science.", "Gore’s statements gained the most viral attention in 2014 and 2015, both because these were years in which Gore’s statements implied an ice-free summer in the Arctic and because those years had relatively more arctic sea ice than preceding years.", "From a broad perspective, however, summer sea ice in the Arctic has in fact been declining at faster rates relative to 20th century, and the year 2016 tied with the year 2007 (the year highlighted by Gore in his Nobel speech) for the second least Arctic summer sea ice on record (the lowest recorded sea ice extent occurred in 2012).", "While the disappearance of summer sea ice is difficult to predict, a 2013 review of different approaches (including Maslowski’s) summarized the range of various predictions for the first ice-free summer in the Arctic:", "We have investigated three approaches to predicting 21st century summer Arctic sea ice loss as represented by trendsetters, stochasters, and modelers [three quantitative approaches used to make predictions]. At present, it is not possible to completely choose one approach over another as all approaches have strengths and weaknesses ...", "Time horizons for summer sea ice loss of these three approaches turns out to be roughly 2020, 2030, and 2040 respectively for trendsetters, stochasters, and modelers ...", "It is reasonable to conclude that Arctic sea ice loss is very likely to occur in the ﬁrst rather than the second half of the 21st century, with a possibility of loss within a decade or two.", "Arctic sea ice is without question on a declining trend, but Gore definitely erred in his use of preliminary projections and misrepresentations of research. Because Gore himself did not claim to have made these predictions, however, and because his statements applied specifically to summer sea ice in the Arctic, we rate the claim that Gore \"predicted the ice caps will melt by 2014\" as a mixture.", "Gore, Al   \"Al Gore - Nobel Lecture\"\r\n    Nobeprize.org.   10 December 2007", "Whelan, J. et al.   \"Understanding Recent Variability in the Arctic Sea Ice Thickness and Volume - Synthesis of Model Results and Observations.\"\r\n    AGU Fall Meeting, 2007.   December 2007.", "Amos, Jonathan.   \"Arctic Summers Ice-Free 'by 2013.'\"\r\n    BBC News.   December 2007.", "Rhein-Zeitung.   \"Al Gore hält Rede zur Eröffnung des Gondwana-Park.\"\r\n    13 December 2008.", "FORA TV.   \"COP15: Gore and Støre Report on Arctic's Melting Ice.\"\r\n    14 December 2009.", "Devlin, Hannah et al.   \"Inconvenient Truth for Al Gore as His North Pole Sums Don't Add Up.\"\r\n    The [London] Times.   15 December 2009.", "Starr, Cindy et al.   “Annual Arctic Sea Ice Minimum 1979-2015 with Area Graph.\"\r\n    NASA Scientific Visualization Studio.   10 March 2016.", "National Snow and Ice Data Center.   \"2016 Ties With 2007 for Second Lowest Arctic Sea Ice Minimum.\"\r\n    15 September 2016.", "Overland, James E. and Muyin Wang.   “When Will the Summer Arctic Be Nearly Sea Ice Free?\"\r\n    Geophysical Research Letters.   21 May 2013.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]