["About this rating", "In March 2019, the NPC Daily website published an article reporting that a 28-year-old man named Jared Michelle had sold his testicles in order to raise money in support of Bernie Sanders' presidential campaign:", "Bernie Sanders is breaking records left and right. When it comes to the rate at raising money for his campaign, he takes the cake hands down. He announced a matter of weeks ago and he is already at nearly 30 million in donations -- most of which coming from millennials donating everything they have for the cause they believe in.", "NPC Daily has reported stories of forward-thinking liberals who have donated their entire student loans to the Bernie Sanders campaign, some who have took out multiple mortgages on their property as well as some who have donated their family’s money.", "There have been numerous millennials who have sold their organs such as kidneys, liver parts, skin grafts and hundreds of thousands of gallons of blood. This report is gathered from the quote of a brave millennial who sold both of his testicles to raise money for the Bernie Sander’s 2020 campaign.", "This was not a genuine news story, as the NPC Daily is a satirical website that does not publish factual items. A disclaimer on the website's \"About\" page states that \"NPC Daily is a satire site, providing political and cultural commentary with wanton sarcasm. NPC Daily pokes fun of modern journalism and liberalism. If you believe one of our articles is real, it’s because the content is not too far adrift from what is published by mainstream news outlets. But, alas, our content is totally fictitious and is created to elicit laughs and bemusement.\"", "The picture of the brave\" Jared Michelle that accompanied the article was actually a stock photograph of \"man wearing sunglasses.\"", "While we've encountered a number of legends about people selling their organs (including testicles) to medical schools for profit, these stories are generally false as the National Organ Transplant Act of 1984 prohibits the sale of human organs in the U.S.", "United Network for Organ Sharing.   \"National Organ Transplant Act Enacted 30 Years Ago.\"\r\n    19 October 2014.", "NPCDaily.com.   \"Brave Millennial Sells Testicles to Raise Money for Bernie’s 2020 Campaign.\"\r\n    2 March 2019.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]