["Everyone wants to know how the presidential election will affect their wallets.", "One viral Facebook post claims Democrat presidential candidate Joe Biden would institute a federal property tax.", "The post from Sept. 6 reads: \"Biden wants to put a 3% annual federal tax on your home. Do you want him for POTUS?\" It had been shared more than 4,300 times and amassed over 150 comments as of Friday morning. USA TODAY has reached out to the poster for comment.", "This is not the lone misinformation regarding Biden's tax plans. Recently, viral claims on Facebook said tax rates for some families would more than double if Biden were elected president. USA Today concluded those claims were false.", "The poster did not respond to USA TODAY's request for evidence to back up his claim.", "Biden has not proposed a federal property tax as part of his tax plan, and in fact, it may not be legal to do so.", "The federal government is generally barred from levying property taxes under the Constitution. Article 1, Clause 9, Section 4 states: \"No Capitation, or other direct, Tax shall be laid, unless in Proportion to the Census or enumeration herein before directed to be taken.\"", "A direct tax is one paid straight to the government, while \"proportion to the census\" and \"enumeration\" mean that any tax would have to be based on population.", "There are exceptions, such as federal income tax. It is permitted due to the 16th Amendment, ratified in 1913, which states: \"the Congress shall have power to lay and collect taxes on incomes, from whatever source derived, without apportionment among the several States, and without regard to any census or enumeration.\"", "Property tax, however, has no such exemption.", "Property taxes are collected at the state and local level, with the state also establishing guidelines for local governments to impose them. Local governments rely heavily on property taxes, while they may account for only a small portion of state revenues.", "PolitiFact also debunked the 3% property tax rumor, with Gordon Mermin, a senior research associate at the Tax Policy Center, telling the fact-checker that \"based on our review of the campaign materials and our conversations with the campaign to try and clarify what their proposals are … there’s nothing there. We haven’t encountered anything that could be construed as a tax on homes.\"", "Biden's tax plan is called \"highly progressive\" by the Committee for a Responsible Federal Budget, a nonprofit, nonpartisan organization, which says that it would increase taxes by 13%-18% of after-tax income for the top 1% of earners, and indirectly increase taxes for most others by 0.2%-0.6%.", "Those elements were compiled based on estimates by the Tax Policy Center, Penn Wharton Budget Model, Tax Foundation and American Enterprise Institute in addition to supplements from Committee for a Responsible Federal Budget.", "More:A majority of Americans see Biden as more empathetic to those with COVID-19 than Trump, survey finds", "Major components of Biden's tax plan would \"raise the corporate tax rate from 21 to 28 percent, set minimum corporate taxes for domestic and foreign income, restore the top individual tax rate from 37 to 39.6 percent, tax capital gains as ordinary income and at death for very high earners, limit various tax breaks for higher earners, subject wages above $400,000 to the Social Security payroll tax, and pass various other cuts and increases,\" CRFB says. It also would provide credit for first-time homebuyers and a refundable renter's credit for low-income renters and increase the child care and dependent care tax credits.", "The Tax Foundation estimates that Biden's plan would \"lead to 7.8 percent less after-tax income for the top 1 percent of taxpayers, 1.1 percent lower after-tax income for the top 5 percent, and around 0.6 percent less after-tax income for other income quintiles.\"", "This claim is FALSE, based on our research. Joe Biden has not proposed a 3% property tax. The U.S. Constitution may not allow for such a tax.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]