["About this rating", "In the summer of 2018, a relatively obscure satirical web site managed to create an online buzz and trick some readers into believing that the Walt Disney Company was about to begin work on a new theme park in a small city in Michigan's Upper Peninsula.", "Uncle Walt's Insider, which publishes Disney and amusement park-themed fake news and satire, reported on 2 July:", "Following the recent discovery of a “Hidden Mickey” in a bowl of breakfast cereal, Disney has announced that they will be building a theme park just outside of Escanaba, Michigan. Escanaba? Seriously? Escanaba? Seriously. They said Escanaba.", "...", "We caught up with Disney spokesperson Jun Disney (no relation) for the backstory. “After the discovery of the Hidden Mickey in the Corn Flakes, we took that as a sign that we really should take a closer look at Escanaba. It turns out that it (Escanaba) is an amazingly scenic town in Michigan’s Upper Peninsula. We went up there, and we were blown away. The warm waters of Lake Michigan, the delicious pasties, and the friendliness of the Yuppers, it all makes sense.”", "The story is a fabrication. There is no Disney spokesperson named \"Jun Disney,\" and the incident described as a motivating factor for the company's purported decision — an apparition of Mickey Mouse in a bowl of cereal in Escanaba — was in fact another fabrication from the same web site.", "Uncle Walt's Insider is replete with tongue-in-cheek allusions to its satirical nature (staff biographies mention a founder named \"Uncle Walt,\" born in 1901, like Walt Disney himself; and the home page features a fake quote from Uncle Walt which reads \"There's so much misinformation out there. We're just doing what we can to help.\")", "Setting aside the clearly satirical intentions behind the web site and its articles, there is no corroboration whatsoever — even in the form of unofficial rumors — for the claim that Disney is planning to build a new theme park in Escanaba, Michigan.", "Uncle Walt's Insider.  \"Disney to Build Park in Michigan's Upper Peninsula.\"\r\n  Uncle Walt's Insider.  2 July 2018.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]