["Democratic presidential candidate Hillary Clinton, left, speaks on stage with her husband and former President Bill Clinton during a Nevada Democratic caucus rally on Feb. 20, 2016, in Las Vegas. (AP)", "An inaccurate attack about the Clinton Foundation and Russia gained renewed popularity on Facebook.", "One Nov. 13 post claims the philanthropy run by Bill and Hillary Clinton has received money from Russia in the past, while President Donald Trump got nothing.", "\"Russia donated 0$ to Donald Trump,\" the post reads. \"Russia donated 145.000.000$ to the Clinton Foundation. Why was Trump’s campaign INVESTIGATED?\"", "We’ve fact-checked variations of the claim, and this one is no more accurate.", "The post, which has been shared hundreds of times by several conservative pages, was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "(Screenshot from Facebook)", "The image itself — which displays text around a photo of Russia President Vladimir Putin holding Rep. Adam Schiff, D-Calif., as a puppet — appears to have been created on ImgFlip, a popular meme-making site, at least two months ago. It’s a riff off a similar meme from 2016 that originally had Trump’s head where Schiff’s is.", "Here’s what you need to know:", "• There’s no evidence that Clinton Foundation received contributions from the Russian government. At best, investors with a business connection to Russia donated $4 million. (See the previous fact-check.)", "• There’s no evidence that Trump has accepted political contributions from the Russian government. Russians have invested in his properties.", "The Clinton Foundation donations involve nine people related to a 2007 deal between Clinton Foundation board member Frank Giustra’s company and Uranium One, a Canadian mining company. In 2009, Russia’s nuclear energy agency bought a 17% share of Uranium One. A year later, it bought enough shares to give it a 51% stake.", "But the bulk of the money donated to the Clinton Foundation, about $131 million, came from Giustra — a businessman from Canada, not Russia.", "Giustra said he sold off his entire stake in the company in 2007, three years before the Russia deal and about 18 months before Clinton became secretary of state.", "If he is telling the truth, the donation amount to the Clinton Foundation from Uranium One investors drops significantly — from $145 million to $4 million.", "According to the Federal Election Commission, foreign nationals are not permitted to contribute to American elections. That includes foreign governments donating to campaigns. So Russians could not directly contribute to Trump’s 2016 campaign.", "RELATED: Exaggerated post connects Clintons, Russia, uranium deal", "Special Counsel Robert Mueller considered bringing charges against members of the Trump campaign for meeting with Russian nationals who said they had dirt on Clinton, but ultimately didn’t. The reason is \"the government would likely encounter difficulty in proving beyond a reasonable doubt that the value of the promised information exceeded the threshold for a criminal violation.\" The Mueller report makes no mention of donations to the Trump campaign.", "Trump himself has benefited from Russian money through his global real estate business. A 2017 Reuters investigation found that Russian elites have invested tens of millions of dollars in Trump’s buildings. Among the buyers were several politically connected businessmen, but none were from Putin’s inner circle.", "A Facebook post claimed that the Clinton Foundation has received $145 million from Russia, while Trump has received nothing.", "It’s inaccurate to say that the Clinton Foundation $145 million — it may be closer to $4 million from Uranium One investors. It against election law for candidates to accept political contributions from foreign governments, and the Mueller report did not show that Trump’s campaign broke it.", "The statement is not accurate. We rate it False.", "Business Insider, \"Here's a glimpse at Trump's decades-long history of business ties to Russia,\" March 22, 2019", "Federal Election Commission, Foreign nationals, accessed Nov 14, 2019", "Facebook post, Nov. 7, 2019", "ImgFlip, accessed Nov. 14, 2019", "ImgFlip, accessed Nov. 14, 2019", "PolitiFact, \"Complex tale involving Hillary Clinton, uranium and Russia resurfaces,\" Dec. 7, 2018", "PolitiFact, \"Exaggerated post connects Clintons, Russia, uranium deal,\" Oct. 28, 2019", "PolitiFact, \"The Mueller report: What you need to know,\" April 18, 2019", "Reuters, \"Russian elite invested nearly $100 million in Trump buildings,\" March 17, 2017", "Special Counsel Robert Mueller’s redacted report, April 18, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]