["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Sen. Rand Paul, R-Ky., told CNN's Erin Burnett that \"only 15 percent of government spending is shut down.\" We took a closer look.", "When someone says the government is \"shut down,\" it sounds like most services have ground to a halt, except for activities to protect life and property. But Sen. Rand Paul, R-Ky., suggests that dire image is exaggerated.", "During an interview on CNN on Oct. 2, 2013, Paul told anchor Erin Burnett that \"85 percent of government's running right now. Only 15 percent of government spending is shut down.\"", "Is he right? We took a closer look and found that there are different ways to measure government. Government spending is one way, but the picture changes when you look at the federal workforce.", "First, some background. A government shutdown happens when one particular kind of federal funding stops flowing -- money that’s appropriated by Congress. Appropriations bills are supposed to be passed annually, though in recent years, acrimony between Congress and the president has made it happen more irregularly.", "However, other types of federal spending are unaffected by the shutdown because they aren’t subject to annual appropriations. An important one is known as mandatory spending -- money paid out to anyone who meets a fixed definition, such as someone who qualifies for Social Security or Medicare. Much of President Barack Obama’s health care law is also unaffected by the shutdown since it is not dependent on regular appropriations, Also, interest payments on the debt are not affected by a shutdown.", "So if you’re trying to determine how much spending is \"on\" during a shutdown and how much is \"off,\" you have to compare the amounts that fit into these various categories.", "According to the fiscal year 2014 figures from the Congressional Budget Office -- Congress’ nonpartisan number-crunching agency -- the federal budget includes $2.2 trillion for mandatory spending, plus $237 billion in interest payments. These two categories add up to $2.4 trillion, out of a total budget of $3.6 trillion -- or about 68 percent.", "The percentage grows closer to Paul’s estimate of 85 percent once you add in spending on military personnel. Such spending would ordinarily be subject to cutbacks, but it was exempted by enactment of the Pay Our Military Act, which Congress passed and the president signed shortly before the shutdown began.", "Paul’s office, citing Senate Budget Committee calculations, said the Pay Our Military Act frees up $225 billion in payments to be paid. That brings the percentage up to 74 percent.", "And the percentage rises further once you count the costs of federal activities that are continuing during the shutdown because they safeguard the public’s safety and property. The problem is that it’s hard to nail down exactly how much money is being spent on such activities, since we’re so early in the shutdown and because many of the decisions have been made on the fly.", "In order to reach Paul’s 85 percent threshold, the government would need to be spending $404 billion from its \"discretionary\" (or appropriated) budget beyond military personnel. That means the government would be spending 43 percent of the remaining discretionary spending on activities that continue through the shutdown.", "Experts we spoke to said that percentage is plausible. Even if you cut that $404 billion figure in half, Paul would still be pretty close -- the figure would be 79 percent rather than 85 percent. We’ll only know the final number for certain after the shutdown is over.", "Still, spending isn’t the only way to look at this issue. For instance, if you look at the number of federal employees furloughed, the percentage left unscathed by the shutdown is likely much lower than the 85 percent figure Paul cited for spending.", "Estimates published in the New York Times suggest that at least six agencies were expecting to keep 20 percent or less of their workforce laboring through the shutdown, with another three expecting to continue employing between 21 percent and 50 percent.", "Using spending as the unit of measurement biases the perception of how far-reaching the shutdown is, because so much of the budget is spent on things like Social Security and Medicare -- programs that are dollar-heavy but personnel-light, said John M. Palguta, vice president for policy at the Partnership for Public Service, an advocacy group for government service.", "\"Government spending does not equal government,\" said Steve Ellis, the vice president of Taxpayers for Common Sense. \"So while it hard to come up with an accurate figure as to how much government is still being done, the spending burn rate is not the best way.\"", "Our ruling", "Paul said that \"85 percent of government's running right now. Only 15 percent of government spending is shut down.\"", "Government shutdowns by nature are somewhat haphazard, so it’s hard at this point to calculate these numbers with any precision. However, due to the big role of entitlement spending in the federal budget, Paul is likely in the ballpark when he measures \"government\" by the yardstick of spending.", "However, measuring government in other ways, such as the percentage of federal employees being furloughed in major departments, would make the impact appear bigger. And when he said that \"85 percent of government\" is operating right now, that’s more of a stretch.", "Paul’s comment is partially accurate but leaves out important details, so we rate it Half True.", "Rand Paul, comments on CNN, Oct. 2, 2013", "CNSNews, \"Rand Paul: '85 Percent of Government Is Being Funded,'\"Oct. 2, 2013", "Congressional Budget Office, \"Updated Budget Projections: Fiscal Years 2013 to 2023,\" May 2013", "Congressional Budget Office, \"Costs of Military Pay and Benefits in the Defense Budget,\" November 2012", "Text of the Pay Our Military Act", "New York Times, \"Who Goes to Work? Who Stays Home?\" Sept. 27, 2013", "Email interview with John Palguta, vice president for policy at the Partnership for Public Service, Oct. 3, 2013", "Email interview with Steve Ellis, vice president of Taxpayers for Common Sense, Oct. 3, 2013", "Email interview with Todd Harrison, senior fellow at the Center for Strategic and Budgetary Assessments, Oct. 3, 2013", "Email interview with Eleanor May, press secretary to Rand Paul, Oct. 3, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]