["The STI outbreak allegedly occurred in Migori County located in the western part of Kenya and according to reports locals have already branded the disease Jakadala. It is alleged that the disease is so severe that it makes the penis rot in three days and kills within the same period.", "One Facebook post shared in this group, which has more than 1.9 million members, attracted over 1500 comments.", "A caption accompanying the misleading post reads: \"Jakadala is real and much worse than normal STIs... I will never ever think of sex again.\"", "Another post shared with a link from this website included a photo of a man with numerous reddish sores on his back and a second picture of hands with black spots on them. These two photos were also circulated on Twitter to depict the apparent extent of Jakadala SDI.", "However, a reverse image search on Yandex search engine revealed that these two photos were old images used frequently on various sites to show the effects of untreated Syphilis.", "The photo of the man with red sores on the back was taken from a book titled Images of Memorable Cases: 50 Years at the Bedside, authored by Hendrik A. Van Dijk and Herbert L. Fred.", "The writers described the image as that of a 23-year-old homosexual man who had severe skin eruption due to Syphilis.", "Another photo from one of the misleading posts was of a man whose penis appeared grossly affected by the alleged disease.", "Warning: Graphic Content", "Show", "Hide", "Dr. Sammy Mahugu from at the Ministry of Health told AFP that the man in the photo was, in fact, suffering from penile cancer and not Jakadala as the post alleged.", "Mahugu confirmed there was no outbreak of a new STI in the western part of Kenya.", "“There is no such disease. Even the world has not received reports of any diseases called Jakadala,” he said.", "When news of the outbreak went viral online, Migori county executive in charge of Health Dr. Isca Olouch held a press conference on December 18, 2018, where she dismissed the reports as rumours.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]