["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Sen. Lindsey Graham of South Carolina is a member of the bipartisan Gang of Eight senators pushing for comprehensive immigration reform.", "Graham has repeatedly used his state’s labor issues to justify guest worker programs for low-skilled and agricultural workers.", "\"Nobody wants to displace a willing American worker, but I can tell you in South Carolina there are certain jobs, like in the meatpacking industry, that as an employer you can advertise all day long every day of the week and you’re not going to get that workforce,\" Graham said during a February 2013 Senate hearing.", "The senator made similar comments to a South Carolina Rotary Club. \"When you go to these meatpacking plants in Saluda (S.C.), harvesting the crops or servicing the hotels along the coast, you may not believe it, but it is true -- there is a shortage of labor in some parts of our economy, even though we have high unemployment,\" Graham said.", "We wanted to know whether Graham’s comments about a labor shortage in some areas were correct.", "South Carolina’s jobless rate is higher than the national rate. That state and Georgia’s seasonally adjusted unemployment rate was 8.4 percent in March. The national rate was 7.6 percent.", "So why would jobs go unfilled? The issue may be one of wages, not workers, said Steve Camarota, research director at the Center for Immigration Studies, which advocates for low levels of immigration.", "\"Real wages in meat/poultry processing have declined about 40 percent in the last 30 years. These are not the lowest-paying jobs, but they are nasty, not pleasant work,\" he said. \"If the job pays dramatically less than it previously did, that means there is a wage issue and not a jobs issue.\"", "The national average hourly wage for slaughterers and meatpackers was $11.99 in May 2012. In South Carolina, the average hourly wage was $11.36. In 2010, the national hourly wage for the job was $11.55; South Carolina’s wage was $8.81.", "Because of the nature of the work and the pay, the jobs may not attract enough applicants, said Mark Grey, an anthropology professor and director of the Iowa Center for Immigrant Leadership and Integration. The nonprofit, nonpartisan center at the University of Northern Iowa notes that its programs incorporate \"a strong appreciation for the critical role newcomers play\" in the state’s economy.", "\"(Meatpacking) wages have increased, but still at $16 per hour (on the high end), the job would probably not be appealing to anybody with any kind of education,\" he said.", "In Saluda County, S.C. -- the area mentioned by Graham -- the unemployment rate for residents with less than a high school diploma was 19.1 percent in 2011, the most recent federal data available. The rate dropped to 10.9 percent for high school graduates with no college. Statewide unemployment that year was 10.5 percent.", "To sum up, research shows that South Carolina’s unemployment is almost a full percentage point higher than the national average, and the rate for lower-educated residents is even higher. But in the meatpacking industry, the nature of the work and the wages often turn off many American workers, those on both sides of the immigration debate said.", "Graham said that there was a problem filling certain jobs, even amid high unemployment. But his statement lacks context about wages and conditions in the meatpacking industry. We rate his claim Mostly True.", "Cherokee Tribune, \"Immigration group puts up billboard slamming senator,\" Joshua Sharpe, April 18, 2013", "Easley, S.C., Patch, \"Graham: Immigration reform’s time is now,\" Jason Evans, Feb. 26, 2013", "Center for Immigration Studies, \"The employment situation in South Carolina,\" Steven A. Camarota, Feb. 26, 2013", "U.S. Sen. Lindsey Graham, \"Graham discusses immigration reform,\" posted Feb. 14, 2013", "The New York Times, \"Senators’ group reaches deal on immigration reform,\" April 10, 2013", "U.S. Department of Labor, Civilian labor force and unemployment by state, accessed April 22, 2013", "U.S. Department of Labor, BLS Occupational Employment and Wages statistics -- May 2012, slaughterers and meat packers, accessed April 24, 2013", "Reuters, \"Senators unveil immigration reform bill,\" Richard Cowan and Rachelle Younglai, April 16, 2013", "Pew Research Center, Immigration: Key data points from Pew Research", "Huffington Post, \"Breaking down the Gang of Eight’s immigration bill,\" April 21, 2013", "Phone interview, Steven A. Camarota, director of research, Center for Immigration Studies, April 24, 2013", "Phone interview, Mark Grey, director, Iowa Center for Immigrant Leadership and Integration, University of Northern Iowa, April 29, 2013", "Politico, \"Bob Goodlatte outlines cautious path for House GOP on immigration,\" Seung Min Kim, April 25, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]