["A radio ad attacking former Gov. Charlie Crist accuses him of signing the nation’s \"harshest marijuana laws.\" And it’s aimed at a voting bloc that overwhelmingly sides with Democrats: African-Americans.", "\"While Crist was coddling the gun lobby, he was cracking down on us,\" says the ad from Progressive Choice Florida, a 501(c)4 group that’s been attacking Crist from the left. \" Passing maximum sentencing laws. Signing the nation’s harshest marijuana laws. And enacting the country’s strictest penalties against non-violent offenders – many of whom just happen to be black.\"", "We wanted to know if Crist had signed \"the nation’s harshest marijuana laws.\" That claim caught our attention because one of Crist’s chief backers is attorney John Morgan, who’s been bankrolling a campaign urging a constitutional amendment to allow medical marijuana.", "Our research showed that Florida is tough on those busted for pot, but that reputation began long before Crist was governor.", "Marijuana law during Crist’s tenure", "Progressive Choice Floridapointed to two bills signed by Crist: House Bill 173, the Marijuana Grow House Eradication Act in 2008, and the so-called \"Bong Bill\" outlawing drug paraphernalia in 2010.", "The grow house law made it a second-degree felony to grow 25 or more plants; the previous law set the threshold at 300 plants. The bill also allowed law enforcement to destroy bulky grow house equipment and simply take photos or video. While law enforcement widely supported the bill, advocates for marijuana and the ACLU of Florida opposed it.", "The bill passed the Senate unanimously and only one representative, Broward Democrat Evan Jenne, voted against it. Jenne told PolitiFact Florida that he opposed the provision that allowed law enforcement to destroy evidence.", "Though Crist signed the bill, the champion of it was then-Republican Attorney General Bill McCollum, who two years later lost a primary in the governor’s race against Scott.", "William Shepherd, who worked for McCollum at the time, said he doesn’t know what \"harshest\" would mean or how Florida’s law compared to other states. (The federal standard was 100 plants.) However, he said the grow house bill was a major change for Florida. \"We definitely ramped up the marijuana production laws,\" he said.", "In March 2008, Crist told a Miami Herald reporter that he favored Florida's tough drug laws and didn't support reviewing whether to lessen penalties for some crimes such as nonviolent drug possession.", "Two years later, the bong bill made it a crime to sell smoking devices such as pipes and bongs at most head shops.", "We found no evidence that Crist pushed hard for the bill, which he signed after the Legislature unanimously passed it in 2010.", "Were Florida laws 'harshest'?", "We reached out to experts on marijuana laws to ask if Florida held some sort of record for having \"the nation’s harshest marijuana laws.\"", "Comparing state drug policies is difficult at best, because each state codifies offenses and sentences in different ways, according to Tamar Todd, an attorney with the pro-decriminalization Drug Policy Alliance.", "\"One of the challenges of cross-state comparison is that some states might be harsher, in that cultivation of any amount is a felony with a harsh sentence, but at the same time cultivation in the presence of a minor is not a separate more serious offense,\" Todd said. \"Other states classify crimes differently than degrees of felonies.\"", "He added that how much time offenders actually get may differ, because states often employ diversion programs or habitual offender statutes, muddying the waters concerning sentencing records.", "Other advocates for legalizing at least some uses of marijuana or reforming marijuana laws told PolitiFact Florida that the state had long had a reputation for tough marijuana laws -- and that didn’t suddenly occur when Crist was governor.", "Allen St. Pierre, executive director of NORML which advocates for reform of marijuana laws, pointed to a handful of states that he said have laws that are equally or more harsh than Florida’s including Georgia, Texas, Idaho, Missouri and Wyoming.", "\"Florida, ever since the early 1980s, has historically (and) traditionally always had pretty harsh laws,\" St. Pierre said.", "The bills Crist signed as governor didn’t change Florida’s reputation in terms of marijuana laws, he said.", "\"In general, no drug policy reform group, including NORML, viewed the passage of the 2008 anti-cultivation laws as being particularly harsh as much as we did out-of-touch with where most rest of the country is moving politically on cannabis policy,\" St. Pierre told PolitiFact Florida.", "Paul Armentano, deputy director of NORML, wrote an article in 2011 about \"The Five Worst states to get busted with pot.\" The \"top 5,\" in order of severity, were Oklahoma, Texas, Florida, Louisiana and Arizona.", "\"No other state routinely punishes minor marijuana more severely than does the Sunshine State,\" he wrote. \"Under Florida law, marijuana possession of 20 grams or less (about two-thirds of an ounce) is a criminal misdemeanor punishable by up to one-year imprisonment and a $1,000 fine. Marijuana possession over 20 grams, as well as the cultivation of even a single pot plant, are defined by law as felony offenses – punishable by up to five years in prison and a $5,000 fine.\"", "A Progressive Choice Florida spokeswoman cited an analysis of state laws and sentencing guidelines written by Jon Gettman, a former NORML director. He wrote that, \"The states with the most severe overall penalties for marijuana possession are (in order of severity) Florida, Montana, Arkansas, Georgia and Oregon (tied) and Missouri.\" But Gettman’s article was based on 2007 arrests and laws in place before Crist was governor.", "NORML board member Florida attorney Norm Kent told PolitiFact Florida that he considers our state’s laws \"draconian and amongst the toughest\" but doesn’t consider Florida the worst in the nation. (Kent endorsed Crist earlier this year.)", "\"What happens on the third strike in Texas is you can get life in prison if it’s a marijuana charge,\" he said.", "Our ruling", "A radio ad says that Charlie Crist signed \"the nation’s harshest marijuana laws.\"", "As governor, Crist signed laws that cracked down on grow houses and bong sales. But both bills sailed through the Legislature without any particular advocacy from Crist. In both cases, the laws didn’t change Florida’s pre-existing reputation as having tough marijuana laws.", "We rate this claim Mostly False.", "Progressive Choice Florida, radio ad (text), June 23, 2014", "NORML, State laws, accessed June 27, 2014", "NORML board member Norm Kent, \"Florida’s Silver Bullet: the marijuana grow house eradication act,\" Jan. 16, 2009", "NORML, \"The Five Worst states to get busted with pot\" May 13, 2011", "Florida House, House Bill 173, Signed by Gov. Charlie Crist June 17, 2008", "Florida House, Senate Bill 366, Signed by Gov. Charlie Crist May 27, 2010", "Charlie Crist for governor, Campaign website, Accessed June 27, 2014", "Miami Herald Gay South Florida blog, \"LGBT activists in Fort Lauderdale fundraise for gubernatorial candidate Charlie Crist,\" March 20, 2014", "Orlando Sentinel, \"Radio spot in Orlando accuses Crist of causing a ‘lost generation of African-Americans,\" June 23, 2014", "Orlando Sentinel, \"McCollum: Crack down on sophisticated growing operations,\" Oct. 20, 2007 accessed via Nexis", "Miami Herald, \"Crist wants to maintain drug penalties,\" March 15, 2008, accessed via Nexis", "Tampa Bay Times, \"Florida has toughest pot laws, group finds,\" Nov. 5, 2009, accessed via Nexis June 27, 2014", "Tampa Bay Times, \"Charlie Crist’s boss, John Morgan, to lead medical marijuana initiative,\" March 16, 2013", "DrugScience.org, \"Marijuana Arrests in the United States (2007),\" November 2009", "Florida House of Representatives, CS/HB 173 overview, accessed June 27, 2014", "ACLU of Florida, \"2008 Florida legislative session summary,\" 2008", "Interview, Jamie Fontaine-Gansell, spokesman Progressive Choice Florida, June 27, 2014", "Interview, Allen St. Pierre, NORML executive director, June 27, 2014", "Interview, Paul Armentano, NORML deputy director, June 27, 2014", "Interview, former state Rep. Evan Jenne, D-Dania Beach, June 27, 2014", "Interview, NORML chair emeritus and defense attorney Norm Kent, June 27, 2014", "Interview, former Attorney General Bill McCollum, June 27, 2014", "Interview, William Shepherd, statewide prosecutor under Florida Attorney General Bill McCollum and now Holland and Knight attorney, June 27, 2014", "Interview, Drug Policy Alliance attorney Tamar Todd, June 27, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]