["The claim was published on Daum Cafe here on February 1, 2021.", "Part of the Korean post translates to English as: “What to do when having a heart attack and when alone?", "“Don’t be scared and cough vigorously and repeatedly.", "“You should keep coughing every two seconds until someone comes to help you or you feel that the condition of your heart has become normalised.”", "A similar claim was also shared on Daum Cafe here, here, here; on Facebook here, here and here; and Naver Blog here.", "The claim, however, is false, according to health experts.", "There is no evidence that coughing vigorously — a technique known as “cough CPR” — can stop a heart attack, according to the British Heart Foundation (BHF).", "“There is no medical evidence to support \"cough CPR\", which suggests you can help yourself by coughing vigorously if you think you’re having a heart attack and are alone,” Christopher Allen, a BHF coronary care specialist, notes here.", "Allen went on to say that the misleading claim circulating on social media is a “myth”, as he urged internet users to “avoid spreading it any further”.", "The American Heart Association (AHA) and The National Heart Foundation of Australia also do not endorse “cough CPR.”", "“This is the incorrect treatment for a heart attack or cardiac arrest and can delay treatment for saving someone’s life,” the Heart Foundation of Australia states here. “There is no evidence of any benefit of ‘cough CPR’ for heart attack or cardiac arrest.”", "The AHA said here that the “best strategy is to be aware of the warning signs for cardiac arrest – sudden loss of responsiveness and no normal breathing – and call 911.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]