["The photo was shared in this Facebook post on June 24, 2019.", "Below is a screenshot of the misleading post:", "The text above the image collage states: “People flee in terror after human-shaped figure appears above Zambian shopping centre.", "The text below it states: “Locals in the town of Kitwe, Zambia, ran in horror after spotting what looked like a massive human-shaped figure in the clouds above a shopping centre.”", "The same image collage was shared with an identical claim on Facebook here.", "The left image in the collage was also shared on Instagram here in March 2017.", "The text on the image reads; \"Above Zambian Mall… Seen in sky 4th March 2017\".", "The caption states in part: “Zambian shoppers run in terror when strange ‘Harry Potter Dementor’ figure appears in clouds.”", "Below is a screenshot of the misleading post:", "British newspapers The Daily Mail and The Sun also published the same images here and here with a similar claim that the apparition was spotted at the Mukuba Mall in the Zambian city of Kitwe.", "The claim is false; the image has been doctored using a photo of a kite designed by a UK-based artist.", "Reverse image searches on Google found this March 6, 2017, tweet that includes an identical image of the human-shaped figure in the misleading posts.", "The tweet states in part: “Here’s the original image. It’s the Spirit Man kite.”", "Below is a screenshot comparison of the first image in the misleading posts (L) and the photo in the tweet (R):", "The image of the kite was tilted and inserted into the second image in the misleading posts.", "Below is a screenshot of the second image in the misleading posts (L) and the photo in the tweet (R):", "A keyword search for Spirit Man kite found this website for kite designer Martin Lester, who created a kite series called Spirit.", "The designer, who is based in Isles of Scilly in southwest England, told AFP in an email on July 1, 2019: “I can confirm that the image shows one of my spirit kites.", "“The Spirit is a soft inflatable 3D kite, made of lightweight ripstop nylon, a very light and strong fabric, it has no sticks or frame and relies on the wind to inflate it, to give its shape to fly… I designed this kite about 15 years ago”.", "Below is a screenshot of the email:", "Lester has also designed other human-shaped kites, namely Scuba and Flying Man. Images of those kites are available here on his website.", "Below is a screenshot of the images of the Spirit kite on Lester’s website:", "Videos uploaded to YouTube here and here described as showing the Spirit kite show a very similar long-limbed human-shaped kite.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]