["A video purporting to show a doctor comparing blood samples taken from a person infected with the new strain of coronavirus to that of a healthy person has been viewed hundreds of thousands of times online.  This claim is false; the video creator told AFP that he is not a doctor but a college student who made the video for a project on how videos go viral on the internet.", "The video was published here on the video-blogging website World Star Hip Hop on January 29, 2020, and has been viewed more than 291,000 times since.", "The video shows a man dressed in a white lab coat testing droplets of “normal blood” and “patient zero” blood. The former stained a napkin red, while the latter left a deep purple stain, of a different viscosity.", "Below is a screenshot of the misleading post:", "The video is titled: “Scary: Doctor Shows The Difference Between Healthy And Contagious Coronavirus Blood!”", "A new strain of coronavirus, believed to have emerged from a wildlife market in the city of Wuhan has killed 425 in China and infected more than 20,000 others as of February 4, 2020, according to this AFP report.", "The World Health Organization has declared the novel coronavirus outbreak a global emergency. The virus has spread more than 20 other countries, with two fatalities reported in the Philippines and Hong Kong.", "Information on the novel coronavirus and its current outbreak can be found here on the World Health Organization's website.", "The same video has also been shared here, here, here and here on Facebook; here on Twitter; here on YouTube; and here on the video-sharing platform Flyheight, alongside a similar claim.", "This claim is false; the man in the video told AFP that he is not a doctor but a student who made the video for a college project on how videos can go viral on the internet.", "Mitch Wright, who posted the original video on his TikTok account @wright.mitchr, told AFP the video is ”fake”.", "“Yes it's fake, I have a college course in digital literacy and social media. Our project was [to] pick a platform and post/describe how people get viral,” Wright said via Twitter direct message on January 31, 2020.", "“I had a bloody nose and jumped on making a video. The first one was taken down due to my blood on my face. TikTok took the first [video] down, I voluntarily took down the next two because it spread faster than I thought and my project had proven successful. I also was asked by multiple dms to do so.", "“I never intended to blow up like that. I did [tag] satire and made sure I was fake enough but I guess it wasn't. Once my video was down that Twitter user had saved a copy and re-uploaded. That one is currently at 8 [million views]. I don't know if you noticed but in that video I didn't say the word coronavirus at all.”", "Wright also responded to his video which appeared on Twitter, where he also declared that the video was “100% fake.”", "I did it for a school project on how easy it is to go viral if you know what people will feed off of. It is 100% fake and I thought people would know that it was apparent. Thanks for a little positive in all the negative.", "The video was also identified as being false in these media reports by news agency the Associated Press and Vice.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]