["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "California Sen. Kamala Harris speaks at the California Democratic Party Convention in San Francisco on June 1, 2019 / Photo by Capital Public Radio", "California Sen. and Democratic presidential candidate Kamala Harris has repeatedly attacked President Trump over the cost of his tariffs.", "Recently, she said they amount to a huge monthly tax on working Americans.", "\"Let’s call it what it is. It’s a trade tax,\" Harris claimed at the California Democratic Party Convention in San Francisco earlier this month. \"I like to call it Trump’s trade tax. And his trade tax is taking $1.4 billion out of working people’s pockets every month.\"", "We reported on this claim earlier. But we did not initially attach a rating to it.", "Harris isn’t the only one to describe Trump’s tariffs as a tax. Economists and tax reform advocates have done the same. By definition, a tariff is a tax or duty to be paid on a class of imports or exports.", "PolitiFact National examined who pays for the tariffs on Chinese goods, for example, and concluded: \"In many if not most cases, those costs are passed on to American consumers, whether it’s directly on the products hit by the tariffs or through an impact on U.S. companies who use raw materials hit with tariffs.\"", "For this fact check, we wanted to know whether Trump’s actions are costing as much as Harris claims. So, we focused on the second portion of her statement, that the tariffs are \"taking $1.4 billion out of working people’s pockets every month.\"", "Our research", "The senator’s claim is supported by a March 2019 study titled \"The Impact of the 2018 Trade War on U.S. Prices and Welfare.\" It was conducted by the Centre for Economic Policy Research, a London-based think tank.", "It concluded: \"Overall, using standard economic methods, we find that the full incidence of the tariff falls on domestic consumers, with a reduction in U.S. real income of $1.4 billion per month by the end of 2018.\"", "It doesn’t say, however, that the impact was limited to \"working people.\"", "Stephen Redding, one of the report’s authors and an economics professor at Princeton University, told us by email that Harris’ claim \"is a correct characterization of our research.\" He clarified that \"the impact is for the US economy as a whole, which includes all consumers.\"", "The CEPR study includes research from the Federal Reserve Bank of New York, Princeton and Columbia universities. It reviewed all Trump administration tariffs imposed in 2018 on several countries, including China, on imports from solar panels to washing machines to steel and aluminum.", "The $1.4 billion figure does not include any impact from Trump’s recent threat to place tariffs on Mexico.", "Harris’ position on trade", "Harris told McClatchy this month she opposes the free trade deal Trump signed with Mexico and Canada last year, which updates the 1994 North American Free Trade Agreement, or NAFTA.", "\"I’m not in favor of the USMCA, what I call NAFTA 2.0,\" she told the news organization, referring to the United States-Mexico-Canada Agreement.", "She has previously said she would not have voted for the original NAFTA deal, saying in an interview on CNN in April, \"I believe that we can do a better job to protect American workers.\"", "Harris also came out against the Trans-Pacific Partnership or TPP, an Obama-backed trade deal between 12 Asian and Pacific nations, during her 2016 Senate race, McClatchy reported. Trump ultimately pulled the country out of TPP after he was elected.", "‘A very credible piece of work’", "Several economists not affiliated with the CEPR study on the cost of Trump's tariffs told us it is reliable.", "\"It is a very credible piece of work. For the moment, it is the defining economic evaluation of Trump’s trade policies,\" Gary Hufbauer, senior fellow, Peterson Institute for International Economics, said in an email.", "He added that Harris’ statement may understate the effect of Trump’s tariffs on households, noting a $3 billion per month cost cited in the report.", "Redding, the report’s co-author, described the $3 billion as an additional tax cost, \"which is a transfer from importers and consumers to the US government.\" He maintained, however, that the $1.4 billion is the most correct figure to use when referencing the impact on consumers, describing that as the \"welfare cost (reduction in real income) to the US economy as a whole.\"", "A spokesman for Harris’ campaign cited a CNBC.com article that summarized the CEPR study.", "Our rating", "California Sen. Kamala Harris recently claimed President Trump’s tariffs are \"taking $1.4 billion out of working people’s pockets every month.\"", "A March 2019 study by the Centre for Economic Policy Research generally supports her claim. It notes, however, that was the impact for 2018 and that all consumers felt the effect of the tariffs not just working people.  There’s no way yet to know the full impact of the president’s tariffs this year.", "We rate Harris’ claim Mostly True.", "MOSTLY TRUE – The statement is accurate but needs clarification or additional information.", "Click here for more on the six PolitiFact ratings and how we select facts to check.", "Kamala Harris, speech, California Democratic Party Convention, June 1, 2019", "Ian Sams, Harris campaign spokesman, email exchange, June 6, 2019", "Stephen Redding, professor of economics, Princeton University, June 6, 2019", "Kevin Gallagher, professor of global development policy, Boston University, June 5, 2019", "Gary Hufbauer, senior fellow, Peterson Institute for International Economics, June 5, 2019", "Robert Scott, senior economist, Economic Policy Institute, June 5, 2019", "Centre for Economic Policy Research, THE IMPACT OF THE 2018 TRADE WAR ON U.S. PRICES AND WELFARE, March 2019", "CNBC.com, Trump tariffs costing US consumers $1.4 billion per month, study shows, March 26, 2019", "PolitiFact, Who pays for US tariffs on Chinese goods? You do, May 14, 2019", "PolitiFact, Fact-checking 2020 candidates at the California Democratic Convention, June 10, 2019", "McClatchy, Kamala Harris speaks out against NAFTA 2.0, new tariffs on Mexico as trade tensions rise, June 6, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]