["About this rating", "Among the controversies swirling around Michael Wolff's bestselling exposé Fire and Fury: Inside the Trump White House are doubts about its credibility raised by Wolff's fellow journalists.", "Described by Politico as \"a gossipy account of infighting and incompetence in the West Wing,\" Fire and Fury has been criticized for being \"factually sloppy\" (as Daniel Drezner put it in the Washington Post). As a reporter, Wolff doesn't shy away from repeating unverified anecdotes, even claims that in some cases have been investigated and rejected as unworthy by other journalists.", "An example of this noted by some reporters on social media revolves around an incident that allegedly occurred during a period of strained relations between President Trump and Senate Majority Leader Mitch McConnell after Congress's failed attempts to repeal and replace Obamacare during the summer of 2017. On page 302 of Fire and Fury, Wolff reports the following (based, judging from the context, on information given him by former Trump adviser Steve Bannon):", "After all, McConnell and the president were barely on speaking terms. From his August “working holiday” in Bedminster, the president’s staff had tried to organize a makeup meeting with McConnell, but McConnell’s staff had sent back word that it wouldn’t be possible because the Senate leader would be getting a haircut.", "That Trump and McConnell were on the outs in August 2017 is easily confirmed by looking back at press coverage of the time, not to mention President Trump's own tweets disparaging McConnell's leadership:", "Can you believe that Mitch McConnell, who has screamed Repeal & Replace for 7 years, couldn't get it done. Must Repeal & Replace ObamaCare!", "— Donald J. Trump (@realDonaldTrump) August 10, 2017", "For his part, McConnell loosed barbs aimed at Trump's inexperience in government. \"Our new president, of course, has not been in this line of work before,\" he said on 7 August. \"I think he had excessive expectations about how quickly things happen in the democratic process.\"", "But, unlike Wolff, even though they had heard about the majority leader's haircut rebuke, journalists covering the so-called Trump/McConnell \"feud\" shied away from reporting it because it couldn't be authenticated — as noted in this post-Fire and Fury tweet by Washington Post reporter Ashley Parker:", "This is a juicy, fun detail that a lot of reporters were chasing — but no one wrote it bc every source w first-hand knowledge said it simply wasn't true. https://t.co/kiERLobWDA", "— Ashley Parker (@AshleyRParker) January 6, 2018", "Axios political reporter Jonathan Swan was among those who couldn't find a source to corroborate the story:", "I was told this exact story by — I suspect — the same source as Wolff used. I ran it out down with other sources and couldn’t confirm it. So I never published it. https://t.co/RfLakGDf5R", "— Jonathan Swan (@jonathanvswan) January 6, 2018", "Reading between the lines, the source Swan referred to was presumably Steve Bannon, whose interest (at the time) was defending President Trump. That not a single other source would confirm it is a strong indication that the haircut rebuke story is apocryphal.", "Even stronger is this outright denial tweeted by McConnell's deputy chief of staff, Don Stewart:", "I can confirm: this never happened. Neither the author nor vox bothered to check. https://t.co/5eFibCN7zS", "— STEW ??? (@StewSays) January 6, 2018", "In a follow-up statement to Vox's Jen Kirby, Stewart said the entire incident was misreported by Wolff:", "Don Stewart, McConnell’s deputy chief of staff said the meeting was not a \"one-on-one 'makeup' meeting,\" but instead a request for all four congressional leaders to meet.\"", "\"No one 'blew him off' and in fact the meeting occurred as soon as members returned to Washington after Labor Day,\" Stewart wrote in an e-mail.", "He added that no staff member \"ever turned down the meeting citing a haircut. That never happened. The author didn’t bother to check either of those points and ended up getting both wrong in his book (as he did with so many others).\"", "Calderone, Michael.   \"Journalists Scrutinize Michael Wolff's Credibility.\"\r\n   Politico.   4 January 2018.", "Drezner, Daniel.   \"The Mainstream Media Has Not Covered Trump Like Michael Wolff. Thank God for That.\"\r\n   The Washington Post.   8 January 2018.", "Kirby, Jen.   \"Steve Bannon Says McConnell Blew Off Trump. McConnell's Office Scoffs.\"\r\n    Vox.   6 January 2018.", "Manchester, Julia.  \"McConnell Aide Refutes Wolff Book Claim that GOP Leader Blew Off Trump for a Haircut.\"\r\n  The Hill.  6 January 2018.", "Murphy, Mike.   \"Trump, McConnell Not on Speaking Terms: Report.\"\r\n     Market Watch.   22 August 2017.", "Nobles, Ryan.   \"McConnell Criticizes Trump's 'Excessive Expectations.'\"\r\n   CNN.   8 August 2017.", "Schallhorn, Kaitlyn.   \"Inside the Trump and McConnell Feud, From Health Care to the Budget.\"\r\n    Fox News.   16 October 2017.", "Stark, Liz.   \"A Timeline of the Trump-McConnell Relationship in Trump's Tweets.\"\r\n   CNN.   10 August 2017.", "Wagner, John.   \"Trump Takes Issue With McConnell's Accusation That He Had 'Excessive Expectations' for Congress.\"\r\n    The Washington Post.   9 August 2017.", "Wolff, Michael.   Fire and Fury: Inside the Trump White House.\r\n      New York: Henry Holt and Co.  2018.   ISBN 1250158060, pp. 301-2.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]