["The video was published in this Facebook post on February 18, 2020.", "It has been viewed more than 56,000 times and shared some 1,800 times.", "The 28-second clip shows an irate doctor sitting at a desk, being questioned by someone in a clinic.", "Below is a screenshot of the misleading post:", "The post’s caption states: “Singapore Polyclinic Doctors very stressed, Patients keep on coming in to see doctor. Non Stop”.", "In the clip, as part of the conversation goes, the doctor can be heard shouting: “...after I settle this patient”.", "A man behind the camera can be heard saying: “Ya, you made a mistake, then you want to settle. How long do you want me to wait?”", "The doctor replies: “You can wait or not, if you cannot wait, get out”, to which the man says: “No, I cannot wait.”", "A female voice behind the camera can then be heard saying: “Oh, so you are a government doctor, is it? Show me your face, show me your face. Are you a government doctor?” to which the doctor replies: “Yes”. The woman ends with: “Today, you’ll be very viral.”", "The same video was also published here, here, here and here on Facebook with a similar claim.", "The claim is false. The video has circulated in media reports about an incident at a clinic in Malaysia.", "A combined reverse image and keyword search on Google of a keyframe extracted from the video found this article published on February 18, 2020 by Malaysia-based newspaper the New Straits Times (NST).", "The article’s headline reads: “Doctor loses cool at Rasah clinic, video goes viral”.", "The first two paragraphs of the report states: “A video clip has gone viral in which a government doctor attached with a health clinic in Rasah, Negri Sembilan lost his cool and shouted at a patient.", "“In the 28-second video clip, the doctor, who appeared to be visibly upset and irritable as he shouted at a patient and her companion, believed to be her father, to either wait or leave the consultation room.”", "Below is a screenshot of the NST article:", "A report about the same video was also published here by the Malaysia-based news portal, Malaysiakini, on the same date.", "The article’s headline reads: “'Shouting doc' case resolved through negotiations – health dept”.", "It reads, in part: “The Negeri Sembilan Health Department (JKNNS) said the case of a doctor purportedly losing his temper with a patient has been resolved through negotiations (rundingcara) between both sides.", "“A recording of the incident, which took place at a government clinic in Seremban, had gone viral on social media.”", "Below is a screenshot of the Malaysiakini article:", "Below is a screenshot comparison of the video in the misleading posts (L), an image from the NST article (centre), and an image from the Malaysiakini article (R):", "The reports say the video was recorded at a health clinic in Seremban, a town located in Negeri Sembilan, Malaysia.", "The Negeri Sembilan Health Department (JKNNS) posted a statement on February 18, 2020 on their official Facebook page on the incident.", "The Malay-language post translates to English, in part, as: “The Negeri Sembilan Health Department (JKNNS) would like to refer to the complaint that went viral on Facebook and Whatsapp on February 17, 2020 by Miss Loshsine Uthi Kumaran Loshyy regarding the unsatisfactory service of a doctor at Seremban Health Clinic.", "“JKNNS takes this issue very seriously and early investigations regarding the incident have been conducted immediately. The complainant has also been contacted in order to obtain more information. As of now, the issue has been resolved through negotiations between both parties.”", "Former Malaysian Health Minister Dr. Dzulkefly Ahmad tweeted about the incident here.", "His tweet, translated from Malay to English, reads: “My response about the video of the doctor-patient: “While I would like to remind all MOH staff to be professional in doing their duty, I would also like to remind the patient/dependents to be courteous when receiving treatment and to not make recordings when receiving treatment” ”.", "Response saya perihal video doktor-pesakit :\n\n\t\t\"Sementara saya ingatkan semua k/tangan KKM bertindak profesional dlm menjalankan tugas, saya jg ingatkan pesakit/waris spya berhemah dlm mendapatkan rawatan dan tidak membuat rakaman semasa menerima rawatan\".https://t.co/4tuZv5mgew", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]