["About this rating", "On Nov. 13, 2016, the Center on Human Rights Education posted a message on their Facebook page announcing the passing of one of their colleagues, Monica Petersen:", "MONICA PETERSEN", "I am heartbroken to report that Monica Petersen died today in Haiti. She was a recent graduate of the Korbel School, a Research Fellow and an Assistant Director at the Human Trafficking Center, and had moved to Haiti to teach and start an NGO. Monica was a scholar-activist committed to serving the dispossessed and a clear and critical voice in the human trafficking field. She was also a dear friend and colleague to many of us.", "I will post the time and date of a memorial service soon.", "--Prof. Claude d'Estrée", "The location of Petersen's death (Haiti) and the scope of her work (human trafficking) seemingly added fuel to the prominent conspiracy theory that the Clintons have been quietly killing off their political foes for the last three decades. That conspiracy was then tied into criticisms of the Clinton Foundations' work in Haiti (which, whatever its flaws, has never been credibly linked to a child sex trafficking ring).", "Still, Petersen's death was presented as the \"smoking gun\" that connected everything together. A thread on the r/the_donald section of Reddit collected the \"evidence\" in an attempt to prove that Clinton was responsible for Peterson's death, including a link to a blog post critical of the Clinton Foundation which Petersen reportedly shared on Facebook (a screenshot of the message shows that it wasn't actually posted by her, but rather it was attributed to her), an alleged message from one of Petersen's friends claiming that she died of suicide, and a Facebook message Petersen allegedly wrote (again, a screenshot of the message shows that it wasn't actually shared by Petersen, but was attributed to her) stating that \"Hillary Clinton is just as bad as Donald Trump.\"", "Although the purported Facebook friend stated that Petersen died of a suicide, an official cause of death has not been announced as of this writing.", "Monica Petersen may have been critical of the Clinton Foundation's work in Haiti (although the evidence presented comes from secondary sources and not from Petersen herself), but there's no evidence linking the Clintons to her death.", "On Nov. 18, several people took to Facebook to ask the Human Trafficking Center if Petersen had been killed by the Clintons. The organization has deleted most of those messages, but they did respond to at least one by saying that such messages should be ignored because giving their posters attention \"will only feed the flames of their craziness\":", "On Dec. 6, Washington Post fact-checker Glenn Kessler reported that Claude d’Estree, the executive director of the Human Trafficking Center, had confirmed that Petersen committed suicide in Haiti. \"D’Estree said Petersen had gone to Haiti a number of times, but she was not there to research human trafficking and was not investigating the Clinton Foundation,\" Kessler wrote.", "In sum, although no details of the circumstances of Petersen's death (apart from its being self-inflicted) have been made public, there is zero evidence linking the Clintons or Clinton Foundation to sex trafficking, or to Peterson's suicide. We therefore rate this rumor \"False.\"", "Kessler, Glenn.   \"'Pizzagate' Rumors Falsely Link Death of Sex-Worker Activist to Nonexistent Clinton Probe.\"\r\n   The Washington Post.   6 December 2016.", "Update [29 October 2019]: Added information reported by The Washington Post in December 2016 and changed status from \"Unproven\" to \"False.\"", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]