["The five-second video was published here on Twitter on February 11, 2020. It has since been viewed more than 72,000 times and garnered more than 400 retweets.", "The post’s caption reads: “Road blocks fail and many make it past and the spread north, south and east continue.” The tweet also includes the following hashtags: #coronavirus, #CoronavirusOutbreak, #Wuhan, #coronaviruschina, #coronavirusaustralia and #CoronaVirusCanada.", "Below is a screenshot of the misleading tweet:", "In an effort to curb the spread of the novel coronavirus, authorities in January 2020 placed Wuhan under an unprecedented lockdown, blocking off roads and halting nearly all transportation, AFP reported. At least 2,000 people have died and 74,000 others have been infected by the virus in China, with hundreds more cases in some 25 countries, as reported here by AFP on February 19, 2020.", "The video was also published alongside a similar claim here on Twitter; here on Facebook; here on YouTube; and here, here and here on Weibo.", "The claim is false. A keyword search on Weibo found the video was included in this February 2017 post by the Huoxiang (Shanghai) Film and Television Culture Development Company, which produced 2018 film The Blizzard.", "The post includes a recording of a TV news report on a Heilongjiang Television Station programme that shows the same crash footage, which at the time was being falsely shared online as authentic.", "“What’s going on? Why is the filming of a car crash scene being reported on News Night Navigation?,” the post’s simplified Chinese caption asks sarcastically of the TV report, which debunked the false claim circulating in 2017.", "Below are two screenshot comparisons of the misleading video (L) and the video posted by Huoxiang (R):", "Another search on the website of iQIYI, a video platform that co-produced The Blizzard, found this video of the same car crash film scene on September 19, 2018. The clip’s headline translates to English as: “Movie ‘The Blizzard’  Special Episode on Car Racing”.", "Below is a screenshot of the iQIYI video, which corresponds with the footage being shared in a misleading context.", "The Blizzard, which was released on September 6, 2018, can be seen in its entirety on YouTube here. The car crash scene shown in the misleading posts begins at the 50-minute 30-second mark.", "The filming location can be seen here on Baidu Maps in Harbin, the capital city of Heilongjiang.", "Below is a screenshot of the location on Baidu Maps:", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]