["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Back in January, Rep. Tom Cotton, R-Ark., took some heat for voting against the final version of the farm bill -- particularly being the only lawmaker from Arkansas, a state that depends on farming, to do so.", "Now, the Republican Senate candidate is out with an ad to defend his vote, arguing that it was the fiscally responsible course. The 30-second spot features Cotton and his father on their family farm. Cotton says his dad taught him financial lessons that he carried into his current role.", "\"(My dad) taught me early: farmers can’t spend more than they take in, and I listened,\" Cotton said in the ad. \"When President Obama hijacked the farm bill, turned it into a food stamp bill, with billions more in spending, I voted no.\"", "Cotton, who is running against incumbent Democratic Sen. Mark Pryor, goes on to say that the farm bill was a case of politicians taking a bad idea (food stamps) and attaching it to a good one (the farm bill).", "Is this true? Is Obama really to blame? We took a closer look.", "A brief history", "Food assistance legislation has been tied to agriculture for decades.", "Congress passed the first farm bill in 1933, during the Great Depression and Dust Bowl, to aid farmers struggling with low commodity prices and dry soil in the Midwest. To fight poverty in the general population, the bill also established a nutritional assistance program. The program took surplus crops, meat and dairy products and distributed them to people in need.", "The program became known as \"food stamps\" in 1939, overseen by the Agriculture Department, according to SNAP to Health, an organization that aims to improve health among food purchasing assistance recipients.", "This program ended in 1943 but was reinstated nationally in 1964 as the Food Stamp Act, part of President Lyndon Johnson’s Great Society program to address poverty. In this iteration, food stamp policy was not addressed in farm bills, but the Agriculture Secretary administered the program.", "The farm bill and food stamps merged once again in 1973. Representatives from urban areas and those from rural areas figured this pairing would aid the bill in securing broad support in Congress, according to an article by New York University law professor John Ferejohn.", "Since then, a program -- currently called SNAP, the Supplemental Nutrition Assistance Program -- has been part of every farm bill that has become law, according to a December 2013 Congressional Research Service report. Today, a farm bill is passed about every five years, reauthorizing food and agriculture policy, including measures such as crop and commodity subsidies, conservation programs, agriculture research and food stamps.", "In 2013, the House -- led by Republicans, Cotton included -- became the first chamber to pass a farm bill that didn’t include food stamps. But that bill wasn’t able to pass the Senate, and the final farm bill that became law in February 2014 did include food stamps.", "So how does this history illuminate the accuracy of Cotton’s claim?", "Obama did support passing a farm bill that included food stamps in 2013, with the White House releasing an extensive report in November 2013, titled, \"The Economic Importance of Passing a Comprehensive Food, Farm and Jobs Bill.\"", "But the idea of merging the two topics together in one bill hardly came from Obama. It had been that way, uninterrupted, since 1973 -- when Obama wasn’t even a teenager yet.", "And while the number of food stamp recipients grew dramatically in the wake of the last recession, which bottomed out around the time Obama took office, food stamps have accounted for a majority of farm bill spending for more than a decade.", "The bill passed in 2014 has a nearly $1 trillion price tag over 10 years, and 80 percent of that goes toward nutrition assistance. In the 2008 version of the bill, 67 percent of spending was devoted to nutrition assistance. In the 2002 bill, about 55 percent of spending went to nutritional assistance.", "Our ruling", "Cotton said that Obama \"hijacked the farm bill (and) turned it into a food stamp bill.\" That’s not correct -- food stamps have been part of every farm bill enacted since 1973. One could say that Cotton and his allies in the House, by seeking a farm bill stripped of food stamp provisions, were actually the ones taking a more radical step, one that Congress ultimately voted against. We rate this claim Pants on Fire.", "Tom Cotton, \"Listened,\" Sept. 18, 2014", "Tom Cotton, \"Listened\" ad back up, Sept. 18, 2014", "Congressional Research Service, Expiration and Extension of the 2008 Farm Bill, Dec. 16, 2013", "Congressional Research Service, The 2002 Farm Bill, Aug. 1, 2002", "Congressional Research Service, What is the Farm Bill?, May 6, 2010", "\"Congress and Policy Change,\" \"Logrolling in an institutional context: A case study of food stamp legislation,\" 1986", "Congressional Budget Office, SNAP infographic, April 18, 2012", "SNAP to Health, \"The History of SNAP,\" accessed Sept. 19, 2014", "Farm Aid, Farm Bill study guide, accessed Sept. 19, 2014", "U.S. Department of Agriculture, National School Lunch Program, accessed Sept. 19, 2014", "GovTrack, H.R. 2642: Federal Agriculture Reform and Risk Management Act of 2013, Jan 29, 2014", "White House report, \"The Economic Importance of Passing a Comprehensive Food, Farm and Jobs Bill,\" November 2013", "New York Times, \"Senate Passes Long-Stalled Farm Bill, With Clear Winners and Losers,\" Feb. 4, 2014", "New York Times, House Republicans Push Through Farm Bill, Without Food Stamps, July 11, 2013", "National Public Radio, The Farm Bill: From Charitable Start To Prime Budget Target, Sept. 26, 2011", "PunditFact, \"Donna Brazile says the farm bill would reduce the deficit,\" Jan. 2, 2014", "Email interview, Pryor spokesman Erik Dorey, Sept. 18, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]