["About this rating", "On 1 June 2016, the web site NetLiveMedia published an article that a \"mysterious 4-metre long sea monster\" washed ashore in Mexico:", "The odd-looking beast was found by sun-worshippers on Bonfil Beach, in the city of Acapulco", "This is the horrifying sea-creature washed up on a beach which has been baffling oceanic experts.The odd-looking beast, a huge four metres long, was found by sun worshippers on Bonfil Beach, in the city of Acapulco, in the south-west Mexican state of Guerrero.", "The photograph bore a strong resemblance to the \"Montauk Monster\" of 2008, down to the distinctive facial feature and creases in the creature's flesh:", "As it turned out, the primary image in this digital manipulation was used in several older marine anomaly hoaxes:", "The photo was a fabrication that melded a picture depicting a dead whale found in Chile back in 2011 with a picture of a giant squid that washed up on a Spanish beach in 2013:", "This photograph has been repurposed several times for \"sea creature\" hoaxes:", "A second image originated with a March 2016 beaching in Mexico involving what was initially an unidentified animal carcass, but the remains were later thought to be the decomposed head of a sperm whale. As is often the case, tabloids widely covered the initial discovery and failed to follow up when the \"mysterious\" find was explained just days later.", "The \"mysterious 4-metre long sea creature\" from Mexico was a fabrication, created by splicing a photograph of the 2008 \"Montauk Monster\" into a 2011 image of a beached whale.", "Dolasia, Meera.   \"Expert Says Beached 'Sea Monster' In Mexico Is Just The Head Of A Sperm Whale.\"\r\n    DOGO News.   14 March 2016.", "Daily Mail.   \"Creature From The Deep Blue Sea!\"\r\n    10 March 2016.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]