["About this rating", "When he was brought into the wildlife hospital, the bird was bright orange and resembled a mythical phoenix. And while it may have looked as if it could be the first sighting of a previously undiscovered or exotic bird, it was just a common herring gull that had somehow managed to coat himself in a bright orange spice, either curry or turmeric.", "The bird's plight gained attention online in February 2021, although, as the meme below correctly notes, its adventures in culinary spice originally unfolded in 2019.", "We weren't able to locate social media posts that demonstrate people truly believed the bird to be an exotic new species, but news reports from the time seem to indicate that the gull's coloring raised questions about what exactly it was.", "In July 2019, passersby spotted the bird stranded in all his bright orange glory on the side of A41, a trunk road connecting London and the town of Birkenhead.", "They rushed the bird to Tiggywinkles Wildlife Hospital in Buckinghamshire, England, where the staff there nicknamed him Vinny, short for vindaloo, the Indian dish seasoned with curry. They also scrubbed him clean, revealing his natural white and gray feathers.", "\"When they called to say they had picked up an orange bird, we had no idea what to expect – and would never have guessed at this!\" the veterinary hospital wrote in a July 1, 2019, Facebook post.", "The gull had \"somehow gotten himself covered in curry or turmeric! It was all over his feathers, preventing him from flying properly. We have no idea how he got into this predicament but thankfully, apart from the vibrant colour and pungent smell, he was healthy.\"", "The staff checked Vinny out, bathed him, and, after returning him to his natural white and gray colors, released him back into the wild.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]