["About this rating", "There are a number of (questionable) reasons to get a tattoo of a restaurant logo, but in most cases the promise of free food for life isn't one of them.", "A meme featuring the logos of a various popular restaurant chains — including Taco Bell, Wendy's, Chick-Fil-A, McDonald's, Dunkin' Donuts, Subway, Chipotle, Starbucks, KFC, and Burger King — and a promise of free food to individuals who get tattoos of their logos has around since at least October 2017:", "This meme did not originate with any of the restaurant chains mentioned. It is a hoax created by @StupidResumes (you can glimpse the watermark in the upper left hand corner), an Instagram account that traffics in doctored images, Internet jokes, and memes.", "This claim was made up out of whole cloth and did not originate with any sort of tattoo promotion by any of the aforementioned restaurants. In fact, at least two of these restaurants, Wendy's and Chipotle, have explicitly informed their customers that getting a tattoo of their logos would not result in a free supply of burritos or chicken nuggets:", "Although these particular chains are not offering free food in exchange for unsolicited tattoos, some restaurants have held such promotions in the past. The California restaurant Casa Sanchez, Australia's Cafe 51, and the Pi Pizza Food Truck in Houston, Texas have all held some sort of \"free food for life in exchange for a logo tattoo\" promotion.", "In most cases, however, these promotions came with a number of restrictions, such as limits on the amount of people who could cash in with their ink or the amount of \"free food for life\" that one person could receive.", "In other words, if you want to get free food for life by getting a restaurant logo tattooed on your person, make sure you read the fine print to rules of the promotion on an official web site affiliated with the restaurant, and don't get a tattoo based on a random meme expecting to get anything for free in return.", "In other words, there's still no such thing as a free lunch.", "McCluskey, Megan.   \"This Restaurant Will Give You Free Burgers for Life for Getting a Burger Tattoo.\"\r\n    Time.   29 September 2016.", "Dixler, Hillary.   \"25 People Got Tattoos in Exchange for Free Pizza for Life.\"\r\n    Eater.   26 November 2013.", "Woo, Stu.   \"Free Tacos for Life, in Exchange for a Tattoo.\"\r\n    Wall Street Journal.   1 April 2010.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]