["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The chyron is fake and did not run on the air, CNN said and PolitiFact confirmed. It was created by the Babylon Bee, a satire website.", "A fake CNN chyron purports to show the network saying the man suspected of killing 10 people in a mass shooting at a Colorado supermarket was \"factually Arabic, but morally white.\"", "\"This is actually laughable!! Wonder if they are morally white?\" said one March 24 Facebook post sharing the image, which purports to show an interview between CNN anchor Brooke Baldwin and correspondent Lucy Kafanov.", "\"You have got to be kidding me?? If you read this headline and do not see a problem then you are the bigger problem,\" said another post, which has since been deleted.", "A screenshot of one Facebook post sharing the altered CNN chyron as though it were real.", "The posts were flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Despite what the Facebook post suggests, the CNN chyron is not real. It was created as satire by the Babylon Bee, a satirical site, which published a March 23 article.", "\"This is a fake chyron and did not appear on our air,\" CNN spokesperson Shimrit Sheetrit said.", "PolitiFact confirmed the chyron did not appear through a review of CNN programming on TVEyes, a media monitoring service.", "Baldwin interviewed Kafanov, who was reporting from Boulder, Colo., on March 23.", "Neither Baldwin nor Kafanov claimed that the suspect, Ahmad Al Aliwi Alissa, was \"factually Arabic, but morally white.\" No such claim appeared in CNN’s chyrons, either.", "At 1:01 p.m. MT, the timestamp in the Babylon Bee’s altered image, the network’s chyron actually read, \"Colorado shooting suspect booked into jail today.\"", "A screenshot of \"CNN Newsroom with Brooke Baldwin\" as it aired on March 23.", "Alissa, 21, was born in Syria in 1999, PolitiFact reported. His brother told CNN that their family emigrated from Syria in 2002, Kafanov reported. Before it was taken down, Ahmad Al Aliwi Alissa’s Facebook page also said he arrived in the U.S. that year.", "We rate this Facebook post Pants on Fire!", "Facebook post, March 24, 2021", "TV Eyes, accessed March 25, 2021", "The Babylon Bee, \"Media Now Claims Shooter Was Factually Arab, But Morally White\" (archived), March 23, 2021", "PolitiFact, \"\"New information coming in that Boulder shooter was a Syrian refugee who arrived via Obama-era asylum programs,\" March 24, 2021", "Email interview with Shimrit Sheetrit, director of publicity at CNN and Turner Broadcasting and spokesperson for \"CNN Newsroom with Brooke Baldwin,\" March 25, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]