["The photos were published here on Facebook on May 27, 2020.", "The post reads, in part: “This is heartbreaking to see, Fire broke out in jungle of Uttrakhand. Huge area burnt down to ashes. More than India's Half of Bird's species are in danger. Amazon and Australia incident saddened us, but when our own Uttrakhand is burning since last 4 days, we are silent… How many of us are aware that our Uttrakhand is burning again for last few days.”", "The photos were also shared here, here, here and here on Facebook; and here, here, here and here on Twitter alongside similar claims.", "The claims are false; the images have circulated online since 2016 in reports about other fires.", "First photo", "A reverse Google image search of the first photo in the misleading post led to this January 25, 2020 article about forest fires in India published by the Indian news website The Wire.", "The same photo is published in report and is captioned: “Forest fire being extinguished by bush beating, Dudhwa National Park, Uttar Pradesh. Photo: UP forest department”", "Below is a screenshot comparison of the photo in the misleading post (L) and the photo in The Wire’s report (R):", "Second and third photos", "The second and third photos in the misleading post are identical. Below is a screenshot comparison of the two, labelled (2) and (3) by AFP:", "A reverse image search of the photo found it was previously published in this article by the Indian news website Scroll.in about a forest fire in Uttarakhand on May 2, 2016.", "The report credits the photo to Anup Sah, who also published the photo on Facebook here in April 2016.", "Below is are screenshot comparisons between the second (L) and third (C) photos in the misleading post and the photo on Sah’s Facebook page (R):", "Fourth photo", "A reverse image search of the fourth photo found it was published here on the Indian news website The Logical Indian on April 30, 2016.", "The report reads, in part: “A massive wildfire has been burning in the forest of Garhwal region of Uttarakhand which has gutted around 1,600 hectares of forest land… Fortunately no casualties have been reported till now.”", "Below is a screenshot comparison of the photo in the misleading posts (L) and The Logical Indian photo (R):", "Fifth photo", "A separate reverse image search found the fifth photo published here by Getty Images on September 18, 2017.", "The photo description reads, in part: “Wildfire Continues To Burn In San Bernardino National Forest / The Butler 2 Fire burns through the early morning hours on September 18, 2007 near Fawnskin, California...(Photo by David McNew/Getty Images)”", "Below is a screenshot comparison between the fifth photo in the misleading post (L) and the Getty Images photo:", "Uttarakhand officials also denied the claims.", "According to this May 27, 2020 report by Indian newspaper Mumbai Mirror, the chief conservator at Uttarakhand’s forest department, Parag Madhukar Dhakate, said: \"There are no massive forest fires in Uttarakhand. Some videos and pictures doing round on social media are from South India and other parts of the globe. People have created their own collage of pictures on social media...Some pictures are even from 2016.”", "Uttarakhand’s chief minister Trivendra Rawat labelled the misleading social media posts as “misleading propaganda” in this tweet published on May 27, 2020.", "A misleading propaganda, using old pics of forest fires of 2016 & 2019 & that of forest fires in Chilean & Chinese forests, is raging on SM. I req everyone to not believe such motivated campaign. Fire incidents reported until yesterday is way less than PYhttps://t.co/d5R4aq5mjW", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]