["About this rating", "Rumors of imminent, wide-scale, mandatory radio-frequency identification (RFID) chipping in humans have circulated for many years. Some claimed Obamacare involved mandatory microchipping (it didn't), others held that a large number of Americans already sported RFID chips, and still more maintained that vulnerable populations, such as the homeless, were being chipped without consent in massive swaths.", "A long-circulating variation on the latter claim involved individuals who received government assistance such as food stamps (SNAP) or general forms of what's known as \"welfare\" (such as Temporary Assistance for Needy Families, or TANF). Claims that welfare recipients would receive mandatory RFID chips weren't novel in January 2016: the unreliable web site Disclose.tv featured a page with much of the same language in November 2011.", "Not long after that version appeared, a nearly identical version was published by the disreputable and plagiaristic WorldTruth.tv web site. An undated piece (published on 27 December 2011) on that site involved a mishmash of information tangentially related to the claim about forcible microchipping, primarily citing a 1 December 1999 report from the United States Department of Agriculture.", "The sixteen-year-old report focused on preliminary research into the use of \"biometric identification technology\" for such programs, but it very clearly didn't reference RFID chips. The technologies under discussion were biometric identifiers, not microchip implantation:", "Biometric identification technology provides automated methods to identify a person based on physical characteristics — such as fingerprints, hand shape, and characteristics of the eyes and face — as well as behavioral characteristics — including signatures and voice patterns. Although used in law enforcement and defense for several years, it has recently been used in civilian applications and shows some promise to reduce the number of duplicate cases in the Food Stamp Program (FSP) and other assistance programs.", "Biometric identification systems are currently operational at some level in Arizona, California (under county initiative, first by Los Angeles County), Connecticut, Illinois, Massachusetts, New Jersey, New York, and Texas. Finger imaging is the principal form of technology used in all eight States, though alternative technologies have simultaneously undergone trials in Massachusetts (facial recognition) and Illinois (retinal scanning). By the end of 2000, new systems are expected to be in place in California (statewide unified system), Delaware, and North Carolina. Other States are currently in the initial planning stages, including Florida, Maryland, Michigan, Mississippi, Pennsylvania, and South Carolina. However, there is little information available at this point regarding the specific course and trajectory these States will follow in terms of system types, implementation schedules, and the benefit programs in which they will implement the new requirement.", "A portion of WorldTruth.tv's page was lifted directly from a conversational thread on Disclose.tv published a few weeks earlier:", "I dare you to go to the WIC website, or the EBT website or the SNAP/Food stamp website or the Grocery Manufacturers of america,the food and drug admins, etc. etc. Go to there search field browser and type in RFID,or biometric and WATCH what pops up. I also have Government Links to show the validity of this video.", "Go Google this entire sentence ... \"Planned Nationwide Usage of the biometric information sharing capability by fiscal year 2009-2013? As well as these below.", "Go Google \"The human robot operating system\" PDF (Super Smoking Gun Proof)", "Go to FMI Dot Org. Type 2011 RFID in the search field", "Go to www.fns.usda.gov/snap/ebt/ AND TYPE IN 2011 BIOMETRIC OR RFID", "Following directives to enter \"RFID\" into search fields on the listed government sites yielded no results. The United States Department of Agriculture web site, through which federal food stamps provisions are routed, yielded no search hits whatsoever. Some results were returned on FMI.org (the web site of the Food Marketing Institute), but none of them pertained to RFID use by federal agencies on food stamp recipients. All searches led back either to other conspiracy stories, or research unrelated to RFID chips and food stamps or welfare.", "This rumor began circulating in 2011 (or earlier), yet since then no food stamp recipients have reported undergoing RFID chipping, forcible or otherwise. No credible items cited (such as the 1999 USDA report) had anything at all to do with RFID chip use in food stamp recipients.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]