["About this rating", "Some states allow early voters to change their votes before election day.", "No states changed their election laws in order to allow people who voted early for Hillary Clinton to change their votes.", "On 29 October 2016, the TruthFeed web site published an article reporting that several states had announced that early voters who cast their votes for Hillary Clinton could change their votes in light of FBI director Jim Comey's announcement that new e-mails potentially linked to Hillary Clinton's mishandling of classified information had been discovered:", "BREAKING : List of States Allowing you to CHANGE YOUR VOTE in Light of Hillary’s Federal Investigation", "On Friday the FBI announced they were reopening the email investigation into Hillary’s mishandling of classified information.", "In a statement, the FBI said that they discovered “new emails” pertinent to the earlier investigation on “several devices.”", "Reports indicate that one phone device belongs to Anthony Weiner and the other phone device belongs to his estranged wife Huma Abedin.", "Many Hillary supporters are clamoring to change their early votes, so the media has provided a list of states that allow you to change your early vote.", "That article is a mixture of true, misleading, and inaccurate information. While some states do allow early voters to change their votes prior to the election, no state altered its existing election laws in order to specifically allow Hillary Clinton supporters to change their votes in light of newly discovered e-mails.", "The image shown aobve was taken from a Fox News broadcast in which reporter Trace Gallagher explained the various laws that exist in some states allowing early voters to change their votes before election day:", "Gallagher didn't say that any of these states had implemented new election laws, or that former Hillary Clinton supporters were \"clamoring\" to change their votes.", "Furthermore, Gallagher's report doesn't appear to have been entirely accurate. The Louisiana Secretary of State's office, for instance, disputed the claim that early votes could be changed in that state:", "We also found a few discrepancies with Gallagher's report, such as the fact that Michigan does not allow early voting at all.", "It is true that some states, such as Minnesota, allow early voters to change their minds:", "WHAT IF I RETURNED MY BALLOT AND WANT TO CHANGE MY VOTE? You can ask to cancel your ballot until the close of business one week before Election Day. After that time, you cannot cancel your ballot. To cancel your ballot, contact the election office that sent your ballot. Your options are to have a new ballot mailed; vote in person at your local election office; or vote at your polling place on Election Day.", "Extant mechanisms in some states do provide a means for early voters to change their votes.  None of those mechanisms was recently implemented specifically to allow ballots  cast for Hillary Clinton to be changed, however.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]