["As is the trend in other states, Republicans in Oregon tend to argue for tighter security against potential voter fraud, while Democrats defend the system we have now.\n\nThat message is nearly impossible to miss in the race for Oregon secretary of state. According to incumbent Kate Brown and other prominent Democrats, a vote for Republican candidate Knute Buehler is a vote for right-wing Republicans and a vote to kill our vote-by-mail system.\n\nThis week, former Democratic Secretary of State Bill Bradbury, who was in office when Oregon became the first state to conduct a presidential election entirely by mail, chimed in with his thoughts on Buehler in a fundraising pitch:\n\nRepublican Secretary of State candidate Knute Buehler is right on message with the Republican talking points trying to scare voters (out of) vote-by-mail. If Buehler were elected, our vote-by-mail system would be at risk.\"\n\nSal Peralta, secretary of the Independent Party of Oregon, asked PolitiFact Oregon to check it out. Buehler also is the Independent Party’s nominee for this office. (The other candidates in the race, by the way, are Pacific Green Seth Woolley, Libertarian Bruce Alexander Knight and Progressive Robert Wolfe.)\n\nVoters approved the citizen ballot measure switching to mail-in voting by a 2-to-1 ratio in 1998, so we know it was well received. Is it true that Buehler has a beef against the system?\n\nAs evidence of Buehler’s alleged hostility toward vote-by-mail, Democrats have cited language from a column written by Oregonian columnist Steve Duinabout Republican attempts in other states to introduce new ID requirements for voters. Brown is quoted as opposed to the \"war on voting.\"\n\nThe part involving Buehler, we offer in its entirety, because readers need the context.", "Knute Buehler, the Bend Republican opposing Brown in November, said he has no interest in ending vote-by-mail. The system is a popular element of the state's independent streak, he said, and he isn't hearing -- or pushing -- a move to return Oregonians to the polls.", "But Buehler does say, \"There is some concern about the integrity of the process, where it takes more ID to rent a movie at Blockbuster than it does to vote. There are thousands of ballots floating around in various locations during the process. There are concerns about undue pressure to vote, because you don't have the privacy of a polling booth.", "\"And I'm not sure we've done a thorough evaluation to see how we're dealing with these integrity issues.\"", ".\nSee that part where Duin writes that Buehler said he has no interest in ending vote-by-mail? Democrats probably saw that too, but for some reason, chose instead to focus on the language about Blockbuster and ballots floating around and the privacy of a polling booth.\n\nBuehler, in an interview with PolitiFact Oregon, said he still thinks it takes more ID to rent a movie than to register to vote in Oregon. He supports the idea of an audit of the system. And Buehler repeated to us -- as he clearly stated to Duin -- that he does not want to end Oregon’s vote-by-mail system.\n\n\"I love vote-by-mail,\" he said. \"My point is that I just want to make it the best that it can be. Why are people so concerned about studying something?\"\n\nWe also talked to Bradbury.\n\n\"My understanding is that he has stated that the vote-by-mail system has had many problems with fraud,\" Bradbury said. \"If you’re convinced that vote-by-mail is a fraud-filled system, it’s very unlikely that you’re going to support strengthening vote-by-mail.\"\n\nWe told Bradbury that Buehler didn’t say that the system was filled with fraud -- just that there were questions that he wanted to address.\n\nBradbury’s response? \"I don’t feel very comfortable with someone being in charge of vote-by-mail if their biggest concern seems to be that there is a fraud-riddled system, or they’re listening to friends who think it is.\"\n\nWe also offered Brown’s campaign spokeswoman a chance to comment.\n\n\"Knute questions the very nature of vote-by-mail by saying that there is 'undue pressure to vote because you don't have the privacy of a polling booth.' Knute’s statement fundamentally argues against vote-by-mail’s existence,\" said Jillian Schoene in an email.\n\nBriefly, let’s get back to the remark about Blockbuster. Buehler is interested in beefing up identification requirements to register to vote in Oregon, and that position definitely puts him to the right of Brown on the issue. But changing the requirements of registering to vote doesn’t mean the way we vote in Oregon would be at risk by electing Buehler.\n\nDemocrats are hammering Buehler for raising questions. Raising questions about vote-by-mail -- even talking about the possibility that some people may feel pressured outside a polling booth -- is not the same as wanting to end vote-by-mail. Does Brown want to get rid of state agencies just because her Audits Division raises questions about them? We think not. That’s her job.\n\nPolitiFact Oregon doesn’t do predictions. Obviously, we don’t know what Buehler would do if elected. More important, Democrats don’t know either. When we look at the evidence they’ve provided for his alleged antipathy toward the system, we just aren’t convinced.\n\nIn fact, the evidence indicates that he likes vote by mail just fine. We don’t know how many more times -- or in how many more ways -- he can say that he supports mail balloting. The statement is inflammatory and ridiculous. We rule it Pants on Fire.", "Democratic Party of Oregon, campaign website: Knute Buehler Facts: Threatens to bring the war on voting to a ballot box near you, Oct. 22, 2012\nDemocratic Party of Oregon, press release: Knute Buehler Joins Republican War on Voting, Questions Oregon's Vote-By-Mail System,\" Sept. 26, 2012\nKate Brown Facebook page, posted Monday Oct. 22, 2012\nInterview with Knute Buehler, Oct. 22, 2012\nInterview with Bill Bradbury, Oct. 22, 2012\nEmail from Trent Lutz, executive director, Democratic Party of Oregon, Oct. 22, 2012\nEmails from Jillian Schoene, spokeswoman, Brown campaign, Oct. 24, 2012\nEmails from Sal Peralta, secretary, Independent Party of Oregon, Oct. 22, 24, 2012\nEmails from Kevin Curry, communications director, Buehler campaign, Oct. 22, 24, 2012\nThe Oregonian, \"Steve Duin: Oregon's the safe harbor from voter ID mania,\" (columnist), Aug. 29, 2012", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]