["Delhi MLA Kapil Mishra tweeted an image on November 2 in which a man can be seen holding an idol with the foot of a purported cop on his chest. He tweeted this image with the text, “In the eyes of this devotee There is No Fear of brutality There is No fear of oppression This is the Power of Faith #Sabarimala #Ayyappa,” suggesting that the subject of the image was perhaps a victim of brutality. At the time of writing this article, Mishra’s tweet was liked over 2,700 times and retweeted over 1,400 times.", "The same image was earlier circulated by Squint Woke Neon (@squintneon) and Hindu Mahasabha activist Kamlesh Tiwari who tweeted – “See the violent treatment of Kerala police on Lord Ayyappa devotees.” Both these posts drew a combined retweet count of nearly 1,300.", "भगवान अयप्पा के भक्त के साथ केरल पुलिस का ज़ुल्मों-सितम देखिए !!", "Posted by कमलेश तिवारी on Thursday, 1 November 2018", "Several other right-wing handles on both Twitter and Facebook circulated the image with the identical narrative of brutality on a Sabarimala devotee (1, 2, 3).", "Journalist Bobins Abraham pointed out on Twitter that a photo-shoot of a man named Rajesh Kurup was being circulated on social media as the brutality of Kerala police on Ayyappa devotees.", "This is how #FakeNews is created. A staged photo shoot of a man called Rajesh Kurup (രാജേഷ് കുറുപ്പ് ശ്രീകല്യാണി) by a photographer called Midhun Krishna Photography is now being circulated as police brutality on Ayyappa Devotees in Kerala. #SabarimalaProtests pic.twitter.com/Ebnv8onTs7", "— Bobins Abraham (@BobinsAbraham) November 3, 2018", "Abraham had posted another picture of Kurup where the photographer’s stamp – Midhun Krishna photography – is visible.", "Alt News reached out to Rajesh Kurup who confirmed to us that the pictures were part of a photo-shoot and that the one shared by Kapil Mishra was shot about four days ago.", "We also contacted the photographer of the second image, Midhun Krishna. He said that the stamp on the photograph was indeed his and the picture was shot on October 6. Sabarimala was opened to women for the first time on October 17, which hints that the image could not be a depiction of protests which started after the temple permitted women’s entry.", "Since protests against the entry of women in Sabarimala began, social media has been brimming with misinformation. Delhi MLA Kapil Mishra, prior to the aforementioned case, also spread the fake news about a devotee dying in police action. In the past, numerous other false images and claims were viral on social media.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]