["Even as the Electoral College certified Joe Biden's 2020 election victory and Inauguration Day nears, some still claim the U.S. has yet to legitimately elect a president.", "\"Biden did not win legally everyone post and drive Facebook censors crazy!\" reads a Dec. 12 Facebook post, which has been shared nearly 5,000 times. A number of other individuals have shared the claim on Facebook, too. One poster did not respond to USA TODAY's request for comment, and the other said that she's been told there's \"plenty of info out there. I just share.\"", "That sentiment has been echoed by President Donald Trump and his allies, who continue to spread false claims of election fraud despite no evidence.", "\"MOST CORRUPT ELECTION IN U.S. HISTORY!\" Trump tweeted Sunday with no evidence.", "Fact check:Georgia 'suitcase' video is missing context", "While both candidates received a record-breaking number of votes, Biden ultimately beat Trump by over 7 million votes, amassing 81 million votes to Trump's 74 million.", "To win, Biden's campaign built on Hillary Clinton's 2016 gains in Arizona and Georgia — states teetering between red and blue — all while growing its voting base in Michigan, Pennsylvania and Wisconsin, dubbed the \"blue wall.\"", "Fact check:Trump lost the 2020 presidential election", "On Election Day, people cast ballots for their preferred candidate's electors, chosen prior to the election by political parties or independent candidates. Those individuals, collectively the Electoral College, then cast votes for president and vice president, usually representing the choice their state's voters made. The process is laid out in the 12th Amendment of the Constitution.", "Because of his success in the popular vote, Bidenwon 306 electoral votes to Trump's 232 votes in the Electoral College.Candidates have to win at least half of the country's electoral votes (270 votes) to be elected president.", "More:Mitch McConnell congratulates Joe Biden, Kamala Harris for election win", "The final step in the election process is the counting of the Electoral College's votes by Congress at a special joint session on Jan. 6.", "Trump and his allies have attempted to convince the country and the courts that fraud ran rampant this election, but there's no evidence that's true.", "Voting machines did not \"glitch,\" there were not more votes than eligible voters and dead people or other illegal voters did not hijack the election. USA TODAY debunked a number of election falsehoods, which can be found here.", "More:Donald Trump stood no chance in front of a conservative Supreme Court. Here's why.", "Courts across the country — including the highest in the land — have similarly dismissed the allegations made by the president, his campaign //and his allies.", "And a national coalition of election security officials, which includes the Department of Homeland Security's Cybersecurity & Infrastructure Security Agency and the National Association of State Election Directors, described the 2020 election as \"the most secure in American history.\"", "Fact check:Statistical analysis supporting pro-Trump Supreme Court case is 'ludicrous'", "We rate the claim that President-elect Joe Biden did not legally win the presidential election as FALSE because it was not supported by our research. Biden legally won the popular vote and obtained enough electoral votes to claim the win. There's no evidence of voter fraud, despite widespread, unfounded claims.", "Thank you for supporting our journalism. Youcan subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]