["The post was published here on Facebook on July 31, 2020.", "It features an image that shows part of a letter titled “Update to deposit options”. The letter lists changes to \"cash and cheque deposits at Westpac\" which are purportedly effective from July 2020.", "The post reads: “And ......Westpac is going cashless / By the end of 2020 Westpac, an Australian bank, will no longer accept cash or cheques deposits to your bank account… Let that sink in”.", "The same claim was also shared here, here, here, here, here, and here on Facebook. It also appears here, here, here and here on Twitter.", "The claim, however, is misleading.", "In response to the social media posts, a spokesperson for Westpac told AFP: “There is no change to deposits of physical cash or cheques to Westpac accounts” for ordinary account holders.\"", "“[The image in the misleading post] relates to changes to services we provide agency banks (e.g. tier 2 banks without significant branch networks and other financial institutions). The picture posted on social media was cropped in a way that excludes important explanatory information. It appears to be a communication from one of the agency banks to its customers,” the spokesperson said in an email to AFP on August 12, 2020.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]