["By Lori Robertson", "Posted on September 24, 2018", "Competing campaign ads in the Nevada Senate race would have voters believe both candidates have done a disservice to veterans. But a closer inspection reveals cracks in several of the claims.", "Ads attacking lawmakers often point to their voting records. But we would caution readers that a single vote doesn’t always tell the whole story and can be misrepresented by political campaigns.", "For instance, Heller’s ad says Rosen “voted against holding the VA accountable for mistreating veterans,” while Rosen’s ad says she “broke with [House Minority Leader Nancy] Pelosi to bring some accountability to the VA.” Which is it?", "Rosen voted against a House bill that was supported overwhelmingly by Republicans, but she voted for a bipartisan Senate version, which was then signed into law by President Donald Trump.", "The incumbent senator’s ad, launched on Sept. 11, features veterans who say they’ll “never forget how Jacky Rosen treated us.” The first complaint: “Rosen skipped a vote to help Vietnam veterans like me suffering from Agent Orange,” one veteran says.", "Rosen did miss the vote on June 25, but her absence — and that of the other 44 House members who also missed the vote — made no difference in the outcome of the legislation. It passed on a 382-0 vote under an expedited process called “suspension of the rules.”", "“The purpose of considering bills under suspension is to dispose of non-controversial measures expeditiously,” explains the Congressional Institute, a nonprofit educational organization.", "The legislation, the Blue Water Navy Vietnam Veterans Act, would enable Navy personnel who served offshore during the Vietnam War to submit disability claims for injuries related to exposure to Agent Orange under a presumption that they were exposed to the herbicide used by the U.S. military. The policy now of the Department of Veterans Affairs is to presume exposure if service members were onshore or on ships on inland waterways.", "Bills passed under the suspension procedure must garner a two-thirds majority, and the bill had an even larger majority in co-sponsors, with 330 lawmakers — or nearly 76 percent of the House — signing on to the legislation. The co-sponsors split close to evenly between Democrats (175) and Republicans (155).", "Rosen signed on as a co-sponsor on Feb. 28, 2017, nearly two months after the bill was introduced on Jan. 5, 2017. It continued gathering sponsors through May of this year.", "The congresswoman stated on the House floor on June 27, two days after the vote, that she had been absent due to “work-related travel” but she would have voted yes on the measure.", "Voters can decide for themselves whether to fault Rosen for missing the vote, but the ad may well leave the misleading impression with some that her absence had an impact on the outcome of the legislation. It didn’t.", "The bill is now being considered by the Senate Committee on Veterans’ Affairs.", "The NRSC similarly attacks Rosen for this missed vote in two TV ads. In one, a veteran tells viewers, “When Congress debated helping veterans on Agent Orange, Jacky Rosen skipped town.” In fact, the debate under the suspension of the rules was limited to 40 minutes and consisted solely of several lawmakers speaking in support of the bill, according to the Congressional Record.", "Rosen also was an original co-sponsor of a bipartisan bill to expand benefits to veterans who served in Thailand during the Vietnam War. That bill was referred to committee in January and no action has been taken since.", "Heller’s ad goes on to say that Rosen “skipped [the Agent Orange vote] to film a campaign commercial.” Rosen was on “work-related travel,” as she said, but her campaign used some images from that trip in a campaign ad.", "Does that mean she went to “film a campaign commercial”? The two campaigns disagree about the intent of Rosen’s trip to the U.S.-Mexico border that came during the controversy over the Trump administration’s separation of families apprehended at the border.", "“The Monday of the vote, she decided it was more important to shoot a commercial than showing up and voting to expand coverage for veterans suffering from the effects of Agent Orange,” Heller campaign spokesman Keith Schipper told us. “Her campaign was more important — more of a priority — than these heroes.”", "On June 25, Rosen toured a detention facility in Texas for unaccompanied immigrant children, some of whom had been separated from their parents. She also toured the border with Rep. Salud Carbajal of California. Sen. Catherine Cortez Masto of Nevada toured another detention facility in Texas the same day.", "Rosen’s congressional office noted in a press release that the congresswoman was an original co-sponsor of the Keep Families Together Act, aimed at prohibiting the separation of children from their parents when apprehended at the border. Nearly all of the 194 Democratic House members who signed on to the bill were original co-sponsors. She, along with 15 other Democrats, was also an original co-sponsor of the Reunite Children with their Parents Act, which would require the Department of Homeland Security to reunite separated families.", "Nevada media outlets covered the trip and interviewed Rosen, who said the tent city detention facility wasn’t “a viable solution.” She said: “We need people to come to the table, talk about comprehensive immigration reform, talk about the oversight we need in the Justice Department, be sure that people have access to legal means if they’re seeking asylum, and be sure that we are not going to be violators of human rights,” according to the Nevada Independent.", "But Heller’s campaign charges that the visit was a political photo op, since Rosen’s campaign used images from the border visit in a Spanish-language campaign ad. The Nevada Republican Party filed an ethics complaint about it, saying the campaign had used “tax dollars to pay for Rosen’s most recent television commercial.” It’s worth noting that the Nevada Democratic Party also has filed ethics complaints with the Senate Select Committee on Ethics against Heller’s campaign, with one of those complaints for a similar reason — using a Senate photo on his campaign site and in campaign materials.", "Heller’s ad also says Rosen “campaigned in Hollywood with Jane Fonda.” An NRSC ad also raises this issue, saying: “Hanoi Jane raised Jacky Rosen money for her campaign,” using a nickname Fonda earned for her antiwar activities, in particular a visit to Hanoi in 1972 in which she was photographed with North Vietnamese soldiers on an antiaircraft gun.", "Rosen attended an April 20 fundraiser in California along with several female Democratic senators. According to the Los Angeles Times, the invitation said the event was hosted by actresses Jane Fonda and Connie Britton, along with others. Contributions went to a joint fundraising committee of the Democratic Senatorial Campaign Committee and the campaigns of several of the lawmakers, including Rosen.", "But Rosen’s campaign says that Fonda didn’t actually attend the event. A DSCC aide confirmed that, saying in an email to FactCheck.org that Fonda “did not contribute or attend the event and was not expected to.”", "A search of donor records through the Center for Responsive Politics’ website shows no donations from Fonda to Rosen’s campaign.", "The joint fundraising committee that held the event — Women on the Road California 2018 — gave $11,400 to Rosen’s campaign.", "So, according to the DSCC and Rosen’s campaign, she has not actually “campaigned with” Fonda in person. We can’t say whether any of the attendees of the event donated money because of Fonda’s association with it.", "Rosen’s campaign responded to these claims with an ad of its own featuring veterans. In the TV spot, released Sept. 14, the veterans say that Heller was “playing politics with veterans” and that his ads were “lies.” They go on to charge that “Heller, he got the worst grade in Nevada on veterans.” He did back in 2010, the last year that the nonprofit Iraq and Afghanistan Veterans of America released a report card on lawmakers.", "Heller, who was then in the House, and a Nevada senator tied for the worst grade in the Nevada delegation – a “D.” However, it’s worth noting that two years earlier, the same group gave Heller a “B” for his actions on bills the IAVA supported. That was not the lowest grade awarded to the delegation that year. The IAVA launched the report card project in 2006, the group told us, issuing reports every two years through 2010. It was not able to provide the 2006 and 2008 reports.", "As we’ve said with several of these claims, readers can come to their own conclusions about the significance of the IAVA rating. But it’s worth noting that in the 2010 report card, there were some inherent disadvantages for Republicans like Heller in terms of the legislation IAVA highlighted. Sen. John McCain, for instance, also received a “D,” and had received a “D” in the 2008 report.", "Heller received 11 out of a possible 18 points. He and most other House Republicans failed to garner four of the possible points because they didn’t co-sponsor legislation that was overwhelmingly sponsored by Democrats. (However, many Democrats didn’t sign on as co-sponsors either. The most combined co-sponsors any one measure received was 125.)", "The IAVA told us the group chose those pieces of legislation because they “favored veterans,” not a particular party. But, a spokesperson added, “In that Congress, Democrats held a fairly sizable majority in both chambers so it’s not strange that many of the bills passed began with Democrat sponsors. However, many of those bills had substantial bipartisan cosponsors.”", "Heller also lost a point for missing a vote on a bill that received overwhelming support — which was the case in Rosen’s missed vote this year.", "The House approved an appropriations bill funding the Department of Veterans Affairs by a 415-3 vote. That means nearly all House lawmakers earned a point in the IAVA report card for their yes votes — but not Heller. He had left Washington to attend his daughter’s wedding, held the day after the vote in Lake Tahoe.", "Heller’s campaign spokesman, Schipper, told us: “Dean Heller has a record supporting the IAVA’s issues and it punished Heller for attending his daughter’s wedding.”", "The Nevada Independent did a deep dive on Heller’s score on the 2010 report card and his stances and action on the issues in question. Among the findings: “[T]here is also evidence Heller supported some of the policies that he was docked for voting against because the policies were a small part of a much bigger and more complicated bill.”", "One bill, for instance, provided additional compensation for service members who were “stop-lossed” — required to serve beyond their enlistment terms in Iraq and Afghanistan. But Heller voted for another version of the bill. Heller also voted against a bill that included provisions on sexual assault prevention programs in the military. It provided for a repeal of the Don’t Ask Don’t Tell policy, and it passed the House largely along party lines. He voted for another version — without the Don’t Ask Don’t Tell repeal — and that version became law.", "IAVA said in its report that the grades weren’t based on party but rather the legislation the group prioritized. “These grades are based on their votes and cosponsorship of IAVA Action’s legislative priorities published and delivered to every Congressional office at the start of 2009 and 2010 and regularly reinforced by Congressional testimony and appearances in the media. The grades are based entirely on these priorities and are blind to party and ideology,” it said.", "We’d note that the exercise of grading Congress on any topic shows how emphasizing certain legislation over others makes a difference.", "And that’s amply illustrated by these competing ads. As we said at the beginning of this article, Rosen voted against a House bill on VA accountability that was supported overwhelmingly by Republicans, but she voted for a bipartisan version, which passed the House by a 368-55 vote. Rosen’s ad says she “broke with Pelosi” on the vote, which is true — Pelosi, along with 53 other Democrats, voted against it. It also says she “took on her own party,” but she wasn’t alone on that in this vote.", "“The first version of the bill was highly partisan and created due process concerns for workers,” a spokesperson for Rosen’s campaign told us of why she supported one bill but not the other. “Rosen supported the more bipartisan Senate version of the bill to improve VA accountability that addressed these concerns, and President Trump signed the bill into law.”", "The Senate didn’t vote on the House bill, but instead passed its version of the legislation by voice vote.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]