["About this rating", "In late April 2017, rumors appeared that President Donald Trump had pressured the Argentinian government to \"rescind\" an award they planned to bestow upon former U.S. president Jimmy Carter. For example, the The Intellectualist reported:", "The Trump administration pressured the government of Argentine President Mauricio Macri to rescind an award to former Democratic President Jimmy Carter. Carter, a frequent critic of the authoritarian tendencies of the Trump administration, was set to be honored by Argentina with the Order of the Liberator General San Martín, the equivalent to America’s Medal of Freedom, however, the Trump administration moved to quash this.", "CNN Español reported the same, citing an unidentified source. The award would be delayed, the source said, to \"avoid conflict\" with Macri's visit to the White House. However, CNN also cited a second source saying that Macri would not have time to give Carter the honor because his visit to Washington D.C. was only two days long.", "The Argentinian government had announced on 30 March 2017 that Carter would be receiving the Order of San Martín, calling him \"a defender of human rights\" during his presidency and praising his offer in 1979 to accept up to 3,000 people who had been detained by the country's ruling junta at the time. However, the announcement did not specify that Carter would be honored during Macri's visit.", "We reached out to the Argentinian embassy to the U.S. seeking comment but have yet to hear back. A spokesperson for the Carter Center, the not-for-profit group founded by the former president, told us via email:", "President Carter is honored to receive this prestigious award from Argentina, and looks forward to accepting it in Atlanta at a date yet to be determined.", "Trump said during Macri's visit that the U.S. and Argentina would be \"great friends, better than ever before.\"", "Prior to Macri's visit to the White House, the two heads of state also spoke shortly after Trump's election in November 2016, a conversation that was reportedly arranged following a \"friendly and cordial\" discussion between Trump's son Eric and Felipe Yaryura, an Argentinian businessman with ties to both Trump and Macri's administration. Yaryura allegedly put the younger Trump in contact with Argentinian Foreign Minister Susana Malcorra, leading to the phone call between Macri and the president-elect. President-ElectTrump also allegedly asked Macri for approval on an office tower bearing his name in Buenos Aires, an allegation denied by both administrations.", "However, the president's relationship with Macri's family reaches back to the 1980s, when Trump tried to forge a partnership with Macri's father, Francisco Macri, between 1982 and 1985. After the two parted ways, Trump reportedly referred to the elder Macri as a \"know-nothing.\"", "Cox, David.   \"Argentina No Entregaría Condecoración A Jimmy Carter Por Pedido De Trump.\"\r\n    CNN Español.   23 April 2017.", "The Intellectualist.   \"Trump Administration Pressures Argentina To Rescind Award To Former President Jimmy Carter.\"\r\n    30 April 2017.", "Buenos Aires Herald.   \"Trump Vetoes Carter Tribute.\"\r\n    28 April 2017.", "Cox, David. \"Argentina No Entregaría Condecoración a Jimmy Carter Por Pedido de Trump.\" CNN Español. 23 April 2017.", "Colvin, Jill and Superville, Darlene. \"Trump, Argentine President Macri Hold White House Talks.\" Associated Press, accessed via washingtonpost.com. 27 April 2017.", "Obarrio, Mariano. \"Acuerdan Con el Hijo de Trump Una Llamada Entre Los Presidentes.\" La Nacion. 13 November 2016.", "Thompson, Catherine. \"More Details About That Trump/Macri Call.\" Talking Points Memo. 22 November 2016.", "O'Brien, Timothy L. \"Trump's Jagged Argentine Connection.\" Bloomberg. 27 April 2017.", "Kim LaCapria is a former writer for Snopes.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]