["Gwinnett County's 2016 proposed budget would unfreeze 25 police positions and create 30 additional ones.", "Some local governments, including Gwinnett County, are still dealing with the effects of the Great Recession.", "They’re planning to set aside money in their 2016 budgets to continue restoring programs and jobs that were slashed or frozen when the economic bottom fell out.", "Gwinnett’s tax digest grew steadily until 2009 but lost 21 percent of its value by 2013, Gwinnett Commission Chair Charlotte Nash said Nov. 17.", "The digest is rebounding but isn’t expected to be back to its 2008 level until 2018, she said.", "So while Gwinnett’s population has grown 15 percent since 2008, the county government staff has only increased by 1 percent, Nash said.", "Could that be true?", "Since Nash is proposing a 2016 operating budget for Gwinnett of $1.1 billion and 82 new county jobs, PolitiFact Georgia decided to check", "First, a little background. The National Bureau of Economic Research, considered the official arbiter of U.S. recessions, identifies the Great Recession as roughly 18 months, from December 2007 to June 2009.", "The financial belt-tightening and pain was widespread, hitting families, communities and governments -- including the nation’s counties that collectively employee 3.3 million Americans.", "Georgia lost 340,400, or 8.5 percent, of its jobs, between 2007 and February 2010 and, consistently  reported one of the nation’s highest home foreclosure rates in this period.", "Gwinnett’s proposed 2016 budget would fund 25 police positions that were frozen and restore staffing at the county animal shelter, correctional facility and parks maintenance.", "It also would return library funding to 88 percent of its 2008 level and reinstate longevity pay raises that were eliminated in 2009, as well as pay for short-term and long-range needs, Nash said.", "Checking the numbers", "For our fact-check, we contacted Joe Sorenson, communications director for Gwinnett County government, who provided us with county population and employment data dating back to 2008.", "The population estimates show Gwinnett, once one of the nation’s fastest growing counties, still steadily adding residents -- going from 780,721 in 2008 to 898,450 this year and forecast to have 919,290 residents in 2016.", "County government added 42  authorized positions to expand its workforce from 4,893 in 2008 to 4,935 in 2015.", "The county would have an authorized workforce of 5,022 under the proposed budget. This includes 30 extra police officers, above and beyond the 25 newly unfrozen jobs, as well as additional positions in the district attorney’s office, animal control and welfare, parks and recreation, water and sewer inspections, and in a medical unit in the county’s Fire & Emergency Services Department.", "So do the numbers we reviewed support Nash’s claim? The short answer is yes.", "The population estimates the county provided came from a private company and didn’t match exactly those we pulled from the U.S. Census Bureau. But the differences weren’t significant. (For example, the county estimate shows Gwinnett with 880,707 residents in 2014, the Census 877,822. Population estimates for 2015 also aren’t out yet from the Census Bureau.)", "Slow rebound", "Elizabeth Kellar, executive director of the Center for State & Local Government Excellence in Washington, D.C., said that, nationwide, local governments -- that includes cities, too -- cut about 500,000 jobs beginning in 2009.", "It wasn’t until 2013 and 2014 that local government human resources managers -- who the center surveys each year -- started reporting the trend turning from hiring freezes and layoffs back to hiring, Kellar said.", "Some county governments in metro Atlanta have smaller staffs today.", "For example, Fulton County government went from 6,866 permanent and non-permanent employees in 2008 to 5,229 in 2015, spokeswoman Jessica Corbitt said.", "That’s 1,637 fewer employees for a county that grew by more than 100,000, or about 12 percent in that period.", "DeKalb County didn’t grow on par with Fulton or Gwinnett, but also cut staff.", "Burke Brennan, county spokesman, sent us a graph, plotting filled full-time positions in county government each December from 2007 until this month.", "It shows the county currently has 6,057 full-time employees,16.3 percent lfewer employees than were on the payroll in 2007.", "Census Bureau estimates, which Brennan said should be viewed cautiously, show DeKalb’s population grew 5.3 percent, from 685,646 in 2008 to 722,161 in 2014.", "Our  ruling", "Charlotte Nash, chairman of the Gwinnett County Commission, said that, since 2008, the population of the county has grown 15 percent while the government staff has increased by only 1 percent.", "The former county finance director is right on her stats.", "The budget discussion in Gwinnett also serves a reminder that the Great Recession is not that far back in the rear view mirror -- not when a goal for 2016 is returning library funding to 88 percent of its 2008 funding level.", "We rate Nash’s statement True.", "\"2016 budget proposal invests in big picture,\" Press release, Gwinnett County, November 17, 2015", "Emails and phone call with Joe Sorenson, director of communications, Gwinnett County government", "U.S. Census Bureau estimates of Gwinnett County population, 2008-2014: 2008 -- 780,721; 2009 - 796,276; 2010 --- 808,374; 2011 -- 824,981; 2012 -- 840,221; 2013-- 858,956; 2014 ---877,922. Population increased 97,201 or 12.45 percent in this period. 2015 estimates not available through the Census Bureau.", "Email with Elizabeth Kellar, executive director of the Center for State & Local Government Excellence in Washington, D.C.", "2015 Workforce Trends report Center for State & Local Government Excellence in Washington, D.C.", "Email and phone interviews with Burke Brennan, spokesman for DeKalb County government.", "Email with Jessica Corbitt, spokesperson for Fulton County government.", "Email and phone calls with Robert Bernstein, public affairs specialist with the U.S. Census Bureau", "Annual Population Estimates, American Fact Finder, U.S. Census", "Intercensal Estimates for Gwinnett, DeKalb and Fulton counties, U.S. Census Bureau", "Gwinnett County Population/ Staffing data", "Year                              Population         Authorized  Positions", "008                              780,721                    4,893", "2009                               9796,276                 4,714", "2010                               808,304                   4,827", "2011                                825,094                   4,815", "2012                                840,575                   4,812", "2013                                859,304                   4,825", "2014                                880,787                    4,853", "2015                                898,458                     4,935", "2016                                919,290                      5,022", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]