["The claim was published here on a New Zealand-based Facebook page on July 20, 2020. The post has been shared more than 126 times.", "The Facebook post's caption states in part: “NASA has recently added a new star sign to the Zodiac family - welcome to the team Ophiuchus.”", "A meme included in the post lists the corresponding birth dates for the 12 astrological signs of the zodiac, with an additional one, “Ophiuchus”, purportedly designated for people born on or between November 29 and December 17.", "The zodiac was drawn up some 3,000 years ago by the Babylonians, an ancient civilisation, to illustrate the constellations that lie along the same path as that of the Sun, according to NASA.", "A similar claim about the purported new star sign have also been shared on Facebook here and here in July 2020. The same hoax was shared thousands of times after it was published here on Facebook in 2016. It was also shared here, here and here on Twitter in 2016.", "The claim, however, is false.", "NASA refuted the claim in this July 17, 2020, Twitter post, which states in part: “No, we did not change the zodiac. When the Babylonians invented the constellations [zodiac signs] 3,000 years ago, they chose to leave out a 13th sign.”", "The space agency had previously clarified the confusion about \"Ophiuchus\" in this September 2016 blog post: “Here at NASA, we study astronomy, not astrology. We didn’t change any zodiac signs. Astronomy is the scientific study of everything in outer space. Astrology, meanwhile, is something else. It’s the belief that the positions of stars and planets can influence human events. It’s not considered a science.”", "NASA said the Babylonians picked 12 constellations in the zodiac and assigned each of them to a specific month on their 12-month calendar. “According to the Babylonians’ own ancient stories, there were 13 constellations in the zodiac. So they picked one, Ophiuchus, to leave out,” NASA added.", "The agency explained here that even though ophiuchus was omitted by the Babylonians for the sake of a “tidy match with their 12-month calendar”, it nonetheless aligned with the sun for about 18 days each year.", "Misinformation about a 13th star sign has circulated online since at least 2011, as reported by the BBC here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]