["The 10-second video was shared here on Facebook on June 27, 2019, where it has been viewed more than 2,500 times.", "The Hindi-language caption translates to English as: “First they cut the Janeu of an elderly Brahmin man then they removed his clothes and compelled him to dance. This is the situation in Congress-led southern states. Is it not a mob-lynching of minority Brahmins Rahulji? Where are all the liberals.\"", "Janeu refers to sacred religious thread generally worn by high caste men in India.", "Congress refers to India’s main opposition the Indian National Congress party and Rahulji refers to its former president Rahul Gandhi.", "Below is a screenshot of the Facebook post:", "The video has been shared in multiple Facebook posts, for example here, here and here with similar claims.", "The video was also shared multiple times on Twitter, for example here, here and here with a similar claim.", "The claim is false; a longer version of the video shows the sacred religious thread across the old man’s torso is not cut by the crowd.", "The clip was captured from a post on video creation and sharing app Tok Tok, by a user named @hero.m.s:", "A search by username ‘@hero.m.s’ found a clearer version of the video was posted on Tik Tok.", "Below is a screenshot of the video posted on Tik Tok:", "The Tamil-language caption alongside the video says: “An elderly Brahmin man with sacred thread paid respect to statue of Periyar.”", "Periyar refers to E V Ramasamy Periyar, a political activist and social reformer whose thought and philosophy revolves around opposing the caste system and Brahminism.", "There is another logo on the bottom-left corner of the screen of the Tik Tok video with “Karuppar Koottam” written on it in Tamil, which can be seen using image magnifier on the video verification tool InVid.", "Below is a screenshot showing blurry text on the logo:", "A Google search with keywords “Karuppar Koottam” found a Tamil YouTube channel with the same name where a longer version of the video was posted on June 24, 2019.", "The caption alongside the YouTube video in Tamil says: “An old man with sacred religious thread paid respect to Periyar’s statue”.", "The video in the misleading posts corresponds with the YouTube video between the 13 seconds mark and the 23 seconds mark.", "Below is an image comparison screenshots of videos posted in misleading Facebook post (L), Tik Tok (M) and YouTube (R):", "The sacred religious thread of the man can be seen intact on his body at the end of the clip, and he can be seen dancing voluntarily with other people, encircled by a cheering crowd, until the end of the video.", "A large billboard with “A.S. Babu Shah” written can be seen in the YouTube video. A. S. Babu Shah is a popular silk saree brand based in Kanchipuram in Tamil Nadu.", "AFP geolocated street Raja Street where the video was shot using mapping website Mapillary here.", "Below is an image comparison screenshots of the YouTube video (L) and photos found on Mapillary (R) with similar elements highlighted in blue:", "India’s opposition Congress Party has not been in power in Tamil Nadu for some 50 years. The state is currently ruled by the All India Anna Dravida Munnetra Kazhagam (AIADMK) party.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]