["NBC News correspondent Kristen Welker, the moderator for the third presidential debate, has not donated money to Democrats, according to contribution data.", "Welker is currently registered to vote in Washington, D.C., with no party affiliation, according to the District of Columbia Board of Elections.", "A photo of Welker with Barack and Michelle Obama is from a 2012 White House reception for the press.", "As she prepares to moderate the final presidential debate in Nashville, Tenn., NBC News White House correspondent Kristen Welker faces unfounded accusations on social media that claim she’s biased toward Democrats.", "Welker has not donated thousands of dollars to Democratic candidates, registered as a Democrat or \"spent Christmas\" at the White House with President Barack Obama, despite what an Oct. 17 Facebook post claims.", "\"Kristen Welker, of NBC, the next debate moderator chosen by the ‘unbiased’ presidential commission, gave thousands of dollars to Obama, Clinton and Biden, is registered as a Democrat (and) her family spent Christmas with the Obamas at the White House,\" the post, featuring photos of Welker and her family, says. \"Her mother is an activist for Biden!\"", "The Facebook post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "President Donald Trump has leveled similar complaints alleging bias, tweeting that Welker has \"always been terrible & unfair\" and calling her a \"dyed-in-the-wool, radical-left Democrat.\" In January, Trump congratulated Welker for landing a weekend anchor position with NBC.", "The Facebook post’s claims appear to have derived from an Oct. 17 report from the New York Post. The article said Welker’s parents have donated to Democrats and suggested that a photo of Welker at a White House holiday reception in 2012 was evidence of partisan bias.", "Federal Election Commission records don't show any donations to political candidates from Welker, let alone \"thousands of dollars\" to Obama, Democratic presidential nominee Joe Biden and Bill or Hillary Clinton. An NBC News spokesperson confirmed that she hasn’t donated.", "Welker isn’t registered to vote as a Democrat, either. According to the District of Columbia Board of Elections, Welker has been registered in Washington, D.C., with no party affiliation since 2016. She had previously registered as a Democrat in 2012, the board’s records show.", "The New York Post wrote that she was also registered as a Democrat in Rhode Island in 2004.", "Welker’s parents have given money to Democratic candidates, including Biden, according to the Federal Election Commission's records.", "But Welker’s mother, Julie Welker, told PolitiFact that she does not have a role with the Biden campaign. \"I am in no way an activist for Joe Biden,\" she said. \"I am busy with my full-time job.\"", "The Facebook post’s claim that Welker and her family \"spent Christmas with the Obamas at the White House\" is also inaccurate, as scores of journalists and pundits pointed out on Twitter.", "The claim is rooted in a photo Welker uploaded to Facebook on Dec. 13, 2012. The photo shows Welker and a man the New York Post identified as \"family\" posing for a picture in a room full of Christmas decorations with Barack and Michelle Obama.", "The photo was snapped at a White House holiday press party attended by the White House press corps, the NBC News spokesperson said. Welker attended a similar reception hosted by Trump in 2017. Trump canceled the gathering in 2018.", "Generations of media members have attended such events, which predate Obama by decades and often include lines for photos. Similar photos show the Obamas with conservatives, including media mogul Rupert Murdoch, who owns the New York Post.", "Steven Thomma, executive director of the White House Correspondents Association, an organization of journalists who cover the White House, said he’s attended most of the White House’s holiday receptions for the press since 1993, when Bill Clinton was president.", "Invitees are typically allowed to bring one guest, Thomma said, and the White House has often split the press between one reception primarily for TV and another for print and wire services.", "\"Guests are asked to go to the ground level, where they wait in line for a quick photo with the president and first lady,\" Thomma said in an email to PolitiFact. \"Staff is very strict about limiting time spent on small talk to less than 1-2 minutes, to keep the line moving.\"", "\"The photo is taken by the White House photographer, and sent to every guest several days later,\" Thomma said. \"Guests commonly post them on Facebook and other social media.\"", "A Facebook post says Welker \"gave thousands of dollars to Obama, Clinton and Biden, is registered as a Democrat & her family spent Christmas with the Obamas at the White House.\"", "The claims in the post are wrong or exaggerated.", "First, FEC records don’t show any political contributions from Welker.", "Second, Welker is registered to vote in Washington, D.C., with no party affiliation.", "Third, Welker did not take her family to spend Christmas with the Obamas. She posed for a photo at a White House reception hosted for the press in 2012.", "We rate the Facebook post False.", "Facebook post, Oct. 17, 2020", "The New York Post, \"Kristen Welker, upcoming presidential debate moderator, has deep Democrat ties,\" Oct. 17, 2020", "Various searches in the Federal Election Commission’s databases, Oct. 20, 2020", "USA Today, \"Fact check: Post about debate moderator, White House holiday party lacks context,\" Oct. 20, 2020", "Poynter, \"Who is Donald Trump complaining about now? NBC News’ Kristen Welker, the next debate moderator,\" Oct. 19, 2020", "Factba.se, \"Press Gaggle: Donald Trump Speaks to the Press After Air Force One Arrival,\" Oct. 19, 2020", "Jake Tapper on Twitter, Oct. 19, 2020", "Brit Hume on Twitter, Oct. 18, 2020", "Donald J. Trump on Twitter, Oct. 17, 2020", "Oliver Darcy on Twitter, Oct. 17, 2020", "Tommy Vietor on Twitter, Oct. 17, 2020", "Karen Tumulty on Twitter, Oct. 17, 2020", "Sam Stein on Twitter, Oct. 17, 2020", "Today, \"Watch President Trump congratulate Kristen Welker on Weekend TODAY role,\" Jan. 25, 2020", "The Daily Beast, \"Trump Cancels White House Christmas Party for the Press,\" Dec. 13, 2018", "The New York Times, \"The White House Holiday Photo Line: A Tradition of Awkwardness,\" Dec. 13, 2015", "BBC News, \"Christmas at the White House: What do you say to Obama?\" Dec. 20, 2012", "Kristen Welker on Facebook, Dec. 13, 2012", "Email correspondence with NBC News, Oct. 20, 2020", "Email interview with Julie Welker, realtor, Oct. 20, 2020", "Email interview with Steven Thomma, executive director of the White House Correspondents Association, Oct. 20, 2020", "Phone and text interviews with Nick Jacobs, public information officer for the District of Columbia Board of Elections, Oct. 20, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]