["The video was shared in this Facebook post on January 14, 2020. The 35-second clip has since been viewed nearly 200,000 times.", "The caption reads: “Snow fall in Medina Munnawara, amazing.”", "Below is a screenshot of the misleading post:", "The video was also shared alongside similar claims on Facebook here, here and here; on Twitter here and here; and on YouTube here.", "The claim is false; the video actually shows snowfall inside Imam Reza, an Islamic shrine and holy site for Shiite Muslims in the northeastern Iranian city of Mashhad.", "A reverse image search of keyframes extracted from the video using InVID, a digital verification tool, found the same footage was published here on Facebook on January 13, 2020, and here on YouTube on January 14, 2020. Both videos state the snowfall is at the Imam Reza shrine.", "The YouTube video’s title reads: “Not snowing in Makkah or Medina. In fact it’s in Iran. The holy shrine of Imam Reza in Mashhad.”", "Imam Reza’s official Instagram account and Telegram channel both posted snowfall content here and here on January 12, 2020.", "Below is a comparison showing matching minarets and light poles from screenshots taken from video in the misleading Facebook post (L) and the video published on Imam Reza’s Telegram channel (R):", "Photos from inside the Imam Reza courtyard published here by Google Maps users also show identical minarets and light poles.", "Below is a screenshot of the Google Maps images:", "Local weather reports also show that Mashhad experienced sub-zero temperatures and snowfall this month, while Medina maintained above freezing temperatures and had no precipitation.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]