["On Diwali night, October 25, a youth was hacked to death in Odisha’s Sundarpada, Bhubaneshwar. Subsequent media reports declared “bursting of crackers” as the motive behind the murder. Barring a few local reports, most news organisations stated that Amaresh Nayak was murdered in the state capital for bursting crackers.", "Sudarshan News drew parallels with the murder of Hindu Samaj leader Kamlesh Tiwari and suggested a hand of “religious fanatics” behind Nayak’s death.", "Right-wing website OpIndia termed the murder “lynching”.", "The incident garnered substantial outrage on social media, with several users expressing rage over “Hindus” unable to burst crackers even on the occasion of Diwali.", "Amaresh Nayak of BDA Colony in Sundarpada, was attacked by a sword after a heated argument with a couple of people over bursting crackers on Diwali. So Hindus can’t even burst crackers on Diwali in this country. pic.twitter.com/P72HCJ9UMm", "— Anurag (@ianuragsaxena) October 28, 2019", "Many stressed on Nayak’s religious identity thus alluding communal motivation behind the crime.", "Hindu youth butchered for bursting crackers", "A hindu youth Amaresh Nayak hacked to death in Bhuvaneshvar, for bursting crackers on Deepavali", "He was attacked with swords and hacked to Death", "Posted by Vinay Biswal on Monday, 28 October 2019", "Twitter handle @RealHistoriPix infamous for circulating misinformation blamed ‘peacefuls’ for the murder. ‘Peacefuls’ is a derogatory term used on social media for the Muslim community.", "In a conversation with Alt News, DCP Bhubaneshwar Anup Sahoo said, “All the accused have been identified. There is no communal angle at all,” further informing that the victim and the accused belong to the same community. The police have identified 10-12 persons but the exact number will be ascertained after the arrests are made.", "On October 28, DCP Sahoo had informed the media, “The scientific team inspected the whole scene and collected samples. Several unblasted cracker bombs were found on the scene, however, it is yet to be ascertained whether they were planted before or after the murder.” The officer also stated that the deceased and others identified in the case had several cases lodged against them. Local reports carry similar allegations by area residents who said that Nayak was involved in criminal cases.", "DCP Sahoo informed that “bursting of crackers” was not the motive behind the murder, “No, it was actually a verbal duel between two groups. It was out of sudden provocation not because he burst crackers.” The officer stated that the two groups shared “past enmity” and a minor altercation led to the assault and subsequent death of the victim.", "Incidentally, most media reports gave the impression that Nayak was individually targetted. However, it was a group clash where two others were also injured, reported Ommcom News.", "The police had initially detained a local ex-contractor Mantu Nanda as his name was mentioned in the complaint. Orissa TV reported that Nanda was later released following protests by his supporters.", "A complainant in the case, Debi Prasad Sethi, gave some of the names of the alleged accused – “We were partying as well as bursting crackers when some youths came and asked us to stop the celebrations. Raghua, a youth among them brandished a gun at us while two others, Kuna and Babul attacked us with sharp weapons. I somehow managed to escape the spot and informed the matter to Amaresh’s family.”", "The statements of police and complainants in the case affirm that the incident was not communal in nature but sparked by an altercation between two opposing groups. Media reports declared “bursting of crackers” as the motive behind the murder. However, crucial details such as the victim and accused hailing from the same community and “personal and past enmity” leading to the attack were not offered in the reports. This subsequently nourished false, communally-charged claims propagated on social media. Furthermore, the reports were centred around the deceased without supplementary information that the attack was a group clash.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]