["Democratic Sen. Elizabeth Warren and presumptive Democratic presidential nominee Hillary Clinton had a lot of nice things to say about Cincinnati during their first campaign appearance together in the Ohio city.", "Clinton gave props to Cincinnati’s mayor and applauded one city achievement in particular.", "\"Cincinnati is already one of the biggest cities in the country to run 100 percent on clean energy,\" she said. \"Congratulations.\"", "But what does it mean to say that Cincy \"runs\" on clean energy?", "Buses powered by photosynthesis? City government meets by candlelight?", "We popped the hood for a closer look.", "It’s more complicated than the city no longer using \"dirty\" power.", "In 2011, Cincinnati voters approved a ballot initiative allowing the city to bargain for electricity on behalf of its residents. The following year, the City Council accepted a bid from FirstEnergy Solutions to offer a 100 percent Renewable Energy Credit option to the city’s 53,000 residential and commercial electric customers. One renewable energy credit represents one megawatt-hour of renewable electricity produced by facilities like wind farms, solar canopies or hydro-electric dams.", "People in Cincinnati still get their power over the wires owned by Duke Energy, the traditional, coal-burning electric utility for the area. But FirstEnergy Solutions, as Cincinnati’s \"aggregation provider,\" buys a mix of both locally produced renewable electricity and renewable energy credits on the city’s behalf. Renewable energy credits are coded and retired, once purchased, and are used to track the ownership of environmental and social benefits of the renewable energy, not the electricity itself.", "It's complicated stuff, but we'll guide you through it.", "Say you're part of Cincinnati's FirstEnergy program, which you would be by default unless you opted-out. (Residents got a letter saying they could.) Your lights turn on using the same electricity as someone who opted to stick with conventional, coal-fed electricity, because once electricity is placed on the electrical grid, it becomes indistinguishable from the electricity generated by other sources.", "But when you pay your bill, you're paying for an equivalent supply of power from renewable sources being fed into the grid, be it locally or elsewhere.", "Larry Falkin, the director of Cincinnati’s Office of Environment and Sustainability, confirmed that 43,090 electric customers in the city and 1,287 small businesses participated in the renewable energy credit program in 2015, for a total of 405,737 megawatt hours. That's about 81 percent of the 53,000 households in Cincinnati.", "In past years, FirstEnergy’s renewable electricity sources have included the power generated from captured coal mine methane gas at the University of Cincinnati’s Central Utility Plant, and solar power generated at a solar canopy at the Cincinnati Zoo. FirstEnergy has also tapped wind farms in Iowa and Texas, and hydro-electric power from facilities in Virginia and Pennsylvania.", "There is a hitch. Critics of renewable energy credits argue that it’s almost impossible to confirm that a renewable credit actually displaces a megawatt-hour from a dirty source, like coal.", "\"It would be great if the purchase of certificates made up the difference between conventional and renewable power, but at best this is a token subsidy for renewable energy,\" Daniel Press, an environmental studies professor at the University of California, Santa Cruz, wrote in an editorial for the San Jose Mercury Press.", "Some large corporations that once embraced the renewable-credit model for greening up their profiles have since ditched the credits. Johnson & Johnson is one such company that enthusiastically purchased voluntary clean-energy credits in 2000, but has since backed off that strategy. Jed Richardson, J&J’s global energy director, said, \"We decided we were better off investing in renewable generation on our own properties.\"", "The Cincinnati City Council defended the renewable credit system from a challenge in 2014, when the interim city manager recommended returning to Duke Energy for power.", "The clean-powered households saved as much as 28 percent off their utility bills when the program began. But because of market fluctuations, the savings in the green program had dropped to 8 percent. The city manager reversed his stance when the majority of the council defended the clean energy program.", "City Councilman Chris Seelbach told PolitiFact Ohio, \"I successfully led efforts in 2014 to continue having 100 percent of our electricity backed by renewable credits after our administration recommended against it. Fortunately, the administration recommended renewable energy this year, so we didn’t have to fight them.\"", "Other cities that have gone 100 percent renewable include Burlington, Vt. (population 42,452), Greensburg, Kan. (population 798), and Aspen, Colo. (population 6,882). With a population of 297,517, Cincinnati is one of the biggest cities to use this program.", "Our ruling", "Clinton congratulated Cincinnati for being \"one of the biggest cities in the country to run 100 percent on clean energy.\"", "Clinton's phrasing makes it sound like Cincinnati is free of coal-fed power. The reality — the city's 100 percent Renewable Energy Credit option — is more complicated.", "While there are critics of the renewable energy credit system, it is currently the only way to ensure the purchase of power from green sources. The most recent reports show that 43,090 Cincinnati households and 1,287 small businesses participate in the city’s Electricity Aggregation Program.", "That’s not 100 percent of Cincinnati’s energy consumers — it’s about 81 percent of households. But those who are enrolled in the Electricity Aggregation Program can claim that they’re running on 100 percent renewable sources — or as close to it as anyone can get, while staying on the grid.", "We rate this claim Half True.", "https://www.sharethefacts.co/share/21054f53-62e8-442a-bcc5-8c5b85e969ad", "Email interviews, Larry Falkin, Director of Cincinnati’s Office of Environment and Sustainability, June 27-30, 2016", "Email interview,  Chris Seelbach, Cincinnati City Council, June 27, 2016", "Email interview, P.G. Sittenfeld, Cincinnati City Council, June 27, 2016", "Email interview, Jenita McGowan, Cleveland Chief of Sustainability, June 27, 2016", "Email interview, Daniel Press, University of California Santa Cruz, June 27, 2016", "FirstEnergy Solutions report, \"Summary of Gov Agg Cincinnati Green Product,\" Sept. 2, 2015", "EcoWatch.com, \"4 U.S. Cities That Have Gone 100% Renewable,\" Nov. 19, 2015", "Cincinnati.com, \"City to continue using green energy,\" March 12, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]