["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Ohio law requires the state to keep its budget in balance. But it's up to the governor and the General Assembly to figure out how to do it and how the burdens of the balancing act should be shared.\n\nGov. John Kasich took the lead in that process with what he called the \"jobs budget,\" a spending blueprint that includes cuts to local governments and school districts and to state agencies to close an $800 billion budget shortfall.\n\nKasich unveiled his spending plan March 15, 2011.\n\nAt a public forum at the Idea Center at Playhouse Square, State Sen. Nina Turner said she feared the governor was \"balancing the budget on the backs of employees\" and would impair the government's ability to provide services.\n\nWhen \"the governor announced his 'jobs budget,' 99 folks from the Department of Taxation were let go the next day,\" she said.\n\nPolitiFact Ohio decided to check it out.\n\nOn March 16, the state said it will close seven regional Taxpayer Service Centers on June 30 -- the end of the fiscal year -- resulting in the loss of nearly 100 jobs.\n\nTax Commissioner Joe Testa sent e-mail notices to employees at regional Taxpayer Service Centers in Akron, Cincinnati, Cleveland, Dayton, Toledo, Youngstown and Zanesville. The Columbus center will remain open.\n\nWorkers in the Cleveland office told The Plain Dealer the closings are a mistake that will hurt taxpayers and hurt tax revenue.\n\nBut the tax department said the revenues are about half of the $7 million the state will save. Testa said the offices have only a fraction of the calls and walk-in traffic they once did.\n\nWe asked the governor's office about the job cuts.\n\n\"It's in the context of what we want to do with the budget as a whole,\" spokesman Rob Nichols said. \"We inherited an $8 billion budget hole. We had the seventh-highest taxes in the nation last year.\"\n\nThe closing of the service centers is in line with a promise the governor made during his campaign: to shrink state government and make it more efficient.\n\n\"This budget presents a spending blueprint that Ohio taxpayers can finally afford,\" Nichols said. \"We can't keep doing what we're doing and expect to succeed in this state.\"\n\nWhether closing the tax service centers and laying off workers is a good idea is a question for someone else to answer. But Kasich is doing it.\n\nThat rates Turner’s statement as True on the Truth-O-Meter.", "Ideastream, \"Cut, Tax or Change: The Kasich Budget Challenge,\" April 18, 2011\n\nThe Plain Dealer, \"Gov. John Kasich says his 'jobs budget' is the most reform-minded in Ohio history,\" March 15, 2011\n\nThe Columbus Dispatch, \"Closing state tax offices eliminates 99 jobs,\" March 17, 2011\n\nThe Plain Dealer, \"State tax department closing 7 regional walk-in offices; 99 jobs eliminated,\" March 17, 2011\n\nThe Plain Dealer, \"Closing Ohio tax offices will hurt individuals, businesses and state revenues, workers say,\" March 31, 2011\n\nInterview with Rob Nichols, press secretary for Gov. Kasich, May 4, 2011\n\nOhio Legislative Service Commission, \"The Ohio Budget Process,\" April 2011\n\nJohn Kasich for Ohio campaign website, \"What I Stand For\"", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]