["In the video, a visibly angry French-speaking man is heard rebuking foreigners and demanding that they respect Guineans. Behind him, a group of Asian men and women look on, while cheers and clapping can be heard off-camera.", "“This can’t go on. Either they respect the laws of this country, or they get out of here,” the man says in French.", "On April 18, 2020, a Kenyan blogger with more than one million followers tweeted the video and wrote: “Guinea has allegedly arrested Chinese nationals in the country and has asked Beijing to assure the safe return of her citizens from China before they are released. #ChineseInKenyaMustGo”.", "The video was also posted with the same claim to Instagram on April 17, 2020. It has since been viewed more than 2,000 times and used in an article by a Kenyan website.", "The same claim was also posted on Facebook here, here and here.", "This video appeared online after Africans living in southern China report they have been victims of arbitrary evictions and discrimination during the pandemic, as covered by AFP here. In mid-April, the African Union expressed “extreme concern” about the situation and called on Beijing to take action.", "An old video", "The man in the video is not a government official, as some posts suggested, but the leader of a trade union.", "AFP was able to identify the man by searching for the keywords (in French) “Chinois” (Chinese) and “Guinée” (Guinea) on YouTube. This led us to another version of the same video, below, where the description identifies the man as a Guinean union member going by the name “Mara.”", "Further keyword searches using “Mara” and “syndicaliste” (French for unionist) led to numerous photos and articles about Aboubacar Sidiki Mara, the secretary-general of the General Union of Workers of Guinea (UGTG), who is the man seen in the video.", "Mara is a prominent union figure in Guinea. In May 2018, he was charged with “incitement to revolt” and given six months in jail, with a four-month suspended sentence.", "AFP contacted Mara, who said that the video was filmed last year before the start of the pandemic near Boffa, a town about 200 kilometres north of the capital, Conakry.", "“It was a reaction that I had when a Chinese person attacked a Guinean person in the Boffa port. I was present on the scene, and I asked the workers to chase the Chinese out of the region,” he said, adding that the matter was later settled amicably.", "No arrest order", "Contrary to the claim being shared alongside the video, there is no record of the Guinean government ordering the arrest of Chinese nationals residing in the west African nation.", "On April 14, 2020, Guinean Minister of Foreign Affairs Mamadi Touré held a cordial meeting with Huang Wei, the Chinese ambassador to Guinea, where he expressed his “deep concern about the differential treatment and the stigmatization which the Africans were undergoing” in China’s province of Guangdong, according to a statement published on the ministry’s official Facebook page.", "According to this statement, the Chinese ambassador said that China attached “great importance to this situation” and that “the Chinese central government has given firm instructions to the localities in order to improve the mechanisms, methods and conditions of confinement”.", "In a statement published on April 20, 2020, the Chinese embassy in Guinea denied any arrests of its citizens had taken place.", "“Recently, certain online media made noise about articles and videos on 'the arrest of Chinese nationals in Guinea by the Guinean government'. The embassy of China in Guinea attaches great importance to this matter,” the statement said. “Following verification, we have found that these are pure and simple lies. We indignantly protest what is apparent defamation that aims to attack the friendship between China and Guinea and between China and Africa.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]