["A screenshot of an alleged tweet by US Vice President-elect Kamala Harris has been making the rounds on social media. In this tweet, Harris is criticising the Indian government and its handling of the continuing farmers’ protests. Recently, Canadian Prime Minister Justin Trudeau also expressed concern over protests while addressing a gathering of the Indian community. Facebook page Akaal Sahai TV shared a photo of Kamala Harris with the alleged tweet and wrote, “Vice President of America, Kamala Harris in support of #FarmerProtest. Now, what will those criticising Justin Trudeau for supporting the farmers say?”", "New Vice President of USA Kamala Harris Support #FarmerProtest people who were upset on the Justin Trudeau statement in…", "Posted by Akaal Sahai Tv on Tuesday, December 1, 2020", "Similarly, a number of other Facebook users made the same claim.", "ਅਸੀ ਕਿਸਾਨਾ ਦੇ ਸ਼ਾਤੀ ਪੂਰਵਕ ਰੋਸ ਮੁਜਾਹਰੇ ਦਾ ਜੋਰਦਾਰ ਸਮਰਥਨ ਕਰਦੇ ਹਾ ਸਤਿਕਾਰਯੋਗ Honorable PM.JustinTrudeau Canada ਭਾਰਤੀ…", "Posted by Tejinder Dhami on Tuesday, 1 December 2020", "We combed through Kamala Harris’s Twitter profile and found no such tweet posted between November 28 and now. When we searched the text of this tweet, we came across a tweet by Canadian MP Jack Harris which matched word for word.", "We are shocked to see the Indian government’s suppression of farmers protesting new laws which will endanger their livelihood. Instead of using water cannons and tear gas, the Indian government needs to engage in open dialogue with farmers.", "— Jack Harris (@JackHarrisNDP) November 27, 2020", "The original tweet was posted by Jack at 12:45 PM. It is worth noting that an identical timestamp is seen in the viral screenshot too. However, it is clear that Jack’s tweet was edited to pass it off as Kamala’s tweet.", "There is also an error in the morphed screenshot. The time is denoted by ‘AM’ and not ‘am’.", "Furthermore, had the American Vice President-elect posted a tweet such as this, it would have made headlines in both the Indian and American media.", "Donate Now", "A journalist and a dilettante person who always strives to learn new skills and meeting new people. Either sketching or working.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]