["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "From left to right: PA Congressman Tom Marino, PA Congressman Scott Perry and PA Congressman Lou Barletta at a Donald Trump rally. FACEBOOK", "After a failed attempt at health care reform, Republican leaders in Congress are working on reforming tax policy. The U.S. House of Representatives passed H.R. 1, the Tax Cuts and Jobs Act on Nov. 16.", "Rep. Lou Barletta of Pennsylvania’s 11th District tweeted a slew of claims about tax reform a few days before the Senate passed their own tax bill early Saturday morning.", "The following was tweeted on Nov. 29 from Barletta’s account: \"GDP is booming. Let’s spread the prosperity to the middle class with big #TaxCuts. Our #TaxReform package doubles standard deduction, brings $$$ back home, and reduces rates for ALL taxpayers. We will #MAGA.\"", "Barletta, who voted in favor of the House bill, has a list of reasons the legislation could benefit taxpayers. However, we wanted to see if \"ALL taxpayers\" will have reduced tax rates.", "In support of the House bill", "First, we confirmed that Barletta was referring to the House version of the bill in his tweet. One of the major differences between the two bills is the number of income tax brackets and corresponding tax rates.", "The House bill changes the current number of seven tax brackets to four, which would be 12 percent, 25 percent, 35 percent and 39.6 percent.", "On average, each income group will receive a tax cut", "David Jackson, a spokesman for Barletta, sent a report on the House bill by the Joint Committee on Taxation, a nonpartisan committee in Congress, as the source for Barletta’s tweet.", "\"According to the Joint Committee, in 2019, Americans in every income category will see a tax cut,\" Jackson told PolitiFact Pennsylvania.", "The table in the report shows that, on average, each income group will have a reduced effective tax rate in 2019 compared to the current law. But that isn’t what Barletta tweeted.", "Barletta’s tweet made it seem as if every single taxpayer will see a rate reduction, which contradicts a report released by the Tax Policy Center. In 2018, if broken down into quintiles, a little more than 7 percent of individuals will be subjected to an increased tax rate. About 75 percent of individuals will receive a tax cut.", "\"There are specific individuals in each income group that would actually pay higher taxes,\" Howard Gleckman, a senior fellow at the Tax Policy Center, told PolitiFact Pennsylvania.", "In 2018, the percentage of individuals with a tax increase in the lowest income distribution would be 1.7 percent, 6 percent in the second, 9.2 percent in the middle, 11.5 percent in the fourth and 12.9 percent in the top.", "The ‘chained Consumer Price Index’ and ‘bubble rate’ create some tax rate increases", "The House and Senate bill both propose using chained CPI to index standard deductions according to inflation. Standard deductions include $12,000 for single filers, $18,300 for households and $24,400 for joint filers in the House bill.", "Starting in 2018, the chained CPI would also move some individuals into higher tax brackets at a faster pace since bracket cutoffs would be moved in relation to a lower inflation measure. Gleckman said that process will contribute to average tax rates going up by 2027. This will likely increase the percentage of individuals with tax rate increases in 2027 to more than 25 percent compared to the 7 percent in 2018.", "\"What will happen is middle-income people and lower-income people will end up paying slightly higher taxes than they do under current law,\" Gleckman said.", "At first, the bill will increase the effective tax rates of some individuals in the top 1 percent. The \"bubble rate\" put in the bill for individual income rates and brackets would make the top effective tax rates rise to 49.4 percent for some high-income taxpayers, and then fall by 2027.", "\"Over time, the tax rates of the poor and middle class move higher than they were in 2017,\" Temple University economics professor Michael Leeds said, \"while the taxes of the rich and ultra-rich stay below 2017 levels [in 2027].\"", "Our Ruling", "Barletta tweeted that \"ALL taxpayers\" will have reduced tax rates.", "According to the Joint Committee on Taxation, all income categories from less than $10,000 to $1,000,000 and over will receive a tax cut on average. But that doesn’t mean that every single taxpayer will pay less in taxes in 2019. About 7 percent of taxpayers will see their tax rates increase in 2018.", "Barletta’s spokesman clarified that the tweet was in reference to every income category in 2019 under the House bill. However, the wording in the tweet misrepresented the cuts and increases taxpayers will receive that year.", "We rate the statement Mostly False.", "Bloomberg Politics, \"What You Need to Know About ‘Chained CPI’,\" accessed Dec. 5, 2017.", "Bloomberg Politics, \"Revised Tax Bill Would Put People in Higher Brackets Sooner,\" accessed Dec. 5, 2017.", "Congress.gov, H.R.1 – Tax Cuts and Jobs Act, accessed Nov. 30, 2017.", "CNBC, \"How the Senate and House tax brackets compare,\" accessed Nov. 30, 2017.", "CNBC, \"Here are the new tax brackets in the GOP plan,\" accessed Nov. 30, 2017.", "Joint Committee on Taxation, \"Distribution Effects Of The Chairman’s Amendment In The Nature Of A Substitute To H.R.1, The Tax Cuts And Jobs Act,\" Nov. 3, 2017", "Rep. Lou Barletta’s website, \"Barletta votes in favor of historic tax cuts,\" accessed Nov. 30, 2017.", "Tax Foundation, \"Important Differences Between the House and Senate Tax Reform Bills Heading into Conference,\" accesed Dec. 5, 2017.", "Urban Institute-Brookings Institution Tax Policy Center, \"Preliminary Distributional Analysis of the Tax Cuts and Jobs Act,\" accessed Nov. 30, 2017.", "U.S. Government Accountability Office, \"Corporate Income Tax: Effective Tax Rates Can Differ Significantly from the Statutory Rate,\" accessed Nov. 30, 2017.", "Urban Institute-Brookings Institution Tax Policy Center, \"A Bubble with a Bite: The House Tax Bill Implies a 49.4 Percent Top Effective Tax Rate,\" accessed Nov. 30, 2017.", "Email interview with David Jackson, spokesman for Rep. Lou Barletta. Nov. 30, 2017.", "Email interview with Michael Leeds, an economics professor at Temple University. Dec. 2, 2017.", "Phone interview with Howard Gleckman, a senior fellow at the Tax Policy Center, Nov. 30, 2017.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]