["The photo was published here on Facebook on June 30, 2020. It has since been shared more than 180 times.", "The post’s caption reads, in part: “This is Yulin, China. / Dogs and cats are boiled alive, beaten into convulsions, set on fire.... all while being conscious. Many of these animals are stolen from loving families / This photo was taken 6/23/2020.”", "Yulin is a city in southern China’s Guangxi province, which hosts an annual dog meat festival during the summer solstice. Here is an AFP report of the 2020 festival, which went ahead in late June despite the COVID-19 pandemic.", "The photo was also shared here on Facebook; here, here and here on Twitter; and here on Instagram.", "However, the claim is false.", "A reverse image search of the photo in the misleading posts found a similar photo published in this April 26, 2012, article by the US news outlet Huffington Post, headlined: “Caged Chinese Dogs Saved From Cooking Pot After Animal Rescue Steps In (PICTURES)”.", "The report reads, in part: “Chinese activists have rescued hundreds of caged dogs that were due to be slaughtered and served up in restaurants.", "“The activists intercepted a truck carrying the desperate cargo on a motorway in Yunnan Province. On board were found more than 550 dogs packed into around 150 small cages.”", "The photo in the report is credited to Rex Features, a UK-based photo agency now called Shutterstock Editorial.", "A subsequent search found the photo published here on the Shutterstock Editorial website.", "The photo description reads: “Truck full of caged dogs heading for dog meat restaurants stopped, Yunnan Province, China - 19 Apr 2012.”", "Yunnan is a province in southern China.", "Below is a screenshot comparison between the photo in the misleading post (L) and the Shutterstock Editorial photo (R) – AFP has circled identical parts in red:", "The incident was also reported by the Yunnan-based news website GoKunming here on April 24, 2012.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]