["By Saranac Hale Spencer", "Posted on June 27, 2019", "A clip from an old episode of “Law & Order: Special Victims Unit” is being used to discredit a woman who recently accused President Donald Trump of sexual misconduct. The clip doesn’t prove that she is a “fraud,” as the headline of a story claims.", "E. Jean Carroll, a writer and advice columnist, is the most recent woman to accuse President Donald Trump of sexual misconduct. In an excerpt from her upcoming book published in New York magazine on June 21, Carroll described her recollection of how Trump raped her in a department store dressing room in the 1990s.", "The president has denied the allegation, saying in an interview with The Hill: “I’ll say it with great respect: Number one, she’s not my type. Number two, it never happened. It never happened, OK?”", "Now his supporters have begun circulating a roughly 40-second clip from an episode of “Law & Order: Special Victims Unit” in an apparent effort to discredit Carroll.", "The clip shows a character mention role-playing rape at the same department store and one of the first Twitter accounts to share it said: “BUSTED! Trump accuser E. Jean Carroll claimed she was raped in a Bergdorf Goodman dressing room & said yesterday most women think of rape as a fantasy! Here’s a clip from Law & Order of a rape fantasy in the dressing room of THE SAME STORE! What a coincidence! PROSECUTE HER!!”", "Shortly after the clip went up, the website of conservative commentator David Harris Jr. posted a story with this false headline: “Proof That Trump Accuser is a Fraud…Story Came From Law and Order SVU.”", "The David Harris Jr. post doesn’t actually offer any proof to back up the claim that the “Trump accuser is a fraud.” It cites only the clip and says: “Her false Trump rape story that appears in her book came straight from an episode of Law and Order: Special Victims Unit — Episode 11, Season 13. Do you doubt it? The victim was raped in a Bergdorf Goodman, exactly where she said that her rape took place.”", "It’s true that the clip came from that episode of “Law & Order: Special Victims Unit,” which originally aired in 2012. But it actually shows a character describing his various consensual role-playing encounters. This is the entire description he gave: “Role-play took place in the dressing room of Bergdorf’s. While she was trying on lingerie I would burst in.”", "Carroll’s account, however, is detailed over the course of about 1,800 words.", "The popular conspiracy theory site InfoWars also published a story claiming, “Trump rape accuser E. Jean Carroll’s story mirrors almost exactly a plot line from an episode of Law & Order: SVU.”", "That story cites the clip, too, except the plot of the show centered on a rape that happened during a play, not the consensual role-playing mentioned by one character.", "Other versions of the clip have cropped up on Facebook and YouTube, and are accompanied by highly suggestive text that questions Carroll’s allegation without explicitly labeling it false.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "Carroll, E. Jean. “Hideous Men Donald Trump assaulted me in a Bergdorf Goodman dressing room 23 years ago. But he’s not alone on the list of awful men in my life.” The Cut, New York magazine. 21 Jun 2019.", "Fabian, Jordan and Saagar Enjeti. “EXCLUSIVE: Trump vehemently denies E. Jean Carroll allegation, says ‘she’s not my type.’” The Hill. 24 Jun 2019.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]