["The Facebook post was published here on February 21, 2021.", "The image in the post shows Australian Prime Minister Scott Morrison receiving a vaccination at Castle Hill Medical Centre in Sydney’s northwest, as reported here by AFP.", "Morrison was one of the first Australians to receive a Covid-19 vaccine on February 21, 2021, as part of a national vaccination program launch.", "The post’s caption reads: “Scomo [Scott Morrison] allegedly getting ‘the jab’ with one very obvious problem - the cap’s still clearly on it. These publicity stunts are getting sloppy. #nojabnojob”", "Other posts with a similar claim were shared on Facebook here and here.", "The claim is false.", "Video footage and photos of the event clearly show an uncapped needle being inserted into Morrison’s arm.", "Below is an AFP photo of Morrison's vaccination that shows the exposed needle tip.", "Live video footage taken from different angles of Morrison receiving the vaccination was aired on ABC News, 7 News, and 10 News.", "Below are stills of Morrison’s vaccination, also showing an exposed needle tip, as shown on the 10 News footage.", "In response to an inquiry from AFP about the misleading posts, Dr Nigel Grebert from Castle Hill Medical Centre said the needle was uncapped when Morrison received his vaccination.", "“From the photos it’s pretty clear he had a 1ml syringe with a 25 gauge needle attached. Clearly no lid,” he said in an email on February 23, 2021.", "“And if anyone tried it with the cap still on within metres of about a dozen news crew, camera and health professionals it would be absurdly obvious... like worse than [a] C-grade TV show.”", "A Google search of a “25G needle” found listings for hypodermic needles here and here on medical supplies websites. Both show a needle tip is visible above the orange plastic base.", "Guidance from the International Standards Organisation, a medical standards body, states a 25 gauge single-use hypodermic needle is orange.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]