["About this rating", "As political unrest triggered by the May 2020 police-custody death of George Floyd in Minneapolis swept across the U.S., demonstrations and protests soon reached the nation's capital in Washington, D.C. In the first days of June, President Donald Trump and his administration were criticized for the use of tear gas (or similar substances) to disperse nonviolent protesters near the White House in order to allow Trump to engage in a photo-op, posing with a Bible in front of St. John's Church.", "In the days that followed, a photograph said to show troops guarding the Lincoln Memorial in Washington made the rounds of social media. Many viewers questioned whether the photograph was authentic and truly depicted what was described, or whether it was a fake or had been taken from a movie shoot or some type of military exhibition:", "In fact, the photograph was genuine and as described, capturing National Guard troops from the District of Columbia who had been deployed to protect the monument, as described by the Washington Post:", "A photograph of members of the District’s National Guard on the steps of the Lincoln Memorial began racing around Twitter and other social media, as the country was still digesting a violent assault by Secret Service, police and guard troops on peaceful protesters outside the White House. The photo showed troops standing resolutely, perhaps provocatively, on the memorial’s wide and inviting steps, as if they owned it. To many, it symbolized the militarization of Washington, of our government and country, and the terrifying dissolution of old boundaries between partisan politics and the independent, professional military.", "A spokesman for the D.C. National Guard, Senior Master Sgt. Craig Clapper, said the troops seen there were called in to protect the memorial after some minor damage over the weekend, and in response to potential new threats. The D.C. National Guard serves under the authority of the secretary of the Army, and the order to protect the memorial is ongoing. But despite earlier closure of the memorial and the appearance that it is being occupied by soldiers, said Clapper, the public still has access, and the soldiers were not carrying riot shields.", "This photograph, taken by Win McNamee, is captioned by distributor Getty Images as follows:", "U.S. Cities Clean Up Damage As Riots Continue Across The Country", "WASHINGTON, DC - JUNE 02: Members of the D.C. National Guard stand on the steps of the Lincoln Memorial as demonstrators participate in a peaceful protest against police brutality and the death of George Floyd, on June 2, 2020 in Washington, DC. Protests continue to be held in cities throughout the country over the death of George Floyd, a black man who was killed in police custody in Minneapolis on May 25. (Photo by Win McNamee/Getty Images)", "Some critics were displeased with this use of military forces:", "Gjelten, Tom.   \"Peaceful Protesters Tear-Gassed to Clear Way for Trump Church Photo-Op.\"\r\n    NPR.   1 June 2020.", "Kennicott, Philip.   \"The Dystopian Lincoln Memorial Photo Raises a Grim Question: Will They Protect Us, Or Will They Shoot Us?\"\r\n    The Washington Post.   3 June 2020.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]