["About this rating", "McDonald's flipped its iconic \"M\" to form a \"W\" for International Women's Day on social media, and at least one franchise in Lynwood, California turned over their sign for a day to do the same.", "Not every location is changing their physical sign; in fact, we have only seen evidence of one.", "On 8 March 2018, the fast food chain McDonald's participated in celebrating International Women's Day by flipping images of its iconic golden arches upside down, so that instead of forming an \"M,\" it forms a \"W\":", "In the U.S. we’re proud to share that 6 out of 10 @mcdonalds restaurant managers are women. Join us in recognizing the extraordinary contribution of women at McDonald's on #IWD2018: https://t.co/h9hdnOgLqw pic.twitter.com/Ttx6N6zCKV", "— McDonald's (@McDonaldsCorp) March 8, 2018", "Images of the inverted signage spread on social media, prompting some readers to ask whether they were real. McDonald's corporate officials have announced that the chain is indeed flipping its iconic \"M\" to honor women:", "Today we are flipping our iconic @McDonalds logo in honour of women everywhere. #IWD2018 https://t.co/lindNmiyeS https://t.co/qfLQAGc3pD", "— Steve Easterbrook (@SteveEasterbrk) March 8, 2018", "We sent an e-mail asking how many McDonald's franchises would be participating and got no response. However, we can confirm that at least one restaurant in Lynwood, California, and owned by franchisee Patricia Williams has flipped the physical logo. The Los Angeles ABC affiliate KABC took aerial footage of the upturned sign:", "Lynwood @McDonalds flips iconic golden arches into W to honor International Women's Day https://t.co/PZwwCLTkSG pic.twitter.com/SohZXHDZzs", "— ABC7 Eyewitness News (@ABC7) March 7, 2018", "Taylor, Kate. \"McDonald's is Flipping Its Iconic Arches Upside Down in an Unprecedented Statement.\"\r\n  Business Insider. 8 March 2018.", "KABC. \"McDonald's Flips Iconic Arches to Celebrate International Women's Day.\"\r\n  8 March 2018.", "McDonalds.com. \"Today, We Proudly Celebrate International Women's Day.\"\r\n  8 March 2018.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]