["Two decades ago, a group of women’s rights advocates came out with a disturbing warning about professional football’s biggest day: Super Bowl Sunday is also the biggest day of the year for violence against women.", "The claim at a Pasadena, Calif., press conference ahead of the 1993 Super Bowl was backed by groups such as the California Women’s Law Center and Fairness and Accuracy in Reporting, setting off a raft of fearful news headlines and airtime on Good Morning America.", "It wasn’t until a Washington Post reporter interviewed experts about the claim that the truth emerged: The claim was bogus. Even the Old Dominion University researchers whose work was cited as support for the connection said it was wrong.", "But by then it was too late to correct the record.", "The claim has found new life amid cable news coverage of former Baltimore Ravens running back Ray Rice and Minnesota Vikings running back Adrian Peterson. Morning Joe host Mika Brzezinski used it to support her argument that there is a connection between violence at home and aggressive play on the football field on MSNBC’s Morning Joe.", "\"You look at Super Bowl Sunday. Super Bowl Sunday has the highest rate of domestic violence,\" she said Sept. 16. \"There’s something about the game!\"", "Minutes later, she said, \"This is a violent game. And domestic violence on Super Bowl Sunday. We've seen the numbers. Why is that?\"", "The truth is that Super Bowl Sunday is not a unique day for domestic violence, says Callie Rennison, a University of Colorado Denver public affairs professor who studies domestic violence.", "\"This is not to be confused with there being no violence or a lower amount of violence on Super Bowl Sunday,\" Rennison said. \"It happens on holidays, it happens on weekends, and it happens on weekdays.\"", "Rennison sent us a 2007 study published in Human Organization, the journal of the Society for Applied Anthropology, which concluded that the belief that domestic violence crisis calls increase during drink holidays in general, including the Super Bowl, is unsubstantiated.", "Press coverage of the original news conference 20 years ago said a California Women’s Law Center official cited research to bolster her comments. The lawyer, Sheila Kuehl, was reported as citing an academic study that found a 40 percent uptick in police reports of beatings and hospital admissions after Washington Redskins victories between 1988-89.", "But \"that’s not what we found at all,\" Janet Katz, the Old Dominion University criminology professor who worked on the study, told the Washington Post.", "Katz said her \"tentative findings\" did not correlate an increase in ER admissions of women with football games in general or with men upset by a team loss.", "A spokeswoman for MSNBC did not offer comment by deadline.", "Our ruling", "Brzezinski invoked a widely debunked claim that Super Bowl Sunday has the highest rate of domestic violence on Morning Joe.", "It’s no more true now than 20 years ago. Experts say this myth persists in spite of long-lasting academic rebuke.", "We rate it Pants on Fire!", "Washington Post, \"Debunking the 'Day of Dread' for Women; Data Lacking for Claim of Domestic Violence Surge After Super Bowl,\" Jan. 31, 1993 (accessed via Nexis)", "Interview with Callie Rennison, University of Colorado Denver associate professor of public affairs, Sept. 16, 2014", "Snopes, \"Super Bull Sunday,\" updated June 25, 2014", "Boston Globe, \"Super Bowl Gaffe; Groups back off on violence claims,\" Feb. 2, 1993 (accessed via Nexis)", "MSNBC Morning Joe clip, Sept. 16, 2014", "Human Organization, \"Give me shelter: Temporal patterns of women fleeing domestic abuse,\" 2007", "Associated Press, \"Super Bowl Sunday Worst Day of Year for Violence Against Women,\" , Jan. 28, 1993 (accessed via Nexis)", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]