["The Facebook post, on a page named “Airtel Our World”, has been shared nearly 6,000 times since it was published on August 1. We’ve archived the post here. It says the company is handing out 500,000 Apple iPhones to Airtel users “to appreciate all their support so far”.", "We contacted the Airtel Nigeria customer relations centre via social media. They told us the company was not running any such promotion.", "“Please be informed that we currently do not have any ongoing giveaway promo on the Airtel network. Kindly disregard the information,” Airtel said.", "This sort of scam is popular in Nigeria; it is used to attract followers to a new Facebook page and for gathering the names, phone numbers and other personal details of unsuspecting Facebook users.", "According to Facebook’s Page Transparency -- a section which shows “information to help you better understand the purpose of a Page” and “see actions taken by the people who manage and post content” -- the page was created on July 28, 2019.", "In 12 days, the page has racked up more than 12,500 followers by posting pictures of phones and claiming to be giving them out for free. We’ve archived some of the other posts on the page here, here, and here.", "As in some other parts of the world, social media accounts are often sold in Nigeria. After gaining a large number of followers and a degree of influence, the accounts can be sold and used for other purposes.", "AFP found this Facebook page where such accounts are bought and sold.", "The same type of trade exists on Twitter and Instagram -- here’s a screenshot of a tweet announcing the sale of an Instagram account it claims has over 200,000 followers.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]