["By Jessica McDonald", "Posted on March 6, 2020", "Amid criticism over his administration’s response to the coronavirus outbreak, President Donald Trump falsely claimed that he had to overcome an Obama-era Food and Drug Administration “rule” to more quickly provide diagnostic tests to the American people. Experts, however, told us no such formal regulation was ever implemented under the previous administration.", "The outbreak, which began in Wuhan, China, at the end of 2019, has now spread to more than 70 countries, including the U.S. According to a Johns Hopkins University case tracker and a New York Times database, as of March 6, more than 200 people in the U.S. have been infected with the new disease, known as COVID-19, and at least 14 have died.", "The Trump administration has been criticized for its handling of the outbreak, especially the Centers for Disease Control and Prevention’s belated rollout of testing kits. (We’ll explain more of what happened in an upcoming article.)", "But in a March 4 briefing with airline executives at the White House, Trump and other coronavirus task force officials attempted to deflect criticism, suggesting that the lack of available testing was partly President Barack Obama’s fault.", "Trump, March 4: I just want to add, if I might — and to go a little bit further — the Obama administration made a decision on testing that turned out to be very detrimental to what we’re doing. And we undid that decision a few days ago so that the testing can take place in a much more accurate and rapid fashion. That was a decision we disagreed with. I don’t think we would have made it, but for some reason it was made. But we’ve undone that decision.", "Later, CDC Director Robert Redfield followed up, describing the regulatory change as one related to “laboratory developed tests,” or diagnostic tests that are designed, manufactured and performed in the same place, such as in a hospital or academic institution. These tests are different from the ones that the CDC developed and has sent to public health labs across the country.", "Redfield, March 4: [I]n the past, we used to be able to have laboratories that could develop what we call “laboratory developed tests” and then be able to apply them for clinical purposes. And in the previous administration, that became regulated so that, now, for someone to do that, they had to formally file with the FDA. And what the president’s decision did was allow that regulatory relief now and that those university labs and those other labs in this country now can be fully engaged in developing laboratory diagnostics for the clinical arena so the men and women in this nation can get access to — and the doctors — to get to know the extent of [the virus] in the patients that they’re caring for. It’s, really, very important. It’s what’s changed the availability of testing overnight.", "After Redfield’s explanation, Trump then referred to the “Obama rule” again, saying, “we ended that rule very quickly.”", "When asked in a March 5 Fox News town hall whether he blamed Obama, Trump insisted that he didn’t, before claiming again that his administration inherited “some decisions which were not good decisions” and that he “undid some of the regulations.”", "It’s not clear what regulation Trump and Redfield have in mind, and neither the White House, FDA, nor the CDC responded to requests for more information. But experts told us that no such “rule” was implemented under Obama.", "“It’s not true,” said Rachel Sachs, a Washington University in St. Louis law professor, of Trump’s claim in a phone interview. The Obama administration did attempt to impose a risk-based system of regulation on laboratory developed tests, or LDTs, and introduced draft guidance in 2014. But that guidance was never finalized, and was withdrawn after Trump won the election in 2016. “It never went into effect,” she said, “so it’s not an issue to walk back.”", "Citing the withdrawn guidance document, Jeffrey Gibbs of the firm Hyman, Phelps & McNamara, who is an expert on FDA law, also told us that the president’s claim was “not accurate.”", "Erika Lietzan of the University of Missouri School of Law said it was possible Trump and Redfield were thinking of a de facto FDA policy that applies to lab developed tests in emergency situations, such as an outbreak, in which an emergency use authorization, or EUA, is involved.", "To Lietzan, that appears to be most relevant to the new policy the Trump FDA announced on Feb. 29, and which administration officials trumpeted in the briefing. The new policy states that because of the current coronavirus outbreak, the FDA would allow labs to create and use their own in-house tests immediately, without FDA review, as long as they completed an EUA request within 15 days.", "But in this case as well, there is no formal document that Trump needed to rescind to allow labs to create their own coronavirus tests.", "It’s worth explaining that lab developed tests are a bit different than other diagnostics in terms of agency oversight. As Lietzan has explained in a blog post, most other diagnostic tests require FDA clearance before they can be used. In an emergency situation, however, the agency can issue an EUA to forgo that clearance. That’s what was done for CDC’s coronavirus test, which is the test that has been used in the majority of diagnoses so far.", "The CDC’s diagnostic test was sent out to a network of public health labs on Feb. 5 so that states and cities could do testing. But because of a faulty ingredient in the kits, some labs could not perform the tests, and testing was delayed. Allowing health departments, medical facilities and diagnostic companies to create their own diagnostic tests to screen specimens on site or through the mail could increase the capacity and speed of testing.", "The FDA generally does not require clearance for lab developed tests, which are created and run in the same location, but does request that labs get agency authorization in the form of an EUA in an emergency situation.", "Former Trump FDA Commissioner Scott Gottlieb explained in a Twitter thread the rationale, noting that in such an emergency, the government wants to be sure that the diagnostic works. “Precision matters,” he wrote. “False negative results can have significant adverse consequences.”", "The policy of asking LDT makers to get an EUA in an emergency, however, is not written into law, and has simply been FDA practice. As Lietzan told us in an email, “this is a ‘request’ from FDA — not a requirement in the formal legal sense.” In fact, she said there is an entire legal debate over whether the FDA can regulate lab developed tests at all.", "Again, Trump didn’t need to rescind any rule to legally allow the lab developed tests. It’s not clear whether the de facto policy originated under Obama. Lietzan said she did not know, and neither did Gibbs.", "Lietzan said because the FDA website does ask labs to submit their tests for review, the Trump administration may have wanted to create the new policy to reassure test makers that they had a green light. In that way, she thought Trump’s and Redfield’s claims might have a “kernel of truth while being misleadingly imprecise and somewhat exaggerated.”", "As was pointed out in the Fox News town hall, even if Trump thought there was a bad LDT regulation, he could have changed it at any point in his presidency, or earlier in the outbreak. When asked about that, Trump said he was preoccupied with other things, “like trade and millions of other things,” and claimed his administration took action on testing kits “as soon as we found out.”", "In any case, Trump is wrong to claim that he “ended” any “rule.” The larger legal debate aside, the policy — if that is indeed what he was referencing — has not been undone; it is only for coronavirus LDTs that the FDA has clarified there’s a carve out.", "And Gibbs said that the agency always had the option of issuing an EUA to a test maker anyway. Obama, he said, gave LDTs emergency use authorizations during the Zika outbreak. The Trump administration “may well deserve credit for acting more rapidly,” he said, but the idea that a lab could not get an EUA, he said, “is incorrect.”", "Gottlieb noted this in his Twitter thread. Asking labs to inform the FDA and get an EUA, he wrote, “doesn’t mean we can’t have labs offer tests to diagnose COVID-19.  FDA can grant an EUA to a laboratory to run a coronavirus test at a single site, or can authorize a common protocol for multiple laboratories to collaborate.”", "Gibbs was puzzled by the administration’s stance. “I still do not know what LDT-related policy Trump believes has been altered,” he said.", "Based on Redfield’s description, Sachs, the Washington University in St. Louis law professor — who has written about LDTs for years — said that the CDC director appeared to be talking about the Obama administration’s 2014 draft guidance. “Because that never went into effect, there was nothing for the FDA to roll back this past weekend,” she said.", "And even if he’s referring to the wonky situation with LDTs with an EUA — which may or may not have been changed under Obama — she said, “there’s certainly not an affirmative guidance document or other regulatory action that we can point to from that administration that needed to be walked back.” She said the statement was false.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]