["About this rating", "On 5 November 2016, the Empire Herald web site published an article reporting that Hillary Clinton's campaign had paid Jay-Z and Beyonce $62 million to perform a concert in support of her election bid:", "Beyonce and Jay Z performed for “free” at the Get out the Vote concert last night for Hillary Clinton. However, sources revealed that the power couple was paid $62 Million to perform.", "According to sources closely connected with the power couple, Clinton and her campaign flew Beyonce and Jay Z out to a private meeting to discuss the election. With Hillary lacking the African-American voting numbers that Barack Obama had during his 2008 presidential, the Clinton campaign made a quick and desperate move in their final efforts to secure African-American votes.", "“Jay and Beyonce got a call a few weeks ago from Clinton. She invited them for a weekend stay at a luxury hotel to meet regarding the election. Before Jay Z or Beyonce could voice any concerns or ask questions, Hillary pulled out a check. Beyonce saw the check first and her eye lit up like Christmas lights. On the last day of the meeting, Hillary told said to everyone, including Jay Z and Beyonce, “We definitely got the black vote now.”", "While Jay-Z and Beyonce (as well as Chance the Rapper and Big Sean) did perform a concert in Cleveland in support of Hillary Clinton's campaign, the rumor that they were paid $62 million for the show originated with the Empire Herald, a fake news web site.", "The Empire Herald has previously published fictional stories claiming that a man committed suicide after it was announced that Harriet Tubman would be featured in the $20 bill, that a woman was arrested for pleasuring herself with a Happy Meal toy, and that a man was arrested after carving \"Black Lives Matter\" into the skin of 19 women.", "The Empire Herald has removed their disclaimer, which previously stated that \"much of the content contain on our website is consider satirical in nature unless otherwise specified.\"", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]