["A video of a woman beating and abusing a toddler has taken social media by the storm. Users are claiming that the video is from Mumbai’s Dadar area. It shows the woman pouring hot candle wax on the baby. The video is being circulated with appeals to share it widely along with demands for the woman’s arrest. On September 5, a Twitter user shared the clip tagging the handle of the Prime Minister’s Office.", "Another Twitter user posted this video with the hashtags #dadar and #mumbai.", "Pakistani news channel Ary News had published an article on September 8 stating that the video was taken in Delhi. We also noticed that Mirror Now had published a report about the video from its New Delhi desk. However, there was no mention of where this incident had occurred in its report.", "This slideshow requires JavaScript.", "When we did a keyword search on Google, we came across a report by India Today dated August 30. It stated that this incident had taken place in Bengaluru. It also mentioned that the woman beating the child was actually his grandmother. The woman tried to burn the 2-year-old child with a candle, in addition to attacking his mouth, chest and stomach. According to the report, the woman had been arrested for torturing the child after the video surfaced.", "According to a report by The News Minute published on August 29, the 2-year-old child had been brutally beaten up by his grandmother in the SG Palya area of ​​Bengaluru. The report mentions that Hazira, the mother of the child, had gone to her maternal home with the toddler. Here, Hazira gave birth to her fifth child. Her remaining three children lived with their father Irshad. The 2-year-old child was crying while asking for his father. Seeing all this, Mubbashira, the maternal grandmother of the children, began beating her grandson and inflicting burns on him.", "The article quoted Ramesh, a police inspector from the SG Palya area, who revealed that Mubbashira regularly beat the toddler. She also tried to burn the child’s face and body, due to which the minor suffered serious injuries. As a result, the 2-year-old had also lost consciousness. Hazira called her husband Irshad who immediately rushed there and got the child admitted to the hospital.", "According to the report, Irshad filed a complaint against Mubbashira and Hazira under IPC Sections 326 and 23 following the incident. The police arrested Mubbashira in this case. They did not arrest Hazira because her fifth child was still 20 days old at the time and she was taking care of him. The responsibility of looking after the 2-year-old victim had been given to his father Irshad. According to the police, the child was no more in danger.", "To sum it up, a video of a woman beating up her 2-year-old grandson from Bengaluru was shared as Mumbai’s Dadar. Meanwhile, a Pakistani news channel had reported on this incident incorrectly stating that it happened in Delhi. Netizens sharing the video had also been calling for the arrest of the woman. In reality, she had already been taken into custody by the police on August 29.", "Donate Now", "Kinjal Parmar holds a Bachelor of Science in Microbiology. However, her keen interest in journalism, drove her to pursue journalism from the Indian Institute of Mass Communication. At Alt News since 2019, she focuses on authentication of information which includes visual verification, media misreports, examining mis/disinformation across social media. She is the lead video producer at Alt News and manages social media accounts for the organization.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]