["About this rating", "In early 2018, a number of far-right Facebook pages and disinformation sites recirculated variations of an outdated and exaggerated claim about a Tennessee school district banning the American flag from campus.", "The specifics of the claim varied from page to page (some said that students were banned from flying the flag; others claimed that the flag had been banned from campus because it was offensive to certain students), but all iterations included an image of the flag and some version of the question: Do you agree that we should always be able to fly the flag?", "Three of these four Facebook posts claimed that this Tennessee School District had \"recently\" banned the American flag from campus. However, these posts are referring (inaccurately) to an incident that took place more than two years earlier, in August 2015, and the Tennessee school district referenced never banned the American flag to begin with.", "In 2015, the Dickson County School District temporarily ruled to not allow students to fly flags from their vehicles. At the time, the removal of Confederate flags from public grounds was a hot issue in the media. When at least one student in this district came to school with a Confederate flag on their truck, the school responded by telling students that they were no longer allowed to fly flags from their vehicles across the board:", "Dickson County School District officials want to clarify the system's stance on flying flags after a weekend in which the school district was thrown into the ongoing nationwide flag debate.", "Flags are not banned, said Schools Director Dr. Danny Weeks. However, flags are not allowed to fly on school vehicles and cannot be worn as clothing, such as draped over a student like a cape.", "School officials arrived at the decision on the first day of school, Aug. 3.", "The nationwide Confederate flag-flying controversy erupted shortly after the June 17 shooting death of nine people in an African-American church in Charleston, S.C. The accused shooter, Dylann Roof, 21, posted several photos online posing with a handgun and the Confederate flag.", "The school district's decision stirred up considerable controversy at the time, as some media outlets reported that the school had banned American flags wholesale. However, as the school district has clarified on numerous occasions, it never banned flags from campuses, and this \"rule\" was an informal one relayed to students in an attempt to inform them about how to properly display the American flag.", "In a long explanation published by the district in the wake of this controversy, officials explained that the American flag could be flown from vehicles if it was properly displayed, since it did not serve as a distraction. Furthermore, students would be allowed to bring flags to campus as long as it was done so respectfully:", "As school started in Dickson County on August 3, it followed a summer of controversy and concern over symbols and questions that led our country to become divided, distracted, and disrupted. Student behaviors at one of our schools on the first day of school led to parent reports at the Central Office concerning such symbols being in the parking lot of our schools. This matter was appropriately addressed and expectations were communicated to our students in order to prevent distractions or disruptions to our learning environment. The school also took the opportunity to speak to students about proper respect and appropriate display of the American flag. A particular student behavior that was addressed included flags being brought to sporting events by students and used in a manner which was not respectful. The behavior included wearing the American flag around the waist and or tying it around the neck to wear as a cape. At this same time the ROTC instructors who teach color guard, flag etiquette and flag protocol have suggested that vehicles in a parade must follow a certain protocol if they choose to post a flag on the vehicle. It is also suggested that it may not be appropriate to post a flag in a vehicle while moving at 55 mph. According to our ROTC instructors there are some veterans who would be offended the American Flag would be treated in such a manner.", "[...]", "The truth of the matter is the American flag flies in Dickson County at every school and district building, the Pledge of Allegiance is recited daily, and our students are being taught proper respect and appropriate display of the American flag. We want to ensure our parents and students that we are looking to only address student behaviors that distract, disrupt, or divide our mission of education. While we may not agree on how appropriate it may be to display an American flag behind a moving vehicle, this action does not distract, disrupt or divide. In fact it may assist us in unifying students toward our mission of academic success; therefore, we will not look to address issues involving the American flag any further. In addition the dress code may define what is to be worn on shirts, but beyond this requirement there are no restrictions on students bringing the American flag on campus.", "This controversy is not just inaccurate, but also outdated.", "Henderson, Nia-Malika.   \"Inside the Battle Over the Confederate flag.\"\r\n    CNN.   24 June 2015.", "McCrummen, Stephanie.   \"Confederate Flag Comes Down on South Carolina’s Statehouse Grounds.\"\r\n    Washington Post.   10 July 2015.", "My Fox Memphis.   \"Tennessee School District Bans All Flags, Including American Flag.\"\r\n    23 August 2015.", "The Daily Herald.   \"Dickson County Schools Clear up Flag Controversy.\"\r\n    25 August 2015.", "Dickson Country School District.   \"Dickson Co Schools' 1,700-Word Reply to Flag Controversy.\"\r\n    27 August 2015.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]