["Rashtriya Janata Dal (RJD) tweeted a video of booth capturing alluding that it took place in the recently-concluded Bihar elections where the party lost to NDA. “Such elections are held under the supervision of the election commission,” read its tweet shared against the backdrop of RJD’s allegations of foul play in the counting of postal ballot papers in 2020 Bihar polls.", "देश में चुनाव अयोग्य की देखरेख में अब ऐसे चुनाव होते हैं! pic.twitter.com/Y9OdlhQzX1", "— Rashtriya Janata Dal (@RJDforIndia) November 16, 2020", "The same video was earlier shared with a Hindi caption that said, ”This is the condition of our polling booth. It is being claimed that this video shows voting fraud in Bihar elections.” The video depicts an election polling station room where women are standing in a queue to cast their votes. When they approach the EVM machine, a man enters the booth.", "यह है हमारे पोलिंग बूथ का हाल! इस वीडियो को “बिहार वोटिंग मतदान में धांधली” का बताया जा रहा है अगर यह सच है तो इस पर संज्ञान लिया जाए।@ndtv @ndtvvideos @ECISVEEP @abhisar_sharma @yadavtejashwi pic.twitter.com/hJI3Myh0Mo", "— محمد زبير الدهلوي (@MohdZub74951158) November 12, 2020", "This video is also shared on Facebook", "Poling booth", "Posted by Ummar Matuvayil on Tuesday, November 10, 2020", "Alt News has received requests to fact-check the video on WhatsApp (+91 76000 11160) and on our official Android application.", "This slideshow requires JavaScript.", "Alt News performed a reverse image search with the help of InVID and found the same video posted by a Twitter user on May 12, 2019.", "What the is this? Is this what we call democracy? pic.twitter.com/XFuvq5dD1m", "— Ravi Nair (@t_d_h_nair) May 12, 2019", "In the same thread, he attached a tweet of the district election office of Faridabad which said that the man was taken under arrest.", "Prompt action taken. FIR lodged. Person behind bars. Observer enquired the matter personally and is satisfied that polling was never vitiated.", "— DISTRICT ELECTION OFFICE FARIDABAD (@OfficeFaridabad) May 12, 2019", "NDTV published an article on May 13, 2019, according to which this incident happened during the 2019 Haryana Lok Sabha Election. The Faridabad election office said the polling agent was trying to influence “at least three lady voters” and that senior election officials visited the booth. The man was subsequently arrested.", "Therefore, an old video of polling in Haryana during 2019 Lok Sabha elections is falsely viral as voter fraud in the recently-concluded Bihar elections.", "Donate Now", "Aqib is monitoring and researching mis/disinformation at Alt News", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]