["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Texas State Sen. Donna Campbell, R-New Braunfels, said local government debt in Texas has increased by 40% in five years. Is that true? (DEBORAH CANNON / AMERICAN-STATESMAN)", "Property taxes have been front and center at the Texas Legislature this year, with lawmakers debating proposals to constrain property tax rates while still leaving wiggle room for local governments to raise the money they need to operate.", "State Sen. Donna Campbell, R-New Braunfels, took to Twitter to voice her concern over rising property taxes and to vouch for two of her bills.", "\"Local Government debt in Texas has increased nearly 40% in the past 5 years,\" Cambell wrote in a tweet. \"This trend is raising Texans’ property taxes. I filed SB 462 & SB 1090 to make it harder for cities to borrow unsustainable debt that leads to higher property taxes.\"", "We were curious about the first part of her claim — has local government debt really increased by nearly 40% in the past five years?", "Debt issued vs. debt outstanding", "Campbell’s spokeswoman Alice Claiborne said the number came from the 2018 Local Government Annual Report produced by the Texas Bond Review Board, a state board comprising Gov. Greg Abbott, Lt. Gov. Dan Patrick, Comptroller Glenn Hegar and House Speaker Dennis Bonnen, R-Lake Jackson, that oversees debt and debt financing across the state.", "These annual reports, produced by the board’s staff, look at trends in local government debt and include data from cities and counties and from school, health, water and community college districts, as well as from other special districts.", "Claiborne pointed us to a specific line in the report, which says that, over the past five fiscal years, \"local government debt issuance\" has increased 38.6%, rising to $32.65 billion in fiscal 2018.", "Case closed, right? Not so fast.", "Several debt and budget experts said Campbell’s tweet refers only to debt, which could leave the impression that she is talking about the growth in total debt held by local governments, or debt outstanding, which has actually increased at a much lower rate.", "The same report shows that over the past five fiscal years, outstanding debt held by local governments has grown 17.7% to about $230 billion at the end of the 2018 fiscal year.", "Debt issuance, the value Campbell’s staff pointed to, is the total principal amount of debt sold. Debt outstanding is the principal owed over the remaining life of all debt issues, according to a glossary from the comptroller’s office.", "\"I think the difference is subtle,\" said Bill Fulton, director of the Kinder Institute for Urban Research at Rice University, in an email. \"Clearly, local debt issuance grew by almost 40%. But local debt outstanding grew by only 17% because of refinancing, payoffs, etc.\"", "Fulton said the accuracy of Campbell’s statement depends on how the viewer interprets her remark, but added that he read her tweet as referring to outstanding debt.", "\"But that’s just the way I look at it,\" he said.", "Jon Oliver, Campbell’s chief of staff, defended her remark and rejected the idea that her claim is inaccurate due to different interpretations of the word debt.", "\"I would add that however it might be inferred, what she wrote was not inaccurate,\" Oliver said in an email. \"I understand different folks may interpret things differently. That’s also the nature of a tweet.\"", "Oliver also noted that both pieces of legislation referenced in Campbell’s tweet — Senate Bills 462 and 1090 — are about bond elections, or new debt.", "Both bills would change the election process involving local bond proposals. One would require bond propositions on ballots to include more details, and the other would require a two-thirds majority of voters to approve bond propositions affecting property taxes.", "While both bills are about debt issuance, the analysis accompanying both proposals references how new bonds contribute to outstanding debt and in turn affect property tax rates.", "In fact, the analysis for Senate Bill 462 includes a statement that mirrors the language Campbell used in her tweet — but it explicitly refers to outstanding debt.", "\"Outstanding local bond debt in Texas has dramatically increased in recent years, contributing to the rapid rise of property taxes,\" the analysis reads.", "The analysis for Senate Bill 1090 discusses the need for property tax rates to generate \"sufficient revenue to provide payment of debt service on outstanding and projected General Obligations debt.\"", "Given the status of both bills and what little time remains in this year’s legislative session, both proposals are unlikely to be adopted.", "Narrow scope offers better analysis", "Eva DeLuna Castro, a budget analyst at the Center for Public Policy Priorities, said she would not have guessed that Campbell’s remark was about new debt as opposed to debt outstanding, even after looking at the legislation referenced in the tweet.", "Given the focus on how debt impacts property taxes, DeLuna Castro said Campbell should have narrowed her focus to look at tax-supported debt as opposed to outstanding debt in total, which includes revenue-supported debt.", "\"That’s the part of debt that matters as far as property taxes are concerned,\" she said in an email. \"Revenue-backed debt is paid off in other ways – user fees, customer charges (like for a utility), sales taxes, etc.\"", "Outstanding tax-supported debt held by local governments has increased 21.2% in the past five years, to $150.22 billion; new tax-supported debt issued by local governments has increased by 32.3% in the past five years.", "Rob Latsha, director of the Texas Bond Review Board, and Braxton Parsons, a policy analyst at the board, said they would look at outstanding debt in the scenario Campbell described. And even then they would restrict their analysis to general obligation debt, which is backed by the credit and taxing power of a local entity.", "If Campbell insisted on looking just at debt issuance, Latsha and Parsons said she should have looked just at new money and excluded issuance used to refund existing debt.", "During fiscal 2018, the board’s report showed that more than 36% of local debt issuance was used to refund debt.", "Both Latsha and Parsons also warned that it is tricky to draw conclusions about how increases in debt might impact property taxes by using numbers found in their annual reports, since all local governments are lumped together and the report does not account for things like local property values and tax rates.", "Our ruling", "Campbell said local government \"debt in Texas has increased nearly 40% in the past 5 years.\"", "Campbell's staff said she was referring to an increase in the amount of debt issued by local governments, which has increased about 38% in the past five years. But experts said her tweet was imprecise and left the impression that she was referring to outstanding debt, which has increased about 17% in the past five years.", "Plus, experts said looking at an increase in overall debt issued by local governments is not the best way to analyze how debt impacts tax rates.", "We rate this claim Half True.", "Texas Bond Review Board, Local Annual Reports, 2011-2018, accessed May 16, 2019", "Texas Comptroller, Debt Glossary, accessed May 16, 2019", "Texas Legislature Online, Senate Bill 462, accessed May 16, 2019", "Texas Legislature Online, Senate Bill 1090, accessed May 16, 2019", "Email interview with Alice Claiborne, spokeswoman for Campbell, May 16, 2019", "Email interview with John Oliver, chief of staff for Campbell, May 16, 2019", "Email interview with Eva De Luna Castro, budget analyst at the Center for Public Policy Priorities, May 16, 2019", "Phone interview with Rob Latsha and Braxton Parsons of the Texas Bond Review Board, May 20, 2019", "Phone interview with Tracy Gordon, Senior Fellow at the Urban-Brookings Tax Policy Center, May 21, 2019", "Email interview with Bill Fulton, director of the Kinder Institute for Urban Research at Rice University, May 22, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]