["By Eugene Kiely", "Posted on January 27, 2020", "President Donald Trump falsely claimed in a tweet that the House Democrats “never even asked John Bolton to testify” in their impeachment inquiry. The Democrats asked, but Bolton refused to voluntarily appear.", "Trump tweeted about Bolton, his former national security adviser, early on the morning of Jan. 27 — not long after the New York Times reported that Trump told Bolton he wanted to freeze security aid to Ukraine until it agreed to investigating the Democrats, including former Vice President Joe Biden. The Times cited people who had read drafts of a manuscript for Bolton’s book as its source, and said Bolton’s lawyer blamed the White House for disclosing the book’s content.", "Trump has denied the claim on Twitter, saying he “NEVER told John Bolton that the aid to Ukraine was tied to investigations into Democrats.”", "In another tweet, Trump said the senators shouldn’t ask Bolton to testify during the Senate trial, because the House Democrats didn’t ask him to testify during the impeachment inquiry.", "The Democrat controlled House never even asked John Bolton to testify. It is up to them, not up to the Senate!", "— Donald J. Trump (@realDonaldTrump) January 27, 2020", "That’s false.", "On Oct. 30, Daniel Noble, an attorney for the Democrats on the House intelligence committee, sent an email and a letter to Bolton’s attorneys with the subject line “Deposition Request — House Impeachment Inquiry.” The email said that the attached letter requests “the appearance of your client, Ambassador John Bolton, at a deposition, which is being transmitted to you pursuant to the House of Representatives’ impeachment inquiry.”", "A few hours later, attorney Charles J. Cooper acknowledged receipt of “the letter from the House chairs inviting the Ambassador to appear voluntarily at a deposition at the Capitol on November 7.” However, Cooper added: “As you no doubt have anticipated, Ambassador Bolton is not willing to appear voluntarily.”", "A House intelligence committee official told the media that the committee would not subpoena Bolton.", "“We regret Mr. Bolton’s decision not to appear voluntarily, but we have no interest in allowing the administration to play rope-a-dope with us in the courts for months,” the unnamed official said in a statement. “Rather, the White House instruction that he not appear will add to the evidence of the president’s obstruction of Congress.”", "A day after Bolton failed to appear, Bolton’s personal attorney sent a letter to House General Counsel Douglas N. Letter “suggesting that, if Ambassador Bolton were subpoenaed, he would file a lawsuit and would comply with the subpoena only if ordered to do so by the court,” as explained in the House impeachment report (on page 232).", "Bolton has since changed his mind. On Jan. 6, he posted a statement on his website that said he would testify — if asked by the Senate.", "“The House has concluded its Constitutional responsibility by adopting Articles of Impeachment related to the Ukraine matter. It now falls to the Senate to fulfill its Constitutional obligation to try impeachments, and it does not appear possible that a final judicial resolution of the still-unanswered Constitutional questions can be obtained before the Senate acts,” Bolton wrote. “Accordingly, since my testimony is once again at issue, I have had to resolve the serious competing issues as best I could, based on careful consideration and study. I have concluded that, if the Senate issues a subpoena for my testimony, I am prepared to testify.”", "The question now is: Will the Senate vote to allow any witnesses to testify? That would require at least 51 votes, but the Republicans control the Senate with 53 votes. The Democrats would need all 45 Democrats, two independents and at least four Republicans to support a motion to call witnesses.", "At least two Republican senators — Sens. Mitt Romney and Susan Collins — indicated they are more likely to vote for witnesses in light of the reports on Bolton’s book.", "The impeachment trial in the Senate entered its seventh day on Jan. 27. Trump’s legal team is expected to wrap up its case Jan. 28, and then senators will be allowed to submit written questions for the House managers and the Trump defense team. The Senate will take questions for up to 16 hours, before moving to a vote on witnesses later this week.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]