["About this rating", "The laws on taking \"ballot selfies\" vary from state to state.", "Posting a picture of one's completed ballot on social media sites such as Snapchat, Instagram, Twitter, and Facebook has become a popular activity on Election Day in recent years. However, many voters who have pondered doing so have been warned away by claims that taking a photograph of a ballot and posting that picture online is illegal and/or will potentially invalidate the poster's vote, which has prompted a number of inquiries from our readers about whether this is so.", "The answers to questions about whether it is illegal to photograph a ballot and post the results on the Internet, and what the penalties are for doing so, are \"It depends.\" Regulations regarding voting procedure in the U.S. are set at a state level (or lower), so laws in this area vary quite a bit from place to place. In most states, however, it is the case that voters who upload photographs of their ballots to the Internet could indeed be risking criminal penalties:", "\"It's a very unusual case,\" says Jeffrey Hermes, the deputy director of the Media Law Resource Center in New York. \"Usually banning political speech would be a violation of the First Amendment. But with photography at polling places, there's an intersection of two fundamental aspects of democracy: freedom of speech and the integrity of the voting process.\"", "Hermes breaks it down this way: Suppose you were a nefarious character who wanted to skew the voting process in some way. You could buy votes, but you'd want proof that people actually voted like you told them to. You could mislead people who don't understand the voting process or don't speak English well. You could intimidate other voters into voting like you do.", "In these cases, photos from inside the voting booth would really help you, the nefarious character, perpetrate election fraud. And so, many states have just banned those photos categorically. In this narrow circumstance, they've indicated, there's something more essential to democracy than free speech.", "Rather than taking the chance that you live in a state where there are no penalties for posting ballot selfies, you might want to err on the side of caution and just not do it. Or, you can scroll down the list of states that have restrictions or ambiguities around their regulations for ballot selfies, both at the polling booth and for mail-in ballots.", "If your state isn't listed, ballot selfies are allowed.", "Last updated: Oct. 26, 2020", "ALABAMA: Mostly yes, but with restrictions. In Alabama under SB128 (2019), voters are restricted from taking a photograph of a ballot other than the individual’s own ballot, and violating this rule is classified as a Class A misdemeanor. The legislation does “not prohibit a voter from making available a photograph of the voter’s own ballot on the Internet or in some other electronic medium.” The secretary of state’s website says, “use of the phone in the polling place should not disturb other voters or disrupt the polling place.”", "ALASKA: Yes, but it’s complicated. A statute that technically prohibited voters from posting pictures of their ballots existed well before smartphones and social media, and according to state officials was largely unenforceable, as many Alaskans have been posting ballot selfies anyway. According to the statute: “a voter may not exhibit the voter's ballot to an election official or any other person so as to enable any person to ascertain how the voter marked the ballot.” This has been amended to state that it does not apply to voters who — subject to the prohibition of political persuasion within 200 feet of polling places — “shares a photo, video, or other image of the voter's marked ballot with another person or with the public.”", "ARIZONA: Mostly no, with the exception of mail-in ballots. Arizona passed a senate bill in 2015, prohibiting photography within a 75-foot limit around polling places, making voting booth ballot selfies illegal. However, a voter can display an image of their ballot on the internet that was received by mail and not taken in the voting location.", "DELAWARE: It’s unclear. The state has no law addressing the ban on selfies, but the state’s election commissioner said in 2018 that signs would be posted banning cellphone use at polling places. The commissioner also said that they could not necessarily control “what happens behind the curtain.” A spokesperson from the Office of the State Election Commissioner confirmed that cell phone usage is not permitted in the polling place.", "GEORGIA: No. The law prevents photographs of ballots according to Ballotpedia. A spokesperson at the secretary of state’s office confirmed that no photography is allowed of a ballot in the voting area and even of absentee ballots.", "ILLINOIS: Largely, no. According to the Illinois Election Code, anyone who knowingly marks his ballot or casts his vote “so that it can be observed by another person” is guilty of a Class 4 felony, which carries a prison sentence of at least one year.", "IOWA: Yes, but with a caveat. Iowa prohibits the display of voted ballots if it interferes with the integrity of elections. The secretary of state’s office told us photographs are allowed as long as “they don’t interfere with another voter’s ability to cast their ballot.” From their election laws: “The use of photographic devices and the display of voted ballots is prohibited if such use or display is for purposes prohibited under chapter 39A, interferes with other voters, or interferes with the orderly operation of the polling place.”", "MARYLAND: No, but with some exceptions. Voters are not allowed to use electronic devices like a cell phone or camera at a polling place. A spokesperson from the State Board of Elections told us that voters cannot take selfies with their ballots at the polling booth and post it on the internet. The spokesperson added that voters can take a picture of themselves mailing their absentee ballots, but cannot reveal the contents of the ballot itself.", "MASSACHUSETTS: No. State law says, “Whoever [...] allows the marking of his ballot to be seen by any person for any purpose not authorized by law [...] shall be punished by imprisonment for not more than six months or by a fine of not more than one hundred dollars.” This language would discourage voters from posting selfies from the voting booth. Photos of mailed ballots are also banned.", "MISSISSIPPI: No. Voters are prohibited from taking pictures of their marked ballot according to an October 2020 press release from the secretary of state. While they don’t specify if this applies to mail-in ballots, the secretary of state’s office told us, “all ballots in Mississippi are treated equally.\" They also cited Mississippi law: “Any voter who shall, except as provided by law, allow his ballot to be seen by any person [...] shall be punished by a fine of not less than $25 nor more than $100.”", "MISSOURI: No. The secretary of state’s office stated that “taking photos of incomplete or completed ballots is prohibited.” The specific law says that a voter “allowing his or her ballot to be seen by any person with the intent of letting it be known how he or she is about to vote or has voted,” counts as a Class 4 offense.", "NEVADA: No. It is unlawful to interfere with election conduct through “unauthorized delivery, receipt, identification, display or removal of ballot.\" Per NRS 290.730, a voter cannot “show his or her ballot to any person, after voting, so as to reveal any of the names voted for.”", "NEW JERSEY: No. New Jersey law states: “no person shall within the polling room mark his ballot in a place other than in the polling booth or show his ballot [...]\" Breaking this rule is considered a criminal offense.", "NEW MEXICO: Yes, but with a small restriction. The secretary of state’s office confirmed that the law states, “A voter may, on the voter's own initiative and using whatever form of communication or media chosen by the voter, voluntarily communicate any information” regarding who they voted for, or any other information regarding how they marked their paper ballot. But voters taking photographs have to ensure that no one else is in the photo without their permission, and someone else’s ballot should not be in the shot.", "NEW YORK: Yes, but with limitations. New Yorkers can take a selfie with their ballots as long as they don’t reveal any information. The law prohibits a person from showing “his ballot after it is prepared for voting, to any person so as to reveal the contents, or solicits a voter to show the same.”", "NORTH CAROLINA: No, with a small exception. According to the law, “No person shall photograph, videotape, or otherwise record the image of a voted official ballot for any purpose not otherwise permitted under law.” But this does not apply to ballots that have not been filled out yet.", "OHIO: No. Voters are not allowed to display their marked ballots to anyone. The law states it is a felony to allow one's ballot to be seen by another, “with the apparent intention of letting it be known how the elector is about to vote.”", "PENNSYLVANIA: Yes, but with limitations. Voters have a First Amendment right to take a ballot selfie but are not permitted to reveal information on the ballot, or anyone else’s ballot. In 2016, Pennsylvania officials recommended that voters post the ballot selfie after they left the polling place. The law states that electors are prohibited to allow their ballot “to be seen by any person with the apparent intention of letting it be known how he is about to vote.”", "SOUTH CAROLINA: No. State law prohibits voters from showing their ballot to another person, and the use of cameras is not allowed in the polling booth.", "SOUTH DAKOTA: No, but with exceptions. Voters are not allowed to publicize an official ballot after it has been marked by them, according to a spokesperson from the secretary of state’s office. The law states, “No person may publicize an official ballot after it is marked to any person in such a way as to reveal the contents of the official ballot, or the name of any candidate for whom the person has marked a vote.” Voters can, however, take selfies in the polling booth as long as they don’t make the contents of their ballot visible. They can also take photographs of themselves with their absentee ballots without showing their votes.", "TENNESSEE: It’s unclear. Photos and videos are banned in the polling place, but the state’s law doesn’t address mail-in ballots. Tennessee code states, “Any voter using a mobile electronic or communication device as allowed in subsection (a) shall be prohibited from using the device for telephone conversations, recording, or taking photographs or videos while inside the polling place.” We reached out to the secretary of state’s office and will update this post if we receive more information.", "TEXAS: No, but mail-in ballots are fair game. According to state law, “A person may not use any mechanical or electronic means of recording images or sound within 100 feet of a voting station.” But this does not prevent voters from posting their mail-in or absentee ballots.", "WEST VIRGINIA: No, but mail-in ballots are fair game. Voters are prohibited from entering “a voting booth with any recording or electronic device in order to record or interfere with the voting process.” But nothing in the law prohibits photos of mail-in ballots.", "WISCONSIN: No. Electors are prohibited from showing “his or her marked ballot to any person.”", "Illinois General Assembly.   “(10 ILCS 5/) Election Code.”\r\n   Accessed 20 October 2020.", "Leg.state.fl.us.   “The 2020 Florida Statutes.”\r\n   2020.", "Leg.state.nv.us.   “Title 24 - Elections.”\r\n   Accessed 20 October 2020.", "Legis.state.pa.us.   “Pennsylvania Election Code.”\r\n   Accessed 20 October 2020.", "Lexis Nexis.   “Tenn. Code Ann. § 2-7-142.”\r\n   Accessed 20 October 2020.", "National Conference of State Legislatures.   “Secrecy of the Ballot and Ballot Selfies.”\r\n   27 February 2020.", "MAlegislature.gov.   “Section 25: Distinguishing marks; false statements or oaths.”\r\n   Accessed 20 October 2020.", "Martinson, Erica.   “Can I Post a Selfie From the Ballot Booth? Bring a Gun? And Other Questions About Voting in Alaska.”\r\n   Anchorage Daily News.   8 November 2016.", "Mass.gov.   “Selfies in the Voting Booth.”\r\n   3 November 2016.", "Maryland, The State Board for Elections.   “Rules and Information for Voters.”\r\n   Accessed 20 October 2020.", "Missouri Revisor of Statutes.   “Title IX Suffrage and Elections.”\r\n   7 November 2018.", "Ncleg.gov.   “§ 163-166.3. Limited Access to the Voting Enclosure.”\r\n   Accessed 20 October 2020.", "NJ.gov.   “NJSA 19:34-7 Violation of ballot regulations.”\r\n   Accessed 21 October 2020.", "Park, Catherine.   “Ballot selfies: Here is a List of States Where you Can Take a Photo With Your Ballot.”\r\n   Fox10 Phoenix.   20 October 2020.", "Safronova, Valeriya.   “Should You Take a Ballot Selfie?”\r\n   The New York Times.   16 October 2020.", "Sos.alabama.gov.   “Frequently Asked Questions.”\r\n   Accessed 20 October 2020.", "Sos.alabama.gov.   “Secretary Merrill Encourages Voters to Take a “Ballot Selfie.”\r\n   13 July 2020.", "Sos.state.al.us.   “SB128.”\r\n   28 May 2019.", "South Carolina Election Commission.   “Are “Ballot Selfies” Legal? Can I Take a Picture of my Ballot and Share it With Others?”\r\n   Accessed 20 October 2020.", "Statutes.capitol.texas.gov.   “Election Code.”\r\n   Accessed 20 October 2020.", "The Alaska State Legislature.   “CSHB 7(STA): \"An Act Relating to the Exhibition of Marked Ballots and the Prohibition on Political Persuasion Near Election Polls.\"”\r\n   Accessed 19 October 2020.", "The Associated Press.   “Ballot Selfies: A Look at Where They are Allowed or Not.”\r\n   23 October 2016.", "The New York State Senate.   “Section 17-130: Misdemeanor in Relation to Elections.”\r\n   Accessed 20 October 2020.", "West Virginia Legislature.   “West Virginia Code: Chapter 3: Elections.”\r\n   2017.", "Wisconsin State Legislature.   “Chapter 12: Prohibited Election Practices.”\r\n   Accessed 20 October 2020.", "White, Chris.   “Are Voting Selfies Legal? We Have the Answers in All 50 States.”\r\n   Law & Crime.   7 November 2016.", "Y’all Politics.   “Runoff for September 22nd Special Elections – Election Day Reminders.”\r\n   13 October 2020.", "Wisconsin State Legislature.   “Chapter 12: Prohibited Election Practices.”\r\n   Accessed 20 October 2020.", "Y’all Politics.   “Runoff for September 22nd Special Elections – Election Day Reminders.”\r\n   13 October 2020.", "Arizona Secretary of State’s Office, Elections Services Division.   “Arizona Elections Procedures Manual.”\r\n   December 2019.", "Ballotpedia.   “Ballot Selfie Regulations by State.”\r\n   September 2020.", "Codes.ohio.gov.   “3599.20 Prohibitions Concerning Ballots Generally.”\r\n   Accessed 20 October 2020.", "Holson, Laura M.   “Are Voting Selfies Legal? Not Always.”\r\n   The New York Times.   6 November 2018.", "Hope, Brittany.   “From 'Ballot Selfies' to Attire, Here's What you Need to Know Before You Go Vote.”\r\n   KOAT Action News 7.   24 October 2020.", "General Assembly of Iowa.   “Election Laws of Iowa.”\r\n   2020.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Nur Nasreen Ibrahim is a reporter with experience working in television, international news coverage, fact checking, and creative writing.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]