["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "After video footage of the fatal shooting of Ahmaud Arbery, a 25-year-old black man who was jogging in February in Brunswick, Ga., drew outrage across the country, two men — Gregory McMichael and his son Travis McMichael — were charged with murder and aggravated assault in the killing.", "But recent Facebook claims purporting to link Gregory McMichael with Georgia Gov. Brian Kemp have the wrong guy.", "\"This is Gregory McMichael with the governor of Georgia,\" the post says. \"Notice his hat? He is a former police officer and the father of Travis McMichael. Travis McMichael murdered Ahmaud Arbery, an unarmed black man, out for a jog. Notice the hat?\"", "The photo shows Kemp with a thumb up and his other arm around a man wearing a hat supporting President Donald Trump, a Kemp sticker and a T-shirt that says \"Allah is not God.\"", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Gregory McMichael is a former police officer, and he worked as an investigator in the local district attorney’s office. A police report said that after Arbery ran past him on a residential street, he and Travis McMichael grabbed two guns and followed Arbery in a truck, according to a story in the New York Times. The Georgia Bureau of Investigation has said that Travis McMichael shot and killed Arbery.", "But the man who appears in the photo with Kemp is James Stachowiak, a man the Council on American-Islamic Relations called \"a violent anti-Muslim extremist\" when the group posted the image on Facebook in October 2018.", "At the time of the photo, Kemp, a Republican, was in a close race for governor against Democrat Stacey Abrams. A campaign spokesman responded to critics who wanted Kemp to apologize for the photo by saying Kemp \"takes hundreds of photos a day while traveling the state. It’s ridiculous to think he should be held responsible for the beliefs of every person who wants to snap a picture with him.\"", "The Atlanta Journal-Constitution reported that Stachowiak is well-known to law enforcement and civil rights groups. In 2016, for example, Georgia Capitol police put out a notice warning he was planning an unauthorized, anti-Islam rally to shred the Koran, according to the newspaper.", "We rate this Facebook post claiming Stachowiak is Gregory McMichael False.", "Facebook post, May 6, 2020", "The New York Times, 2 suspects charged with murder in Ahmaud Arbery shooting, May 7, 2020", "CAIR Facebook post, Oct. 26, 2018", "Atlanta Journal-Constitution, Critics blast Kemp for posing for photo with anti-Muslim extremist, Oct. 26, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]