["Libertarian presidential nominee Gary Johnson scoffs at Donald Trump’s call for the U.S. should build a wall on the southwest border to keep immigrants out.", "\"Undocumented workers crossing the border right now is at a 12-year low,\" Johnson, a former New Mexico governor, said in an Aug. 29 interview with the Richmond Times-Dispatch editorial board.", "We wondered if Johnson’s claim about a dramatic decrease in border crossings is correct.", "Joe Hunter, the Libertarian nominee’s director of communications, pointed us to a December 2014 report written by the Pew Research Center, a nonpartisan group that takes no position on immigration policy.", "Mexican border detentions", "Pew’s report says 229,000 Mexicans were apprehended at U.S. borders in 2014. That, Pew said, was a steep drop from 2007, the year the Great Recession began, when 809,000 Mexicans were detained at the border.", "A graphic in the Pew study shows the 2014 Mexican immigrant border detentions was the lowest it’s been, not just during the past 12 years but for any year in the early 2000s, the 1990s and 1980s.", "Also in 2014, the Border Patrol apprehended 257,000 non-Mexicans, making it the first year on record that detentions of non-Mexicans outpaced those of Mexicans trying to cross into the U.S., the Pew report said.", "\"This shift is another sign that unauthorized immigrants from Mexico are crossing the U.S.-Mexico border significantly less often than they did before the Great Recession,\" Pew’s study says.", "The trend of fewer Mexican border detentions continued in 2015, the latest full fiscal year. In that year, the agency apprehended 188,122 Mexicans trying to cross illegally, Border Patrol figures show. That’s the lowest level during the past 12 years.", "You may have noticed that all of these figures focus on \"apprehensions.\" It would not take into account illegal workers who come across the border without drawing notice from authorities.", "Immigration analysts have told PolitiFact numerous times that there is no perfect comprehensive measure of people entering the U.S. illegally.", "As our colleagues at PolitiFact Texas put it: \"There’s no direct indicator of illegal immigration. Folks don’t report in.\"", "In the absence of definitive data, experts use the apprehension figures to get an idea of border-crossing trends. The U.S. Border and Customs Enforcement says its apprehension figures are \"an indicator of total attempts to cross the border illegally.\"", "The figures Johnson’s campaign cites focus on apprehensions around the entire U.S. border, including the border with Canada. The vast majority - some 98 percent - of Border Patrol apprehensions occur along the southwestern border, according to agency figures. Also, his campaign’s response further zeroes in on apprehensions of Mexicans caught while trying to cross the border.", "But Johnson, during the editorial board interview, referenced not just Mexicans but all undocumented immigrants living in the U.S. That suggests that the border crossings for all illegal immigrants is at a 12-year low.", "Border crossings by all immigrants", "Looking at all detentions around the entire U.S. border, the Border Patrol says it apprehended 337,117 people trying to get into the U.S. in fiscal 2015, which ended last Sept. 30. That was the lowest level in decades.", "But if you look at the southwestern border, Johnson’s statement hits a snag. In 2011, Border Patrol agents reported apprehending 327,577 border-crossers there, a bit lower than 2015.", "PolitiFact National on July 26 rated Mostly True a statement by Rep. Luis Gutierrez, D-Ill., who said that southwest border crossings have been at the lowest level in 30 years. PolitiFact noted that the 2011 figure creates a wrinkle for such a broad claim. Still, some researchers told PolitiFact that they gave Gutierrez the benefit of the doubt.", "\"Given the uncertain ratio between apprehensions and actual crossings, it would be fair to call 2015 and 2011 a statistical ‘tie,’\" Jacob L. Vigdor, a professor at the Evans School of Public Policy and Governance at the University of Washington, told PolitiFact.", "These figures only go through fiscal 2015, which ended in September that year. We’re still in the midst of fiscal 2016, and updated information about the fiscal year has been released in the weeks since that fact-check was published. It shows the number of apprehensions at the southwest border has surpassed the total for all of fiscal 2015.", "The Border Patrol keeps a running month-to-month tally of apprehensions along the southwest border. Through July of this fiscal year, 332,360 people have been apprehended along the border. That’s just a tad higher than last fiscal year, but there’s still a couple months of the 2016 apprehension figures to go.", "In recent years, about 50,000 to 60,000 apprehensions occur in the last couple months of the fiscal year, meaning this year is on pace to end at around 400,000 apprehensions at the southern border. That still would be lower than eight of the past 12 years. But that 400,000 level would be higher than in fiscal 2011, 2012 and 2015.", "Steven Camarota, director of research at the Center for Immigration Studies, which advocates tighter immigration controls, told PolitiFact in July that there really is no way to know for sure if the number of people illegally crossing the border is less than in recent decades.", "Camarota also said apprehensions are a weak way to measure new illegal immigration, because it doesn’t count visa overstays. Experts estimate that one-third to one-half of illegal immigrants aren’t people who crossed the border but instead came into the U.S. on visas and overstayed.", "Our ruling", "Johnson said, \"Undocumented workers crossing the border right now is at a 12-year low.\"", "There is no comprehensive set of figures that can definitively say how many people come across the border illegally, when taking into account both people who get caught and people who evade authorities. Still, experts and Border Patrol officials do look at figures on border apprehensions to get an idea of the level of crossings along the U.S.-Mexico border.", "Johnson points to a drop in illegal border crossings from Mexican immigrants to justify his statement, and it’s true that in fiscal 2015, the latest full fiscal year, the number of Mexican immigrants apprehended at the southern border was the lowest during the past 12 years.", "But Johnson’s statement suggests that we’re seeing a historic low in all illegal immigrants coming across the southern border. His statement requires some clarification in that there are a couple years when there were lower levels of apprehensions.", "Still the former New Mexico governor has a point that the level of apprehensions currently is at a relative low point compared with the past dozen years.", "On balance, we rate his claim Mostly True.", "Gary Johnson’s comments to the Richmond Times-Dispatch, Aug. 29, 2016. (His statement is at 25:30 into video).", "Email from Joe Hunter, director of communications for the Johnson-Weld campaign, Aug. 31, 2016.", "PolitiFact, \"Rep. Gutierrez says fewer people crossing border than in last 30 years,\" July 26, 2016.", "PolitiFact Texas, \"Barack Obama, in Austin, says illegal immigration at 40-year low,\" March 17, 2016.", "PolitiFact Florida, \"Obama says illegal border crossing attempts are at lowest point since 1970s,\" Nov. 25, 2014.", "PolitiFact, \"Trump says number of illegal immigrant families crossing border this year exceeds 2015 total,\" July 21, 2016.", "Pew Research Center, \"Apprehensions of Mexican migrants at U.S. borders reach near historic low,\" April 14, 2016.", "U.S. Border Patrol, \"Southwest border illegal alien apprehensions by fiscal year,\" accessed Aug. 31, 2016.", "U.S. Customs and Border Enforcement, \"U.S. Border Patrol apprehension data,\" accessed Aug. 31, 2016.", "U.S. Customs and Border Enforcement, \"CBP Border security report,\" Dec. 22, 2015.", "U.S. Customs and Border Enforcement, \"Sector profile -- Fiscal year 2014,\" accessed Aug. 31, 2016.", "U.S. Border and Customs Enforcement, \"United States Border Patrol Southwest family unit subject and unaccompanied alien children apprehensions, fiscal year 2016,\" accessed Sept. 1, 2016.", "PolitiFact, \"Trump says number of illegal immigrant families crossing border this year exceeds 2015 total,\" July 21, 2016.", "Richmond Times-Dispatch, \"Libertarian presidential candidate Gary Johnson at RTD: Deporting 11M undocumented immigrants would bring ‘economic catastrophe,’\" Aug. 29, 2016.", "Pew Hispanic Center, \"Statistical portrait of the foreign born population in the United States,\" April 19, 2016.", "Pew Research Center, \"What we know about illegal immigration from Mexico,\" Nov. 30, 2016.", "Email from Carlos Diaz, spokesman for the Southwest border branch of U.S. Customs and Border Enforcement, Sept. 21, 2016.", "Pew Research Center, \"More Mexicans leaving than coming to the U.S.,\" Nov. 19, 2015.", "PolitiFact Virginia, \"Ken Cuccinelli says half of illegal immigrants have overstayed visas,\" May 16, 2016.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]