["The EFF said that 10 children dying disproved the theory that young people were less susceptible to contracting the virus. We checked.", "In criticising an earlier government decision to open up South African schools, the Economic Freedom Fighters said that 10 children dying from Covid-19 “completely” disproved the theory that young people were less susceptible to contracting the virus.", "While children can contract the virus, they generally get less sick – but this doesn’t mean that some children won’t die, experts say, most likely those with comorbidities.", "Total number of deaths is not an accurate measure of how likely children are of becoming infected. Incidence rates show markedly less infection in children than adults, particularly those under 10.", "Cyril Ramaphosa told South Africans on 23 July 2020 that public schools would close again for four weeks.", "Schools were initially closed from 18 March, during a country-wide lockdown to battle the novel coronavirus. They started gradually opening up in early June, first allowing grade 1s and matriculants – students in their final year of high school – to return. The government’s initial decision to reopen schools drew widespread criticism and court cases.", "The country’s third largest political party, the Economic Freedom Fighters (EFF), called the decision “homicidal”.", "“According to recent statistics, at least 10 South African children between the ages of 10 and 19 have died from Covid-19,” the EFF said in a statement released on 2 July.", "They went on to claim the deaths “completely disprove[d] the notion that young people and children are less susceptible to contracting the virus”.", "Were they right? We checked.", "As of 23 July, 408,052 cases of Covid-19 and 6,093 deaths had been recorded in South Africa.", "“No one sensible has claimed that children cannot become very sick or die from this illness,” Prof Maia Lesosky, biostatistician and professor of epidemiology at the University of Cape Town, told Africa Check.", "The most recent breakdown of Covid-related deaths by age group was released by the country’s department of health on 1 July, the day before the EFF released their statement.", "It showed that of the 2,749 deaths recorded at the time, three deaths were of children under nine and seven deaths were of children aged between 10 and 19. In total, children accounted for 0.4% of all deaths. (Note: Africa Check has repeatedly asked the department for the most recent statistics. We will update this report when we receive them.)", "“I don't think the fact that some children have sadly died from this illness ‘completely disproves’ anything, as they still make up a small proportion of total deaths in South Africa,” said Lesosky.", "According to a team of global health scientists and infection preventionists at the Meedan Digital Health Lab, a public health information hub that explains complex health and medical science, the number of children who have died “is not a very good measure of a population's risk of contracting the virus”.", "“In trying to understand how the number of deaths vary between populations, it's best to compare the mortality rate (number of deaths in relation to the overall population), because simply looking at the number of deaths does not account for differences in the size of populations.”", "Epidemiologists look at a combination of factors to determine risk such as the number of hospitalisations, the proportion of the population that has the disease at any given moment and the number of new cases over a given time period.", "South Africa’s National Institute for Communicable Diseases (NICD) released a report on laboratory-confirmed Covid-19 cases in children 18 and younger between 3 March and 7 June. It was published on 30 June.", "During this time, there were 52,991 confirmed cases of Covid-19 in all age groups. Of these, 3,025 (6%) were in people aged 18 and younger. In comparison, this age group makes up 35.1% of the total population.", "The NICD report concluded that “similar to data from other countries, the burden of Covid-19 disease is lower in young children compared to adults”.", "“At a population level fewer children, compared to adults, will experience serious disease,” said Lesosky.", "Dr Glenda Gray, chief executive of the South African Medical Research Council, agreed: “At a global level, and in South Africa, children have much better outcomes than adults. A death, hospitalization or admission into an intensive care unit is a rare event, even in South Africa.”", "She said children with severe cases of Covid-19 generally have comorbidities, underlying medical conditions that put them at increased risk", "The NICD report found that of the children admitted to hospital with Covid-19, 7% were admitted to intensive care units (ICU) and 1% died. This was lower than in adults, where 13% of admitted patients ended up in ICU and 14% died.", "“There is definitely a much lower risk of serious disease in children under ten,” Prof Keith Neal, a UK-based epidemiologist from the University of Nottingham specialising in infectious diseases, told Africa Check. “So the risk of serious disease is quite clear and that’s generally agreed.”", "The Meedan Digital Health Lab told Africa Check that the incidence rate is a more accurate measure of how likely a certain population is to be infected. An incidence rate tracks what proportion of an initially disease-free population develops the disease over a specified time period.", "“This is a far more accurate measure of how likely a person in a population is to get infected compared to the number of deaths within a population.”", "The latest statistics, released for the week ending 11 July, show that children still have a lower incidence risk of infection than adults. The NICD calculates the “cumulative incidence risk” by looking at the number of cases per 100,000 people in various age groups.", "The mean – a measure of average – cumulative incidence risk was reported at 470 cases per 100,000 people for all age groups. The age group with the highest cumulative incidence risk was the 50 to 54 group, at 679.9 cases per 100,000.", "Children’s incidence risk, in comparison, ranged from 56.9 per 100,000 to 195.4.", "While the incidence risk provides some insight, Lesosky told Africa Check that when used alone it is not conclusive. She said detailed epidemiological investigations and widespread testing is required.", "“Ideally you would want to be able to follow groups of people over time who started off unexposed to SARS-CoV-2 [the virus that causes Covid-19] and then test them regularly to find out who became infected and when,” she explained.", "She added that because such studies are complex and expensive to carry out, epidemiologists often rely on testing data to estimate rates of infection, like those published by the NICD.", "“Measuring infections in children is difficult because children are much less likely to develop symptoms,” Prof Mary-Ann Davies, a public health medicine specialist and paediatric clinical epidemiologist at the University of Cape Town, told Africa Check.", "She added that in some areas of South Africa, like the Western Cape province, children with symptoms are only eligible for testing if they have comorbidities.", "South African political party the EFF claimed that the death of 10 children from the novel coronavirus “completely disproves” that children are less susceptible to the virus. We rate this claim “incorrect”.", "Experts say the number of deaths is not an accurate measure of how susceptible a population is to Covid-19. Deaths need to be considered in relation to the size of the population.", "The incidence rate, which shows the proportion of a population that develops the disease over time, is a better measure. Both local and international data shows that children have lower rates of infection than adults. This suggests that children may be less susceptible to contracting the virus.", "But children’s true susceptibility to the virus can only be accurately determined with widespread epidemiological testing, which has not yet been done in South Africa.", "Please complete this form to receive the HTML sharing code.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "For democracy to function, public figures need to be held to account for what they say. The claims they make need to be checked, openly and impartially. Africa Check is an independent, non-partisan organisation which assesses claims made in the public arena using journalistic skills and evidence drawn from the latest online tools, readers, public sources and experts, sorting fact from fiction and publishing the results.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "© 2023 - Africa Check - All rights reserved.", "We will never charge you for verified, reliable information. Help us keep it that way by supporting our work.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "Support independent fact-checking in Africa."]