["About this rating", "On 20 May 2017, Daily USA Update claimed that the son of Representative Trey Gowdy had been found dead in Washington, D.C. dumpster:", "WORSE THAN HITLER! Trey Gowdy’s Son Found In A Dumpster In DC! Murders Are Being Questioned!", "You have probably heard the news about Trey Gowdy’s son that he has disappeared. Well, as we said that we will keep you updated with this story, it’s time to tell you that Terrence Vaughan Martin Gowdy, the 8-year-old son of Try, was found dead in a dumpster in DC.", "Well, it seems that the dumpster belong to the new Trump Hotel, which only indicates that either the murderers are trying to frame to our President, or they want to send a message to him and his family. Little Terrence disappeared earlier today from the Capitol building, and didn’t manage to make it fat [sic] before his young life was shut by forces of globalist.", "The highly newsworthy story was nowhere to be found on credible news sites. But well-known hoax purveyor Last Line of Defense carried a similar version of the story:", "Terrence Vaughan Martin Gowdy, Trey Gowdy’s 8-year-old son, was found dead in a dumpster in DC. The dumpster happened to belong to the new Trump Hotel, which is either a feeble attempt to frame the President or a message to him and his family. Little Trey, who went missing earlier today from the Capitol building, didn’t make it far before his tender young life was cut short by forces of globalist evil looking to keep the most righteous congressman in Washington silent.", "Although Daily USA Update is sparse and doesn't appear to provide any background information about its purpose, Last Line of Defense is a fake news site whose disclaimer reads:", "DISCLAIMER: America’s Last Line of Defense is a satirical publication that uses the imagination of liberals to expose the extreme bigotry and hate and subsequent blind gullibility that festers in right-wing nutjobs. We present fiction as fact and our sources don’t actually exist. Names that represent actual people and places are purely coincidental and all images should be considered altered and do not in any way depict reality.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]