["An image that appears to show an Egyptian passport for the mummy of the ancient pharaoh Ramesses II had been shared tens of thousands of times in multiple Facebook and Twitter posts alongside a claim the passport was issued so the mummy could be transported to France for preservation treatment in 1979. The claim is false; the image was digitally created for representative purposes and published on an archaeology blog.", "The photo was published here on a Facebook page with more than 215,000 followers on September 10, 2020. It has been shared more than 20,000 times.", "The caption reads: “In 1974 Pharaoh's mummy, Ramesses II, was sent on a flight to Paris for preservation and maintenance work. But since French law required every person, living or dead, fly with a valid passport, the Egyptian government was forced to issue a passport to Pharaoh, 3,000 years after his death.”", "Ramesses II was the third pharaoh of the 19th Dynasty of Egypt who ruled the ancient kingdom for much of the 13th century BCE.", "The image was also published in English on Facebook here, here, here and here; on Twitter here, here, here and here; in French on Twitter here and here; and on Instagram here.", "A different version of the image was also published on Facebook here and in Arabic here.", "The claim is, however, false.", "Close examination of the image found text under the barcode that reads: “HERITAGEDAILY.COM”.", "A keyword search on Google  found the same image published here on Heritage Daily, a blog that focuses on archaeology, anthropology, palaeoanthropology and palaeontology, on March 25, 2020. The article is titled: “The passport of Ramesses II”.", "The photo’s caption reads: “Image Credit – HeritageDaily – An artist’s creation of the passport – Image is for representative purposes – The actual passport is not publicly available.”", "Below is a screenshot comparison of the misleading post (L) and the photo published on Heritage Daily (R):", "The blog owner, Marcus Milligan, told  AFP on October 12, 2020 that he made the illustration in 2018 and published it again in 2020 due to data loss.", "The transfer of the mummy of Ramesses II from Egypt to France was reported by the Antenne 2 TV network and The New York Times on September 28, 1976.", "The mummy was transferred to Paris for a treatment of a mysterious disease linked to a fungus infection. Upon its arrival, the Garde Republicaine, France's equivalent of a Marine honor guard, presented a military honour to the former King, according to The New York Times report.", "Valéry Giscard d'Estaing, the president of the French Republic between 1974 and 1981, explained that he convinced the then-Egyptian leader Anwar al-Sadat for the transfer of the mummy by promising him that the late Pharaoh would be treated \"like a sovereign\", as documented in Ramses II: The Great Journey, a documentary published in 2011.", "Neither reports from Antenne 2 and the New York Times, nor the documentary make any mention of a passport being issued for the mummy of Ramesses II.", "Élisabeth David, the documentary studies officer in the Department of Egyptian Antiquities in the Louvre Museum, told AFP on October 12, 2020 that the claim about the existence of a passport had no basis.", "She explained that the confusion might be due to a report published by the National Museum of Natural History in 1985, in which the archaeologist Christiane Desroches-Noblecourt pointed out it is required to obtain a \"passport\" in order to bring the mummy of Ramesses II out of Egypt.", "\"Of course the French government does not ask a deceased king to present a passport, this term [instead] suggests the extreme complexity of the organisation\", she told AFP.", "Mathieu Touzeil-Divina, a professor of public law at France's Toulouse 1 University Capitole also told AFP on October 13: \"There is no compulsory passport in French law for non-living human persons.\"", "\"In case of transfers, mummies are considered under classical property law. The term 'passport' is therefore false, but it is true that some antiques require authorisation to be transferred out of the country”, he explained.", "Mummies are classified as \"objects\" by the European Court of Justice, according to this judgment dated October 10, 1985.", "\"Before the 2000s, mummies were generally considered to be objects, although there is no specific legislation on the subject,\" said Laure Cadot, preventive conservation specialist and author, during an interview with AFP on October 13, 2020.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]