["By Angelo Fichera", "Posted on December 12, 2019", "A popular social media meme alters the words of satirist Andy Borowitz. His statement, from 2016, was critical of now-President Donald Trump — not of Trump’s rival, Hillary Clinton.", "Andy Borowitz’s satirical column in the New Yorker, “The Borowitz Report,” uses the tagline: “Not the news.”", "A popular meme circulating on social media that purports to quote Borowitz is deserving of a similar disclaimer: “Not his words.”", "The meme, which has surfaced on Facebook and Instagram, includes a photo of Borowitz and an erroneous quotation about “stopping Hillary” Clinton.", "“Stopping Hillary is a short-term solution,” the bogus meme reads. “The long-term solution — and it will be more difficult — is fixing the educational system that has created so many people ignorant enough to vote for Hillary.”", "Both references to “Hillary” are in red and, as it turns out, for good reason: The statement Borowitz really made wasn’t about Clinton, but about her 2016 presidential campaign rival, now-President Donald Trump.", "Borowitz made his statement in a post to his verified Facebook page in 2016. It reads: “Stopping Trump is a short-term solution. The long-term solution, and it will be more difficult, is fixing the educational system that has created so many people ignorant enough to vote for Trump.”", "Borowitz has been continuously critical of Trump.", "As we have written before, misattributed quotations often circulate online, using the popularity of high-profile figures to spread political messaging.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "Borowitz, Andy. “Stopping Trump is a short-term solution. The long-term solution, and it will be more difficult, is fixing the educational system that has created so many people ignorant enough to vote for Trump.” Facebook. 4 Nov 2016.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]