["About this rating", "On 18 February 2016, partisan web site Occupy Democrats published an article reporting that the Southern Poverty Law Center is warning against hate speech infiltrating political rhetoric:", "In a report released today the Southern Poverty Law Center (SPLC) announced officially what has repeatedly been made plain to anyone who listens to the demagogic crop of Republican presidential candidates: the GOP has become the nation’s leading advocate for right-wing hate, and their rhetoric is fueling a dangerous rise in hate groups. The SPLC’s annual report on domestic extremism released today found that right-wing hate and anti-government organizations grew by 14% last year to some 1,900 individual groups.", "And, crucially, the SPLC identifies the divisive hate-fueled rhetoric of the Republicans as a key source of increasing right-wing extremism; while the ranks of right-wing groups grew significantly after president Obama’s election, their numbers had been on the decline in recent years until demagogic fear-mongering racists like Donald Trump and Ted Cruz seized the mainstream stage to exhort the Republican base to turn on such convenient scapegoats as Muslims and Mexicans. As SPLC President Mark Potok put it, “We have real enablers in the political mainstream who are helping the ideas of the radical right grow. We are living in an era of incredible political irresponsibility.”", "The title of the Occupy Democrats piece states that the SPLC (a nonprofit group whose stated goal is to combat hate and discrimination and increase tolerance) had outright labelled the GOP as a hate group, which misled many readers.  Kristen Bokenkamp, the communications director for SPLC, confirmed that they had made no such announcement:", "The SPLC has not named the Republican Party a hate group, and has no plans of doing so.", "The SPLC released its annual report documenting the activity of hate groups in the United States on 17 February 2015. While the report named 892 active hate groups in the United States, the Republican party was not listed under any ideology, such as anti-LGBT, anti-Muslim, anti-immigrant, antigovernment, radical traditional Catholicism, or general hate.", "However, the Southern Poverty Law Center did warn that certain GOP officials have exposed these extreme opinions of these hate groups to a wider audience:", "The demonization of Muslims, Latinos, immigrants and others became commonplace in 2015. Presidential candidate Donald Trump made headlines with a call for a temporary ban on Muslim immigration and his description of Mexican immigrants as rapists and drug dealers. He even cited a bogus “poll” by the Center for Security Policy that falsely claimed that a quarter of American Muslims support violent jihadists such as the members of the Islamic State.", "The Center for Security Policy is one of two anti-Muslim groups listed as hate groups for the first time in this year’s report. The other is ACT! for America.", "While the Southern Poverty Law Center didn't call the GOP a hate group, they did say that some of the extreme views of hate groups have been reiterated by certain members of the Republican Party and that extremism is on the rise, creating an atmosphere of polarization that may be unmatched since the late 1960s.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]