["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Donald Trump was on the cover of the New York Daily News for his tax hike proposal on Nov. 10, 1999.(ABC News/New York Daily News)", "Republican candidates continue to attack Donald Trump on his past positions, claiming he is not the conservative he says he is today.", "Jeb Bush picked up the attack by taking on Trump over tax policy.", "\"I cut taxes every year,\" Bush said at an Aug. 20 rally in New Hampshire. \"He’s proposed the largest tax increase in mankind’s history, not just our own country’s history.\"", "The next day Bush repeated the basic claim in a fundraising email: \"Trump proposed enacting the largest tax increase in American history.\"", "Seems like something worth fact-checking.", "Trump’s tax plan in 1999", "A spokesman for Bush told us that the former Florida governor was referring to Trump’s 1999 proposal to raise taxes on the rich.", "Trump, who at the time was considering a run for president under the Reform Party, proposed a one-time tax on individuals and trusts with a worth of $10 million or more. Trump said the one-time tax of 14.25 percent would raise $5.7 trillion and wipe out the debt. Trump said if the rich were having trouble liquidating their assets they could pay off their tax over 10 years.", "The New York Daily News featured a photograph of Trump with the words, \"SOAK THE RICH.\"", "Experts at the time bashed Trump’s plan as economically and politically unviable.", "\"I don't think the plan makes much economic sense,\" said Stephen Moore, director of fiscal policy studies at the libertarian Cato Institute told the New York Times in 1999. \"The fact is that most people's wealth that has been built up over 10, 20 or 50 years is wealth that has already been taxed.\"", "Daniel Mitchell, a senior fellow at the Heritage Foundation in 1999 said of Trump’s plan at the time, \"The lunacy of this idea is almost indescribable.\" He raised concerns about the economic consequences including that households would shift assets overseas to try to avoid confiscation.", "Trump calculated that 1 percent of Americans would pay the Trump tax. He proposed that half the savings would go toward middle-class tax cuts and the other half for Social Security.", "A spokeswoman for Trump’s 2016 presidential campaign, Hope Hicks, wouldn’t tell us if Trump still supports that plan and said that he will release his current tax plan later in September.", "But in 2011, talk show host George Stephanopoulos asked Trump if he still supported that tax, and Trump said it was no longer viable.", "\"Well, at a time, it would have paid off the deficit. I mean, you wouldn't have a deficit, at that time,\" Trump said (though he confused debt and deficit). \"Unfortunately, the world has changed, today you can't do it. Today, and I'm very strongly against tax increases. And the reason I'm-\"", "\"So, you're no longer for that tax?\" Stephanopoulos asked.", "\"No, no. I'm no longer for that tax, no,\" Trump said.", "Would Trump’s tax have broken records?", "Many tax experts told us that indeed Trump’s plan would have been record-breaking in terms of revenue, but they said it was never going to happen and lacked major details.", "\"It certainly would have been the biggest ever simply because of its sheer size -- it was trillions of dollars,\" said Roberton Williams, a fellow at the Tax Policy Center. However, \"it’s a totally crazy idea. ...  I don't think anybody was taking it seriously -- it was Donald Trump being Donald Trump.\"", "The United States’ gross domestic product in 1999 was $9.7 trillion, so if Trump’s tax had raised $5.7 trillion, that would have been 59 percent of GDP, said Chris Edwards of the libertarian Cato Institute.", "Federal tax hikes typically are no more than 1 percent of GDP, Edwards said.", "\"The Bush 1990 hike and Clinton 1993 hike were less than 1 percent of GDP over 5 years —  whereas Trump’s tax would have been 59 percent one time in one year,\" Edwards said.", "PolitiFact previously has looked into the largest tax increases as a percentage of GDP. Topping the list from 1940-2006 was the Revenue Act of 1942, which was about 5 percent of GDP.", "Richard Phillips, an expert at the Citizens for Tax Justice research group, which aims to require the wealthy to pay their fair share, said that Trump’s one-time tax proposal can’t be compared to conventional tax reform, which typically refers to taxes collected annually.", "\"His estimate was based on a back of the envelope calculation of total wealth of individuals with over $10 million in assets multiplied by the 14.25 percent rate,\" he said. \"There are very real questions as to whether you could plausibly tax all forms of wealth and whether wealthy individuals would be able to take action to shield large swaths of their wealth from taxation.\"", "Additionally, Trump proposed repealing the estate tax and enacting other tax cuts using the revenue that the federal government would save by no longer paying interest on the national debt. It’s not clear how much those tax cuts would have cost and how much of the tax they would offset over time, Phillips said.", "Our ruling", "Bush said, \"Trump proposed enacting the largest tax increase in American history.\"", "Yes, in 1999, Trump proposed a historically large one-time tax increase. Trump said the tax would have raised $5.7 trillion and wiped out the national debt. It would have applied only to the wealthiest Americans.", "This claim rates True.", "Tampa Bay Times The Buzz blog, \"Jeb Bush tries to undercut Donald Trump in Alabama,\" Aug. 21, 2015", "Office of Tax Analysis Department of the U.S. Treasury, \"Revenue Effects of Major Tax Bills Updated Tables for all 2010 Bills,\" June 2011", "Cato Institute, \"Social policy, supply side and fundamental reform: Republican tax policy 1999-2004,\" Nov. 1, 2004", "Tax Justice blog, \"Donald Trump’s regressive and retrograde tax plan,\" June 22, 2015", "CNN, \"Trump proposes massive one-time tax on the rich,\" Nov. 9, 1999", "Associated Press, \"Trump would soak the rich, including himself, as president,\" (Accessed in Nexis) Nov. 9, 1999", "New York Times, \"Trump proposes clearing nation’s debt at expensive of rich including himself,\" (Accessed in Nexis) Nov. 10, 1999", "Washington Times, \"Going for the bold on taxation,\" (Accessed in Nexis) Nov. 17, 1999", "ABC News, \"Donald Trump once proposed the biggest tax hike ever,\" Aug. 6, 2015", "ABC News, Transcript of ABC This Week, Aug. 9, 2015", "Buzzfeed, \"Donald Trump In 1999: \"I Believe In Universal Health Care…It’s An Entitlement\" From Birth,\" July 29, 2015", "PolitiFact, \"Donald Trump says U.S. is most highly taxed nation in the world,\" Aug. 28, 2015", "PolitiFact, \"Bush says Trump a Democrat longer than a Republican ‘in the last decade,’\" Aug. 24, 2015", "PolitiFact, \"Is Donald Trump still for ‘single-payer’ health care?\" Aug. 2, 2015", "PolitiFact, \"Fiorina: Trump’s abortion flip flop,\" Aug. 11, 2015", "Interview with Roberton Williams, senior fellow at the Tax Policy Center, Sept. 1, 2015", "Interview with Chris Edwards, director of tax policy at the Cato Institute, Sept. 1, 2015", "Interview, Steve Ellis, vice president of Taxpayers for Common Sense, Sept. 1, 2015", "Interview, Richard Phillips, research analyst at Citizens for Tax Justice, Aug. 24, 2015", "interview, Matt Gorman, Jeb Bush campaign spokesman, Aug. 25, 2015", "Interview, Allie Brandenburger, Jeb Bush campaign spokeswoman, Aug. 31, 2015", "Interview, Hope Hicks, Donald Trump campaign spokeswoman, Sept. 1, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]