["Gov. Andrew M. Cuomo delivers remarks at a rally at Buffalo State College on Feb. 7, 2017 (Courtesy: Cuomo's Flickr page)", "New York Gov. Andrew Cuomo has proposed free college tuition for resident students in families that earn $125,000 or less a year -- but only at the state’s public colleges and universities. Private colleges worry about their enrollment and finances if the plan passes. It wouldn’t be an even playing field, the private colleges say.", "Cuomo fired back at the critics at a Buffalo rally to promote his idea.", "\"We happen to subsidize private colleges probably more than any other state except maybe one,\" Cuomo said.", "Is Cuomo right?", "State tuition aid", "The National Association of State Student Grant and Aid Programs, which tracks college financial aid, said New York state provided $253 million in need-based grants to students attending not-for-profit private colleges in the state. That’s how much the state gave in the 2014-2015 school year, the most-recent available year for data. Only Texas offered more, giving private college students $289 million in all.", "Need-based grant programs vary widely among states, making it hard to rank per capita spending by state. Overall aid per student is difficult to track because students in some states can take advantage of multiple aid programs. So while it's possible to know how many students benefited from an individual program, no one keeps track nationally how much individual students receive from multiple programs.", "Other states give more to individual students. The maximum award from New York state’s Tuition Assistance Program is $5,165 a year. Students in California could be eligible to receive more than double that amount.", "New York state’s average need-based award for private college students -- $3,200 -- is also lower than in other large states. Private college students in California receive about $8,500 on average.", "But New York state has more aid recipients than other states. The latest data shows nearly 79,000 private college students in New York state take advantage of the need-based TAP aid, while only about 28,000 are given comparable aid in California.", "Percentage of state aid", "Despite New York's No. 2 ranking in total aid, 15 states, Puerto Rico and Washington, D.C., allocate a higher percentage of their total need-based aid to private college students. Two-thirds of New York's need-based grant aid goes to public college students. Iowa gives 80 percent of need-based grants to students at not-for-profit private colleges.", "What about merit aid?", "On a different kind of college assistance -- merit aid -- New York ranks first in awarding $5.5 million to private college students. About 52 percent of the total merit aid went to private college students.", "Our ruling", "Cuomo said New York state subsidizes private colleges \"probably more than any other state except maybe one.\"", "Data from the National Association of State Student Grant and Aid Programs shows New York state ranks second behind Texas in dollar amount of aid given to private school students.", "We rate this claim as True.", "https://www.sharethefacts.co/share/5f547ed7-141f-4771-8d7e-df2095b52f90", "Governor Cuomo delivers remarks at Buffalo State College on Feb. 7, 2017", "Email conversation with Morris Peters from the New York State Department of Budget", "Email conversation and data obtained from Michael Solomon from the National Association of State Student Grant and Aid Programs", "The National Association of State Student Grant and Aid Programs 2014 - 2015 Annual Survey, Accessed Feb. 10, 2017", "Information on New York’s Tuition Assistance Program from the Higher Education Services Corporation", "Information on the Vermont Incentive Grant from the Vermont Student Assistance Corporation", "State Data Quick Check from the National Association of State Student Grant and Aid Programs", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]