["The 10-minute 38-second video was shared here on YouTube on February 13, 2021. It it has been viewed more than 103,000 times.", "It is titled: “LATEST NEWS ~ CRITICISED, FRIDAY PRAYERS BAN SIGNED BY RELIGIOUS AFFAIRS MINISTER YAQUD !!!k ~ info news.”", "Text superimposed on the thumbnail of the YouTube video says: “HEYY QUD YA’JUD YOU WANT TO OPPOSE GOD’S LAWS!! BARBARIC!! YOU EVEN BAN FRIDAY PRAYERS!!!”", "Yaqut Cholil Qoumas became Indonesia’s religious affairs minister in December 2020.", "Ya’jud, or Yajuj is an Islamic term that refers to one of two hostile, corrupt forces that will ravage the Earth before the end of the world, according to Islamic eschatology.", "The video begins with a scene showing some men arguing inside a mosque. At the end of the scene, a narrator can be heard saying: “Barbaric. You even prohibit Friday prayers. Yaqut, the religious affairs minister, has signed a decree banning Friday prayers.”", "The video has been viewed more than 5,700 times after it was shared alongside a similar claim on Facebook here, here, here and here.", "The claim, however, is false.", "The Religious Affairs Ministry’s acting spokesman Yayat Supriyadi told AFP the claim was “a hoax” in a WhatsApp message on March 1, 2021.", "Mosque altercation", "A reverse image search of the video's keyframes obtained using digital verification tool InVID-WeVerify found the scene showing some men arguing in a mosque was taken from this YouTube video. It was published by Indonesian media Tribun Timur on March 20, 2020.", "The Tribun Timur video is titled: “There Are No Friday Prayers, This Resident Protests Al-Markaz Mosque.”", "The video caption's first two paragraphs read: “TRIBUN-TIMUR.COM, MAKASSAR - A number of people who want to take part in Friday prayers protested the caretakers of Al Markaz mosque because they suspended communal prayers on Friday, March 20, 2020, at 11am Indonesian Central Standard Time.", "“Makassar city residents protested the caretakers who stopped Friday prayers at Al Markaz, at Jl Masjid Raya No. 57, Timungan, Lampoa, Bontoala District, Makassar city.”", "Two major mosques in Makassar, Al Markaz Al Islami mosque and the Grand Mosque, suspended communal Friday prayers from March 20, 2020, due to the Covid-19 pandemic. The move came in response to instructions from the South Sulawesi governor and recommendations of the Indonesian Ulema Council, Detik.com reported.", "Al Markaz mosque reopened its doors for communal Friday prayers on June 5, 2020, Detik.com and iNews reported.", "Yaqut was appointed and sworn in as religious affairs minister in December 2020, months after the suspension of communal Friday services at Al Markaz mosque.", "Letter on communal prayers", "The letter shown at the 33-second mark of the video was not issued by Yaqut and does not indicate there was a nationwide suspension order for Friday prayers, AFP has found.", "The video actually shows a screenshot of a letter ordering the suspension of Friday prayers and other communal prayers in Kupang, the capital of East Nusa Tenggara province.", "A keyword search on Google found the letter was signed by the deputy mayor of Kupang on February 8, 2021. The letter urges the Kupang chapter of the Indonesian Ulema Council and the city’s chapter of the Indonesian Mosque Council to advise local mosques to suspend communal and Friday prayers in the city due to the Covid-19 pandemic.", "Kupang’s city government spokesperson Ernest Ludji told AFP by phone on February 24, 2021, that the letter was issued by the deputy mayor on February 8, 2021.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]