["About this rating", "Limbaugh expressed versions of this opinion on a number of occasions, though we were unable to pin down a firsthand source for the exact quote.", "We have been unable to determine whether Limbaugh ever uttered those exact words.", "Rush Limbaugh, conservative radio pundit and provocateur, died on Feb. 17, 2021, at the age of 70, prompting many to look back at his life and controversial views. Among the statements attributed to Limbaugh that still excite controversy is one extolling a traditional view of the institution of marriage.", "Limbaugh opined frequently about marriage, particularly in relation to calls for marriage rights and privileges to be extended to the LGBT community. A 2004 Palm Beach Post article about Limbaugh's third divorce attributed this quote to Limbaugh and linked it to his views on gay marriage (emphasis added):", "Limbaugh's divorces haven't stopped him from dispensing marital advice. \"If you want a successful marriage, let your husband do what he wants to do,\" he once said.", "Limbaugh, who has no children, also has opined about gay marriage. \"Marriage is about raising children. That's the purpose of the institution.\"", "While we were unable to find citations of an original source or date for this quote, we did find that Limbaugh expressed the same opinion more than once over the course of his career, particularly in the context of gay marriage. In 2003, for instance, after a landmark decision by the Massachusetts Supreme Court ruled it was unconstitutional for the state to deny marriage to gay and lesbian couples, Limbaugh said on his radio show that having and raising children is \"the primary reason for marriage,” according to an article in The Boston Globe.", "We also found the following examples in transcripts of Limbaugh's radio show:", "Limbaugh himself was married four times, with three of them -- to Roxy McNeely, Michelle Sixta, and Marta Fitzgerald -- ending in divorce. In 2010 he married Kathryn Rogers. He had no children from any of his marriages.", "Given that his expressed beliefs on marriage were consistent and widely documented, we rate this claim as “Mostly True.”", "Nur Nasreen Ibrahim is a reporter with experience working in television, international news coverage, fact checking, and creative writing.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]