["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "As the Florida Legislature moves toward creating a program to import prescription drugs from Canada, an opponent’s TV ad says the legislation could have deadly consequences.", "\"State senators are pushing a new government program that allows prescription drugs from China without FDA inspection,\" says the narrator in the April ad. \"An FDA commissioner warned these drugs come from ‘unreliable parties and counterfeiters.’ The Wall Street Journal calls it ‘impractical, unsafe and unlikely to reduce prices.’ Too many have already died from counterfeit drugs -- are you willing to take that risk?\"", "The ad directs viewers to tell their senators to vote against Senate Bill 1528.", "The message is from The Partnership for Safe Medicines, comprised of dozens of groups including Pharmaceutical Research and Manufacturers of America, or PhRMA, the lobbying group that includes major drug companies.", "Republican Gov. Ron DeSantis is a key advocate for the bill. He disputes the ad’s message.", "\"You think I’m just going to, like, bring in a bunch of drugs from Pakistan and off the street?\" he said in an April 23 speech to the AARP. \"The safety is going to be there, and if it’s not there, then we wouldn’t want to do it.\"", "PolitiFact found no evidence to support the idea that Florida legislators want to import drugs from China with no oversight from the U.S. Food and Drug Administration. The ad says that the program would allow imported drugs from China, but the legislation calls for importing drugs from Canada.", "\"The FDA has the power to regulate any drugs sold in this country, regardless of where the drugs originated,\" said Robin Feldman, University of California Hastings law professor. \"Safety is key to the FDA’s mission, and that mission encompasses drugs imported from other countries, as well as drugs sold directly here.\"", "The legislation has moved forward in Senate committees, and a similar bill in the House passed 93-22 on April 11.", "Supporters say that it will lead to lower prices for consumers who struggle to pay for medicines. Opponents cast doubt about whether it will truly save money, and a conservative group, Americans for Tax Reform, called the bill \"socialist price controls.\" (The ad correctly quoted the Wall Street Journal editorial board criticizing the plan.)", "SB 1528 would require the Florida Agency for Health Care Administration to establish a program to allow a vendor to import wholesale drugs into Florida pharmacies.", "In theory, the federal government has a path to create such a program.", "A provision in a 2003 federal law empowers the U.S. Department of Health and Human Services to approve state programs for wholesalers or pharmacies to import medications from Canada. Importers must comply with federal safeguards, including that the drugs be tested, and HHS would have to certify to Congress that the program poses no additional safety risk.", "No HHS secretary has ever issued such an approval. Vermont, which passed drug importation legislation in 2018, plans to submit a proposal to HHS this year.", "The ad omits that SB 1528 does have safety provisions, including that the drugs must meet the FDA’s standards and entities involved would be subject to state rules, according to Senate staff analysis of the bill.", "There are safeguards on the Canadian side, too. Under Canadian law, exporters must attest that the item is legal and complies with inspections of the destination country.", "Foreign drugs are already in the U.S. The FDA estimates that 80% of the active pharmaceutical ingredients and 40% of the actual finished drugs in the U.S. market are manufactured in FDA-registered facilities in other countries, primarily India and China.", "Importing drugs from Canada or other countries has been a common practice in the United States for many years. Surveys indicate that up to 8% of Americans have bought medicines outside the country, even though the practice is technically illegal. Americans buy the drugs for personal use either by driving across the border to Canada or Mexico or by purchasing them on the internet. Local governments or schools, including in Florida, have helped their employees buy cheaper drugs from Canada or overseas.", "The Partnership for Safe Medicines points to cases showing that foreign counterfeit medicines are already in the United States. For example, three Texans were prosecuted for importing 100,000 pills from China, and a Chinese drug importer distributed counterfeit drugs in the U.S.", "FDA Commissioner Scott Gottlieb and four past FDA commissioners have raised concerns that entities claim to sell Canadian drugs actually obtained the drugs from elsewhere.", "For example, in the 2005 FDA sting operation \"Bait and Switch\" the FDA found that drugs being promoted as Canadian, the vast majority came from other countries and many were counterfeit.", "More recently, the online pharmacy Canada Drugs was fined $34 million in 2018 for importing counterfeit cancer drugs and other unapproved pharmaceuticals to health care providers.", "These illegal operations are cause for concern, but those happened before Florida proposed a more structured, regulated importation program.", "Juliette Cubanski, an expert on Medicare policy at the Kaiser Family Foundation, said that the question is whether it’s possible to create a 100% foolproof system. If drugs are imported from facilities in Canada that are certified by FDA-equivalent authorities in Canada, that would be safer than ordering drugs online from a website that purports to be a Canadian pharmacy.", "\"It seems that what Florida and other states who are interested in drug importation are intending is to create safe, legitimate pathways for their residents to import prescription drugs from abroad,\" she said.", "An ad by Partnership for Safe Medicines said, \"State senators are pushing a new government program that allows prescription drugs from China without FDA inspection.\"", "Senators are actually pushing for an importation program from Canada, not China.", "In its ad, the organization points to evidence of unscrupulous entities that purported to provide prescriptions from Canada but were actually obtaining drugs from elsewhere or counterfeit operations. Those cases are real, but it doesn’t mean that a proposed Florida program will allow prescription drugs from China without federal oversight. The Florida program would require the federal government’s approval, including state and federal safeguards, including those that involve the FDA.", "We rate this claim False.", "Florida House, House Bill 19, 2019", "Florida Senate, Senate Bill 1528 and staff analysis, 2019", "FDA Commissioner Scott Gottlieb, Tweet, April 13, 2019", "Former FDA Commissioners, Letter to Congress, March 16,  2017", "The Partnership for Safe Medicines, Partnership For Safe Medicines Launches Advertising Campaign In Florida To Oppose Importation, April 12, 2019", "The Partnership for Safe Medicines, New PSM Ads Highlight Concerns Of FDA Commissioner Gottlieb About The Dangers Of Florida’s Importation Legislation, April 19, 2019", "The Partnership for Safe Medicines, Drug Importation Is Not A New Idea, And It Is Not A Good One, Either, Accessed April 24, 2019", "AP, Florida Senate bill on Canadian drug imports moves forward, April 10, 2019", "U.S. Food and Drug Administration, FDA Operation Reveals Many Drugs Promoted as \"Canadian\" Products Really Originate From Other Countries, Dec. 16, 2005", "U.S. Food and Drug Administration, Three Canadians and their Company Sentenced for Wholesale Distribution of Misbranded Prescription Drugs and Money Laundering, July 31, 2018", "U.S. Department of Justice, Canadian Drug Firm Admits Selling Counterfeit and Misbranded Prescription Drugs Throughout the United States, April 13, 2018", "U.S. Department of Justice, Distributor of counterfeit pharmaceutical drugs sentenced, Jan. 15, 2009", "Americans for Tax Reform, Website, 2019", "Wall Street Journal editorial, Importing Bad Ideas on Drug Prices, April 15, 2019", "US News, Canadian Pharmacy Fined $34 Million for Illegal Imports, April 13, 2018", "Tallahassee Democrat op-ed, Florida should steer clear of drug importation, March 19, 2019", "Kaiser Health News, In An Effort To Curb Drug Costs, States Advance Bills To Prod Feds On Importation, Feb. 16, 2019", "Kaiser Health News, Nonprofit Linked To PhRMA Rolls Out Campaign To Block Drug Imports, April 19, 2017", "Kaiser Health News, Cities, Counties and Schools Sidestep FDA Canadian Drug Crackdown, Saving Millions, Dec. 8, 2017", "Kaiser Health News, Trump’s Promise To Rein In Drug Prices Could Open Floodgate To Importation Laws, March 22, 2017", "WPLG Channel 10, Despite fearmongering, Florida moves closer to enacting prescription-drug importation law, April 19, 2019", "Fox 13, DeSantis pushes for Floridians to be allowed to buy prescriptions from Canada, 2019", "Sun Sentinel, Gov. DeSantis recommits to Canada drug plan, April 17, 2019", "Vermont Digger, State study shows savings from Canadian drugs, Jan. 4, 2019", "Inside Health Policy, Florida Legislature Likely To Pass Rx Importation Bill In Coming Weeks, April 23, 2019", "Kaiser Health News, In Florida, Drug Importation From Canada Finds New Champions, Old Snags, Feb. 25, 2019", "Interview, Helen Aguirre Ferre, Gov. Ron DeSantis spokeswoman, April 24, 2019", "Interview, Patrick Manderfield, Florida Agency for Health Care Administration spokesman, April 24, 2019", "Interview, Courtney Cox, The Partnership for Safe Medicines spokeswoman, April 24, 2019", "Interview, Robin Feldman,  University of California Hastings, Professor of Law and Director of the Institute for Innovation Law, April 25, 2019", "Interview, Juliette Cubanski, Associate Director of the Program on Medicare Policy at Kaiser Family Foundation, April 24, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]