["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A reporter asked Sen. Charles Schumer how Senate Democrats would convince enough of their Republican colleagues to join them in calling for witnesses to testify at the impeachment trial of President Donald Trump. The New York Democrat replied, \"the American people are overwhelmingly with us.\"", "Schumer said during a Capitol Hill news conference that \"four Republican senators can step forward and say that we need witnesses and documents, and there are 12 or 13 who have never said a bad word about witnesses and documents.\"", "The Senate has already rejected calls for more documents and witness testimony, but the question of whether the Senate will call witnesses, such as John Bolton, the former national security adviser, continues to loom over the trial. We wondered if Schumer is correct.", "Several polls have been conducted on this topic, with varying levels of support, though all polls showed a solid majority of public support for calling witnesses to testify in the Senate trial.", "Monmouth University Polling Institute, in a poll released on Jan. 21, found 57 percent of survey respondents support the ability of House impeachment managers to introduce new evidence in the Senate trial.", "\"Public opinion on allowing new evidence and compelling witness testimony in the Senate trial breaks sharply along partisan lines,\" said Patrick Murray, director of the independent Monmouth University Polling Institute, based in New Jersey. \"But it is interesting that solid majorities in every partisan group would like to see Trump and members of his administration at least asked to appear.\"", "A Morning Consult/Politico poll conducted Jan. 17-19 found that 57 percent of respondents said the Senate should call additional witnesses. Support was lowest among Republicans, with 37 percent, while 53 percent of independents and 77 percent of Democrats think new witnesses should be called.", "On Jan. 20, CNN released a poll that found that 69 percent of Americans think that new testimony should be taken from new witnesses who did not testify in the House inquiry, including 48 percent of Republicans.", "A Reuters/Ipsos poll conducted Jan. 17-22 showed even more support for calling witnesses to testify in the Senate trial. About 72 percent of people surveyed agreed that the trial \"should allow witnesses with firsthand knowledge of the impeachment charges to testify,\" including 84 percent of Democrats and 69 percent of Republicans.", "A poll released Jan. 22 by the Associated Press-NORC Center for Public Affairs Research found that 68 percent of respondents said that Trump should allow his top aides to testify.", "Not included in this analysis is an ABC News/Washington Post poll, because it was released a few hours after Schumer made his statement. In that poll, 66 percent of those surveyed were in favor of calling witnesses, including 45 percent of Republicans, 65 percent of independents and 87 percent of Democrats.", "Schumer said \"the American people are overwhelmingly with us\" in calling for witnesses to testify in the Senate impeachment trial.", "Not everyone may agree on what constitutes \"overwhelming\" support.", "But poll after poll shows that the majority of Americans - in some cases as high as 69 percent and 72 percent - support calling witnesses during the Senate impeachment trial.", "We rate Schumer’s claim True.", "C-SPAN video, \"Senate Democrats News Conference on Impeachment Trial,\" Jan. 24, 2020.", "Reuters news article, \"Senate Rejects Democrats on Documents, Witness, in Trump Impeachment Trial,\" Jan. 21, 2020. Accessed Jan. 27, 2020.", "Reuters news article, \"Let them speak: Most Americans want witnesses in Trump impeachment trial - Reuters/Ipsos poll,\" Jan. 22, 2020. Accessed Jan. 27, 2020.", "Email conversation, Dan Yoken, spokesman, Sen. Charles Schumer, Jan. 24, 2020.", "Monmouth University Polling Institute, news release, \"Majority Support Allowing New Impeachment Evidence,\" Jan. 21, 2020. Accessed Jan. 27, 2020.", "ABC News/Washington Post Poll: Impeachment, \"Two Thirds Call for Senate Witnesses; Trial Aside, the Economy Boosts Trump,\" Jan. 24, 2020. Accessed Jan. 27, 2020.", "CNN, \"CNN poll: 51% say Senate should remove Trump from office,\" Jan. 20, 2020. Accessed Jan. 27, 2020.", "Morning Consult/Politico National Tracking Poll, topline report, Jan. 17-19, 2020. Accessed Jan. 27, 2020.", "Morning Consult/Politico National Tracking Poll, crosstabs, Jan. 17-19, 2020. Accessed Jan. 27, 2020.", "Axios, \"Polls: Americans want new witnesses in Trump’s impeachment trial,\" Jan. 24, 2020. Accessed Jan. 27, 2020.", "The Associated Press-NORC Center for Public Affairs Research, \"The January 2020 AP-NORC Center Poll,\" Jan. 16-21, 2020. Accessed Jan. 27, 2020.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]