["A piece of ‘breaking news’ was flashed on television screens across the country on February 4. Leading channels claimed that the home ministry, in a written reply in the Lok Sabha on Tuesday, said that the government has not taken any decision to implement the National Register of Citizens (NRC) pan-India.", "“Will protests at Shaheen Bagh end, now that the home ministry has announced that there are no plans for nationwide NRC?” – read a tweet by News18 India. During the broadcast, anchor Anand Narasimhan asked the channel correspondent reporting from Shaheen Bagh, “The question is why are they [protesters] taking kids along? These children should either be in school or at home…ask them if NRC is not going to be implemented, what are they protesting for?” The reporter then went around telling protesters that the government has said that NRC will not be implemented.", "The channel displayed a news ticker during the broadcast that read (highlighted in green below) – “Who gains from Shaheen Bagh protests?”", "The media outlet ran a similar broadcast from its English channel claiming, “MHA makes it official: No plans of NRC. First official confirmation from MHA in the Parliament.”", "#NewsAlert – MHA makes it official: No plans of NRC.", "First official confirmation from MHA in the Parliament. @Arunima24 with details while @narendrataneja, @brijeshkalappa, and @warispathan present their views. #CitizenshipShowdown pic.twitter.com/hyzPFd8q2e", "— News18 (@CNNnews18) February 4, 2020", "On February 4, Lok Sabha MPs Chandan Singh and Nama Nageswara Rao questioned the home ministry on nationwide NRC. In a written reply, MoS home affairs Nityanand Rai said, “Till now, the government has not taken any decision to prepare National Register of Indian Citizens (NRIC) at the National level.”", "The operative word here is “till now” meaning that the government has not taken a decision to prepare NRC at national level ‘yet’.", "The question of nationwide NRC has been posed to the government in the past well. Rummaging through multiple written replies in the Lok Sabha and the Rajya Sabha, Alt News observed that the government has never explicitly stated that NRC will not be implemented pan-India but used words such as “at present” or “till now”.", "On June 25, 2019, opposition members asked the home ministry in the Lok Sabha, “whether there is any proposal to extend NRC across the country and if so, the details thereof.” Mos Rai’s reply to the question was, “Sir, the National Register of Citizens (NRC) is being updated at present in the State of Assam as per the provisions of the Citizenship Act, 1955…“", "On January 2, 2019, MoS home affairs Hansraj Gangaram used similar language. “At present, there is no proposal to extend the National Register of Citizens to states other than Assam,” he said in a written reply in the Rajya Sabha.", "On July 10, 2019, the government was specifically asked in the upper house of the Parliament if NRC will be implemented in West Bengal. The home ministry used the phrase “at present” here as well.", "It is noteworthy that on November 20, 2019, in the Rajya Sabha, home minister Amit Shah had confirmed pan-India NRC.", "The government has stated several times that there are no plans to implement NRC “at present” or “till now”. However, multiple media organisations did not report MoS Rai’s latest statement verbatim. Apart from News18, a plethora of organisations claimed that the home ministry said that no NRC will be prepared pan-India.", "A tweet by IANS said, “The #HomeMinistry has said in a written reply in the #LokSabha on Tuesday that the government has not taken any decision on preparing a nationwide National Register of Citizens (NRC).”", "Janta Ka Reporter tweeted the same, sourcing the information from IANS.", "Incidentally in another tweet IANS correctly reported, “#NityanandRai replied that so far the government has not taken any decision on the #NRC”", "News Nation inaccurately tweeted, “#BREAKING | Modi government clarifies in Lok Sabha that it has no plans to carry out National Register of Citizens (NRC) across the country.”", "The Times of India also carried an inaccurate report. The word “so far” features only later on in the article.", "Similar reports were published by Asianet News, National Herald, TV9 Kannada, Zee News and NDTV.", "ABP carried an article titled, “Government’s big statement on NRC, said in the Lok Sabha – There has been no decision to implement NRC on a national level.”", "The home ministry’s written reply in the Lok Sabha on nationwide NRC, where the government said that it has not made any plans “till now” to prepare a pan-India provision, was inaccurately reported in the media.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]