["The video was published here on Twitter on March 3, 2020. It has been viewed more than 1,500 times.", "The simplified-Chinese caption translates in English as: “Singapore’s Lee Kuan Yew is a strong politician. No one could ever thought that his grandson would have such a big, gay wedding. So beautiful! Lee Hsien Loong MP’s son who has Down syndrome, Li Huanwu”.", "Lee Kuan Yew is a politician and lawyer who was prime minister of Singapore from 1959 to 1990.", "Lee Hsien Loong MP is a Singaporean politician -- and son of Lee Kuan Yew -- who is currently serving as prime minister of Singapore.", "The video was also published on Facebook here, here, here and here, on Twitter here and on YouTube here alongside a similar claim.", "The claim, however, is false.", "A logo for TT Show -- a Taiwanese YouTube channel -- can be seen on the left upper corner of the video and the name of a Taiwanese YouTuber, Tyla, can be seen on the right upper corner of the video.", "A keyword search on Google found the video was originally published here on TT Show's Facebook page on February 11, 2020. The post was titled “Mother filled with tears as she ‘married off her son’! He found happiness… Blessings filled with tears”.", "The video in the misleading post corresponds to the video that TT Show published on its Facebook page from 0:00 - 2:20.", "Below is a screenshot comparison between the video in the misleading post (L) and the Facebook video (R):", "A similar video was also found published on Tylas' YouTube channel here on February 8, 2020. It was titled: “[ENG] Waited for a long time and here you are! Full recording of my dream wedding | I love you, all of you. My Grand Wedding with PRIDE and LOVE”.", "Li Huanwu, the grandson of Singapore's late founding father Lee Kuan Yew, married his boyfriend Heng Yirui in South Africa on May 24, 2019, as reported here by South China Morning Post.", "Li Huanwu, the second son of Lee Hsien Yang, posted a photo with his husband here on Instagram on May 24, 2019.", "It is captioned: “Today I marry my soul mate. Looking forward to a lifetime of moments like this with @hero.unit”, and tagged under the location of Cape Town, a port city on South Africa’s southwest coast.", "South Africa legalised same-sex marriage in 2006, as reported here by New York Times on November 14, 2020.", "The misleading post was also debunked by the Taiwan Factcheck Centre here on November 17, 2020.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]