["This video has been viewed more than 300 times after it was published on YouTube on February 15, 2020.", "Below is a screenshot of the misleading post:", "The video’s Indonesian-language title translates to English as: “No fear of the coronavirus Friday prayers in China are packed with participants who spill out to the streets.”", "The video’s caption reads: “The current situation in China. Friday prayers are packed with people who spill out to the streets.”", "The novel coronavirus, which causes the disease COVID-19, was first detected in the Chinese city of Wuhan in late 2019. As of April 1, 2020, COVID-19 has killed at least 40,598 people globally, and infected 823,626 others, according to this WHO report.", "Authorities in Jakarta, the epicentre of the outbreak in Indonesia, have decided to limit mass gatherings, including suspending mass prayers at mosques for two weeks, according to this press release issued by the Jakarta governor's office.", "The same video was shared with an identical same claim here, here and here on YouTube; also here and here on Facebook.", "The clip was also shared with a Bengali-language caption here and here with a claim that it shows recent Muslim converts flocking to a mosque in China due to the novel coronavirus pandemic.", "The claims are false; the video has circulated online since at least 2011 in reports about Muslims praying in a mosque in the western Chinese city of Xining.", "A reverse image search using a keyframe of the clip generated from InVID-WeVerify, a video verification tool, found this video published on YouTube on August 12, 2011, by YouTube user Pavel Rytir.", "The video's title reads: “Ramadan in Xining”. The caption reads: “Peace and Love, Sallem all Laikhum”.", "Ramadan is the holy fasting month of Muslims. In 2011, it began on August 1 and ended on August 29.", "Xining is the capital of Qinghai province, in the western part of China.", "In the video's comment section, the owner of the YouTube account wrote: “[I] did shoot this video”.", "Below is a screenshot comparison between the video in the misleading posts (L) and the 2011 YouTube video (R):", "AFP found the video was filmed in front of Dongguan Mosque in Xining. This photo taken in front of the mosque shows a crowd of people praying next to a building that has the same features.", "Below is a screenshot comparison between the video in the misleading posts (L) and the photo taken in front of Dongguan Mosque (R). AFP has highlighted similar features in red.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]