["About this rating", "In March 1993, fans of the \"Indiana Jones\" trilogy of films were able to watch Harrison Ford reprise his role as one of the most beloved heroes in cinematic history. However, they probably didn't expect a saxophone to show up. The 1993 role was the first time Ford had portrayed Indy since 1989, when he acted alongside the late Sean Connery in \"Indiana Jones and the Last Crusade.\"", "It's true that Indiana Jones played a saxophone. The notes of the saxophone caused snow to loosen from tree limbs and fall on a group of villains, burying them up to their heads.", "Moviegoers would be forgiven for not remembering this moment. The reprised role for a bearded Harrison Ford wasn't for an Indiana Jones feature film. The actor was cast in one episode of \"The Young Indiana Jones Chronicles,\" a television series that aired 28 episodes between 1992 and 1993. Four TV films were also released between 1994 and 1996.", "Ford starred in the episode titled \"Young Indiana Jones and the Mystery of the Blues,\" which first aired on March 13, 1993. Jeffrey Wright also starred in the episode, although was not in any scenes with Ford. Wright is now perhaps best known for his work as Bernard Lowe on the HBO series \"Westworld,\" and also was set, as of this writing, to star as James Gordon in 2021's \"The Batman.\"", "The Fandom.com page for the episode summarized the plot for \"Mystery of the Blues\":", "Wyoming, 1950. A middle-aged Indiana Jones is on the run, outwitting goons trying to steal a sacred Indian relic. Snowed in inside a cabin, Indy uncovers a relic from his past: a soprano sax. Playing a few notes brings back Indy's memories of Chicago, 1920, a time of prohibition, speakeasies and jazz.", "It's possible that Ford's beard was grown specifically to be part of Indiana Jones' character in the time period. However, it's perhaps more likely that Ford had facial hair at the time for the filming of \"The Fugitive,\" which was released in movie theaters in August 1993.", "The brief scenes with Ford might not have had the epic scope of the original trilogy with \"Indiana Jones and the Raiders of the Lost Ark,\" \"Temple of Doom,\" or \"The Last Crusade,\" but the 1993 episode of \"The Young Indiana Jones Chronicles\" did capture the final look at the Indiana Jones that moviegoers remember from the 20th century.", "The Indiana Jones films may soon receive a new addition. On Nov. 17, 2020, InsideTheMagic.net reported via The DisInsider that the fifth Indy film is \"finally beginning production.\" The DisInsider said that \"the studio has set an August 2021 production start for the Harrison Ford-led film.\"", "Three weeks later, on Dec. 8, Den of Geek reported that longtime producer Frank Marshall confirmed that Harrison Ford would not be replaced for Indy 5:", "\"Yeah, we are working on the script,\" says Marshall. \"There will only be one Indiana Jones and that's Harrison Ford. What I'm excited about with Jim (Mangold) is a great story. I think you see that in his movies like \"Ford Vs Ferrari.\" It's all about characters and telling a good story. So I'm excited to see what he comes up with. I haven't seen (the script) yet so I don't know what to tell you.\"", "\"Indiana Jones 5\" has been an ongoing concern for years, with the project getting new life after Disney purchased Lucasfilm, which owns the property and had licensed the previous four films to Paramount, in 2012. With \"Crystal Skull\" winding its way through development hell for some 19 years before emerging to a less than joyous response in 2008, it was hoped at the time that Disney would pick up the pace.", "As of late 2020, the fifth installment in the Indiana Jones series had a release date of July 29, 2022.", "Jordan Liles is a Senior Reporter who has been with Snopes since 2016.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]