["This post about the claimed “agreement” has been shared dozens of times since it was uploaded to Facebook on April 19, 2019.", "Below is a screenshot of the Facebook post:", "The same claim has been circulating on various social platforms, such as here and here on Facebook, and here and here on Twitter, ahead of Australia’s federal election on May 18, 2019.", "There has been no public agreement and the official tax policies of the two political parties show there is no such deal.", "A statement posted to Labor’s official website here specifically denies the claim. The statement reads, in part: “Labor has no policy or secret deal to introduce an inheritance tax… This fake news is completely without merit and just a desperate and pathetic lie”.", "Labor Shadow Treasurer Chris Bowen tweeted on April 20 that the accusation is a “complete fabrication”.", "If you see a text message or post suggesting Labor will introduce a death or inheritance tax, call it out for the lie that it is. Based on a dishonest @JoshFrydenberg press release and a compete fabrication. https://t.co/c0AkKrI2Ja", "Here is the Chartered Accountants Australia and New Zealand summary of Labor’s tax policies ahead of the election. It makes no mention of a 40-percent inheritance tax.", "AFP contacted the ACTU’s media office for its position. It sent the following emailed statement: “The ACTU supports the tax policies of the ALP. These do not include a ‘death tax.’”", "ALP is a reference to the Australian Labor Party.", "The Greens’ tax policies are available on its website here under the “Economic Justice” section. The policies show there is no agreement with Labor on an inheritance tax.", "This Chartered Accountants Australia and New Zealand summary of the Greens’ tax policies ahead of the election does not mention a 40-percent inheritance tax.", "In response to the spread of the claim on social media, Labor contacted Facebook requesting that the social media company remove posts about the false inheritance tax plan, AAP and SBS reported here.", "Below is a screenshot of the news report:", "The misleading Facebook post referenced at the top this fact-check, and multiple others, for example here and here, link to a media release posted to the official website of Treasurer and Liberal deputy leader Josh Frydenberg here on January 24, 2019.", "Frydenberg wrote that Shorten had in the past expressed wishes to “introduce death taxes”. He also cited Labor Shadow Assistant Treasurer Andrew Leigh’s March 7, 2016, article, in which Leigh said: “an inheritance tax would be an efficient way of raising revenues”.", "But the treasurer did not state in the press release that Labor had signed any deals, or that it had any plans to introduce an inheritance tax.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]