["The claim was published in this Facebook post on February 19, 2021.", "The post's Hindi-language text translates to English as: “Patanjali's coronil, which was targeted by negative propaganda, has been approved by the WHO. After the vaccine, India will lend the first Covid drug to the world.”", "Patanjali is an Indian manufacturer of herbal products — including Coronil, which the company describes as a “Covid-19 Immunity Booster Tablet.”", "The claim that the WHO approved Coronil as a Covid-19 treatment was also made by News Nation TV. One of the Indian broadcaster's network anchors reported here that “a lot of questions were raised whether Coronil is an effective treatment of coronavirus, but WHO has given its approval.”", "Several other media Indian outlets — including India TV; AsiaNews; Jio News; and News18 — also reported that the WHO had approved Coronil as a coronavirus treatment.", "A similar claim was also shared on Facebook here, here and here. Sanju Verma, a national spokesperson for India’s ruling Bharatiya Janata Party, promoted the claim on Twitter here.", "The claim, however, is false.", "The WHO’s regional office for Southeast Asia said it had not approved the purported coronavirus treatment.", "“WHO has not reviewed or certified the effectiveness of any traditional medicine for the treatment #COVID19,” the agency said on Twitter here on February 19, 2021.", ".@WHO has not reviewed or certified the effectiveness of any traditional medicine for the treatment #COVID19.", "On February 19, 2021, Patanjali’s managing director Acharya Balkrishna clarified in a post on Twitter that Coronil had received approval from the Indian government, not from the WHO.", "The tweet reads: “We want to clarify to avoid confusion that our WHO GMP compliant COPP certificate to Coronil is issued by DCGI, Government of India. It is clear that WHO do not approve or disapprove any drugs. WHO works for building a better, healthier future for people all over the world\".", "DCGI is an acronym for the Drugs Controller General of India, who heads the government’s Central Drugs Standard Control Organization.", "COPP, which is often written as CPP, is an acronym for Certificate of Pharmaceutical Product, which are uniform certificates used for international trade.", "Balkrishna’s clarification came one day after Patanjali published a tweet claiming the WHO had approved Coronil. The tweet was deleted but an archived version can be seen here.", "We want to clarify to avoid confusion that our WHO GMP compliant COPP certificate to Coronil is issued by DCGI, Government of India.\n\t\tIt is clear that WHO do not approve or disapprove any drugs.\n\t\tWHO works for building a better, healthier future for people all over the world. pic.twitter.com/ZEDPdWy0tg", "In a statement released on February 22, 2021, the Indian Medical Association, a voluntary organisation of Indian doctors, criticised Patanjali for promoting the false claim, calling it a “blatant lie of WHO certificate for a secret medicine.”", "Coronil, however, did recently receive a CPP from the Indian government’s Central Drugs Standard Control Organisation, as Balkrishna noted in his tweet above and as the Press Trust of India reported here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]