["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "In today’s political climate, it feels as if President Donald Trump and President Barack Obama have been antagonists forever.", "So when a quote comes along of one allegedly praising the other, it raises eyebrows.", "That’s what’s roaming around social media in a recently shared Facebook post that claims in 1991 Obama said that \"the American dream is to be Donald Trump.\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "So did Obama say this? No, not exactly.", "Obama did not literally say (or write) that the \"American dream is to be Donald Trump,\" but he did refer to Trump in a Harvard paper as an example of American success. The tone, however, wasn’t entirely positive.", "In April 1991, just before Obama was about to graduate from Harvard Law School, he and schoolmate Robert Fisher co-authored a paper called \"Race and Rights Rhetoric.\"", "An excerpt from the unpublished paper was unearthed in the 2017 Obama biography \"Rising Star: The Making of Barack Obama\" by David Garrow:", "Here is the book’s excerpt. For purposes of this fact-check, we have bolded portions of the quote:", "\"(Americans have) a continuing normative commitment to the ideals of individual freedom and mobility, values that extend far beyond the issue of race in the American mind. The depth of this commitment may be summarily dismissed as the unfounded optimism of the average American—I may not be Donald Trump now, but just you wait; if I don't make it, my children will.", "(But) those of us on the political left (often forget) the degree to which coalition and consensus-building among the American electorate has necessarily precede any major federal program to reform or restructure America’s economic and political landscape.\"", "According to Garrow (on page 451 in his book), the paper raises the argument that discussing minority rights as if they are \"universal\" rights may be counterproductive and that a pragmatic shift toward the \"language of opportunity\" would serve African-Americans better.", "Garrow writes, and quotes the Harvard paper (direct quotes from Obama’s paper are bolded again for our purposes):", "\"‘This chapter evaluates the utility of rights rhetoric … as a vehicle for black liberation,’ because the authors believed that such a focus ‘has impeded, rather than facilitated’ the achievement of ‘black empowerment.’ They observed that ‘it has become increasingly apparent that the strategies rooted in the Sixties have not led blacks to the promised land of genuine political, economic and social equality,’ because once that decade was in the past, ‘political mobilization … ground to a halt as blacks became increasingly reliant on lawyers and professional civil rights leaders and organizations with only minimal institutional presence in local communities.’", "Garrow explains that the two friends had written a pragmatic call that realism should trump idealism, and that Fisher recalled how he and Obama had each \"intensely edited all parts of the documents, (for it) was very much a product of both our minds.\"", "After Gallow’s book was released, news outlets picked up on the Trump passage, and while most clarified the context of the words and provided the full excerpt in the body of the articles, the headlines of those stories remain misleading.", "A Facebook post claims in 1991 Obama said that \"the American dream is to be Donald Trump.\"", "Obama did mention Trump in a Harvard paper that he co-wrote with a friend. But the passage says \"I may not be Donald Trump now, but just you wait; if I don't make it, my children will,\" referring to Trump as an example of Americans’ expectations that they will be financially secure in the future.", "So, yes Obama did refer to Trump as a financially stable person, but he never said or wrote the words that are being attributed to him on social media.", "The quote is inaccurate, exaggerated and taken out of context. We rate it False.", "Facebook post, April 2, 2019", "Complex, As a Harvard Law Student, Barack Obama Said Becoming Donald Trump Was The American Dream, May 12, 2017", "The Hill, Obama once invoked Trump's success as example of American dream, May 14, 2017", "Vice, Young Obama Said the American Dream Is to Be Donald Trump, May 12, 2017", "Rising Star: The Making of President Barack Obama By David Garrow 2017, Accessed April 5, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]