["About this rating", "Towards the end of her tenure as a Harvard law professor, Warren's teaching duties diminished, and she only taught one course during her final three semesters there. For her final four semesters, in 2010 and 2011, her gross salary from Harvard was more than $400,000.", "During the period for which she was paid more than $400,000 in salary (her final four semesters), Warren taught two courses, not one. More important, the salaries of college professors, especially highly reputable academics at prestigious institutions like Harvard, are based on a multitude of factors and take into account more duties than simply teaching classes.", "In January 2020, as the 2020 Democratic presidential primary progressed, we received multiple inquiries from readers about the accuracy of a widely shared claim about U.S. Sen. Elizabeth Warren's professional background.", "A social media meme contained the following text:", "\"'As Elizabeth Warren closes the night with complaints about cost of college for students, just remember she was paid $400,000 to teach one class' -- Katie Pavlich.\"", "The meme originated in a tweet published on July 30, 2019, by Katie Pavlich, a Fox News contributor and editor of the right-leaning website Townhall. She was referring to Warren's appearance at that evening's Democratic primary debate in Detroit, Michigan.", "Critics of Warren have leveled accusations of hypocrisy against her in the past, and those claims have at times touched on the level of her pay while she taught at Harvard. In 2014, for example, Snopes addressed memes that alleged the U.S. senator \"lives in a $5.4 million mansion\" and was paid \"$350,000 to teach one class,\" all while purportedly \"lecturing\" the public on economic inequality.", "The allegation that Warren was paid $400,000 to teach a single course at Harvard University is one that dates back to her 2012 U.S. Senate campaign in Massachusetts. In a Senate financial-disclosure statement filed in December 2011, Warren revealed that for \"2010 + 2011 to date,\" Harvard had paid her $429,981 in her capacity as a law professor.", "Regardless of one's subjective opinion of the salary paid by Harvard to Warren, it is essential to note that college professors, especially those who work at prominent and reputable institutions like Harvard, are typically expected to do more than just teach courses in return for their salaries, and those salaries can be based on several factors including the volume, quality, and influence of their published research, the level of their expertise and reputation in a particular field, and so on.", "Similarly, their duties typically extend beyond teaching coursework and conducting research, and can include advising and mentoring students, peer review, organizing and taking part in conferences, moderating or participating in faculty or student groups and organizations, leading or attending departmental meetings, and on occasion representing and boosting the public reputation of their respective institutions by providing expert commentary to the news media — the latter a duty that Warren discharged particularly frequently, before she began her political career.", "Warren, long recognized as a leading expert in bankruptcy, debt, and consumer law, won several teaching awards, including at Harvard, and wrote or contributed to several dozen academic books, book chapters, and journal articles. One 2010 study found that Warren's academic research was among the most widely cited in the field of bankruptcy and commercial law, in the five years leading up to the 2010 spring semester.", "So while the salary figure presented in Pavlich's tweet (and the subsequent meme) was accurate, it was misleading to claim Harvard was paying Warren more than $400,000 merely \"to teach one class.\" Nonetheless, it is true that the future senator's teaching duties did taper off towards the end of her tenure at Harvard.", "During the fall 2009 semester, Warren taught contracts law, according to a Harvard course catalog, and she also taught a year-long \"Empirical Analysis of Law\" course over the fall 2009 and spring 2010 semesters.", "In September 2010, U.S. President Barack Obama appointed Warren as a special adviser to Treasury Secretary Timothy Geithner, with responsibility for the newly created Consumer Financial Protection Bureau, an agency she helped to conceive and create. As a result, Warren stepped back completely from teaching duties during the fall 2010 and spring 2011 semesters, as reflected in a 2010/11 course catalog. However, she returned to Harvard in July 2011 and taught a course on contracts law during the fall 2011 semester.", "In 2010, Warren also contributed a chapter entitled \"Redesigning Regulation: A Case Study from the Consumer Credit Market\" to an academic book entitled \"Government and Markets: Toward a New Theory of Regulation,\" which was edited by David A. Moss from Harvard Business School and Duke University's Edward J. Balleisen.", "According to Warren's May 2012 Senate financial-disclosure statements, she took unpaid leave from Harvard during the spring and fall semesters in 2012 (that is, during her Senate campaign), and according to her May 2013 disclosure, her tenure as a Harvard professor ended when she joined the U.S. Senate in January 2013.", "According to Warren's December 2011 financial-disclosure statement, she was paid more than $400,000 by Harvard in 2010 and 2011. During that period, she taught two courses: one in the spring 2010 semester, and another in the fall 2011 semester. From September 2010 to July 2011, Warren was on leave while helping to establish the Consumer Financial Protection Bureau and therefore did not teach during that time.", "Katie Pavlich's July 2019 tweet, and subsequent memes, accurately described Harvard as having paid Warren around $400,000 (in fact it was closer to $430,000) but failed to specify that the salary covered 2010 and 2011. The tweet also misled readers by claiming Warren had been paid her salary simply to teach classes, because academic salaries typically take into account several factors other than the number of courses taught by a professor, and this is especially so for highly reputable academics such as Warren, at prestigious institutions such as Harvard.", "Finally, the tweet (and memes) also misrepresented the number of classes Warren taught during the period for which she was paid more than $400,000. It was two, not one. Taking into account that set of facts, we are issuing a rating of \"Mixture.\"", "Snopes.com.   \"Did Elizabeth Warren Lie About Her Native American Heritage to Land a Job at Harvard?\"\r\n    30 October 2014.", "U.S. Senate.  \"United States Senate Financial Disclosure Report for New Employee and Candidate Reports -- Elizabeth Warren.\"\r\n    22 December 2011.", "U.S. Senate.   \"United States Senate Financial Disclosure Report for New Employee and Candidate Reports -- Elizabeth Warren.\"\r\n    11 May 2012.", "Harvard Law School.   \"Elizabeth Warren Wins Sacks-Freund Award for Teaching.\"\r\n    3 June 2009.", "Leiter, Brian.   \"Top 25 Law Faculties in Scholarly Impact, 2005-2009.\"\r\n    Accessed 22 January 2020.", "The Obama White House.   \"President Obama Names Elizabeth Warren Assistant to the President and Special Advisor to the Secretary of the Treasury on the Consumer Financial Protection Bureau.\"\r\n    17 September 2010.", "Johnson, Glen.   \"GOP Presses Harvard to End Pay for Warren.\"\r\n    The Boston Globe.   21 September 2011.", "U.S. Senate.   \"United States Senate Financial Disclosure Report for New Employee and Candidate Reports -- Elizabeth Warren.\"\r\n    14 May 2013.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]