["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Internet posts claim an anti-Trump liberal was behind the wheel of the Dodge Challenger that drove into a crowd in Charlottesville, Va., killing one and injuring 19 others.", "But the posts are based on false, distorted and discredited information.", "The headline on an Aug. 12, 2017, PuppetStringNews.com post read, \"Friendly Fire … Charlottesville Car attacker is anti-Trump Antifa supporter.\" Facebook users flagged the story as being potentially fabricated, as part of the social media giant’s efforts to fight fake news.", "The PuppetStringNews.com story said someone named Joel Vangheluwe (pronounced \"vangelloway,\" with a hard g) — and not the suspect arrested, James Alex Fields, Jr., of Maumee, Ohio — drove a 2010 Dodge Challenger into a crowd of protesters demonstrating against white nationalists gathered in Charlottesville for a \"Unite the Right\" rally on Aug. 12. A 32-year-old woman named Heather Heyer was killed and 19 others were injured before Fields was arrested.", "Soon after, PuppetStringNews.com and other websites said the Challenger had actually belonged to Vangheluwe, who was \"a known antifa/anti Trump supporter.\"", "Antifa is shorthand for antifascist. It’s a catch-all term for demonstrators who organize on the local level to protest far-right causes, often resorting to violence. The loosely coordinated movement has roots in antifascist groups in Germany, Italy and Spain before World War II, and has grown increasingly visible in its opposition to Trump and his \"alt-right\" supporters.", "PuppetStringNews.com alleged that Vangheluwe, whose Facebook profile listed Detroit as his home, drove the Challenger into the crowd to make it look like a Trump supporter had attacked the protesters.", "There’s no proof Vangheluwe was involved in any way.", "Ohio vehicle records showed the 2010 Dodge Challenger is currently registered to Fields, who was at the Charlottesville rally and arrested shortly after the incident. Fields has been charged with second-degree murder and other crimes, and was denied bail at a hearing on Aug. 14.", "The PuppetStringNews.com post included a batch of images of Facebook and Instagram posts from Joel Vangheluwe and registration information from SearchQuarry.com that showed Joel’s father, Jerome, had once owned the car:", "It appears these images originated on 4chan.org, an imageboard site that has spawned countless memes and conspiracy theories.", "But none of the so-called evidence showed anything proving Vangheluwe was a violent, left-wing extremist.", "One Facebook image dated July 4, 2015, that was posted on PuppetStringNews.com showed Vangheluwe did have a liberal bent:", "\"Nationalism is brainwash, we'll always be separated until we come together, shit man the world and its people are beautiful. Not just America, pro world,\" Vangheluwe’s caption read.", "Another image apparent in the PuppetStringNews.com post showed a June 15 Instagram photo of Vangheluwe wearing a shirt with Jimi Hendrix on it. Vangheluwe’s selfie was simply announcing two art shows in Detroit:", "The most outspoken post on any of his social media profiles looked to be from Jan. 24, when he wrote, \"If only Trump was aborted\" as a Facebook status:", "The Vangheluwes have hired an anti-defamation lawyer, Dallas-based Andrew Sommerman, who told us the family planned to file lawsuits against websites making accusations against Joel Vangheluwe.", "Sommerman said that Jerome Vangheluwe, Joel’s father, did own the Challenger years ago, and that Joel Vangheluwe did not like Trump, but any implications beyond that are, to use Sommerman’s word, \"nuts.\"", "\"He said some negative things about Trump that aren’t nice,\" Sommerman said. \"He doesn’t support the president in everything he does.\"", "PuppetStringNews.com said, \"Charlottesville Car attacker is anti-Trump Antifa supporter.\"", "Most importantly, the car used in the incident is registered to the man currently in custody, not Vangheluwe.", "The site made the implication based on Vangheluwe’s social media posts, but a closer look revealed that even those posts didn’t reveal very much. We pored over the examples PuppetStringNews.com cited and looked through Vangheluwe’s public profiles. There was evidence Vangheluwe did not support Trump, which his lawyer confirmed, but there was nothing to suggest he was a destructive radical bent on violence.", "We rate this claim Pants On Fire!", "PuppetStringNews.com, \"Friendly Fire … Charlottesville Car attacker is anti-Trump Antifa supporter,\" Aug. 12, 2017", "CBS News, \"1 dead, 19 injured after car plows into protesters in Charlottesville,\" Aug. 12, 2017", "Twitter, Charlottesville statement, Aug. 13, 2017", "Cincinnati Enquirer, \"Charlottesville suspect's beliefs were 'along the party lines of the neo-Nazi movement,' ex-teacher says,\" Aug. 13, 2017", "New York Daily News, \"Charlottesville crash suspect James Fields brandished shield for Vanguard America hate group before attack,\" Aug. 13, 2017", "New York Times, \"What We Know About James Alex Fields, Driver Charged in Charlottesville Killing,\" Aug. 13, 2017", "Toledo Blade, \"Maumee man taken into custody for plowing into Virginia crowd, killing 1,\" Aug. 13, 2017", "New York Post, \"Rally murder suspect is an Army dropout ‘infatuated with Nazis’,\" Aug. 13, 2017", "CNN, \"Heather Heyer died 'fighting for what she believed in',\" Aug. 14, 2017", "CNN, \"Teacher: Charlottesville car crash suspect discussed radical views,\" Aug. 14, 2017", "4chan.org, \"CHARLOTTESVILLE RAM WAS A COMMIE,\" accessed Aug. 14, 2017", "Facebook, Joel VanGheluwe posts, accessed Aug. 14, 2017", "Instagram, Joel VanArt posts, accessed Aug. 14, 2017", "Ohio Bureau of Motor Vehicles, Title search, accessed Aug. 14, 2017", "Ohio Bureau of Motor Vehicles, Vehicle information, accessed Aug. 14, 2017", "Carfax, VIN 2B3CJ4DV8AH111921 report, accessed Aug. 14, 2017", "City of Charlottesville, Arrest and court records, accessed Aug. 14, 2017", "Interview with Andrew Sommerman, Vangheluwe lawyer, Aug. 14, 2017", "Interview with Miriam Dickler, Charlottesville spokeswoman, Aug. 14, 2017", "Interview with Lindsey Bohrer, Ohio Department of Public Safety spokeswoman, Aug. 14, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]