["To back up their complaints about economic injustice, protesters taking part in the demonstrations in New York's Financial District in New York have been handing out the Occupied Wall Street Journal.", "\"Our system is broken,\" said an Oct. 5, 2011, article headlined \"The Revolution Begins at Home: An Open Letter to Join the Wall Street Occupation,\" which was also posted here. \"More than 25 million Americans are unemployed. More than 50 million live without health insurance. Perhaps 100 million live in poverty. Yet the fat cats are showered with billions in tax breaks while politicians compete to turn the screws on the rest of us.\"", "We wondered if the article’s numbers were accurate. We’ll take them one by one:", "\"More than 25 million Americans are unemployed.\" This is nearly double the government's official number.", "The Bureau of Labor Statistics counted almost 14 million unemployed Americans in September 2011. This is the number that’s used to calculate the official unemployment rate of 9.1 percent.", "But some critics have long argued that this definition of unemployment is too limiting, since it doesn’t count people who have stopped looking for work or who are working part time, even though they’d prefer a full-time job. So BLS also offers an alternative measure (known to economists as \"U-6\") that factors in both groups.", "Using this measure, BLS in September 2010 found an additional 2.5 million Americans who are \"marginally attached\" to the labor force, meaning they’d be ready to work if a job became available, and another 9.3 million Americans who are working part time but who would prefer a full-time job.", "Together, these three categories added up to 25.8 million people in September 2011, for a total \"U-6\" rate of 16.5 percent, or well above the official unemployment rate.", "That’s in line with what the article said -- but only if you consider \"unemployed\" to mean \"unemployed, marginally attached to the labor force, or working only part-time for economic reasons.\" And while there are good reasons for looking at the \"U-6\" rate when discussing the current jobs picture, \"U-6\" is not the official definition of \"unemployed.\"", "\"More than 50 million live without health insurance.\" The article nailed this one just about perfectly. The most recent U.S. Census Bureau study, \"Income, Poverty, and Health Insurance Coverage: 2010,\" found that 49.9 million Americans were uninsured in 2010, or 16.3 percent of the population.", "\"Perhaps 100 million live in poverty.\" The article hedges its claim by saying \"perhaps,\" but you still have to stretch the official definition of poverty quite a bit to make the number work.", "According to the same Census Bureau report -- \"Income, Poverty, and Health Insurance Coverage: 2010\" -- there were 46.2 million Americans below the poverty line in 2010, or 15.1 percent of the population. That's less than half the 100 million claim in the article.", "However, some critics have long questioned whether the official poverty line is set too low. So the Census Bureau also calculates the number of Americans whose incomes put them at various multiples of the poverty line -- people, in other words, who are poor but not officially impoverished.", "These numbers show that 60.4 million Americans are at 125 percent of the poverty line, 75.3 million are at 150 percent of the poverty line, and 103.6 million Americans -- or just over one-third -- are at twice the poverty line.", "So to get to 100 million Americans, the article would have to count people who are at roughly twice the official poverty level. Most people would agree that these people are in a low-income category. But according to official government statistics, they are not \"in poverty.\"", "Our ruling", "The numbers in the Occupied Wall Street Journal rely on the broadest definitions of economic deprivation in America, but they are at odds with official government statistical definitions. While the number for the uninsured is essentially correct, the indicators for unemployment and poverty refer to broader, alternative measures that have some usefulness in policy discussions but that aren’t accurately described by the terminology in the article. On balance, we rate the statement Half True.", "Occupied Wall Street Journal, \"The Revolution Begins at Home,\" Oct. 5, 2011\n\nBureau of Labor Statistics, \"Labor Force Statistics from the Current Population Survey\" (main index page), accessed Oct. 10, 2011\n\nU.S. Census Bureau, \"Table 8. People Without Health Insurance Coverage by Selected Characteristics: 2009 and 2010,\" accessed Oct. 10, 2011\n\nU.S. Census Bureau, \"Table 4. People and Families in Poverty by Selected Characteristics: 2009 and 2010,\" accessed Oct. 10, 2011\n\nU.S. Census Bureau, \"Table 6. People With Income Below Specified Ratios of Their Poverty Threshold by Selected Characteristics: 2010,\" accessed Oct. 10, 2011", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]