["The footage was published here on Facebook on October 6, 2020. It has been viewed more than 2.4 million times and shared more than 17,000 times.", "The post's Indonesian-language caption translates to English as: “Workers Demonstrate Against the Omnibus Law”", "Thousands of protesters began to protest on October 6, 2020, in Jakarta, the Indonesian capital, in opposition to the controversial Omnibus Law, which critics say will harm labour rights and the environment, AFP reported.", "The same video was also shared on Facebook here, here, here and here; as well as on YouTube here and here alongside a similar claim.", "The claim, however, is false.", "A reverse image search followed by keyword searches on Google found the original video was posted by Indonesian news channel Kompas TV on its YouTube channel here on September 24, 2019.", "Translated from Indonesian-language to English, the video’s title translates as: “LATEST - Heated, Police Release Water Cannon to Demonstrators in Front of Indonesia's Parliament Building.”", "Below is a screenshot comparison of the footage in the misleading post (L) and the Kompas TV video (R):", "Police fired tear gas at students protesting against a number of controversial bills and laws in Jakarta on September 24, 2019, AFP reported here.", "AFP also published a video on the protest in Jakarta on September 24, 2019, here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]