["A Facebook post shared hundreds of times features a claim that Lai Mohammed, Nigeria’s Minister of Information and Culture, criticised Biden for allowing Kanu, the leader of the separatist group Indigenous People of Biafra (IPOB), into the United States — even after the US president received $700 million from Nigeria to fund his presidential campaign in 2020.", "“Biden is a fool for allowing Nnamdi kanu to visit America even when we supported him with $700m. Lai Mohammed (sic),” the post reads.", "However, the claim, also shared on Facebook here and here, is false.", "A similar claim previously appeared on Facebook in 2020, such as this post alleging that Mohammed had promised Biden $600 million from Nigeria to fund his 2020 presidential bid. AFP Fact Check debunked the claim here.", "Ferdinand Nwoye, Nigeria’s foreign affairs ministry spokesman, told AFP Fact Check in October 2020 that the government did not intend to fund Biden’s campaign.", "Moreover, the US Federal Election Commission (FEC) forbids foreign governments from donating to any presidential candidate in the United States.", "The commission says foreign governments are “prohibited from making contributions, donations or expenditures in connection with any election — federal, state or local. Also, foreign nationals may not donate to any party committee building fund or fund electioneering communications”.", "There is also no record of Mohammed making such remarks about Biden.", "Ministry of information and culture spokesman, Segun Adeyemi, told AFP Fact Check that false attributions are common.", "“The honourable minister never said what the fake news peddler is attributing to him,” Adeyemi said.", "Kanu’s life on the move began when he travelled to Nigeria from his UK home in October 2015 and was arrested at a Lagos hotel. He was held in custody for 18 months as he faced trial on treason charges. The British-Nigerian was eventually granted bail and he has been on the run since 2017 when he escaped the country following an attack on his home state by the Nigerian army. He later resurfaced in Israel in 2018.", "Since then, Kanu has granted numerous interviews and held live broadcasts from unknown locations. His current whereabouts are unclear, but he recently posted a video on Facebook claiming to be in the United States.", "In the video shared on social media on February 26, 2021, a man standing next to Kanu asks the IPOB leader to address members of the group in New Jersey, suggesting they were in the northeastern US state.", "By using geolocation techniques, AFP Fact Check scanned through hotels in and around New Jersey’s Newark Liberty International Airport and located the hotel where the video was filmed by matching it with photos on Google Maps.", "AFP Fact Check can confirm that the video was shot inside a hotel called Embassy Suites by Hilton Newark Airport in New Jersey.", "A comparison reveals that the strip of horizontal lights in the Kanu video circled in red to the left, match those seen in the Google Maps screenshot; likewise, the yellow circle around the furniture in the lobby, positioned behind Kanu in the video. The area circled in green in the screenshot matches the vents in the video.", "More photos can be found here on Google Maps and on the hotel’s website, confirming where the video was shot.", "AFP Fact Check reached out to the US Embassy in Abuja for confirmation that Kanu had visited the United States, without response yet. However, diplomats previously told AFP Fact Check that under US law, “individual visa records are confidential”.", "There is also no standing prohibition against Kanu going to the United States and he has visited the country in recent years.", "Kanu’s followers regularly post false information on social media. AFP Fact Check has previously debunked other claims shared by Kanu and his supporters here, here and here.", "His account was recently removed from Facebook for “repeated violation of its community rules”.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]