["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "California Gov. Gavin Newsom takes his mask off before to delivering his State of the State address from Dodger Stadium Tuesday, March 9, 2021, in Los Angeles. (AP Photo/Mark J. Terrill)", "Gov. Gavin Newsom said California’s per capita COVID-19 death rate remained “one of the lowest” in the nation, lower than the national average and rates in Texas and New York.", "CDC data placed California’s mortality rate at 137 deaths per 100,000 as of March 9, 2021. That’s lower than the national average of 158 deaths per 100,000 and better than rates in Texas and New York.", "But there are 22 other states with a lower death rate than California, meaning the state is closer to the middle than the low end.", "Speaking in the heart of Los Angeles, a place with one of the highest COVID-19 death rates in the country, Gov. Gavin Newsom claimed during his State of the State Address yesterday that California’s overall mortality rate was one of the lowest during the pandemic.", "\"California’s death rate has remained one of the lowest per capita in the nation: 134 deaths per 100,000, compared to 158 nationally, 153 in Texas and 247 in New York,\" Newsom said during his speech at Dodger Stadium on March 9, 2021.", "That characterization, as we’ll explore, appears to be an exaggeration.", "Daniel Lopez, a spokesman for the governor, said Newsom’s statement about \"one of the lowest\" death rates is accurate \"when you compare California among states with a population greater than 10 million.", "\"Based on this comparison California is only behind North Carolina which has [a] population of approximately 10.5 million,\" Lopez added.", "That’s correct. But Newsom made a more sweeping statement in his speech and did not offer clarification.", "A moment earlier, Newsom accurately noted the number of empty stadium seats behind him were about the same as the 54,395 Californians who had lost their lives to the virus over the past year. The number had increased by more than 300 less than a day after Newsom’s speech.", "The overall total is the most of any state in the nation. That grim ranking is not necessarily surprising as California has a higher population than any other state.", "For this fact check, however, we wanted to know whether Newsom got it right when he claimed California’s per capita death rate remained \"one of the lowest\" in the country.", "From Early Success To Middle Of The Pack", "Early in the pandemic, California was praised for its relatively low mortality rate compared with other populous states. As Vox noted in mid April 2020, New York had \"14 times as many coronavirus deaths as California,\" despite California being among the first states to report COVID-19 cases.", "Within months, however, as Californians stopped staying home and restrictions eased, a summer surge of coronavirus cases and deaths hit the Golden State.", "\"Death rates change over time,\" Lee Riley, professor and chair of infectious disease and vaccinology at UC Berkeley’s School of Public Health told us in an email. \"So, [assessing how California has fared] really depends on when you look at the data.\"", "Looking at the data now, Newsom got the numbers mostly right.", "California’s per capita mortality rate was 137 per 100,000 people on the day of Newsom’s speech, according to the Centers For Disease Control and Prevention.", "That ratio is lower than the national average of 158 per 100,000, and better than per capita rates in Texas (153 deaths per 100,000 people) and New York (245 deaths per 100,000 people), as the governor claimed.", "But to characterize California’s rate as \"one of the lowest\" in the nation is a stretch. The 137 deaths per 100,000 puts it in the middle of the pack, or 23rd lowest out of 50 states, the CDC data shows.", "In early February, California’s overall ranking was better at 18th lowest, according to a Los Angeles Times analysis.", "\"Being in the middle of the pack in the United States is nothing to boast about,\" added John Swartzberg, an infectious disease expert and professor emeritus at UC Berkeley’s School of Public Health. \"The US's performance by almost all metrics (including deaths) is one of the worst in the world.\"", "Currently, some individual counties such as Los Angeles and Imperial continue to have a much higher death rate than the nation’s average.", "Los Angeles was at 201 deaths per 100,000 this week. The rate is much higher for the county’s Latino population, at 321 deaths per 100,000, according to county data.", "\"Only 6 states reported higher rates,\" than Los Angeles County’s rate, Riley noted in his email. Those are New Jersey, New York, Rhode Island, Massachusetts and Mississippi.", "Los Angeles County was among the hardest hit in the country in December and January as post-holiday coronavirus cases, hospitalizations and deaths overwhelmed hospitals.", "Our Ruling", "Gov. Gavin Newsom claimed California’s per capita COVID-19 death rate remained \"one of the lowest\" in the nation, lower than the national average and rates in Texas and New York.", "CDC data place California’s mortality rate at 137 deaths per 100,000. That’s lower than the national average of 158 deaths per 100,000 and better than rates in Texas and New York. But there are 22 other states with a lower death rate than California, meaning the state is closer to the middle than the low end.", "A spokesperson for Newsom said the governor’s claim is accurate when looking at states with more than 10 million people, but Newsom made no such clarification in his speech.", "At one point early in the pandemic, California was praised for having a relatively low death rate. But much has changed in a year, including major summer and winter coronavirus surges in the state.", "Newsom got some of this right, but then stretched the truth when he characterized California’s rate as \"one of the lowest\" in the nation.", "We rate his statement Half True.", "HALF TRUE – The statement is partially accurate but leaves out important details or takes things out of context.", "Gov. Gavin Newsom, State of the State Address, March 09, 2021.", "Lee Riley, professor and chair of infectious disease and vaccinology, UC Berkeley School of Public Health, email exchange March 10, 2021.", "Erin Mordecai, assistant professor in biology, Stanford University, email exchange, March 10, 2020.", "John Swartzberg, infectious disease expert and professor emeritus, UC Berkeley’s School of Public Health, email exchange March 10, 2021.", "U.S. Centers for Disease Control and Prevention, United States COVID-19 Cases and Deaths by State, accessed March 9, 2021.", "Vox, Why New York has 14 times as many coronavirus deaths as California, April 13, 2020", "Vox, How California went from a coronavirus success story to a worrying new hot spot, July 13, 2020.", "Los Angeles County Department of Public Health, LA County Daily COVID-19 Data, accessed March 10, 2021.", "Los Angeles Times, California now has the most COVID-19 deaths, though fewer per capita than most states, Feb. 2, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]