["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Rep. Matt Gaetz, R-Fla., arrives for a closed door meeting on Capitol Hill, Oct. 14, 2019, as former White House advisor on Russia, Fiona Hill, is scheduled to testify before lawmakers as part of the House impeachment. (AP)", "U.S. Rep. Matt Gaetz, R-Fla., has become one of President Donald Trump’s key attack dogs as he pushes back against the Democrats’ impeachment inquiry through protests, regular Fox News appearances and on Twitter.", "As part of his defense of Trump, the second-term north Florida congressman has pointed the finger at former President Barack Obama’s actions related to Ukraine.", "\"Barack Obama put a permanent stop on this military aid to the Ukraine - he never allowed it to go,\" Gaetz tweeted Oct. 21. \"You’re telling me Democrats are trying to impeach President Trump for delivering aid that Obama didn’t deliver? That’s ludicrous.\" Gaetz made similar remarks in a Fox News interview with Jeanine Pirro.", "In both instances, Gaetz oversimplified the facts and didn’t tell the full story.", "The Obama administration refused to provide lethal weapons in 2014. The decision came as Russian forces invaded the eastern territory of Crimea in 2014 after Ukraine ousted its pro-Russia president. But the United States under Obama did provide extensive military and security aid but not lethal weapons.", "Further, Gaetz misrepresented the focus of the impeachment inquiry, which is about whether Trump temporarily withheld aid to pressure Ukraine to investigate Joe Biden and son Hunter Biden.", "When Gaetz said \"this aid,\" his spokesman said, Gaetz wasn’t talking about all military aid. He was referring to specific lethal military assistance that has been recounted in news reports in recent weeks.", "Gaetz’s office cited a recent column by conservative writer Marc Thiessen in the New York Post. The column mentions a sentence of reporting in a 2014 Wall Street Journal article about Obama rejecting \"weapons or lethal military aid to Ukraine.\"", "At the time, Obama officials were debating whether to send lethal military equipment amid the conflict with Russia, particularly Javelin anti-tank missiles. Obama rejected a request from Ukrainian President Petro Poroshenko for lethal aid in 2014, though the White House approved a $53 million aid package that included vehicles, patrol boats, body armor and night-vision goggles, as well as humanitarian assistance.", "U.S. officials were concerned that providing the Javelins to Ukraine would escalate their conflict with Russia. Key allies, including Germany, were not keen on sending weapons into the conflict zone, said Michael Kofman, an expert on Russia and senior research scientist at the CNA Corporation.", "Between 2014 and 2016, the United States committed more than $600 million in security assistance to Ukraine.", "Under Obama, the federal government started the Ukraine Security Assistance Initiative, which sent other kinds of U.S. military equipment to the country. From 2016 to 2019, Congress appropriated $850 million.", "In the last year of the Obama administration, Congress authorized lethal aid, but it didn’t include the Javelins.", "The 2016 National Defense Authorization Act, which became law in November 2015, called for \"lethal assistance such as anti-armor weapon systems, mortars, crew-served weapons and ammunition, grenade launchers and ammunition, and small arms and ammunition.\"", "The legislation also called for counter-artillery radars, unmanned aerial tactical surveillance systems and other equipment.", "But experts told us that the equipment ultimately provided during Obama’s tenure was non-lethal aid.", "\"The first lethal deliveries came from Trump,\" said Jim Townsend, deputy assistant secretary of defense for European and NATO Policy during the Obama administration.", "Trump, in his meeting Sept. 30 meeting with President Volodymyr Zelensky in New York, would later downplay the money Obama gave calling it \"pillows and sheets.\" (Former president Poroshenko had used similar language in 2014, telling Congress, \"Blankets and night vision goggles are important, but one cannot win a war with a blanket.\")", "\"It’s not as if the White House was putting together these lists from political science majors sitting behind desks,\" Townsend said. \"They were recommended by European command and others who went in to see what they needed.\"", "In July 2016, the White House announced a $335 million security assistance package for Ukraine that included \"counter-artillery and counter-mortar radars, secure communications, training aids, logistics infrastructure and IT systems, tactical UAVs, and medical equipment.\"", "In 2017, the Trump administration said it would sell lethal aid to Ukraine, and in 2018 it approved a plan to sell Ukraine $47 million in lethal Javelin Missiles. Even though the Trump administration has allowed the weapons, they are far from the frontlines.", "Congress approved another $250 million in military assistance in 2018, which Trump temporarily withheld along with $141 million in State Department aid in July.", "RELATED: The U.S. aid to Ukraine that Donald Trump froze, in one chart", "A Pentagon spokesman confirmed that the United States has provided $1.6 billion in security assistance to Ukraine since 2014.", "To set the record straight, Democrats didn’t launch an impeachment inquiry because Trump delivered the lethal aid.", "Democrats are investigating whether Trump abused his presidential power by withholding the aid while asking its government to look into Biden, his potential 2020 opponent. They have not yet formulated articles of impeachment.", "Gaetz said, \"Barack Obama put a permanent stop on this military aid to the Ukraine - he never allowed it to go.\"", "Obama did not permanently stop military aid to Ukraine.", "The element of truth in Gaetz's statement is the Obama administration did not provide lethal military aid that Ukraine asked for in 2014. However, it did provide other military equipment and training. The United States has provided $1.6 billion in security assistance to Ukraine since 2014, on average $300 million a year.", "This statement rates Mostly False.", "U.S. Rep. Matt Gaetz, Tweet, Oct. 21, 2019", "Fox News, Jeanine Pirro interview with Rep. Matt Gaetz, Oct 19, 2019", "Congressional Research Service, Ukraine: Background, Conflict with Russia, and U.S. Policy, Sept. 19, 2019", "Congressional Research Service, Ukraine: Current Issues and U.S. Policy, Updated Jan. 3, 2017", "Politico, How U.S. military aid became a lifeline for Ukraine, Sept. 30, 2019", "Defense News, Here’s what you need to know about the US aid package to Ukraine that Trump delayed, Sept. 25, 2019", "Defense Security Cooperation Agency, News release, March 1, 2019", "Radio Free Europe, U.S. State Department Approves 'Javelin' Missile Sale To Ukraine, March 2, 2018", "U.S. Defense Department, Ukraine – Javelin Missiles and Command Launch Units, March 1, 2018", "U.S. Defense Department, DOD Announces $250M to Ukraine, June 18, 2019", "AP, US steps up lethal aide to Ukraine: 210 anti-tank missiles; U.S. to sell anti-tank missiles to Ukraine, March 2, 2018", "New York Post op ed by Marc Thiessen, Sorry, Joe: Team Obama refused to arm Ukraine at all, Oct. 9, 2019", "Wall Street Journal, Ukraine to Get More U.S. Aid, but Not Weapons, Sept. 18, 2014", "Defense News, Here’s what you need to know about the US aid package to Ukraine that Trump delayed, Sept. 25, 2019", "National Defense Authorization Act for fiscal year 2016, 2015", "Atlantic Council, Lethal Weapons to Ukraine: A Primer, Jan. 26, 2018", "Obama White House, FACT SHEET: U.S. and NATO Efforts in Support of NATO Partners, including Georgia, Ukraine, and Moldova, July 9, 2016", "Foreign Policy, Far From the Front Lines, Javelin Missiles Go Unused in Ukraine, Oct. 3, 2019", "CNN, After Republicans storm hearing room, Defense official testifies in impeachment inquiry, Oct. 23, 2019", "Fox, Gaetz blasts Schiff for removing him from 'unfair' impeachment inquiry hearing, Oct. 14, 2019", "PolitiFact, Why Ukraine? How an Eastern European country triggered tumult in American politics, Sept. 30, 2019", "PolitiFact, The U.S. aid to Ukraine that Donald Trump froze, in one chart, Oct. 7, 2019", "Telephone interview, Mark Simakovsky, a senior fellow at the Atlantic Council and former Europe/NATO Chief of Staff, Office of the Secretary of Defense for Policy, US Department of Defense, Oct. 22, 2019", "Email interview, Michael Kofman, senior research scientist at CNA Corporation and a Fellow at the Kennan Institute, Woodrow Wilson International Center, Oct. 22, 2019", "Email interview, Mariya Y. Omelicheva, Professor of Strategy, National War College", "National Defense University, Oct. 22, 2019", "Telephone interview, James Joye Townsend Jr. an adjunct senior fellow in the CNAS Transatlantic Security Program and former Deputy Assistant Secretary of Defense (DASD) for European and NATO, Oct. 23, 2019", "Email interview, Cmdr. Sean Robertson, Pentagon Spokesperson, Oct. 24, 2019", "Statement to PolitiFact from the office U.S. Rep. Matt Gaetz, R-Fla., Oct. 22, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]