["“Trump just said ‘people are dying that have never died before,’” a series of Facebook posts from mid-March 2020 claim, apparently referring to the COVID-19 pandemic. Several posts specifically claim that the quote was said on March 17, 2020.", "Later in the month, Facebook posts attributed the same quote to Biden, while a second post, more broadly targeted at Democrats, claimed Biden said: “People will die, who have never died before.”", "In both cases, dozens of Facebook posts were shared tens of thousands of times in a matter of days.", "However, there is no evidence to suggest that the current president or the former vice president said those words.", "Trump’s schedule for March 17 shows only one official press briefing was held that day. C-SPAN, a nonprofit television network that broadcasts US public affairs, published videos of the full press briefing as well as a meeting Trump held with tourism industry executives directly afterwards.", "A word search of transcripts from the events (here and here) for the phrase “people are dying” shows no results.", "A search for the same words through the president’s Twitter account, which he frequently uses to communicate, finds only one tweet, which said : “PEOPLE ARE DYING, MOVE FAST, and GOD BLESS EVERYONE!”", "Although the Facebook posts attributing the quote to Biden do not specify the date when the presidential hopeful allegedly said it, they came after those attributing the quote to Trump. The earliest mention found by AFP Fact Check was March 22.", "A search for the words “people are dying” in Biden’s Twitter history in March shows no match.", "Similarly, none of the candidate’s March speeches available on CSPAN feature the phrase, whether in the available transcripts or in the audio of the videos.", "Biden has installed a studio in his home, from where he regularly live streams speeches or takes part in talk shows. In neither video provided in the links above does Biden say the phrase attributed to him.", "The phrase “people are dying who never died before,” was already in use before it was falsely attributed to Trump and Biden, often in a joking manner. A Twitter search shows many examples of people appropriating it or attributing it to someone else as far back as 2008.", "One of the first to use a variation of the phrase, and possibly the one who popularized it, was Hemingway, as this 1930 letter to his friend Henry Strater shows.", "In it, Hemingway jokingly mentions an advice from a common friend Edward “Bra” Saunders: “He advised us all to be careful as men are dying this year who have never died before.”", "Saunders was a Key West, Florida, boat captain and friend of Hemingway’s who introduced him to game fishing, Sandra Spanier, general editor of the Hemingway Letters Project, told AFP by email.", "Spanier told AFP of two other occasions in which the author used the phrase and attributed it to Saunders. Once in an August 11, 1939 letter in reference to the death of English writer Ford Madox Ford, and once in “late 1940 or early 1941” in another letter deploring the death of F. Scott Fitzegerald.", "Spanier told AFP that “in the case of the 1930 letter to Strater, Hemingway was joking, but he also used this saying to express emotions of sorrow and regret.”", "Carl Eby, president of the Hemingway Foundation and Society, told AFP that Hemingway’s fourth wife, Mary Hemingway, wrote in her memoir that \"People are dying that never died before\" was \"a phrase he (Hemingway) would repeat too often.\"", "On April 1, 2020, there were 191,000 confirmed COVID-19 cases in the United States, and 887,000 worldwide, according to the John Hopkins University Coronavirus Resource Center.", "Readers can find all of AFP Fact Check’s debunks of novel coronavirus claims here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]