["The photo was shared on Facebook here on April 5, 2019, by a Facebook page called USA Muslims, which has more than nearly 53,000 followers.", "Below is a screenshot of the misleading post:", "The caption states: “Breaking..A Christian mother in New Zealand, including her two daughters, was converted to Islam and became a Muslim after the New Zealand mosque attack, thousands of people in New Zealand will be converted to Islam.”", "“The New Zealand mosque attack” is a reference to the terrorist shootings at two mosques in Christchurch on March 15, 2019, which left at least 50 people dead.", "This is an AFP report published on April 4, 2019, about the killings.", "The same photo was shared with a similar claim on here on Facebook and here on Twitter.", "The claim is false; the photo in the misleading posts was taken from this news article published by The Jersey Journal on June 8, 2018. The misleading posts offer no further evidence that a Christian mother and her two daughters have converted to Islam after the Christchurch mosque shootings.", "Below is a screenshot of the article:", "In an email to AFP on April 8, 2019, photographer Reena Rose Sibayan confirmed that she took the photo of Bendaoud and her daughters for the Jersey Journal.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]