["The photos were published here on Facebook on September 13, 2020.", "GRAPHIC", "Show", "Hide", "The post’s Hindi caption translates to English as: “#LoveJihad: after all Prerna too had to cross the last stage of the love jihad. She hit the headlines at the time of her wedding. Today she left this world with another headline. But, what to do? I try to spread awareness and people say I am a religious bigot. According to them, all the jihadis are not the same; so develop brotherhood. Wake up, there is still some time before it is too late.”", "“Love Jihad” is a term coined by hardline Hindu groups in India to describe a conspiracy that Muslim men seduce and marry Hindu women to covert them to Islam. The groups also claim that the women are abused and killed if they do not accept Islam, as reported by AFP here.", "The photos were also shared alongside similar claims here, here, here and here on Facebook andhere, here, here and here on Twitter.", "However, the claim is false.", "A reverse image search found the female corpse photo featured in media reports about a Muslim girl murdered for dating a Hindu boy.", "The photo was published here by DNA, an Indian newspaper, on September 12, 2018. The report is headlined: “Honour killing in Bengal: Man kills daughter for eloping with boy of different faith”.", "Below is a screenshot of the report with the photo of the woman’s body highlighted in red by AFP:", "GRAPHIC", "Show", "Hide", "“In what is suspected to be an honour killing, father of a Muslim girl has allegedly strangulated his daughter and then mutilated her head with a stone before dumping her body on the highway near Burdwan district in West Bengal to prevent her from getting married to a Hindu boy,” the report reads.", "Below is a screenshot comparison of the photo shared in the misleading Facebook post (L) and the photo published in the DNA report (R):", "GRAPHIC", "Show", "Hide", "The image was also published in a video report about the incident by regional TV station ABP Ananda on September 11, 2018. The murder was also reported by the Business Standard here and by NDTV here.", "The interfaith marriage invitation that was shared in the misleading Facebook post is unrelated to the September 2018 killing. The name of the bride is different from the murdered Muslim girl named in media reports and the wedding date is October 22, 2019, over a year after the killing.", "Another reverse image search found that the third photo showing a young girl in fact shows Telugu movie actress Summiyya Mohammed playing her role in the 2019 film Prema Janta. Several photos of the actress in the pink school uniform can be found online.", "Below is a screenshot comparison of the third photo shared in the misleading Facebook post (L) and a photo of Mohammed found here on Pinterest (R):", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]