["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Seema Verma, the Trump administration’s top Medicaid official, based her comments about Medicaid on comparisons between the health of program recipients and people on Medicare or private insurance.", "Experts questioned this parallel, suggesting that a better measure would be to look at health before and after states expanded Medicaid under the Affordable Care Act. Numerous studies show people’s health improved as a result of Medicaid coverage and that they were generally satisfied with it.", "The Trump administration’s top Medicaid official has been increasingly critical of the entitlement program she has overseen for three years.", "Seema Verma, administrator of the Centers for Medicare & Medicaid Services, has warned that the federal government and states need to better control spending and improve care to the 70 million people on Medicaid, the state-federal health insurance program for the low-income population. She supports changes to Medicaid that would give states the option to receive capped annual federal funding for some enrollees instead of open-ended payouts based on enrollment and health costs. This would be a departure from how the program has operated since it began in 1965.", "In an early February speech to the American Medical Association, Verma noted how changes are needed because Medicaid is one of the top two biggest expenses for states, and its costs are expected to increase 500% by 2050.", "\"Yet, for all that spending, health outcomes today on Medicaid are mediocre and many patients have difficulty accessing care,\" she said.", "Verma’s sharp comments got us wondering if Medicaid recipients were as bad off as she said. So we asked CMS what evidence it has to back up her views.", "A CMS spokesperson responded by pointing us to a CMS fact sheet comparing the health status of people on Medicaid to people with private insurance and Medicare. The fact sheet, among other things, showed 43% of Medicaid enrollees report their health as excellent or very good compared with 71% of people with private insurance, 14% on Medicare and 58% who were uninsured.", "The spokesperson also pointed to a 2017 report by the Medicaid and CHIP Payment and Access Commission (MACPAC), a congressional advisory board, that noted: \"Medicaid enrollees have more difficulty than low-income privately insured individuals in finding a doctor who accepts their insurance and making an appointment; Medicaid enrollees also have more difficulty finding a specialist physician who will treat them.\"", "We opted to look at those issues separately.", "What about health status?", "Several national Medicaid experts said Verma is wrong to use health status as a proxy for whether Medicaid helps improve health for people. That’s because to be eligible for Medicaid, people must fall into a low-income bracket, which can impact their health in many ways. For example, they may live in substandard housing or not get proper nutrition and exercise. In addition, lack of transportation or child care responsibilities can hamper their ability to visit doctors.", "Benjamin Sommers, a health economist at Harvard University, said Verma’s comparison of the health status of Medicaid recipients against people with Medicare or private insurance is invalid because the populations are so different and face varied health risks. \"This wouldn’t pass muster in a first-year statistics class,\" he said.", "Death rates, for example, are higher among people in the Medicare program than those in private insurance or Medicaid, he said, but that’s not a knock on Medicare. It’s because Medicare primarily covers people 65 and older.", "By definition, Medicaid covers the most vulnerable people in the community, from newborns to the disabled and the poor, said Rachel Nuzum, a vice president with the nonpartisan Commonwealth Fund. \"The Medicaid population does not look like the privately insured population.\"", "Joe Antos, a health economist with the conservative American Enterprise Institute, also agreed, saying he is leery of any studies or statements that evaluate Medicaid without adjusting for risk.", "For a better mechanism to gauge health outcomes under Medicaid, experts point to dozens of studies that track what happened in states that chose in the past six years to pursue the Affordable Care Act’s Medicaid expansion. The health law gave states the option to extend Medicaid to everyone with incomes up to 138% of the federal poverty level, or about $17,600 annually for an individual. Thirty-six states and the District of Columbia have adopted the expansion.", "\"Most research demonstrates that Medicaid expansion has improved access to care, utilization of services, the affordability of care, and financial security among the low-income population,\" concluded the Kaiser Family Foundation in summarizing findings from more than 300 studies. \"Studies show improved self-reported health following expansion and an association between expansion and certain positive health outcomes.\" (Kaiser Health News is an editorially independent program of the foundation.)", "Studies found the expansion of Medicaid led to lower mortality rates for people with heart disease and among end-stage renal disease patients initiating dialysis.", "Researchers also reported that Medicaid expansion was associated with declines in the length of stay of hospitalized patients. One study found a link between expansion and declines in mechanical ventilation rates among patients hospitalized for various conditions.", "Another recent study compared the health characteristics of low-income residents of Texas, which has not expanded Medicaid, and those of Arkansas and Kentucky, which did. It found that new Medicaid enrollees in the latter two states were 41 percentage points more likely to have a usual source of care and 23 percentage points more likely to say they were in excellent health than a comparable group of Texas residents.", "Medicaid’s benefits, though, affect far more than the millions of nondisabled adults who gained coverage as a result of the ACA. \"Medicaid coverage was associated with a range of positive health behaviors and outcomes, including increased access to care; improved self-reported health status; higher rates of preventive health screenings; lower likelihood of delaying care because of costs; decreased hospital and emergency department utilization; and decreased infant, child, and adult mortality rates,\" according to a report issued this month by the nonpartisan Robert Wood Johnson Foundation.", "Children — who make up nearly half of Medicaid enrollees — have also benefited from the coverage, studies find. Some studies report that Medicaid contributes to improved health outcomes, including reductions in avoidable hospitalizations and lower child mortality.", "Research shows people on Medicaid are generally happy with the coverage.", "A Commonwealth Fund survey found 90% of adults with Medicaid were satisfied or very satisfied with their coverage, a slightly higher percentage than those with employer coverage.", "Accessible care?", "The evidence here is less emphatic.", "A 2017 study published in JAMA Internal Medicine found 84% of Medicaid recipients felt they were able to get all the medical care they needed in the previous six months. Only 3% said they could not get care because of long wait times or because doctors would not accept their insurance.", "Verma cites a 2017 MACPAC report that noted some people on Medicaid have issues accessing care. But that report also noted: \"The body of work to date by MACPAC and others shows that Medicaid beneficiaries have much better access to care, and much higher health care utilization, than individuals without insurance, particularly when controlling for socioeconomic characteristics and health status.\" It also notes that \"Medicaid beneficiaries also fare as well as or better than individuals with private insurance on some access measures.\"", "The report said people with Medicaid are as likely as those with private insurance to have a usual source of care, a doctor visit each year and certain services such as a Pap test to detect cervical cancer.", "\"Medicaid is not great coverage, but it does open the door for health access to help people deal with medical problems before they become acute,\" Antos said.", "On the negative side, the report said Medicaid recipients are more likely than privately insured patients to experience longer waiting times to see a doctor. They also are less likely to receive mammograms, colorectal tests and dental visits than the privately insured.", "\"Compared to having no insurance at all, having Medicaid improves access to care and improves health,\" said Rachel Garfield, a vice president at the Kaiser Family Foundation. \"There is pretty strong evidence that Medicaid helps patients get the care they need.\"", "Our ruling", "Verma said that \"health outcomes today on Medicaid are mediocre and many patients have difficulty accessing care.\"", "Numerous studies show people’s health improves as a result of Medicaid coverage. This includes lower mortality rates, shorter hospital stays and more people likely to get cancer screenings.", "While it’s hard to specify what \"many patients having difficulty accessing care\" means, research does show that Medicaid enrollees generally say they have no trouble accessing care most of the time.", "We rate the claim as Mostly False.", "Email response from the Centers for Medicare & Medicaid Services, Feb. 12, 2020.", "Telephone interview with Aviva Aron-Dine, vice president for health policy, Center on Budget and Policy Priorities, Feb. 12, 2020.", "Telephone interview with Sara Rosenbaum, professor of health policy and law, George Washington University, Feb. 12, 2020.", "Telephone interview with Rachel Nuzum, a vice president with the nonpartisan Commonwealth Fund, Feb. 13, 2020.", "Telephone interview with Rachel Garfield, vice president, Kaiser Family Foundation, Feb. 12, 2020.", "Telephone interview with Benjamin Sommers, a health economist at Harvard University, Feb. 13, 2020.", "Telephone interview with Jay Antos, health economist, American Enterprise Institute, Feb. 18, 2020.", "Centers for Medicare & Medicaid Services, \"Speech: Remarks by CMS Administrator Seema Verma at the American Medical Association National Advocacy Conference,\" Feb. 11, 2020.", "Centers for Medicare & Medicaid Services, \"Medicaid Facts and Figures,\" Jan. 30, 2020.", "Medicaid and CHIP Payment and Access Commission, \"Monitoring Access to Care in Medicaid,\" March 2017.", "The Commonwealth Fund, \"What Do Americans Think About Their Health Coverage Ahead of the 2020 Election?\" Sept. 26, 2019.", "Robert Wood Johnson Foundation, \"Medicaid’s Impact on Health Care Access, Outcomes and State Economies,\" Feb. 1, 2019.", "Kaiser Family Foundation, \"The Effects of Medicaid Expansion Under the ACA,\" Aug. 15, 2019.", "JAMA Cardiology, \"Association of Medicaid Expansion With Cardiovascular Mortality\" June 5, 2019.", "JAMA, \"Association of Medicaid Expansion With 1-Year Mortality Among Patients With End-Stage Renal Disease,\" Dec. 4, 2018.", "JAMA Surgery, \"Association of Expanded Medicaid Coverage With Hospital Length of Stay After Injury,\" Oct. 1, 2017.", "Annals of American Thoracic Surgery, \"Medicaid Expansion and Mechanical Ventilation in Asthma, Chronic Obstructive Pulmonary Disease, and Heart Failure,\" July 1, 2019.", "Health Affairs, \"Three-Year Impacts Of The Affordable Care Act: Improved Medical Care And Health Among Low-Income Adults,\" June 2017.", "Kaiser Family Foundation, \"Children’s Health Coverage: The Role of Medicaid and CHIP and Issues for the Future\" June 27, 2016.", "JAMA Internal Medicine, \"A National Survey of Medicaid Beneficiaries’ Experiences and Satisfaction With Health Care,\" September 2017.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]