["About this rating", "In May 2019, several reputable news organizations in the United States reported that the White House had instructed or requested U.S. Navy and U.S. Air Force officials to ensure that the Navy ship USS John S. McCain was rendered \"out of sight\" in time for President Donald Trump's visit to troops in the Pacific and his Memorial Day speech aboard the USS Wasp at Yokosuka Naval Base in Japan.", "Trump had been strongly critical of the late Republican senator from Arizona, both before and since McCain's death in August 2018. On the campaign trail in 2015, Trump famously said of McCain, a naval pilot and Purple Heart recipient who was held as a prisoner of war in Vietnam for five years, that \"He's a war hero because he was captured. I like people that weren't captured.\"", "(The USS John S. McCain was originally named after the 2008 Republican presidential nominee's father and grandfather, John S. McCain Jr. and John S. McCain Sr., but Sen. McCain was formally added as a third namesake in July 2018, shortly before his death).", "On 29 May, just after Trump's return from Japan, the Wall Street Journal reported that:", "The White House wanted the U.S. Navy to move “out of sight” a warship named for the late Sen. John McCain, a war hero who became a frequent target of President Trump’s ire, ahead of the president’s visit to Japan, according to an email reviewed by The Wall Street Journal.", "In a May 15 email to U.S. Navy and Air Force officials, a U.S. Indo-Pacific Command official outlined plans for the president’s arrival that he said had resulted from conversations between the White House Military Office and the Seventh Fleet of the U.S. Navy. In addition to instructions for the proper landing areas for helicopters and preparation for the USS Wasp -- where the president was scheduled to speak -- the official issued a third directive: “USS John McCain needs to be out of sight.” “Please confirm #3 will be satisfied,” the official wrote ...", "There were discussions within the U.S. military over the past week about how to handle the warship, another U.S. official said. The ship is being repaired after a 2017 collision, and any ship undergoing such repair or maintenance would be difficult to move, officials said. A tarp was hung over the ship’s name ahead of the president’s trip, according to photos reviewed by the Journal, and sailors were directed to remove any coverings from the ship that bore its name. After the tarp was taken down, a barge was moved closer to the ship, obscuring its name. Sailors on the ship, who typically wear caps bearing its name, were given the day off during Mr. Trump’s visit, people familiar with the matter said.", "The New York Times later confirmed and corroborated the Journal's reporting, citing unnamed White House and naval officials as well as two unnamed navy sailors, who reportedly told the Times that:", "\"The McCain sailors were not invited to hear Mr. Trump speak that day aboard the amphibious assault ship Wasp, while sailors from other American warships at the base were. A Navy service member based on Yokosuka said that all of the American warships in the harbor were invited to send 60 to 70 sailors to hear Mr. Trump’s address, with the exception of the McCain. When several sailors from the McCain showed up anyway, wearing their uniforms with the ship’s insignia, they were turned away, the service member said.\"", "On 30 May, the Washington Post largely corroborated those earlier reports, albeit with some modifications, pointing out that acting Defense Sec. Patrick Shanahan had told reporters he first became aware of the alleged request in reading the news, an assertion that contradicted the Journal's earlier claim that he was \"aware of the concern about the presence of the USS John McCain in Japan and approved measures to ensure it didn’t interfere with the president’s visit.\"", "Furthermore, the Post cited an unnamed Navy official as casting doubt on earlier claims that sailors from the USS John S. McCain had been the only ones not invited to attend Trump's speech, reportedly saying that \"the [McCain] crew was released from duty for the long holiday weekend, along with sailors from another ship, the USS Stethem.\"", "On the same day, the Associated Press also cited unnamed government officials in corroborating the substantive claims that the White House had asked Navy and Air Force officials to keep the USS John S. McCain out of view for Trump's Memorial Day address. One of those officials reportedly clarified that a tarp used on the ship, which temporarily covered the vessel's name, had been placed there as part of ongoing maintenance rather than specifically for the purpose of keeping the McCain family name out of view for Trump's visit, and that the tarp had been removed before Trump's speech.", "This comports with statements made by U.S. Navy public information officer Rear Adm. Charlie Brown, who tweeted that: \"The name of USS John S. McCain was not obscured during the POTUS visit to Yokosuka on Memorial Day. The Navy is proud of that ship, its crew, its namesake and its heritage.\"", "Four reputable news organizations — the Wall Street Journal, New York Times, Washington Post and Associated Press — published similar reports in May 2019, each of them making the core claim that the White House had asked U.S. military officials to keep out of sight the name of the USS John S. McCain during Trump's speech aboard the USS Wasp. Two of those articles purportedly relied in part on email correspondence between relevant officials, an especially robust type of evidence.", "However, we have not yet been able to definitively verify the accuracy of the core claim contained in these reports. This is partly because we have not seen the email correspondence in question, partly because the mutual contradictions between news reports on some of the finer details of the episode do somewhat weaken the reliability of the core claim, and also because neither Trump nor the White House has provided a clear and definitive confirmation of the accuracy of the claim.", "On 29 May, Trump distanced himself personally from the episode, tweeting that, \"I was not informed about anything having to do with the Navy Ship USS John S. McCain during my recent visit to Japan.\" However, that tweet did not confirm whether someone else associated with his administration had in fact made the request at the center of the news reports.", "On 30 May, the president went on to make somewhat contradictory remarks about the episode, first telling reporters, \"I don't know what happened,\" before adding \"Somebody did it [made the request] because they thought I didn't like him [McCain], and they were well-meaning, I will say\":", "President Trump: \"To me, John McCain -- I wasn't a fan, but I would never do a thing like that. Now, somebody did it because they thought I didn't like them. OK? And they were well-meaning, I will say.\" https://t.co/33VjC7bl2o pic.twitter.com/4wmp8ZEV1Q", "— The Hill (@thehill) May 30, 2019", "We asked the U.S. Navy, U.S. Air Force, and the White House to confirm or deny reports that someone in the administration had asked the Navy and Air Force to remove the ship, or its name, from sight in time for Trump's speech. We did not receive a response from the Navy or Air Force, and the White House directed us to Trump's 29 May tweet and 30 May comments to reporters, the aggregate meaning of which is unclear. We asked the White House for clarification over the meaning of Trump's remarks, but we did not receive a further response in time for publication.", "On 31 May 2019, the Navy chief of information provided a statement to some news outlets confirming that a request had been made to \"minimize the visibility of USS John S. McCain,\" but he did not provide details about exactly what the Navy was asked to do, or who made the request:", "\"A request was made to the U.S. Navy to minimize the visibility of USS John S. McCain, however, all ships remained in their normal configuration during the President's visit,\" Rear Admiral Charlie Brown, chief of information, said in a statement obtained by NBC News and CNN. \"There were also no intentional efforts to explicitly exclude sailors assigned to USS John S. McCain.\"", "Ballhaus, Rebecca and Gordon Lubold.   \"White House Wanted USS John McCain 'Out of Sight' During Trump Japan Visit.\"\r\n    The Wall Street Journal.   29 May 2019.", "Haberman, Maggie and Helene Cooper.   \"White House Asked Navy to Hide John McCain Warship During Trump's Visit.\"\r\n    The New York Times.   29 May 2019.", "Itkowitz, Colby et al.  \"White House Wanted USS John S. McCain Obscured During Trump's Japan Visit.\"\r\n    The Washington Post.   30 May 2019.", "Baldor, Lolita C.   \"AP Sources: White House Wanted USS McCain Moved for Trump.\"\r\n    The Associated Press.   30 May 2019.", "CNN.   \"Navy Acknowledges Request Regarding USS John S. McCain Made for Trump Visit.\"\r\n    31 May 2019.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]