["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The number of Florida black bears has rebounded in recent years, leading to an increase in contact with humans. (Tampa Bay Times file photo)", "A Hillsborough County commissioner who opposes declaring open season on Florida black bears said the animals aren’t the threat hunting advocates make them out to be.", "Stacy White, a self-proclaimed \"avid outdoorsman\" who hunts, backed a resolution to symbolically oppose a state-sanctioned bear hunt in Florida this year. The commission approved the resolution 6-0 at its June 2 meeting. The state will decide June 22 whether to allow another hunt.", "Some opponents of the measure had spoken in favor of a bear hunt. Phil Walters of GatorGuides.com said Hillsborough County didn’t need to pass the resolution, because the county didn’t even have a black bear population. But commissioners ran that risk if there was no bear hunt.", "\"Do you really want bears being brought into this county?\" Walters asked. \"If you think you’ve got problems with wildlife now, wait until you have a top apex predator in close proximity to people.\"", "White later responded by saying Walters had mischaracterized bears as apex predators — meaning they are at the very top of the food chain.", "\"One of the folks that spoke during the public comment portion of the meeting called the Florida black bear a top apex predator. That is absolutely, unequivocally false,\" White said. He followed up with Florida Fish and Wildlife Conservation Commission (or FWC) statistics that said a black bear’s diet \"usually consists of 80 percent plants, 15 percent insects and 5 percent animal matter.\"", "White told PolitiFact Florida he meant apex predator in the figurative sense, to refute what he saw as Walters’ implication that bears may hunt down humans. Bears \"certainly don’t actively hunt animal prey,\" White told us.", "He has a point there, bear experts said, but using the term \"apex predator\" largely depends on how it’s being applied.", "Bear complexities", "Florida’s black bear population had dwindled to 300 some four decades ago before the species was protected and hunting was outlawed. In 2012, the FWC removed bears from the \"threatened\" list as their numbers rebounded. Recent estimates say there are about 4,350 bears statewide today.", "As more people moved into bear habitat, the state fielded thousands of complaints about them hanging out in hot tubs, swinging in hammocks and raiding garbage bins. Then, beginning in 2013, bears attacked and mauled four women. That led to a decision in 2015 to schedule the first hunt in 21 years as a way to control the population.  A 320-bear limit was set for the weeklong hunt, but the state shut it down after just two days when permitted hunters had killed 304 bears.", "Among the reasons bears venture into populated areas (beyond loss of habitat and increased numbers) is that bears are omnivores, and will eat just about anything they can find — including what’s in humans’ garbage cans, barbecue grills and pet-food dishes.", "Their diet mostly includes berries, acorns, grasses, seeds, plant shoots, and even moss and ferns. If they do eat other animals, many times they are of the six-legged variety, such as ants, wasps and beetles. If a bear digs into a beehive, chances are they want the bees and not their honey.", "Bears also will eat the odd armadillo or possum, but often those are scavenged from already dead carcasses. Playing dead is not a safe way to avoid being eaten by a bear.", "\"Bears definitely are carnivores and predators. Whether they are a ‘top predator’ is open to one’s perspective,\" said Thomas Eason, the FWC’s director of wildlife and habitat conservation. \"That connotation is not commonly used in the scientific arena for black bears.\"", "That leads to an interesting juxtaposition: Bears are, by the standard definition, apex predators. They’re at the top of the food chain, and practically nothing can or would even try to kill an adult bear for food. But how you use the term apex predator matters, too.", "\"If you are thinking about apex predators being a danger to people that they might see as food, as a polar bear might, then black bears are not a big issue,\" University of Florida wildlife biologist Bill Giuliano said. \"However, their omnivorous tendencies and ability to live in close proximity to people is a concern.\"", "Bears don’t look to hunt people down, as the term apex predator may evoke, but events can potentially turn sour quickly if they are around people. If bears, especially a sow with cubs, get startled or cornered (perhaps by a dog you’ve let out of the house), they will try to escape. That escape route may be through you.", "In that case, we asked, what could kill a 300-pound adult black bear, short of hitting it with a car?", "\"Nothing besides a bullet,\" Giuliano said.", "Our ruling", "White said it's not true that Florida black bears are an \"apex predator.\"", "That’s overstating the case a little bit. Experts said bears are apex predators in the sense that nothing in their ecosystem naturally hunts them for food. Bears are definitely capable of injuring or even killing someone, but they don’t normally seek out humans. Bears are omnivorous, and any interaction between hungry bears and people most often involves the bear getting caught rooting in the trash.", "We rate White’s statement Half True.", "Hillsborough County Commission, video of meeting, June 2, 2016", "Tampa Bay Times Bay Buzz blog, \"End the black bear hunt, Hillsborough County commissioners demand,\" June 2, 2016", "Tampa Bay Times, \"Hillsborough County, city of St. Petersburg tell Tallahassee to end black bear hunt,\" June 2, 2016", "WESH, \"Officials: 5 bears killed after attack on woman in Seminole County,\" April 14, 2014", "Orlando Sentinel, \"Seminole County woman hospitalized after bear attack, FWC says,\" Dec. 4, 2014", "Reuters, \"Florida considers bear hunting after spate of suburban attacks,\" Feb. 4, 2015", "Tampa Bay Times, \"Florida bear hunt could happen again this October despite protests,\" April 13, 2016", "Tampa Bay Times, \"State wildlife officials vote to bring back bear hunts,\" April 15, 2015", "Tampa Bay Times, \"No clear reason for open season on Florida black bear,\" June 19, 2015", "Leesburg Daily Commercial, \"FWC promoting bear-proof trash cans,\" Sept. 9, 2015", "NBC News, \"Black Bear Attacks Florida Man, Kills His Dog,\" Oct. 7, 2015", "Tampa Bay Times, \"Florida's weeklong bear hunt ends after just two days,\" Oct. 25, 2015", "Washington Post, \"298 bears killed in Florida hunt that ‘ignored science’,\" Oct. 29, 2015", "Tampa Bay Times, \"Florida: Black bear population on the rise, reaches 4,350,\" March 24, 2016", "University of Florida Institute of Food and Agricultural Sciences Extension, \"Managing Conflicts with Wildlife: Living with Bears,\" accessed June 3, 2016", "University of Florida Institute of Food and Agricultural Sciences Extension, \"Living with the Florida Black Bear: a Homeowner's Guide to Nuisance Bear Prevention,\" accessed June 3, 2016", "Florida Fish and Wildlife Conservation Commission, \"Living with Florida Black Bears,\" accessed June 3, 2016", "Florida Fish and Wildlife Conservation Commission, \"Size, Weight, Diet,\" accessed June 3, 2016", "Florida Fish and Wildlife Conservation Commission, \"Bear Food List,\" accessed June 3, 2016", "Florida Fish and Wildlife Conservation Commission, \"Black Bear: Ursus americanus floridanus,\" accessed June 3, 2016", "Interview with Bill Giuliano, University of Florida wildlife ecology and conservation professor, June 3, 2016", "Interview with Jacklyn Lopez, Center for Biological Diversity Florida director, June 3, 2016", "Interview with Thomas Eason, Florida Fish and Wildlife Conservation Commission habitat and species conservation director, June 5, 2016", "Interview with Stacy White, Hillsborough County commissioner, June 7, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]