["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "In the first and only debate of Kentucky’s U.S. Senate race, Sen. Mitch McConnell was peppered with questions about his opposition to a proposed minimum wage hike.", "In response, McConnell, the Republican minority leader in the Senate, said raising the minimum wage in already difficult economic times would hurt employment.", "He cited a Congressional Budget Office study that he claimed said raising the minimum wage to $10.10 an hour would \"destroy half a million to 1 million jobs.\"", "\"That’s not the way to grow our economy,\" he added.", "His Democratic challenger, Kentucky Secretary of State Alison Lundergan Grimes, countered that the report also noted a minimum wage hike would lift, \"over a million Americans out of poverty.\" (In a separate fact-check, we rated that Mostly True.)", "We’re taking a look at McConnell’s claim in this fact-check.", "The report in question from the Congressional Budget Office, the chief fiscal scorekeeper for Congress, came out in February 2014. It took a look at President Barack Obama’s proposal to raise the minimum wage in three steps from $7.25 an hour to $10.10 in 2016.", "The report found most low-wage workers \"would received higher pay that would increase their family’s income.\"", "But the report said there’s a downside as well. Some people could lose their jobs. Why? An increase in wages would increase companies’ costs. That causes companies to raise their prices, which means fewer people want their goods or services, leading to less production and fewer workers needed to get the job done.", "Raising the cost of employing low-wage workers also encourages companies to focus more on other, more cost-effective ways of producing goods and services: machines, technology and employing more productive higher-wage workers. For example, it might be cheaper to pay more for new machines that can replace workers, than to pay higher minimum wages.", "The net impact of this? The CBO estimates a total reduction in the workforce of about 0.3 percent, or 500,000 workers.", "How, then, did McConnell get between \"half a million and 1 million jobs\" would be destroyed?", "The CBO is very careful to note that 500,000 is a rough estimate and the midpoint of the range of likely outcomes. The report said, \"There is about a two-thirds chance that the effect would be in the range between a very slight reduction in employment and a reduction in employment of 1 million workers.\"", "Instead of quoting the halfway point or — most accurately — offering the full-range of estimates, McConnell presents the top half of likely outcomes as though it’s fact. It’s just as likely that there are somewhere between very few and 499,999 jobs lost, but you would not get that impression from McConnell’s statement.", "Our ruling", "McConnell claimed that a Congressional Budget Office report said raising the minimum wage to $10.10 an hour \"will destroy between half a million and one million jobs.\"", "The report said \"roughly\" 500,000 workers could lose their jobs if the minimum wage went up. But the CBO added that most likely the range was between very few to 1 million. McConnell focuses on the high-end of the spectrum on a range of potential outcomes.", "We rate the claim Mostly True.", "C-SPAN, Kentucky Senate Debate, Oct. 13, 2014", "PunditFact, \"Rick Santorum: Minimum wage increase would cost 500,000 jobs,\" May 11, 2014", "Congressional Budget Office, \"The effects of a minimum-wage increase on employment and family income,\" February 2014", "PunditFact, \" ‘Marketplace’ host Kai Ryssdal talks CBO report on minimum wage and lost jobs,\" Feb. 20, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]