["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The General Services Administration on Nov. 10, 2020. (AP)", "• The primary law governing transitions, the Presidential Transition Act, took effect in 1964 and has been updated on several occasions. It uses the term “apparent” winner.", "• While Biden is right about the language in the law, the Trump administration has impeded a smooth transition by challenging the election results in court and signaling that it will not tolerate transition cooperation by federal agencies.", "Eager to embark on the nitty-gritty processes of an administrative transition, President-elect Joe Biden complained about how one federal agency was dragging its feet.", "In a Nov. 17 discussion with health care workers in Wilmington, Del., Biden criticized the General Services Administration, the low-profile federal agency tasked by law to formally initiate the transition process.", "\"The law says that the General Services Administration has a person who recognizes who the winner is,\" Biden said during the roundtable. \"And then they have to have access to all the data and information that the government possesses to be prepared. And it doesn’t require there to be an absolute winner. It says the ‘apparent winner.’ The apparent winner. And we’ve been unable to get access to the kinds of things we need to know about.\"", "Biden said the agency’s inaction means that his transition team has been prevented from obtaining key information from the Trump administration — specifically related to any plans for distributing coronavirus vaccines to more than 300 million Americans.", "Is Biden correct about the legal standard for the General Services Administration to initiate the transition process?", "Biden is correctly describing the language used in the law: To kick off the formal transition process, the agency administrator needs to determine whether there’s an \"apparent\" winner, rather than an \"absolute\" winner.", "Biden’s is \"a reasonable statement\" describing the current situation, said Terry Sullivan, a professor at the University of North Carolina who specializes in the presidency.", "That said, experts acknowledge that the law is vague enough that the administrator has some leeway in making the \"ascertainment\" decision.", "The primary law governing transitions, the Presidential Transition Act, took effect in 1964. It has been updated on several occasions, including laws enacted in 2010, 2016, and 2020.", "The law says, \"The terms ‘President-elect’ and ‘Vice-President-elect’ as used in this Act shall mean such persons as are the apparent successful candidates for the office of President and Vice President, respectively, as ascertained by the Administrator following the general elections held to determine the electors of President and Vice President.\"", "This language triggers the \"expectation that the administrator of the General Services Administration will make a common-sense decision about the election outcome,\" said Paul C. Light, a professor at New York University’s Robert Wagner School of Public Service. Once that decision is made, the legal basis for \"the infrastructure of support\" for a presidential transition is in place, Light said.", "The president-elect and his team have approximately 11 weeks between Election Day and Inauguration Day to organize the new administration, and prepare to assume national security and homeland security responsibilities from the incumbent, among other tasks, according to a Nov. 13 Congressional Research Service report.", "In general, presidential transition activities are coordinated by the General Services Administration and the Office of Management and Budget. Once the president-elect and vice president-elect have been \"ascertained\" by the GSA, federal officials are allowed to provide the transition team with facilities, funds, and services to prepare for the new administration. The money can be spent on salaries, consultants, office supplies, travel expenses and government aircraft.", "The agency’s current administrator, Emily Murphy, has not signed the required ascertainment document yet.", "\"The administrator is striving to adhere to the language and intent of the law, as well as precedent,\" GSA spokeswoman Pamela Pennington told PolitiFact. \"Please note that the law provides no process or standard by which ascertainment is made.\"", "Prior to Trump, departing presidents have generally adhered to the tradition of a smooth and straightforward transition. The laws governing the transition have enshrined the idea that the outgoing administration \"had a responsibility to hand off matters in a considered and organized fashion,\" said Max Stier, president and CEO of the Partnership for Public Service, a nonprofit that runs a Center for Presidential Transition that advises on best practices.", "RELATED: How we know Joe Biden won the 2020 presidential race", "Light pointed to a statement by then-GSA Administrator David J. Barram in testimony before Congress in December 2000, at a time when the presidential race between George W. Bush and Al Gore was so close that it had to effectively be decided by the Supreme Court.", "\"While the Act gives no explicit criteria or deadlines for making this ascertainment, as the legislative history demonstrates, Congress made it perfectly clear that if there is ‘any question’ of who the winner is ‘in a close contest,’ this determination should not be made,\" Barram testified at the time.", "In an interview this week on CNN, Barram said the situation now is \"dramatically different\" than what he faced in 2000. \"To me, it's clear that we should be recognizing Joe Biden as the president-elect,\" he said on Nov. 19.", "The fuzziness in the law has meant that the ascertainment has traditionally been viewed \"as pro forma,\" Stier said. \"The expectation was that it was important and should be done without having to demonstrate an extraordinary level of proof.\"", "The absence of a clear concession and Trump’s continuing efforts to fight the election results are the primary reason why the Trump-to-Biden transition has been so rocky, experts said.", "\"For 220 years, our country has had a peaceful transition of power,\" said Kathryn Dunn Tenpas, a senior fellow at the Brookings Institution who has studied transition issues. Trump has not only refused to concede, but he has \"perpetuated the myth that the election was somehow fraudulent,\" she said.", "Stier argues that, even in the absence of a formal ascertainment, the Trump administration could voluntarily start doing some things to help the incoming administration get ready, such as sharing intelligence, encouraging meetings with public health officials, and allowing security-clearance investigations to begin.", "\"This is not about some abstract decision that GSA has to make — it’s about choices being made to pursue a policy of noncooperation,\" Stier said.", "Light lays the blame on Trump, not on Murphy, who he says is required to answer to a vague law.", "\"Everything here hinges on good faith,\" Light said. \"The GSA administrator may have been well within the boundaries of the statute to deny a formal launch decision, but Trump's interference and threats have poisoned the cooperative relationship that has long marked the process, even after bitter campaigns such as 1980, when Reagan bested Carter for the presidency.\"", "RELATED: How narrow was Joe Biden’s victory over Donald Trump?", "Biden said the law governing the transition of presidential power \"doesn’t require there to be an absolute winner. It says the ‘apparent winner.’\"", "Biden has accurately phrased the language of the law, but the law is vague enough that it allows some leeway in making an \"ascertainment\" decision.", "It’s worth noting that the Trump administration has impeded a smooth transition in spite of the letter of the law, by challenging election results in courts.", "We rate the statement Mostly True.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more.", "Rev.com, President-elect Joe Biden roundtable with healthcare workers, Nov. 18, 2020", "Congressional Research Service, Presidential Transition Act: Provisions and Funding, Nov. 13, 2020", "PolitiFact, Trump, with help, is trying to sue and tweet his way to a second term. Could it work? Nov. 11, 2020", "David Barram, General Services Administration, Testimony, Dec. 4, 2000", "Politico, Biden Covid advisers say transition delay hurts pandemic prep beyond vaccines, Nov. 17, 2020", "New York Times, Missing From State Plans to Distribute the Coronavirus Vaccine: Money to Do It, Nov. 14, 2020", "Operation Warp Speed, Fact sheet, 2020", "CNN, Former GSA administrator: 'It's clear' we should recognize Biden as the President-elect, Nov. 19, 2020", "PolitiFact, Trump, with help, is trying to sue and tweet his way to a second term. Could it work? Nov. 11, 2020", "Email interview with Pamela Pennington, General Services Administration spokesperson, Nov. 19, 2020", "Telephone interview with Max Stier,  CEO of the Partnership for Public Service, Nov. 19, 2020", "Email Interview with Terry Sullivan, a professor at the University of North Carolina and an expert on the presidency,  Nov. 19, 2020", "Email interview with Paul C. Light, professor at New York University’s Robert Wagner School of Public Service, Nov. 18, 2020", "Email interview with Kathryn Dunn Tenpas, senior fellow at the Brookings Institution, Nov. 18, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]