["About this rating", "McDonald's announced plans to install self-order kiosks in eight or nine thousand stores in the next few years.", "McDonald's is not replacing cashiers with \"robots,\" the chain is not eliminating all cashiers, self-serve kiosks are not a response to a proposed higher minimum wage.", "In June 2018, McDonald's CEO Steve Easterbrook discussed with CNBC the company's plans to start rolling out self-order kiosks to stores in the U.S., part of an effort to catch up McDonald's U.S.-based restaurants with technology that has already been widely deployed in other markets:", "International markets like Canada, Australia and the U.K. are already fully integrated with kiosk service and mobile ordering. Locations in France and Germany, too, are almost completely transformed with this new technology.", "Predictably, the fake news site Neon Nettle spun this tidbit of business information into an article with the grossly misleading headline \"McDonald’s to Replace All Cashiers with Robots to Avoid Minimum Wage Increase\":", "Fast food giant McDonalds has announced it will be replacing all of its cashiers with robotic 'self-service' kiosks in all of its restaurants across the United States by 2020.", "The announcement comes as a 'pushback' moves against the demands of the left for $15-dollar-an-hour minimum wage, an increase the fats [sic] food giant clearly has no interest in.", "First of all, McDonald's isn't deploying any \"robots.\" They're modernizing some of their U.S. restaurants to include the installation of self-serve kiosks that consist of nothing more than touch-screen order panels and payment-processing terminals — something about as \"robotic\" as the typical modern cash register is:", "Second, McDonald's did not proclaim they are \"replacing all cashiers\" with \"robots\" (or any other form of non-human technology) by the end of 2020.  CEO Steve Easterbrook said the company planned to add self-order kiosks to 1,000 stores each quarter for the next eight or nine quarters, an effort which would (if fully implemented) place kiosks in eight or nine thousand U.S. McDonald's locations by the end of 2020.  Given that McDonald's currently has over 14,000 outlets in the U.S. alone, that effort couldn't possibly come close to replacing all the cashiers currently employed by McDonald's in the next couple of years (even if the kiosks completely eliminated the need for cashiers, which they don't).", "Furthermore, although self-order kiosks may reduce the need for cashiers, they don't completely eliminate it.  The kiosks supplement cashiers by operating in tandem with them and allowing customers choose either ordering method.", "Finally, while reducing labor costs and overhead may be a goal of McDonald's -- along with most other businesses -- the notion that the fast food chain is introducing self-order kiosks as a \"pushback against demands of the left for $15-dollar-an-hour minimum wage\" is unsupported conjecture (a subject we previously wrote about here).  In fact, Neon Nettle offered nothing to support that assertion other than a link to the notoriously unreliable conspiracy site InfoWars (which similarly provided nothing of substance).", "Many types of businesses -- for reasons other than labor costs -- have moved away from offering nothing more than a \"stand in line and wait for a cashier\" model, adding options that allow customers to use smartphones and other devices to order and pay for goods and services. As the chain's CEO noted, in McDonald's case the use of self-order kiosks typically affords customers more room to dwell on the available options and choices, which in turn promotes additional sales:", "\"What we're finding is when people dwell more, they select more,\" CEO Steve Easterbrook [said]. \"There's a little bit of an average check boost.\"", "\"If you think about only two years ago, if you were a customer there were two ways you can get served at McDonald's,\" Easterbrook said. \"You walked to the front counter and line up and take your drink and find a table or you go through the drive through. We're introducing many options. They can order through mobile, they can come curbside and we'll run it out, as well as the existing traditional ways. You can pay in different ways and customize your food in different ways. I think we're trying to add more choice and variety.\"", "Moreover, cashiers who might be displaced by self-order systems can be shifted to other roles created in conjunction with the new technologies, such as providing curbside and tableside service:", "Steve Easterbrook has said on many occasions that self-order kiosks in McDonald's restaurants are not a labor replacement,\" a spokeswoman [said]. \"They provide an opportunity to transition back-of-the-house positions to more customer service roles such as concierges and table service where they are able to truly engage with guests and enhance the dining experience.\"", "We also note that, despite some political advocacy for a national $15-dollar-an-hour minimum wage in recent years, as of now the federal minimum wage remains less than half of that, at $7.25 per hour.  And no individual state currently mandates a $15 per hour minimum wage, either (although a couple are slated to reach that level within the next few years).", "This misreporting is typical of Neon Nettle, a fake news site with a particular focus on reporting fabricated and exaggerated clickbait stories.", "Later in August 2019, a claim appeared in a meme shared on the Turning Point USA Facebook page:", "Newton, Daniel.   \"McDonald’s to Replace All Cashiers with Robots to Avoid Minimum Wage Increase.\"\r\n      Neon Nettle.   10 June 2018.", "Whitten, Sarah.   \"McDonald's to Add Self-Order Kiosks to 1,000 Stores Each Quarter.\"\r\n    CNBC.   4 June 2018.", "Peterson, Hayley.   \"McDonald's Shoots Down Fears It Is Planning to Replace Cashiers with Kiosks.\"\r\n    Business Insider.   23 June 2017.", "Economic Policy Institute.   \"Why America Needs a $15 Minimum Wage.\"\r\n    26 April 2017.", "Sept. 3, 2019: Added new meme from Turning Point USA.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]