["The Centers for Disease Control and Prevention has provided health and safety guidelines for pandemics and according to social media users, it's now offering advice on how to survive a zombie apocalypse.", "A viral March 4 Instagram post by the page UberFacts correlates the CDC's zombie guidance to Nostradamus' purported prediction of a zombie apocalypse taking place in 2021.", "\"Back in the 16th century, French astrologer Nostradamus predicted that there would be a zombie apocalypse in 2021,\" reads a screenshot of a tweet from UberFacts. \"The CDC is giving advice on how to prepare, just in case.\"", "Accompanying the tweet is an image of zombies walking in a forest and the caption of the post links to a \"Zombie Preparedness\" page on the CDC's site. The post has over 73,000 likes. USA TODAY reached out to the page for comment.", "In 2014, BuzzFeed News reported that a survey of the UberFacts Twitter account found numerous examples of \"facts\" that were false.", "Fact check: No evidence to support online claims impeachment cost $33 million", "The claim that Nostradamus predicted a zombie apocalypse would take place originates from a post on the site YearlyHoroscope.org. The site lists a number of purported \"Nostradamus 2021 predictions\" such as bitcoin, solar storms and a comet hitting Earth.", "The article claims that Nostradamus, also known as Michel de Nostradame, predicted a Russian scientist would create a biological weapon and produce a virus that would turn humans into zombies, according to one of his prophecies from a book discovered at the National Library in Rome \"which is believed to belong to him.\"", "The purported quote reads, \"Few young people: half-dead to give a start. Dead through spite, he will cause the others to shine, And in an exalted place some great evils to occur: Sad concepts will come to harm each one, Temporal dignified, the Mass to succeed. Fathers and mothers dead of infinite sorrows, Women in mourning, the pestilent she-monster: The Great One to be no more, all the world to end.”", "While some believe the passage is evidence of a zombie apocalypse prediction because of words such as \"half-dead\" and \"great evils\" there is no evidence that he was referring to zombies.", "Several historians and scholars also note that Nostradamus' predictions are often vague, leaving a lot of room for different interpretations.", "His \"popularity seems to be due in part to the fact that the vagueness of his writings and their lack of specific dates make it easy to selectively quote them after any major dramatic events and retrospectively claim them as true,\" History.com reported.", "Some scholars believe Nostradamus's was not writing to be a prophet, but rather, writing to comment on events and people of his time, according to History.com", "The claim that Nostradamus predicted the coronavirus pandemic has been previously debunked by Reuters. A YouTube user also falsely claimed that Nostradamus predicted a 9.8 earthquake would hit California on May 28, 2015.", "Fact check: Claim about FBI official who said bureau recovered no guns at Capitol riot is missing context", "While it's true that the CDC's website has a \"Zombie Preparedness\" page, the tips serve as a practical guide for real emergency situations such as hurricanes, earthquakes or floods, USA TODAY reported.", "\"As it turns out what first began as a tongue-in-cheek campaign to engage new audiences with preparedness messages has proven to be a very effective platform,\" the CDC's site reads. \"We continue to reach and engage a wide variety of audiences on all hazards preparedness via 'zombie preparedness.'\"", "A \"Zombie Preparedness\" blog post, which has been on the CDC's site since May 2011, says \"you may laugh now, but when it happens you’ll be happy you read this\" and that you may learn about how to prepare for a real emergency.", "If zombies were to start roaming the streets, the CDC would conduct an investigation and provide assistance to states until it could determine how to treat and stop the outbreak, the site says.", "Tips on the page include gathering supplies such as a gallon of water per day, food, medications, tools, sanitation and hygiene, a first aid kit and important documents, among other supplies.", "The CDC also recommends coming up with an emergency plan by identifying emergencies that are possible in the area. Aside from a zombie apocalypse, this could include other natural disasters.", "Fact check:California's COVID-19 vaccine plan doesn't give priority to homeless people, prisoners", "The claim that Nostradamus predicted a zombie apocalypse in 2021 and the CDC is giving advice on how to prepare for it is rated MISSING CONTEXT, because without additional information it could be misleading. The CDC does offer zombie apocalypse preparedness tips on its site, however, those tips were created so that people can learn about real emergency preparedness in an engaging way. Further, there is no evidence that Nostradamus predicted a zombie apocalypse. Historians and scholars note that his passages are often vague and open to interpretation.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook."]