["By FactCheck.org", "Posted on September 1, 2016", "In Donald Trump’s anticipated speech on illegal immigration, he said “the facts aren’t known because the media won’t report on them.” But the Republican presidential nominee was wrong about the facts in several instances:", "Trump gave his speech in Phoenix on Aug. 31 after a short trip to Mexico earlier that day to meet with President Enrique Pena Nieto. Over the past week, Trump has sought to clarify his position on what to do with the estimated 11 million immigrants who are living in the United States illegally. And we found he had stretched the facts in doing so. His speech in Arizona was no different in that regard.", "Early in his speech, Trump explained that he would “deliver a detailed policy address on one of the greatest challenges facing our country today, illegal immigration.” So some in his audience can be forgiven if they were left with the false impression that 2 million people have been convicted of a crime while living illegally in the U.S.", "Trump: According to federal data, there are at least 2 million, 2 million, think of it, criminal aliens now inside of our country, 2 million people criminal aliens. We will begin moving them out day one. As soon as I take office.", "A fiscal year 2013 Department of Homeland Security report says: “ICE estimates that 1.9 million removable criminal aliens are in the United States today.”", "However, the term “criminal alien” refers to any noncitizen — whether in the U.S. legally or illegally — who has ever been convicted of a crime in the United States, as explained in a 2012 report by the Congressional Research Service.", "ICE does not say how many of the 1.9 million were living in the U.S. illegally, but the Migration Policy Institute estimates in a July 2015 report that most of them are here legally. It says 820,000 of the 1.9 million are living in the U.S. illegally. Furthermore, about 690,000 of the 820,000 would be considered priorities for removal under policies adopted in 2014 — that is, the 690,000 have been convicted of a felony or serious misdemeanor. (See summary on page 25 of the report.)", "https://www.sharethefacts.co/share/c637e49f-75cf-40eb-afe8-bd61009bf597", "Trump claimed that “illegal immigration costs our country more than $113 billion a year.” That’s a conservative group’s estimate that includes the cost of public education and health care for U.S.-born children of immigrants who came to the country illegally.", "Other studies have estimated a net positive impact on the federal budget, and a modest one on state and local budgets.", "Trump’s number comes from a 2010 study (updated in 2011) by the Federation for American Immigration Reform, which “seeks to reduce overall immigration to a level that is more manageable.” The report actually said that the net cost of illegal immigration, taking into account federal and local tax collections from these immigrants, was $99 billion. The $113 billion was for costs only, not monetary benefits to government coffers.", "FAIR, which bases its estimates on an undocumented population of 13 million, figures $29 billion in federal costs and $84 billion for states and localities. Most of the state and local costs — 59 percent — come from education, including the public school education costs for U.S.-born children, and therefore U.S. citizens, of those living in the country illegally. Costs for Medicaid and the Children’s Health Insurance Program for those U.S. citizens are also included. But tax income from such children once they become adults isn’t factored in. FAIR uses an estimate of 4.7 million for the minor children of immigrants here illegally, with 72 percent of those children being born in the United States.", "The figure also includes costs for immigration enforcement and prosecution, such as the Department of Homeland Security’s $2.5 billion budget for its Office of Detention and Removal.", "As for other estimates, a 2007 report by the nonpartisan Congressional Budget Office concluded that while it is “difficult to obtain precise estimates,” the net impact on state and local budgets was “most likely modest.” A 1997 report by the National Research Council of the National Academy of Sciences found most immigrants — both legal and illegal — would have a net positive effect on government budgets over the immigrants’ lifetimes, due to a “strongly positive” fiscal impact at the federal level. The state and local costs, however, would be “concentrated in the few states that receive most of the immigrants.”", "The impact on federal budgets includes payroll taxes paid by immigrants in the country illegally, including Social Security taxes they can’t collect unless they obtain legal status. The chief actuary of the Social Security Administration said that for 2010, those working in the country illegally contributed a net $12 billion to Social Security.", "https://www.sharethefacts.co/share/25d0d27b-d713-4990-a337-619e2b3c10c8", "As part of his argument that people living illegally in the U.S. are a drain on taxpayers, Trump cited a Center for Immigration Studies report on the use of welfare programs by immigrants who live in the U.S. both legally and illegally.", "Trump: The Center for Immigration Studies estimates that 62 percent of households headed by illegal immigrants use some form of cash or non-cash welfare programs like food stamps or housing assistance. Tremendous costs, by the way, to our country. Tremendous costs. This directly violates the federal public charge law designed to protect the United States Treasury. Those who abuse our welfare system will be priorities for immediate removal.", "We cannot vouch for the accuracy of the CIS report, but Trump did cite it accurately. The group, which advocates for “low immigration,” issued a September 2015 report that said, “Among households headed by an illegal immigrant, we estimate that 62 percent use one or more welfare programs.”", "But Trump gets it wrong when he says, “This directly violates the federal public charge law designed to protect the United States Treasury.” As the report noted, U.S.-born citizens and adult green card holders living in “households headed by illegal immigrants” are legally entitled to food stamps, Medicaid and other welfare programs.", "The report says that “illegal immigrant households primarily benefit from food programs and Medicaid through their U.S.-born children.” It also says that “pregnant women illegally in the country can sometimes be enrolled” legally in Medicaid, and “there is the Emergency Medicaid program that covers predominately illegal immigrants.”", "“A large share of the welfare used by immigrant households is received on behalf of their U.S.-born children,” the report said. “This is especially true of households headed by illegal immigrants. Illegal immigrant-headed households without children make much more modest use of welfare programs.”", "https://www.sharethefacts.co/share/e19f68f4-f1c7-4e06-b2d0-c067bad1ece9", "Trump claimed that immigrants living in the country illegally “in many cases” are “treated better than our vets.” We realize how well one group is treated compared with another is a matter of opinion, but immigrants in the U.S. illegally are largely barred from receiving benefits or participating in government programs, with few exceptions.", "They can’t get Social Security, or enroll in government health care programs such as Medicaid or Medicare. They don’t qualify for food stamps, government housing or unemployment benefits, and they can’t vote.", "As the U.S. Code says, an immigrant in the country without legal authorization “is not eligible for any State or local public benefit,” with a few exceptions: They can get emergency medical care; “short-term, non-cash” disaster relief; limited immunizations and treatment of communicable diseases; in-kind community assistance such as soup kitchens, crisis counseling or short-term shelter that “are necessary for the protection of life or safety.”", "And, of course, they can be deported, as more than 400,000 immigrants in the country illegally were in fiscal 2014.", "Some noncitizen veterans, however, have been deported too, after committing a crime or because they were in the U.S. illegally.", "https://www.sharethefacts.co/share/7f11daf6-1eae-47d2-b0c3-26a1037f3f50", "Trump blamed Clinton for the release of 13,000 “criminal aliens” from federal custody back into the U.S. But their release wasn’t up to Clinton when she was secretary of state. It was mandated by a Supreme Court decision, and carried out by the Department of Homeland Security.", "Trump: According to a report for the Boston Globe, from the year 2008 to 2014 nearly 13,000 criminal aliens were released back into U.S. communities because their home countries would not, under any circumstances, take them back. Hard to believe with the power we have. Hard to believe. … These 13,000 releases occurred on Hillary Clinton’s watch. She had the power and the duty to stop it cold, and she decided she would not do it.", "It’s true that the Boston Globe reported that U.S. Immigration and Customs Enforcement “freed 12,941 criminals nationwide from 2008 to early 2014.” But Clinton served as secretary of the State Department — not the Department of Homeland Security, which oversees ICE — from January 2009 to February 2013. So, not all of those criminal immigrants were released “on her watch,” as Trump said, and none was released by her department.", "Plus, the release of those nearly 13,000 individuals was not discretionary. Instead, their release was mandated by a 2001 Supreme Court ruling, according to the Globe article.", "Boston Globe, June 4: But ICE has also released tens of thousands of criminals in the United States — and in far greater numbers than they have disclosed to the Globe.", "ICE told the news organization that the agency freed 12,941 criminals nationwide from 2008 to early 2014.", "But [Sarah] Saldaña, the ICE director, told the House committee that the agency freed 36,007 criminals in fiscal 2013 alone. They are among 86,288 criminals they released from 2013 to fiscal 2015.", "ICE officials said in an e-mail that the agency only provided the Globe the names of criminals they were forced to release under the Supreme Court decision; the additional releases were for other reasons.", "The Supreme Court ruled in 2001 that, if another country refuses to accept them, the U.S. cannot hold convicted criminals (who have served their sentences) in detention without justification for longer than six months if their removal from the U.S. is not “reasonably foreseeable.”", "Trump may have been alluding to a point made by others, that the State Department could do more, by not issuing visas, to pressure recalcitrant nations to take back their citizens convicted of crimes in the U.S. As Iowa Sen. Charles Grassley wrote in a letter in June, the U.S. has not imposed such sanctions, which are to be made after consultation between the secretaries of homeland security and state, on any nation since Guyana in 2001.", "https://www.sharethefacts.co/share/e35cb172-07f2-47ed-9e90-a50f09c358b6", "Trump said that the U.S. has admitted about 100,000 immigrants from Iraq and Afghanistan over the last five years. But about a quarter of those obtaining legal permanent resident status were Iraqis and Afghans working abroad for the U.S. government.", "From 2010 to 2014, the U.S. granted green cards, or legal permanent resident status, to more than 108,000 people from Iraq (90,117) and Afghanistan (18,005), according to the most recent data from the Office of Immigration Statistics. But about one-fifth of those individuals came to the U.S. on special immigrant visas given mainly to employees of the U.S. government and their dependents.", "From fiscal year 2010 to fiscal 2014, the U.S. awarded 22,595 special immigrant visas to Iraqis and Afghans who worked for the U.S. government. Of those, 8,859 visas were for the principal applicant and 13,736 visas were for their spouses and children.", "Over that same time period, the U.S. awarded 697 additional visas to Iraqi and Afghan translators and interpreters. Those were split between 226 principal applicants and 471 dependents.", "In all, according to a February 2016 report from the Congressional Research Service, from fiscal 2007 through the end of fiscal 2015, more than 37,000 individuals were granted special immigration status through the government’s programs for Iraqi and Afghan nationals.", "https://www.sharethefacts.co/share/ccc65789-b149-4d5a-9be6-735fa6619046", "Trump claimed that “President Obama and Hillary Clinton support sanctuary cities.” While it’s true that there has been no blanket crackdown on “sanctuary cities” by the Obama administration, there have been some efforts made to get cities to cooperate with federal authorities seeking deportation of undocumented immigrants who have committed serious crimes.", "As for Clinton, she has expressed support for sanctuary cities, including those that overlook federal requests for detainers when immigrants in the U.S. illegally have committed minor offenses. But she said she has “no support” for communities that ignore federal requests to deport violent undocumented immigrants, such as the man who killed Kathryn Steinle in San Francisco.", "Sanctuary cities are those that do not automatically turn over immigrants without legal status to federal immigration authorities. Although these policies — which vary by city — have been a contentious political issue for years, the sanctuary city issue took on new prominence in July 2015 after the murder of Steinle, who prosecutors allege was shot and killed in San Francisco by a Mexican national with a felony criminal record who had been deported several times.", "The White House has publicly opposed Republican bills that sought to deny federal funding to so-called sanctuary cities. In part, the administration argued that such blanket policies would lead to mistrust between communities and local law enforcement.", "Faye Hipsman, a policy analyst at the Migration Policy Institute, told us it is fair to say “there hasn’t been a crackdown” on sanctuary cities by the Obama administration.", "But last year, she noted, the administration rolled out the Priority Enforcement Program, which seeks to get jurisdictions to voluntarily cooperate with federal immigration officials, with the understanding that federal officials would only target for deportation those immigrants who have been convicted of certain felonies, domestic or sexual abuse, drug dealing and drunk driving, as well as those involved in a gang or suspected terrorists. That would exclude undocumented immigrants who were jailed on routine driving offenses or other minor criminal offenses.", "In opposing the Republican bills targeting sanctuary cities, the administration has argued that “Congress should give PEP a chance to work” because it “prioritizes the worst offenders.”", "Jessica M. Vaughan, director of policy studies at the Center for Immigration Studies, a think tank that describes itself as an advocate for “low immigration,” told us PEP itself is an indication of support for sanctuary cities because it “explicitly tolerates sanctuary policies and required ICE Field Offices to accommodate them.”", "The Department of Justice — at the urging of Republicans in the House appropriations subcommittee — warned earlier this year that some sanctuary policies violated federal law and jeopardized certain grant funding.", "Republican Rep. John Culberson, who has been pushing the issue, cited a recent report from the Department of Justice’s Office of Inspector General as evidence that some jurisdictions are not complying with the federal law. According to Culberson, under the new DOJ guidelines, jurisdictions that fail to cooperate with federal immigration officials “will now have to choose between receiving law enforcement grant money or protecting criminal illegal aliens. They can no longer do both.”", "Hipsman, of the Migration Policy Institute, said that the policy shift may be an indication that the Obama administration is moving toward a harder line with regard to some sanctuary policies. But both she and Vaughan said they were not aware that any grant money has been denied to any jurisdiction yet.", "As for Clinton, she made her position clear in the aftermath of Steinle’s murder. She said in a CNN interview on July 7, 2015, that San Francisco “made a mistake not to deport someone that the federal government strongly felt should be deported” and that she has “absolutely no support for a city that ignores the strong evidence that should be acted on.” But she also expressed support for sanctuary policies as they relate to minor crimes.", "Clinton on CNN, July 7, 2015: Well, what should be done is any city should listen to the Department of Homeland Security, which as I understand it, urged them to deport this man again after he got out of prison another time. Here’s a case where we’ve deported, we’ve deported, we’ve deported.  He ends back up in our country and I think the city made a mistake.  The city made a mistake, not to deport someone that the federal government strongly felt should be deported.", "So I have absolutely no support for a city that ignores the strong evidence that should be acted on.", "However, there are – like if it were a first-time traffic citation, if it were something minor, a misdemeanor, that’s entirely different. This man had already been deported five times. And he should have been deported at the request of the federal government.", "After that interview, the Clinton campaign released a statement clarifying Clinton’s position.", "“Hillary Clinton believes that sanctuary cities can help further public safety, and she has defended those policies going back years,” said Xochitl Hinojosa, a campaign spokeswoman, in a July 2015 statement. “As she made clear, this particular individual should not have been on the streets. … She believes that we need a system where people like this don’t fall through the cracks and that is why she continues to fight for comprehensive immigration reform.”", "https://www.sharethefacts.co/share/fe3cd3e5-707e-4084-989c-dba75d8d6332", "Trump falsely claimed that Clinton has a “plan to bring in 620,000 new refugees from Syria and that region over a short period of time.” Clinton last year proposed accepting 65,000 Syrian refugees in fiscal 2016, which ends Sept. 30. She has not said how many she would accept in fiscal 2017 or beyond.", "First of all, Trump got his own misleading talking point wrong. As we have written, the 620,000 figure refers to a flawed Senate Republican staff report that assumed Clinton in her first term would accept 155,000 refugees each year from all regions — not just “from Syria and that region,” as Trump said.", "How did the Republican staff arrive at that number? Clinton last year said that she would have accepted up to 65,000 Syrian refugees in fiscal year 2016, which will end Sept. 30, instead of the 10,000 set by Obama. The GOP report assumes Clinton would accept 65,000 Syrian refugees and an additional 100,000 refugees from other countries for a total of 155,000 each year.", "There’s one problem with that: Clinton has not said how many refugees she would seek to admit over four years.", "The Clinton campaign told us that she still remains committed to accepting more than 10,000 Syrian refugees — provided that they can be properly screened. But she has not said how many more she would accept in the future or how many refugees in total she would admit.", "Trump also said the Syrian refugees seeking admission to the U.S. have “no documentation” and “no paperwork.” That’s false. As we have written, Barbara Strack, chief of the refugee affairs division of the U.S. Citizenship and Immigration Services, told Congress last year that “we’ve found with Syrian refugees … in general they have many, many documents.” She also said documents are only one part of the vetting process that includes interviews by the U.S. Citizenship and Immigration Services and security checks by the National Counterterrorism Center, the FBI’s Terrorist Screening Center, the Department of Homeland Security and the Department of Defense.", "Finally, Trump said that “we are going to stop the tens of thousands of people coming in from Syria.” That may be so in the future, but it is not the case right now.", "The number of Syrian refugees admitted to the U.S. under Obama, from Jan. 20, 2009, through Aug. 31, totaled 12,670, according to the State Department’s Refugee Processing Center. That includes 10,066 this year, meeting the goal set by the administration for the fiscal year that ends Sept. 30. Obama has set a goal of accepting another 10,000 in the fiscal year that begins Oct. 1, although he leaves office in January.", "https://www.sharethefacts.co/share/fd70bff7-1066-4858-a588-7fd7fa621312", "Trump claimed the government has “no idea” how many immigrants are in the country illegally, and that the number could be anywhere from 3 million to 30 million. Actually, the government has a pretty good estimate: 11.4 million. It’s a figure that nearly mirrors estimates from independent immigration groups.", "Trump, Aug. 31: The truth is, the central issue is not the needs of the 11 million illegal immigrants or however many there may be — and honestly we’ve been hearing that number for years. It’s always 11 million. Our government has no idea. It could be 3 million. It could be 30 million. They have no idea what the number is.", "We looked into this when Trump offered the same speculation in an interview with Anderson Cooper on CNN on Aug. 25. As we wrote then, the most recent estimate from the Department of Homeland Security is that there were 11.4 million unauthorized immigrants living in the U.S. in 2012. DHS used U.S. Census Bureau data on the foreign-born population, and then subtracted legal residents such as naturalized citizens, asylees and refugees. It then added in the estimated number of foreign-born individuals missed by the Census Bureau’s population survey.", "Although that’s a four-year-old figure, it jibes with more recent estimates from independent immigration groups.", "The Center for Migration Studies, a think tank that studies international migration, estimated that the illegal population was about 10.9 million as of 2014. Similarly, the nonpartisan Pew Research Center, based on preliminary figures, estimated that there were 11.3 million unauthorized immigrants living in the U.S. that year.", "Immigration experts allowed that there is some uncertainty in the estimates, but they told us it is likely only to be off by a million or so. Uniformly, experts told us it is not possible that there could be as many as 30 million illegal immigrants in the U.S., as Trump suggested. Nor, they said, could the number be as low as 3 million.", "Steven Camarota, director of research at the Center for Immigration Studies, which favors fewer legal immigration admissions to the U.S., estimated the population of illegal immigrants to be 11.5 million in 2015 and 11.7 million in 2016. That’s in the range of 10 million to 12 million that “most people believe,” Camarota told us in an interview.", "https://www.sharethefacts.co/share/2ad6b4d8-7aa6-479d-bc82-8754c5a31084", "— Eugene Kiely, Lori Robertson, Robert Farley and D’Angelo Gore", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]