["About this rating", "On 12 August 2016, the Facebook page Occupy Democrats published a photograph purportedly showing Donald Trump's \"solid gold toilet\" as a means of disparaging the notion that the Republican presidential nominee could speak to the needs of ordinary (i.e., non-wealthy) Americans:", "When Donald Trump purchased the Northeastern air shuttle service in 1989 and rebranded it as Trump Shuttle, he aimed to reposition the shuttle as a luxury service. Accordingly, he had all the aircraft exteriors repainted and the interiors redecorated with features that included maple wood veneer, chrome seat belt latches, and gold colored lavatory fixtures. However, those lavatory fixtures were only gold in color (not content), and it's not one of them that's pictured here.", "Donald Trump's Fifth Avenue penthouse in the Trump Tower includes many nicely gilded furnishings, but no solid gold toilet.", "Likewise, his private jet features gold-plated sink fixtures in one bathroom, but no solid gold toilet.", "What the photograph used by Occupy Democrats actually depicts is a bathroom fixture that was formerly part of the Swisshorn Gold Palace in Hong Kong (a building not owned by Trump):", "According to the Guinness Book of World Records, Hong Kong jeweller Lam Sai-wing was the original possessor of the \"World's Most Expensive Bathroom,\" including its fully functional, 24-carat, solid gold toilet:", "Jeweller Lam Sai-wing built a HK$27 million (£2.4 million; $3.5 million)  washroom in his Hong Kong shop made entirely out of gold and precious jewels.  The toilet bowls, wash basins, toilet brushes, toilet paper holders, mirror frames, wall mounted chandeliers, wall tiles and doors are all made out of solid 24-carat gold.  The ceiling is decorated with ruby, sapphire, emerald and amber and even the floor to the washroom is embedded with 900 g (2 lb) gold bars. The inspiration for the toilet came from Lenin who in 1921 said that toilets of gold should be built to serve as a useful reminder of the waste of capitalist warfare.", "Lam Sai-wing sold off the bathroom's fixtures in 2008 for their melt value, but he refused to see his golden throne melted down. The solid gold toilet, which is all that remains of the jeweller's splendidly gilded palatial bathroom, is now the property of Hong Kong's Hang Fung Gold Technology Group.", "Cheng, Jonathan.   \"A Palace of Gold Is Sold Off for Its Melt Value, But Not the Throne.\"\r\n    The Wall Street Journal.   7 July 2008.", "Guinness Book of World Records.   \"Most Expensive Bathroom.\"\r\n    2010   (p. 289).", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]