["By Lori Robertson", "Posted on February 22, 2019", "When asked whether he would impose tariffs on cars imported from the European Union, President Donald Trump, as he regularly does, used an inflated figure for the trade balance between the U.S. and the EU. The deficit was $101 billion for 2017, not $151 billion, as he repeatedly claims.", "Trump, for years, has been using the goods-only figures for the U.S. trade deficit, instead of the goods-and-services deficit, to justify his trade policies. Since the United States exports a lot of services — such as travel, transportation, finance and intellectual property — Trump skews the trade picture by completely discounting the service trade. The U.S., in fact, has an overall trade surplus in services.", "During the 2016 presidential campaign, Trump wrongly claimed again and again that the U.S. trade deficit was “nearly $800 billion,” a generous rounding-up of the goods-only deficit of $758.9 billion in 2015, the latest figure at the time. The overall goods-and-services deficit was $531.5 billion then. He repeatedly claimed the deficit with China was $500 billion — close to the overall deficit with all countries. (The latest figure for China is $335.7 billion for 2017, despite Trump’s assertion on Feb. 15 that a “lot of people think it’s $506 billion.”)", "Similarly, he has distorted the trade figures for Canada and Mexico.", "Trump continues to falsely claim the U.S. has “large trade deficits with Mexico and Canada,” when there’s a trade surplus with Canada ($2.8 billion in 2017), and the deficit with Mexico ($68.7 billion) amounts to 11 percent of the total two-way trade with the U.S.", "The president made his latest false claim about U.S. trade with the EU during an appearance with the federal chancellor of Austria. A reporter asked about a potential tariff Trump has proposed on automobiles and auto parts from the EU. In his response, Trump said:", "Trump, Feb. 20: They’re very tough to make a deal with — the EU. … If we don’t make the deal, we’ll do the tariffs. … But the bottom-line result is whether or not we can make a deal with the EU that’s fair. We lose about $151 billion trading with the EU. That’s a lot of money. And this has been going on for many years.", "That’s a lot of money, but the wrong figure. It’s 50 percent higher than the actual trade deficit with the EU.", "And the trade deficit has been going up under Trump. It was $101.2 billion with the EU in 2017, up nearly 10 percent from $92.1 billion in 2016, according to Bureau of Economic Analysis figures published by the Census Bureau. In the last four quarters — from the fourth quarter of 2017 through the third quarter of 2018 — the deficit was $113 billion.", "Trump consistently uses the goods-only figure, which also has risen, from $146.8 billion in 2016 to $151.4 billion in 2017 and $154.2 billion in 2018.", "According to the Washington Post Fact Checker’s database of Trump’s claims, the president has repeated his false claim about the EU trade deficit 131 times.", "Total trade between the EU and U.S. was $1.1 trillion in 2016, and the EU is the largest goods trading partner for the U.S., according to the Office of the U.S. Trade Representative.", "Early last summer, Trump threatened to put a 20 percent tariff on cars exported from the EU to the United States. At the time, the U.S. had added new tariffs on steel and aluminum imports, including those from the EU, and the EU retaliated with tariffs on U.S. products. On July 27, the EU and the United States agreed to hold trade negotiations and to not impose further tariffs in the meantime.", "In an Aug. 21 rally in West Virginia, the president said: “We are going to put a 25 percent tax on every car that comes from the European Union into the United States. And that’ll take our loss and trade deficit of $151 billion dollars and give us a surplus of $151 billion.”", "On Feb. 17, the Commerce Department submitted a study to Trump on how automobile and auto parts imports affect national security. Under Section 232 of the Trade Expansion Act, the president can implement trade restrictions if the Commerce Department finds that imports harm national security. Such a finding was used by Trump to apply the steel and aluminum tariffs last year.", "The president has 90 days after receiving the report from the Commerce Department to decide whether to act on the report’s recommendations, as a Congressional Research Service report on Section 232 explains.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]