["By Saranac Hale Spencer", "Posted on December 18, 2017", "Q: Is Rep. Nancy Pelosi planning to step down amid sexual harassment allegations?", "A: No. There have been no such claims made publicly against Pelosi.", "Allegations of sexual harassment have already felled at least one U.S. senator and two congressmen. Now come the hoaxes.", "A forged court document made to look like Senate Democratic Leader Chuck Schumer had been accused of sexual harassment in 2012 was recently presented to several media outlets. Schumer has asked the Capitol Police to investigate.", "Before that, a conservative operative peddled a false story to the Washington Post in an apparent effort to discredit the paper and its coverage of sexual misconduct allegations leveled against Republican Roy Moore, who lost a special U.S. Senate election in Alabama on Dec. 12.", "And a dozen questionable websites have published a story claiming that House Democratic Leader Nancy Pelosi will leave her post before the end of the year after five men and one woman accused her of sexual harassment. That’s not true, either.", "Facebook users flagged the latter story as potentially false.", "It originated on a website called Patriot Post, which describes itself as satirical, and has a disclaimer that says: “Everything on this website is fiction.” But none of the other sites that picked up the story has such a disclaimer.", "No one has publicly accused Pelosi of sexual harassment, though, and the fake story gets several basic facts wrong.", "For instance, it identifies Pelosi as the Senate majority leader, when she is neither a senator, nor a member of the majority party.", "Pelosi has been in the House of Representatives since 1987, and she’s led the House Democrats since 2003.", "The made-up story also refers to quotes in the Army Times and Breitbart that were not published by either publication.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to help identify and label viral fake news stories flagged by readers on the social media network.", "Allen, Mike. “Schumer calls cops after forged sex scandal charge.” Axios. 12 Dec 2017.", "Boubord, Stewart; Davis, Aaron; and Crites, Alice. “A woman approached The Post with dramatic — and false — tale about Roy Moore. She appears to be part of undercover sting operation.” Washington Post. 27 Nov 2017.", "Bradner, Eric. “Alabama election: Doug Jones scores stunning win, but Moore won’t concede.” CNN. 12 Dec 2017.", "“BREAKING: Nancy Pelosi To Resign After New Revelations.” Patriot Post. 2 Dec 2017.", "“Representative Nancy Pelosi.” Profile. Congress.gov. Accessed 14 Dec 2017.", "Loughlin, Sean. “Democrats pick Pelosi as House leader.” CNN. 15 Nov 2002.", "FactCheck.org Rating:", "Read More", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]