["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Voters cast their ballots at voting machines during early voting at the Dunwoody, Ga., Library on Oct. 29, 2020. (AP)", "Since Election Day, voting technology companies have been the subject of disinformation that seeks to undermine confidence in the integrity of the vote.", "Dominion and Smartmatic make electronic voting systems. Neither was created for “changing the results of elections.”", "Smartmatic technology was not used in any of the battleground states won by Biden where Trump allies are disputing the results.", "The U.S. Cybersecurity and Infrastructure Security Agency said the 2020 election was “the most secure in American history.” That finding has been affirmed by at least one independent audit of voting machines.", "A member of President Donald Trump’s legal team is falsely claiming that voting machines rigged the presidential race in favor of Joe Biden.", "In a Nov. 16 interview with Mark Levin, a conservative radio personality, Sidney Powell, a lawyer for former National Security Adviser Michael Flynn, said the machines that many Americans used to cast their ballots were originally created to falsify election results in Venezuela.", "\"I’ve got a firsthand witness. In fact I’ve just emailed you an affidavit from a witness who can now be used publicly,\" Powell said during the show. \"It’s redacted in some places but he was present for the creation of the system for this specific purpose of falsifying election results for Hugo Chavez and then (Nicolás) Maduro. They exported this all over Latin America.\"", "\"It’s the Smartmatic and Dominion systems that were built to do this very thing, for changing the results of elections.\"", "Posts with snippets of Powell’s interview have been widely shared on Facebook. They were flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.) The lawyer’s claims have also surfaced on TikTok and been covered by conservative outlets like the Gateway Pundit.", "Powell joined Trump’s legal team after Election Day to pursue lawsuits in battleground states that the president lost to Biden. She has falsely claimed Trump won the election \"in a landslide,\" shared content related to QAnon, a baseless right-wing conspiracy theory, and said former special counsel Robert Mueller’s investigation of Russian election interference was a plot to force Trump out of office.", "RELATED: No evidence Dominion Voting Systems caused widespread tabulation errors that flipped votes for Biden", "We reached out to Powell for a copy of the affidavit she mentioned on Levin’s show or any other evidence to support her claim about Dominion Voting Systems and Smartmatic. We haven’t heard back.", "Powell told Levin that she emailed him a full copy of the affidavit, but we couldn’t find the document published in full by the radio host or any other media outlet.", "Powell posted screenshots of a few pages of the purported affidavit on her Twitter account. They cite an anonymous whistleblower who says voting machines run by Dominion, Smartmatic and other companies could be susceptible to fraud. The individual claims to have witnessed fraud conducted using Smartmatic voting machines in Venezuela in 2013.", "What’s visible in the screenshots does not substantiate Powell’s assertion about Dominion and Smartmatic. Other fact-checkers have debunked similar claims. Dominion and Smartmatic are two separate companies that create electronic voting systems. Neither was created for \"changing the results of elections.\"", "Dominion, a company that makes voting machines, was founded in 2003 and has headquarters in Denver and Toronto. Its technology is used to administer elections in 28 states.", "On its website, Dominion says it has no ties to Smartmatic, another firm that builds electronic voting systems.", "\"Dominion is an entirely separate company and a fierce competitor to Smartmatic,\" Dominion says on a rumor control page.", "Since Election Day, Dominion has been the subject of disinformation that seeks to undermine confidence in the integrity of the vote. We previously rated Pants on Fire a claim that the company flipped votes from Trump to Biden in states where the president has brought legal challenges.", "Smartmatic, which was founded in Boca Raton, Fla., in 2000 and is now based in London, has a similar statement on its website.", "\"Smartmatic’s software is not licensed or otherwise used by other companies,\" the statement says.", "Smartmatic voting systems have been used in elections around the world. In Venezuela, the company said its technology was manipulated to report a skewed tally in 2017, but Smartmatic said the incident was an anomaly and likely due to the lack of election monitors. The company stopped its work there in 2018.", "There is no evidence that technology linked to Smartmatic or Dominion is responsible for changing the outcome of the American presidential election. Smartmatic technology was not used in any of the battleground states won by Biden where Trump allies are disputing the results.", "RELATED: Trump’s tweet about 2.7 million deleted votes is baseless", "On its website, the U.S. Cybersecurity and Infrastructure Security Agency says bad actors would not be able to change vote counts without being detected even if they tried.", "\"The systems and processes used by election officials to tabulate votes and certify official results are protected by various safeguards that help ensure the accuracy of election results,\" the agency says. \"These safeguards include measures that help ensure tabulation systems function as intended, protect against malicious software, and enable the identification and correction of any irregularities.\"", "In a statement published Nov. 12 in partnership with election officials across the country, CISA said the 2020 election was \"the most secure in American history.\" An independent audit of Dominion voting machines in Georgia affirmed that finding.", "\"There is no evidence that any voting system deleted or lost votes, changed votes, or was in any way compromised,\" the statement says. \"While we know there are many unfounded claims and opportunities for misinformation about the process of our elections, we can assure you we have the utmost confidence in the security and integrity of our elections, and you should too.\"", "Powell’s claim is inaccurate and ridiculous. We rate it Pants on Fire!", "Associated Press, \"Smartmatic does not own Dominion Voting Systems,\" Nov. 17, 2020", "Businesswire, \"Smartmatic Announces Cease of Operations in Venezuela,\" March 6, 2018", "The Gateway Pundit, \"SIDNEY POWELL Drops a BOMB on Mark Levin Show: We Have Witness Who Was at Creation of Smartmatic System – Used to Change Election Results (VIDEO),\" Nov. 16, 2020", "Dominion Voting Systems, About page, accessed Nov. 19, 2020", "Dominion Voting Systems, SETTING THE RECORD STRAIGHT: FACTS & RUMORS, Nov. 17, 2020", "Georgia Secretary of State, SECRETARY RAFFENSPERGER ANNOUNCES COMPLETION OF VOTING MACHINE AUDIT USING FORENSIC TECHNIQUES: NO SIGN OF FOUL PLAY", "The New York Times, \"Trump keeps losing in court. He keeps losing his lawyers, too.\" Nov. 19, 2020", "The New York Times, \"Giuliani adds fuel to discredited theories about voting machines.\" Nov. 14, 2020", "The New York Times, \"Giuliani peddles election conspiracy theories and falsehoods.\" Nov. 17, 2020", "The New York Times, \"How Sidney Powell inaccurately cited Venezuela’s elections as evidence of U.S. fraud.\" Nov. 19, 2020", "The New York Times, \"‘Release the Kraken,’ a catchphrase for unfounded conspiracy theory, trends on Twitter.\" Nov. 17, 2020", "The New York Times, \"Venezuela Reported False Election Turnout, Voting Company Says,\" Aug. 2, 2017", "Politico, \"The #MAGA Lawyer Behind Michael Flynn’s Scorched-Earth Legal Strategy,\" Jan. 17, 2020", "PolitiFact, \"No evidence Dominion Voting Systems caused widespread tabulation errors that flipped votes for Biden,\" Nov. 13, 2020", "PolitiFact, \"No, US military did not raid election software company tied to Dominion,\" Nov. 17, 2020", "PolitiFact, \"Trump supporters falsely tie Nancy Pelosi to broader election misfire scheme,\" Nov. 9, 2020", "PolitiFact, \"Trump’s tweet about 2.7 million deleted votes is baseless,\" Nov. 12, 2020", "Smartmatic, About page, accessed Nov. 19, 2020", "Smartmatic, Smartmatic Fact-checked, accessed Nov. 19, 2020", "TikTok post", "Tweet from Sidney Powell, Nov. 16, 2020", "U.S. Cybersecurity and Infrastructure Security Agency, JOINT STATEMENT FROM ELECTIONS INFRASTRUCTURE GOVERNMENT COORDINATING COUNCIL & THE ELECTION INFRASTRUCTURE SECTOR COORDINATING EXECUTIVE COMMITTEES, Nov. 12, 2020", "U.S. Cybersecurity and Infrastructure Security Agency, #PROTECT2020 RUMOR VS. REALITY, accessed Nov. 19, 2020", "The Washington Post, \"Giuliani’s fantasy parade of false voter-fraud claims,\" Nov. 16, 2020", "The Washington Post, \"The Trump legal team’s latest voter fraud Hail Mary,\" Nov. 9, 2020", "YouTube video, Nov. 16, 2020", "YouTube video, Nov. 16, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]