["The video was uploaded to Facebook by a New Zealand-based user here. It has been viewed more than 25,000 times.", "Over the duration of the seven minute video doctor Samantha Bailey makes a number of claims about the Covid-19 PCR test; the claims have been broken down below.", "Dr Bailey has featured on the TVNZ-1 series The Checkup and runs her own YouTube channel called Dr. Sam Bailey which has over 90,000 subscribers. Her videos have over 6.8 million views.", "The video making claims about PCR testing in New Zealand was originally posted to YouTube here on September 2, 2020.", "The YouTube link has been interacted with on Facebook over 5,800 times after being posted by the Advance New Zealand and New Zealand Public Party (NZPP) page, here.", "AFP Factcheck has previously found claims made by NZPP leader Billy Te Kahika to be misleading, and showed that one of the joint Advance NZ/NZPP election campaign videos used misleadingly edited parliamentary footage.", "The claims made in the video by Dr Bailey are also misleading.", "Around the video's three-minute, thirty-second mark Bailey says “there are major problems with this diagnostic test, in that it doesn’t test for the virus, it tests for a piece of genetic material that we don’t know the significance of”.", "Thomas Lumley, professor of biostatistics at the University of Auckland told AFP in an email the genetic material the Covid-19 PCR tests for is “of known significance”.", "“The test looks for RNA sequences that are present in the SARS-CoV-2 virus (Covid-19 virus) which are not present in other viruses known to infect humans,” he said in a September 11 email.", "John Mackay, technical director of testing and diagnostics company DNature Diagnostics, also told AFP via email “the PCR test does test for the [Covid-19] virus”.", "“It tests for and detects specific RNA sequences to the virus. Positive results are confirmed with multiple independent PCR tests to confirm the positive result is due to SARS-2-CoV,” Mackay said in a September 11 email.", "Comparing the Covid-19 PCR test used in New Zealand to the ‘gold standard’ test", "At the video's three-minute, forty-second mark, Bailey then claims that “the PCR test has never been compared to a gold standard, because there is none for Covid-19, and that makes interpreting the accuracy of positive and negative results problematic.”", "Professor David Murdoch, microbiologist and Dean at the University of Otago campus in Christchurch, told AFP in an email that while there is no “real gold standard” the Covid-19 PCR test could be considered “as nearly the gold standard”.", "“We typically say a gold standard is the gold-plated reference standard that we can compare every other test to. The problem is once you have the best test, what do you compare the best test to.", "“That’s the inherent problem with PCR tests, whether it is Covid-19 or anything else; how do you know how good it is when it’s the best one,” he said.", "The one test that scientists could compare the PCR to is the culture test, where the virus is grown in a lab eliciting very few false positives, but even that has its problems, Professor Murdoch added.", "“The reality at the moment is that there are very few labs doing it and it’s only a partial comparison, because there are lots of false negatives.”", "Mackay from DNature Diagnostics also said “the qPCR testing methodology in use for Covid-19 is the gold standard for many respiratory viruses, bacteria and other pathogens”.", "Some four-minutes, ten-seconds into video Dr Bailey states: “The PCR test is supposed to be used as a diagnostic test not as a screening test” and equates the positive results of cases of asymptomatic Covid-19 carriers with allegedly “inappropriate” use of the PCR test.", "“The difference between a diagnostic test and screening test is that patients who undergo screening do not have symptoms,” Bailey says.", "“But you might think lots of people have tested positive for Covid-19 who don’t have symptoms? Exactly how can one interpret this?”", "“It’s because medical staff are testing people inappropriately, you can’t use a diagnostic test as a screening test,” according to Bailey.", "Professor Murdoch said the claim that a screening test cannot be used as a diagnostic test is “simply not true” and the dichotomy between the two is not about the efficacy of the technology, but the purpose of the test.", "“Yes, some tests may be better when used for screening, but to say a test can only be used for screening and this test can only be used for diagnosis, is wrong and overly simplistic,”", "“You can use the same test for both screening and diagnosis, for example in breast cancer screening you would use the same technology for screening as you would if a woman had a lump in her breast [diagnostic test].", "“When it comes to Covid-19 the PCR is the test of choice in both situations,” he said", "Professor Lumley said some tests are only suitable for either screening or diagnosis and others are fine for both, with the Covid-19 PCR test an “an excellent screening test” and also a “good” diagnostic test.", "“In practice, New Zealand uses a combination of PCR and antibody tests for diagnosis, where the antibody test is more reliable in people who have been symptomatic for several days,” he added.", "At around four-minute, forty five-seconds into the video Bailey also details the rollout of New Zealand's pop-up testing regime which tested asymptomatic and symptomatic people in the country, implying it is linked to the current outbreak in Auckland.", "“In August, all of a sudden community Covid-19 testing stations were opening up again, with money available to start surveillance testing. This rolled out across the country with pop up testing centres, looking to test people without symptoms.", "“Soon enough there were four new cases in Auckland from an unknown source on the 11th of August, and then all hell broke loose and Auckland was put into level three lockdown while the rest of the country went up to level two,\" Bailey claims.", "She then goes on to state at around five-minutes thirty three-seconds into the video that “there was a change from the Ministry of Health on how testing was being done...which was that asymptomatic people were now being made to have Covid-19 PCR tests”.", "While asymptomatic testing has expanded  in August, asymptomatic people were also being tested for Covid-19 “in April and May to inform the decision to relax the alert levels,” according to Professor Lumley.", "In a September 16 email, the New Zealand Ministry of Health confirmed that asymptomatic testing was carried out “in late April to inform the move from Alert Level 3 to 2”.", "“This testing provided reassurance that there wasn’t any undetected spread in the community,” the Ministry of Health spokesperson added.", "The first confirmed case in the current Auckland outbreak “was tested because they were symptomatic” the Ministry of Health spokesperson said.", "This notification from the New Zealand Ministry of Health announcing the new cases of Covid-19 on August 11, stated the index patient had been “symptomatic for five days” before being tested.", "Mackay from DNature Diagnostics said that a level of surveillance testing is required to show that there is no hidden transmission in the community.", "“To say this testing is to blame for the 4 new cases in New Zealand (after 100 days) sounds like Donald Trump [saying] ‘lets reduce our numbers by reducing the testing’,” Mackay added.", "Professor Murdoch also labelled Bailey's argument “Trumpian” and there was no connection between the asymptomatic testing regime in New Zealand and the August outbreak.", "“The natural extension of which is that if we stop testing the pandemic will go away. The Auckland cluster didn’t just appear after asymptomatic testing started,” he explained.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]