["The video was posted here on Facebook on July 23, 2020. It has been viewed more than 900 times.", "The 30-second video shows the whirring motor blades of a parked helicopter hit a passing truck, clipping its roof.", "The post’s romanized Punjabi caption translates to English as: “Only in India… an accident between a truck and a helicopter at Ratan Singh Chowk in Amritsar.”", "Ratan Singh Chowk is an intersection in Amritsar, a city in the north Indian state of Punjab.", "The video was also shared alongside a similar claim here, here, here and here on Facebook; as well as here, here, here and here on Twitter.", "The claim, however, is false.", "A keyword search on Google found a longer version of the video published here on YouTube on January 19, 2020.", "The footage in the misleading post corresponds with the YouTube video from the 25-second mark.", "The video description reads, in part: “18/01/2020 / A truck collided with a helicopter from the SSP-AC (Acre Public Security Secretariat), this Saturday, in the state capital, Rio Branco, Brazil. According to initial information, no one was hurt by the accident.”", "Rio Branco is a municipality that serves as the capital of the state of Acre in Brazil.", "A further keyword search based on the location indicated in the description of the YouTube video found the incident was reported here by the Brazilian television network Record News on January 18, 2020.", "The Portuguese-language headline translates to English as “Trailer truck hits helicopter propeller in Acre,” and the report reads: “A truck collided with a helicopter from the SSP-AC (Acre Public Security Secretariat), this Saturday, in the state capital, Rio Branco.”", "Below is a screenshot comparison of the video in the misleading post (L) and the video in the Record News report (R):", "The collision was also reported by other Brazilian news sites, including Midia News here and Olhar Alerta here, in January 2020.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]