["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Steel coils sit on wagons when leaving a steel factory in Germany on March 2, 2018, as the U.S. was considering tariffs on steel and aluminum imports. (AP/Martin Meissner)", "President Donald Trump announced a 25 percent tariff on steel and 10 percent tariff on aluminum, a move that Trump argued would protect an American metals industry beleaguered by foreign imports.", "\"We’re doing tariffs on steel. We cannot lose our steel industry. It’s a fraction of what it once was. And we can’t lose our aluminum industry. Also a fraction of what it once was,\" Trump said March 6, two days before the tariffs were officially signed.", "We decided to take a closer look at how these industries have fared over time.", "Trump is correct that employment numbers for metals have fallen sharply.", "Steel and aluminum employment is significantly lower today than decades past. According to an analysis by the Council on Foreign Relations, U.S. steel employment peaked around 650,000 jobs in the 1950s, compared to around 140,000 today.", "An analysis by Bloomberg shows some 50,000 aluminum production jobs have disappeared since 1990, a roughly 46 percent reduction. As of December 2017, there were roughly 59,000 aluminum production jobs, according to Bloomberg.", "Experts cited a number of reasons why the metals industry has shed jobs, from improved factory logistics to the diminished power of unions to protect even unproductive workers. But the consensus view is that the biggest cause has been technological advances.", "\"In terms of employment, the big story is automation across the board,\" said Gary Clyde Hufbauer, a fellow at the Peterson Institute for International Economics, which generally supports free trade.", "So how many of these jobs were squeezed out by foreign imports?", "J. Bradford Jensen, a professor of international business at Georgetown University’s McDonough School of Business, told us that \"imports did have something to do with the loss of employment in steel and aluminum, but the more important factor is technological change and productivity growth.\"", "\"Tariffs won't change that, much like relaxing regulations on coal and pollution will not bring back many coal-mining jobs,\" he said.", "In short, compared with decades past, the U.S. metals industry can now do more with less.", "\"If you want to know why the steel industry employs so fewer workers than in decades past, there is the answer,\" wrote Daniel Griswold, a senior researcher at the free-market Mercatus Center at George Mason University.", "So Trump is correct that employment levels in the the metal industry are a fraction of what they once were, though it’s worth noting experts tended to attribute this more to automation than foreign imports.", "Evaluating Trump’s statement is trickier when it comes to steel and aluminum production.", "The United States produced about 82 million tons of raw steel in 2017, according to a U.S. Geological Survey estimate. As the chart below shows, that’s well below the peak 137 million tons of steel produced in 1973.", "Steel production was certainly higher during the 1960s and 1970s. However, other than these two decades, U.S. steel output has occupied a fairly narrow band in the post-war era, and current output levels far exceed production levels from before 1940.", "Experts we spoke to said it’s important to look at these numbers in context.", "Looking only at metric tons of production would not reflect improvements in product quality, for example, or declines in demand. Some noted that the primary metals industries now make up a smaller share of the modern economy than they did in the past.", "Aluminum is also a bit tricky because there are multiple ways to measure production.", "One method, known as primary production, involves producing aluminum from raw materials. U.S. primary production of aluminum rose steadily from the post-war era until around 1980, when it began a steady decline.", "That same period saw increased use of the secondary production, a manner of making aluminum from recycled scrap. Secondary production increased from 22 percent of aluminum production in 1980, to 64 percent of domestic production in 2016, according to the Commerce Department.", "Due to its robust aluminum recycling industry, the United States now leads the world in secondary aluminum production, according to the Commerce Department.", "\"The recycling part is interesting in that it makes the point of declining need to worry about imports,\" said Michael J. Hicks, director of the Center for Business and Economic Research at Ball State University. \"Use of aluminum is rising, but we aren’t extracting as much from the ground as we used to, in part because almost all the nation now recycles metals.\"", "Trump said the U.S. steel and aluminum industry is \"a fraction of what it once was.\"", "Trump is correct that employment levels in the metal industry are a fraction of what they once were, though experts attribute this more to automation than foreign imports.", "Steel output is also not the highest it’s ever been, though experts said it’s important to consider steel production in a broader context that includes improvements to steel as well as how output has responded to declining demand.", "While the amount of aluminum made from raw materials has declined since the early 1980s, the output of aluminum made from recycled materials has fairly steadily climbed since WWII, and the United States now leads the world in secondary aluminum production.", "We rate this Mostly True.", "Bloomberg, \"Steel and Aluminum Jobs Don't Add Up to Much,\" March 2, 2018", "Daniel Griswold, \"The Real Story Behind the Loss of Steelworker Jobs,\" July 5, 2017", "PunditFact, \"Has automation driven job losses in the steel industry?\" March 8, 2018", "Council on Foreign Relations, \"The Risks of U.S. Steel and Aluminum Tariffs,\" March 8, 2018", "Commerce Department report, \"The Effect of Imports of Steel on the National Security,\" Jan. 11, 2018", "Email interview with Gary Burtless, senior fellow with the Brookings Institution, March 9, 2018", "Email interview with Michael J. Hicks, director of the Center for Business and Economic Research at Ball State University, March 12, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]