["About this rating", "On 16 March 2017, conservative legal activism group Judicial Watch published a blog post in which they claimed the Internal Revenue Service had favored \"After School Satan\" secularist clubs by \"fast tracking\" their tax exempt status:", "While the Internal Revenue Service (IRS) makes conservative groups wait years for tax-exempt status an “After School Satan Club” launched to hinder Christian-based counterparts got its nonprofit ranking in just ten days, records obtained by Judicial Watch show. The classification is offered to charitable, religious and educational organizations that operate as nonprofits...", "In the meantime, leftist groups like the Satan club got fast tracked. The principle goal of establishing the Satan clubs in public schools throughout Washington State appears to be to counter existing enterprises operated by a Christian-based group.", "Although Judicial Watch claims to have obtained documents that prove their claim, the documents they provide do no such thing; they obtained filings for Reason Alliance, a nonprofit organization that sponsors the After School Satan clubs, but the clubs were not created until two years later and do not have their own independent nonprofit status.", "Judicial Watch obtained and published an application by Reason Alliance Ltd for tax exempt status which was signed on 21 October 2014. They also published the IRS's response notifying the group they had been approved for status as a \"private foundation\" on 31 October 2014. Neither the letter from the IRS or the application make mention of After School Satan clubs or the \"fast tracking\" of the application.", "According to a statement released by the Satanic Temple, an activist group that created the After School Satan program in 2016 to counter a Bible study group in public schools, the clubs were sponsored by Reason Alliance to pay for things like operating costs and insurance:", "Satan Clubs are sponsored by the non-profit 501(c)(3), Reason Alliance, Ltd.; however, Reason Alliance earned its tax-exempt status long before ASSC existed and did not, despite claims, receive its exemption in 10 days. Further, nothing in the filings for Reason Alliance make reference to Satan or Satanism. Clearly, any insinuations that “Obama’s IRS” struck a secret alliance with Satanists are nothing more than an absurd fabrication. ...", "Reason Alliance, Ltd., was formed in 2014 by the founders of The Satanic Temple (TST). The non-profit was set up to encourage reason and empathy, reject tyrannical authority, promote justice, and advocate pragmatic common sense. Reason Alliance also supports activities that advance these core values. When the After School Satan Club was formed in July 2016, Reason Alliance was used to sponsor this program as ASSC operations are consistent with its mission statement. This sponsorship supports The Satanic Temple’s After School Satan Club by way of covering the rental fees and liability insurance coverage required by law. The assertion by Judicial Watch and all other news outlets that ASSC is somehow itself a tax exempt entity or operated by Reason Alliance Ltd. has no grounding in reality nor does the documentation they’ve obtained support this claim.", "The Satanic Temple is a secular activist group that leverages the legal system to promote plurality and counter what they view as overreach by Christianity in the public sphere (they do not promote worshiping Satan or anyone else, but have seven tenets that are similar to secular humanist beliefs). Their co-founder and spokesman Lucien Greaves told us that neither the Satanic Temple nor the After School Satan clubs sought or received tax-exempt status. Reason Alliance was created in 2014 to be a place \"where donors who support TST's tenets and who want tax deductions for donations can have an entity to donate to.\"", "The Satanic Temple is known for bringing legal challenges against religious monuments by seeking to place their own goat-headed statue of Baphomet nearby and placing pentagrams next to Nativity scenes during the holiday season. Pushback against their tactics often results in acknowledgement that \"religious freedom\" refers to more than mainstream beliefs. True to form, the Satanic Temple launched a nationwide campaign in the summer of 2016 establishing After School Satan clubs in public schools that had Good News Clubs, evangelist after-school Christian clubs for schoolchildren. The Washington Post was the first to break the story on 30 July 2016:", "The Satanic Temple — which has been offering tongue-in-cheek support for the fallen angel in public arenas that have embraced prayer and parochial ceremonies — is bringing its fight over constitutional separation of church and state to the nation’s schools.", "But the group’s plan for public schoolchildren isn’t actually about promoting worship of the devil. The Satanic Temple doesn’t espouse a belief in the existence of a supernatural being that other religions identify solemnly as Satan, or Lucifer, or Beelzebub. The Temple rejects all forms of supernaturalism and is committed to the view that scientific rationality provides the best measure of reality.", "According to Mesner, who goes by the professional name of Lucien Greaves, “Satan” is just a “metaphorical construct” intended to represent the rejection of all forms of tyranny over the human mind.", "The curriculum for the proposed after-school clubs emphasizes the development of reasoning and social skills. The group says meetings will include a healthful snack, literature lesson, creative learning activities, a science lesson, puzzle solving and an art project. Every child will receive a membership card and must have a signed parental­ permission slip to attend.", "Greaves sent us a copy of one of the first letters sent by the organization to a school district asking to operate a \"Satan club\" on school grounds. The letter is dated 1 August 2016, and was sent to the superintendent of Neah-Kah-Nie School District in Rockaway Beach, Oregon:", "On June 11, 2001, the U.S. Supreme Court ruled that Child Evangelism Fellowship could have access to public school facilities to conduct Good News Club meetings. The decision stated that religious clubs such as the Good News Club must be given the same access to school facilities accorded any other non-school related group.", "Many school districts across the country (including yours) have (or have had) Good News Clubs using their facilities. As a result, those schools have opened their doors to school clubs of all religious viewpoints. While The Good News Club is “working together with parents and the school to build solid moral and spiritual character into the lives of their children” based on their religious point of view, The Satanic Temple (TST) also has plans to enrich the lives of children in your district.", "TST is a religious organization that seeks to encourage benevolence and empathy among all people. In addition, TST embraces practical common sense and promotes justice. TST facilitates the communication and mobilization of politically aware Satanists, secularists, and other advocates for individual liberty.", "Forbes contributor and certified public accountant Peter J. Reilly wrote on 26 March 2017 that the timeframe from which the group submitted their application to when they received approval was probably influenced by the fact the IRS had been criticized over 2013 allegations that staffers had discriminated against conservative groups. The agency's response was to create an expedited process for small organizations to more swiftly acquire an approval or denial on their tax-exempt status:", "[T]he competing narrative accepted by the IRS is that the scandal was a service failure. Even if the Tea Party groups were not eligible for the exemption status they applied for, they had the right to get a decision one way or another. Actually the IRS might have come out of this better if they had issued a batch of denials, since the groups that wanted to take a denial to court would have had to talk about what they had been doing themselves rather than focus solely on what the IRS did wrong.", "One of the IRS response to the service failure was to provide an expedited exemption process for smaller groups (Less than $50,000 in income and $250,000 in assets). Form 1023-EZ is two pages as opposed to 26 pages for Form 1023. It is filed electronically and according to this story in the Journal of Accountancy, average processing time is thirteen days. Lucien told me that it had actually taken five weeks, but he was measuring from the time they hired a lawyer to set the group up. Sending the exempt application to the IRS was likely about the lawyer's last step.", "We found no evidence to support the claim that After School Satan clubs were the beneficiaries of \"fast tracking\" by the IRS to help them swiftly gain tax exempt status.", "Judicial Watch. \"IRS Gives “After School Satan Club” Tax-Exempt Status in 10 Days.\"\r\n  16 March 2017.", "Blythe, Chalice, and de Haan, Stu. \"Judicial Watch Creates Bizarre Fabricated News Story Claiming IRS Gave After School Satan Club “Fast-Track” Tax Exemption.\"\r\n  After School Satan Club press release.", "Stewart, Katherine. \"An After School Satan Club Could Be Coming to Your Kid’s Elementary School.\"\r\n  The Washington Post. 30 July 2017.", "KFOR-TV. \"Satanic Temple Looking for New Home for Baphomet Statue After Oklahoma Court’s Ruling.\"\r\n  2 July 2015.", "Reilly, Peter J. \"The Devil and Lois Lerner.\"\r\n  Forbes.26 March 2017.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]