["The photo was published here on Facebook on March 3, 2021.", "The post’s Korean-language caption translates to English as: \"They disclosed the scene of the Italian President being arrested.\"", "The English-language text overlay on the post's image reads in part: \"Looks like it's starting... Italy's President arrested over ties in meddling in United States 2020 President election!\"", "Sergio Mattarella became Italy's president in January 2015.", "An identical image was also shared alongside a similar claim on Facebook here, here and here.", "The claim, however, is false. The man in the photo is former American military analyst Daniel Ellsberg.", "A reverse image search on Google found the photo was originally published here on March 20, 2011, by news agency Associated Press (AP).", "The photo's caption reads in part: “Daniel Ellsberg, left, the former military analyst who in 1971 leaked the Pentagon Papers, is processed for arrest by a Virginia State troopers following his arrest after a Sunday afternoon, March 20, 2011, rally near the main gate of Marine Corps Base Quantico, Va.”", "Below is a screenshot comparison of the photo shared in the misleading Facebook post (L) and the AP photo (R).", "Ellsberg famously leaked thousands of documents half a century ago revealing that successive US administrations had lied to the public about the Vietnam war, AFP reported here.", "He was one of more than 30 people arrested in March 2011 during a protest against the Iraq war, according to this Politico report published on March 21, 2011.", "As of March 5, 2021, there were no credible reports or statements indicating that Italian President Sergio Mattarella had been arrested.", "The latest update on the president's official website shows him in talks with the Vatican and Italian delegations at Palazzo Borromeo, Italy on the anniversary of the Lateran pacts and the Concordat's revision on March 2, 2021.", "AFP Fact Check has previously debunked a similar claim that Mattarella was arrested.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]