["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "An attack ad on Facebook features a Hispanic family sitting around the dinner table, bemoaning Gov. Rick Scott’s immigration policies.", "\"This is our family, but if Rick Scott had his way he would encourage racially profiling immigrant communities here in Florida,\" said the narrator. \"He also opposed allowing Dreamers to remain in the U.S. Families belong together. Rick Scott turned his back on ours.\"", "Two Democratic groups, Priorities USA Action and the Senate Majority PAC, paid for the ad and placed it on a Facebook page, Nuestra Florida, which translates to Our Florida.", "Scott, a Republican two-term governor, is challenging Democrat U.S. Sen. Bill Nelson.", "The lead-in text above the video offers a hint that the reference was to past statements by Scott (emphasis ours): \"Rick Scott vowed to implement racial profiling laws in Florida and wanted to exclude Dreamers from citizenship.\"", "But this attack amounts to cherry-picking. Scott softened his stance on illegal immigration years ago and does not have those positions anymore.", "This attack is misleading. The fine print shows it is in reference to a position Scott took during a GOP primary in 2010.", "The video cites a sentence from a 2010 TIME magazine article about the Florida 2010 governor’s race. It says, \"Scott favors Arizona’s draconian anti-illegal-immigration law.\"", "Scott did promise then to bring a law similar to Arizona’s SB 1070 to Florida.", "The 2010 Arizona law made being an undocumented immigrant a state crime and required legal immigrants to carry papers to confirm their legal status. Critics said it would lead to racial profiling, prompting state officials to add to the law that police \"may not consider race, color or national origin.\"", "Scott argued in 2010 that the law wasn’t racial profiling and said, \"I clearly don't believe in racial profiling.\"", "But Scott never pushed for such a law after he was elected, breaking his promise.", "A spokesman for Priorities USA Action said the result shouldn’t matter to people who saw the Facebook post.", "\"We say that he vowed to implement laws like Arizona,\" Priorities USA Action spokesman Josh Schwerin said. \"Just because he didn’t get it done doesn’t mean he didn’t pledge to do it.\"", "In 2012, the U.S. Supreme Court found parts of the Arizona law unconstitutional but upheld the central requirement calling on officers to check the status of people they suspect were undocumented immigrants.", "This attack zeroes in on Scott’s statements against Dreamers early in his tenure. It, too, ignores that his more recent position is more favorable to this group of immigrants.", "Dreamers are immigrants brought over to the U.S. illegally by their parents when they were children.", "Just weeks before he took office, Scott spoke against a DREAM Act bill in Congress.", "\"I'm against the Dream Act,\" he said in December 2010. \"Why? I don't believe in amnesty.\"", "In 2013, Scott vetoed a bill to let Dreamers get driver’s licenses. Scott criticized the Obama administration’s 2012 Deferred Action for Childhood Arrivals as a policy \"absent congressional direction.\" (DACA allowed these illegal immigrants to apply for temporary status — Trump later rescinded it.)", "Scott also argued that the Florida driver’s license bill was unnecessary because those with a federal employment authorization card could already obtain a temporary driver license.", "But in 2014 as he was seeking re-election, Scott signed a bill to give Dreamers in-state tuition.", "\"Students who have spent their childhood here in Florida deserve to qualify for the same in-state tuition,\" he said.", "That was a Full Flop from 2011 when he said \"with regard to in-state tuition for illegal immigrants I completely oppose it.\"", "In September 2017, when Trump was deciding whether to dismantle DACA, Scott issued a statement saying, \"I do not favor punishing children for the actions of their parents.\"", "\"These kids must be allowed to pursue the American Dream, and Congress must act on this immediately,\" he said.", "He elaborated on his point in a January 2018 USA Today calling for Congress to \"secure the immigration status of Dreamers,\" a reference to Trump saying he would extend protections to Dreamers. Scott called on Congress to \"do the right thing for these kids by removing the uncertainty hanging over their future goals and dreams.\"", "While an extension of deferred action is not the same as citizenship, it is clear that Scott moderated his view and became more open to Dreamers having a way to legally stay in the United States.", "A Facebook ad by Democratic groups said, \"If Rick Scott had his way he would encourage racially profiling immigrant communities here in Florida. He also opposed allowing Dreamers to remain in the U.S.\"", "This ad leaves viewers with the misleading impression that these are current Scott policies. Neither is true.", "Scott did promise in 2010 to bring Arizona’s immigration law to Florida. Immigration advocates feared the law would lead to racial profiling. Once Scott was elected, he never pursued the idea.", "Scott was a bit more active in his earlier opposition to allowing Dreamers to stay in the country, but that has also changed. He publicly objected to Obama’s deferred action program for people who came into the country illegally as children, saying Obama bypassed Congress. Scott also vetoed a bill to give Dreamers driver’s licenses. But in 2014, Scott signed a bill to give Dreamers in-state tuition and in the past year he has spoken in favor of helping Dreamers.", "In total, the ad creates a misleading impression that Scott is anti-immigrant by only drawing on part of his record. We rate this claim Mostly False.", "Priorities USA Action/Senate Majority PAC, Facebook ad, Oct. 29, 2018", "Sun Sentinel, \"Top Florida lawmaker is pushing for an Arizona-style crackdown on illegal immigration,\" May 28, 2010", "TIME, \"Florida Governor: Alex Sink vs. Rick Scott,\" Oct. 28, 2010", "NAACP, Press release, June 16, 2010", "Rick Scott, Campaign press release, May 11, 2010", "The Hill, \"Poll: Nearly 9 in 10 want DACA recipients to stay in US,\" Jan. 8, 2018", "NPR, \"NPR Poll: 2 In 3 Support Legal Status For DREAMers; Majority Oppose Building A Wall,\" Feb. 6, 2018", "Miami Herald, \"Rick Scott: take up DACA later if that's what it takes to get the government running,\" Jan. 22, 2018", "Gov. Rick Scott op-ed in USA Today, \"On DREAMers and border security, Congress should just do it: Gov. Rick Scott,\" Jan. 16, 2018", "Orlando Sentinel, \"Democrats blast Gov. Scott on his shifting immigration stance,\" Jan. 20, 2018", "New York Times, \"Florida Advances Tuition Aid for Children Brought to U.S. Illegally,\" May 2, 2014", "Miami Herald, \"Florida Gov. Rick Scott signs bill to give in-state tuition to undocumented students,\" June 9, 2017", "Washington Post, \"Republicans press Trump to save DACA,\" Sept. 2, 2017", "Miami Herald, \"Rick Scott: take up DACA later if that's what it takes to get the government running, Jan. 22, 2018", "Miami Herald, Rick Scott appears to support Curbelo's immigration plan, but how would he vote?\" June 8, 2018", "The Boston Globe, \"Court backs immigrant status checks, strikes down other portions of Ariz. law,\" June 26, 2012", "Arizona Republic, \"Arizona settles final issues of SB 1070 lawsuit,\" Sept. 16, 2018", "U.S. Supreme Court, Arizona et al vs United States, June 25, 2012", "PolitiFact’s Scott-O-Meter, \"Bring Arizona's immigration law to Florida,\" June 25, 2012", "PolitiFact’s Scott-O-Meter, \"Will fight immigration amnesty,\" July 2, 2014", "PolitiFact, \"Rick Scott opposed in-state tuition for DREAMers before he embraced it,\" May 2, 2014", "PolitiFact, \"Rick Scott says bill he vetoed to give driver licenses to DACA immigrants changed 'nothing,\" Oct. 20, 2014", "PolitiFact, \"Rick Scott opposed in-state tuition for DREAMers before he embraced it,\" May 2, 2014", "PolitiFact, \"Rick Scott says Arizona law allows police to ask about immigration status,\" June 17, 2010", "PolitiFact, \"Arizona immigration law rewrite 'lays to rest' worries about racial profiling, Brewer says,\" May 4, 2010", "PolitiFact’s Trump-O-Meter, Terminate Barack Obama's immigration executive orders 'immediately,'\" Aug. 6, 2018", "Interview, McKinley Lewis, Gov. Rick Scott office spokesman, Oct. 29, 2018", "Interview, Lauren Schenone, Gov. Rick Scott campaign spokeswoman, Oct. 29, 2018", "Interview, David Harris, University of Pittsburgh law professor, Oct. 31, 2018", "Interview, Josh Schwerin, Priorities USA Action spokesman, Oct. 29, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]