["About this rating", "Biden did once say, \"[If] you want to keep someone away from your house, just fire the shotgun through the door.\"", "Biden's remarks were part of a broader argument against the usefulness and necessity of owning a semi-automatic AR-15 rifle for self-defense.", "In December 2018, a pro-gun rights Facebook page posted a meme that showed former U.S. vice president Joe Biden advocating the use of a shotgun over a semi-automatic rifle for the purpose of self-defense.", "On 18 December, \"Firearms Policy Coalition\" posted the meme, which contained a photograph of Biden along with the quotation: \"Well, you know, my shotgun will do better for you than your AR-15, because if you want to keep someone away from your house, just fire the shotgun through the door.\"", "This is an authentic quotation, although the meme didn't present the full context in which Biden made those remarks. They were part of a broader argument against the usefulness and necessity of the AR-15 rifle for personal protection.", "In February 2013, Biden gave an interview to Field & Stream magazine on the subject of gun violence and gun control. He was asked about the regulation of the very popular AR-15 semi-automatic rifle and its uses in hunting, self-defense, and target practice. Biden played down the use of such a weapon in hunting, saying: \"If you have to go up into the Poconos and go bear hunting or deer hunting with that weapon, and you need a clip that has 30 rounds in it, then you shouldn't be hunting. You're a danger to yourself. If you can't get the bear or the deer in four or five shots, you've got a problem.\"", "When the interviewer asked \"What about the other uses, for self-defense and target practice?\", the Vice President responded as follows:", "Well, the way in which we measure it is -- I think most scholars would say -- is that as long as you have a weapon sufficient to be able to provide your self-defense. I did one of these town-hall meetings on the Internet and one guy said, \"Well, what happens when the end days come? What happens when there's the earthquake? I live in California, and I have to protect myself.\"", "I said, \"Well, you know, my shotgun will do better for you than your AR-15, because [if] you want to keep someone away from your house, just fire the shotgun through the door.\" Most people can handle a shotgun a hell of a lot better than they can a semiautomatic weapon in terms of both their aim and in terms of their ability to deter people coming. We can argue whether that's true or not, but it is no argument that, for example, a shotgun could do the same job of protecting you. Now, granted, you can come back and say, \"Well, a machine gun could do a better job of protecting me.\" No one's arguing we should make machine guns legal.", "The quotation included in the meme is therefore authentic, but a couple of contextual points should be noted.", "First, Biden was speaking favorably about the use of a shotgun for self-defense in comparison with the use of an AR-15. He was not promoting shotguns in a television commercial nor recommending their use on his own initiative. He was making a broader point about what he perceived as the limited justifications for owning and using an AR-15 rifle after having been asked about the issue of self-defense specifically.", "Second, the quotation from the meme was actually an instance of Biden paraphrasing himself, recalling an online forum in which he had earlier participated. It's not clear which conversation Biden was recalling, but it might have been one hosted by Parents magazine on 20 February 2013, which attracted news coverage for similar remarks the vice president made about the preferability of a shotgun over an AR-15.", "A Facebook viewer submitted the following question: \"Do you believe that banning certain weapons and high-capacity magazines will mean that law-abiding citizens will then become more of a target to criminals, as we will have no way to sufficiently protect ourselves?\" Biden responded to say:", "If you want to protect yourself, get a double-barrelled shotgun, have the shells, a 12-gauge shotgun, and I promise you, as I told my wife -- we live in an area that's wooded and somewhat secluded -- I said \"Jill, if there's ever a problem just walk out on the balcony here, walk out, put that double-barrelled shotgun and fire two blasts outside the house.\" I promise you, whoever's coming in is not -- you don't need an AR-15. It's harder to aim, it's harder to use, and in fact you don't need 30 rounds to protect yourself. Buy a shotgun. Buy a shotgun.", "This was not exactly the exchange Biden recalled in his later interview with Field & Stream magazine (the questioner made no mention of living in California or fearing for her safety \"when the end days come\"). But the vice president's broader point was the same: In his opinion, the high-capacity magazines of a semi-automatic rifle such as the AR-15 were unnecessary for personal protection, and the AR-15 was much less well-suited to that task than a shotgun.", "Licata, Anthony.   \"The F & S Gun Rights Interviews: Joe Biden, Vice President of the United States.\"\r\n    Field & Stream.   25 February 2013.", "The Guardian.   \"Joe Biden: Buy a Shotgun, Not an Assault Rifle, to Protect Your Home.\"\r\n    20 February 2013.", "Bendery, Jennifer.   \"Joe Biden Says No Need to Own Assault Weapons: 'Buy a Shotgun!'\"\r\n    Huffington Post.   19 February 2018.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]