["About this rating", "On Feb. 28, 2020, the website PJ Media published an article claiming that U.S. President Barack Obama had waited until millions were infected and thousands were dead from swine flu, the H1N1 virus, before declaring a public health emergency in 2009. The article, which was presented as a \"fact check,\" got several simple details wrong.", "In response to criticism of U.S. President Donald Trump's handling of a recent outbreak of a new coronavirus, the PJ Media article opined that Obama had been lackadaisical about his response to a health emergency back in 2009, and that Trump by comparison had done his job admirably.", "PJ Media writes:", "Surely, St. Barack of Obama would have dealt with this horrible pandemic better than Orange Man Bad, right? No-Drama-Obama had this whole thing under control, of course!", "Well, let's compare and contrast...", "Now, let's go to the Wayback Machine. In April of 2009, the H1N1 became a pandemic.", "But it wasn't until six months later, October, that then-President Obama declared a public health emergency on what was already a pandemic. By that time, the disease had infected millions of Americans and more than 1,000 people had died in the U.S.", "There are several factual inaccuracies in this excerpt alone. For instance, PJ media writes that H1N1 became a pandemic in April 2009. But that's not the case. The disease emerged in April but wasn't declared a pandemic until June.", "The excerpt also claims that Obama \"declared a public health emergency on what was already a pandemic\" in October 2009. But this is also wrong. Obama declared a national emergency, not a public health emergency, in October 2009. The Obama administration declared a public health emergency in April, months before swine flu was declared a pandemic. At the time that the Obama administration declared a public health emergency, only 20 confirmed cases (not over a million) of H1N1 existed in the United States.", "The New York Times reported on April 26, 2009:", "Responding to what some health officials feared could be the leading edge of a global pandemic emerging from Mexico, American health officials declared a public health emergency on Sunday as 20 cases of swine flu were confirmed in this country, including eight in New York City.", "[...] The emergency declaration in the United States lets the government free more money for antiviral drugs and give some previously unapproved tests and drugs to children. One-quarter of the national stockpile of 50 million courses of antiflu drugs will be released.", "PJ Media also inaccurately presented a video in the article as if it showed Obama addressing the swine flu after it had \"already become a pandemic.\" Again, that simply isn't the case. When Obama addressed the nation about swine flu, or H1N1, in April 2009, the disease was just starting to spread. It wouldn't be until June 2009 that the swine flu would be declared a pandemic.", "Here's Obama's April 2009 address:", "https://www.youtube.com/watch?v=Imi5M38n4pc&feature=emb_title", "The swine flu pandemic spread quickly across the United States starting in April 2009. There were approximately 60 million cases over the course of the following year, which resulted in nearly 275,000 hospitalizations and more than 12,000 deaths.", "The Centers for Disease Control and Prevention (CDC) has a detailed timeline of this pandemic on its website. It shows that the CDC first activated its Emergency Operations Center (EOC) on April 22, 2009. At the time, there were only two confirmed cases in the United States. On April 25, 2009, the World Health Organization (WHO) declared a public health emergency of international concern, and the following day the Obama administration did the same. At that time, there were about 20 confirmed cases.", "Despite the CDC's efforts, the swine flu continued to spread. Kathleen Sebelius, secretary of health and human services, renewed the emergency declaration on July 24, 2009, and then again on Oct. 1, 2009. On Oct. 24, 2009, Obama declared a national emergency that gave officials more resources to fight the pandemic.", "The Associated Press reported:", "President Barack Obama has declared the swine flu outbreak a national emergency, giving his health chief the power to let hospitals move emergency rooms offsite to speed treatment and protect noninfected patients.", "The declaration, signed Friday night and announced Saturday, comes with the disease more prevalent than ever in the country and production delays undercutting the government's initial, optimistic estimates that as many as 120 million doses of the vaccine could be available by mid-October.", "[...]", "On April 26, the administration declared swine flu a public health emergency, allowing the shipment of roughly 12 million doses of flu-fighting medications from a federal stockpile to states in case they eventually needed them. At the time, there were 20 confirmed cases in the U.S. of people recovering easily. There was no vaccine against swine flu, but the CDC had taken the initial step necessary for producing one.", "\"As a nation, we have prepared at all levels of government, and as individuals and communities, taking unprecedented steps to counter the emerging pandemic,\" Obama wrote in Saturday's declaration.", "In sum, the PJ Media article claimed that Obama \"waited\" until millions of people were infected with H1N1 before he declared an \"emergency.\" But that isn't the case. The Obama administration started to address H1N1 just as the disease emerged in April 2009. A public health emergency was declared on April 26, 2009, when there were about 20 confirmed cases in the United States. The Obama administration renewed this declaration twice in the ensuing months before declaring a national emergency in October 2009.", "The Associated Press.   \"Obama Declares Swine Flu National Emergency.\"\r\n    25 October 2009.", "CNN.   \"U.S. Declares Public Health Emergency Over Swine Flu.\"\r\n    26 October 2009.", "McNeil, Donald.   \"U.S. Declares Public Health Emergency Over Swine Flu.\"\r\n    The New York Times.   26 April 2009.", "The White House.   \"Declaration of a National Emergency with Respect to the 2009 H1N1 Influenza Pandemic.\"\r\n    24 October 2009.", "Schwartz, Matthew; Davis, Susan; Detrow, Scott; Summers, Juana.   \"Democratic Candidates Step Up Criticism Of Trump's Handling Of Coronavirus.\"\r\n    NPR.   29 February 2020.", "The White House.   \"The President's Remarks on H1N1.\"\r\n    30 April 2009.", "Taft, Victoria.   \"Fact-Check: Obama Waited Until 'Millions' Infected and 1000 Dead in U.S. Before Declaring H1N1 Emergency.\"\r\n    PJ Media.   28 February 2020", "CDC.   \"2009 H1N1 Pandemic Timeline.\"\r\n    8 May 2019.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]