["The photos were published on Facebook here on December 11, 2020. The post has been shared more than 200 times.", "The Burmese-language post translates to English as: “(10-12-2020) (9:19) PM It is known that a 6.7-magnitude earthquake shakes Taiwan for 15 minutes. (Damage list is not yet known) [#MyatTunAung]”.", "A 6.2-magnitude earthquake struck Taiwan on December 10, 2020, at 9:19pm local time, AFP reported.", "The photos have been shared more than 320 times after they were posted here, here, here, and here with a similar claim.", "The claim is false.", "First photo", "A reverse image search on Google, followed by keyword searches, found this photo in an article published by Taiwan News. It reports that an earthquake hit Hualien county overnight on February 6, 2018.", "The photo, credited to Taiwan’s state-owned Central News Agency (CNA) is captioned: “Aerial view of Yuntsui building”.", "Below is a screenshot of the photo in the Taiwan News report:", "The 6.4-magnitude quake that hit Hualien, a popular tourist city in Taiwan, on February 6, 2018, killed at least seven people, injured more than 250 others and left dozens missing, AFP reported here. The article features a photo of the same building.", "Below is a screenshot comparison of the photo in the misleading post (L) and the CNA photo (R):", "Second photo", "Another Google reverse image search, followed by keyword searches, found this image was published by Reuters in a photo report headlined “Earthquake hits Taiwan” on February 6, 2016.", "The photo caption reads: “Crushed vehicles are seen under a building that was damaged after a powerful earthquake hit Tainan, February 6, 2016.”", "Around 40 people were confirmed dead and some 100 people were missing after a 6.4-magnitude earthquake struck Tainan, a city in southern Taiwan, on February 6, 2016, AFP reported.", "Below is a screenshot of the photo on the Reuters website:", "Below is a screenshot comparison of the photo in the misleading post (L) and the Reuters photo (R):", "Third photo", "A Google reverse image search found this AFP photo, dated February 7, 2018.", "Below is a screenshot of the AFP photo:", "The photo caption reads: “A general view shows the Yun Tsui building (back C) leaning to one side after an overnight earthquake in the Taiwanese city of Hualien on February 7, 2018. Rescue workers pulled survivors and bodies from buildings tilting precariously in the Taiwanese city of Hualien on February 7 after an overnight earthquake killed at least six people, injured more than 200 and left dozens missing. Emergency responders were focusing on a 12-storey apartment block and a nearby hotel, both of which were leaning dangerously with their lower floors pancaked after the 6.4-magnitude quake hit the popular tourist city late Tuesday.”", "Below is a screenshot comparison of the photo in the misleading post (L) and the AFP photo (R):", "Fourth photo", "A Google reverse image search found this Reuters photo, dated April 18, 2019.", "Its caption reads: “A vehicle surrounded by fallen trees is seen after an earthquake in Taipei, Taiwan April 18, 2019.”", "A 6.1-magnitude earthquake that jolted Taipei on April 18, 2019, injured 17 people, AFP reported.", "Below is a screenshot comparison of the photo in the misleading post (L) and the photo on the Reuters website (R):", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]