["The video was live-streamed by an Australian Facebook page called \"CBN Breaking News\" on February 1, 2021. The clip, which is two-and-a-half hours, has been viewed more than 17,000 times.", "The video is from a republished episode of The Alex Jones Show from January 31, 2021. It is called: “Bombshell: Major governments say Covid-19 vaccine is a fraud”.", "During the pandemic, Jones has promoted various false claims debunked by AFP. His past promotion of conspiracy theories has also resulted in him being banned from Facebook and Twitter.", "“Australia and France have quietly said that the vaccine doesn’t work and pulled it back in the last month,” Jones says in the video.", "He also claims US pharmaceutical firm Merck “have pulled the vaccine, saying it hurts people, it doesn’t help you”.", "The video was shared on several Facebook pages around the world, including in Britain and the United Arab Emirates.", "The video, however, is misleading.", "In the video, Jones claimed: “A month ago, Australia suspends nationwide their entire vaccine programme because it makes people deathly ill, killed a bunch of people and they came up positive for HIV.”", "This is false: as of February 11, 2021, Australia is yet to deliver any Covid-19 vaccinations.", "In an address on February 1, 2021, Australian Prime Minister Scott Morrison said that vaccines are expected “to be ready for shipping and distribution to priority groups from late February.”", "Morrison said a date for the start of Australia’s vaccine roll-out is yet to be decided. Australia has agreements to purchase vaccines from Pfizer-BioNTech, Oxford-AstraZeneca and Novovax.", "A vaccine in development by the University of Queensland (UQ) and Australian firm CSL was cancelled in December 2020, after it was found that a protein fragment used in the vaccine could trigger a false positive response to some HIV tests.", "However, as a UQ press release stated: “There is no possibility the vaccine causes infection, and routine follow up tests confirmed there is no HIV virus present.”", "“With advice from experts, CSL and UQ have worked through the implications that this issue presents to rolling out the vaccine into broad populations. It is generally agreed that significant changes would need to be made to well-established HIV testing procedures in the healthcare setting to accommodate rollout of this vaccine,” the statement saids.", "“Therefore, CSL and the Australian Government have agreed vaccine development will not proceed to Phase 2/3 trials.”", "As of February 11, 2021, it is also false that Covid-19 vaccine trials have \"killed a bunch of people\" in Australia.", "An Australian Department of Health spokesperson told AFP by email on February 10, 2021 that it \"has not been notified of any deaths occurring in clinical trials of COVID-19 vaccines in Australia.\"", "\"TGA [Therapeutic Goods Administration] closely monitors the safety of COVID-19 vaccines following provisional approval, and has stringent requirements for pharmaceutical companies conducting trials of medicines or vaccines included in the Australian Register of Therapeutic Goods (ARTG) to report serious adverse events and deaths,\" the statement reads.", "\"While the TGA administers schemes that allow for supply of unapproved goods for experimental purposes, the responsibility for monitoring the safety of unapproved medicines in clinical trials sits with the clinical trial sponsor. Clinical trial sponsors notify the TGA if a trial is halted due to safety concerns.\"", "There are five Covid-19 vaccines in human clinical trials in Australia, according to the National Centre for Immunisation Research and Surveillance (NCIRS).", "In the video, Jones claims that French President Emmanuel Macron has “come out and basically suspended the vaccine”.", "“Why has Macron come out and basically suspended the vaccine? Why has Merck come out and suspended their vaccine? Why has Australia suspended their vaccine?” Jones asks. “Because they realise this is the greatest crime ever committed by humanity now taking place.\"", "The claims, however, are false. France’s coronavirus vaccine roll-out got off to a slow start by comparison with its European neighbours. But as of February 11, 2021, more than 1.9 million people in France have received their first dose of the jab, according to the French government website.", "The number of vaccinations given in France, including a geographical breakdown of where these jabs were administered in the country, can be tracked here on a government dashboard.", "Macron, however, has cast doubts on a vaccine produced by British-Swedish group AstraZeneca. Health authorities in France have so far only recommended that it be given to people aged under 65.", "It follows similar decisions in Germany, Italy and Sweden, despite the European Union approving the vaccine for adults of all ages.", "Concerns centre around a lack of data among elderly trial participants. Fewer than 10 percent of participants in trials for the Oxford-AstraZeneca vaccine were 65 or older.", "This does not mean the vaccine doesn't work well among the elderly, but rather there is little data to prove it does.", "In the video, Jones claims that “Merck, the largest pharma company in the world, says we are ending our vaccine programme. It does not work,” and that “Merck have pulled the vaccine, saying it hurts people.”", "While the US pharmaceutical company announced last month it was halting work on two potential Covid-19 vaccines, this was due to disappointing clinical results in initial trials.", "The candidate vaccines had not yet been deployed to the general population and Merck did not say the drugs had harmed people.", "“In these studies, both V590 and V591 were generally well tolerated, but the immune responses were inferior to those seen following natural infection and those reported for other SARS-CoV-2/COVID-19 vaccines,” Merck said in a statement on January 25, 2021.", "The firm said, however, it planned to continue working on two potential Covid-19 treatments.", "AFP has previously debunked another misleading claim here about Merck's Covid-19 vaccine development.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]