["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "In choosing the American Institutes for Research to create new accountability tests for Florida, education commissioner Pam Stewart stressed the group’s ability to create tests specifically tailored for Florida.", "\"The new assessment will measure each child’s progress and achievement on the Florida Standards, which were developed with an unprecedented amount of public input,\" Stewart said in a press release.", "Common Core foes, who contend the \"Florida standards\" differ little from the widely adopted national Common Core academic standards, were again disappointed. With their efforts to derail the initiative itself foundering, one group took aim at the testing company instead.", "They noted the American Institutes for Research, called AIR, was tied to the Common Core with its work creating tests for the Smarter Balanced Assessment Consortium. Then they accused the organization of promoting a homosexual lifestyle for children.", "\"This is completely unacceptable. Besides implementing the same deceptive plan discussed at the governor's summit in August, the state has chosen a company that has a significant history of promoting identification of the GLBT lifestyle for children as young as seven years old,\" Florida Eagle Forum lobbyist Randy Osborne said in a Florida Stop Common Core Coalition letter to supporters.", "The group takes a page from Utahns Against Common Core, which also blasted AIR for its work on LGBT (lesbian, gay, bisexual, transgender)  issues after that state adopted AIR tests in 2012.", "There is some basis for the statements.", "AIR has an active practice area creating materials for schools on LGBT Youth issues, in which it studies the youngsters’ experiences and offers recommendations for how to help them survive a world that can be harsh and judgmental. It describes its practice in this way:", "\"AIR’s Human and Social Development program develops knowledge and understanding about LGBT youth that takes account of their experiences and needs. AIR also enhances opportunities for the healthy development, well-being, and safety of LGBT children, youth, and their families by providing workforce training and technical assistance to service providers across systems addressing behavioral health, child welfare, education, juvenile justice, and homelessness.\"", "AIR only provides materials on gay and lesbian issues to schools and organizations that request it.  It also does similar work in the areas of bullying and substance abuse in addition to its efforts in education, health and workforce matters.", "And the group does not promote the issues, spokesman Larry McQuillan said.", "\"We are not an advocacy group,\" McQuillan said. \"AIR is a non-partisan, not-for-profit organization. We do educational assessment, research, health policy research and communication, and international development. We have supported many states by providing high-quality assessments of their specific state standards.\"", "That is generally how the organization is viewed.", "\"AIR is known for being an independent and important provider of high-quality educational research, resources, and training for federal, state, and local stakeholders,\" said Anne Hyslop of the New America Foundation. \"Their work is widely respected, and they have a long history of producing valuable contributions to the field.\"", "She suggested that the attack had more to do with the Common Core than with AIR itself. AIR received no criticism when selected to develop Florida’s hotly controversial \"value-added\" model of teacher evaluations.", "When it came to standards-related testing, though, the Stop Common Core coalition suggested that AIR’s work on LGBT issues would come through.", "\"We know that our children's tests will likely include these types of issues and that the test and other data will go to the state, the federal government, and to corporations,\" said co-founder Karen Effrem, urging tea party conservatives to pressure Gov. Rick Scott to stop the process. (PolitiFact Florida has fact-checked claims that personal data will go to the federal government and found such claims exaggerated.)", "Effrem and Osborne did not respond to interview requests.", "The issue could resonate with groups who find that even simple acknowledgement of LGBT people is activism to be demonized, said Daryl Presgraves of the Gay, Lesbian and Straight Education Network.", "Florida Department of Education spokesman Joe Follick, however, did not bite at the rhetoric, which he deemed essentially irrelevant.", "\"AIR was chosen for their ability to provide an assessment that aligns with Florida’s standards. Not anything else,\" Follick said.", "Republican legislative leaders also backed the commissioner.", "Senate President Don Gaetz \"supports Commissioner Stewart and is confident that AIR will develop a Florida-specific assessment that will test students based on Florida-specific standards,\" spokeswoman Katie Betta said.", "Our ruling", "The Florida Stop Common Core Coalition said that the American Institutes for Research promotes the identification of homosexual lifestyles in young children.", "It is true that AIR does research on LGBT youth issues and offers advice to organizations that request it on how to assist these children. This is one piece of the group’s initiatives, which also include work on disease management and student assessments.", "AIR does not advocate a homosexual lifestyle for children, nor is it an advocacy group at all. There is no indication that the organization or the state will have a homosexual agenda in its state testing.", "The statement is partially accurate but leaves out important details and takes things out of context. We rate the statement Half True.", "Florida Stop Common Core Coalition, letter to supporters, March 19, 2014", "Florida Statute 1008.22, Student assessment program for public schools", "American Institutes for Research, Human and Social Development Practice Area on LGBT Youth", "Utahns Against Common Core, American Institutes for Research: The Sexualization of Children and The Gay Agenda in Utah Schools, March 13, 2013", "Interview, Florida Department of Education spokesman Joe Follick, March 19, 2014", "Interview, American Institutes for Research spokesman Larry McQuillan, March 19, 2014", "Ocala Star-Banner, Local GOP leader goes after history textbook as ‘propagating’ Islam, Dec. 18, 2013", "The National Center for Cultural Competence, Helping Families Support LGBT Children, Fall/Winter 2009", "Florida Department of Education, press release, WITH STUDENTS AS TOP PRIORITY, FLORIDA CHOOSES REPLACEMENT FOR FCAT, March 17, 2014", "Interview, Daryl Presgraves, Gay Lesbian and Straight Education Network, March 20, 2014", "Email correspondence, Katie Betta, spokeswoman for Florida Senate president Don Gaetz, March 21, 2014", "American Institutes for Research, AIR Partners with Smarter Balanced Assessment Consortium to Create an Online Test Delivery System for States, Sept. 6, 2012", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]