["The video was published here on July 26, 2019, where it has been viewed more than 11,000 times.", "In the 10-second clip, a group of soldiers in camouflage uniform can be seen walking through a railway station.", "The post’s Chinese language caption translates to English as: “Chinese People's Liberation Army has entered Hong Kong”.", "Similar versions of the video and claim have circulated widely online, for example here and here in Chinese, and have also appeared around the region, for example this Indonesian-language Facebook post.", "Below is a screenshot of the misleading Facebook post:", "The misleading post appeared online two days after China said its army could be deployed in Hong Kong if city authorities requested support in maintaining \"public order\". Here is an AFP report on the issue.", "The PLA has maintained a garrison in Hong Kong since the former British colony was returned to China in 1997.", "In Hong Kong's Basic Law, a copy of which can be seen here, article 14 says: \"The Government of the Hong Kong Special Administrative Region may, when necessary, ask the Central People's Government for assistance from the garrison in the maintenance of public order and in disaster relief.\"", "But the video does not show PLA troops \"entering\" Hong Kong -- the footage was actually filmed at Guangzhou South railway station, in mainland China.", "Photos of the terminus published here by Hong Kong-based online news portal HK01 and here by Hong Kong’s Chinese-language newspaper Wen Wei Po show the exact same ceiling design as the building in the misleading video.", "Below is a screenshot comparison of the video in the misleading posts (L) and the photos from HK01 (C) and Wen Wei Po (R) with areas that show a similar design circled in red:", "This video uploaded to the YouTube channel of China’s Heilongjiang Television with the title: “Guangzhou South railway station: the high-speed rail station with the highest volume of traffic in the country” also shows the same distinctive roof design.", "The video is embedded below:", "Below is a screenshot of a section of the video, showing the same distinctive roof design as can be seen in the video in the misleading clips:", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]