["On September 2, several Facebook and Twitter users shared an image of a charred idol of Hindu deity Kali. As per social media claims, the idol is from a temple in Murshidabad, West Bengal. Several social media users claimed that “jihadists” attacked the temple and destroyed the idol.", "Vice president BJP Bengal and MP Arjun Singh shared multiple images that received over 600 retweets. (archived link)", "The jihadi nature of Didi’s politics is now hell bent on destroying Hindu religion and culture. See how one religious group has attacked and destroyed a temple and burned the idol of Maa Kali in Murshidabad area of West Bengal.", "Shameful. pic.twitter.com/lTnyiV9ctV", "— Arjun Singh (@ArjunsinghWB) September 1, 2020", "Twitter account @Befittingfacts tweeted two juxtaposed before and after images of the Kali idol. The tweet read, “Some ‘unknown’ person burnt the idol Kali Maa in Murshidabad”. While the tweet didn’t directly blame the Muslim community, people in the comments did. (archived links)", "Some ‘unknown’ person burnt the idol Kali Maa in Murshidabad. Before After pic.twitter.com/oaJyaizTj6", "— Facts (@BefittingFacts) September 1, 2020", "Identical claim is floating on Facebook. The post below was made by the page ‘The Ex Secular’ which claimed that “jihadi terrorists imported from Bangladesh” were behind the act.", "Maa Kali Temple burnt in Alampur Kali Temple, Nowda, Murshidabad. By Jihadi terrorists imported from Bangladesh. I wish…", "Posted by The Ex Secular on Tuesday, 1 September 2020", "Alt News reached out to a district police officer at the Murshidabad police station who said that the incident took place at Kali Maa Nimtala Kalimandir in Alampur village of Murshidabad, West Bengal. “The incident occurred on the night of August 31. The Kali goddess idol got burnt in a fire. There are no signs of forced entry. As per the trust’s statement, a fire broke out. There is no communal angle to the incident.”", "The officer also shared a press release by the temple’s executive committee that carries secretary Sukhdev Vajpayee’s statement. “On the night of August 31, the diol caught fire. There was no theft and it could be an accident,” it reads. Vajpayee also informed that Hindus and Muslims in the area live peacefully. He made an appeal to not communal the incident to spark tensions.", "Speaking with Alt News, Vajpayee said that they haven’t been able to determine the cause of the fire. “There is no CCTV on the premise and we are thinking of installing one,” he said.", "West Bengal police shared a screenshot of BJP leader Arjun Singh’s tweet and wrote, “Legal action is being taken. Please don’t get carried away by misleading, provocative and mischievous posts.”", "pic.twitter.com/8ufX7uYC7g", "— West Bengal Police (@WBPolice) September 2, 2020", "The claim that the Muslim community was behind setting ablaze an idol of Hindu deity Kali in West Bengal’s Murshidabad was found to be baseless.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "A purported video of a Muslim man beating a temple priest with a bat is…", "A picture depicting the Pakistani flag apparently bigger in size and apparently placed higher than…", "Amid the ongoing war between Israel and Hamas, a video of a fleet of cars…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "A clip featuring Pakistan men’s Cricket team captain Babar Azam is viral on social media…"]