["About this rating", "High-sugar beverages such as soda are uncontroversially unhealthy, and their regular consumption is causally associated with a variety of adverse health conditions, including coronary heart disease and diabetes. The recognition of this association has led to an increase in the popularity of beverages with alternative sweeteners. The health effects of artificially sweetened products are less clearly understood and remain an active area of research, which unfortunately for rational scientific discourse means the topic also makes for effective clickbait and scare claims.", "One example of that phenomenon comes from the website “Skinny and Healthy,” which posted an article headlined “Drinking One Diet Drink Daily Can Triple Risk of Dementia and Stroke.” Like most citation-free science clickbait, that article primarily consisted of a copy-pasted press release, in this case for a 2017 study published in the journal Stroke which has been reframed in a way to suggest that the results were more authoritative than they actually were:", "Remember that we are what we eat. Sugary drinks are bad, but diet drinks can even be more dangerous! Drinking One Diet Drink A Day Can Triple Risk Of Dementia And Strokes. Bad for our body and our brain too ...", "Boston University researchers found aspartame, a low-calorie sweetener, wreaks havoc on the arteries -- as opposed to sugar-sweetened drinks. This means drinking diet soda is far worse for your health than drinking regular soda sweetened with sugar. The results showed that adults who had one or more diet drinks a day were 2.9 times more likely to develop dementia and 3 times more at risk of strokes compared to those who virtually had none at all.", "Most important is that the study did not indicate that “diet drinks can even be more dangerous” than regular ones, or that the action of drinking a soda sweetened with artificial sweeteners causes an increased risk of stroke or dementia.", "That study did broadly find that “drinking at least one artificially sweetened beverage daily was associated with almost three times the risk of developing stroke or dementia compared to those who drank artificially-sweetened beverages less than once a week,” but the study was not designed to address causation and did not make any argument regarding it. “The authors caution that the long-term observational study was not designed or able to prove cause and effect, and only shows a trend among one group of people,” the press release also stated.", "The study authors utilized data from a well-known dataset, the “Framingham Heart Study”, which included questionnaires about food preferences with other health indicators taken from people at multiple times over the course of decades:", "The Framingham Heart Study comprises a series of community-based prospective cohorts originating from the town of Framingham, Massachusetts. We studied the Framingham Heart Study Offspring cohort, which commenced in 1971 with the enrollment of 5124 volunteers. Participants have been studied across 9 examination cycles approximately every 4 years, with the latest cycle concluding in 2014. We estimated the 10-year risk of both incident stroke and dementia beginning from the 7th examination cycle (1998–2001).", "An editorial written to accompany the study raised the possibility of selection biases that could have driven at least some of the associations documented, however. For example, it could be that people with existing risk factors for the cardiovascular issues that lead to stroke and dementia make a switch to artificially sweetened beverages for other health reasons and carry their increased risks with them:", "People at increased risk of vascular events because of preexisting vascular risk factors may switch from regular to diet soft drinks in an attempt to control weight and insulin resistance. It is entirely possible that the intake of [artificially sweetened beverages] starts after the cardiovascular risk is increased and, therefore, is a marker of a high-risk profile rather than being a causal risk factor for stroke or dementia.", "The 2017 study in Stroke also found, as alluded in the viral reports, that people who drank more sugar-sweetened beverages did not see an increase in the risk of stroke or dementia. This also could be the result of a form of selection bias stemming from the fact that the population most at risk from their sugary beverage consumption may have already died, affecting the statistical analysis:", "[The finding of no increased stroke or dementia risk from sugar sweetened beverages] could be attributed to selection bias, such that particularly vulnerable participants, that is, long-term [sugar sweetened beverages] consumers with a very high cardiovascular risk died earlier. This could also explain the lower-risk profile of high [sugar-sweetened beverage] consumers compared with high [artificially-sweetened beverage] consumers, the data of which were collected in 1998 to 2001.", "This 2017 study is not the only one to tackle the topic of adverse health outcomes from the consumption of artificially sweetened beverages. Other studies have looked at this and similar questions and reached differing conclusions:", "The Nurses Health Study and Health Professionals Follow-Up Study reported that greater consumption of sugar- and artificially sweetened soft drinks was each independently associated with a higher risk of incident stroke over 28 years of follow-up for women and 22 years of follow-up for men.", "The Northern Manhattan Study, a population-based multiethnic cohort, reported that daily consumption of artificially sweetened soft drink was associated with a higher risk of combined vascular events but not stroke when examined as an independent outcome.", "A 2012 study published in the American Journal of Clinical Nutrition also documented an association between low-calorie beverages and stroke but argued the results should be interpreted with caution, as no clear biological mechanism explained a link between low-calorie sweeteners and the circulatory issues that lend themselves to strokes:", "Our finding of an association between low-calorie soda intake and stroke risk should be interpreted with caution, because we previously did not find an association between low-calorie beverages and weight gain, diabetes, or [Coronary Artery Disease], and there is not a clear biologic mechanism between low-calorie soda consumption and incident stroke.", "That study, in contrast to the 2017 paper, found in increased risk of stroke for sugar-sweetened beverage drinkers as well. While the 2017 study at issue here also found an association between stroke and artificially sweetened beverages, its authors pointed to uncertainties regarding what possible mechanism might link artificially sweetened beverages to either stroke or dementia, describing possible links as “incompletely understood.”", "Ultimately, clinical trials and not prospective cohort studies like the ones that have been used to address this question in the past will be needed to investigate causation and tease apart any possible mechanism that might exist, a point the authors of the 2017 study in Stroke made explicitly:", "Clinical trials are needed to establish whether the consumption of artificially sweetened beverages is causally related to dementia or surrogate end points, such as cognitive decline or brain atrophy ... Given that clinical trials involving stroke end points are large and costly, clinical trials should investigate whether artificially sweetened beverages are associated with important stroke risk factors, such as high blood pressure.", "Wersching, Helke et al.   \"Sugar-Sweetened and Artificially Sweetened Beverages in Relation to Stroke and Dementia.\"\r\n    Stroke.   20 April 2017.", "Skinny and Healthy.   \"Drinking One Diet Drink Daily Can Triple Risk of Dementia and Stroke.\"\r\n    9 August 2018.", "Pase, Matthew P. et al.   \"Sugar- and Artificially Sweetened Beverages and the Risks of Incident Stroke and Dementia.\"\r\n    Stroke.   20 April 2017.", "Bernstein, Adam M. et al.   \"Soda Consumption and the Risk of Stroke in Men and Women.\"\r\n    Stroke.   20 April 2017.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]