["About this rating", "Voting in the 2020 U.S. Election may be over, but the misinformation keeps on ticking. Never stop fact-checking. Follow our post-election coverage here.", "In early December 2020, pictures and video taken of a school bus with a large printer visible from its back door went viral as purported evidence of voter fraud. A Facebook post described the scene as \"an abandoned bus just off of East Hwy 85 with [Nevada] plates in Buckeye AZ\" that was filled with \"missing AZ voter machines!\" A post on Parler claimed that this was \"confirmed by local police.\"", "In fact, it was debunked by local police. A Dec. 4 2020, Facebook post from the Buckeye Police Department described the social media chatter as \"misinformation,\" and stated that, \"It was determined the bus was full of office equipment purchased at a surplus sale, complete with invoices and receipts.\" Some online users, unconvinced by this official explanation, have pointed to close-up pictures and video purportedly showing a \"voting machine\" to dispute this narrative.", "The sticker shown on this device does indicate it once was part of an Elections Systems & Software (ES&S) product, and this company does produce election and voting equipment. However, the device pictured is merely a printer that was once part of that company's \"Ballot on Demand\" printing system.", "First, a printer is not a voting machine. Second, a printer without an ES&S computer containing ES&S software attached to it is merely a printer created by the company OKI Data —  an ES&S subcontractor. A close-up of the device shows a phone number to call for printer support — that number is the U.S. printer support line for OKI Data.", "The fact that the pictured device is an OKI printer ostensibly used in the ES&S Ballot on Demand system is evidence against the narrative that this bus contains missing Arizona ballot-counting devices. While Arizona does use several ES&S products in its elections, the only approved ballot printing device, according to the state's own documentation, is manufactured by Dominion and is fitted with an HP printer.", "Because the device pictured is a printer that could not have been used in the Arizona election, because police have stated that the bus contained items verified as having been purchased as a surplus sale, and because printers plausibly fall into the category of surplus office equipment, we rank the claim that this bus held a cache of missing \"Arizona voting machines\" to be \"False.\"", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]