["In a crucial election year, changes in voting procedures draw sharp scrutiny from all sides.", "A Facebook user in California posted a meme raising questions about recent changes instituted by Gov. Gavin Newsom and the Democratic-led legislature on the number and location of voting stations.", "The post: \"So Newsom closed all voting precincts through California. In our county of ventura, 379 precincts will be closed voting day and instead only 47 'voting stations' will be open. newsom said this is because of CV19, but that makes no sense. If that were really his concern, you would want more locations with fewer people at each place, not less. Even more scary no one knows this is happening throughout all of California.\"", "The Facebook user, Bill Gentry, added his own observations: \"Beware of this happening right under your noses. CA Governor closing voting precincts only allowing few to remain open. They are afraid of the in person voter turnout and want to limit the ability of those wanting to vote in person. What they want is to ensure the fraudulent mail in votes to be counted over everything else.\"", "USA TODAY reached out to the Facebook user for a response but did not get an immediate reply.", "More:Fact check: What's true and what's false about voting by mail in 2020", "The issue involves a new law, signed by Newsom in August, that would allow counties to offer fewer in-person polling places in exchange for opening the sites several days earlier. This comes about five months after the governor ordered election officials in the state to send a vote-by-mail ballot to every active registered voter.", "In many ways, the new measure builds on the 2016 Voter's Choice Act that has allowed counties to send every registered voter a ballot, expanded in-person early voting and replaced polling places with voting centers.", "More:Fact check: 2018 empty mail-in ballot envelopes in California dumpster spur false fraud claims", "Newsom said he was taking the new measures in response to the coronavirus pandemic and its effect on in-person voting.", "He initially tried to implement the changes through an executive order in June, KQED reported, but that raised some legal challenges regarding his authority. In response, the legislature passed the latest law, which he has signed.", "The law offers counties some options, but it does not mandate that they adopt them.", "First, some terms: Precincts are electoral districts  and are not synonymous with polling places. It was not uncommon for several precincts in the past to vote at the same location.", "More:Fact check: Trump extends wildfire aid to California, offers help to Russia", "In Ventura County, which includes the cities of Oxnard, Ventura, Thousand Oaks and Simi Valley, voting in the March primary was conducted under the old rules. The county, with a population of 850,000, chose not to adopt the Voter's Choice Act changes, saying they were too restrictive, too expensive and officials did not think voters were ready to lose their polling places.", "That changed after the coronavirus pandemic hit.", "Looking toward November, Ventura County election officials said they expected challenges in finding enough locations or volunteers to work at the polls. In the past, many of those who volunteered were elderly and so at higher risk of severe illness from the coronavirus.", "\"I can tell you that counties need our help,\" Secretary of State Alex Padilla told reporters in August. \"More than half the counties have communicated to my office that they need our assistance specifically in finding new voting locations.\"", "The new law allows counties to merge precincts for voting purposes as long as they keep the ratio of one voting place per 10,000 registered voters instead of the typical 1,000 voters. These new, larger, consolidated polling places must be open for four days — from Oct. 31 through Nov. 3 — instead of just one, and for at least eight hours each day, and from 7 a.m.-8 p.m. on Election Day.", "Voters are not assigned a specific voting location but can cast ballots at any one of them. In addition, counties are required to open one ballot drop-off location for every 15,000 registered voters for 28 days before the election.", "State Sen. Tom Umberg, D-Santa Ana, said he wrote the August bill \"to guarantee that there will be accessible, secure and safe in-person opportunities for voters who cannot or choose not to use their vote-by-mail ballot,\" KQED reported.", "He said that despite the state's emphasis on mail voting, many voters will still need to vote in-person, including those who need language or disability access assistance, or those who need to update their registration or address.", "In adopting the new measures, Ventura County reduced the number of voting locations from 389 to 48, while expanding voting to four days instead of one, the Ventura County Star reports. The in-person voting locations include one at the main elections office in Ventura, where early voting was set to begin Oct. 5; the other 47 places are open just ahead of Election Day.", "\"There will be no polling places, and I think that’s the part that people are having a hard time with,\" said Miranda Nobriga, spokesperson for the county's election division. \"There are still voting locations, but they aren’t the familiar traditional neighborhood polling places.\"", "Voters can also cast their ballot at any of the 48 locations, not just the one nearest their precinct.", "She notes that voting by mail is not new in Ventura County, with more than 70% of the county’s registered voters already voting by mail. She says the county is encouraging people, during the pandemic, \"to stay home, stay safe and vote at home.\"", "In addition to mailing ballots, voters can deliver them to 34 county drop boxes or vote in person.", "“So, we aren’t asking the 485,000 registered voters to all go to these locations,” she says.", "Nobriga says that county elections officials mailed postcards to all registered voters on Aug. 21, urging them to check their voter registration to make sure their mailing address was correct and provided details about some of the changes this year.", "We rate this claim as PARTLY FALSE. It is true that Ventura County officials have changed and reduced the number of voting locations. Along with this, they increased the number of days for early voting and set up locations to drop off ballots. That undercuts the claim that the governor was trying to reduce the turnout or to limit the ability of those wanting to vote in person. It is also false to say no one is aware this is taking place; the election changes have been given wide coverage in the California news media and in Ventura County, each registered voter was sent a card outlining the new measures.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]