["About this rating", "In the closing days of the 2020 U.S. presidential campaign, social media users recirculated a photograph playing on campaign-long claims by President Donald Trump and his supporters that Democratic nominee Joe Biden used his political influence while vice president to benefit Burisma, one of Ukraine’s largest natural gas companies, because Biden's son Hunter was a non-executive director on that company's board.", "The much-shared photograph purportedly showed Joe and Hunter Biden golfing with the \"Ukraine oil exec paying Hunter $50 K a month,\" thereby supposedly contradicting Joe Biden's claims that he had never spoken to his son about the latter's \"overseas business dealings\":", "Which \"Ukraine oil exec\" is allegedly pictured isn't specified in the above meme, but neither of the men posing with the Bidens is Burisma CEO Taras Burdeinyi, or former Ukraine Ecology Minister and Burisma founder Mykola Zlochevsky.", "In fact, the photograph seen above, taken in the Hamptons in 2014 while Joe Biden was still the U.S. vice president, does not depict the Bidens with any Ukrainian oil executives. It captures the Bidens with Devon Archer, who was a partner with Hunter Biden and Christopher Heinz in the investment management firm Rosemont Seneca Partners, and Ralph Pascucci, a New York investment banker.", "Although Archer was, like Hunter Biden, a member of the board of Burisma Holdings, neither Archer nor Pascucci is Ukrainian, and neither of those men is — or was — an \"oil exec paying Hunter $50K a month,\" so this photograph is correctly classified as \"Miscaptioned.\"", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]