["A picture of Baba Ramdev surrounded by several people, one of whom is Sri Sri Ravi Shankar, wearing surgical masks and handing him a glass of water is viral on WhatsApp. It is being shared with the claim that Ramdev went to Germany for knee surgery. A message circulating with the image says, “करो योग, रहो निरोग” योग गुरु रामदेव के घुटनो का जर्मनी में सफल ऑपरेशन!! “तुम स्वदेशी अपनाओ” ये आदमी ही कहता था ना… मूत्र पीने और गोबर खाने से फलां रोग ठीक होता है ढिमका रोग ठीक होता है? …….. खुद खाता नहीं दूसरों को खिलाता है। (Translation: Do Yoga, stay healthy. Yoga guru Ramdev’s knee operation in Germany successful. This man said adopt domestic services. How can drinking urine and eating cow dung cure diseases? How can it cure dhimka disease? Doesn’t eat it himself but makes others eat.)”", "A reverse image search on Google led Alt News to multiple articles published in 2011 that carried the same image. The Hindu Business Line, which republished a PTI report, said that Baba Ramdev was on a hunger strike since June 4, 2011, demanding tougher anti-corruption law. On June 10, 2011, he was admitted to a hospital in Uttarakhand after his condition deteriorated at his Patanjali Yogapeeth ashram in Haridwar. The Hindu Business Line described the image as – “Art of Living Guru Sri Sri Ravi Shankar (C) and Morari Bapu offer juice to yoga guru Baba Ramdev to break his nine-day-long fast at a hospital in Dehradun on Sunday. Ramdev’s aide Balkrishna is seen at right. – PTI“", "India Today had reported that Ramdev was moved to the ICU at the Himalayan Hospital, Jolly Grant, where he had been forcibly administered glucose. The article also said that Sri Sri Ravi Shankar visited the hospital to see Ramdev.", "In conclusion, a 2011 picture of Baba Ramdev admitted in a hospital in Uttarakhand is being shared with the claim that he got knee surgery in Germany.", "Donate Now", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]