["Responding to weeks of criticism over his administration’s COVID-19 response, President Donald Trump claimed at a White House briefing that the United States has well surpassed other countries in testing people for the virus.", "\"We’ve tested more than every country combined,\" Trump said April 27.", "It was a variation on claims he had made April 24, as well as on Twitter the day after — when he said the United States had tested \"more than any other country in the world, and even more than all major countries combined.\"", "The president has made a habit of exaggerating the United States’ capacity for COVID-19 diagnostic testing. But the health system has ramped up its testing since its slow start during the first weeks of the American outbreak. So we wanted to check back. How many people here have been tested? And has the U.S. tested more people than \"every country combined\"?", "We emailed the White House for comment but never heard back, so we turned to the data. Trump’s claim didn’t stand up to scrutiny.", "In raw numbers, the United States has tested more people than any other individual country — but nowhere near more than \"every country combined\" or, as he said in his tweet, more than \"all major countries combined.\"", "Regardless, raw test numbers aren’t a meaningful metric in gauging the nation’s coronavirus response. When you factor in population size — which experts say is essential in understanding how well we are doing — the U.S. still falls short.", "We consulted a few independent estimates, all of which were recommended to us by global health experts: the COVID Tracking Project, Worldometer and Our World in Data.", "All of them place the U.S. total above 5 million tests — the figures range between 5.59 and 5.7 million. And it is correct that no other country has run so many diagnostic tests. But that’s where any semblance of accuracy ends.", "A White House report on global testing — which sources its numbers from Our World in Data — notes that the United States has done more testing than the combined totals of Australia, Austria, Canada, France, India, Italy, Japan, Singapore, South Korea, Sweden and the United Kingdom. (That addition checks out.)", "But those are hardly all the world’s \"major countries\" — let alone \"every country.\" And to argue the list is exhaustive is absurd, experts said -- especially since it doesn’t include Germany and Spain, which are among Europe’s biggest economies. Additionally, Germany’s robust testing strategy has been credited with its low coronavirus death rate and Russia, also not on that list, is obviously an important player on the world stage.", "And when you look at European countries alone — which again, is far short of what he claimed — Trump’s comparison quickly falls apart.", "The Worldometer data shows that, when you add up the number of tests run in Russia, Germany and Italy, the total lands around 6.72 million. You could also tally the number of tests run in Spain, Italy, France, Germany and the U.K. Both Worldometer and Our World in Data place that total above 6 million. Either way, it’s more than what the U.S. has done.", "Big picture, a truly exhaustive sum of testing by \"every country\" or even \"all major countries\" would generate higher numbers.", "Trump is also fixating on the wrong figures, global health experts said.", "\"The highest number of raw tests in and of itself is not meaningful for any particular country or location within a country,\" said Jennifer Kates, a vice president at the Kaiser Family Foundation. (Kaiser Health News is an editorially independent program of the foundation.)", "The United States has a far bigger population than many of the \"major countries\" Trump often mentions. So it could have run far more tests but still have a much larger burden ahead than do nations like Germany, France or Canada.", "There are other useful metrics: for one, how many people tested positive for COVID-19 compared with the overall number of people tested. Another useful measure is the per capita rate of testing, or the percentage of the nation’s population that has been tested for the virus.", "On both counts, the United States still underperforms.", "Hanage pointed out that Germany, Ireland, Belgium and Canada have all tested a much larger percentage of the population than the United States has.", "Arguably the more important metric, Hanage said, is the percentage of positive test results. A low percentage indicates a nation is aggressively testing, while a higher percentage suggests the country is testing only very sick people — increasing the likelihood that its tracking system is missing cases of infection, undercounting how many people are COVID-positive. And by this measure, the United States fares far worse than a number of countries, including Canada and Germany.", "As Kates put it, \"increasing the number of tests is important, but a raw number of tests doesn’t tell you much\" about what’s needed, or how well the country is faring.", "Trump claimed that the United States has \"tested more than every country combined.\"", "There is no reasonable way to conclude that the American system has run more diagnostics than \"all other major countries combined.\" Just by adding up a few other nations’ totals, you can quickly see Trump’s claim fall apart.", "Plus, focusing on the 5 million figure distracts from the real issue — by any meaningful metric of diagnosing and tracking, the United States is still well behind countries like Germany and Canada.", "The president’s claim is not only inaccurate but also ridiculous. We rate it Pants on Fire!", "Tweet by President Donald Trump, April 25, 2020.", "YouTube, Donald Trump Signs Coronavirus Stimulus Bill at The White House, April 24, 2020.", "COVID Tracking Project, U.S. Historical Data, accessed April 28, 2020.", "Email interview with William Hanage, associate professor of epidemiology at the Harvard T.H. Chan School of Public Health, April 28, 2020.", "Email interview with Jennifer Kates, senior vice president and director of Global Health & HIV Policy, Kaiser Family Foundation, April 28, 2020.", "Our World in Data, \"Total Covid-19 Tests,\" accessed April 28, 2020.", "Kaiser Health News-PolitiFact, \"Donald Trump’s Comparison of US, South Korea Coronavirus Testing Is Wrong. Here's Why,\" March 25, 2020.", "PolitiFact, \"Donald Trump Wrong About COVID-19 Testing On Airplanes, Trains,\" April 6, 2020.", "PolitiFact, \"Trump Vowed to Bring Drive-Thru COVID-19 Test Sites to Store Parking Lots. Where Does That Stand?\" April 9, 2020.", "The New York Times, \"A German Exception? Why the Country’s Coronavirus Death Rate Is Low,\" April 4, 2020.", "Worldometer, \"Reported Cases and Deaths by Country, Territory, or Conveyance,\" accessed April 28, 2020.", "White House, \"Opening Up America Again,\" April 25, 2020.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]