["About this rating", "Scant weeks after a devastating earthquake rocked Sichuan province in China on 12 May 2008, a tale began landing in inboxes. In September 2011, the online-circulated account was updated to relocate the tale to Japan and reference by inference the horrific quake that rocked the eastern part of that island nation on 11 March 2011:", "This is a true story of Mother's Sacrifice during the Japan Earthquake.", "After the Earthquake had subsided, when the rescuers reached the ruins of a young woman's house, they saw her dead body through the cracks. But her pose was somehow strange that she knelt on her knees like a person was worshiping; her body was leaning forward, and her two hands were supporting by an object. The collapsed house had crashed her back and her head.", "With so many difficulties, the leader of the rescuer team put his hand through a narrow gap on the wall to reach the woman's body. He was hoping that this woman could be still alive. However, the cold and stiff body told him that she had passed away for sure.", "He and the rest of the team left this house and were going to search the next collapsed building. For some reasons, the team leader was driven by a compelling force to go back to the ruin house of the dead woman. Again, he knelt down and used his had through the narrow cracks to search the little space under the dead body. Suddenly, he screamed with excitement, \"A child! There is a child!\"", "The whole team worked together; carefully they removed the piles of ruined objects around the dead woman. There was a 3 months old little boy wrapped in a flowery blanket under his mother's dead body. Obviously, the woman had made an ultimate sacrifice for saving her son. When her house was falling, she used her body to make a cover to protect her son. The little boy was still sleeping peacefully when the team leader picked him up.", "The medical doctor came quickly to exam the little boy. After he opened the blanket, he saw a cell phone inside the blanket. There was a text message on the screen. It said, \"If you can survive, you must remember that I love you.\" This cell phone was passing around from one hand to another. Every body that read the message wept. \"If you can survive, you must remember that I love you.\" Such is the mother's love for her child!!", "So don't waste a day not to say I love you to your parents and love ones for you may not now one day they will be gone.", "The Japan version was often accompanied by a photograph of four men in orange and black camo rescue gear uncovering two bodies entwined together in a pit. While that photo was real (it showed the fire brigade from Li Huili County, Xinqiao Town, China digging out the remains of two people on 31 August 2008), it had nothing to do with the \"touching text message left for the baby that survived\" tale, in that both people were dead, neither was a baby, and no cell phones were involved.", "At first blush, the story of a mother's sacrifice of herself to shield her three-month-old child and the touching message left as a text message on her cell phone would appear to hold water. The tale was reported by Xinhua - People's Daily on 17 May 2011 as part of an article about survivor stories. In Beichuan, the region hit hardest by the quake, rescue workers who reached through a small gap in a collapsed building ascertained the woman they'd seen crouched in there was dead and moved on, but something caused one of them to return. A second feel-around into that gap revealed there was an infant sheltered underneath the woman, and after much digging the unharmed baby was pulled from the wreckage. Within the blanket he was found upon was a cell phone displaying the message \"Dear baby, if you can live, always remember I love you.\"", "Said article was accompanied by a photo of a soldier bearing in his arms a sleeping, unharmed child of approximately the right age. While the photo does not display any ruins of buildings, let alone a cell phone with a heart-tugging text message on it (the setting is instead a lush green mountain path, with nary a building in sight), the soldier had clearly been involved in rescue efforts of some sort, as evidenced by the blue mesh mask still hanging from his ears yet pulled down off his face.", "While all that would seem authoritative, it must be remembered that Chinese newspapers are not quite bastions of veracity. Nothing (at least at this point) has surfaced to confirm the tale, such as the cell phone itself. Moreover, would a woman dying of her injuries be able to find, let alone use, a cell phone amid the wreckage of a building that suddenly came down upon her? As she continued to try to hold the weight of the debris off her child? Which she was attempting to do by bracing both her arms against the ground so as to create a protective space underneath her for the baby, and using a cell phone even one-handed would have risked the child's life because just a smallish shift in position could have caused a further catastrophic collapse?", "Some children were rescued from the wreckage of fallen buildings in Beichuan, but hundreds of other young people were permanently entombed there. That an unharmed baby was found either in or around the resulting debris isn't remarkable, but an unconfirmed tale of a mother's knowing self-sacrifice on behalf of her child is more the stuff of legend than of actual news story. Legends of selfless sacrifice and miraculous survival are common in the wake of great tragedies, as people who are living through those horrifying times look for something — anything — of a positive nature to cling to.", "That same Xinhua piece told another such tale, but about a teacher rather than a mother. Four students were supposedly rescued unharmed from under a desk in a collapsed school, their survival the result of their middle-aged male teacher's having herded them under it then thrown himself across it to use his body to reduce the pressure of the concrete ceiling smashing onto the desk.", "An animal version of the \"mother gives her life to save her child\" legend, long since debunked, features a bird who sacrifices herself in a forest fire to protect her young.", "Block, Melissa.   \"Small Miracles Rise From Earthquake's Rubble.\"\r\n      NPR.   18 May 2008.", "Shen, Lily.   \"Amid Earthquake's Terror, Stories of Transcendence.\"\r\n     Connecticut Post Online.   21 May 2008.", "\"Mother Left Last Message to the Children: Baby, Remember I Love You!\"\r\nXinhua.   17 May 2008.", "\"Panzhihua, Sichuan Earthquake has Caused 32 Deaths\"\r\n     Ifeng.com.     1 September 2008.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]