["On March 9, Delhi’s Deputy Chief Minister Manish Sisodia presented the state’s budget for the year 2021-22. A sum of Rs 16,377 crore was allocated for education. Delhi Chief Minister Arvind Kejriwal claimed that the nation’s first teachers’ university will be established in Delhi. (Archive link)", "दिल्ली सरकार इस साल देश की पहली टीचर्स यूनिवर्सिटी की स्थापना करेगी। जहां देश और दुनिया के बेहतरीन शिक्षक तैयार किए जाएंगे।", "— Arvind Kejriwal (@ArvindKejriwal) March 9, 2021", "Aam Aadmi Party Bihar’s Twitter handle promoted the same claim. (Archive link)", "दिल्ली सरकार इस साल देश की पहली टीचर्स यूनिवर्सिटी की स्थापना करेगी। जहां देश और दुनिया के बेहतरीन शिक्षक तैयार किए जाएंगे : @ArvindKejriwal", "— Aam Aadmi Party – Bihar (@AAPBihar) March 9, 2021", "Aam Aadmi Party Uttar Pradesh and Aam Aadmi Party Gautam Budh Nagar Facebook pages also posted this claim.", "This slideshow requires JavaScript.", "The claim is viral on Facebook and Twitter.", "Is the upcoming teachers’ university in Delhi the first of its kind in India? We began our investigation with a Google search which revealed that teachers’ universities, which train students for the teaching profession, exist in several cities.", "One of these is the Indian Institute of Teacher Education (IITE) in Gandhinagar, the capital of Gujarat. Established in 2010 by the then Chief Minister Narendra Modi, it offers Bachelor’s, Master’s, and Research level programs.", "The Tamil Nadu Teachers Education University was set up in Tamil Nadu under an Act passed by the government in 2008. Students can opt for courses in the Bachelors to Research level.", "Apart from this, there is also a teachers’ university in West Bengal which was established in 2015 and offers Bachelor’s, Master’s, PhD, and M.Phil programs. There are a number of private institutes also which offer courses in education.", "The National Council for Teacher Education is an organization created specifically for teacher training. A list on its website contains the names of the teacher training institutes in India, which can be accessed here.", "Currently, teachers and headmasters receive training under the government’s flagship teacher training initiative, ‘NISHTHA’. On March 11, The Quint published a fact-check article on Arvind Kejriwal’s statement.", "The Delhi CM’s claim about setting up the first teacher training university in Delhi is false. Several such institutes already exist in the country.", "Donate Now", "Kinjal Parmar holds a Bachelor of Science in Microbiology. However, her keen interest in journalism, drove her to pursue journalism from the Indian Institute of Mass Communication. At Alt News since 2019, she focuses on authentication of information which includes visual verification, media misreports, examining mis/disinformation across social media. She is the lead video producer at Alt News and manages social media accounts for the organization.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]