["Floyd was a “VIOLENT THUG” who “overdosed while resisting,” an August 13, 2020 Facebook post says, comparing him to a boy named Cannon Hinnant, whom it describes as an “INNOCENT CHILD” who was “executed by black man.”", "Floyd was “HONORED & PRAISED” while Hinnant was “IRRELEVANT,” the post claims.", "Similar claims appear on Facebook here and Instagram here.", "Floyd’s final moments -- in which he pleaded for his life and said he could not breathe as Minneapolis police officer Derek Chauvin held his knee to his neck for nearly nine minutes -- were captured on video.", "His death sparked widespread outrage and weeks of demonstrations in the United States and other countries against racial injustice and police brutality. It also led to calls for defunding the police and other law enforcement reforms, as well as soul-searching about racism in America.", "While an autopsy by the Hennepin County medical examiner’s office did find drugs in Floyd’s system, it concluded that the cause of his death was “cardiopulmonary arrest complicating law enforcement subdual, restraint, and neck compression,” and that the manner of death was “homicide.”", "The posts are part of a trend on social media of trying to equate reactions to the killing of Hinnant -- a five-year-old white child who was fatally shot on August 9 in North Carolina, allegedly by a black man -- with that of Floyd.", "But the context of Floyd’s death -- it was part of a pattern of deadly police encounters with African Americans -- and its result -- widespread protests and calls for change -- make the two cases very different.", "Other posts such as this one -- which misspells Hinnant’s name -- allege that there was “no media coverage” of his death.", "This is also false. Local media and the Associated Press quickly reported on the story, and it has since been covered by other national media.", "AFP Fact Check has debunked dozens of examples of false information related to Floyd and the protests that followed his death, which can be viewed in English here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]