["Americans are relocating to Florida in droves, House Speaker Will Weatherford told a group of liberty-loving activists at the Capitol.", "Why? Freedom! It’s a quantity in short supply in those tax-loving states up north.", "\"You may not know this, but today almost 1,000 people a day are moving to the state of Florida,\" he said at a rally by Americans for Prosperity Florida on March 19, 2013. \"Do you know why they're coming here? Because they are more free here than they are in some other states.\"", "We checked out Weatherford’s number for new Floridians and why they’re coming here. Grab your U-Haul and come along for the ride.", "Population estimates", "Weatherford spokesman Ryan Duffy sent us a March 2013 Sarasota Herald-Tribune article about Florida’s booming population growth. \"Fueled by job seekers, foreign immigrants and baby boomer retirees,\" Florida will soon surpass New York in population, the article states.", "Duffy honed in on one line: \"Moody's is among those predicting Florida's population will swell by 360,000 this year.\" Weatherford divided 360,000 by 365, which comes out to 986.3 (or \"almost 1,000 people a day\").", "Chris Lafakis, the Moody’s Analytics senior economist behind the projection, told us his figure is based on net migration, which is the number of people moving in minus those moving out, plus the number of births minus deaths. It includes people who move here from other countries, not just other states.", "Mekael Teshome, a PNC Financial Services Group economist, told us the Moody’s projection is on the high side, and his estimate for population growth in 2013 is in the upper 200,000s.", "Weatherford is not the only politician touting the number of people moving into the state. Gov. Rick Scott said on CNN and in other interviews that 230,000 people moved to Florida in 2012, referencing census numbers.", "We should note that people have been moving to Florida since the state was founded. In the 1980s, when Democrats controlled most every branch of state government, about 875 people on average moved to Florida every day, according to census figures. In the 1970s -- while Democrats were in control -- an average of 810 people moved to Florida every day. In the 2000s, during the economic crisis and under Republican control, an average of around 772 people moved to Florida every day.", "Why Florida?", "We thought of a few ways to interpret Weatherford’s claim that people are moving to Florida because of freedom. Cubans who arrive on Miami-Dade shores? Fair to say they are moving here for freedom. New York retirees trading in their down coats for swim suits? We’re not sure they’d say freedom (unless they mean freedom from snow).", "Asked to clarify Weatherford’s remarks, his spokesman sent us materials indicating he meant economic freedom. He directed us to a study by the business-backed Tax Foundation that showed Florida ranked No. 27 of states with the highest tax burdens. New York, New Jersey, Connecticut and California topped the list.", "Does this really explain our population boom? Economists typically don’t factor in value judgments, Teshome said. But they still have an idea of what brings people to, ahem, the Sunshine State.", "\"Florida’s great weather and abundant white-collar job opportunities are what primarily attract individuals,\" Lafakis said, \"but the lack of a personal income tax and a pretty friendly business climate certainly help.\"", "The population uptick is picking up as the result of an improving national economy that enables out-of-staters to sell their houses and buy new ones in Florida, Teshome said.", "The University of Florida’s Bureau of Economic and Business Research conducts a random monthly telephone survey of state residents. For respondents who say they have moved to Florida, be it one year ago or many, researchers ask about their primary reason for the move.", "From January 2012 to February 2013, the top results were family/marriage (29 percent), job (22 percent) and climate/weather (18.9 percent). The \"other\" category, which includes reasons such as retirement, and makes up 14.6 percent of results.", "Jobs are the main reason people relocate to Florida in their 20s, 30s and 40s, said Stan Smith, professor of economics and director of the Population Program in the Bureau of Economic and Business Research (BEBR) at the University of Florida. For those in their 50s and 60s, climate is the No. 1 reason. Family reasons are a factor in basically each age group, he said.", "\"Freedom\" itself is not a category, though 2.1 percent said they moved for the low cost of living and 1 percent said political reasons.", "Florida’s cost of living used to be substantially lower than the rest of the states 30 or 40 years ago, but the state moved to the middle of the pack in recent years, Smith said. And even though Florida does not have a state income tax, residents pay more for home insurance, prices for which soared after the 2004 and 2005 hurricane seasons.", "Finally, the conservative Mercatus Center at George Mason University releases an annual report examining freedom in each state, using a comprehensive checklist that looks at measures such as taxes and government spending, the liability system, property rights and even throwing a bachelor party. Florida falls in the middle of the pack at No. 23.", "Florida ranks well above average for education and its fiscal policies, but the state lost standing for its debt burden and restrictions on civil liberties. The center recommended spending less on services such as police and fire protection, airports, parks, and sanitation and ending mandatory minimum sentences for victimless crimes.", "Our ruling", "Weatherford said almost 1,000 people a day are moving to Florida \"because they are more free here than they are in some other states.\"", "The number is actually a projection of the 2013 net migration. In 2012, census data shows that about 630 people on average moved to Florida each day.", "Our problem, however, is more with his assertion of why people are migrating to Florida. There's no real evidence to suggest it's freedom -- as in the business and tax climate -- as Weatherford suggests. Survey data shows most people move here because of family, jobs and weather.", "And in fact, when you look at Florida history, the state has seen similar population growth under both Republicans and Democrats.", "We rate Weatherford's claim Mostly False.", "Audio of Weatherford’s speech during Americans for Prosperity Florida rally, March 19, 2013", "Interview with Ryan Duffy, Weatherford spokesman, March 20, 2013", "Interview with Robert Bernstein, U.S. Census Bureau spokesman, March 21, 2013", "Interview with Mekael Teshome, PNC Financial Bank economist, March 21, 2013", "Email interview with Chris Lafakis, Moody’s Analytics senior economist, March 26, 2013", "U.S. Census Bureau, State-to-state migration flows table, accessed March 21, 2013", "Sunshine State News, \"Rick Scott, out of character, flirts with Soledad O’Brien,\" March 27, 2013", "South Florida Sun-Sentinel,\"Fewer people moving to Florida, census estimates show,\" Jan. 30, 2011", "Florida Trend, \"Incoming,\" Feb. 1, 2007", "Mercatus Center George Mason University, \"Freedom in the 50 states: No. 23 Florida,\"2013", "Interview with Mitch Ceasar, chair of the Broward Democratic Party, March 28, 2013", "Interview with Stan Smith, professor of economics and director of the Population Program in the Bureau of Economic and Business Research (BEBR) at the University of Florida, March 29, 2013", "Interview with Scott Richards, coordinator of Programming and Research at the Bureau of Economic and Business Research's University of Florida Survey Research Center, March 29, 2013", "New York Times interactive graphic, Census 2010: Gains and Losses in Congress", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]