["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Donald Trump tweeted this picture of himself signing his tax return in October 2015. (Photo via Twitter)", "President Donald Trump has continued to break with decades of precedent in refusing to release his tax returns.", "Trump has said voters don’t care about his taxes – which PolitiFact ruled False, based on public polling both before and after the election that found most people do think he should release them.", "But have even voters in states that Trump won been clamoring to see his tax returns?", "One North Carolina lawmaker said they have. And he proposed that if Trump runs for re-election in 2020, he’ll have to release his taxes to get on the ballot in this crucial swing state.", "Sen. Jay Chaudhuri, a Democrat from Raleigh, introduced a bill with that requirement. In case its target was unclear, he called it the \"Tax Returns Uniformly Made Public Act,\" or the T.R.U.M.P. Act.", "\"I filed the T.R.U.M.P. Act because I believe every presidential candidate, including Donald Trump, should disclose their tax returns,\" Chaudhuri told The News & Observer. \"I did so for three reasons. First, every major party presidential candidate for the last 40 years has made his or her tax returns public. Second, such disclosures allow the public to know whether these candidates have conflicts of interest. For example, does Donald Trump have business dealings with Russia? Finally, this bill has a lot of support – by a majority of North Carolinians and members of both parties, including Republican Congressman Walter Jones of North Carolina.\"", "We won’t check Chaudhuri’s claim about every major modern presidential candidate releasing tax returns, since the work has been done for us. Our friends at PolitiFact Wisconsin previously ruled that same claim, as made by Sen. Tammy Baldwin, a Wisconsin Democrat, as Mostly True.", "But we were intrigued by Chaudhuri’s final claim, that \"this bill has a lot of support – by a majority of North Carolinians and members of both parties.\"", "Political polarization", "Chaudhuri’s sentence was phrased somewhat vaguely. It appears he’s talking about \"a majority of North Carolinians and (some) members of both parties.\" Yet it’s also possible to read it as saying most members of both parties. But that’s unlikely, since if he had meant that he wouldn’t have needed the first part of the sentence, and in the end we interpreted it as some members of both political parties.", "In Congress, some barely even cuts it. Rep. Walter Jones was one of only two Republicans not to vote the party line last month, when Congress voted down an attempt by Democrats to pass a national bill similar to what Chaudhuri is proposing for North Carolina.", "But partisan polarization in Congress often doesn’t accurately reflect their constituents. So we’re more interested in what Chaudhuri had to say about public opinion statewide, since he’s promoting a state-level bill.", "His T.R.U.M.P. Act is likely a long shot, just like that doomed national bill, since Republicans also control the N.C. General Assembly. Some politicians and legal experts have also questioned whether such a bill – which has also been introduced in at least 24 other states – would even be constitutional.", "Nevertheless, it would be intriguing if Chaudhuri is right about widespread support behind this idea.", "So we began researching opinion polls to find out.", "A majority for or against?", "We discovered only one polling firm has asked voters in North Carolina this issue. But its research backs up Chaudhuri’s claim.", "Most North Carolinians do want Trump to release his taxes and would support a law that require all presidential hopefuls to do so, according to Public Policy Polling, a liberal-leaning firm based in Raleigh that has polled the topic multiple times.", "Its polling results mirror national polls (which recently have found between 53 percent and 74 percent want Trump to release his taxes). So it doesn’t appear to be an outlier. But since it’s the only firm polling on this topic in North Carolina specifically, we take its findings with a grain of salt.", "PPP polled North Carolinians in August 2016 and January 2017 on whether Trump should release his taxes. The August poll found 58 percent said yes; the January poll found 60 percent said yes.", "That backs up Chaudhuri’s claim about \"a majority of North Carolinians.\" And the poll’s crosstabs back up his point about some support from both sides politically.", "In August PPP found 76 percent of Democrats and 54 percent of unaffiliated/other voters wanted Trump to release his taxes. There was no majority view among Republicans, of whom 37 percent said Trump said should release his taxes, 49 percent said he shouldn’t and 14 percent were undecided. That poll surveyed 830 likely voters, with a margin of error of 3.4 percent.", "The overall January numbers were similar – a total of 60 percent support – although increasingly polarized. Support among Democrats and unaffiliated voters rose by several points, while Republican opposition rose by several points. That poll surveyed 954 registered voters, with a margin of error of 3.2 percent", "PPP’s January poll also found 54 percent of North Carolinians would favor \"a law requiring that a candidate for President release 5 years of tax returns in order to appear on the ballot,\" which is precisely the type of law Chaudhuri proposed several months later.", "PPP found most Democrats and independents would support the bill, while there was no majority view among Republicans. The poll reported 31 percent of Republicans would support such a bill, 49 percent would oppose it, and 20 percent were undecided.", "Our ruling", "Sen. Jay Chaudhuri proposed a bill that would require future presidential candidates to release their tax returns in order to get onto North Carolina’s ballot. The bill was clearly aimed at Republican President Donald Trump, but Chaudhuri said it \"has a lot of support – by a majority of North Carolinians and members of both parties.\"", "According to one polling firm, Chaudhuri is correct that most North Carolinians want to see Trump’s tax returns, and that the majority also would support a law requiring all presidential candidates to release their taxes. He’s also correct that both issues have bipartisan support, including most Democrats and independents, and about a third of Republicans.", "However, only one pollster has explored this question at the state level. That’s an important piece of information that Chaudhuri doesn’t mention, so we rate this claim Mostly True.", "Roll Call, March 3, 2017, \"Sanford, Jones Split With GOP on Trump’s Taxes\"", "Public Policy Polling opinion poll results, Jan 18, 2017", "Public Policy Polling opinion poll results, Aug. 9, 2016", "The Washington Post, April 16, 2017, in the Volokh Conspiracy blog, \"Could states require President Trump to release his tax returns?\"", "PolitiFact Virginia, Oct. 5, 2016, \"Tim Kaine correctly notes Richard Nixon released tax returns despite audit\"", "The News & Observer, April 3, 2017, \"NC senator’s ‘T.R.U.M.P. Act’ would force presidential candidates to release tax returns\"", "Text of Chaudhuri's T.R.U.M.P. Act", "NC State Board of Elections, 2016 election results", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]