["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Want evidence of man-made climate change? U.S. Sen. Sheldon Whitehouse says you can feel it in the waters of Narragansett Bay, which covers about 120.5 square miles, from Newport to Providence, in his home state of Rhode Island.", "\"Narragansett Bay waters are getting warmer -- 4 degrees Fahrenheit warmer in the winter since the 1960s,\" he said April 9 during one of his regular climate speeches on the floor of the Senate. He blamed the warmer temperatures for a drop in the flounder catch from more than 2,500 metric tons in the 1980s to about 150 metric tons in 2009. The reason: Warmer temperatures attract winter flounder predators earlier in the season.", "We can save the winter flounder factoid for another day. We were interested in whether Bay water has, in fact, gotten 4 degrees warmer since the 1960s, especially when water temperatures can fluctuate naturally from year to year.", "Whitehouse's office directed us to a 2008 article written by researchers at the University of Rhode Island’s Graduate School of Oceanography and published in the journal Estuarine, Coastal and Shelf Science. It says that the surface water of the Bay from December through February \"has warmed on average by about 2.2 degrees Celsius since 1960.\" That would be 4 degrees Fahrenheit.", "An accompanying chart showing the trend ends at 2006. We wondered whether the increase continued beyond that.", "Next we contacted Jeremy Collie, a URI oceanographer. \"There's clearly a warming signal,\" he said as he looked at the trend line for data from 1959 through 2010. \"If you look at the winter months and take a regression, you get a warming rate of about 0.5 degrees F. per decade.\"", "That would be about 2.5 degrees F. since 1960. \"So 4 degrees is a little on the high end,\" he  said. He cautioned that there can be a lot of normal variation in the readings from winter to winter.", "The data, collected off Fox Island, located between North Kingstown and the Jamestown Bridge, can be downloaded from URI's website (search for \"fox island 1959-2010\"). We double-checked the trend, using Microsoft Excel's ability to create a chart, and found an increase, of 2.4 degrees for December-February from 1959-2010. (It rose to 2.7 degrees if you didn't include the winter of 1959-60, which might not be considered to be in the 1960s.)", "We also checked the data for another temperature measuring site: Whale Rock, south of the bridge on the same side of the Bay. Using data from December 1960 through February 2010, we again found an increase of 2.7 degrees F.", "In both locations, temperatures deeper in the water rose a bit more -- about 3 degrees -- but still not by the amount the senator said.", "It's unclear why the older study reported a surface temperature 1.5 degrees higher than our newer look at the data. The 2008 article appears to be using the same data we did. The additional winters we looked at had some colder-than-normal temperatures but that doesn't seem to be enough to account for the difference.", "Our ruling", "When Sen. Sheldon Whitehouse said \"Narragansett Bay waters are getting warmer -- 4 degrees Fahrenheit warmer in the winter since the 1960s,\" he was citing a URI study that offered the observation after authors examined temperatures through 2006.", "The latest data for December, January and February -- the months used in the URI study -- extending through 2010 reveal that the increase since the '60s is less extreme. The closest we saw was a 3-degree rise in the deeper waters off Fox Island.", "The trend is certainly correct, but Whitehouse is too far off for the Truth-O-Meter to register True. It is, to pardon the pun, a matter of degree. Because the temperature rise is a little more than half of what he said, we rate his statement Half True.", "(If you have a claim you’d like PolitiFact Rhode Island to check, e-mail us at [email protected]. And follow us on Twitter: @politifactri.)", "YouTube.com, \"Time to Wake Up: Wildlife, Ecosystems and Our Economy,\" Sheldon Whitehouse channel, April 11, 2013, accessed April 12, 2013", "Researchgate.net, \"The impact of changing climate on phenology, productivity, and benthic–pelagic coupling in Narragansett Bay,\" from Estuarine, Coastal and Shelf Science, Dec. 25, 2008, accessed April 15, 2013", "Interview and e-mail, Jeremy Collie, oceanographer, University of Rhode Island, April 15, 2013", "GSO.URI.edu, \"Data, Surface and bottom temperature, 1959-2010,\" accessed April 15, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]