["By Robert Farley", "Posted on January 4, 2017", "In support of his argument that the Affordable Care Act “doesn’t work” and provides “lousy healthcare,” President-elect Donald Trump quoted Bill Clinton as saying the law is “crazy” and Minnesota Gov. Mark Dayton as saying that the law “is no longer affordable.” But both comments are lifted out of context.", "Trump has vowed to work with Congress to repeal and replace President Obama’s signature legislation soon after taking office. Indeed, on Jan. 3, Congress took the first step toward repeal of the law.", "On the same day, Trump took to Twitter to argue that even Democrats who once supported the law now think it is bad. Trump began by referring to comments in October from former President Clinton, who at the time was campaigning for his wife, Hillary.", "People must remember that ObamaCare just doesn't work, and it is not affordable – 116% increases (Arizona). Bill Clinton called it \"CRAZY\"", "— Donald J. Trump (@realDonaldTrump) January 3, 2017", "The second tweet five minutes later referenced comments made by Gov. Dayton in October.", "The Democrat Governor.of Minnesota said \"The Affordable Care Act (ObamaCare) is no longer affordable!\" – And, it is lousy healthcare.", "— Donald J. Trump (@realDonaldTrump) January 3, 2017", "In both cases, Clinton and Dayton made comments critical of the Affordable Care Act. But both said they remained supporters of the law and blamed Republicans for refusing to make changes to improve it. In both cases, Trump shortened the quotes to present them in a light less favorable than a fuller context reveals.", "We’ve noted before that Trump’s statistic on rate increases in Arizona’s ACA exchange is accurate, but cherry-picked. Arizona has the highest average increase among all the states. In Indiana, the average change is a 3 percent decrease.", "But there is no question that rates are on the rise. The average increase for the second-lowest cost silver plans from 2016 to 2017 in the 38 states that have ACA exchanges is 25 percent, as detailed in a report from the Department of Health and Human Services.", "That does not include subsidies. For those who are eligible to get them, the tax credits shelter consumers from premium increases, because they put a cap on the amount an individual must contribute toward benchmark premiums based on income. The HHS report notes that 77 percent of current enrollees can find plans for $100 or less per month, after factoring in tax credits.", "As for Clinton calling the ACA “crazy,” he made those comments while campaigning for his wife in Flint, Michigan, on Oct. 3. As the fuller context shows, Clinton was not referring to the entirety of the ACA as “CRAZY,” as Trump claimed.", "Clinton, Oct. 3: Now the next thing is, we got to figure out what to do now on health care. Her opponent said, “Oh, just repeal it all. The market will take care of it.” That didn’t work out very well for us, did it? We wound up with the most expensive system in the world and we insured the smallest percentage of people. On the other hand, the current system works fine if you’re eligible for Medicaid, if you’re a lower income working person, if you’re already on Medicare, or if you get enough subsidies on a modest income that you can afford your health care.", "But the people that are getting killed in this deal are small business people and individuals who make just a little too much to get any of these subsidies. Why? Because they’re not organized, they don’t have any bargaining power with insurance companies, and they’re getting whacked. So you’ve got this crazy system where all of a sudden, 25 million more people have health care and then the people that are out there busting it, sometimes 60 hours a week, wind up with their premiums doubled and their coverage cut in half. It’s the craziest thing in the world.", "So here’s the simplest thing ― you raise your hands and you think about it ― here’s the simplest thing: Figure out an affordable rate and let people use that ― something that won’t undermine your quality of life, won’t interfere with your ability to make expenses, won’t interfere with your ability to save money for your kid’s college education. And let people buy in to Medicare or Medicaid.", "Here’s why. You can let people buy in for just a little bit because unlike where you are now, if you were on the other side of this, if you were an insurer, you’d say, “Gosh, I only got 2,000 people in this little pool. Eighty percent of the insurance costs every year come from 20 percent of the people. If I get unlucky in the pool, I’ll lose money.” So they overcharge you just to make sure, and on good years, they just make a whopping profit out of the people least able to pay it.", "It doesn’t make any sense. The insurance model doesn’t work here. It’s not like life insurance, it’s not like casualty, it’s not like predicting flooding. It doesn’t work. So Hillary believes we should simply let people who are above the line for getting these subsidies have access to affordable entry into the Medicare and Medicaid programs. They’ll all be covered. It will not hurt the program. We will not lose a lot of money. And we ought to do it.", "The following day, at an event in Athens, Ohio, Clinton clarified that, on the whole, he supported the ACA, but felt that it could be improved by allowing those ineligible for insurance subsidies or Medicaid to buy into Medicare or Medicaid.", "“Look, the Affordable Health Care Act did a world of good, and the 50-something efforts to repeal it that the Republicans have staged were a terrible mistake,” Clinton said at the Athens event. “We for the first time in our history at least are providing insurance to more than 90 percent of our people.”", "The comments from Minnesota Gov. Dayton were made on Oct. 12, a few weeks after the state announced that insurance companies on the individual market — including MNsure, the state-run ACA exchange — were planning to increase premiums between 50 percent and 67 percent, on average.", "Asked about those hikes, Dayton called the proposed rate increases “severe” and said “the reality is the Affordable Care Act is no longer affordable to increasing numbers of people.” (The emphasis on that last phrase is ours, because Trump left it off.)", "In the transcript of Dayton’s fuller comments — provided to us by the governor’s office — he blamed a “totally deadlocked” Congress for failing to make “necessary changes or improvements” to the law to make it more affordable for those unable to qualify for Medicaid or government subsidies.", "Dayton, Oct. 12: Well, it’s a very serious problem, the escalation of the costs of insurance under the Affordable Care Act, for others besides individuals, but there it’s most severe. But those are not MNsure’s rates. Those are not rates that are the product of MNsure. They’re the rates that the insurance companies have set in order to stay in, participating in, providing individual insurance, both through the MNsure exchange and also separately from that.", "And so the advantage for people of going through MNsure is that many will qualify for federal tax credits to reduce the gross increase in the rates. …", "But ultimately, I’m not trying to pass the buck here, but the reality is the Affordable Care Act is no longer affordable to increasing numbers of people. And Congress, which has been totally deadlocked in terms of making any necessary changes or improvements, is going to have to step into this in January with the next administration, and make the kind of changes such as, if … the federal government [provided] for catastrophic health care occurrences – you’d bring the rates down very significantly. …", "And the subsidies that the federal government provides, the tax credits, are going to need to be increased and expanded to, again, reduce the cost burden on those who are buying insurance under the Affordable Care Act.", "So I mean, there are a number of things that need to be done, federal, and there are some things we can do at the state. But the magnitude of this problem, Minnesota is not alone in this. There are many other states that have experienced significant increases, our increases are higher on a percentage basis because our base rates were lower, previously – but still very drastic increases and there are other states where providers, like in our case Blue Cross Blue Shield, have left the market entirely.", "So the Affordable Care Act has many good features to it, it’s achieved great success in terms of insuring more people – 20 million people across the country – and providing access for people who have preexisting conditions and the like. But it’s got some serious blemishes and serious deficiencies. And we’re going to need both state and federal governments to step in and do what they need to do to remedy these problems.", "Shortly after Dayton made the statement, Sam Fettig, a spokesman for the governor, clarified: “The Governor wants to make it clear that the Republicans in Congress are to blame for their unwillingness to make improvements necessary to make the Affordable Care Act more successful.”", "Dayton reiterated that point on Jan. 3, when he responded to Trump’s tweet, also via Twitter.", "The ACA has provided quality healthcare to +20M Americans. Its problems could've been corrected if GOP had tried to improve, not destroy it. https://t.co/RRGzuoLUKR", "— Governor Mark Dayton (@GovMarkDayton) January 3, 2017", "Dayton released a proposed budget the same day calling for a 25 percent health insurance premium reduction “for the 125,000 Minnesotans expected to purchase health insurance on the individual market in 2017 who do not receive federal tax credits.”", "In a press conference about the budget proposal, Dayton was asked about Trump’s tweet (at the 22:50 mark).", "“I don’t have any control over what the president-elect tweets,” Dayton said. “… I’ve stated my position. I never said it was lousy health care. That wasn’t part of the quote, but he put that in. That’s his view.”", "Trump is, of course, entitled to his view that the ACA provides “lousy healthcare.” And his tweet makes it clear that that is his assessment. But Trump leaves out key context from the quotes of Clinton and Dayton to make his point.", "Politifact Rating:", "Read More", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]