["About this rating", "In late 2016, a long-circulating claim that cashews could wholly replace prescribed antidepressants like Prozac once again made the rounds on social media. The claim was not new in 2016, but it spiked in circulation after the site Newz Magazine reiterated the rumor on 15 November 2016. According to the newer article, research purportedly proved the efficacy of cashews as an antidepressant, adding that \"big pharma\" suppressed the findings in order to cash in on prescription drugs:", "Cashew nuts are more than great source of tryptophan, which is a vital amino acid our body needs to take it throughout the food. This amino acid helps children develop and grow, regulates mood, balances our behavior, improves sleep and can significantly lower the level of stress, anxiety and depression.", "Just two handfuls of cashews contain somewhere between 1.000 and 2.000 mg of tryptophan. This compound has been proven to be as equally successful as prescription antidepressants. The best thing about treating depression with cashews is that you will surely avoid side effects that are usually caused by antidepressants. Of course, this is yet another thing big pharma carefully hides from us ... there is much effective and safer natural depression treatment they want to hide from the common people because thus they will lose lots of money.", "One popular version was shared by alternative health promoter David \"Avocado\" Wolfe on 21 December 2015 (making it possible Facebook's \"On This Day\" feature helped bring the story back in December 2016). In his article, Wolfe maintained:", "As it turns out, cashews contain niacin and tryptophan, and, according to some, two handfuls of cashews contain a “therapeutic amount” of tryptophan, enough to alter and elevate your mood. The real measurement, apparently, is three and a half ounces of cashews, about a one-half cup, which provides approximately 470 mg of tryptophan. (HER)", "This is great news for people who want a more natural response to their depression or for those who react terribly to Prozac. Also, cashews are delicious and can be found in milk or butter form. It is also possible to take cashews and turn them into something one can eat everyday to keep depression at bay.", "The claim appeared to originate with a May 2014 Men's Journal article (\"The Case for Cashews\"), which asserted:", "Two handfuls of cashews each day may keep depression at bay. A growing body of research has found that in lieu of taking a prescription drug, some people can turn to foods that are high in tryptophans, like cashews. Depressive episodes are often triggered when the body drops in serotonin and tryptophans can boost it again, but people tend to turn to nutrition as a last resort. One more natural source of tryptophan is cashews. \"Several handfuls of cashews provide 1,000-2,000 milligrams of tryptophan, which will work as well as prescription antidepressants,\" says Dr. Andrew Saul, a therapeutic nutritionist and editor-in-chief of Orthomolecular Medicine News Service.", "The claim that \"two handfuls of cashews\" could sufficiently replace an antidepressant was potentially dangerous; the original report did not come from a clinical study or credible research, and the doctor quoted identified himself not as a psychiatrist but a nutritionist. The pieces referenced tryptophan as the key antidepressant in cashews, an amino acid which can be purchased in capsule form (but is not accepted as a valid treatment for clinical depression).", "Tryptophan has long been misidentified as a substitute for medication. In 2003, Psychology Today noted that claims about the amino acid in food were distorted:", "You've picked the bones of the Thanksgiving bird; you're in an easy-chair nearly napping: \"It's the tryptophan!\" you say. But it isn't: you've fallen victim to a common myth about an uncommon molecule, tryptophan. Thought to have effects on mood, memory, and sociability, tryptophan is an amino acid with a checkered past, an obscure present and a promising future. Misconceptions and confusion abound, especially in the popular press", "If anything eating turkey lowers tryptophan. That's because tryptophan uses the same means of transport into the brain as other amino acids, and has to compete against them to cross the blood-brain barrier. As it happens, tryptophan is the least abundant amino acid. Forced to fight for access against the more common amino acids, it's left waiting at the gate: the amount of tryptophan entering the brain decreases ... For similar reasons, a glass of warm milk at bedtime will not raise the level of tryptophan entering your brain. Neither will walnuts, strawberries or salmon, though many nutrition columns say so. If a glass of warm milk at bedtime helps you fall asleep, it's not because of its tryptophan content.", "The only surefire way to increase tryptophan to the brain is with dietary supplements. Taken in pure form, tryptophan works in a qualitatively different way than when obtained from a food source. The concentration of tryptophan becomes high enough to compete on a level playing field against other amino acids; plenty of it gets into the brain.", "The rumor's spread was particularly pernicious, as abrupt cessation of antidepressants treatment (encouraged by the articles' suggestion Prozac be replaced with cashews) is linked with severe adverse outcomes:", "Discontinuing antidepressant medications can precipitate a variety of somatic and psychological reactions in patients. These reactions, often termed antidepressant withdrawal or discontinuation syndrome, have been noted with all classes of antidepressant agents including TCAs, MAOIs, SRIs, SSRIs, and SNRIs. Since antidepressants are not addictive agents and do not directly evoke the brain reward systems, the term “discontinuation” is preferred over “withdrawal” when describing these symptoms. Although discontinuation symptoms are most often associated with the abrupt discontinuation of an antidepressant, they have been reported during gradual tapering and intermittent noncompliance as well.", "Although much of the evidence for the discontinuation syndrome comes from case reports, controlled clinical trials involving the abrupt switch from active antidepressant to placebo also have documented the occurrence of these reactions.", "While the meme has been circulating on Facebook since at least May 2014, we located no evidence to support the efficacy of using cashews (or anything containing tryptophan) as a treatment for depression.", "Marley, Marykate.   \"The Case For Cashews.\"\r\n    Men's Journal.   May 2014.", "Shelton, Richard C.   \"Steps Following Attainment Of Remission: Discontinuation Of Antidepressant Therapy.\"\r\n    The Primary Care Companion To The Journal Of Clinical Psychiatry.   2001.", "Strand, Erik.   \"Tryptophan: What Does It Do?\"\r\n    Psychology Today.   1 September 2003.", "Tchikaya, FO et. al.   \"Anacardium Occidentale Linn. (Anacardiaceae) Stem Bark Extract Induces Hypotensive And Cardio-Inhibitory Effects In Experimental Animal Models..\"\r\n    African Journal of Traditional, Complementary and Alternative Medicines.   1 June 2011.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]