["“BREAKING NEWS,” reads a post in “Africa is HOME”, a Facebook page with more than 45,000 followers. “Emmanuel Macron, the president of France and colonial master of France Africa says: Any African country that refuses its citizens from taking the Corona virus vaccine would be banned from travelling in Europe (sic)”.", "The post prompted angry responses, including comments that Europeans should “stop coming to Africa” and “leave us alone”.", "Similar Facebook posts have been shared in Cameroon, Morocco (in French) and the Democratic Republic of Congo (in French).", "AFP Fact Check has debunked various false claims about vaccination in Africa since two leading French doctors sparked accusations of racism for discussing the idea of testing a COVID-19 vaccine on the continent.", "Many of the Facebook posts, which have been circulating since June 5,  feature a photo of Macron alongside a quote in French attributed to the president. “Emmanuel Macron: Citizens of any African country not willing to use the European vaccine for COVID-19 will no longer travel to Europe,” it reads.", "AFP Fact Check ran a Google reverse image search on the photo and traced it to the archives of Reuters news agency. According to Reuters’ photo caption, the picture was taken at a press conference in the Polish capital Warsaw on February 3, 2020.", "In the press conference (in French), Macron discussed various issues such as nuclear weapons and European defence. However, he did not mention the COVID-19 pandemic or vaccines.", "The quote does not appear in the French presidency’s communication channels, including Macron’s Twitter account or the Facebook page or website of the Elysee, his official residence.", "There is currently no vaccine for COVID-19, which has killed more than 400,000 people around the world, according to an AFP tally on June 10, 2020. More than 120 candidate vaccines are currently in testing, with 10 candidates being trialled on humans.", "Contacted by AFP Fact Check, the French foreign ministry rejected the claims circulating on Facebook as “baseless”.", "Furthermore, the French president would not have the power to impose a Europe-wide travel ban on Africans. Only the European Commission, the executive branch of the European Union, could propose such legislation.", "Guillaume Roty, a spokesman for the European Commission in France, dismissed the claims in an interview with French channel TV5Monde (in French).", "“There’s been no announcement regarding the need to be vaccinated to enter the Schengen area,” he said, referring to the group of 26 European countries without border controls between them.", "It’s not the first time politicians have been targeted in the wave of misinformation and disinformation triggered by the pandemic.", "AFP Fact Check has previously debunked claims including a doctored news report apparently announcing that US President Donald Trump tested positive for COVID-19 and posts claiming Nigerian politician Atiku Abubakar pledged to pay citizens to stay home during lockdown.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]