["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "House Minority Leader Nancy Pelosi of California, looks over her remarks before a news conference on Capitol Hill July 14, 2017, where she renewed calls for a vote on an independent commission to investigate Russia's involvement in the election. (AP)", "A story on Facebook says that House Democratic Leader Nancy Pelosi and former FBI director Robert Mueller are having a \"steamy, 13-year affair,\" but the story is fake news.", "\"Mueller will be forced to resign over Pelosi affair,\" stated a Jan. 18 headline by The Patriot Report.", "Facebook users flagged the post as being potentially fabricated, as part of the social network’s efforts to combat fake news. The story has no evidence and is fake news. The story attributes the information to Ladies of Liberty, a website that describes itself as satire.", "Mueller was appointed by the Justice Department as special counsel to investigate connections between President Donald Trump’s 2016 campaign and Russia. In May, Pelosi supported Mueller’s appointment as a \"first step\" but in October called for an \"outside, fully independent investigation.\"", "The Patriot Report said that Pelosi and Mueller had a 13-year affair that will force Mueller to resign, but Pelosi will hold her California congressional seat until she dies.", "The story said that Pelosi said her husband was aware of the affair and that her \"husband was afforded the same freedom to explore 'pleasures of the flesh.' \"", "Pelosi has never made any such comment.", "Fictional affairs are common fodder on fake news websites. We previously debunked fake articles claiming that U.S. Rep. Debbie Wasserman Schultz, a Florida Democrat, had an affair with former FBI Director James Comey, and that U.S. Sen. Chuck Schumer, a New York Democrat, had an affair with a cheerleader. We rated both of those claims Pants on Fire.", "We sent a message to The Patriot Report on Facebook and did not get a reply.", "A headline said that \"Mueller will be forced to resign over Pelosi affair.\" There is no evidence that such an affair occurred. We rate this headline Pants on Fire.", "The Patriot Report, \"Mueller will be forced to resign over Pelosi affair,\" Jan. 8, 2018", "Ladies of Liberty, \"UPDATE: Mueller will be forced to resign over Pelosi affair,\" Dec. 2, 2018", "U.S. Rep. Nancy Pelosi, Biography, Accessed Jan. 23, 2018", "U.S. Rep. Nancy Pelosi, \"Pelosi Statement on Special Prosecutor to Investigate Trump-Russia Connection,\" May 17, 2017", "CNN, \"Capitol Hill is reeling after Mueller indictments,\" Oct. 30, 2017", "PolitiFact, \"Who is Robert Mueller? New special counsel leading Russian investigation,\" May 17, 2017", "PolitiFact, \"Fake news says Chuck Schumer had affair with teenage cheerleader,\" Dec. 18, 2017", "PolitiFact, \"It's fake news that James Comey and Debbie Wasserman Schultz are an item,\" July 10, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]