["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "WhiteHouseGiftShop.com is selling COVID-19-themed commemorative coins for around $100.", "The gift shop has a historical connection with the White House that dates back to the Truman administration, but it was taken over by a private company.", "The federal government is not affiliated with the shop and isn’t involved in any of its products or operations, its owner says.", "Headlines going around social media are leading some people to wrongly believe that President Donald Trump is trying to profit from the pandemic by selling COVID-19-themed commemorative coins.", "The caption on one Facebook user’s post says: \"Just when you think that Trump couldn't stoop any lower.....we find ROCK BOTTOM HAS A BASEMENT!\"", "Attached is a screenshot of a headline from LGBTQ Nation that says: \"White House Gift Shop is selling coronavirus commemorative coins now.\"", "The coins are being sold on WhiteHouseGiftShop.com — but the White House isn’t selling them. The gift shop featured is a private business.", "The posts were flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The name confused a lot of people, including Sen. Bernie Sanders, who tweeted on April 29 that if Trump can sell $100 coins, he can use his power to manufacture more supplies for medical workers.", "If the White House Gift Shop is going to produce $100 COVID-19 coins, Trump can sure as hell utilize the Defense Production Act to manufacture the gloves, gowns, and masks our medical workers desperately need. https://t.co/Wr6Y1uwG0i", "The White House Gift Shop is a private company that is no longer affiliated with the U.S. government.", "The coins are listed at $125, and the company says it will donate the proceeds to COVID-19 medical research.", "The shop has sold other commemorative coins in the past, such as a D-Day memorial coin and one for the anniversary of the U.S. embassy moving to Jerusalem.", "In 2018, the website started selling a commemorative coin celebrating a summit meeting between Trump and North Korea leader Kim Jong Un that ended up getting canceled.", "The shop says the new COVID-19 coins are part of its \"Historic Moments in History Series,\" which includes a coin for the creation of the U.S. Space Force.", "\"White House Gift Shop\" and \"White House Gift Shop, Est. 1946\" are trademarks registered to Giannini Strategic Enterprises, a limited liability company based in Lititz, Pa., according to the U.S. Patent and Trademark Office database.", "Anthony Giannini is listed as the CEO on the company’s website. Giannini did not respond to a request for comment, but he told fact-checking website Snopes that the shop is \"not affiliated with the White House, nor is the White House involved in any of our decisions, products, or operations.\"", "While the operation isn’t connected to the White House now, it once was and dates back to the Truman administration.", "According to a LancasterOnline.com report, the gift shop started as a fund to benefit the family of a slain officer of the White House police, now the U.S. Secret Service. It was originally set up in the basement of the White House before it relocated to the nearby executive mansion.", "The now-defunct Secret Service Uniformed Division Benefit Fund ran the gift shop before running into financial trouble. Giannini told Snopes that the ownership of the gift shop was officially transferred to his corporation in 2012, and he was awarded a trademark for the name in 2016. The gift shop no longer has a physical space and operates solely online.", "A private gift shop is located across the street from the White House, and the White House Historical Association also has a gift shop nearby. People on public White House tours can also buy souvenirs from the association.", "People are accusing Trump of trying to profit off the COVID-19 pandemic by selling $125 commemorative coronavirus coins.", "The White House Gift Shop is selling the coins on its website, but it's a private business. The shop has a historical connection to the White House, but it is not currently affiliated with the president, the White House, or any other government entity.", "We rate this False.", "CORRECTION (May 6): This article has been corrected to say the White House Historical Association manages souvenirs for White House tours.", "Facebook post, April 29, 2020", "The White House Gift Shop,  COVID 19 coins, Accessed May 1, 2020", "U.S. Patent and Trademark Office Trademark Electronic Search System, White House Gift Shop ; White House Gift Shop Est., 1946; Accessed May 1, 2020", "Snopes, Is the White House Gift Shop Selling Coronavirus Commemorative Coins?, April 30, 2020", "FactCheck.org, The White House Isn’t Selling Coronavirus Coins, April 30, 2020", "Lancaster Online, From 1600 Pennsylvania Ave. to Warwick Center: How the White House Gift Shop wound up in Lititz, May 27, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]