["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "President-elect Joe Biden and his wife Jill, along with Vice President-elect Kamala Harris and her husband Douglas Emhoff, arrive at the U.S. Capitol ahead of Biden's inauguration on Jan. 20, 2021, in Washington. (AP/Tulis)", "• A Biden proposal to provide a route to citizenship for immigrants would exclude anyone who entered the U.S. after Jan. 1, 2021. A caravan of migrants that had been traveling from Honduras toward the U.S. border had broken up by Jan. 19.", "• PolitiFact found no evidence that Biden questioned the loyalty of U.S. troops. Vetting of National Guard troops assigned to the Biden inauguration stemmed from the involvement of ex-military members in a Jan. 6 riot at the U.S. Capitol.", "President Joe Biden had been in office only for a few hours when claims began to circulate about how he had already failed in his new role.", "\"It has been a terrible start for ‘the big guy,’\" Restoration PAC, a super PAC based in suburban Chicago, posted on Facebook on Jan. 20, following the late-morning presidential inauguration.", "An accompanying image read: \"4 Biden failures before taking office: Sparked an immigration crisis — migrant caravan from Honduras is moving towards the US border; questioned the loyalty of US troops in Washington D.C.; invoked race during the U.S. Capitol riot — said BLM would be treated differently by police; calls for unity but goes along with the divisive impeachment.\"", "For this fact-check, we focused on the first two points. The latter two are accurate: Biden said Black Lives Matter protesters would have been treated differently than U.S. Capitol rioters were, and his assessment is supported by several examinations that compared police responses to summer protests for racial justice with the riot. And Biden supports the impeachment trial, which he has said he thinks the Senate can juggle with its usual business.", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "As a super PAC, Restoration PAC has few limits on fundraising or spending to advocate for or against political candidates. In the 2020 election cycle, Restoration PAC spent $18.7 million on communications to oppose Democrats, and $1 million on communications supporting Republicans.", "The claim that Biden \"sparked an immigration crisis\" draws a connection between his actions and a migrant caravan from Honduras that the Facebook post says \"is moving toward the U.S. border.\"", "The migrants were attempting to flee Honduras, beset for years by poverty and gang violence and now ravaged by COVID-19. The already desperate conditions in the country were worsened by two major hurricanes in November that left many people without jobs or homes.", "By the time the Facebook post was published, though, the caravan had already dissipated in Guatemala, stopped by roadblocks where Guatemalan forces used tear gas and batons to turn back the group of thousands.", "It is not uncommon for migration to occur around the time of U.S. elections and transitions of power, NBC News reported, citing spikes in late 2016, early 2017 and 2018 around the time of the midterm elections.", "Opponents of Biden’s immigration plans have sought to link his proposals to the caravan’s movement.", "U.S. Rep Ken Buck, R-Colo., tweeted a video on Jan. 20 of the Honduran migrants clashing with Guatemalan soldiers, writing, \"This is what happens when you announce plans to grant amnesty to millions of illegal immigrants. Joe Biden’s open borders plan has consequences.\"", "But a Biden proposal to provide a route to citizenship for immigrants illegally in the country would apply only to people who were already in the U.S. as of Jan. 1, 2021, to deter migrants from moving toward the U.S. border.", "The Facebook post’s claim that Biden \"questioned the loyalty of U.S. troops in Washington, D.C.\" does not include examples or specifics.", "It likely is related to the decision to vet all National Guard troops assigned to the city for the inauguration, after concerns about extremism and insider threats. PolitiFact did not find any published comments from Biden or his representatives about the vetting process or the loyalty of the National Guard.", "The screening resulted in 12 National Guard members being removed from inaugural duties. Two of them had made extremist statements about the event, the Associated Press reported.", "\"This type of vetting often takes place by law enforcement for significant security events,\" said Christopher Miller, the Acting Secretary of Defense under Trump, in a Jan. 18 statement. \"However, in this case the scope of military participation is unique.\"", "Regarding the scope, 25,000 members of the National Guard were deployed for Biden’s inauguration, compared with more than 7,000 for Trump’s 2017 inauguration.", "The National Guard presence at inaugural events was beefed up following a Jan. 6 riot at the U.S. Capitol, and the background checks were added after the discovery that ex-military members had participated in the riot.", "Nine of the people arrested for participating in the riot were former U.S. military members, ABC News reported. One of the five people who died as a result of the riot was a U.S. Air Force veteran shot by police as she climbed through a window near the House chamber.", "We contacted Restoration PAC for comment but did not receive a reply.", "A Facebook post attacking Biden’s pre-presidential \"failures\" blamed him for a migrant caravan from Honduras and said he questioned the loyalty of U.S. troops in Washington.", "Biden’s proposal to provide a route to citizenship for immigrants is only applicable to people who were already in the U.S. as of Jan. 1, 2021. The caravan that had been headed for the U.S. border disbanded.", "PolitiFact did not find any evidence that Biden questioned the loyalty of U.S. troops in Washington. The decision to vet the National Guard members deployed for the inauguration followed the discovery that ex-military members had participated in the Jan. 6 riot at the U.S. Capitol.", "We rate these claims Mostly False.", "ABC News, \"Nearly a dozen ex-military members among those arrested in connection with Capitol riot,\" Jan. 16, 2021", "Associated Press, \"2 Guard members made extremist statements about inauguration,\" Jan. 20, 2021", "Associated Press, \"Biden immigration plan opposed by GOP, conservative groups,\" Jan. 20, 2021", "U.S. Department of Homeland Security, DHS Statement on the Suspension of New Enrollments in the Migrant Protection Protocols Program, Jan. 20, 2021", "Associated Press, \"FBI vetting Guard troops in DC amid fears of insider attack,\" Jan. 18, 2021", "Associated Press, \"Large migrant caravan dissolves in Guatemala,\" Jan. 20, 2021", "Associated Press, \"Trump leaves mark on immigration policy, some of it lasting,\" Dec. 30, 2020", "CNBC, \"Army Secretary says intel before Capitol riots was ‘all over the board’ as 6,200 National Guard go to D.C.,\" Jan. 7, 2021", "Facebook post, Jan. 20, 2021", "NBC News, \"Incoming Biden administration to migrant caravan: Don't come, you won't get in immediately,\" Jan. 18, 2021", "New York Times, \"Racial Double Standard of Capitol Police Draws Outcry,\" Jan. 7, 2021", "New York Times, \"Woman Killed in Capitol Embraced Trump and QAnon,\" Jan. 7, 2021", "NPR, \"Thousands Of Migrants Travel To Guatemala Hoping To Reach U.S.,\" Jan. 19, 2021", "OpenSecrets.com, \"Restoration PAC: Outside Spending Summary 2020,\" accessed Jan. 21, 2021", "PolitiFact, Black Lives Matter protests and the Capitol assault: Comparing the police response, Jan. 8, 2021", "PolitiFact, \"Restoration PAC,\" accessed Jan. 20, 2021", "Rev, \"Joe Biden Introduces DOJ Nominees, Merrick Garland Transcript,\" Jan. 7, 2021", "Twitter post, Jan. 19, 2021", "Twitter post, Jan. 20, 2021", "USA Today, \"Fact check: National Guard members remained armed during inauguration,\" Jan. 20, 2021", "U.S. Department of Defense, \"Statement by Acting Secretary of Defense Christopher Miller on National Guard Support in Washington, D.C.,\" Jan. 18, 2021", "Washington Post, \"Lafayette Square, Capitol rallies met starkly different policing response,\" Jan 14, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]