["About this rating", "On 20 January 2018, amid the hue and cry of a federal government shutdown taking effect thanks to failure on Congress to reach a bipartisan deal on a short-term spending bill, the two sides passed blame back and forth over the Senate floor like a hot potato.", "Fox News reported that the sticking point for Democrats was the March 2018 expiration of the Deferred Action for Childhood Arrivals (DACA) program, which allows a measure of respite for young people who were born outside the United States and were brought to the country as children and who, in many cases, have spent years maneuvering a backlogged immigration system in order to be able to apply for citizenship:", "The deadline arrived without a deal. The U.S. government shut down at midnight Friday after Congress failed to overcome a partisan divide over immigration and spending.", "In a late-night vote, Senate Democrats joined to block a bill that would have kept the government running until mid-February. A flurry of last-minute negotiations failed to produce an agreement.", "Democrats tried to use the Friday night funding deadline to win concessions from Republicans, including an extension of DACA, an Obama-era program protecting some young immigrants from deportation. The program is set to expire in March. Republicans sought more time for talks, but Democrats refused.", "The Republican-controlled White House went so far as to change the outgoing message on the White House telephone comment line (202-456-1111) to an unprecedented message blaming Democrats:", "Thank you for calling the White House. Unfortunately, we cannot answer your call today, because Congressional Democrats are holding government funding, including funding for our troops and other national security priorities, hostage to an unrelated immigration debate. Due to this obstruction, the government is shut down. In the meantime, you can leave a comment for the president at www.whitehouse.gov/contact. We look forward to taking your calls as soon as the government reopens.", "The existence of the message was confirmed by various reporters:", "saw this going around and wanted to check for myself: here’s the message you hear today when you ring the White House comment line during the shutdown pic.twitter.com/sCquYj0XnX", "— David Mack (@davidmackau) January 20, 2018", "We called and were able to confirm for ourselves that this was indeed the White House's outgoing telephone message on 20 January 2018.", "If no deal is reached by 22 January 2018, thousands of federal employees will be placed on unpaid furloughs, as CNN reported:", "Whoever works for agencies and departments that are considered nonessential, including agencies that pay out small business loans and process passport requests, will cease to work effective immediately until Congress is able to agree on a bill for the federal budget.", "The employees in these departments would be placed on \"furlough.\" In previous shutdowns, everyone who stayed home was paid retroactively after an agreement was reached in Washington.", "At the peak of the 2013 government shutdown, about 850,000 employees were furloughed per day, according to the Office of Management and Budget.", "Members of Congress, however, will still receive full pay.", "Brooke Binkowski is a former editor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]