["About this rating", "A big game hunter was eaten by lions at the Ingwelala Private Nature Reserve in South Africa in February 2018.", "The man did not kill three baboon families before his death, he died in February 2018 and not March 2019, and the image of a dead baboon attached to viral accounts of his demise is unrelated to his story.", "In March 2019, social media users encountered a story from the website \"Nature Is Metal\" reported under the headline \"Trophy Hunter Eaten Alive By Lions After He Murdered 3 Baboon Families\":", "Ingwelala Private Nature Reserve in South Africa was shaken with the screams of a man who was attacked and killed by Pride of Lion in private game reserve near the Kruger National Park. Before the lions were dispersed with the help of gun-shots, they had eaten most of the body barring the head that was untouched.", "If the paragraph quoted above seems familiar, it's because the same website had previously published that identical chunk of text in a 2018 article offering a slightly different claim: At that time, Nature is Metal was reporting that the trophy hunter had been eaten alive after he killed a lion's cub.", "We also found near verbatim copies of the \"lion cub\" story published on the websites \"Southland Post\" and \"Voyager Channel.\" These three websites appear to be owned and operated by the same person, as they all list the same email contact.", "When Nature is Metal republished this well-worn story in March 2019, they made two small changes: An image supposedly showing a man with a baboon he recently killed was featured at the top, and a single sentence about dead baboons was added to the text: \"The man had killed 3 Baboon families and spread the bodies around to attract and distract the lions to make them easier to hunt.\"", "Nature Is Metal's \"baboon\" story was an embellishment of their previous \"lion cub\" story, which was in turn an embellishment of a genuine incident that took place at the Ingwelala Private Nature Reserve in February 2018. BBC News reported of the February 2018 event that:", "A suspected big cat poacher has been eaten by lions near the Kruger National Park in South Africa, police say.", "The animals left little behind, but some body parts were found over the weekend at a game park near Hoedspruit.", "\"It seems the victim was poaching in the game park when he was attacked and killed by lions,\" Limpopo police spokesman Moatshe Ngoepe told AFP.", "\"They ate his body, nearly all of it, and just left his head and some remains.\"", "We examined a number of contemporary reports about this man's death, who was later identified as David Baloyi, and found no credible reports declaring that he had killed three baboon families (or a lion cub) before his death. It appears that Nature is Metal invented the baboon aspect of the story in order to squeeze a few more clicks out of the death of a poacher.", "Nature Is Metal.   \"Trophy Hunter Eaten Alive by a Pride of Lions After He Murdered Their Cub.\"\r\n    27 December 2018.", "Nature Is Metal.   \"Trophy Hunter Eaten Alive by Lions After He Murdered 3 Baboon Families.\"\r\n    17 March 2019.", "BBC News.   \"South African Lions Eat 'Poacher,' Leaving Just His Head.\"\r\n    12 February 2018.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]