["The video, which we’ve archived here, was posted by the Facebook page Trend Media with the caption: “‘Buhari rigged 2019’ this is an inscription found on a bus in UK”. It has been shared by nearly 1,000 Facebook users since it was posted in March, and seen more than 12,000 times. The same doctored video clip was also shared elsewhere on Facebook with the caption “Buhari’s rigged 2019 elections become advertorial on London metro bus. #london #uk #nextlevel #pdp”. That version of the video, archived here, has been viewed some 1,300 times.", "Other versions of the clip were shared on YouTube and Twitter -- we’ve archived those here and here.", "The video is not new to AFP Fact Check -- the same footage was also doctored to suggest that London buses were carrying adverts calling for the imprisonment of Nigeria’s former senate president Bukola Saraki.", "We fact-checked the Saraki version of the clip here. Like that video, the second version, carrying the message about Buhari, bears tell-tale signs that it’s doctored -- the white part of the sign is brighter than the rest of the footage. You would also expect to see moving shadows on the surface of the sign if it was on the side of a moving bus, which is not the case.", "The original video was filmed at London’s Trafalgar Square (see map here) looking down Whitehall towards the Houses of Parliament and Big Ben -- you can see the monument in the footage. The clock tower housing the Big Ben bell (officially known as the Elizabeth Tower) is clearly visible in the footage, which means the video must have been shot before the monument was covered in scaffolding in mid-2018 for renovation work. While we haven’t been able to identify the original source of the footage, we therefore know it was filmed well before the Nigerian election of February 2019.", "Transport for London (TfL), the city authority which operates the bus network, confirmed to AFP in March that it does not allow advertising which is overtly political.", "“This is not a genuine advert running in London,” a TfL official said via email, when asked about the Bukola Saraki clip.", "The transport authority’s guidelines also state that it will not run an advert if “it promotes a party political cause or electioneering”. You can read TfL’s advert policy here.", "London’s 91 bus route does, indeed, pass through this location. Therefore, you may ask, how could anyone have edited genuine video footage to add the text? Simple. As this video shows, it’s possible to stick text onto moving objects in a video using editing software:", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]