["Conservative critics have pounced on a new health guidance in California schools about gender.", "\"California to teach kindergarteners there are 15 genders,\" states the text on a Facebook video created by the Freedom Project Media’s Dr. Duke Show, a podcast that focuses on education.", "The show features University of Wisconsin Oshkosh English professor Duke Pesta, who describes himself as an education reformer.", "\"The state of California is now moving to mandate that kindergarten teachers teach 5-year-olds 15 different genders in every single California kindergarten school,\" Pesta says.", "The post has been circulating since Freedom Project Media first posted it in January. One video we found, shared by another group May 28, was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "We found the video’s claim outdated and misleading.", "Duke’s video stems from the California Department of Education’s health education curriculum framework, which provides guidance for K-12 school districts. In 2018, the department released draft revisions and opened it up for public comment.", "Hundreds of pages long, the document provides guidance on many health topics, such as nutrition and physical activity, injury prevention, alcohol and drugs, and yes, gender.", "While the LGBTQ community praised the new recommendations, sections on sex education and gender drew some criticism.", "Pesta’s video, for instance, zeroed in on a section about gender lessons for kindergarteners through third graders. But it does not interpret the guidance correctly.", "The framework states that many children have encountered gender stereotypes by kindergarten.", "\"The goal is not to cause confusion about the gender of the child but to develop an awareness that other expressions exist,\" the framework states.", "The framework suggests lessons and activities, such as showing images of children who don’t conform to stereotypes and inviting adults who might be a stay-at-home dad or a female firefighter to visit the classroom. The lessons are intended to dispel myths and link families with resources to help prevent bullying.", "The document mentions several books that can help, and The Dr. Duke Show focused on one in particular.", "The book, titled, \"Who Are You?: The Kids Guide to Gender Identity,\" reads:", "\"Some people say there are only two genders. But there are really many genders. I am … girl boy both neither just me! You are who you say you are, because YOU know best. For some people, the grown-ups guessed right about their body and their gender. This is called cisgender — when someone’s identity matches their sex assigned at birth. And for some people, there are more than just two choices. These are just a few words people use: trans, genderqueer, non-binary, gender fluid, transgender, gender neutral, agender, neutrois, bigender, third gender, two-spirit … and there are even more words people are using to describe their experience. This is called the gender spectrum.\"", "Melina Sevlever, a psychologist with the Columbia Gender Identity Program, said there are actually more than 15 terms to describe gender identity, and some overlap.", "The suggested book idea didn’t last. On May 8, following objections by some parents about the sex education or gender lessons, the State Board of Education removed several recommended books about sex or gender, including \"Who Are You?\"", "While the book is still mentioned in the framework document from April, a spokesman for the state Department of Education told us that it will add a disclaimer stating that it is in the process of revisions expected in a couple of months.", "But even when the book was included in the document, there was nothing stated suggesting it was a mandatory lesson for kindergarteners statewide. That wasn’t the point.", "The book was mentioned as a potential resource that could be shared with parents and caretakers:", "\"Parents, guardians, or caretakers receive a handout with suggestions on how to initiate a conversation on growth and development with their child. Books such as It’s Not the Stork! A Book About Girls, Boys, Babies, Bodies, Families and Friends by Robie H. Harris (2008) or Who Are You?: The Kids Guide to Gender Identity by Brook Pessin‐Whedbee (2017) can be shared together.\"", "Freedom Project Media went further than the draft suggested reading list, writing that the gender lesson was mandatory and pointing to the state policy that parents can’t opt their children out of programs about gender identity.", "But that isn’t right either. Under the California Healthy Youth Act, parents can opt out of sex education. The law doesn’t provide a way for parents to opt out of general instruction related to LGBTQ people if the lesson itself does not fall under the umbrella of sex education, which is education about sexual activity itself. For example, a lesson on Harvey Milk, who was California’s first openly gay elected official, would not be described as sex ed.", "A video Facebook post said, \"California to teach kindergarteners there are 15 genders.\"", "The recently shared video from January criticized California’s draft health curriculum framework. At the time, the state document included some recommended books for parents including \"Who Are You?: The Kids Guide to Gender Identity.\"", "The book listed various gender identity terms. But it was not included in the state guidance as a mandatory lesson for teachers of all kindergarten students in California.", "The controversy is also out of date, which some Facebook groups may not know about. On May 8, the California Board of Education decided to remove the book, among others, and the state is in the process of updating the document that lists the book.", "We rate this statement False.", "Democracy Needs Borders, Video, May 28, 2019", "California Department of Education, Health education framework and press release, 2019", "Snopes, Did California Attempt to Force Parents to Accept a Curriculum That Teaches Children ‘There Are 15 Genders’? Jan. 28, 2019", "Freedom Project Media, Snopes Lies About California’s Plan To Teach 5-Year-Olds Transgenderism, Jan. 30, 2019", "Freedom Project Media, California Wants to Teach Kindergartners There are 15 Genders, Jan. 18, 2019", "Sacramento Bee, Porn or vital life lessons? California approves controversial new sex education approach, May 8, 2019", "Associated Press, California overhauls sex education guidance for teachers, May 8, 2019", "LA Times, Controversial sex education framework for California approved despite protest, May 10, 2019", "Washington Times, California pushes talks in new sex ed guidelines, May 10, 2019", "East Bay Times, Parents opposed to comprehensive sex education pull children out of schools, stage rallies across Southern California, May 18, 2019", "Statement by Freedom Project to PolitiFact, May 28, 2019", "Democracy Without Borders, Facebook message, May 28, 2019", "Interview, Scott Roark, California Department of Education spokesman, May 28, 2019", "Interview, Melina Sevlever, psychologist with the Columbia Gender Identity Program, May 29, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]