["About this rating", "A photograph supposedly showing a man hand-feeding a polar bear in Russia sometime in the 1970s is frequently shared by historical-picture social media accounts:", "The seemingly dangerous situation depicted in the image, as well as the fact that these accounts don't always provide accurate captions, led many viewers to be a little skeptical that this was a genuine photograph.", "But this picture is quite real. It was taken near the Siberian town Cape Schmidt off the coast of the Chukchi Sea sometime in the 1970s and shows a man named Nikolai Machulyak.", "Machulyak was a bit of a local celebrity at the time due to his frequent encounters with polar bears. When rumors of a man who had \"tamed the beasts\" reached author V. Filimonov, he set out to find him. In August 1977, Filimonov published an article about Machulyak entitled \"ДРУЖБЫ ТВОЕЙ ПРОШУ\" (\"I Ask For Your Friendship) in the Russian travel magazine Вокруг света (\"Around the World\"):", "Machulyak explained that a young polar bear was abandoned after a hunter killed its parent in December 1974. Machulyak fed the young polar bear, which he named \"Masha,\" for the remainder of the winter months until the bear left in the spring of 1975. A year later, he encountered a larger polar bear. While it seemed at first as if the bear was about to attack him, he soon realized that something quite different was happening.", "Here's how Machulyak explained the origins of this story to Around the World magazine (loosely translated via Google):", "In December 1974, a Chukchi hunter killed a polar bear that devastated its yaranga. After her there was a pestoon - a young bear, which I fed for five months: she had not yet learned to hunt. Called her Masha. In the spring of 1975, she left, and almost a year later I saw her again ...", "... And suddenly this bear rushes to me. Often a person does not manage to unravel the intentions of the beast, but here I felt: this is not an attack. All bears are usually on the same face ... but then I realized - Masha! I stopped her with a wand. I always carry such a wand with me. Light, sixty centimeters.", "Masha was at a loss - this was visible in her face, at will, bypassing the wand, approaching me. She clearly recognized me ... And yet it was scary. After all, 11 months have passed since our last meeting. I immediately brought meat from the trap. She ate willingly.", "The Around the World article also included journal entries that Machulyak had written about his experiences with Masha. In them, he recounts his various encounters with her, such as the time he fed her seal meat from his hands.", "Masha wasn't the only polar bear that Machulyak encountered during this period. At one point, a larger bear named \"Marya Mikhailovna\" pushed Masha from her den. Machulyak was able to befriend this bear, too, as well as her cubs.", "The Russian Geographical Society collected and published several other photographs of Machulyak and this family of polar bears:", "Although Machulyak had multiple encounters with these polar bears, he said that he always approached with caution:", "The beast is the beast. But every time I set myself up before a meeting. I mentally tell Masha, and not only to her, but to any bear: \"I ask for your friendship. Here is my hand in advance — palm up, there is no weapon, there is a can of condensed milk in it that you love. You are a beautiful, strong and amiable beast to me. I want to have a friend in you, and in friendship I will not be more faithful.\"", "В. Филимонов.   \"ДРУЖБЫ ТВОЕЙ ПРОШУ.\"\r\n    Журнал Вокруг света.   August 1977.", "Русское географическое общество.   \"ДРУЖБЫ ТВОЕЙ ПРОШУ.\"\r\n    1 April 2014.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]