["For several years, a viral passage comparing gun and abortion regulations has circulated on social media with credit to feminist icon Gloria Steinem. While Steinem may have agreed with the post’s criticism of legislative red tape surrounding abortion, the attribution to the activist is incorrect.", "“How about we treat every young man who wants to buy a gun like every women who wants to get an abortion — mandatory 48-hour waiting period, parental permission, a note from his doctor proving he understands what he’s about to do, a video he has to watch about the effects of gun violence,” a July 29, 2019, Facebook post quotes Steinem.", "“Let’s close down all but one gun shop in every state and make him travel hundreds of miles, take time off work, and stay overnight in a strange town to get a gun,” the post continues. “Make him walk through a gauntlet of people holding photos of loved ones who were shot to death, people who call him a murderer and beg him not to buy a gun.”", "More:Fact check: Conspiracy theory about military control of Washington is false", "The nearly 2-year-old post received an abundance of online attention in early February, furthering the old misconception.", "Versions of this post have been circulating with Steinem’s name attached since October 2017, when a gunman opened fire at a Las Vegas music festival, marking the deadliest mass shooting in recent American history.", "Steinem did not author this post, although she has said she agreed with it.", "The Facebook user who posted the quote did not respond to USA TODAY’s request for comment.", "More:Fact check: Fake quote about right to bear arms attributed to George Washington", "Steinem posted a version of the piece to Facebook on Dec. 8, 2015, as part of her “Top Ten Things I want for Christmas” list. In her post Steinem disclosed that she was not the passage’s author.", "“This riff is not mine, it’s on the Internet – I thank whoever gave us all this present,” she wrote.", "“I want any young men who buy a gun to be treated like young women who seek an abortion. Think about it: a mandatory 48-hours waiting period, written permission from a parent or a judge, a note from a doctor proving that he understands what he is about to do, time spent watching a video on individual and mass murders, traveling hundreds of miles at his own expense to the nearest gun shop, and walking through protestors holding photos of loved ones killed by guns, protestor who call him a murderer,” read Steinem’s post. “After all, it makes more sense to do this for young men seeking guns than for young women seeking an abortion. No young woman needing reproductive freedom has ever murdered a roomful of strangers.”", "More:Fact check: Decades-old quote misattributed to Rep. Marjorie Taylor Greene", "Huffington Post noted in an Oct. 5, 2015, article that the quote had gone viral after a Facebook user posted it earlier that month. That post garnered more than 82,000 shares and 44,000 likes.", "The Facebook user, who has removed the post, did not respond to USA TODAY’s request for comment.", "Social media users were not the first to make this comparison. William Hamby compared gun laws and abortion laws in a 2013 article for the Examiner.", "“The Supreme Court has ruled that owning guns and getting abortions are both rights granted to Americans, but the laws governing each are remarkably different,” Hamby wrote in the article, which is no longer available since the Examiner shut down in July 2016.", "More:Fact check: Voter fraud claims in Nevada based on failed lawsuit", "The quote's origins are still unknown.", "Feminist social activist Gloria Steinem did not author a viral quote which has been widely misattributed to her. Steinem posted a version of the quote to Facebook in 2015 and disclosed that the piece was not her own. The original author is still unknown. We rate the claim FALSE because it is not supported by our research.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook."]