["A disturbing video claimed to be from Uttar Pradesh has been making the rounds on social media. The clip shows a charred dead body of a girl. Several users are sharing the clip and targeting the BJP-led government in UP. “This is how daughters are being killed in Uttar Pradesh! Remove the BJP, save the country,” reads one of the captions.", "Alt News is not including the clip in this article given its gory nature.", "The video is also being falsely shared in connection with the recent Gulnaz Khatoon case. The young Muslim woman was burnt alive for resisting sexual harassment in Bihar’s Vaishali district.", "Alt News performed a reverse image search of a frame from the video and found news reports of a local news channel from Karnataka. We also found a picture of this incident in a Saaksha TV interview from November 9, 2020, which resembled the viral visuals. It states that this incident occurred in Karnataka’s Mysore.", "Using a keyword search we found a report by The Times of India dated November 9, 2020. This article quoted police sources as saying, “Around 5.30 am on Sunday, a local nurse and two of her friends were on a morning walk. They found smoke coming from an unknown object. As the smoke was thick, they decided to check where the smoke was coming from. They were shocked to see a body burning. They screamed and tens of locals rushed to the spot. They found a woman’s body that was set on fire and alerted police.”", "The report also mentions that the police believe the girl’s age is between 18 to 20 years. Due to the severity of her burns, she could not be identified immediately. However, police are still investigating the matter.", "The video was earlier debunked by Boomlive.", "A disturbing video depicting a burned dead body of a woman in Karnataka is circulating with the false claim that the incident took place in UP.", "Donate Now", "Priyanka Jha specialises in monitoring and researching mis/disinformation at Alt News. She also manages the Alt News Hindi portal.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]