["About this rating", "Voting in the 2020 U.S. Election may be over, but the misinformation keeps on ticking. Never stop fact-checking. Follow our post-election coverage here.", "On Oct. 24, 2020, a series of images supposedly showing three nuns in MAGA masks at an Ohio rally for U.S. President Donald Trump went viral on social media:", "Many people found the sight a bit strange and wondered if these were real nuns. Some posited that Trump had paid people to dress up as nuns and act as if they supported the president.", "These images, however, truly show a group of nuns who attended Trump's rally in Centreville, Ohio. They are from \"Children of Mary,\" a community that was founded circa 1989 in Newport, Ohio.", "The Children of Mary confirmed to the Washington Examiner that these people were truly nuns and that they were supporting Trump because of his anti-abortion policies:", "There are indeed many issues concerning the quality of life that need to be addressed. However, the preeminent issue is the intrinsic evil of taking innocent human life through abortion. We, as faithful Catholics, consider it our duty, a joyful duty, to support a president, irregardless of party affiliation, who upholds the Gospel of Life.", "We reached out to the Children of Mary for additional information but have yet to receive a response.", "This is not the first time that nuns from this community have shown their support for Trump. In January 2020, members of this community took part in the \"March for Life\" which was attended by the president. The Children of Mary website includes a handful of photographs from this march, including one showing nuns standing next to a \"Make Unborn Babies Great Again\" sign and another that carried the caption: \"Dear Lord, please bless and guide our President Trump.\"", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]