["About this rating", "A popular meme in March 2019 questioned why Bill Clinton had \"paid Paula Jones $850K to go away\" yet the FBI hadn't raided his lawyer's office. The meme was an obvious reference to two completely unrelated issues separated by decades: a 1994 lawsuit involving Clinton and a search warrant executed by the FBI in April 2018 at the office of President Donald Trump's attorney, Michael Cohen.", "In short, the major differences in the cases referenced by the meme — one of which involved an FBI raid on a lawyer's office and the other not — were as follows: Clinton openly paid Jones $850,000 to settle a sexual harassment lawsuit well after he became president and well after Jones had had a chance to air her allegations to the public, press, and court system, while Trump secretly used an intermediary to pay hush money to porn actress Stormy Daniels just ahead of a presidential election in order to keep her allegations that she had an affair with him from reaching the public and influencing the election results against him.", "Nothing Clinton did in settling Jones' civil lawsuit was illegal (or even potentially illegal), but Trump's payment of hush money to Daniels through his lawyer was possibly an illegal act on the part of Trump and/or Cohen, hence the raid on the latter's office but not the office of Clinton's lawyer.", "On 6 May 1994, Jones, a former Arkansas state employee, filed a sexual harassment lawsuit against Clinton just days before the statute of limitations would have expired. In her lawsuit, she maintained that on 8 May 1991, she was working the registration desk at Excelsior Hotel in Little Rock, Arkansas, where the Third Annual Governor's Quality Management Conference was being held, an event Bill Clinton (then governor of Arkansas) attended to deliver a speech. Jones alleged that an Arkansas state trooper, Danny Ferguson, approached her at the registration desk, told her that Clinton would like to meet with her, and escorted her to a business suite in the hotel where Clinton was staying.", "According to Jones, once she entered Clinton's hotel suite he complimented her on her physical appearance, put his hand on her leg, attempted to kiss her on the neck, asked her if she was married, and finally lowered his trousers to expose his erect penis and asked Jones to \"kiss it.\" When Jones rebuffed Clinton's advances, she said, he told her to \"keep this between ourselves\" and suggested that, in her words, he \"could damage her in her job and even jeopardize her employment.\"", "Jones did not publicly discuss the incident until The American Spectator referenced it in a January 1994 article, apparently based on information provided by Trooper Ferguson:", "The American Spectator account asserts that a woman by the name of \"Paula\" told an unnamed trooper (obviously Defendant Ferguson), who had escorted \"Paula\" to Clinton's hotel room, that \"she was available to be Clinton's regular girlfriend if he so desired,\" thus implying a consummated and satisfying sexual encounter with Clinton, as well as a willingness to continue a sexual relationship with him. These assertions are untrue.", "The American Spectator account also asserted that the troopers' 'official' duties included facilitating Clinton's cheating on his wife ... Since Jones (\"Paula\") was one of the women preyed upon by Clinton and his troopers, including by Defendant Ferguson, in the manner described above, those who read this magazine account could conclude falsely that Jones (\"Paula\") had a sexual relationship and affair with Clinton. Jones' reputation within her community was thus seriously damaged.", "Several months later, Jones filed her lawsuit against Clinton and Ferguson, seeking a total of $750,000 in compensation for damages and attorneys' fees on counts of sexual harassment, intentional infliction of emotional distress, and defamation. The issue of whether Jones could sue a sitting president went all the way to the U.S. Supreme Court, who upheld an appellate court decision that \"the President, like all other government officials, is subject to the same laws that apply to all other members of our society,\" and allowed Jones' case to proceed.", "However, Judge Susan Webber Wright of the U.S. District Court for the Eastern District of Arkansas dismissed the lawsuit on 1 April 1998, holding that \"the governor's alleged conduct does not constitute sexual assault,\" that \"plaintiff's allegations fall far short of the rigorous standards for establishing a claim of outrage under Arkansas law,\" that \"plaintiff has failed to demonstrate that she has a case worthy of submitting to a jury,\" and that \"there are no genuine issues for trial in this case.\"", "When it came to light a few months later that Clinton had lied under oath about his relationship with Monica Lewinsky during proceedings in Jones' lawsuit, Jones filed an appeal to reverse the dismissal and have her claims reinstated. On 13 November 1998, Clinton settled the matter by offering to pay Jones $850,000 in exchange for her agreement to drop her appeal, without admitting to or apologizing for the conduct alleged by Jones.", "Porn actress Daniels (the stage name of Stephanie Clifford) said she first met Trump at a celebrity golf tournament in Nevada in July 2006. The two engaged in sex in Trump's hotel room, she claimed, and continued an \"intimate relationship\" into the following year. Daniels discussed her relationship with Trump in a 2011 interview for In Touch magazine, but the interview was not published at that time, reportedly because Trump's personal attorney, Michael Cohen, threatened to sue over it when the magazine reached out to ask for comment.", "In January 2018, the Wall Street Journal reported that Trump's personal attorney, Cohen, had arranged to pay Daniels $130,000 just weeks before the 2016 U.S. presidential election in exchange for her signing a nondisclosure agreement related to her alleged 2006 affair with Trump.", "The following month, Cohen confirmed that $130,000 had been paid to Daniels, but he maintained that he had used his personal funds for the payment, and that \"Neither the Trump Organization nor the Trump campaign was a party to the transaction with Ms. Clifford, and neither reimbursed me for the payment, either directly or indirectly.\"", "On 5 April 2018, Trump denied to reporters that he knew about the payment to Daniels. When pressed about why the payment had been made, Trump replied, \"You'll have to ask Michael Cohen\" and asserted he didn't know where the $130,000 had come from. Four days later, acting on a warrant from federal prosecutors in New York's Southern District obtained in part on a referral from special counsel Robert Mueller's office, FBI agents seized a variety of material from Cohen's New York City office, home, and hotel room, including documents related to Cohen's payment to Daniels and to Karen McDougal, another woman who had alleged an affair with Trump.", "A month later, former New York Mayor Rudy Giuliani, now a member of Trump's legal team, said that Trump had personally repaid Cohen for the $130,000 payment to Daniels, and that the reimbursement had been \"funneled through a law firm.\" The following day, Trump contradicted his earlier claim that he didn't know about the payment by acknowledging that he had repaid Cohen, but he asserted the money \"had nothing to do with the campaign.\"", "In August 2018, Cohen pleaded guilty to eight charges, including five counts of tax evasion, one count of making a false statement to a financial institution, one count of being a \"willful cause\" of an unlawful corporate contribution, and one count of making an excessive campaign contribution, the latter two stemming from the \"hush money\" payments made to Daniels and McDougal. Prosecutors held that the payments made by Cohen violated federal campaign finance laws because they were meant to benefit the campaign but did not come from campaign contributions and were not reported to the Federal Election Commission (FEC). The payments therefore constituted illegal in-kind contributions to the Trump campaign that violated laws limiting such donations to $2,700 and requiring their disclosure to the FEC.", "Whether Trump himself could be charged with engaging in a criminal scheme to violate campaign finance laws for his involvement in the hush money payments is still a matter of legal debate, but the issue took a dramatic turn in February 2019 when Cohen revealed before Congress that he was paid reimbursement for the hush money directly from Trump's personal bank account after Trump became president.", "\"Cohen's public testimony directly implicates Trump in serious campaign finance violations,\" former FEC General Counsel Lawrence Noble told the Washington Post. \"Assuming Cohen is telling the truth about the purpose of the checks, the checks are documentary evidence supporting the allegation that Trump had Cohen pay Daniels $135,000 in hush money and then reimbursed Cohen.\"", "All in all, events proved the FBI had good reason to raid Cohen's office, as they gathered evidence of multiple federal crimes (beyond just campaign finance violations) to which Cohen pleaded guilty. Bill Clinton's payment to Paula Jones was a settlement of a civil lawsuit that did not involve any criminal matter or criminal wrongdoing, and thus it was of no legitimate interest to law enforcement. The only commonality between the two cases was that they involved payments by politicians to women, but for very different reasons and circumstances.", "Dowd, Katie.   \"Are These the Checks Donald Trump Gave Michael Cohen for the Stormy Daniels Payment?\"     San Francisco Chronicle.   27 February 2019.", "Goodman, Ryan and Andy Wright.   \"Mueller's Roadmap: Major Takeaways from Cohen and Manafort Filings.\"     Just Security.   December 8, 2018", "Rupar, Aaron.   \"What's illegal About Trump's Hush Payments to Women, Briefly Explained.\"     Vox.   12 December 2018.", "Kelly, Matthew.   \"In-Kind Contributions Are Boring ... Until Stormy Daniels Gets Involved.\"     OpenSecrets.org.   3 April 2018.", "Lord, Debbie.   \"Michael Cohen Plea Deal: How Were Campaign Finance Laws Broken?\"     The Atlanta Journal-Constitution.   22 August 2018.", "Associated Press.   \"A Timeline of Key Moments in Trump-Stormy Daniels Saga.\"     4 May 2018.", "Kirby, Jen.   \"A Timeline of Trumpworld's Changing Story on Stormy Daniels.\"     Vox.   4 May 2018.", "Samuels, Brett.   \"Timeline: Trump, Cohen, Stormy Daniels and $130,000.\"     The Hill.   4 May 2018.", "Theobald, Bill.   \"Why Hush Money Michael Cohen Paid Stormy Daniels Was an Illegal Campaign Donation.\"     USA Today.   14 December 2018.", "Kirby, Jen and Andrew Prokop.   \"Michael Cohen Pleads Guilty to 8 Federal Crimes.\"     Vox.   21 August 2018.", "Stewart, Emily and Dylan Matthews.   \"The Michael Cohen-Stormy Daniels Subplot, Explained.\"     Vox.   27 February 2019.", "Chalfant, Morgan.   \"Prosecutors Submit Redacted Cohen Raid Documents Under Seal, Teeing Up Public Release.\"     The Hill.   28 February 2019.", "Reuters.   \"Trump Says He Did Not Know About $130,000 Payment to Stormy Daniels.\"     5 April 2018.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]