["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "State Rep. Mark Batinick of Plainfield, Ill. | Rich Hein/Sun-Times", "In the thick of tax policy debates, Illinois politicians often point to other states to make their case.", "And this year has been no exception in Illinois’ most pitched policy battle — the debate over whether to replace Illinois’ current flat-rate income tax with a graduated system in which taxpayers with more income would pay higher rates. We’ve already fact-checked several claims from Illinois politicians — including Democratic Gov. J.B. Pritzker, who is spearheading the push — about how states with graduated tax systems are functioning.", "Last week, we heard a new one. It was a striking criticism of California, a graduated-tax state, from a suburban Republican lawmaker opposed to Pritzker’s plan.", "During a conversation about the graduated income tax on a WCPT-AM talk show, a caller mentioned California in a positive light. In response, GOP state Rep. Mark Batinick of Plainfield, cautioned against using the state as a model for policy in Illinois.", "\"The people being hurt in California — I think it has 30% or a third of the country’s people living at or below the poverty level,\" Batinick said.", "While California’s poverty rate ranks among the nation’s highest, federal data show the state is far from being home to a third of the nation’s poor.", "The federal government measures poverty several different ways. For comparing poverty figures nationally, the U.S. Census Bureau recommends using data from the Current Population Survey, its official source for national poverty estimates.", "The survey contradicts Batinick’s claim. California’s share of those in the U.S. living below the poverty line is just over 12%, according to the latest data. That mirrors its share of the nation’s population overall.", "The Census also releases a supplemental poverty measure, which accounts for cost-of-living — including taxes, housing, medical costs and non-cash benefits people can put toward their basic needs. Its most recent release gives California a larger share of those living in poverty nationwide, but still falls well below what Batinick said. Here, the math works out to just below 17%.", "Researchers say the supplemental measure does a better job at capturing poverty, but it’s still not perfect — including for California, where housing costs are high.", "Zach Parolin, a research scientist at the Center on Poverty & Social Policy at Columbia University, suggested looking at \"food insecurity\" — a separate federal ranking measured by the U.S. Department of Agriculture — to add to the picture of economic hardship in California. When comparing by state how accessible food is for members of households to live active and healthy lives, California performs better than the national average.", "California’s graduated income tax starts with a rate of 1% for those making the least and then increases by marginal rates before topping out at 13.3% for earnings over $1 million, according to the Tax Foundation.", "Pritzker's plan — approved by the Democratic-controlled General Assembly earlier this year — would tax those making less than $250,000 at the state’s current rate of 4.95%. Rates would go up on earnings above that amount. The highest rate calls for a 7.99% tax on the entire income of single filers who make more than $750,000 and joint filers who earn more than $1 million.", "The law won’t go into effect unless voters in November 2020 approve a constitutional amendment to permit graduated rates.", "When we asked Batinick about the connection he was trying to draw, he told us he was underscoring his general point that California-style policies are not a panacea to the challenges facing Illinois.", "As for the evidence behind his specific claim about poverty? Batinick acknowledged he was mistaken and said he should have referred to welfare recipients and not people below the poverty line.", "Referencing a 2018 federal report that noted Californians make up 38% of families receiving benefits under the Temporary Assistance for Needy Families (TANF) program, Batinick said he does not look at California as \"a state that I’m supposed to model.\"", "But that’s not what Batinick said on-air, where he referred specifically to the poverty line. And some experts we contacted expressed caution about drawing conclusions on poverty in California based on a single program, in part because the money that goes into TANF makes up a relatively small share of government spending in the universe of programs meant to assist people with low incomes.", "Batinick said California is home to \"30% or a third of the country’s people living at or below the poverty level.\"", "Federal poverty measures show that figure is significantly overblown — a point Batinick conceded.", "Instead, he said he meant to reference the state’s share of welfare recipients and cited a federal report that noted more than a third of TANF recipients reside in California.", "However, that particular federal program is far from the largest or only form of assistance the government provides to low-income individuals to help them with their basic needs. What’s more, it refers to something different than what Batinick originally said.", "We rate his claim False.", "FALSE — The statement is not accurate.", "Click here for more on the six PolitiFact ratings and how we select facts to check.", "Radio show, WCPT-820, Oct. 8, 2019", "\"California’s poverty rate among highest in nation once again, new census figures show,\" The Sacramento Bee, Sept. 10, 2019", "Income and poverty estimate guidance, U.S. Census Bureau, accessed Oct. 15, 2019", "Current Population Survey: Poverty Status by State, 2018", "What Is the Supplemental Poverty Measure? U.S. Census Bureau, Sept. 6, 2018", "Supplemental Poverty Measure: 2018, U.S. Census Bureau, October 2019", "Email, Zach Parolin, postdoctoral research scientist at the Center on Poverty & Social Policy at Columbia University, Oct. 16, 2019", "Food Security Status of U.S. Households in 2018, U.S. Department of Agriculture", "State Individual Income Tax Rates, Tax Foundation, March 20, 2019", "Senate Bill 687, 101st Illinois General Assembly", "Phone interview, Illinois Rep. Mark Batinick, Oct. 16, 2019", "Temporary Assistance to Needy Families: 12th Report to Congress, U.S. Department of Health and Human Services, Jan. 25, 2018", "Phone interview and email, David Brady, professor of public policy and director of the Blum Initiative on Global and Regional Poverty at the University of California at Riverside, Oct. 16, 2019", "Federal Spending on Benefits and Services for People with Low Income, Congressional Research Service, Feb. 6, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]