["The photo, showing an eight-wheeled armoured vehicle, was published in this Facebook post on February 22, 2020. It has been shared more than 200 times on the social network.", "Posted by Dr. Patrick Obi Nwafor, a known critic of President Muhammadu Buhari and his administration, the caption reads: “WHO IMPORTED THIS AND HOW COME IT PASSED THROUGH YOUR COUNTRY BORDERS TO BOKO HARAM ENCLAVE? [sic]”.", "Boko Haram, which loosely translates as “Western education is banned”, has attacked communities in northeastern Nigeria in a bid to create a hardline Islamic state. Nigeria's security forces together with troops from neighbouring countries have combined to fight the threat which, in 10 years of conflict, has led to the deaths of more than 36,000 people, as reported by AFP.", "The claim also cites a purported quote by Nigeria’s former minister of education, Dauda Birma, as saying the Islamic group had procured six of the armoured vehicles and had them delivered to Sambisa Forest in the north “to fight us”.", "The image appeared in other Facebook posts here, here and here, alongside a similar claim.", "The claim, however, is false and what the image shows is the first of two Boxer Infantry Fighting Vehicles (IVF) acquired by Lithuania and designated as Vilkas (“Wolf”).", "AFP ran a reverse image search on Google and found the original on a New York-based online platform that sells stock pictures and other multimedia content.", "According to the photograph’s metadata, the photo was taken on November 23, 2018 by Karolis Kavolelis. It was one of two vehicles later handed over to the Lithuanian Armed Forces by German-Dutch manufacturing consortium ARTEC. AFP reported on the purchase of 88 armoured vehicles for 386 million euros ($435 million).", "AFP further found that the insignia on the armoured vehicle matches the Flag of Land Force of the Lithuanian Armed Forces, clearly showing it belongs to the European country’s military.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]