["About this rating", "On 14 April 2016, a Facebook page called \"The Modular Body\" published a video purportedly showing a fleshy creature (named Oscar) whose parts could be arranged in different formations:", "The page led to a web site, also called \"The Modular Body,\" where more clips could be viewed.  While the video (which was viewed more than 6 million times within two days of its initial posting) left many viewers wondering whether what they had just witnessed was real, \"The Modular Body\" page was up front about what the video actually showed: it is a sci-fi web series that deals in speculative fiction, not documentary films:", "THE MODULAR BODY, an online SciFi story about a near future where the body is not a closed circuit, but a modular lifeform -- by Floris Kaayk", "In an interview with The Creator's Project, Kaayk, a Dutch filmmaker, explained that researcher Cornelis Vlasman and his creation, \"Oscar,\" are fictional characters:", "“Usually the headlines of those kind of articles present it as if it's already possible to create operational organs with currently available technology,” Kaayk says. “If you start to read further, you'll discover that this field of research is still in a very early stage. It's not possible yet to print functioning, vascularized organs—maybe in 30-40 years, but right now it's science fiction.", "“I thought: Why would we print an organ exactly in the same shape as the one we already have? Why wouldn't we use this opportunity to improve it?” Kaayk recalls. “Or even more extreme: if we can print organs and body parts, why not completely redefine and redesign the human body? That's when I started approaching the current human body as a closed system. Difficult to repair or adapt, maybe even obsolete. An open, modular system could become immortal, and adaptable.”", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]