["There’s no evidence that wearing standard masks, such as surgical masks or ones made of fabric, is harmful to the general public.", "Some people with preexisting respiratory conditions may be at risk with prolonged use of tight-fitting masks, like N95 respirators.", "Those masks aren’t recommended for the general public.", "To mask or not to mask?", "That’s a question many people are asking themselves — and arguing about — these days.", "Federal health officials initially discouraged masks for the general public, only to revise their guidance later. To make matters more complicated, social media posts are claiming that wearing a mask can be more dangerous than going without one.", "One post, in part, reads: \"It is the perfect breeding ground for bacteria that can end up in your mouth & down into your lungs. I have learned that there are many harmful effects of rebreathing Carbon Dioxide (CO2).\"", "Another says: \"Mask wearing reduces oxygen up to 60%. Increases risks of CO2 poisoning. Causes increased face touching. Viruses and bacteria saturate the outside. Touching mask and surfaces spread germs. Contaminants sit within mask fibers, get reinhaled. Fresh air is vital for immune health!\"", "The posts were flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "There’s no evidence that wearing masks is harmful for the general public, except for people with certain medical conditions.", "Carbon dioxide is a natural byproduct of the body and part of the air, and people breathe it in and out all the time. Too much CO2 can certainly be life-threatening, but only at significantly high concentrations, experts say. Hypercapnia, a condition that arises when there is too much carbon dioxide in the blood, can cause headaches, drowsiness, vertigo, double vision, disorientation, tinnitus, seizures, or suffocation due to displacement of air.", "CO2 makes up only about 0.04% of the air we breathe, and is considered life-threatening when its concentration is greater than about 10%.", "The posts don’t specify the kinds of masks or how long someone would need to wear one to generate unhealthy CO2 levels, but medical experts say the risk is quite low for the general public who wear a typical cloth or surgical mask.", "Linsey Marr, a professor in airborne disease transmission at Virginia Tech, said it's possible that loose fibers in the masks can be inhaled, as one post claims, but \"contaminants in these fibers would have off-gassed into the air already, unless the mask is fresh off the assembly line.\"", "Prolonged use of certain face masks, particularly tight-fitting medical-grade ones like the N95 respirator, can cause problems for people with respiratory illnesses.", "\"I don’t think that the general public wearing homemade face masks really poses a CO2 poisoning issue,\" Dr. Amesh Adalja, an infectious-disease expert and senior scholar at the Johns Hopkins University Center for Health Security, told PolitiFact. \"There is data, however, that prolonged use of an N95 mask can increase blood CO2 levels, and therefore we do not recommend people wear N95 masks for a prolonged period of time. We also do not recommend the general public wear N95 masks.\"", "The Centers for Disease Control and Prevention recommends that the general public wear cloth face masks in areas where social distancing isn’t possible, and says certain medical-grade masks, like the N95, should be reserved for health care workers who are in direct contact with infected patients.", "The CDC also says that facial coverings should not be placed on \"young children under age 2, anyone who has trouble breathing, or is unconscious, incapacitated or otherwise unable to remove the mask without assistance.\"", "The agency told Reuters that while CO2 that slowly builds up in masks over time, the level is mostly tolerable for people exposed to it.", "\"You  might get a headache but you most likely (would) not suffer the symptoms observed at much higher levels of CO2,\" Reuters quotes the CDC as saying. \"The mask can become uncomfortable for a variety of reasons including a sensitivity to CO2, and the person will be motivated to remove the mask. It is unlikely that wearing a mask will cause hypercapnia.\"​", "Dr. Thomas Tsai, a surgeon and health policy researcher at Harvard’s School of Public Health also said he hasn’t seen any credible data to support the posts.", "\"I wear masks every day for hours and hours at a time and I've never once suffocated and passed out from CO2,\" Tsai said. \"On the margins we could probably find extreme cases where someone, somewhere with some condition has had an issue with a mask but that's not the average. There is absolutely no data to suggest that wearing a standard surgical or cloth mask under normal situations is deleterious to your health.\"", "Facebook posts say that wearing a mask causes health problems, particularly from breathing in too much exhaled carbon dioxide.", "There is no credible data to back that up. Experts say prolonged use of N95 respirator masks can increase blood CO2 levels for people with breathing problems, but those masks are not recommended for the general public, and using ordinary cloth or surgical masks poses little or no risk from CO2.", "We rate this False.", "Facebook post, May 8, 2020", "Centers for Disease Control and Prevention, Recommendation Regarding the Use of Cloth Face Coverings, Especially in Areas of Significant Community-Based Transmission, April 3, 2020", "Centers for Disease Control and Prevention, Use of Cloth Face Coverings to Help Slow the Spread of COVID-19, April 13, 2020", "National Institutes of Health, Carbon dioxide poisoning, 2005", "Reuters, Partly false claim: Continually wearing a mask causes hypercapnia, May 5, 2020", "Associated Press, False health claims circulate about wearing masks during pandemic, May 15, 2020", "Snopes, Is It Dangerous to Wear a COVID-19 Protective Mask for Too Long?, May 8, 2020", "Phone interview, Dr. Thomas Tsai surgeon and health policy researcher at Harvard’s school of public health, May 15, 2020", "Email interview, Linsey Marr professor in airborne disease transmission at Virginia Tech, May 14, 2020", "Email interview, Dr. Amesh Adalja senior scholar at the Johns Hopkins University Center for Health Security, May 18, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]