["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Wisconsin Gov. Scott Walker’s proposal to impose cuts on public workers without bargaining has become the latest flash point in a longstanding debate over the compensation for public employees.\n\nIn lobbying for Walker’s proposal, the conservative advocacy group Wisconsin Club for Growth has launched a TV and radio campaign that argues state employees have been exempt from cutbacks even in the recession.\n\nThe group’s TV ad uses a backdrop of newspaper headlines about job-saving union concessions at private firms -- Harley-Davidson, Mercury Marine and Sub-Zero Appliance. The ad notes Wisconsinites \"all across\" the state have accepted wage freezes, pay cuts and are paying more for health care.\n\nThen, over an ominous piano soundtrack, the narrator adds:\n\n\"But state workers haven’t had to sacrifice. They pay next to nothing for their pensions, and a fraction of their health care. It’s not fair. Call your state legislator and tell them to vote for Gov. Walker’s budget repair bill. It’s time state employees paid their fair share, just like the rest of us.\"\n\nThat’s a broad -- and powerful -- claim, that there has been no sacrifice from state workers.\n\nBut is it true?\n\nOfficials with the Club for Growth -- Deb Jordahl and R.J. Johnson -- told us the ad meant to highlight just two issues regarding state employee compensation: pension and health care payments.\n\nSo we’ll start there.", "We covered some of this ground in a Feb. 8, 2011 item that evaluated a statement by Walker that \"most state employees could pay twice as much toward their health care premiums and it would still be half the national average.\" We rated it True.", "The item found that unionized state workers pay about 4 percent to 5 percent of their health insurance premiums. In contrast, a Kaiser Family Foundation study put the employee share paid by state and local government workers nationwide at 25 percent for family coverage.", "Meanwhile, on pensions, most public workers in Wisconsin contribute nothing or very little to their pensions.\n\nWalker's plan would require most public workers to pay half their pension costs -- typically 5.8 percent of pay for state workers -- and at least 12 percent of their health care costs.\n\nThat does not apply to police, firefighters and state troopers. Under the budget repair bill, public-safety unions would be exempt from the changes. They would continue to bargain for benefits under current laws while other unions would lose the right to bargain on benefits and working conditions.\n\nSo the ad is on target in pointing out that the situation for state workers -- even after the Great Recession -- compares favorably to the private sector.\n\nBut the pension and health care points are framed around the assertion state workers have not sacrificed at all.\n\nThat’s a bigger question, and calls for a look backwards -- not just forward.\n\nOn health care and pensions, state employees have been asked to give more -- though in modest amounts compared to the private sector.", "The portion of health premiums paid by employees more than doubled under then-Gov. Jim Doyle, from 2.5 percent to 5.6 percent in 2011.", "We looked at that when we evaluated a statement from Doyle, who said he \"had to impose tougher cost controls on state employees\" than any previous Wisconsin governor. We rated that statement Mostly True.", "On pensions, the vast majority of state employees paid nothing toward their pensions until January 2011, when they were required to contribute 0.2 percent -- two-tenths of 1 percent -- of their pay.\n\nBut the most notable change for state workers has come on pay.\n\nThe Club for Growth ad dramatically highlights \"frozen wages\" and \"pay cuts\" accepted by unions at the private companies -- and then says \"state workers haven’t had to sacrifice.\"", "In fact, state workers have taken a hit on wages -- in the form of furlough days.", "To deal with his own state budget problems, Doyle required employees to take eight unpaid furlough days in both the 2009-2010 and 2010-2011 budget years, saving an estimated $208 million over the two-year period. That's a 3.1 percent reduction in wages annually.", "The average pay per full-time equivalent state worker was $54,900, according to the latest census report on government payrolls.", "Doyle said he used the furlough days to avoid widespread layoffs -- the same argument Walker is using for his plan.\n\nIndeed, fewer than 150 state workers (not including the University of Wisconsin System) were laid off from 2007 through 2010, state figures show. That’s 0.4percent. That compares to the state losing more than 155,000 jobs overall since the recession began -- about 5.6 percent.\n\nDoyle also rescinded 2 percent raises for non-union employees in the 2007-2009 state budget. Under Doyle, raises averaged 1.21 percent per year. We found that was less than under the previous four elected governors dating back to 1971.\n\nDoyle also suspended merit awards in November 2008.\n\nIn the previous two years, the state had given out 2,600 of those awards, totaling $11.4 million, according to the state Department of Administration.\n\nSo state workers have in fact given up some pay, which is the definition of sacrifice.\n\nThe Club for Growth officials note that the furloughs did not affect base pay going forward, and that Walker has said he will not continue furloughs in exchange for the pension and health care benefits cuts.\n\n\"Plus they get to keep their jobs,\" Jordahl said of Walker’s plan.\n\nBut, again, the ad argues for changes in the future. Its assertion is there was no sacrifice in the past.\n\nWhat’s the bottom line?\n\nThe Club for Growth, lobbying for Walker’s plan to trim state employee compensation, claims state workers \"have not had to sacrifice\" while the private sector has reeled from jobs losses, pay cuts and increased responsibility for pension and health care benefits.\n\nTheir claim as it relates to health and pension benefits -- the focus of Walker’s proposal -- is pretty much on target. But pay is also part of the equation -- a big part -- and on that score state workers took 3 percent pay cuts in the form of furloughs, among other wage-related cutbacks.\n\nOn the Truth-O-Meter, the definition of Barely True is a statement that \"contains some element of truth but ignores critical facts that would give a different impression.\"\n\nThat fits. And that is our rating of the ad’s \"no sacrifice\" claim.", "Wisconsin Club for Growth,TV ad, Feb. 11, 2011\n\nInterview with Deb Jordahl and R. J. Johnson, Wisconsin Club for Growth, Feb. 16, 2011\n\nEmail interviews with Carla Vigue, spokesperson, state Department of Administration, Feb. 16-17, 2011\n\nInterview with Stacey Standish, press officer, U.S. Bureau of Labor Statistics, Feb. 16, 2011\n\nWisconsin Taxpayers Alliance, Wisconsin’ Public Workforce, February 2010\n\nMilwaukee Journal Sentinel, \"Walker calls for cuts or big layoffs,\" Feb. 11, 2011\n\nPolitiFact Wisconsin, Doyle cost controls item, Jan. 11, 2011\n\nPolitiFact Wisconsin, Walker claim on health premiums, Feb. 8, 2011", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]