["About this rating", "In accordance with annual custom, on Dec. 20, 2019, House Speaker Nancy Pelosi sent a letter to President Donald Trump inviting the chief executive to deliver an address to Congress on the state of the union on Feb. 4, 2020:", "As ABC News noted in a tweet about Pelosi's invitation, it came \"just days after the House of Representatives voted to impeach the president\":", "Shortly afterwards, a putative letter from Trump to Pelosi accepting the invitation circulated via social media, with highlighting added to document that the first letter of each line formed a vertical acrostic spelling out a rather crude phrase aimed at the House speaker:", "Although some precedent for government officials' engaging in such hijinks exists, this letter was just a humorous fabrication (possibly one which originated on the notorious 4chan website) and not a genuine missive sent by the president.   It does not appear on the portion of the White House website where such presidential correspondence with Congress is typically posted, nor has any news outlet reported on such a letter's being sent by the president (much less with an obscene hidden message encapsulated therein).", "What news accounts did note of the subject is that the White House merely \"issued a short statement saying the president 'has accepted the Speaker's invitation.'\"", "Thomas, Elizabeth.   \"Amid Impeachment, Pelosi Invites Trump to Give State of the Union on Feb. 4, He Accepts.\" \r\n    ABC News.   20 December 2019.", "Zetter, Kim.   \"Schwarzenegger Flips Off Lawmakers in Hidden Message.\"\r\n    Wired.   27 October 2009.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]