["About this rating", "The \"Flogsta scream\" tradition may be observed at a handful of Swedish universities, generally during exams.", "All of Sweden's residents scream out of their windows every night.", "In November 2014, social media users became entranced by the \"Flogsta scream,\" becoming widely and rapidly convinced of a strange, little-known phenomenon in Sweden. The notion that such an unusual thing occurred with relative frequency among Swedes caused the Flogsta scream concept to spread across social media sites, with many users interpreting the practice as a Swedish secret which few outside the nation knew about or understood.", "Mentions of the Flogsta scream appreared on the Internet several years ago, so the practice wasn't entirely new to the larger Internet in 2014. A Reddit thread from 2013 explained that the custom was specific to Sweden, but the phenomenon didn't attract much attention beyond that mention at the time.", "On 16 November 2014, a different Reddit user created a second thread about the Flogsta scream. Perhaps due in part to the increasing practice of pop culture sites using Reddit's front page to source content (and the general combination of plausibility and wackiness the practice entails), a number of outlets immediately covered the Flogsta scream.", "However, a few key details were lost in the retelling: most notably that the Flogsta scream is limited to a handful of university campuses and isn't widespread across Sweden. That may be in part due to the 2014 Reddit thread's title (\"What happens when you scream out your window in Sweden\"), which didn't specify the practice was associated with college campuses.", "On 16 November 2014, MTV posted about the Flogsta scream phenomenon in a widely-shared article titled \"If You Scream Out Your Window at Night in Sweden, Something Unexpected Happens.\" Echoing the source post of the Reddit user (who, it should be noted, appeared to be from Alaska and not Sweden), the write-up mentioned the university connection only after it repeatedly described the Flogsta scream as a cool thing Swedish people do:", "Here is a weird thing that is totally real: when someone screams out their window in Sweden, Sweden screams right back.", "Responding to a scream with a scream isn't exactly what one would consider proper protocol ... but when you live in the IKEA nation it's just how things are done. They're not inconsiderate prickigs (those are microwave covers), they're just following tradition, and it is called The Flogsta Scream.", "Yeah, screaming into the dark of night isn't a source of unsettlement, it's a point of pride ... The Flogsta Scream is one of those totally legitimate Swedish things that makes no sense to outsiders such as us.", "On 18 November 2014, an actual Swedish person published a response explaining no, all of Sweden doesn't scream out the window nightly. The practice is limited to two university towns, and most Swedish people would be annoyed by a sudden cacophony of screams close to midnight:", "I'm sorry to break it to you, but the Flogsta screams are neither occult nor something new. It's not typical for Sweden as such either. The \"phenomena\" is actually only common in student cities such as Lund and Uppsala (where Flogsta is located).", "And it's not like \"no one really knows why it happens\" as the Huffington Post claimed in their post about the scream last year — in which they added that it might be a ritual to remember a student who committed suicide in the 70s. Although the suicide part might be true for some, death is not the origin of the now-infamous-on-the-internet Flogsta scream.", "It's worth noting inconsiderate behavior knows no borders. If screaming outside your window is likely to disturb people in your country, the same goes for residents in Sweden. Late night screaming is disruptive to people the world over.", "The \"Flogsta scream\" tradition purportedly dates back to the 1970s on two Swedish campuses. (Reddit users from Michigan State University and Central Michigan University claimed a similar phenomenon on those campuses during exams.) No information corroborates the claim the practice began after a suicide. However, screaming out of a window late at night in Sweden is certainly not the norm, and doing so is very likely to annoy or alarm people outside the small areas in which the practice may commonly occur.", "A related custom of \"primal scream\" sessions at other American universities has been college lore for over three decades and documented on the internet since at least 1995. In 2008, footage of the practice (during exams) at Vassar College in Poughkeepsie, New York, was posted to YouTube:", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]