["The image was shared here on Facebook on December 12, 2020. It has been shared more than 195 times.", "The Thai-language text overlaying the image reads in English as:", "“The foreigner is confused!! Where did he go to wars!! so many pins.”", "The photo shows Gen Apirat Kongsompong (R), the former Commander-in-chief of Thailand’s Royal Thai Army, shaking hands with Gen James C. McConville, the 40th Chief of Staff of the U.S. Army (L).", "The laughing emoji was added to the image, with another hand emoji pointing towards Gen Apirat.", "Gen Apirat served as the Commander-in-chief of Thailand’s Royal Thai Army between 2018-2020. After his retirement in September 2020, he was appointed as a Palace Deputy Secretary, according to this statement published by the Royal Thai Gazette on September 30, 2020.", "According to Thai PBS World, he had expressed strong political views against political figures whom he accused of attempting to destabilize the country prior to his retirement.", "During an oath-swearing ceremony,  he vowed to only support a government loyal to the monarchy, as Khaosod English reported on March 7, 2019.", "The image was also shared here on Facebook and here on Twitter.", "Many social media users comments indicated that they believe the purported image is genuine, posting comment such as \"Like a crazy man LOL, I feel embarrassed for the foreigner. LOL\" and “You power crazy.”", "Below are the screenshots of the comments:", "The claim is false; the image has been digitally manipulated.", "A Google reverse image search found the same image published here on Workpoint Today, a Thai local media website from July 4, 2020.", "The Thai-language headline translates to English as: “The US Army chiefs will visit Thailand for a short-term period between July 9-10 without quarantine, but they only be travelled within restricted areas.”", "Below is a screenshot comparison of the image in misleading Facebook post (L) and on Workpoint Today article with differences circled by AFP (R):", "The image was credited to the Twitter handle @ArmyChiefStaff, a verified Twitter account of Gen James C. McConville.", "A keyword search found this tweet from February 26, 2020.", "The tweet reads: “It was an honor hosting the Commander-in-Chief of the Royal Thai Army, Gen. Apirat Kongsompong, in the NCR yesterday. Thailand is a critical ally in the #IndoPacifc. Exercises like #CobraGold further strengthen our combined capability that promotes regional security & stability.”", "It was an honor hosting the Commander-in-Chief of the Royal Thai Army, Gen. Apirat Kongsompong, in the NCR yesterday. Thailand is a critical ally in the #IndoPacifc. Exercises like #CobraGold further strengthen our combined capability that promotes regional security & stability. pic.twitter.com/Bn2qQwbYzw", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]