["By Sean Carlin", "Posted on July 31, 2020", "As Florida’s COVID-19 case count rose to the second-highest in the U.S. in July, a former challenger for House Speaker Nancy Pelosi’s congressional seat falsely claimed on social media that the Centers for Disease Control and Prevention had made a “mistake” and subsequently reduced Florida’s count by 79,000 cases. There was no such adjustment.", "Florida has become a focal point in the nation’s struggles to contain the spread of COVID-19. More than 460,000 people have tested positive for infection with the novel coronavirus, SARS-CoV-2, in that state, including over 6,500 who have died, according to the Florida Department of Health. The state has surpassed New York and is now second only to California in total number of COVID-19 cases.", "While the cases started rising dramatically in Florida and other states by mid-summer, the Trump administration ordered hospitals to bypass the Centers for Disease Control and Prevention and send all COVID-19 patient information to the Department of Health and Human Services beginning on July 15. The procedural change concerned health experts who fear the data will be politicized or withheld from the public, the New York Times reported.", "The following week, DeAnna Lorraine, who unsuccessfully tried to unseat House Speaker Nancy Pelosi in California’s 12th Congressional District, referred to the change in hospital reporting procedures to falsely claim on social media that officials had been drastically over-counting Florida’s case numbers.", "Lorraine, who describes herself as a “recent Republican” and conservative “firebrand,” tweeted on July 21, “So now that Trump has said hospitals need to report numbers to WH instead of the CDC, the CDC just came out & said they made another ‘mistake’ in FL; And they’ve also been counting Pneumonia & Flu as Covid– dropping their # from approx 90,000 to 11,000. So many ‘mistakes,’ huh?”", "The post has had nearly 30,000 retweets and was shared across social media platforms.", "But Lorraine’s claims have been dismissed by the CDC, and she has not provided any evidence to support them.", "On July 21, Lorraine tweeted about specific cases she claimed were misclassified, which included a motorcyclist who was killed in Florida and listed as a COVID-19 death. The person was later taken off of the state’s list of coronavirus deaths, according to Fox 35.", "Lorraine said in an email to FactCheck.org that she has evidence to support her claims and would send it to us. But she has not provided that information and didn’t respond to a follow-up inquiry.", "Robert Anderson, the CDC’s chief of mortality statistics, told FactCheck.org in an email that the claims in Lorraine’s tweets are a rehash of other conspiracies that started in June.", "“I’m not even sure where those numbers come from,” Anderson said. “They seem to have been pulled out of thin air.”", "Anderson added: “We certainly do not count pneumonia and flu deaths as COVID19 deaths, unless COVID19 is also mentioned. It’s not unusual to see the cause of death stated as pneumonia due to COVID19.”", "CDC spokesman Scott Pauley also told FactCheck.org in an email that the “CDC did not reduce the case counts in Florida.”", "The reporting change Lorraine highlighted in her post, as we noted, referenced a recent change in how hospitals report COVID-19 information. Hospitals are asked to report bed capacity, utilization, personal protective equipment and in-house laboratory testing data to either their state health departments or directly to DHHS, rather than the CDC.", "Anderson said that change does not affect mortality data, which still goes directly to the CDC.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "Anderson, Robert, chief of mortality statistics at the Centers for Disease Control and Prevention. Email to FactCheck.org. 30 July 2020.", "“California Primary Election Results: 12th House District.” New York Times. 29 June 2020.", "Lama, Danielle. “FOX 35 INVESTIGATES: Questions raised after fatal motorcycle crash listed as COVID-19 death.” Fox 35. 18 July 2020.", "Lewis, Sophie. “California and Florida hit new daily record high coronavirus deaths.” CBS News. 30 Jul 2020.", "Lorraine, DeAnna. Email to FactCheck.org. 27 Jul 2020.", "Florida Department of Health. 28 July 2020.", "“Florida Coronavirus Map and Case Count.” New York Times. 30 Jul 2020.", "“HHS Makes Significant Changes to COVID-19 Daily Data Reporting Process.” American Hospital Association. 13 Jul 2020.", "Pauley, Scott, spokesperson at Centers for Disease Control and Prevention. Email to FactCheck.org. 30 Jul 2020.", "Prasad, Ritu. “Coronavirus: How did Florida get so badly hit by Covid-19?” BBC. 14 Jul 2020.", "Savage, Claire. “CDC does not flu and pneumonia deaths to COVID-19 toll.” AFP. 24 Jun 2020.", "Stolberg, Sheryl Gay. “Trump Administration Strips C.D.C. of Control of Coronavirus Data.” 14 Jul 2020.", "U.S. Department of Health and Human Services. “Prepared Remarks from HHS Media Call with CDC Director Redfield and CIO Arrieta on COVID-19 Data Collection.” HHS.gov. 15 Jul 2020.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]