["The photo was published on Facebook here on September 22, 2020. The post has been shared more than 400 times.", "The post’s Urdu-language caption translates to English as : \"This is the meeting in which Nawaz Sharif met with the Israeli ambassador and made a deal to take his business to Israel in exchange for Pakistan's nuclear secrets. Be reminded that it is the same deal which has been mentioned in the 10th volume of the JIT (Joint Investigation Team) report as evidence.”", "The same image was also shared here, here and here on Facebook alongside a similar claim.", "The claim is false.", "A reverse image search on Google found the image was doctored from this photo by Getty Images. The original shows Sharif meeting the visiting former German Foreign Minister Guido Westerwelle in Islamabad in June 2013.", "The photo’s caption reads: “Pakistani Prime Minister Nawaz Sharif (R) listens to German Foreign Minister Guido Westerwelle during a meeting at the Prime Minister House in Islamabad on June 8, 2013. Westerwelle arrived in Islamabad to met with the Pakistani leaders. AFP PHOTO/ AAMIR QURESHI (Photo credit should read AAMIR QURESHI/AFP via Getty Images).”", "Below is a screenshot comparison of the image in the misleading Facebook post (L) and the original Getty Images photo (R) with the doctored flag circled in red:", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]