["“महात्मा की ये हालात है, BJP ये आपकी विरासत है। इतिहास आपको गाली देगा (This is the condition of Mahatma, ‘BJP’ this is your legacy. History will abuse you -translated)”, tweeted an individual user with a video of two men slapping a statue of Mahatma Gandhi with chappals. The tweet accuses the ruling Bharatiya Janata Party, calling the act its legacy.", "चट्टानों से सिर पीटने वाले बेवकूफ होतें है ।", "महात्मा की ये हालात है, BJP ये आपकी विरासत है। इतिहास आपको गाली देगा 🙏@narendramodi @PMOIndia @rajnathsingh @nitin_gadkari @SushmaSwaraj @BDUTT @abhisar_sharma @akashbanerjee @sakshijoshii @bainjal @dhruv_rathee @ArvindKejriwal pic.twitter.com/9LzVftUiQd", "— KamDev Baba (@TheKamDevBaba) May 27, 2019", "This video was also tweeted by an account named Khabar Bar with a message directed at Prime Minister Narendra Modi to take action against the culprits.", "Dear @PMOIndia,", "The below video in which two citizens are insulting #MahatmaGandhi is extremely disturbing. We hope the culprits are traced and due action be taken.", "The date and location of the video is unknown.@narendramodi @HMOIndia #Democracy pic.twitter.com/cConNDiSxo", "— Khabar Bar (@Khabar_Bar) May 27, 2019", "With a simple keyword search on Google, Alt News was able to establish that the incident took place in Canada in August 2015. “Two men of South Asian descent have been filmed slapping a statue of Mahatma Gandhi with their hands and later their shoes. A third person has recorded this whole episode.”, reads the caption posted with a video uploaded on Bayside Journal on August 17, 2015.", "Two men of Indian origin were seen slapping Gandhi’s statue in Winnipeg a city in Manitoba, Canada. According to India.com, the video surfaced on Facebook on August 15, 2015.", "In conclusion, a three-year-old video of two Indian origin men slapping a statue of Gandhi in Canada was shared as citizens in India doing the shameful act in the backdrop of the recent electoral victory of the BJP.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]