["About this rating", "A warning first published in 1944 by then-Vice President Henry A. Wallace resurfaced online in 2018 in meme form. The graphic contains an excerpt from an opinion piece from Wallace published in the New York Times on 9 April 1944:", "A fascist is one whose lust for money or power is combined with such an intensity of intolerance toward those of other races, parties, classes, religions, cultures, regions or nations as to make him ruthless in his use of deceit or violence to attain his ends. The supreme god of a fascist, to which his ends are directed, may be money or power; may be a race or a class; may be a military, clique or an economic group; or may be a culture, religion, or a political party.", "In an especially prescient note, the Iowa-born Wallace -- who was selected as President Franklin D. Roosevelt's running mate in 1940 -- also observed that \"American fascism will not be really dangerous until there is a purposeful coalition among the cartelists, the deliberate poisoners of public information, and those who stand for the K.K.K. type of demagoguery.\"", "In 2017, The University of Iowa posted a still photograph of a typed draft of Wallace's piece, titled \"The Danger of American Fascism,\" including editing marks left by hand:", "That same year, the Times published an op-ed by Wallace's grandson, Henry Scott Wallace, looking back on his grandfather's work.", "\"To be clear, I don't think the precise term 'fascism' -- as in Mussolini and Hitler -- is fairly applied to Mr. Trump,\" the younger Wallace wrote. \"Mussolini was a proponent of 'corporatism,' defined by some as 'a merger of state and corporate power.'\"", "Seen in that light, Wallace said, his grandfather's analysis still held true, considering the use of misinformation such as Trump's claim that he had the \"largest\" inaugural crowd ever, or that he \"won the popular vote\" in the 2016 presidential election. Wallace then quoted from his grandfather's own writing:", "And what is the ultimate goal? \"Their final objective toward which all their deceit is directed is to capture political power so that, using the power of the state and the power of the market simultaneously, they may keep the common man in eternal subjection.\"", "That sounds like Mussolini and his embrace of \"corporatism\" -- the marriage of government and corporate power. And it also sounds like President Trump.", "Henry A. Wallace served as vice president until January 1945, and two months later Roosevelt appointed him Secretary of Commerce, a post he filled until September 1946. In 1948, however, Wallace mounted his own presidential campaign representing the Progressive Party and campaigning on the abolition of the poll tax as well as an opposition to isolation of the Soviet Union,  garnering just over a million votes. Later in life he renounced his views and supported the Republican Party before passing away in November 1965.", "In November 2018, grandson Henry Scott Wallace lost a congressional election in Pennsylvania. Wallace, running as a Democrat, was defeated by incumbent Republican Rep. Brian Fitzpatrick in his bid to represent the state's First Congressional District.", "Wallace, Henry Scott.   \"American Fascism, In 1944 and Today.\"\r\n    The New York Times.  12 May 2017.", "Ross, Alex.   \"Uncommon Man.\"\r\n    The New Yorker.   14 October 2013.", "Otterbein, Holly et al.    \"Republican Brian Fitzpatrick Wins Pa.'s First Congressional District, Defies Dem Tide.\"\r\n    Philadelphia Inquirer.   7 November 2018.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]