["About this rating", "The language in a 1974 report that was co-authored by Supreme Court justice Ruth Bader Ginsburg, has been analyzed and criticized for more than four decades. The piece tackled sex bias in the United States penal code. As these critics have devolved from scholars, to senators, to pundits, to conspiracy-minded web sites, to the lowly meme maker, the accusations against Ginsburg have grown more crude and distorted.", "In February 2018, for instance, we came across a meme featuring an image of the Supreme Court Justice and a quote ostensibly uttered by her about pedophilia being good for children:", "This is not a genuine quote from Ruth Bader Ginsburg.", "This claim is based upon a gross misinterpretation of another misinterpretation, which was itself based upon a simple misreading of a 1974 report entitled \"The Legal Status of Women Under Federal Law\" that was co-authored by Ginsburg, who at the time was a professor of law at the Columbia Law School. The other co-author was Brenda Feigen-Fasteau, a former director of the American Civil Liberties Union's women's rights project.", "In 1974 Ginsburg and Feigen-Fasteau published a report examining how federal law frequently employed gendered language. This report was used as the basis for the \"Sex Bias in the U.S. Code,\" a report published in 1977, which included a passage explaining the purpose of the study:", "The Constitution, which provides the framework for the American legal system, was drafted using the generic term \"man.\" While the United States Supreme Court, the ultimate interpreter of the Constitution, might have determined that \"man\" also means \"woman\" in terms of rights, duties, privileges, and obligations under the Constitution, the Court instead has chosen on numerous occasions to deny to women certain rights and privileges not denied to men.", "While explaining the \"equality principle\" and arguing that pronouns should be altered in the existing penal code so that both men and women were equally accountable for crimes against both boys and girls, Ginsburg quoted a proposed 1973 Senate bill as an example of legislation which used gender neutral language:", "The 1937 Senate bill, S. 1400, in §1631, provides a definition of rape that in substance conforms to the equality principle:", "A person is guilty of an offense if he engages in a sexual act with another person, not his spouse, and (1) compels the other person to participate: (A) by force or (B) by threatening or placing the other person in fear that any person will imminently be subjected to death, serious bodily injury, or kidnapping; (2) has substantially impaired the other person's power to appraise or control the conduct by administering or employing a drug or intoxicant without the knowledge or against the will of such other person, or by other means; or (3) the other person is, in fact, less than 12 years old.", "It is the highlighted line that has been repeatedly misinterpreted and distorted over the ensuing decades.", "It appears that Ginsburg was first accused of wanting to lower the age of consent to 12 shortly before she was confirmed to the Supreme Court in 1993. This accusation reemerged in 2005 after John Roberts was nominated. Both Senator Lindsey Graham and Fox News host Sean Hannity, for instance, used this line to argue that Ginsburg was \"very left-wing\" and immoral:", "HANNITY: I guess where I am on this, if you look at Ruth Bader Ginsburg, I mean, she -- the Ginsburg rule, she doesn't have to answer specific questions, clearly pro-choice going in, thinks there may even be a constitutional right to polygamy, has a controversial view we should lower the age of consent to 12, supports legalized prostitution, very left-wing.", "GRAHAM: Well, there are all kind of hearts. There are bleeding hearts and there are hard hearts. And if I wanted to judge Justice Ginsburg on her heart, I might take a hard-hearted view of her and say she's a bleeding heart. She represents the ACLU. She wants the age of consent to be 12. She believes there's a constitutional right to prostitution. What kind of heart is that?", "However, Ginsburg never actually said that the age of consent should be lowered to 12.", "Ginsburg's report was about changing gendered language, not the age of consent, in our existing laws. In the quoted passage, she was not arguing for or against lowering the age of consent; rather, she was quoting a proposed Senate bill as an example of how appropriate gender-neutral pronouns should be used. Ginsburg wrote that she used this bill because it \"conform(ed) to the equality principle,\" not because she agreed with the presented age of consent.", "Furthermore, Ginsburg mentioned another section of the penal code a few paragraphs earlier which referenced a different age of consent: 16. In both cases, Ginsburg's focus was on the gender of the victim, rather than the age, as her report was specifically concerned with gendered-language in U.S. law:", "18 U.S.C. § §1154 and 2032 make it a crime for a person to have carnal knowledge of a female, not his wife, who has not attained the age of sixteen years.", "[...]", "The \"statutory rape\" offense defined in these sections follows the traditional pattern: the victim must be a female and the offender, a male. Protection of the girl's virtue as an asset to be traded by her family at marriage time can no longer survive as a justification for such provisions. The immaturity and vulnerability of young people of both sexes can be protected through appropriately drawn, sex-neutral proscriptions.", "The claim that Ginsburg said that \"pedophilia was good for children\" appears to be the result of a decades-long game of telephone that started with a misreading of a 1974 report.", "It started in 1993, after Ginsburg was nominated to the Supreme Court, when this report was quoted out of context as evidence that Ginsburg wanted to lower the age of consent to 12. As this errant argument was reiterated by pundits such as Sean Hannity it morphed from a single out of context quote to an alleged personal belief at the core of Ginsburg's political views. When the \"Pizzagate\" controversy exploded during the 2016 presidential election, this rumor underwent another devolution as conspiracy theorists claimed that Ginsburg once wrote that she wanted to legalize child rape.", "In February 2018, this rumor took one more step away from reality when a meme featuring a quote ostensibly uttered by Ginsburg arguing that pedophilia was good for children went viral online.", "Bader Ginsburg, Ruth.   \"The Legal Status of Women Under Federal Law.\"\r\n    Report of Columbia Law School Equal Rights Advocacy Project,   1974   (p. 71)", "Noah, Timothy.   \"Lindsey Graham's Smear.\"\r\n    Slate.   16 September 2005.", "Kalven, Josh.   \"Hannity Falsely Claimed Ginsburg Advocated Legalizing Prostitution, Lowering the Consent Age to 12.\"\r\n    Media Matters.   1 November 2005.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]