["By Robert Farley", "Posted on May 11, 2016", "When asked why he doesn’t lead by example and have more of his products from the Donald J. Trump Collection made in the U.S., Trump wrongly responded, “They don’t even make this stuff here.” They do.", "When the interviewer cited Brooks Brothers as one example of a company that makes apparel in the U.S., Trump said, “They don’t make here, not that I see.” He’s wrong about that, too.", "The issue was raised by George Stephanopoulos on ABC’s “This Week” on May 8, after Trump threatened to impose tariffs or taxes on American companies that move their manufacturing overseas. On the campaign trail, Trump has criticized companies such as Carrier, Apple, Nabisco and Ford for moving production to cheaper offshore locations. (Even if some of his claims about those companies were incorrect.)", "“But don’t you have to also lead by example?” Stephanopoulos said. “You know, so many of the products in the Donald J. Trump Collection are made overseas — Bangladesh, China …”", "“Well, that’s because you can’t even buy them here,” Trump said.", "“But if you want other companies to make their products in America, shouldn’t you make your products in America?” Stephanopoulos asked again.", "“But they don’t make a lot of these products,” Trump said. “They don’t even make them here anymore.”", "This was not the first time Trump has faced criticism for outsourcing production of many of the products sold in the Trump Collection. Sen. Marco Rubio raised it during a Republican debate on Feb. 25.", "“The second thing, about the trade war — I don’t understand, because your ties and the clothes you make is made in Mexico and in China,” Rubio said. “So you’re gonna be starting a trade war against your own ties and your own suits.”", "Trump is correct that most clothing sold in the U.S. is made overseas. According to the American Apparel & Footwear Association, 97 percent of apparel and 98 percent of shoes sold in the U.S. are made overseas.", "But he went too far in claiming that products in the Donald J. Trump Collection — ties, dress shirts, suits, glasses, wallets and other accessories — aren’t made in the U.S. anymore.", "“Many of AAFA’s members make clothes and shoes in the United States,” according to a statement released to FactCheck.org by Natalie LaBella, marketing manager for the AAFA. “The member companies encompass a wide range of products and brands – including large and small companies, public and private firms, and companies manufacturing for the commercial market and making uniforms and other apparel and footwear for the U.S. military.”", "“Demand for ‘Made in USA’ clothing and shoes is growing,” the AAFA stated. “In fact, there was a continued resurgence of the U.S. apparel manufacturing industry in 2015 despite 97 percent of the clothes sold in the United States being imported. U.S. production rose for the sixth consecutive year in 2015, rising 4.3 percent over 2014 levels. Because of this growth, U.S. production accounted for 2.7 percent of the U.S. market, its highest market share since 2008. U.S. production is up 50.8 percent since 2009.”", "Trump should be aware of the availability of some U.S. apparel production, because while most of the products in the Trump collection are made overseas, at least some of them are made in the U.S., Robert Z. Lawrence, a professor of international trade and investment at the John F. Kennedy School of Government at Harvard University, told us by phone. For example, some of the suits in the Donald Trump Collection — sold on Amazon.com — are advertised as “Made in USA.”", "According to the Bureau of Labor Statistics, there were 133,700 people employed in making apparel in the U.S. in April 2016. And in 2011, Lawrence said, 29 percent of the U.S. demand for textiles, textile products and footwear was made in the U.S., and 25 percent was made in China, with the rest imported from other countries, according to a joint analysis of the value added by each country in the production of goods and services that are consumed worldwide from the Organisation for Economic Co-operation and Development and the World Trade Organization.", "“It is certainly true that a huge share of our clothing and footwear is made outside of the United States,” Lawrence said. “But the idea that we don’t make any clothing is rubbish.”", "Typically, Lawrence said, it is more expensive to manufacture in the United States. So Trump may be right that it would not be cost-competitive to make some products in the U.S., Lawrence said, but he is wrong to say he couldn’t make those products in the U.S.", "As Stephanie Clifford for the New York Times put it in November 2013, “As textile and apparel companies begin shifting more production to the United States, taking advantage of automation and other cost savings, a hard economic truth is emerging: Production of cheaper goods, for which consumers are looking for low prices, is by and large staying overseas, where manufacturers can find less expensive manufacturing.”", "We also reached out to The Americanologists, a website that compiles made-in-America merchandise.", "“Mr. Trump is operating under a very common misconception: that ‘Nothing is Made in America anymore,’ ” Americanologists co-founder and editor Kathy Shaskan told us by email. “If he chooses, he can make this into a wonderful learning opportunity, for himself and the country, because there are plenty of American-made goods available, including menswear, and these manufacturers need our business. Hickey Freeman and Hart Schaffner Marx make suits in the USA using imported fabrics. Brooks Brothers makes suits out of both foreign and domestic fabrics.", "“As for shirts and ties, our blog, www.americanologist.com, lists 17 manufacturers of American shirts and 20 tie manufacturers,” Shaskan said. “Again, some of them are made with imported fabric, some with domestic. Either way, they are providing American jobs. Mr. Trump could give American manufacturing a big boost in visibility by reshoring some of his products and I hope he chooses to look into that.”", "After Trump insisted that “they don’t even make this stuff here,” Stephanopoulos cited Brooks Brothers as one company that does.", "“Well, they — but they don’t make here,” Trump said. “They don’t make here, not that I see.”", "That’s not accurate. Although many of the products sold by Brooks Brothers continue to be made overseas, the company has in recent years been reshoring back to the U.S. some of its manufacturing.", "Arthur Wayne, a spokesman for Brooks Brothers, told us via email that currently “100 percent of Brooks Brothers retail ties are made in our factory in Long Island City, NY; approximately 85 percent of our suits are made in our factory in Haverhill, Massachusetts.; and our Original Button-Down Polo Oxford shirts, made to measure shirts, and some of our luxury shirts are also made in America at our factory in Garland, NC. We also offer some accessories and other furnishings which are Made in America.”", "David Trumbull, a consultant and expert in textiles and U.S. manufacturing, told us Stephanopoulos was correct about the Brooks Brothers example.", "But, Trumbull told us via email, “In the case of men’s dress shirts and neck ties there is a complicating factor. There is very little U.S. production of the fabrics that go into those garments. That means that they must be labeled ‘Made in USA of Imported Fabric’ which, obviously, undercuts, from a marketing perspective, the benefit of being able to claim made in USA, and could explain why someone such as Trump might choose to source neckties from overseas even while generally supporting U.S. manufacturing. After all, if you can’t get the benefit of an unqualified ‘Made in USA’ label, then in a sense, he’s right that no one makes it here. Further complicating it is the fact that the U.S. is a major producer of fabric, much of which is shipped to Mexico, Central America, or South America to be assembled into garments that come back to the U.S. The end product is not made in USA, but the most valuable component, the fabric, is made here.”", "In the case of Brooks Brothers, for example, as its website explains (in the small print at the bottom), its collection of men’s ties and bow ties are made — “cut and piled” —  in the U.S. out of silk, cotton and wool woven in Italy or England.", "Trumbull agreed that Trump is simply incorrect to say they “don’t even make this stuff here.” While the vast majority of apparel consumed in the U.S. is imported, “we do still make apparel here and over the past five years U.S. manufacturing has had a bit of a comeback.”", "As for Trump’s threat to impose tariffs on China, Lawrence told us that if he did, “Most of the impact would be to divert our imports to other low wage countries with significant textile industries. These would mainly be Asian countries like Vietnam, Bangladesh, Cambodia, Pakistan and India.”", "We reached out to the Trump campaign and did not hear back, but in 2011, Trump was asked why he doesn’t look at having his Trump products manufactured in the U.S.", "“Always do,” Trump told ABC News. “There are very few companies that do it because they can’t compete with the [currency] manipulation.” In his debate exchange with Rubio, when Rubio asked why he doesn’t make more of his products in America, Trump again raised the issue of countries devaluing their currency.", "Fact checkers at the Washington Post concluded Trump’s repeated complaints about currency manipulation are dated. But at least his claim that there are “few companies” that manufacture apparel and accessories in the U.S. was accurate. It’s just not accurate to go further — as Trump did on ABC’s “This Week” — and claim, “They don’t even make this stuff here.”", "https://www.sharethefacts.co/share/a3628455-2a6c-449e-8501-5da113cfdf1f", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]