["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Sen. Kirsten Gillibrand, D-N.Y., speaks during a news conference in New York on March 14, 2021. (AP)", "• The number of reported military sexual assaults increased in all but one year between 2010 and 2019, and the number reached a record in 2019. The number of estimated assaults based on survey data also increased between 2016 and 2018, the most recent two years for which data is available.", "• Meanwhile, conviction and prosecution rates have generally dropped year-to-year since 2013. However, the decline in prosecution and conviction rates may be related to an increase in reported assaults.", "Sen. Kirsten Gillibrand, D-N.Y., has made tackling sexual assaults in the military one of her signature issues.", "Gillibrand is backing the Military Justice Improvement Act, which would place the decision to prosecute serious crimes in the military, such as sexual assault, in the hands of independent prosecutors rather officials within the military chain of command. Gillibrand argues that doing this would reduce conflicts of interest and inspire more confidence in the system among survivors.", "Several Republican senators, including Chuck Grassley of Iowa, Lisa Murkowski of Alaska, Rand Paul of Kentucky, and Ted Cruz of Texas, have joined more than two dozen Democrats in co-sponsoring the measure.", "During a radio interview with WNYC on Feb. 23, Gillibrand argued that there’s still a long way to go in solving the problem of military sexual assault, and that the problem worsened under President Donald Trump.", "\"Unfortunately, under Trump, it got even worse than it ever was,\" Gillibrand said in the interview. \"We had the highest number of sexual assaults ever reported in the last year. We had a retaliation rate against those people that reported, left statistically unchanged from the last few years. We had the lowest conviction rate and the lowest prosecution rate since the time I've been working on this. Everything is going in the wrong direction, and it is untenable.\"", "Is it correct that reported sexual assaults are the highest they’ve ever been, and that conviction and prosecution rates are at a low point? We found that Department of Defense statistics show that Gillibrand is largely accurate, though we noticed some nuances.", "Evan Lukaske, Gillibrand’s communications director, pointed us to Appendix B of the fiscal 2019 edition of the Department of Defense Annual Report on Sexual Assault in the Military. The report was released in April 2020.", "The data for reported sexual assaults shows an increase every year except one — 2015, when the number dropped slightly. All told, there were 3,327 sexual assaults in 2010 and 7,825 in 2019, meaning that the number more than doubled over the course of a decade.", "The Pentagon data supports Gillibrand’s statement about reported assaults. However, it’s important to note that this is just one of two measurements the Pentagon uses to count sexual assaults.", "The other is a biennial estimate of sexual assaults, based on survey responses. The idea is that some servicemembers who are sexually assaulted will not file a formal complaint, but would still be willing to tell a survey taker about it. So the estimated number of servicemembers experiencing sexual assault is always significantly higher than the number officially reported.", "There have been six surveys taken so far, starting with 2006. The 2018 level of 20,500 estimated incidents — the most recent data point — is well below the estimate from 2006, which was 34,200. But the 2018 level represented a notable increase from 2016.", "This increase also supports Gillibrand’s argument.", "The Pentagon told PolitiFact that both measures are important, but that they show different things.", "There’s no question that officials would like to see fewer assaults. However, an increase in reported sexual assaults may or may not reflect a worsening problem, depending on whether the increase stems from a greater willingness of survivors to come forward and report the incident.", "\"Fundamentally, while the department wants to see prevalence decrease, we also want servicemembers who experience a sexual assault to come forward and report it in order to get restorative care, receive support, and aid efforts to hold offenders appropriately accountable,\" said Lisa Lawrence, a Pentagon spokesperson.", "The Pentagon report doesn’t provide clean figures for prosecution and conviction rates, but Gillibrand’s office provided PolitiFact with their calculations of data in the report, and we double-checked their work. We have used the data on reported assaults for these figures, rather than the survey estimates, since they are available for each year.", "In general, the data between 2013 and 2019 shows a downward trend in prosecutions — from 23% in 2013 to 10% in 2019. In the most recent two years for which data is available, 2018 and 2019, the percentage going to trial dropped modestly, from 11% to 10%.", "The same pattern held for convictions, which fell from 17% in 2013 to 7% in 2019. During the past two years, 2018 and 2019, the percentage held steady at 7%.", "It’s worth noting, however, that the total number of sexual assault reports has risen over the same period, from 5,518 to 7,825. It’s possible that in 2013, only the most severe cases were being reported, resulting in higher prosecution and conviction rates than today. Today, there may be more cases reported in which a lack of evidence or witnesses may make them tougher to prosecute.", "Although Gillibrand cast blame on the Trump administration for rising rates of assault, these trends were not confined to Trump’s presidency.", "For instance, in five of the six years when Barack Obama was president, the number of reports rose. And the single biggest year-to-year increase, between 2012 and 2013, came under Obama.", "Gillibrand said, \"We had the highest number of (military) sexual assaults ever reported in the last year\" and \"we had the lowest conviction rate and the lowest prosecution rate.\"", "The number of reported military sexual assaults increased in all but one year between 2010 and 2019, and the number reached a record in 2019. The number of estimated assaults based on survey data also increased between 2016 and 2018, the most recent two years for which data is available.", "Conviction and prosecution rates have also dropped in most years since 2013. However, the decline in prosecution and conviction rates may be related to an increase in reported assaults, changing the mix of cases that are most prosecutable.", "We rate the statement Mostly True.", "New York Public Radio, \"Call Your Senator: Sen. Gillibrand on COVID-19 Relief, Immigration Reform,\" February 23, 2021", "United States Department of Defense, \"Department of Defense Annual Report on Sexual Assault in the Military,\" April 17, 2020", "United States Department of Defense, \"Appendix B: Statistical Data on Sexual Assault,\" April 17, 2020", "Newcomb College Institute, \"Gillibrand vs. McCaskill: Fighting the Invisible War,\" January 1, 2017", "Gillibrand.senate.gov, \"After Recent Department of Defense Report Highlights Its Continued Failure to Address Crisis of Military Sexual Assault, Gillibrand Leads Bipartisan Group of Senators to Reintroduce Military Justice Improvement Act and Calls On Congress to Act,\" June 13, 2019", "Military Times, \"How will Trump and Biden handle veterans issues? Here’s what they told us.,\" October 14, 2020", "Email interview with Lisa Lawrence, Pentagon spokesperson, March 22, 2021", "Interview with Jess Fassler, chief-of-staff for Sen. Kirsten Gillibrand, and Evan Lukaske, communications director for Sen. Kirsten Gillibrand, March 16, 2021", "Email Interview with Evan Lukaske, communications director for Sen. Kirsten Gillibrand, March 10, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]