["In its monthly weather outlook, Kenya's weather department predicted that for July, “cool/cold and cloudy/foggy conditions with occasional light rains/drizzles are expected to prevail over the Central Highlands, Nairobi County and the Central and South Rift Valley”.", "On July 20, 2020, this Facebook post shared a picture of a road covered with what appeared to be snow, claiming the scene was pictured in Kijabe, a town about 50 kilometres north-west of Kenya’s capital, Nairobi.", "“EUROPE HAS COME TO KENYA! It snowed this morning in NYAHURURU. Spectacular views... Climate change is real,” reads another  Facebook post published on July 21, 2020.", "The same images were shared on this Twitter account, which has more than 150,000 followers, alongside the caption: “Unusually cold conditions across the country. Winter in Nyandarua?”", "Old pictures", "All the images used in the multiple posts are, however, old; a reverse image search on TinEye located some of them in a news report by Citizen TV, a local media station, published on July 5, 2017.", "According to the report,  the images were captured in Nyahururu, Laikipia county, an area located on the equator in the Great Rift Valley.", "A search of the keywords “Nyahururu, snow” on Google for the year 2016 and 2017 led us to a tweet published by Kenya’s meteorological department on July 4, 2017, commenting on the “snow images”  that were circulating online.", "“The event in Nyahururu is a hail storm. Such storms occur when there is abrupt convection and rain clouds form too fast,” reads the tweet. “For it to snow temperatures are usually below 0°C”.", "The event in Nyahururu is a hail storm. Such storms occurs when there is abrupt convection and rain clouds form too fast.", "In a phone interview with AFP Fact Check, Richard Muita, a director at Kenya’s meteorological department, explained that the images show hail and not snow.", "“We would actually call it hail because they are big rocks coming from the atmosphere then falling on the ground and covering some area. We do not have snow in Kenya, this is not a characteristic of the tropical area and more research is needed to establish whether there is a relationship with the changes in climate.”", "However, he added that snowy conditions are experienced in highland areas like the Aberdare mountain range, north of Nairobi, and atop Mount Kenya.", "No recent reports of snow", "Muita confirmed that the weather department has not received any reports of snow-like weather in 2020.", "“Lately, we have not seen that kind of thing. Currently what we are seeing in colder regions in Kenya is foggy conditions in the morning and this clears off as the day progresses. Also what you can see in those colder or foggy areas is a bit of water on top of crops and vegetation but not snow per se,” Muita told AFP Fact Check.", "Between July 14 and July 20, Nyahururu recorded the lowest temperatures countrywide at 8.7 degrees Celsius (47.7 degrees Fahrenheit).", "Snow forms when the atmospheric temperature is at or below freezing, but by reviewing 2020 data from the meteorological department, there are no day temperatures in Kenya that have been at or below 0 degrees Celsius.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]