["The video was posted to Alex Jones’s InfoWars website on June 21. In the five-minute clip, Jones -- a US conspiracy theorist known for calling 9/11 an inside job and saying the Sandy Hook school shooting never happened -- makes various claims about the Covid-19 outbreak.", "“This is all about creating fear and testing obedience and control over the population to wreck the economy and bring in a planetary government based on medical tyranny,\" he growls, staring into the camera. “There’s still time to stop this operation.”", "By September the footage had been viewed more than 1.7 million times on Facebook. It gained massive traction in Slovakia, where a version of the clip with Jones’s trademark gravelly voice dubbed into Slovak was picked up by several conspiracy theorist groups and shared to thousands of online followers.", "“This is a modern genocide, who will be punished for it?” one fan commented on the video (archived here) posted to Slovak page Chemtrails Slovensko, a conspiracy theorist page where the clip has been viewed more than 500,000 times.", "Another user commented on the video that the pandemic is “all made up”.", "The large view count that Jones’s video has racked up flies in the face of a purge of various extremists on Facebook. Last May the platform banned Jones and his InfoWars site for flouting its policy on dangerous individuals and organisations. According to Facebook, people who express “support or praise” for figures banned under these guidelines can also see their content taken down.", "The ban followed similar moves from YouTube and Twitter, who shut down Jones’s accounts in 2018.", "Conspiracy theories have thrived on social media since the outbreak of the novel coronavirus late last year, ranging from rumours that Microsoft founder Bill Gates deliberately created the pandemic to a slickly-edited video, “Plandemic”, claiming, among other things, that hospitals are incentivised to report Covid-19 diagnoses.", "While social media companies move to curb falsehoods by penalising the worst offenders and bumping down the visibility of posts flagged by fact-checkers, platforms often find themselves playing catch-up as content spreads faster than it can be removed.", "Contacted by AFP Fact Check, Sophia Ignatidou, an artificial intelligence and disinformation researcher at Britain’s Chatham House, said she was “not surprised” that Alex Jones’s video was available online.", "“Facebook is known for having lots of problems in terms of oversight,” she said via phone on September 11. “There’s a combination of lack of human resources -- the moderators cannot compete with the amount of content that’s being pushed online -- and the fact that groups like the ones sharing this Alex Jones video are trying to evade automated tracking systems.”", "She said groups like far-right conspiracy movement QAnon used techniques such as specific hashtags and words to avoid detection by monitoring systems. Last month Facebook shut down hundreds of accounts and blocked more than 300 hashtags linked to QAnon on the platform and Instagram, following similar measures by Twitter in July.", "AFP Fact Check has debunked more than 600 false and misleading claims about the Covid-19 outbreak on social media, including Facebook and Instagram posts encouraging people to hold their breath to test for the disease and warning that face masks can cause hypercapnia.", "Posts can be shared thousands of times in various countries before being debunked by fact-checkers. And experts say dangerously misleading content that breaks community standards is either not being detected, or only when it is too late to avoid disastrous consequences.", "Last March a mass shooting that ripped through two mosques in Christchurch, New Zealand, was broadcast live on Facebook for 17 minutes and shared on YouTube and Twitter, leaving Internet giants scrambling to remove the gruesome footage.", "Facebook said it removed 1.5 million videos of the attack, most of which were “blocked at upload”.", "But in countries like Slovakia, where Alex Jones’s video has been shared more than 45,000 times across various groups, experts warn of a lack of moderation that allows dangerous misinformation and conspiracy theories to spiral out of control.", "“Slovak COVID-19 Facebook groups have tens or hundreds of thousands of members. There are hundreds of posts shared daily by the users without proper moderation,” Tomas Krissak, a disinformation expert in Bratislava, told AFP Fact Check.", "“This is how that particular video likely got the initial traction,” he said, referring to the Alex Jones production. “Then there is a snowball effect, or a chain reaction. The post became increasingly viral and it was seen by millions of people.”", "He said that people in Slovakia were “not ashamed to share and disseminate these delusions in their communities”.", "With thousands rallying against coronavirus measures in protests from the United States to Croatia in recent months, the impact of online conspiracy theories is hardly a uniquely Slovak problem.", "“It’s a complicated situation,” Ignatidou said. “Facebook and Twitter are not just media companies or tech companies. They are so embedded in our lives right now.”", "AFP Fact Check has debunked the main claims in Alex Jones’s video.", "“The world is going into an artificial financial collapse,” Jones says at the start of the video. “The head of the United Nations’ Sustainable Development Organization said last week that’s a good thing and they’re using Covid to lower our standard of living to save the planet.”", "Contacted by AFP Fact Check, Michal Szymanski, spokesman for the United Nations’ Department of Economic and Social Affairs, said there was no “United Nations Sustainable Development Organization”.", "“We do not know who Mr Jones is referring to,” he said via email. “What we do know is that the claims presented in his video could not be further away from the messages that the UN has been consistently communicating throughout this crisis.”", "The logo featured in Jones’s video is that of the UN’s Division for Sustainable Development Goals, which works to tackle poverty in developing countries.", "AFP Fact Check found no evidence in reputable media that the head of this division, Alexander Trepelkov, has said that economic hardship caused by the pandemic was a positive thing.", "During a webinar on May 12, 2020, Trepelkov said that the crisis was causing “unprecedented health and socio-economic challenges around the world, including the deepening of inequalities between and within countries.”", "“Let’s just remember that it’s on record that all these hospitals were completely empty,” Jones says, alongside footage showing Elmhurst hospital in New York.", "New York’s Queens district, where Elmhurst Hospital Center is located, was particularly hard-hit by the pandemic. According to Johns Hopkins’s Coronavirus Resource Center, Queens has recorded more than 70,000 Covid-19 cases, including more than 6,000 deaths -- the second highest death toll in the US -- as of September 16, 2020.", "Contacted by AFP Fact Check, Stephanie M. Guzmán, spokeswoman for New York’s public health system NYC Health + Hospitals, said the hospital had treated and discharged “well over 1,000” Covid-19 patients since the city entered lockdown in March.", "In March a New York Times report showed conditions at Elmhurst Hospital, which it called “one of the epicenters of coronavirus in New York City”. Emergency physician Colleen Smith showed rows of beds with coronavirus patients. \"All the patients in this room, all the feet that you see, they all have Covid,\" she said.", "AFP photos taken on March 26, 2020 also show people queuing outside the hospital to be tested for Covid-19 in blue and white tents. The same tents are visible in Jones’s video, although no people are seen queuing.", "Elmhurst Hospital reported a drop in new Covid-19 cases in May. According to a New York Times article on May 20, 2020, Elmhurst was treating “barely a third of the people it did before the outbreak” as the number of Covid-19 cases dropped but routine operations had not yet resumed.", "Elmhurst is not the only hospital to see patient numbers fall during the pandemic. In April, AFP debunked claims (in French) that the government was “lying” about the outbreak after a video circulating appearing to show an empty hospital in Toulon, France. However, the footage showed the hospital’s emergency room, which was practically empty due to lockdown measures.", "Jones says that there were “no patients” for the hospital ships that US President Donald Trump sent to free up bed space at the height of the pandemic.", "The US sent two navy ships to treat non-Covid-19 patients so doctors and nurses could focus on tackling the virus in in-land hospitals. During lockdown, non-Covid hospital admissions plummeted as people were told to stay at home unless they had an emergency or serious Covid-19 symptoms.", "USNS Mercy -- a converted oil tanker with 1,000 beds -- treated only 77 patients during its six-week stay in Los Angeles from March 27 to May 15, according to USNI News.", "USNS Comfort treated 182 patients while it was docked in New York from March 30 to April 30, the navy said. The floating hospital had so few patients that it started taking Covid-19 patients, which made up around 70 percent of its total admissions.", "“It’s now come out that for any patient they claimed had Covid, they got over $52,000 and would put Covid on charts when the person didn’t even have Covid,” Jones says, referring to hospitals.", "The conspiracy theorist says that hospitals registered deaths from non-coronavirus conditions, such as heart attacks and cancer, as being caused by Covid-19 in order to “get the money”.", "“It’s been engineered all over the world because the WHO, the UN, set the standards and the parameters,” he said, referring to the World Health Organization.", "AFP Fact Check has not found any other mention of $52,000 specifically in regards to Covid-19 diagnoses. It appears the amount was taken by Jones after a Minnesota physician and Republican state senator Scott Jensen claimed in a Fox News interview in April that doctors were being encouraged to cite Covid-19 as a cause of death of their patients.", "This, according to him, was motivated by payments received by hospitals from Medicare - the federal health insurance programe for Americans 65 and older. Jensen claimed that for every Covid-19 patient it treated, a hospital should have received $13,000, stacking up to three times as much -- $39,000 -- if the patient was put on a ventilator. This would amount to $52,000 in total, the amount presented in Jones’s video.", "In the US the amount of money hospitals are given to treat patients depends on the severity of their medical condition. For Covid-19 cases, the government's health coverage agency, the Centers for Medicare and Medicaid Services (CMS), sets out varying estimate payments depending on the severity of the illness (see here), ranging from $6,024.55 for acute bronchitis to $39,896.58 for ventilator support for more than 96 hours.", "Nonetheless, as part of a federal stimulus bill, Medicare is paying hospitals 20 percent more than standard rates for Covid-19 patients.", "New CMS guidance that came into effect on September 1, 2020 requires “to have a positive Covid-19 laboratory test documented in the patient’s medical record for a hospital to be eligible for the 20 percent add-on payment.” Beforehand, suspected cases of Covid-19 have also been included in such instances where the patient died of respiratory disease even before the test was complete.", "AFP Fact Check's investigation concludes that there is no basis for Jones’s claim of a $52,000 payout.", "Health experts have also rejected the notion that US hospitals have inflated the number of Covid-19 patients.", "Speaking to the Denver Post in a May 20, 2020 article, Joe Hanel, spokesman for health policy research group the Colorado Health Institute, said the idea was “ridiculous”.", "“The idea that hospitals and doctors are falsely inflating Covid numbers and even putting patients on ventilators to drive up their payments is not just ridiculous, but it’s insulting to the doctors who are putting their own lives at risk,” he said.", "Gerald Kominski, senior fellow at the UCLA Center for Health Policy Research, told FactCheck.org in April 2020 that any suggestion that patients may be put on ventilators out of financial gain rather than medical need was “basically saying physicians are violating their Hippocratic Oath”.", "“It would be like providing heart surgery on someone who doesn’t need it,” he said.", "Jones’s video claims that the standards have been set out by the WHO to include heart attacks, cancer and other diseases to list Covid-19 as a cause of death if the deceased patient was diagnosed with the virus.", "In reality the WHO’s International guidelines for certification and classification recommends to only put Covid-19 on a death certificate if it is an underlying cause of death. The document specifically mentions that myocardial infarction (heart attack) should not be listed as a Covid-19 death, even if the patient has the disease.", "AFP Fact Check has also previously debunked the claim that the US Centers for Disease Control and Prevention (CDC) would add regular flu and pneumonia deaths to Covid-19 toll. Such a claim is false; the CDC’s National Center for Health Statistics (NCHS) only records those who died from Covid-19 in its toll for the disease.", "“When all those medical doctors came out, prestigious scientists, the former head virologist at Rockefeller Hospital came out and said ‘this is a hoax, this is a fraud’, they were banned from YouTube, Facebook and Twitter because the system knows this hoax can’t stand the light of day,” Jones claims.", "The video shows a screenshot from a press conference on April 22, 2020 in which two US doctors sparked controversy after voicing opposition to lockdown measures.", "“Typically, you quarantine the sick. When someone has measles, you quarantine them. We've never seen where we quarantine the healthy, where you take those without disease and without symptoms and lock them in your home,” said Daniel Erickson, emergency physician at Accelerated Urgent Care healthcare practice in Bakersfield, California.", "\"You have a 0.03 chance of dying from Covid-19 in the state of California. Does that necessitate sheltering in place? Does that necessitate shutting down medical systems? Does that necessitate people being out of work?\" he argued.", "Despite voicing opposition to authorities’ handling of the Covid-19 outbreak, at no point did Erickson or his colleague, Artin Massihi, use the words “hoax”, “fraud”, “fake” or “false”, according to a transcript of the press conference obtained by AFP Fact Check.", "The American College of Emergency Physicians and the American Academy of Emergency Medicine promptly published a joint statement condemning the comments as \"reckless and untested musings\".", "YouTube removed a video of the press conference published by local news channel 23ABC Bakersfield for “violating” the platform’s community guidelines. However, the footage is still available on 23ABC Bakersfield’s Facebook page.", "\"The virus, which is a real virus and a nasty pneumonia, can't stand the light of day,” Jones says. He claims that Covid-19 has “spread the most and killed the most people in blue cities and blue states” because they are “urban canyons where people don't get sunlight.\"", "According to the CDC, the US had recorded more than 6.5 million cases and more than 194,000 deaths from Covid-19 on September 16, 2020.", "The most deaths were recorded in New York, New Jersey and California respectively. They all voted for the Democratic Party in the 2016 US presidential election. However, the highest number of Covid-19 cases includes California, as well as Texas and Florida, which both voted Republican in 2016 (although Florida is considered a swing state). The traditionally red state of Texas has seen the fourth-highest Covid-19 death toll in the US, with more than 9,800 deaths.", "Contacted by AFP Fact Check, experts said that Covid-19 transmission had “nothing to do with sunlight”.", "“Sunlight does two things, causes heat and includes UV light and both of these will inactivate the virus as long as the sample gets hot enough and/or receives a sufficient dose of UV light,” Ian Jones, professor of virology at Britain’s University of Reading, said via email.", "He said virus transmission depended on factors such as social crowding.", "Jonathan Ball, professor of virology at Britain’s University of Nottingham, said that while sunlight is thought to fight the new coronavirus, claims that an alleged lack of sunlight caused outbreaks in urbans areas were “total rubbish”.", "“The virus will start to degrade in the environment, and we suspect that sunlight – especially the UV – will speed up that degradation,” he said via email. “But that is not an instant effect (it’s not a vampire!) so one can not draw conclusions about the likely rate of transmission in places with and without skyscrapers.”", "The World Health Organization previously dispelled myths back in April that exposing yourself to sunlight or high temperatures could prevent or cure Covid-19.", "Jones claims that blue states and cities are telling people to wear masks “for the next year” and that they “can never take your mask off”.", "“This is all about creating fear and testing obedience and control,” he says.", "The video shows a screenshot of an article from June 18, 2020 by US National Public Radio’s site that says “California Gov. Newsom Makes Face Masks Mandatory Amid Rising Coronavirus Cases”. The article reports Governor Gavin Newsom’s decision to introduce compulsory mask-wearing. However the order does not tell Californians they can “never” remove their masks and makes no mention of obligatory mask-wearing “until next year”, as Jones claims.", "NEW: Californians are now REQUIRED to wear face coverings in public spaces.\n\n\t\tTogether -- we can slow the spread.\n\n\t\tDo your part. Wear a mask.\n\n\t\tLEARN MORE: https://t.co/xtXFwVeWc2", "Instead it enforced mask-wearing in “high-risk situations”, notably in indoor public spaces and outdoor public spaces where it is not possible to keep 1.8 metres apart from others. The legislation is similar to guidelines in other Democratic-led states hard-hit by Covid-19, such as New York and New Jersey.", "A New York Times article from June 8, 2020 found that more than half of 500 epidemiologists questioned said it would be “more than a year before they stopped routinely wearing a mask outside their homes”.", "Jones claims that US philanthropic organisation the Rockefeller Foundation “admits on record” that it had been planning the outbreak “for decades” with Microsoft founder Bill Gates and his wife Melinda.", "Both the Rockefeller Foundation and the Bill and Melinda Gates Foundation have pumped millions of dollars into efforts to fight the pandemic, and the latter has frequently been targeted by conspiracy theorists accusing it of being responsible for the outbreak.", "Accusations that the Rockefeller Foundation predicted the Covid-19 crisis appear to originate from a 2010 publication that explored various fictional scenarios on how technology could impact international development in the future.", "“Scenarios for the Future of Technology and International Development”, a report by the Rockefeller Foundation and the Global Business Network, a now-defunct consulting firm specialised in scenario planning, imagined a scenario involving a pandemic which overwhelmed nations and killed millions.", "“In 2012, the pandemic that the world had been anticipating for years finally hit. Unlike 2009’s H1N1, this new influenza strain -- originating from wild geese -- was extremely virulent and deadly. Even the most pandemic-prepared nations were quickly overwhelmed when the virus streaked around the world, infecting nearly 20 percent of the global population and killing 8 million in just seven months,” the report reads.", "This scenario includes “a world of tighter top-down government control and more authoritarian leadership.”", "Contacted by AFP Fact Check, Ashley Chang, spokeswoman for the Rockefeller Foundation, said the report aimed to plan for a possible future pandemic rather than predicting or causing the current Covid-19 outbreak.", "“The Rockefeller Foundation did not and is not fabricating a pandemic,” she said via email. “We believed the research report could focus governments and development professions to focus on what we don’t know -- instead of what we already know -- and make better plans to actually address a real pandemic such as the one we have today.”", "Bill Gates spoke out in July to reject online conspiracy theories accusing him of creating the outbreak as “a bad combination of pandemic and social media and people looking for a very simple explanation”.", "\"Covid-19 is a hoax. It's not killing anyone but old people,” Jones says.", "In the US, 79 percent of people who died from Covid-19 were aged 65 or older, according to figures from the CDC on September 9, 2020. The 85-plus age group makes up the highest proportion of deaths at 31.6 percent, despite representing only 3.4 percent of cases, the CDC said.", "According to the WHO, people of all ages can contract Covid-19, although older people face “a significant risk of developing severe illness.”", "However, the CDC warned that there was also an increased risk of severe illness from the disease in “people of any age with certain underlying medical conditions”, such as obesity, type 2 diabetes and cancer.", "More than 7,190 people under 50 have died from Covid-19 in the US, according to the CDC.", "Jones claims that politicians purposefully sent Covid-19 patients to nursing homes “to get the numbers up”.", "In the background of the video, screenshots of two articles (here and here) about New York state Governor Andrew Cuomo, a Democrat, appear while Jones is speaking.", "On March 25, 2020 Cuomo issued a contentious advisory mandating nursing homes to admit discharged patients from hospitals who had tested positive for Covid-19 back into their care as long as they were medically stable.", "The advisory cited “an urgent need to expand hospital capacity in New York State to be able to meet the demand for patients with Covid-19 requiring acute care.”", "A similar approach was adopted by New Jersey’s Governor Phil Murphy. According to ProPublica, both Cuomo and Murphy “have defended their approach as a way to open up crucial beds at a moment when it appeared hospitals would be overwhelmed by Covid-19 patients needing intensive care”.", "In New York, the policy was later reversed on May 10 after a wave of criticism. Based on the new directive, all the discharged patients had to first be tested negative before being admitted by a nursing home.", "AFP Fact Check found no evidence of Democrat governors deliberately trying to “get the numbers up” when it comes to Covid-19 deaths by prematurely discharging hospital patients into nursing homes.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]