["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Former Florida Gov. Charlie Crist’s surprise endorsement of President Barack Obama came with a warning for the Republican Party.\n\nCrist, who was elected governor as a Republican and then ran unsuccessfully for the U.S. Senate as an independent, penned an op-ed in the Tampa Bay Times that told arriving Republican National Convention delegates that an element of the GOP had veered too far to the right on women’s issues, immigration, seniors and students. \n\nABC’s This Week host George Stephanopoulos used Crist's endorsement to press Virginia Gov. Bob McDonnell, chairman of the Republican party’s platform committee, to respond to the charge. \n\nMcDonnell replied that Crist was \"wrong on the platform. He also missed the point. What matters is getting the nation back on track, the federal government out of debt, and jobs for the American people. \n\n\"So on the things that really matter to voters, George, I think the records are stark, and I think that's why independent voters have a 10-point margin in favor of Mitt Romney right now,\" McDonnell said. \n\nRomney is ahead by 10 points among independents? We looked at the most recent national polls to find out if that was correct.\n\nWe found that while national polls showed Romney leading Obama among independent voters, the Republican’s advantage varied from a few points to 11 points.", "It’s worth nothing that Obama was ahead among independents in the days before Romney chose U.S. Rep. Paul Ryan of Wisconsin as his vice presidential pick. CNN and Fox polls showed that about three weeks ago, Obama was ahead by 11 percent. \n\nWe also took a look at recent polls in three key battleground states. \n\nA Quinnipiac University/CBS News/New York Times poll released Thursday showed that Romney was ahead 48 percent to 44 percent among independents in Florida. This was within the poll’s margin of error. \n\nThat same poll in Ohio showed Romney was ahead of independents 48 percent to 43 percent in Ohio.\n\nIn Virginia, data from the firm Public Policy Polling showed Romney with a 46 to 43 lead among independents. \n\nOur ruling\n\nMcDonnell said Romney was ahead of Obama with independents by 10 points. He is right that polls show Romney leading among independents, although the polls range from a few to 11 points. We rate the claim Mostly True.", "ABC’s This Week with George Stephanopoulos, Aug. 26, 2012\n\nFox News, \"Fox News poll: Race for the White House tightens,\" Aug, 24, 2012\n\nAP-GFK Poll, \"AP-GfK poll shows Obama and Romney still locked in tight race, with Obama lead in likability,\" Aug. 22, 2012\n\nCNN.com, \"CNN Poll: Obama 49%-Romney 47% among likely voters,\" Aug. 24, 2012\n\nGallup, U.S. Presidential Election Center, 2012 Demographics, Registered Voters\nJul 30-Aug 19, accessed Aug. 26, 2012\n\nUniversity of Cincinnati, The Ohio Poll, Aug. 23, 2012\n\nQuinnipiac University/CBS News/New York Times Poll, \"Battleground Poll: Florida, Ohio and Wisconsin,\" Aug. 23, 2012\n\nPublic Policy Polling, \"Virginia is for Obama Lovers,\" Aug. 21, 2012\n\nFox News, \"Fox News Poll: Obama’s lead grows as Romney’s support slips,\" Aug. 10, 2012", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]