["About this rating", "In July 2017, an old, recycled quote went viral after White House communications director Anthony Scaramucci attributed the phrase \"act like you've been there before\" to former Penn State coach Joe Paterno:", "“On the honor of the job. Remember Joe Paterno? What would he say? ‘Act like you’ve been there before.’ Act with honor and dignity and respect and hold the confidence of the presidency.”", "The full quote is commonly rendered as a football analogy: \"When you get into the end zone, act like you've been there before.\"", "Many people criticized Scaramucci for using Paterno — whose career was tarnished after a lengthy child sexual abuse scandal — as an example of honor, but others took issue with the attribution of this quote. Did Joe Paterno really say \"act like you've been there before?\" Wasn't it Vince Lombardi? No, it was Tom Landry. Or maybe it was Paul Brown, Lou Holt, or Paul William \"Bear\" Bryant?", "Our research turned up a variety of credible sources that attributed this phrase to a wide range of coaches. Jack Ham, for instance, a Pittsburgh Steelers player who spent his college years playing for Paterno at Penn State, wrote in the forward to the book \"An Odd Steelers Journey\" that Paterno had once used the phrase:", "Andy read the play and close the off tackle, making the running back bounce to the outside, and yet he was still able to make the tackle. All of that and he made it look easy. No big deal. He helped the running back get up and went back to the huddle. Business as usual. As Joe Paterno would say, \"Act like you've been there before.\"", "The New York Times quoted Hall of Famer Lou Holtz using a similar phrase in a 1986 article, and former Cleveland Browns coach Paul Brown in 1991. As this quote apparently sums up the general attitude that coaches have toward end zone celebrations, it has probably been spoken by hundreds of different coaches (including Paterno) at one time or another:", "Many football coaches have a simple opinion on how a player should act when he arrives in the end zone to score a touchdown.", "Famous former coaches Darrell Royal (University of Texas), Vince Lombardi (Green Bay Packers), Paul Brown (Cleveland Browns), and Tom Landry (Dallas Cowboys) are among those who have been credited with saying, “Act like you’ve been there before.”", "But who said it first? Although we have yet to find a definitive answer, the Washington Post attributed this quote to Vince Lombardi in 1967:", "It is hard to imagine Lombardi not fuming at the sight of a mediocre defensive lineman dancing with self-celebratory delight after making a routine tackle in the second quarter with the team trailing by 14 points. One of the many sayings attributed to him (it had also been put in the mouth of fellow coaching legend Paul Brown) is something that he supposedly said to the great kick returner Travis Williams in 1967 when Williams danced after scoring a touchdown: \"Travis, the next time you make it to the end zone, act like you've been there before.\" As the story goes, that was all that needed to be said.", "Maraniss, David.   \"How Would the Legend Do Now?\"\r\n    Washington Post.   27 January 2000.", "Robinson, Tom.   \"Sportsmanship in Youth Athletics.\"\r\n    ABDO Publishing Company.   1 September 2010.", "Berkow, Ira.   \"Sports of The Times; At One Time, Paul Brown Jumped for Joy, Too.\"\r\n    New York Times.   7 August 1991.", "Rogers, Thomas.   \"Sports World Specials; Noteworthy Holtz.\"\r\n    New York Times.   16 June 1986.", "Russell, Andy.   \"An Odd Steelers Journey.\"\r\n    Sports Publishing LLC.   2002.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]