["A social media claim suggests that Prabhat Pheri – the custom of chanting and singing bhajans during early morning walks – took place for the first time in 40 years in Srinagar, Kashmir Valley. A video shared to support the claim shows a group of people singing ‘Hare Rama Hare Krishna’ on the road while the police are providing protection to the devotees. A Twitter user Puneet Sharma, who is followed by top BJP leaders, including the Prime Minister, shared the video on June 27, with the caption – “श्रीनगर कश्मीर में 40 वर्षों में पहली बार प्रभात फेरी का आयोजन हुआ। सोचो ये कैसे मुमकिन हुआ…? मोदी है….. तो मुमकिन है। जय श्री राम (For the first time in 40 years, Prabhat Pheri was organised in Srinagar, Kashmir. Did you wonder how this was made possible? Modi hai toh mumkin hai.)”", "श्रीनगर कश्मीर में 40 वर्षों में पहली बार प्रभात फेरी का आयोजन हुआ। सोचो ये कैसे मुमकिन हुआ…? मोदी है….. तो मुमकिन है। जय श्री राम@narendramodi @AmitShah pic.twitter.com/DGH8A3jSqA", "— Puneet Sharma (@iPuneetSharma) June 27, 2019", "The video has been widely circulated on Facebook.", "It has also been shared on WhatsApp with a Gujarati text that says – “શ્રીનગર નીગલીઓ માં 40 વર્ષ બાદ પહેલી વાર પ્રભાત ફેરી નીકળી છે.આ..જ બદલતા ભારત ની તસ્વીર છે. (Srinagar citizens take out Prabhat Pheri for the first time in 40 years. This is the face of a changing India.)”", "Alt News contacted ISKCON, Srinagar to inquire about the video. The priest on the jhaki (a platform where idols are kept for worshipping), who can be seen sprinkling holy water on devotees, is a monk named Moti Lal Raina.", "In a conversation with Alt News, Raina stated, “The video does not depict Prabhat Pheri, which is a custom where people walk in the morning while singing bhajans. It was shot during Ram Navami this year. We took out the jhaki across Srinagar”. He further continued, “We try to organise celebrations every year during Ram Navami and Janmashtami. It only happens sometimes that we don’t get permission. But it’s not true that such celebrations have not happened in 40 years. Celebrations have been happening since 2008.”", "Ram Navami fell in the month of April this year.", "Alt News found news reports of Ram Navami celebrations that took place in the Kashmir Valley even before Prime Minister Narendra Modi formed government.", "While the viral video depicts Ram Navami celebrations and has nothing to do with Prabhat Pheri, the latter isn’t new to Srinagar and has been celebrated earlier. This was corroborated by Raina who said that Prabhat Pheri is infrequent in Srinagar for security reasons, but they try to organise it whenever possible. Contrastingly, Prabhat Pheri is taken out every day by the ISKCON temple in Udhampur, which is one of the largest cities in the Jammu region.", "A video of Ram Navami celebrations in Srinagar this year is being shared on social media with two false claims – first that it depicts Prabhat Pheri, and second, the tradition hasn’t been followed in Srinagar in the last 40 years. Alt News’s fact-check found both the assertions to be untrue.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]