["About this rating", "Water typically freezes at 32° Fahrenheit (0° Celsius). At that temperature, the kinetic energy of the vibrating water molecules is weak enough that it no longer overpowers their ability to form hydrogen bonds, bonds that serve to organize the formerly flowing water molecules into a solid, structured form. In broad terms, this process does not generally occur spontaneously and requires a small impurity in the water to serve as a nucleation site around which the ice can crystallize. If water is extremely free of impurities, it can remain in liquid form well below its freezing point:", "So long as no atoms or molecules join to form a solid nucleus, the sample remains liquid. Once a solid forms, though, it spreads rapidly through the sample.", "Such water is known as “supercooled” water, and it is a great subject for YouTube videos and party tricks because it can create the illusion of being able to change the stated of matter at command. Slamming a supercooled bottle of water on a table, for example, results in the rapid crystallization of that water, and pouring supercooled water onto something else can result in the water's freezing instantly upon contact, allowing for the creation of “instant slushies\":", "One example of this class of phenomenon can be seen in a video, shared virally in Reddit in late December 2018, that shows a frozen grape being carefully dunked into a wine glass full of water, only to be removed with much of that water attached to the grape in ice form:", "Frozen grape + chilled water from r/blackmagicfuckery", "While we have not been able to identify the original source of this video or the circumstances behind it, supercooled water would react in this way to the addition of an object such as a grape. The observed result, from a physics standpoint, would be no different than another popular party trick: placing an ice cube in a supercooled glass of water. Both processes would set off a chain reaction around the original impurity, according  to Popular Science:", "Under normal conditions, an impurity in the liquid — such as that speck of dust — can stabilize small ice crystals as they form. Molecules will lightly bind to this outside object, starting a chain reaction as more and more molecules latch onto the growing mass. The impurity thus triggers a transition from liquid to solid, water to ice.", "The biggest hurdle for the performance of supercooled water tricks is not the execution of the shift to ice, but the acquisition of water free enough of impurities that it can be cooled below its freezing point (and a container sufficiently clean to hold it). Creating an open wine glass full of supercooled water might be a bit difficult, but dunking a frozen grape in it would produce the results seen in this video.", "NASA Science.   \"Liquid Below Freezing.\"\r\n    9 March 1998.", "Shieh, Marissa.   \"Make Instant Slushies with Supercooling.”\r\n    Popular Science.   28 May 2017.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]