["By Lori Robertson", "Posted on November 26, 2019", "During a White House event honoring a now-famous military dog, President Donald Trump repeated a false talking point on how much Islamic State-held land had been recaptured under his presidency.", "Trump recognized Conan, a combat canine who was injured during the late October U.S. raid that resulted in the death of Abu Bakr al-Baghdadi, the leader of the Islamic State terrorist group. The Nov. 25 visit with the dog included a short, feel-good Rose Garden appearance in which Trump joked with the media and Conan, who is back on active duty, cutely nudged Vice President Mike Pence for additional head scratches.", "But we have a bone to pick with one comment by the president.", "Trump claimed: “As you know, we captured 100% of the ISIS caliphate. When I took office, we had almost nothing. It was as though they were just forming again, and now it’s 100%.”", "It’s not true that “we had almost nothing” when Trump took office. According to figures provided by Trump’s own administration, about half of the territory held by the Islamic State, also known as ISIS, had been regained under his predecessor, Barack Obama.", "In a Dec. 21, 2017, briefing, Brett McGurk, then-special presidential envoy for the global coalition to counter ISIS, said that about 98% of the Islamic State land had been recovered by coalition forces, and 50% of that recovery had happened in 2017. “And significantly, 50 percent of all the territory that ISIS has lost, they have lost in the last 11 months, since January,” McGurk said.", "About a month before Trump was sworn in, the U.S. commander of the coalition operation — Combined Joint Task Force – Operation Inherent Resolve — said that “almost three million people and more than 44,000 square kilometers of territory have been liberated” from ISIS in 2016. That’s nearly 17,000 square miles.", "Estimates of the Islamic State-held land vary. Figures from IHS Markit, an analytics and consultancy firm, show a smaller percentage of land recovered under Obama, but still refute Trump’s claim that the coalition forces had “almost nothing” before he was inaugurated. IHS Markit’s estimates would put the recovery under Obama at 33%.", "Near its height in January 2015, the Islamic State caliphate in Iraq and Syria covered about 35,000 square miles, IHS Markit said. When Trump took office in January 2017, that was down to about 23,300 square miles.", "The rate of recapture did accelerate under Trump, according to the firm’s figures, which show the caliphate comprised about 14,000 square miles by June 2017.", "But Trump has repeatedly taken too much credit, framing the situation as a “disaster” under Obama and claiming in March 2018 that the land recapture “all took place since our election.”", "When he made that claim, as we wrote, the coalition forces had regained 98% of the land formerly controlled by the Islamic State. In March of this year, the Syrian Democratic Forces announced that the final stronghold in eastern Syria had been retaken.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]