["The 56-second clip was posted by an Australia-based Facebook user here on June 9, 2020.", "It has been viewed more than 610,000 times.", "At the eight-second mark, a beam of light can be seen hitting the water, before a series of waves erupt.", "The Facebook post’s caption states: “Lightning Strike into a creek in Montana. It boils the water!! Do not swim in thunderstorms.”", "Montana is a western US state.", "The video was also shared on Facebook here, here, here and here, on Twitter here, here, here and here, and on YouTube here, here and here alongside a similar claim.", "The claim is false; the video in fact shows a controlled underwater blasting in Finland.", "A reverse image search on Yandex found an earlier version of the video published here on YouTube in December 2012.", "The Finnish-language caption of the YouTube video translates as: “Drilling piling, part 3: Blasting”, and the caption states: “In this video, we deepen the waterway.”", "The footage was uploaded by Rannikon Merityö, a dredging, excavation and beach construction company based in Taivassalo, southwest Finland.", "In an email to AFP on July 30, a spokesperson for Rannikon Merityö said: “The video was shot in the summer of 2012 in Kustavi (southwest Finland). It shows an explosion of an underwater solid rock. This kind of blasting work is part of the services provided by our company. The video has spread around the internet, including to scam sites. However it is a man-made thing not a natural phenomenon.”", "The footage is also featured here on the company’s website and here on its Facebook page, alongside information about underwater mining, excavation and mining.", "The false claim previously circulated online in 2017 and has been debunked by US broadcaster KARE and fact-checking organisation Snopes here and here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]