["By Eugene Kiely", "Posted on October 11, 2018", "At an event for law enforcement officials, President Donald Trump boasted that his administration recently provided “historic levels of funding to improve school safety” and “hire more officers” through the newly created STOP School Violence Act. But the new law does not fund school safety at “historic levels.”", "An omnibus spending bill the president signed in March included the STOP School Violence Act, and shifted $75 million from an existing school safety program to STOP School Violence programs. But a single program created in the late 1990s and since disbanded, called COPS in Schools, provided as much as $180 million in fiscal year 2000, according to a 2017 government report. That’s $260 million in 2018 dollars.", "The president spoke about the STOP School Violence grants in his remarks to the International Association of Chiefs of Police in Orlando, Florida.", "Trump, Oct. 8: Last week, my administration also provided historic levels of funding to improve school safety. Through STOP School Violence grants, we are giving local schools and police departments the resources they need to hire more officers, and train more teachers, and better detect and address early warning signs of mental illness before it’s too late.", "The White House said the president was referring to the STOP School Violence Act and the programs it funds.", "On Oct. 2, the Department of Justice announced that it had awarded more than $70 million for school safety through the STOP School Violence Act. A week earlier, Attorney General Jeff Sessions had announced $200,000 in funding to the National Association of School Resource Officers “to expand and update their curriculum to better support training programs,” the announcement said.", "The STOP School Violence Act was created by the Consolidated Appropriations Act of 2018, an omnibus bill that the president signed in March. The omnibus spending bill provided $75 million to the STOP School Violence Act to address school violence. The Bureau of Justice Assistance, or BJA, received $50 million, and the Office of Community Oriented Policing Services, or COPS Office, received $25 million in grant money.", "“BJA received $50 million to provide grants to states, units of local government, and Indian tribes. These grants are used for the training of teachers and the education of students to prevent student violence, and to support threat assessments, crisis intervention teams, and the use of technology for anonymous reporting,” Alan R. Hanson, a principal deputy assistant attorney general, explained to Congress in written testimony to a House subcommittee in July. “The balance ($25 million) was provided to the COPS Office to provide grants for law enforcement training and coordination to prevent school violence and for a variety of school safety equipment (e.g., metal detectors, locks, lighting) and alerting technologies.”", "When the president signed the spending bill, Education Week noted that it “shifts funds from an existing, wide-ranging school safety grant program toward the new STOP School Violence Act.”", "Education Week, March 23: The final budget takes $75 million appropriated for the Comprehensive School Safety Initiative — an existing program in the Department of Justice that funds research and implementation of a wide range of evidence-based safety programs that range from bullying prevention to innovative approaches to school policing — and redirects that funding toward programs authorized under the STOP School Violence Act.", "On its website, the National Criminal Justice Reference Service notified potential grantees that the “NIJ has canceled the Comprehensive School Safety Initiative.”", "“With the enactment of the Consolidated Appropriations Act of 2018, the funding planned for these solicitations is no longer available for research and evaluation,” the cancellation notice said. “Instead, it will be used for other purposes under the Stop School Violence Act of 2018.”", "The National Institute of Justice website says the program, before it was cancelled, provided $246 million from fiscal years 2014 through 2017. That’s an annual average of $61.5 million, with a high in funding of $69 million in fiscal 2015. With inflation, the $69 million in fiscal 2015 is a few million less than the $75 million provided this year for STOP School Violence grants.", "So, it’s true that the $75 million for the STOP School Violence Act is more than what Congress had appropriated for the program it replaced, the Comprehensive School Safety Initiative. That program received a low of $42 million in fiscal 2017, the last year of funding.", "However, the COPS in Schools program in the late 1990s and early 2000s provided much more funding for school safety than the grants awarded under the STOP School Violence Act.", "A 2017 government report detailed the history of federal funding for school safety programs from 1990 to 2016. The report said that then-President Bill Clinton in 1998 held “the first White House Conference on School Safety,” which resulted in the formation of two major school safety grant programs.", "“During his keynote address, Clinton announced two new large-scale school safety discretionary grant programs: the COPS in Schools program to fund the hiring and training of school resource officers, and the Safe Schools/Healthy Students Initiative to fund interagency, community-based violence prevention and behavioral health programs for school-age children and youth,” the report said.", "The COPS in Schools program was administered by the DOJ’s Office of Community Oriented Policing Services, or COPS Office — the same office that received $25 million under the STOP School Violence Act. The federal report on school safety programs called COPS in Schools “the largest sustained federal effort to support SROs.”", "Between 1999 and 2005, the COPS in Schools, or CIS, program awarded $823.7 million in grants to law enforcement agencies to support the hiring of more than 7,000 school resource officers. At its peak, the COPS in Schools program issued grants totaling $180 million in fiscal year 2000 — which is the equivalent of about $260 million in 2018 dollars. (See Table 11 in the report for COPS in Schools funds.) That’s nearly four times the STOP School Violence grants.", "“Annual appropriations for the CIS program total $167.5 million in FY1999, $180.0 million in FY2000, $179.6 million in FY2001, $180.0 million in FY2002, $39.7 million in FY2003, $59.4 million in FY2004, and $4.9 million in FY2005,” the report said.", "The Safe Schools/Healthy Students Initiative — a more broadly designed program that dealt with issues that included drug use, bullying and dropout prevention — provided “more than $2 billion in funding and other resources to 365 communities in 49 states” from fiscal years 1999 through 2012, the report said.", "The report noted that the peak in federal funding for school safety occurred in the “early to mid-2000s.”", "“After peaking in the early to mid-2000s — a period during which several national-level school safety initiatives were active and receiving substantial appropriations — federal funding for school safety declined in the following decade,” the report said.", "A February report on school safety by the nonpartisan Congressional Research Service said that Congress might want to consider restarting the dormant COPS in Schools program.", "CRS, Feb. 23, 2018: In late 1990s and 2000s, Congress appropriated funding for two programs that provided funding for physical school security measures, the Matching Grant Program for School Security and the COPS in Schools program. However, neither program has been funded for several years. Policymakers might consider whether to revive these programs to help support school security efforts, especially if Congress is looking for an avenue to provide funding to schools for installation of physical security measures.", "Instead, Congress passed the STOP School Violence Act, which provided grants at a level well below the COPS in Schools grants — despite Trump’s claim that the new law provided “historic levels of funding.”", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]