["About this rating", "A number of companies are developing lab-grown meat products; cultured nuggets can be grown from cells collected from a feather.", "While nuggets can be grown from cells collected from a feather, the company JUST said that its first commercially available products won't use this method.", "When these lab-grown nuggets will hit store shelves.", "In March 2019, we started receiving queries about \"lab grown chicken nuggets made from feathers\" that were expected to hit store shelves by the end of the year.  While various companies have been working on such meat for awhile, many readers apparently were confused by the meaning of \"made from feathers\" and were curious about when these products would be available for purchase.", "In October 2018, outlets such as Food Beast reported that the food-manufacturing company Just (formerly Hampton Creek) was developing a cultured chicken nugget. This development was frequently reported under headlines using the phrase \"made from feathers,\" which may have given some readers the wrong impression about how cultured nuggets were made. In fact, many readers seemed to have come away from these articles with more questions than answers.", "Are people eating feathers? No. In order to make lab-grown meat, or clean meat, manufactures start by collecting some cells. While these cells can be collected from a feather, Just's head of communications, Andrew Noyes, said that their first products won't be produced from cells collected from a feather:", "To make cultured chicken, you have to first collect some cells, and that can be done through a small, harmless biopsy from a live chicken, through a cell bank or even from a feather, among other means, Noyes told Munchies. In a video Just posted last year, the company said that when it used the feather method, it chose \"the single best chicken that we could find,\" -- a chicken with clean feathers, a healthy comb and a nice wattle. However, Just's first product won't be produced from cells collected from a feather, said Noyes.", "Once cells are collected, they're loaded into a bioreactor and given nutrients and a scaffolding material on which to grow. Just says once it's ready to make a product, growing meat from cells can take anywhere from a few days up to a few weeks.", "So they take cells, grow them into a chicken, and then kill the animal to make nuggets? No. One driving factor for this industry is that these cultured meat products can be created without killing an animal. While the process is a bit complicated, here's a brief explanation from Vox about how the synthetic sausage (or chicken) is made:", "Lab-grown meat starts with cells — you can use stem cells, muscle cells, fat cells, myo- or fibroblasts — that you submerge in a growth medium. The medium is “a soup of nutrients that mimics what happens in the animal’s body,” explains Vitor Santo, a senior scientist with Just (formerly Hampton Creek, the company that brought you plant-based Just Mayo).", "Depending on the type of cells and the medium ingredients, you can grow different kinds of tissue. Muscle cells grow more muscle cells, fat cells grow more fat cells; both are in meat as we know it. Stem cells can be coaxed into growing different kinds of tissue.", "There’s one more element beyond cells and soup: scaffolding. The cells need something to grow on. If the scaffolding is going to be part of the eventual product (as it would if you’re growing a whole muscle meat like a steak or a chicken breast), then it obviously has to be edible. If the meat gets removed from the scaffold, as it would if the product was more like ground meat, then it just has to be safe.", "Here's a video from Just explaining the process:", "Will clean meats be available in the supermarket in 2019? Not likely. While a number of companies have successfully made synthetic meat products, and while a few brave journalists have sunk their teeth into them, we're still a ways away from having cultured nuggets in the supermarket aisle. One factor that could be slowing down their release is cost.", "In January 2019, Just's cultured nugget was featured on ITV Tonight's \"Food Challenge: Meat vs Vegan.\" In addition to explaining more about how these nuggets are made, Just CEO Joshua Tetrick said that one nugget currently costs about $100:", ".@HelenSkelton becomes the first person in the UK to try this $100 chicken nugget, grown entirely in a lab from a single chicken cell. How close is it to the real thing?", "Find out more in #ITVTonight’s ‘Food Challenge: Meat vs Vegan’, on @ITV at 7:30pm. pic.twitter.com/HkqBXJooxw", "— Tonight (@ITVTonight) January 24, 2019", "There are also still questions about how to regulate clean meat products. The BBC reported that adventurous American eaters may have to travel overseas to get their first taste of a cultured nugget, as the United States hasn't quite figured out how to regulate lab-grown meats:", "If Just does manage to produce enough chicken nuggets to sell this year, it is unlikely to be in an American restaurant as the US government is still deciding how to proceed.", "Most food in the US is regulated by the Food and Drug Administration (FDA). But some - mostly conventionally raised meat - is regulated by the USDA. So if you're buying a frozen pizza in the US, the USDA handles the pepperoni version and the FDA handles the cheese.", "\"There are a number of countries in Asia and Europe that we're talking to,\" Tetrick says. \"There's a lack of clarity\" about regulations in the US while the USDA and FDA hold public hearings, he explains.", "\"I think countries want to take the lead in this. Whether it's food scarcity, whether it's sustainability issues or they just want to build an entirely new economy, they want to take the lead in doing this,\" Tetrick said.", "While Just is truly developing a cultured nugget, as far as we can tell this product has yet to hit store shelves. We reached out to Just for more information on when these nuggets will be available to the public. Memphis Meats, another company developing cultivated chicken (and duck), hopes to release its own products by 2021.", "In short, several companies are working on developing lab-grown meat products, but these foods aren't quite ready for wide release. Furthermore, while saying that these cultured nuggets can be \"made from feathers\" is technically true, this is just one method in which the required cells can be collected.", "Haspel, Tamar.   \"Lab-Grown Meat and the Fight Over What it Can be Called, Explained.\"\r\n    Vox.   31 August 2018.", "Spyrou, Constantine.   \"Chicken Nuggets Made Without Harming A Single Bird Will Hit Restaurants This Year.\"\r\n    Foodbeast.   17 October 2018.", "Locklear, Mallory.   \"A Cultured Chicken Nugget Could Hit the Market by the End of the Year.\"\r\n    Engadget.   24 October 2018.", "Garfield, Leanna.   \"A San Francisco Startup Just Created the World's First Lab-Grown Chicken.\"\r\n    Business Insider.   15 March 2017.", "Hafner, Josh.   \"Lab-Grown Chicken Strips, Made From Animal Cells, Debuted by Startup.\"\r\n    USA Today.   16 March 2017.", "Castrodale, Jelisa.   \"The Latest Cruelty-Free Meat Is Chicken Nuggets Grown from Cells.\"\r\n    Vice.   23 October 2018.", "Morris, Regan; Cook, James.   \"Would You Eat Slaughter-Free Meat?\"\r\n    BBC.   15 October 2018.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]