["This post, which has been shared hundreds of times since it was published on Facebook on June 25, 2019, contains the two photos of the woman with a bloody face.", "The post’s Hindi-language caption states: “This is the slogan of Modi & Yogi Beti Bachao where policemen are mercilessly assaulting the daughters, what would you say to this? Modi - Yogi shame shame.”", "Below is a screenshot of the misleading post:", "Narendra Modi is India’s prime minister, while Yogi is a reference to Yogi Adityanath, the chief minister of northern Indian state Uttar Pradesh.", "Beti Bachao refers to “Beti Bachao, Beti Padhao” which means “save the daughter, educate the daughter” in Hindi and is a campaign launched by Modi in 2015. Here is an official campaign web page.", "The same photos and caption were also shared elsewhere on Facebook, for example here.", "A Google reverse image search led to this footage of the same incident published by Indian news site The Quint on December 22, 2016.", "The article is headlined: \"Couple Attacked in UP’s Mainpuri for Resisting Lewd Remarks\". Mainpuri is a district in the north Indian state of Uttar Pradesh.", "According to the Quint report, the woman and her husband were beaten when they challenged a group of men for making lewd remarks.", "Below is a screenshot of one of the photos in the misleading Facebook post with key identifying features highlighted in red by AFP:", "Below is a screenshot from the video in the Quint report, with the corresponding features highlighted:", "In boxes A & B, the faces of the police officers correspond with the officers seen in the misleading post.", "Box C shows a yellow house in the background, and box D highlights the bleeding woman in a green dress.", "Another reverse image search on Google found the photos in the misleading post also appeared in this video uploaded on December 23, 2016 on the Youtube Channel of the New York Post with the caption: “Indian woman brutally beaten by a mob of men after resisting a groping creep.”", "The first photo appears at 10 seconds in this video, while the second photo appears at 24 seconds.", "Below are two screenshots taken at those timestamps in the New York Post video:", "The same incident was reported here in India on December 22, 2016 by Indian news agency Asian News International’s Uttar Pradesh bureau (ANI UP).", "The report reads: “Uttar Pradesh police has arrested a man for brutally beating a woman in a marketplace for resisting molestation.\"", "A case has been registered at Kishani area police station in Mainpuri against the three miscreants.”", "The incident was also reported by various online media in India, for example here and here. Some Indian TV news channels reported the incident with a video story uploaded on their official YouTube channels, for example here and here.", "Current Uttar Pradesh chief minister Yogi Adityanath assumed his role as the head of the north Indian state on March 19, 2017, according to this The Hindu report.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]