["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Democrat for Congress candidate Sri Kulkarni, center, listens to supporters attending a fundraiser for him. (AP)", "• Kulkarni was arrested when he was 18 years old for possessing less than a gram of cocaine. ​", "• The ad characterizes Burning Man, which Kulkarni has attended, as a “notorious desert drug (party).”", "A new attack ad from the Congressional Leadership Fund, a super PAC working to elect a GOP majority in the House of Representatives, suggests a Texas congressional hopeful lives a hard-partying lifestyle.", "\"What do we really know about Sri Kulkarni?\" the ad asks. \"About the notorious desert drug parties he attended? His cocaine arrest? Kulkarni’s personal behavior is reckless.\"", "Republican groups have made these claims on several other platforms, setting up a website and sending out mailers that depict Kulkarni as drug-addled and impulsive. We wanted to see if the facts of this attack line held up to scrutiny.", "We found that both of these claims – that Kulkarni was arrested for cocaine possession and that he attends \"notorious\" drug parties – leave out important context and paint a misleading portrait of Kulkarni’s experience with illegal drugs. We’ll tackle them one by one.", "Sri Kulkarni was once arrested for cocaine possession 23 years ago, when he was 18 years old.", "In 1997, Kulkarni was arrested for possessing less than a gram of cocaine but was never convicted. Although he pleaded guilty, his charge was dismissed by a Harris County judge after \"deferred adjudication.\"", "Jennifer Laurin, a professor of criminal law at the University of Texas School of Law, explained to PolitiFact that \"deferred adjudication\" is a disposition that allows a defendant to have their charge dismissed after a period of supervision. Kulkarni paid a $500 fine and served two years of probation before his charge was thrown out.", "Kulkarni has addressed his arrest before, telling the Houston Chronicle that it occurred during a stressful time when his father was dying of leukemia. \"We should not be stigmatizing our youth for the rest of their lives,\" he told the paper.", "Jack Doyle, Kulkarni’s communications director, noted that Kulkarni served in the United States Foreign Service for 14 years. As a State Department employee, he had top secret security clearance and was subject to randomized drug testing.", "In an attempt to show that Kulkarni has continued to engage in the same \"reckless\" behavior of his adolescence, the Congressional Leadership Fund also claims that he attended \"notorious desert drug parties.\"", "The phrase piqued our interest. But when we drilled down into the basis of the claim, and after speaking with the Congressional Leadership Fund, we found that the reality is less salacious than the ad makes it out to be. Turns out, the \"notorious desert drug (party)\" that Kulkarni attended was Burning Man, the days-long arts and spirituality festival in the Nevada desert.", "Kulkarni has attended Burning Man in the past and is a member of several Burning Man-affiliated Facebook groups.", "There’s no denying the fact that drug use is common at Burning Man, and that illicit substances are part of the festival’s public reputation. However, people go to Burning Man for a wide variety of reasons, and it’s a stretch to say that the primary focus of the festival is to provide a space for illegal drug use.", "More than 70,000 people went to Burning Man in 2018. The event aims to provide a venue of \"radical inclusivity,\" providing a space for people to make art, dance, give gifts, meditate, and collaborate with one another in building an environment separate from normal society. The event is annual, legal, and widely advertised, and in past years, many celebrities have attended, including Elon Musk, Mark Zuckerberg, and Grover Norquist.", "\"It’s unfair to say that everyone is at Burning Man to do drugs,\" said Brian Doherty, a senior editor at Reason and author of This Is Burning Man, a book about the festival. \"That’s not its purpose, and we can’t just presume that you did drugs there.\"", "An ad released by a Republican super PAC claims that Sri Kulkarni was arrested for cocaine possession and attended \"notorious desert drug parties.\"", "Overall, these claims are partially accurate.", "Kulkarni was arrested for cocaine possession. But the arrest was 23 years ago when Kulkarni was 18. He pleaded guilty, but the charge was later dismissed.", "The notorious desert drug party is, in fact, a music festival called Burning Man. The Congressional Leadership Fund is taking a small fact — that Kulkarni attended the festival — to make an unproven assertion that Kulkarni is reckless.", "We rate these claims Half True. ​", "A campaign ad, Sep. 25, 2020", "Burning Man census archive, 2020", "\"Burning Man NYC\" Facebook group", "Business Insider, Everything you've been wanting to know about Burning Man, the wild 9-day arts event in the Nevada desert frequented by celebs and tech moguls, Aug. 15, 2019", "Congressional Leadership Fund, Sri Kulkarni: Too liberal, too dangerous, Sep. 2020", "\"DC Burners\" Facebook group", "The Guardian, My first Burning Man: confessions of a conservative from Washington, Sep. 2, 2014", "Houston Chronicle, Candidate for Congress admits arrest for cocaine when he was a teenager, riling Fort Bend race, Feb. 20, 2018", "U.S. Department of State, Department of State drug testing policy, Sep. 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]