["Two images of burning houses have been shared thousands of times in multiple Facebook posts which claim they show revenge arson attacks carried out by supporters of a top political party in Sri Lanka after an October 4, 2019 court verdict in their favour. The claim is false; the photos actually show unrelated incidents in Sri Lanka and India that long pre-date the recent court ruling. Sri Lankan police told AFP there had been no reports of arson attacks after the recent judicial ruling.", "One of the images, which shows a house badly-damaged by fire and still smouldering, was published in this Facebook post on October 5, 2019. It has been shared more than 2,200 times.", "Below is a screenshot of the misleading Facebook post:", "The Sinhala-language caption translates to English as:  “The way Gota’s supporters expressed gratitude to a helpless family when the Court announced Gota is a Sri Lankan citizen… Irrelevant of political affiliation, this type of work is deplorable.”", "Gotabaya Rajapaksa, also known as Gota, is the candidate for the Sri Lanka Podujana Peramuna party in the country’s upcoming presidential poll, which is scheduled for November 16, 2019.", "Sri Lanka’s Appeals Court on October 4, 2019 dismissed a case filed by two civil society activists challenging Gotabaya’s citizenship.", "Section 20 of the 19th Amendment to the Constitution of Sri Lanka specifies that people who hold dual nationality cannot run for president.", "The photo was also published on Facebook here and here alongside an identical claim.", "This Facebook post published on October 6, 2019 makes a similar claim that the house was burned in Opanayaka.", "Opanayake is a town located in Sri Lanka’s Sabaragamuwa province.", "The claim is false; the image used in the misleading post was photographed during anti-Muslim riots in May 2019 following the Easter Sunday bombings.", "A reverse image search on Google found the same photo included in this article published on May 13, 2019 on a Tamil language news website. The article reported on the anti-Muslim riots that erupted in North Western Sri Lanka.", "Below is a screenshot comparison of the image from the misleading post (L) and the image published on the news website (R):", "Here is an AFP report on the May 2019 anti-Muslim riots in Sri Lanka.", "Officer in Charge of Opanayaka Police division,  K. K. P. Kalubowila speaking to AFP on October 6, 2019 via phone said the claims in the post were false.", "“There is no truth to the claim of a house being set on fire by a group of political party supporters,” he told AFP.", "Meanwhile, similar Facebook posts with different photos they claim show violence after the Appeal Court verdict have circulated thousands of times in multiple posts like this, published on October 5, 2019.", "Below is a screenshot of the Facebook post:", "The Sinhala-language text on the image translates to English as: “Gota doesn’t criticise..but his supporters set fire, crush bones and oust, straight away..", "\"If this is how dual citizenship is celebrated, if they win, the minority 49% would have to seek refuge in another country..”", "The lengthy caption in Sinhala makes detailed claims about Gotabaya’s supporters unleashing chaos following the court verdict.", "The caption claims that a house has been set on fire in Opanayake, a business destroyed in Horowpathana, and UNP party posters and signboards trashed in Bandaragama.", "UNP is the ruling party and the main contender against SLPP.", "Horowpathana is a town in North Central Sri Lanka and Bandaragama is a town located in Western Sri Lanka.", "Identical claims were made in this article published by a local news website and in other Facebook posts, for example here.", "These claims are also false; a reverse image search on Google shows the photograph in the misleading post is from an incident that occurred in 2014 in India; Sri Lankan Police refuted the claims and said none of the alleged incidents of violence had actually occurred.", "A Google reverse image search of the picture in the misleading posts led to this article published on May 18, 2017 titled ‘NRHC directs Assam to compensate families of 36 victims of 2014 Baksa massacre’.", "Below is a screenshot of the image:", "The photo's caption states: “File photo of a burning house in a village in Kokrajhar district where Bodo militants have often unleashed violence”.", "The Officer in Charge of the Horowpathana Police Station, Sanjeewa Roshan, told AFP on October 6, 2019: “No incident was reported about a place of business being attacked by a group of political party supporters. These claims are falsehoods.”", "The Officer in Charge of the Bandaragama Police Division, WLK Wickramanayake said that no political banners or signs had been destroyed in his district, he told AFP on October 6, 2019.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]