["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "An Internet post claimed that an explosion blew off a Tampa man’s testicles while he was trying to puff marijuana smoke into a scuba tank.", "A lot of weird things happen in Florida. This isn’t one of them. The story is fake.", "\"Tampa man loses testicles after trying to 'fill scuba tank with weed smoke',\" read the headline on an April 13, 2017, article on FloridaSunPost.com. The story was flagged by Facebook users who suspected the story may be fake, as part of the social media site’s efforts to curtail fake news.", "The story said a Tampa man named Darren Winters \"had consumed a copious amount of alcohol\" when he decided to invite friends over to witness him use a contraption he dubbed a \"scuba bong.\"", "The recreational diver had planned to blow smoke into a scuba tank with a compressor, then inhale it through a regulator, the story read. Winters reportedly knocked the tank off a workbench and it exploded, with shrapnel severing his genitals.", "While those details are graphic, they’re also completely fabricated. FloridaSunPost.com is a fake news website designed to look like a traditional news outlet.", "The exact same story appeared on BostonLeader.com on Sept. 16, 2016, with the location changed to Boston. The name of the victim was changed to Michael Fitzpatrick — although the surname Palmer was cited once, too.", "Where did Palmer come from? Another version of the same story was posted on Sept. 3 at IsThatLegit.com, but this time in Calgary, Canada. The victim in that story was named Robert Palmer.", "These sites and others, such as the MississippiHerald.com, AlabamaObserver.com and DenverInquirer.com, certainly appear related. The sites we found all were privately registered through a domain service in Toronto.", "The privacy terms of FloridaSunPost.com and the related websites said they don’t guarantee \"the information on this website is complete, true, accurate or non-misleading.\" We attempted to contact the sites’ owner through an online contact form, but did not receive a reply.", "It’s clear the story of a drunken diver who suffered from explosive emasculation is made up, and has been shared among several websites.", "We rate the statement Pants On Fire!", "FloridaSunPost.com, \"Tampa man loses testicles after trying to 'fill scuba tank with weed smoke',\" April 13, 2017", "IsThatLegit.com, \"Calgary man loses testicles while trying to ‘fill scuba tank with weed smoke’,\" Sept. 3, 2016", "BostonLeader.com via Internet Archive, \"Boston man tries to fill scuba tank with weed smoke; loses testicles,\" Sept. 16, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]