["In the backdrop of NASA’s Perseverance Rover landing on Mars on February 19 (IST), a video has gone viral on Twitter and Facebook with the claim it is an audio-video recording from Mars.", "The following video was posted by Twitter user Anonymous along with the text, “Mars, fascinating.” This video now has over 24 million views which four million views more than NASA’s live stream of the Perseverance Rover landing.", "Mars, fascinating. pic.twitter.com/WSyq8Ojna2", "— Anonymous (@YourAnonOne) February 19, 2021", "Alt News received multiple requests on WhatsApp to verify this video. The viral video was also shared by Odisha-based news outlet Kalinga TV, Srinivasan Ramani, deputy national editor at The Hindu, and Harini Calamur who leads Impact Science at Mumbai-based Cactus Communications.", "This slideshow requires JavaScript.", "Alt News performed a reverse image search and found that the visuals in the viral video are identical to the panoramic image clicked by NASA’s Curiosity Rover last year. The size of the high-resolution image is over 2 GB.", "NASA also posted a 360 video based on this image. This video does not have sound. In the past, NASA has shared audio recordings from Mars. However, it was never along with a video. It appears that the viral video was made using these media files. We compared NASA’s 360 videos with the viral video and found that they were identical. Alt News couldn’t authenticate the source of the audio in the viral video.", "Further, we also noticed that the wheels on the rover in the viral video are identical to the ones present on the Curiosity Rover as per NASA.", "On February 23, NASA uploaded an unprecedented video from Mars that shows the landing sequence recorded by Perseverance and the sky crane. US-based Space.com reported, “Perseverance’s EDL camera system also features a microphone, which the team had hoped would capture rushing Martian winds and other EDL sounds. That didn’t happen, but the mic did switch on after touchdown, recording the first-ever audio on the surface of another world.”", "To conclude, an image clicked by NASA’s Curiosity Rover in 2020 was turned into an audio-video format. Since the video was shared shortly after NASA’s recent Mars landing, it misleads millions of people to believe that it shows visuals and audio recorded by Perseverance Rover.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "A video of a ladder moving on its own, purportedly from Jharkhand, is viral on…", "On August 23, India made history as Chandrayaan-3 successfully landed near the south pole of…", "In a historic first, India’s Chandrayaan-3 spacecraft’s Vikram lander touched down near the moon’s little-explored…", "‘BeerBiceps’ is a YouTube channel with more than 58 lakh subscribers. The founder of this…", "In April 2022, Twitter announced that it had accepted tech mogul Elon Musk’s offer to…"]