["By Robert Farley", "Posted on September 21, 2020", "President Donald Trump and Democratic presidential nominee Joe Biden have made competing claims about Biden’s early statements on the coronavirus.", "Following the disclosure of comments he made to journalist Bob Woodward in March about downplaying the coronavirus, Trump has tried to turn the tables on Biden, claiming it was Biden who maintained through late February that the coronavirus was “not even going to be a problem.” That’s not accurate.", "The former vice president warned early about the potential danger posed by the virus, and about the need for a thoughtful response by the federal government. The “coronavirus is a serious public health challenge,” Biden said at a Feb. 28 campaign rally in South Carolina.", "Conversely, Biden stretched the facts at a CNN town hall on Sept. 17, claiming that in January he wrote an op-ed “saying, we’ve got a pandemic. We’ve got a real problem.” The op-ed did not go that far.", "We reviewed all of Biden’s public comments that we could find in early 2020 about the coronavirus.  While some of his comments about the potential danger of the virus have proved prescient, Biden was not as far ahead of the curve as he sometimes makes it seem when it came to calls for deterrents like social distancing and wearing masks.", "We start with one comment from Biden via Twitter from October 2019, before the coronavirus emerged.", "We are not prepared for a pandemic. Trump has rolled back progress President Obama and I made to strengthen global health security. We need leadership that builds public trust, focuses on real threats, and mobilizes the world to stop outbreaks before they reach our shores. https://t.co/1qqpgayUEX", "— Joe Biden (@JoeBiden) October 25, 2019", "That was more than a month before the earliest known instances of the disease occurred in early December in Wuhan, China, and more than two months before Chinese officials  reported the outbreak to the World Health Organization on Dec. 31.", "The first public statement that we found from Biden about the coronavirus came in an op-ed for USA Today on Jan. 27. In it, he warned about the “possibility of a pandemic,” writing that while there were only five confirmed cases in the U.S. at that time, “There will likely be more.”", "Biden argued that “Trump’s demonstrated failures of judgment and his repeated rejection of science make him the worst possible person to lead our country through a global health challenge.” Biden touted the Obama administration’s response to the Ebola outbreak, and he criticized Trump for proposing budget cuts to the National Institutes of Health, the Centers for Disease Control and Prevention and the Agency for International Development (although Congress did not enact those proposed cuts).", "That puts Biden on record as sounding an early warning about the coronavirus. But Biden went too far with comments at the CNN town hall when he said he warned in the op-ed, “We’ve got a pandemic. We’ve got a real problem.”", "Biden was responding to recently revealed comments Trump made to Woodward on Feb. 7 acknowledging the coronavirus was “deadly stuff,” adding that it might be five times more lethal than the flu.", "Trump “knew the detail of it,” Biden said. “He knew it in clear term. Imagine had he at the State of the Union [on Feb. 4] stood up and said, when back in January, I wrote an article for USA Today saying, we’ve got a pandemic. We’ve got a real problem. Imagine if he had said something. How many more people would be alive?”", "But as we’ve written, Biden didn’t say in the op-ed that the outbreak was already a pandemic. He said it was a “possibility.” He said Trump was not prepared to lead the country through a “global health challenge,” which Biden did predict would “get worse before it gets better.” (The World Health Organization didn’t declare COVID-19 a pandemic until  March 11.) In fact, a month after that op-ed, Biden still said it wasn’t yet a pandemic. “Folks, we can beat this virus. We can keep it from being a pandemic,” Biden said at a a campaign rally on Feb. 28. “But it takes a lot of work.”", "Four days after Biden’s op-ed, on Jan. 31, Health and Human Services Secretary Alex Azar declared a public health emergency for the novel coronavirus and announced travel restrictions to and from China, effective Feb. 2. The policy prohibited non-U.S. citizens who have traveled to China within the last two weeks from entering the U.S. But there were exceptions for permanent residents and the immediate family members of both U.S. citizens and permanent residents.", "That same day, at a campaign event in Fort Madison, Iowa, Biden said, “We have right now a crisis with the coronavirus,” and warned that Trump was not a leader up to the challenge.", "Biden, Jan. 31: America needs a president they can trust, especially at times of a crisis. You know, we have right now a crisis with the coronavirus, emanating from China. A national emergency, you know, worldwide alerts. The American people need to have a president who they can trust what he says about it, that he is going to act rationally about it. In moments like this, this is where the credibility of a president is most needed, as he explains what we should and should not do. This is no time for Donald Trump’s record of hysteria, xenophobia – hysterical xenophobia – and fearmongering to lead the way instead of science.", "(Trump has repeatedly cited the “xenophobia” comment as evidence that Biden opposed his decision to impose travel restrictions on China. The Biden campaign on April 3 said Biden supported the travel restrictions, and that the xenophobia comment was unrelated to them.)", "The following day, Biden tweeted: “We are in the midst of a crisis with the coronavirus.” And he warned Trump was “the worst possible person to lead our country through a global health emergency.”", "Biden made nearly identical comments that day at a rally in North Liberty, Iowa.", "Biden said Trump had a credibility problem with the American people, who are “finding it harder and harder to believe what he says about this virus. Look, president’s words matter. They matter, no matter who the president is. And in times of fear and concern, people need to have confidence in the word of a president. And, you know, this president, he has a trust deficit that is compounded by his record of hysterical xenophobia and fear mongering.”", "In both rallies, Biden accused Trump of proposing “draconian” cuts to the NIH, CDC and U.S. Agency for International Development — which, as we said, Congress ignored.", "In some 35 public appearances at campaign rallies, in television interviews or in Democratic debates over the next three weeks in February, Biden was not asked about and did not mention the coronavirus at all.", "The issue next came up during a Democratic debate on Feb. 25. With the virus reaching a turning point, as the CDC warned schools they should prepare and might have to close, Biden was asked what he would do. Biden again talked about the Obama administration’s response to Ebola in the context of what he would do now: set up a White House office for pandemic response and increase funding for the CDC and NIH. And Biden said he would insist that China allow American scientists in to “know what’s going on.”", "At a press briefing the following day, Feb. 26, Trump made several comments that suggested the U.S. had the coronavirus well under control.", "“So we’re at the low level,” Trump said. “As they get better, we take them off the list, so that we’re going to be pretty soon at only five people. And we could be at just one or two people over the next short period of time. So we’ve had very good luck.”", "Trump insisted that “we’re going very substantially down, not up” in the number of cases, that “when you have 15 people, and the 15 within a couple of days is going to be down to close to zero, that’s a pretty good job we’ve done.”", "In a CNN town hall that night, Biden said Trump and Dr. Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases, did not appear to be on the same page.", "Biden called the virus “a concern” and said, “I think it’s important that we understand that you have to have a president in charge. … We need to invest immediately. We should have done it from the beginning, the moment the virus appeared. But we’re getting late, but we’ve got good scientists. And I just hope the president gets on the same page as the scientists.”", "Earlier this month, a new book by Woodward revealed that on March 19, Trump told Woodward that he had understated the threat of coronavirus on purpose. “I wanted to always play it down,” he said, adding, “I still like playing it down, because I don’t want to create a panic.”", "In recent interviews, Trump has tried to suggest that it was Biden who downplayed the coronavirus.", "In an interview with Fox News’ Sean Hannity on Sept. 9, Trump claimed that Biden “was going around for many, many weeks” after the travel restrictions on China were announced on Jan. 31, “saying, it’s not even going to be a problem. … And they were all going around, no problem, no problem, everybody, practically everybody. Nobody had any idea it would be as violent as it turned out to be.” Later, Trump said Biden “didn’t think it was going to be a problem until months later. He was way late.“", "At a White House briefing the following day, Trump again claimed that for months after he imposed the China travel restrictions, Biden “said there’s no problem.”", "At the ABC News town hall on Sept. 15, Trump again claimed that as late as March, Biden was calling the coronavirus “totally over exaggerated.”", "As we said, that is belied by Biden’s repeated warnings, starting with the op-ed on Jan. 27, that the coronavirus could develop into a pandemic, and would require a sustained and strong federal response.", "The Trump campaign said the president’s comment refers to statements Biden made on Feb. 28 that it was not a time to panic. (Trump told Woodward that he played down the virus because he didn’t want to create a panic.)", "The first was at a campaign rally in Sumter, South Carolina.", "Biden, Feb. 28: I want to talk a moment about the coronavirus. And I just want to say a few things to set the record straight. Barack and I, as president and vice president, we took on the virus that was threatening all of Africa and the rest of the world, and we set up a mechanism that worked. But I want to take a moment to say, it’s not a time to panic about coronavirus, but coronavirus is a serious public health challenge.", "Biden did say it was not a time to panic, but he never downplayed the seriousness of the coronavirus threat, as Trump suggests. To the contrary, he claimed moments later that that’s what Trump was trying to do.", "“Trump thought that his upbeat tweets could somehow stop the coronavirus,” Biden said. “Well I have news for Donald Trump, like the rest of us, this virus is not impressed by his tweets. And here’s the point, and I’m being deadly earnest about this, we need real action in the White House, not more lies. It’s no surprise that the president who thinks that climate change is a hoax also thinks that coronavirus is a conspiracy. We need a president who stands for the truth over fiction, and facts and science over fiction. Folks, we can beat this virus. We can keep it from being a pandemic. But it takes a lot of work.”", "At a campaign event in Spartanburg, South Carolina, the same day, Biden again said “there should be no panic about this.” But he didn’t downplay the virus, or say that it was “not even going to be a problem” or that it was “totally over exaggerated,” as Trump claimed. (Starting at the 105:20 mark.)", "“There should be just the straight facts laid out for people and now that’s not happening,” Biden said. “Hopefully the pressure is building on the president to step aside. He knows nothing about much. He knows nothing about this issue. Let science dictate the outcome,what we do. That’s what I’d be doing.”", "That’s different from what Trump was saying at the time. As we recently learned, Trump admitted he was purposefully downplaying the virus.", "Interestingly, in an interview with CNN’s Jake Tapper on March 24, five days after Trump made his comments to Woodward about downplaying the virus, Biden said this: “The American people have never, ever, ever, ever let their county down when given an opportunity to respond. And we just have to level with them. They’re tough. They’re smart. They can handle it. But give them the facts. The only thing that’s going to make things worse, if we, in fact, don’t give them the facts, and then things turn out to be bad. Then who do they believe? What is there to believe? They can handle whatever comes their way.”", "While Biden may have been earlier than many in warning about the potential seriousness of a pandemic, he and his campaign have occasionally made comments that suggest he was further ahead of the curve than he was on things like social distancing and wearing masks.", "For example, in a TV interview in Florida on Sept. 15, when asked how he would handle a new surge in the coronavirus, Biden said, in part, “I would be setting the example that I’ve tried to set since this began, of being responsible, wearing a mask.” (Starting at the 1:46 mark.)", "Another example is a radio interview in May when Biden talked about a Columbia University study that concluded tens of thousands of deaths would have been avoided if social distancing and other enforcement measures, such as stay-at-home orders, had been widely implemented in the U.S. a week or two earlier. “They pointed out that if he had listened to me and others and acted just one week earlier to deal with this virus, there’d be 36,000 fewer people dead,” Biden said.", "At the Sept. 17 CNN town hall, Biden again cited the Columbia study and claimed that “all the way back in March, I was calling for the need for us to have masks.”", "As we wrote back in May, we couldn’t find any examples of Biden calling for social distancing, or something resembling a nationwide lockdown, by early March.", "In fact, Biden was still holding campaign rallies with large groups of people at that point. On March 9, he spoke at a crowded campaign event in Detroit. (Trump’s last public event around that period was a Fox News town hall on March 5.)", "On March 12, Biden released “The Biden Plan to Combat Coronavirus.” It made no mention of public mask-wearing. It called for the CDC to provide clarity to the general public “about when to move toward social distancing measures, like cancelling school, mass gatherings, and travel and when to move to tele-work and distance learning models.”", "In comments posted the same day to Medium, Biden said that while the coronavirus would require a national response, it would also require individuals to “take appropriate precautions — to protect ourselves, and critically, to protect others, especially those who are most at-risk from this disease.”", "“It will mean making some radical changes to our personal behaviors: more frequent and more through handwashing and staying home from work if you are ill, but also altering some deeply-ingrained habits, like handshakes and hugs, and avoiding large public gatherings,” Biden said.", "The same day, the Biden campaign issued a memo to staff instructing all campaign staffers to work from home, beginning March 14.", "On March 16, Trump issued the 15-day “Coronavirus Guidelines for America,” in which he urged, “all Americans, including the young and healthy, [to] work to engage in schooling from home when possible. Avoid gathering in groups of more than 10 people. Avoid discretionary travel. And avoid eating and drinking at bars, restaurants, and public food courts.”", "On ABC’s “This Week” on Sept. 13, host George Stephanopoulos noted that in Biden’s op-ed in late January, “he didn’t explicitly call for travel bans or social distancing or wearing mask.”", "Biden campaign Senior Adviser Symone Sanders responded that Biden “was not being briefed by national security experts who warned him how deadly the virus was. In January and February, Joe Biden did not have the knowledge that President Trump did.”", "“But I will tell you that if Joe Biden were president in January or February, he would have taken proper precautions he would have warned the American people,” Sanders said. “He would have told folks to social distance. He would model good behavior and wearing a mask.”", "We don’t know what national security experts may have been privately telling the president about the coronavirus back in January or February. (It was revealed in April that Trump’s top trade adviser, Peter Navarro, wrote a memo in late January advising federal officials that the global outbreak could become a pandemic and that more than half a million Americans could die in multiple scenarios.)", "But in public statements, Fauci has said Trump did listen to health experts. On April 13, Fauci said that when he and Dr. Deborah Birx, the coordinator of the White House coronavirus task force, approached Trump about directing strong mitigation, the president’s response was, “Yes, we’ll do it.”", "In a Feb. 29 interview, Fauci said that “right now at this moment” the risk from the coronavirus was “low” and there was “no need” for people “to change anything that you’re doing on a day-by-day basis.” But he added that “this could change,” that people needed to be wary of “community spread,” and that it could develop into a “major outbreak.”", "In February and March, health experts such as Fauci and U.S. Surgeon General Dr. Jerome Adams were still telling the general public not to wear face masks. As late as March 30, the World Health Organization was recommending that healthy people should not wear masks. There was a concern among those health officials at that time that there would not be enough masks available for health care workers.", "However, as health officials learned more about the virus, and how often it was being transmitted by asymptomatic carriers, the CDC reversed course on April 3 and began recommending that people wear masks in public.", "We couldn’t find any instances of Biden “all the way back in March … calling for the need for us to have masks,” as he claimed.", "The Biden campaign noted that in a press call on March 20, Biden said that when staffers met with him in person, “We’re following CDC guidelines. People are coming in with masks on, wearing gloves.” And in an interview on March 24, CNN’s Tapper asked Biden how he was keeping himself safe, given that older people are more adversely affected by the coronavirus. Biden responded, in part, “I’m just following the instructions that — and anybody who walks into the house from the Secret Service on, they’re wearing masks and gloves.”", "But that’s not the same as a call for the general public to wear masks.", "The Biden camp also points to Biden’s repeated calls in late March for Trump to ramp up the Defense Production Act, and specifically mentioned masks as a critical need. But in those instances, Biden was calling for the need to increase the number of masks available to medical workers to treat those with COVID-19, not for mass public use.", "Fauci in late March said the coronavirus task force was discussing whether to advise all Americans to wear masks in public. In a press conference on March 30, Trump was asked about the possibility of such federal guidance, and he said, “We’re not going to be wearing masks forever, but it could be for a short period of time.” And as we said, the CDC made that recommendation several days later, on April 3.", "Although Biden was stretching the facts when he said he has advocated public mask-wearing “since this began,” he has been a strong advocate since health officials like those at the CDC began recommending it — standing in contrast to Trump, who on the day the CDC issued its guidance, announced, “I won’t be doing it personally. It’s a recommendation.”", "Two days later, on ABC’s “This Week” on April 5, Biden had a very different response when asked if he’d be wearing a mask in public.", "“Yes,” Biden said. “Look, I think it’s important to follow the science, listen to the experts, do what they tell you. It’s, you know, you may not look — he may not like how he looks in a mask, but the truth of the matter is that follow the science, that’s what they’re telling us.”", "And, of course, the stance taken by the political rivals has sharply contrasted since.", "On April 29, Biden tweeted, “Wear a mask in public.” And Biden wore a mask on May 25 in his first public appearance in two months. Since then, he has worn a mask in public appearances, and has not held in-person campaign rallies.", "By comparison, it wasn’t until July 20 that Trump tweeted a photo of himself wearing a mask. But he has remained inconsistent in his advocacy for mask-wearing. In the ABC News town hall on Sept. 15, Trump noted that health experts working for the government initially “talked about don’t wear masks, and now they say wear masks. Although some people say don’t wear masks.”", "Trump said that he wears a mask “when I have to and when I’m in hospitals and other locations.” But he added, “Now there is by the way, a lot of people don’t want to wear masks. There are a lot of people think that masks are not good.” Asked who, Trump gave the example of waiters.", "And, of course, Trump has held several rallies with no social distancing, and few attendees wearing masks — including two rallies that were held indoors.", "At an outdoor rally in Latrobe, Pennsylvania, in early September, Trump asked a densely packed, mostly mask-less audience if they knew “a man that likes a mask as much” as Biden.", "“It gives him a feeling of security,” the president said. “If I were a psychiatrist, right? I’d say, ‘This guy’s got some big issues.'”", "Editor’s Note: Please consider a donation to FactCheck.org. We do not accept advertising. We rely on grants and individual donations from people like you. Credit card donations may be made through our “Donate” page. If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, 202 S. 36th St., Philadelphia, PA 19104.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here for more.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]