["About this rating", "The Violence Against Women Act, which was due to expire on Sept. 30, 2018, was not renewed by Congress before a December 2018 deadline for reauthorization.", "However, The Violence Against Women Act was not allowed to expire through presidential inaction, and President Trump signed appropriations bills that included provisions to continue funding VAWA programs pending reauthorization of the act by Congress.", "In September 2018, with most political debate and news coverage focused on the controversial nomination of Judge Brett Kavanaugh to the U.S. Supreme Court, the U.S. Congress faced the prospect of allowing a major piece of legislation to expire.", "The Violence Against Women Act (VAWA) was first proposed by then-Senator Joe Biden in 1993 and signed into law in 1994. It provided significant federal funding for services offered to survivors of domestic and sexual violence, created the Office on Violence Against Women within the Justice Department, enhanced the training of law enforcement officers in the area of sexual and domestic violence, and strengthened penalties for certain sexual crimes, most notably requiring perpetrators of sexual violence to pay restitution to their victims.", "The act, which comprises several constitutive laws, has been reauthorized every few years since 1994 with adjustments and additions being made on each occasion, most notably in 2013 when -- after an unusually long party-line battle in Congress -- the protections and provisions in the VAWA were extended to same-sex couples.", "The act had been scheduled to expire on Sept. 30, 2018, prompting concerns that women, children, and men who are vulnerable to domestic and sexual violence would no longer be protected by the the funding, services and legal provisions associated with the VAWA.", "On Oct. 1, the Democratic candidate for New York attorney general, Tish James claimed on Twitter that President Donald Trump's administration had \"let the Violence Against Women Act expire without saying a word\":", "October is Domestic Violence Awareness month, and at midnight the Trump Admin let the Violence Against Women Act expire without saying a word. This law provides grants for law enforcement training, victim services & prevention efforts. We can’t forget this today—or in November.", "October is Domestic Violence Awareness month, and at midnight the Trump Admin let the Violence Against Women Act expire without saying a word.", "This law provides grants for law enforcement training, victim services & prevention efforts.", "We can’t forget this today—or in November.", "— Tish James (@TishJames) October 1, 2018", "James' claim was retweeted thousands of times and prompted inquiries from our readers about its veracity.", "In fact, the VAWA was not allowed to expire on Sept. 30, 2018, either by the Trump administration or members of Congress. James acknowledged this fact herself in a follow-up tweet in which she wrote:", "Republicans & the Trump Admin quietly passed a 2 month funding extension, shoehorned into a larger spending bill. That’s nothing more than kicking the can down the road. We need a real reauthorization that provides long-term protections AND expands the #VAWA.", "On Sept. 26, five days before James' tweet, the House of Representatives voted through House bill 6157, an appropriations bill which provided funding through the 2019 financial year for the Department of Defense and other government departments, as well as an eclectic mix of several smaller measures, including spending related to the VAWA. The relevant section of that bill read as follows: \"Any program, authority, or provision, including any pilot program, authorized under the Violence Against Women Reauthorization Act of 2013 shall continue in effect through the date specified in section 105(3) of this Act [7 December 2018.]\"", "On Sept. 28, President Trump signed H.R. 6157 into law, thus extending the provisions of the VAWA until Dec. 7. He did not mention the VAWA in either of his public statements about the appropriations bill.", "However, Congress failed to reauthorize the VAWA and it expired in December 2018. Another short-term spending bill extended the provisions of the act until Feb. 15, 2019, when it expired for a second time. Repeated attempts to reauthorize since then have failed. The American Bar Association reported in May 2019 that:", "On April 4, the House of Representatives passed The Violence Against Women Reauthorization Act of 2019 (H.R. 1585) by a vote of 263 – 158, with 33 Republicans joining Democrats in the affirmative. This bipartisan Act would extend VAWA for five years, and adds several provisions aimed at expanding the Act’s scope. One of the more controversial provisions includes extending the longstanding prohibition against gun possession for perpetrators of domestic violence, to include dating violence and stalking. Even though the authorization expired, VAWA programs are funded at their highest level ever at $559 million through this fiscal year. The House Appropriations Chair released their proposal for the FY 2020 appropriation which provides over $582 million for VAWA programs. If the House passes the proposal, this provision would still need Senate action.", "As of November, however, the reauthorization bill appeared dead in the water after bipartisan talks fell apart in the Senate. Roll Call reported that Sen. Jodi Ernst, R-Iowa, was set to introduce her own version of the bill, which she said would be able to pass the Republican-controlled Senate and gain President Trump's support.", "Biden Jr., Joseph R.   \"S.11 -- Violence Against Women Act of 1993.\"\r\n    U.S. Senate/Congressional Record.   21 January 1993.", "Henderson, Nia-Malika.   \"Obama Signs a Strengthened Violence Against Women Act.\"\r\n    The Washington Post.   7 March 2013.", "Granger, Kay.   \"House Bill 6157 -- Department of Defense and Labor, Health and Human Services, and Education Appropriations Act, 2019 and Continuing Appropriations Act, 2019.\"\r\n    U.S House of Representatives/Congressional Record.   28 September 2018.", "Trump, President Donald J.   \"Statement from the President on Signing of H.R. 6157.\"\r\n    The White House.  28 September 2018.", "Trump, President Donald J.   \"Signing Statement from President Donald J. Trump on H.R. 6157.\"\r\n    The White House.   28 September 2018.", "Jackson Lee, Rep. Sheila.   \"House Bill 6545 -- Violence Against Women Reauthorization Act of 2018.\"\r\n    U.S. House of Representatives/Congressional Record.   27 July 2018.", "Stefanik, Rep. Elise M.   \"House Bill 6976 -- Violence Against Women Extension Act of 2018.\"\r\n    U.S. House of Representatives/Congressional Record.   13 September 2018.", "Macagnone, Michael.   \"Senate Talks on Crafting Bipartisan Violence Against Women Act Break Down.\"\r\n   Roll Call.   7 November 2019.", "American Bar Association.   \"Violence Against Women Act Reauthorization Threatened.\"\r\n   16 May 2019.", "UPDATE [Jan. 7, 2020]: Updated with new information as of January 2020; status revised to \"Mixture.\"", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]