["Since December 20, several social media users have been posting an image of a sealed pack of a Pfizer coronavirus vaccine that says “Made in China”.", "Twitter user @anaamika_tiwari shared the viral image and wrote, “I will not take this “Made in China” Vaccine.” (archived link)", "I will not take this “Made in China” Vaccine.😡 pic.twitter.com/O6SvYjC7wa", "— Anamika Tiwari (@anaamika_tiwari) December 21, 2020", "Similarly, @rey_atl posted image and asked, “Why is the Pfizer Coronavirus vaccine MADE IN CHINA?” and added, “Perhaps this is photoshopped? Let me know.” (archived link)", "Perhaps this is photoshopped? Let me know. 👇 pic.twitter.com/PKkTM5zBPK", "— 🇺🇸Dr. Lowkey Rey🇺🇸 (@rey_atl) December 22, 2020", "@TwittcrSafety sarcastically wrote, “Sweet. Now I can vape my vaccine. What a time to be alive”, as the package also contained the following information — “1 ml, Single Dose, Vapourizer Cartridge”.", "Sweet. Now I can vape my vaccine. What a time to be alive. pic.twitter.com/hsmqMqQ0Mo", "— Twittеr Safety ➐ (@TwittcrSafety) December 20, 2020", "The viral image has been published by several news websites including Lokmat English, TFI Post, Siasat Daily and The India Print. Each of these reports, except the last, is attributed to IANS.", "This slideshow requires JavaScript.", "Several Facebook users also posted the viral image.", "If one notices carefully, the text below the Pfizer logo reads — Makers of “The Boner Pill”, which suggests that the image has been humorously made, as pointed out by Reuters as well.", "Alt News performed a reverse image search and found that the viral image was posted on Funny sub-Reddit forum but later removed by the moderators.", "The image has also been circulating on Twitter as a satirical post.", "i bet y’all would get the vaccine if it came like this pic.twitter.com/dLEL7FunD6", "— ed (@edxardo8) December 19, 2020", "Reuters contacted Pfizer who confirmed by email the vaporiser cartridge was fake.", "How is Pfizer’s vaccine administered?", "According to Pfizer’s product catalogue, the COVID-19 vaccine is called “Pfizer-BioNTech COVID-19 Vaccine (also known as BNT162b2)”. The product page also directs to two separate fact-sheets — 1) recipient and caregivers 2) healthcare providers administering vaccine. These documents were updated in December.", "As per the ‘healthcare providers administering’ vaccine fact-sheet, “The Pfizer-BioNTech COVID-19 Vaccine is a suspension for intramuscular injection administered as a series of two doses (0.3mL each) 3 weeks apart.”", "Thus the suggestion that Pfizer’s COVID-19 vaccine is a 1 ml single-dose vaporizer cartridge is false. United Kingdom National Health Service (NHS) also states, “The COVID-19 vaccine is given as an injection into your upper arm. It’s given as 2 doses, at least 21 days apart.”", "Is Pfizer’s vaccine manufactured in China?", "Pfizer has four manufacturing centres in China but none of them has been used to manufacture the coronavirus vaccine. The company has listed specific locations from where the vaccines will be shipped. These are a part of its U.S. and European manufacturing networks. The vaccines will be shipped from the following locations:", "1) Kalamazoo, US", "2) Puurs, Belgian", "3) Pleasant Prairie, US", "4) Karlsruhe, Germany", "Thus the image that allegedly shows a product with Pfizer’s brand was shared on the internet with the claim that COVID-19 vaccine has been manufactured in China. This image also misinforms about how the vaccine will be administered.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]