["About this rating", "This video was created from 1.8 billion pixel panoramic image made by the Mars Curiosity Rover in March 2020.", "However, this video does not feature audio recorded by the Perseverance Rover in February 2021.", "The source of the audio is undetermined. It's possible that the audio in this clip comes from seismic readings taken by NASA’s Mars InSight lander in April 2019.", "EDITOR'S NOTE: A few days after publication, NASA released genuine audio from the surface of Mars, which is included at the bottom of this article.", "On Feb. 18, 2021, NASA landed another rover, the Perseverance, on the surface of Mars. The day after this historic achievement, a video started circulating on social media that supposedly gave space enthusiasts their first-ever chance to hear what it sounds like on the surface of the red planet:", "This video, which racked up nearly 3 million views in a couple of hours, does not feature genuine audio captured by the Perseverance on the surface of Mars. As of this writing on Feb. 19, the Perseverance Rover has only sent back still images. The new Mars rover has not yet sent back any video or audio from the red planet.", "It appears that the above-displayed video was created from a 360-degree panoramic image that was created by Perseverance's predecessor, the Curiosity rover, in March 2020. NASA turned the Curiosity Rover’s \"1.8 Billion-Pixel Pano\" from the surface of Mars into a video that allowed people to drag the screen around in order to get a 360-degree view of Mars. Notice how various features of the Martian landscape in the above-displayed video, such as the Central Butte, the Upper portion of Mount Sharp, and the Vera Rubin Ridge, match up with this 360-degree image from the Mars Rover. You can also see the rover's tracks in both pieces of media.", "https://www.youtube.com/watch?v=0fva2pH41FM&feature=emb_title", "It's unclear where the audio comes from, but it does not come from the Perseverance Rover, as this media simply has not been released yet.", "The sound in this video is similar to a recording released by NASA in April 2019. That recording, made by NASA's InSight Lander, captured a \"Marsquake\" with a sensitive seismometer. You can listen to that recording here.", "While the InSight Lander's recording was certainly scientifically significant, it didn't capture true audio. The InSight Lander's recording was made with a seismometer, a tool that measures vibrations in the ground.", "Space.com reports that the Perseverance will be the first rover capable of capturing true audio from the surface of Mars, as it is equipped with two microphones:", "We're about to experience Mars in an entirely new way.", "NASA's Perseverance Mars rover will land on Thursday (Feb. 18), kicking off a pioneering surface mission that will hunt for signs of ancient life, collect and cache samples for future return to Earth, and demonstrate a Red Planet helicopter and other advanced exploration tech.", "Perseverance is also equipped with two microphones, which will break new ground as well. Past rovers have seen, touched, tasted and smelled Mars in their own robotic fashion, but none has yet captured true audio on the Red Planet.", "\"Having a sound of another planet is another way that we can start to realize that it feels familiar,\" Nina Lanza, team lead for space and planetary exploration at the U.S. Department of Energy's Los Alamos National Laboratory in New Mexico, told Space.com.", "If you're excited to hear noise from Mars, we recommend that you bookmark this page from NASA or follow the official Perseverance Rover Twitter account.", "A few days after this video went viral, NASA released genuine audio recorded on the surface of Mars. NASA reported:", "New video from NASA’s Mars 2020 Perseverance rover chronicles major milestones during the final minutes of its entry, descent, and landing (EDL) on the Red Planet on Feb. 18 as the spacecraft plummeted, parachuted, and rocketed toward the surface of Mars. A microphone on the rover also has provided the first audio recording of sounds from Mars.", "https://soundcloud.com/nasa/sets/sounds-from-mars", "Updated [26 February 2021]: Added genuine audio from NASA taken from the surface of Mars.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]