["About this rating", "Fox talk show personality Tucker Carlson said in an interview that he was unable to go to Washington, D.C., restaurants without being ridiculed.", "But a closer look through internet archives revealed the statement is outdated.", "The quote was widely reported after he gave a podcast interview in 2018; publications like The Hollywood Reporter, Daily Beast, and Business Insider ran with headlines such as, “Tucker Carlson says he 'can't really go to restaurants anymore' because people keep screaming profanities at him.”", "Tucker’s quote went viral again years later after Twitter user @WDC reports — a self-proclaimed fact-checker and investigative reporter — reintroduced Tucker’s inability to go out to eat without someone \"telling him he sucks.\" The post was shared on March 11, 2021. As of this writing, the tweet had been liked more than 55,300 times.", "Some history: In an interview on the conservative-leaning National Review podcast, \"The Jamie Weinstein Show,\" the host of Fox News' \"Tucker Carlson Tonight\" was interviewed to discuss his book, \"Ship of Fools: How a Selfish Ruling Class Is Bringing America to the Brink of Revolution.\" (Hour-long Episode 73 aired on Oct. 15, 2018, and is available for listening here.)", "Carlson began his interview by touting former U.S. President Donald Trump and commenting on U.S. foreign policy in the Middle East, before telling Weinstein that he can’t go out to eat in public without someone ruining his meal — but he never explicitly said that people tell him he “sucks.\"", "“I can’t really go to a lot of restaurants anymore because I get yelled at and I don't feel threatened, but having someone scream, 'F--- you!' at a restaurant, it just wrecks your meal,” Carlson said at the 58-minute mark.", "\"I don’t actually go to restaurants anymore. I go to one — I’m not going to tell you what it is because you go there too,” Carlson said to Weinstein.\" I go there because I love it and nobody hassles me. But I’m not a restaurant guy anymore. It’s sad. I can’t wait for this revolution to end so I can go out to dinner!”", "Because our investigation did not prove that Carlson commented on being harassed in public restaurants in 2021, we rate this quote as “Outdated.\"", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]