["On May 4, Finacial news website Moneycontrol.com quoted Nobel Laureate Abhijit Banjeree saying, “The real problem in the short run is that the weak UPA policies were embraced by the current govt”. The statement was quoted from his interview with Congress leader Rahul Gandhi on the economic impact of COVID-19 crisis. Last week, Gandhi interacted with Banerjee and former RBI governor Raghuram Rajan. Both individuals were reportedly consulted for Congress’s NYAY scheme, which the party had promised ahead of the Lok Sabha polls.", "Just In | Congress MP Rahul Gandhi talks to Nobel laureate Professor Abhijit Banerjee about the #economic impact of #COVID19.", "The real problem in the short run is that the weak UPA policies were embraced by the current govt: Professor Abhijit Banerjee. https://t.co/uzYkuKnFHs pic.twitter.com/XOBeNkOL0a", "— moneycontrol (@moneycontrolcom) May 5, 2020", "CNN News18 too quoted Banerjee saying that “weak UPA policies” were embraced by current BJP-led government.", "#NewsAlert – The real problem in the short run is that the weak UPA policies were embraced by the current govt: Nobel Laureate Abhijit Banerjee. pic.twitter.com/6lTBWdqoNq", "— CNNNews18 (@CNNnews18) May 5, 2020", "Since then, several users have quote-tweeted the tweet by Moneycontrol.com and mocked Gandhi. Rishi Bagree, who is followed by Prime Minister Narendra Modi, tweeted a screenshot of the tweet with the caption, “Mother of all Backfire.”", "Hours after posting the original tweet, Moneycontrol.com issued a clarification saying that they misrepresented Banerjee’s view. However, the original tweet has not yet been deleted.", "UPDATE: We misrepresented Prof #AbhijitBanerjee‘s views earlier.", "Here’s the FULL quote: “The real problem in the short run is that these policies, good policies, put in place by UPA are inadequate & this govt in a sense absolutely embraced them..”", "The error is deeply regretted. pic.twitter.com/YjBY8y3e7R", "— moneycontrol (@moneycontrolcom) May 5, 2020", "At 2:14 minutes in the interview, Gandhi starts by saying that he wants to discuss the impact of the lockdown and the subsequent economic devastation it has caused on the poor people.", "“So, one of the main things I wanted to discuss with you is the impact of COVID and the lockdown and the economic devastation on our poor people. And, how we should be thinking about it. I mean we’ve had in India for some time, a policy framework, particularly when we were in the UPA, of providing sort of a floor for poor people. MGNREGA, Right to Food etc. and now a lot of that work is going to sort of fall by the wayside because we have this disease come in, and millions and millions of people are going to fall back into poverty. This is something… How should one think about this?” questions Gandhi.", "To which Banerjee replied: “I think that these are kind of separable in my view. In the sense that I think the real problem in the very short run is that these I think more policies.. good policies put in place by the UPA are inadequate. And the government in a sense absolutely embraced them. I mean it was not that there was a particular partisan disagreement. That was very clear that the UPA instruments will be used for doing whatever it is. I think what is harder to wrap one’s head around is for what do you do about the people who are not covered by that. That is a lot of people. The migrants in particular.”", "In the next few minutes, Banerjee elaborates on what he meant by “inadequate” policies.", "“One of the ideas that was mooted I think in the last years of the UPA but also embraced by the current government was the idea that the Aadhaar would be made national and therefore would be used for PDS and other things. So, the Aadhaar based claims on PDS would be … you would be eligible for it wherever you are. That would have been wonderful to have that right now. We sort of looking back I would say that would have saved a lot of misery because I think a lot of people would have then gone to the local ration shop and said here is my Aadhaar. I am you know I am eligible for PDS, I am collecting PDS in Mumbai, even though my family resides in Malda or Darbhanga or whatever. That’s my claim and so I think the fact that didn’t happen means that there’s a bunch of people for whom there isn’t really a system. They aren’t eligible to MGNREGA because they are in Bombay there is no MGNREGA in Bombay…that they are not eligible for PDS because they are not actually residents. Part of the problem in the very short run is that the conceptualisation of the welfare structure was based on the idea that anybody who’s really not in where they are supposed to be is actually working and is earning an income and therefore we don’t have to worry about them. And that’s what has collapsed.”", "Simply put, Banerjee said the policies put in place by the UPA regime were good but are currently inadequate because they don’t cover a large section of the poor, migrants in particular. He elaborated how the migrants stuck in different parts of the country are facing problems in procuring ration through the Public Distribution System (PDS) as the infrastructure of Aadhaar is not being used for the same. Banerjee also explained how migrant workers are not eligible for rations in states where they are not residents.", "Moneycontrol.com and News18 misquoted economist Abhijit Banerjee. While the former has added a clarification (without deleting the erroneous tweet), News18 is yet to provide an explanation. The channel, however, tweeted another clip of their broadcast on the interview with a more accurate quote while failing to refer to the earlier misquote.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]