["About this rating", "Energy drinks such as Red Bull have long been dogged by rumors that they contain dangerous ingredients such as \"artificially manufactured stimulants,\" and in more recent years such rumors have taken a turn towards the bizarre with claims that various brands of energy drink include \"bull semen\" or \"bull sperm.\"  More outlandish versions of such rumors maintain that some entity such as the \"Longhorn Cattle Company\" performed tests on energy drinks and \"found in fact they do contain bull sperm.\"  (Why a livestock company would want to test commercial beverages for the presence of bull sperm remains unexplained.)", "The \"bull sperm\" rumor seems to stem from the fact that the Red Bull brand of energy drink includes taurine, an organic acid which, among other uses, is often added to infant milk formulas (because taurine is naturally present in breast milk).   The composition of that substance's name — \"taur\" being a Greek/Latin root for \"bull,\" and the \"-ine\" suffix denoting something derived from the preceding root — suggests to the casual observer that taurine is something made or excreted by a bull, possibly something like \"bull urine.\"  And of course  the brand name \"Red Bull\" ties the product to the image of a bull and connotations of the strong, powerful, potent life force that animal represents, so it doesn't seem like such a stretch that the drink might contain some type of \"vital essence\" taken from the animal itself.", "Although taurine is so named because it was first isolated from ox bile, it is actually found in the large intestines and tissues of many different animals, including humans. But the taurine used in Red Bull brand energy drink (and other foods) is not derived from bulls (or any other animal) at all: it's synthetically produced in laboratories.  Since at least 2010, Red Bull's online FAQ has addressed questions about the taurine used in their popular energy drink being made from bulls' testicles or derived from bull semen:", "Q: IS TAURINE MADE FROM BULLS' TESTICLES? IS TAURINE A DERIVATIVE OF BULLS' TESTICLES OR SEMEN?", "A: The taurine in Red Bull® Energy Drink is a purely synthetic substance produced by pharmaceutical companies and is not derived from animals or animal materials. All ingredients for Red Bull® Energy Drink are synthetically produced by pharmaceutical companies. This guarantees the highest quality.", "The relevant entry from Red Bull's current FAQ similarly notes that:", "Q: Is Taurine made from bull's testicles?", "A: Many people bet it comes from some delicate parts of the strongest and most potent bulls in the world, but the fact is that the taurine in Red Bull is produced synthetically to the highest quality standards.", "Allen, Arthur.   \"German Kids Are Bullish on a Wonder Drink.\"\r\n    Associated Press.   19 August 1994   (Business).", "Browne, Anthony and Nic Hopkins.   \"French Ban Can Clip Red Bull's Wings.\"\r\n    The [London] Times.   7 February 2004   (Home News, p. 7).", "Harris, S.E.   \"Red Bull.\"\r\n    The [London] Times.   21 February 2004   (Body & Soul, p. 18).", "Hunter, Lucy.   \"How Healthy are the High Energy Drinks?\"\r\n    [London] Daily Mail.   3 October 1995   (p. 39).", "Le Couteur, Penny and Jay Burreson.   Napoleon's Buttons.\r\n    Jeremy P. Tarcher/Putnam; New York, 2003.   ISBN 1-58542-220-7   (p. 264).", "O'Neill, Sean.   \"Red Bull Under Investigation After Link to Three Deaths.\"\r\n    The [London] Daily Telegraph.   13 July 2001   (p. 5).", "Stonehouse, David.   \"The Risks That Lurk in Extreme Drinks.\"\r\n    Ottawa Citizen.   15 March 2003   (p. A13).", "Belfast Telegraph.    \"Red Bull Drink Banned.\"\r\n    21 July 2001.", "The Irish Times.    \"Nectar of the Nineties.\"\r\n    2 February 1999   (p. 13).", "The Mirror.    \"Red Bull Drug Hoaxer Hunted.\"\r\n    30 March 2000.", "Reuters.   \"France Ends 12-Year Ban on Energy Drink Red Bull.\"\r\n    15 July 2008.", "Scotland on Sunday.   \"Red Bull Energy Drink.\"\r\n    20 March 1994.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]