["About this rating", "Four black people have been charged with breaking into the house of an elderly white woman and killing her.", "The intent of the break-in was apparently robbery rather than murder, there's no indication the killing was racially motivated, and news reports did not confirm the attackers were part of a \"gang.\"", "On 1 September 2016, the conservative click bait web site US Herald shared a story that claimed a grisly murder of an elderly white woman in Georgia was a racially motivated gang killing:", "The Black Lives Matter movement is quick to cry foul whenever black people appear to be stereotyped. But what about situations when all the facts point to gang-related activity that is clearly racial and occurs against whites? That was the case in Atlanta, Georgia several weeks ago when a black gang entered the home of an 83-year-old white woman.", "That woman, Dorothy Dow, was sleeping in bed when a gang of four black men and women entered her home, beat her and then set her on fire. Dow passed away in the hospital recently from complications from the attack. Her attackers are now being charged with murder.", "Dorothy Dow's grandson, Grant Dow, contacted us and confirmed the crime was not motivated by race, but that hasn't stopped a variety of blogs and web sites from claiming it was a case of reverse racism. As a result, Dow said that aside from dealing with his grandmother's death and the resulting criminal trial, he has been forced to try and battle the false narrative, going so far as having to personally convince a white supremacist group to cancel a planned rally in October 2016 over the murder. Grant Dow said the crime was a burglary: \"It had nothing to do with race. It just happened [the suspects] were black, and my grandmother happened to be white.\"", "Dow said he has the word of the white supremacist group, which the Newman Times-Herald identified as Georgia League of the South, that the October rally has been cancelled. He added that the issue has snowballed and gotten completely out of control, as groups rushed to align the story with their own political agendas:", "I don’t even know how they're making this leap, but they’re somehow turning it into a white lives/black lives matter thing, and support-your-police thing. I don’t know what our story has to with supporting or not supporting police. If anything, it’s a testament of how everything should work. The community pulled together, white, black, law enforcement from different jurisdictions pulled together. If anything this story is a testament to how every thing should work.", "Of course, US Herald didn't provide any evidence (other than the circumstances of the crime) documenting that the race of the victim and suspects was a factor in the killing, and local news reports didn't indicate any racial motivation was behind the attack. Instead, as Dow said, the motivation seemed to be theft, as the attackers apparently demanded money from the victim, then beat her, poured liquid on her, set her on fire, and left. Dorothy Dow initially survived the 4 August 2016 attack but succumbed to injuries three weeks later:", "Meriwether County Sheriff's Office officials said the suspects forced their way into her home, beat her, poured something on her and set her on fire.", "[Meriwether County Sheriff Chuck Smith] says one man started beating Dow with a gun, breaking several bones in her hand and forearm. She was then set on fire by another suspect. Dow crawled around on the floor of her home searching for a gallon of water she had near a breathing machine, eventually found it and then put the fire out. She then found her cell phone and dialed 911.", "\"With one hand broken and her arm broken in four places, she pulled the top off of a gallon of water, poured it over her head and put out the fire,\" said Dorothy's daughter-in-law Beth Dow. \"She then drug herself into the den on her broken arms to get to her cellphone to call 911. She said, 'I thought they were going to kill me'. They told her that she was never going to see her sons again.\"", "Dow reportedly told deputies 3-5 suspects, one of them possibly a woman, forced their way into her home demanding money. Authorities say it's believed a group of people who helped pick blueberries from the family's yard may be responsible for the attack.", "Dow had several surgeries due to her injuries which included broken bones and severe burns. She later passed away.", "A search on Facebook for the term \"Dorothy Dow\" reveals that multiple web sites are spinning the story. Freedom Daily wrote on 28 September 2016:", "Elderly Woman, Dorothy Dow, Beaten By Four Thugs Then Set On Fire... This is the REAL FACE OF HATE!", "And if a cop shot these thugs, they'd be SAINTS! People would riot and protests their deaths! WE NEED TO TAKE BACK OUR COUNTRY!", "The US Herald story also claimed the attackers were members of a \"gang,\" but there was also no mention of the suspects' membership in any organized gang in any of the news reports on the incident. The suspects, Justin Grady, 38, Cortavious Heard, 18, Mina Ellery, 17, and Angel Harmon, 17, are all being held without bond on charges of felony murder and malice murder. Grady had previously worked in the blueberry fields next to Dow's home and had helped the family during harvest seasons.", "While the Meriwether County Sheriff's Office did not wish to comment and the District Attorney's Office did not return our request for information, the charges brought against the suspects do not include hate crimes, which are defined as any offense committed due to \"perceived race, color, religion, or national origin of any person,\" according to federal law.", "Dow's assault and murder was no doubt horrifying and brutal, but no evidence suggested the attack was motivated by racial animus.", "Browne, Arthur.   \"83 Year-Old White Woman Beaten & Set on Fire by Black Gang, Where Are Cries of Racism?\"\r\n    US Herald.   1 September 2016.", "Atlanta Journal-Constitution.   \"Woman Beaten, Burned in Georgia Home Dies at 83.\"\r\n    29 August 2016.", "Meriwether County Sheriff.   \"Murder Charges Filed in the Forrest Road Investigation.\"\r\n    30 August 2016.", "WGCL-TV.   \"Murder Charges Filed Against 4 Suspects Charged in Elderly Woman's Beating Death.\"\r\n    24 September 2016.", "Bell, Kandice.   \"White-Pride Group Plans Grantville March.\"\r\n    The Newman Times-Herald.   18 September 2016.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]