["About this rating", "As a number of politicians, world leaders, and Arizonians mourned the passing of U.S. Senator John McCain on 25 August 2018, a certain sect of social media users redoubled their efforts to tarnish the legacy of the late lawmaker. An image purportedly showing McCain and Senator Lindsey Graham of South Carolina posing for a photograph with terrorist mastermind Osama bin Laden was widely spread on conspiracy forums and social media sites:", "A video posted to YouTube with a hashtag referencing #Qanon -- an unfounded right-wing conspiracy theory which frequently employs doctored photographs, unconnected coincidences, and illogical conclusions to claim that the investigation into Russian interference in U.S. elections is sham run by the \"deep state\" -- claimed that the photograph showed McCain, Graham, and bin Laden posing after a \"deep state fundraiser.\"", "This image, however, does not capture Graham and McCain posing with bin Laden, and it is not evidence of any sort of secret underhanded dealing. The original, undoctored photograph was taken in July 2013 and recorded the U.S. senators meeting with Hamid Karzai, the former president of Afghanistan:", "McCain and Graham visited troops in Afghanistan over 4th of July weekend in 2013, and the New York Daily News reported on the \"surprise\" visit at the time:", "John McCain is celebrating the red, white and blue with troops in Afghanistan.", "The Arizona pol may be eyeing the job of Secretary of State as he is racking up the frequent flier miles after recent trips to Syria, Guantanamo Bay and now a Mideast tour with fellow Republican Sen. Lindsey Graham.", "\"Our troops serving in #Afghanistan represent the best of America -- let's keep them in our prayers this 4th of July,\" McCain tweeted.", "McCain, who is a member of the Senate Armed Services Committee, and his fellow committee member Graham, who also serves on the Committee on Veterans' Affairs, met with Afghan President Hamid Karzai.", "The photograph of McCain, Graham, and Karzai was originally posted by the Arizona senator on Twitter:", "Senator @GrahamBlog and I met with President Karzai yesterday as well #Afghanistan pic.twitter.com/UgHTE4luZB", "— John McCain (@SenJohnMcCain) July 4, 2013", "A comparison of the genuine photograph of McCain, Graham and Karzai (left) with the doctored image of the U.S. senators and Osama bin Laden (right) shows that the terrorist leader's head was simply pasted atop the former Afghanistan president's body:", "Coaston, Jane.   \"#QAnon, The Scarily Popular Pro-Trump Conspiracy Theory, Explained.\"\r\n    Vox.   2 August 2018.", "Larson, Leslie.   \"Sens. John McCain and Lindsey Graham Make Surprise Stop to Afghanistan.\"\r\n    [New York] Daily News.   4 July 2013.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]