["About this rating", "In April 2017, rumors appeared on social media that former United States President Barack Obama had been arrested in Japan in connection with large quantities of cocaine purportedly found on his yacht:", "The arrest rumor appeared to have originated via a 31 March 2017 blog post from Benjamin Fulford (who days earlier had claimed that the Japanese government was trying to kill him) that was further aggregated by other dubious web sites:", "Former US President Barack Obama, in custody of the US military police, has informed on his drug dealing bosses, according to sources in Japanese military intelligence. As a result of this, an airplane filled with Afghan Heroin and North Korean amphetamines was impounded at Argyle International Airport on St. Vincent and the Grenadines in the Caribbean, the sources say. The money raised from this drug flight was intended to be used to finance the operations of Daesh (formerly known as ISIS), the sources say. This impoundment follows the capture of an Obama linked ship containing 4.2 tons of cocaine, the sources note.", "At the bottom of the post was a citation referencing a 15 March 2017 post on conspiracy site WhatDoesItMean.com about Barack Obama's supposedly fleeing the scene of a drug bust that took place in the Caribbean on a \"fishing vessel named the Lady Michelle\" that was linked to the former president:", "Obama Flees After Massive Drug Bust Aboard Lady Michelle Vessel In Caribbean", "An intriguing Foreign Intelligence Service (SVR) report circulating in the Kremlin today states that former President Barack Obama fled Washington D.C. this past Friday (10 March) traveling to New York City, Omaha (Nebraska), San Jose (California) and ending up in Hawaii — all occurring within 36 hours while he sought elite allies to defend him, and keeping him ahead of investigators from the Financial Crimes Enforcement Network (FinCEN) of the US Department of the Treasury (DoT) seeking to interview him about one of the largest drug busts in American history occurring in the Caribbean aboard a fishing vessel named the Lady Michelle.", "4.2 tons of seized cocaine, worth an estimated $125 million, from the President Barack Obama linked fishing vessel named Lady Michelle on 16 February 2017", "According to this report, nearly immediately upon taking office as President Donald Trump’s Attorney General on 9 February, Jeff Sessions, as head of the US Department of Justice (DOJ), was handed a top secret file by Federal Bureau of Investigation (FBI) Director James Comey detailing the nearly two-decade long crimes of 12 current and former security and intelligence officers belonging to the Transportation Safety Administration (TSA) who for at least 18 years under both the Bush and Obama regimes had smuggled into the United States at least $100 million worth of cocaine.", "None this was true, as the \"Obama drug bust\" story originated with the WhatDoesItMean.com is a fake news conspiracy site, described by RationalWiki as follows:", "Sorcha Faal is the alleged author of an ongoing series of \"reports\" published at WhatDoesItMean.com, whose work is of such quality that even other conspiracy nutters don't think much of it.", "Each report resembles a news story in its style but usually includes a sensational headline barely related to reality and quotes authoritative high-level Russian sources (such as the Russian Federal Security Service) to support its most outrageous claims. Except for the stuff attributed to unverifiable sources, the reports don't contain much original material. They are usually based on various news items from the mainstream media and/or whatever the clogosphere is currently hyperventilating about, with each item shoehorned into the conspiracy narrative the report is trying to establish.", "The image used to illustrate the WhatDoesItMean article was taken from an earlier news report about a 16 February 2017 U.S. Coast Guard drug bust off the coast of Suriname that had nothing to do with Barack Obama or Japan:", "The U.S. Coast Guard busted four men suspected of smuggling more than four tons of cocaine worth $125 million in the Atlantic Ocean.", "Officials said on Feb. 16 they intercepted a suspicious fishing boat off Paramaribo, Suriname.", "The 70-foot vessel was allegedly carrying numerous bales of cocaine, the Coast Guard said. Officials seized 4.2 tons of the drugs, worth an estimated $125 million in wholesale value.", "Kim LaCapria is a former writer for Snopes.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]