["Social activist Harsh Mander has continued to remain in the news for the second consecutive day after another video of a part of his speech was shared by members of the Bharatiya Janata Party (BJP) and its supporters. The speech has been used to allege that Mander instigated violence during protests against the Citizenship Amendment Act (CAA). Filmmaker Ashoke Pandit shared the video and wrote, “This white collared paid terrorist #HarshMander wants war on the streets.”", "This white collared paid terrorist #HarshMander wants war on the streets. Send him to #UP. @myogiadityanath will fulfill his dreams .@Uppolice #ArrestHarshMander pic.twitter.com/iY0NZEV0PK", "— Ashoke Pandit (@ashokepandit) March 4, 2020", "Mander had reportedly filed a petition in the Supreme Court against BJP leaders who made provocative speeches ahead of communal riots in Delhi. The top court, however, based on an affidavit filed by DCP Delhi (Legal), has refused to hear the activist’s case until the matter of his alleged “derogatory” remarks against the SC is sorted. The affidavit filed by the police officer also claimed that Mander instigated violence during anti-CAA protests.", "In the video shared by Pandit, and BJP IT cell head Amit Malviya, Mander can be heard saying, “I think they have failed India’s minorities in recent months and years over and over again – in their Ayodhya judgement, in how they responded to Kashmir, on how they responded to habeas corpus petitions on Kashmir, on how they responded to petitions about students being beaten up in Aligarh and Jamia. So we will approach the Supreme Court. I don’t think this issue is going to be decided by was it a reasonable classification, was it not a reasonable classification…it’s not a question of legalese that is at stake at this moment as all of us have been clear about. The third place it is going to get resolved is I think on the streets. And the battle is being fought and fought in ways that are inspiring…” – the clip is stopped in the middle of this statement.", "Another video of Harsh Mander surfaces where he can be seen heaping scorn on the Supreme Court for failing India’s minorities, just because some of the verdicts were not to his liking, and clearly exhorting people to take to streets to ‘resolve’ issues… Dangerously provocative. pic.twitter.com/AD0FE3Ldqy", "— Amit Malviya (@amitmalviya) March 5, 2020", "Several others who shared the video were – national in-charge of social media, BJP Mahila Morcha, Priti Gandhi; Director, Dr Syama Prasad Mookerjee Research Foundation, Dr Anirban Ganguly; Twitter users Girish S and Ritu Rathaur who are followed by BJP leaders; and Jammu-Kashmir Now.", "The viral video is a small part of a press conference addressed by Harsh Mander earlier in January 2020 where he spoke of the dangers of CAA, the National Register of Citizens (NRC) and the National Population Register (NPR). The video of the full address was uploaded by Karwan e Mohabbat on January 3. Criticising political parties that have failed to show moral conviction against the NRC, at 1:10 minutes Mander said, “Given the record that they’ve had so far, I do not think that we can have faith that these issues can be resolved in the Parliament.”", "Right after the above statement, he begins to speak about the judiciary at 2:10 minutes, “Now where is the second place where it can be resolved? That is in our higher courts and we must approach them, we must approach the Supreme Court. I am one of the many petitioners who has challenged the CAA but I would like to say again very clearly that the working of the Supreme Court in recent years – and it’s important for a majority in a democracy to not turn majoritarian – the Supreme Court has a very important role, the judiciary has a very important role – and I think they have failed India’s minorities…” The viral video starts after this statement.", "Further into the speech, at 3:28 minutes, he says, “The third place where it is going to get resolved I think is on the streets and the battle is being fought and fought in ways that are inspiring for all of us. But I think there is a fourth place where this battle is going to be resolved and this is in my and your hearts because in the end, it is if we have allowed hatred against people based on their identities to be colonised in our hearts in ways that have been the project of the ruling establishment in the last five or six years. And ultimately I think it is going to be resolved as I said not in Parliament, not in the courts, not even on the streets, but in our hearts – and that’s where I think this battle has to most of all be fought.”", "Therefore, 45 seconds were clipped out of Harsh Mander’s complete speech and presented on social media as if he instigated violence. The social activist, however, was referring to protests and said that issues can only be resolved if citizens do not allow hate to colonise their hearts. Alt News had earlier fact-checked another video which was clipped to falsely project Mander as promoting violence.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]