["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Editor’s note: After receiving reader feedback on this rating, we expanded the \"our ruling\" section on April 21, 2014, to more fully explain our reasoning for the rating.", "Secretary of State John Kerry spoke from Geneva on Thursday with appalling news about religious intolerance in the Ukrainian-Russian crisis.", "\"In the last couple of days, notices were sent to Jews in one city indicating that they had to identify themselves as Jews,\" Kerry said. \"In the year 2014, after all of the miles traveled and all of the journey of history, this is not just intolerable; it's grotesque.\"", "On Facebook and Twitter, the public feared the history of the Holocaust was repeating itself.", "At PolitiFact, we’re used to finding inconsistencies in media coverage of Ukraine, so we wanted to take a closer look at the situation. We found that Ukrainian Jews are not being forced to register.", "The story seems to have originated in Donetsk, a region and a city in eastern Ukraine. On April 7, pro-Russian activists took control of Donetsk’s government building. Almost two weeks later, USA Today reported, \"Leaflet tells Jews to register in East Ukraine.\"", "Citing an Israeli news article, USA Today reported that Jews emerging from a synagogue in Donetsk on April 14 were handed pamphlets asking them to \"register\" with pro-Russian militants. If Jewish adults refused to register and pay a $50 fee, they’d be forced out of the country.", "On the same day the story appeared, Kerry mentioned the notice in his speech. We reached out to Kerry's office for evidence, but they pointed us back to his remarks.", "Almost immediately, there were signs that the fliers weren’t really coming from any kind of authority.", "The separatist whose signature allegedly appears on the flier -- Donetsk People’s Republic Chairman Denis Pushilin, leader of the pro-Russian militants -- denied any connection to it.", "Reporters on the ground quickly found that no one was actually being registered.", "PolitiFact exchanged emails with Ari Shapiro, an NPR international correspondent reporting from Donetsk, who said there is a real flier, but it went ignored until the media caught on. Shapiro himself went after the story and shared his reporting with us.", "\"You walk down the street with a beard and kippah,\" said Yaguda Kellerman, deputy chief of the Donetsk Jewish Community Center, to Shapiro. \"And you never experience any problems here. I was born in Donetsk.\"", "Donetsk chief rabbi Pinchas Vishedski acknowledged the flier’s existence, but called it a provocation, Shapiro reported. U.S. media outlets like Vox and the New Republic have also questioned its validity. A New York Times report from Donetsk said that militants never intended to set up a registry, and the room designated for registering Jews sat empty Thursday.", "Both sides -- pro-Ukrainian and pro-Russian -- have accused each other of anti-Semitism during this conflict.", "An April 15 United Nations report noted that the Association of Jewish Organisations and Communities of Ukraine has said incidents are isolated and that Jewish people, generally speaking, don’t feel threatened by Ukrainian leaders.", "The pro-Russia rebels have since put out their own flier attacking the original anti-Semitism accusations, Shapiro reported.", "Our ruling", "Kerry said Ukrainian Jews are being asked to register. There was a flier, but it doesn’t seem to have been issued by any authority. No one knows yet who distributed them, but the separatist movement denies issuing the fliers. Jewish community leaders in the area have denounced the pamphlets’ legitimacy. Reporters on the ground in Donetsk say that the fliers aren’t being taken seriously, and no Jews are registering.", "Kerry’s comments included none of that context. It’s possible Kerry’s comments were drawn from what he considered to be legitimate news reports, but those earlier reports didn’t include the full picture of what was going on. Anyone listening to Kerry’s remarks would think that the requests were coming from some sort of authority on the ground that had the means to enforce its request, and that’s not the case. Kerry’s remarks did not accurately convey the situation on the ground in Ukraine. For these reasons, we rate his statement False.", "Email interview with Ari Shapiro, NPR international correspondent, April 18, 2014", "U.S. State Department, Remarks With EU High Representative Catherine Ashton After Their Meeting, April 17, 2014", "NPR, Leaflets Given To Donetsk Jews Made Waves Worldwide, But Not In Donetsk, April 18, 2014", "New Republic, \"Ukraine is not ordering its Jews to register,\" April 17, 2014", "New York Times, \"Demands that Jews register in Eastern Ukraine are denounced, and denied,\" April 17, 2014", "NPR, Ari Shapiro’s Donetsk reporting, April 18, 2014", "Phone interview with Pooja Jhunjhunwala, Department of State spokeswoman, April 18, 2014", "Snopes, \"Jews ordered to register in Ukraine,\" April 17, 2014", "United Nations Human Rights, \"Report on the human rights situation in Ukraine,\" April 15, 2014", "USA Today, \"Leaflet tells Jews to register in East Ukraine,\" April 17, 2014", "Vox, \"What we know about the pro-Russian flier threatening to round up Ukrainian Jews,\" April 17, 2014", "Washington Post, \"Diplomats reach deal on defusing Ukraine crisis,\" April 17, 2014", "Washington Post, \"What we know about the ‘grotesque’ leaflet handed out to Jews in Donetsk,\" April 17, 2014", "Ynet News, \"Donetsk leaflet: Jews must register or face deportation,\" April 16, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]