["About this rating", "Lions and zebras generally don't coexist completely peacefully in the wild. Photographs and videos of these animals together in the plains of Africa frequently depict stalking, hunting, chasing, fighting, and, of course, eating behaviors. That's probably why an image purportedly showing a lion and zebra sharing a moment of peace together at a watering hole is frequently shared with comments such as \"unbelievable but true!\":", "This image has been shared with a variety of captions over the years, such as \"It's not eating time,\" \"Alex and Marty\" (a reference to the animated zebra-lion friendship in the movie Madagascar), \"National Geographic: Behind the Scenes,\" and \"Morning Sam\" (a reference to an old cartoon in which Ralph E. Wolf and Sam Sheepdog put their feud on hold when they clock out of work for the day):", "This picture however, is not an accurate representation of a lion and a zebra enjoying a moment at a watering hole. This image was digitally created for a 2010 advertisement for Traveler's Insurance.", "The general conceit of the advertisement was that while animals would normally be skittish at a watering hole (as predators might be nearby), Traveler's insurance company could \"take the scary out of life\" so that customers might enjoy the world in peace.", "Here's the description for the advertisement via Coloribus:", "This commercial featuring baboons, lions, zebras, crocodiles, vultures and all sorts of other animals getting along famously at what would normally be a very dangerous watering hole, is the first spot in the new 'Take the scary out of life' campaign from Travelers Insurance.", "The viral image may look genuine when it is viewed on its own, but in the context of the commercial (where it can be glimpsed around the 10-second mark) it's more clear the representation was created with the aid of digital editing:", "Not only is this image a fabricated one, but the idea that watering holes serve as neutral safe-spaces for thirsty animals doesn't appear to be backed by much evidence. This idea most likely originated with, or at least was popularized by, a passage from Rudyard Kipling's The Second Jungle Book in which he described a \"water truce\" during a severe drought:", "By the Law of the Jungle it is death to kill at the drinking-places when once the Water Truce has been declared. The reason of this is that drinking comes before eating. Every one in the Jungle can scramble along somehow when only game is scarce; but water is water, and when there is but one source of supply, all hunting stops while the Jungle People go there for their needs. In good seasons, when water was plentiful, those who came down to drink at the Waingunga — or anywhere else, for that matter — did so at the risk of their lives, and that risk made no small part of the fascination of the night’s doings.", "This water truce played a part in Disney's live-action remake of the Jungle Book, released in 2016:", "Lions sometimes won't attack typical prey animals for various reasons (e.g., they're severely outnumbered; they can't match the speed of the prey without first sneaking up on it), but if a lion is hungry, the concept of a waterhole \"truce\" isn't going to stop it.", "A 2013 study about the predatory habits of a group of lions in Zimbabwe's Hwange National Park found that the felines frequently hunted near watering holes, especially when resources were scarce, as such sites are frequented by a variety of prey:", "Lion kills were located in a preferentially selected “zone” around artificial waterholes, suggesting that these scarce resources form passive traps for ungulate prey. Lions are stalk-and-ambush hunters that use vegetative cover for concealment during hunting and are known to ambush prey in habitats surrounding high-prey abundance areas. In the Hwange ecosystem, lion habitat selection and movements are driven by waterholes and lions appear to rotate their hunting behaviour between these different hunting grounds. Water sources are also considered crucial in lion habitat selection in the Serengeti and thought to act as passive traps for ungulates in the Kruger ecosystem. Contrary to our predictions, areas close to waterholes were highly selected for kills regardless of seasonal conditions.", "Conway-Smith, Erin.   \"South Africa's Drought Is Bad for Hippos, Great for Lions.\"\r\n    USA Today.   3 February 2016.", "Kipling, Rudyard.   The Second Jungle Book.\r\n    New York: Century, 1899.", "Davidson, Zeke.   \"Seasonal Diet and Prey Preference of the African Lion in a Waterhole-Driven Semi-Arid Savanna.\"\r\n    Plos One.   6 February 2013.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]