["About this rating", "In 2020, the Pinterest post displayed below alleged Ruby Tuesday was going out of business before the end of the year. The post linked to a 50-page article on the website Money Pop with the headline, \"These Restaurant Chains Are Turning Off Their Burners And Closing Up Shop.\"", "The social media post and article headline were misleading.", "The COVID-19 pandemic had indeed forced Ruby Tuesday to file for bankruptcy protection and close 185 branches nationwide as of fall 2020, according to court records obtained by Snopes and news reports.", "“This announcement does not mean ‘Goodbye, Ruby Tuesday’,\" CEO Shawn Lederman said in an Oct. 7 statement at the time.", "Another statement from the business at the time of the bankruptcy filing said it was \"pursuing a comprehensive financial and operational restructuring\" to reduce debt and that it intended to overcome bankruptcy status \"as quickly as possible.\"", "Despite the site closures, more than 230 company-owned locations remained open in addition to an undisclosed amount of branches run by 10 franchise groups, according to USA Today. No evidence showed a significant change in those numbers between the date of Ruby Tuesday's filing with the U.S. Bankruptcy Court for the District of Delaware and the publication of this report.", "In addition to Ruby Tuesday, the Money Pop listicle erroneously made it seem as if Taco Bell was closing in 2020 (see our fact check here), along with numerous other food businesses that were still serving customers as of this report.", "We should note here that, although the headline on the Money Pop was false, the text on the article appeared rooted in truth, reading:", "Like Friendly’s, Ruby Tuesday is an East Coast chain, but this restaurant has some branches on the Pacific Coast, too. The restaurant was founded in 1972 in Knoxville, Tennessee, and has seen some major dips in revenue over the past few years. Which, unfortunately, has resulted in many of the restaurants closing.", "At last count, the chain has around 491 stores around the world. But according to Restaurant Business, that number is due to nearly 50% of the stores closing over the past ten years. They said it was because customers were enjoying the convenience of take-out instead of actually sitting down in a restaurant.", "In sum, while the pandemic had negatively impacted Ruby Tuesday, and it was true that the chain had closed numerous sites in 2020, the Money Pop headline was inaccurate to claim all locations were \"turning off their burners and closing up shop\" or that the restaurant chain was going out of business.", "Jessica Lee is Snopes' Senior Assignments Editor with expertise in investigative storytelling, media literacy advocacy and digital audience engagement.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]