["Social media users are sharing a doctored image that purports to show a CNN graphic that called the Boulder, Colorado, shooting suspect \"morally white.\"", "“INVESTIGATION: SHOOTER WAS FACTUALLY ARAB, BUT MORALLY WHITE,” reads an altered CNN graphic.", "Ahmad Al Aliwi Alissa, 21, is accused in the March 22 shooting rampage that left 10 people dead at a King Soopers market in Boulder.", "The altered graphic appears below an image of CNN journalists Brooke Baldwin and Lucy Kafanov.", "Fact check:Colorado mass shooting is not a 'false flag' as conspiracy theory claims", "The meme, posted to Facebook March 24, has more than 1,000 shares. USA TODAY reached out to several accounts that posted the meme for comment.", "The same image appeared in a March 23 article by the satirical website The Babylon Bee. Since then, the altered image has spread across platforms without disclosure that it is doctored.", "Fact check:Texas' 'Operation Lone Star' isn't finishing border wall construction", "The Babylon Bee did not respond to USA TODAY’s request for comment.", "Matt Dornic, head of strategic communications for CNN Worldwide, confirmed in an email to USA TODAY that the image was doctored.", "“It’s yet another fake and offensive image circulating on social media. CNN never aired that chyron,” he wrote.", "Fact check:Viral photo of youth migrant detention center without masks is from 2014", "CNN’s actual report with Baldwin and Kafanov on the Boulder shooting demonstrates the graphic was altered. The March 23 report is available on YouTube. The image used in the meme has a timestamp of 1:01 PM MT.", "The graphic CNN displayed at that time read, \"COLORADO SHOOTING SUSPECT BOOKED INTO JAIL TODAY.\"", "USA TODAY examined the full report and confirmed that the graphic seen in the meme was never displayed by CNN.", "A widely shared image of a purported CNN report with a graphic that calls the Boulder, Colorado, suspect \"morally white\" is ALTERED. The original CNN report and a company spokesperson confirm that the image has been doctored.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook."]