["About this rating", "The \"satirical\" web site Ladies of Liberty attempted to drum up religious and ethnic hatred with a fabricated story published on 10 December 2017:", "82-year-old William DeLisle of Marina Del Ray, California, has been sentenced to death for defending himself against a life-threatening situation. In October of 2015, DeLisle was walking home from the local senior center when he was ambushed by a pair of young Muslims.", "...Prosecutors said that because the two men were unarmed and using threats instead of actually hurting DeLisle meant that there was no imminent danger and that the use of deadly force was “extreme and unnecessary\"... Religious persecution? How much you want to bet if the tables were turned and an elderly Muslim killed two Christian men trying to mug him he’d get a medal from the Governor of California?", "We found no mention of a \"William DeLisle,\" \"Abdi Nadjeer Hallalla\" or \"Mustif Salabu\" in any corroborating news report. The photograph included in the article actually shows Marshall Dion, who was convicted in Boston on drug trafficking and money laundering charges, and sentenced to 10 years in prison in 2016.", "Nor were there any reports of Muslim men attacking elderly Christians. The article is a cynical attempt to capitalize on fear and religious hatred.", "One clue that the article is fake is the claim that DeLisle \"stormed the beach at Normandy as a young man.\" He would have to have been a very young man indeed, given that the D-Day landings took place 73 years ago - when \"William DeLisle\" was just nine years old.", "Like everything published by Ladies of Liberty, this article is fabricated. A disclaimer on the website reads:", "Everything on this website is fiction. It is not a lie and it is not fake news because it is not real. If you believe that it is real, you should have your head examined. Any similarities between this site’s pure fantasy and actual people, places, and events are purely coincidental and all images should be considered altered and satirical.", "The site appears to be affiliated with a network of fake news and satire web sites run by Christopher Blair, who uses a number of pseudonyms and is behind the Last Line of Defense, FreedumJunkshun and Reagan Was Right, among other web sites.", "Associated Press.  \"80-Year-Old Man Who Ran Massive Pot Operation Gets 10 Years in Prison.\"\r\n  New York Daily News.  22 March 2016.", "Palma, Bethania.  \"Fake News Purveyors Apologize for 'Satire' Story Calling Fallen Soldier a Deserter.\"\r\n  Snopes.com.  30 October 2017.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]