["Screenshots of tweets from a Twitter account with the name Asif Khan and Twitter id @MdAsif35534489 went viral on June 4. The account, which has now either been deleted or deactivated, posted tweets that were hateful and provocative in nature. The account in its bio claimed to be employed with Indian airline GoAir as a cabin crew. Several Twitter accounts – BALA (@erbmjha), Ramesh Solanki (@Rajput_Ramesh) and Sonam Mahajan (@AsYouNotWish) – tagged the GoAir official Twitter account and demanded action to be taken against the said person if he indeed is an employee of the company.", "Late afternoon on June 4, GoAir reacted to this issue through their official Twitter account and stated that they are inquiring if the said person is their employee or not.", "pic.twitter.com/49CV0NwPUs", "— GoAir (@goairlinesindia) June 4, 2020", "At 9:43 pm on the same day, within 7 hours of the above tweet, GoAir tweeted again on this issue and stated that they have terminated the employment contract of trainee first officer Asif Khan.", "pic.twitter.com/qeXP4TpaVY", "— GoAir (@goairlinesindia) June 4, 2020", "This development was reported by news organisations such as News18, OneIndia and right-wing portals Swarajya, OpIndia and MyNation.", "Asif Iqbal Khan whose employment contract was terminated by GoAir on account of the viral tweets took to Facebook to tell his side of the story. In his Facebook post, he narrated how he had been falsely targeted. He denied any association with Twitter account @MdAsif35534489 and the hateful posts. “I have been getting death threats, abusive hate messages, my mother and sister threatened with rape, all because of mistaken identity and because a guy with the same name as mine had abused Holy Hindu God’s,” he wrote.", "Khan also stated that he’s filed a formal police complaint and is willing to completely co-operate in the investigation, “My only request is to please investigate this matter fairly and swiftly because this whole matter has put a huge stress on me and my family especially my dad who is very ill at this moment. I trust our Judicial System and I trust my company GoAir to deal with this matter swiftly and sensitively.”", "Khan posted a screenshot of his personal Twitter account @FarOutAsif.", "GoAir’s reaction on this issue is shocking because even the most basic investigation would have revealed that they’re possibly firing the wrong person.", "Alt News was able to locate GoAir employee Asif Iqbal Khan’s Instagram account. We compared a photo retrieved from the account with the profile image of the alleged imposter account on Twitter. It is clear that the faces of the two individuals do not match.", "Further, the GoAir employee sports a beard in every picture of his dating back to about five years, while the person in the alleged imposter account is clean-shaven.", "Using Wayback Machine which archives selective web pages around the world, Alt News was able to retrieve certain old tweets posted by the alleged imposter account @MdAsif35534489. In one of the retrieved tweets, the account had posted the picture of an individual in Qatar airways uniform and claimed that the Qatar airways employee is his older brother.", "We have blurred out the face in order to protect the identity of the said individual whose picture was used without his permission. We were able to get in touch with the Qatar airways employee and sent him the profile image used by the alleged imposter account. He informed Alt News that the person representing the imposter account is not his brother. We are concealing the identity of the Qatar airways employee at his request.", "In the tweet concerning the Qatar employee, the following observations can be made.", "The behaviour seen in the above tweet is typical of those who create accounts to earn a quick buck by trending Twitter hashtags. It is a common practice on Twitter for accounts to impersonate other individuals and trend hashtags and is a source of income for many Twitter users. We found many such tweets put out by this account, using Wayback Machine, which shows repeated behaviour (1, 2, 3). These were tweeted over a span of several weeks.", "In conclusion, even a basic investigation would have thrown up enough reasons for GoAir to institute a longer investigation, and not terminate the employment of their pilot in a matter of seven hours. The account with offensive tweets shows all traits of an imposter account created to make money by trending hashtags. It is unlikely that an airline pilot would need a source of income through trending hashtags.", "Hashtag trending is a full-time profession for many on Twitter, and anonymous accounts impersonating others in order to gain followers is a common practice. The same anonymous accounts are often a source of hate and misinformation. Even after years of this practice where anonymous accounts have caused untold misery for real people, Twitter is yet to find a way around this issue.", "[Update: GoAir has now revoked the termination of Asif Iqbal Khan and he is suspended pending investigation.]", "Donate Now", "Co-Founder Alt News, I can be reached via E-mail at [email protected] and on Facebook at https://fb.com/freethinker.", "Follow @free_thinker", "A purported video of a Muslim man beating a temple priest with a bat is…", "A picture depicting the Pakistani flag apparently bigger in size and apparently placed higher than…", "Amid the ongoing war between Israel and Hamas, a video of a fleet of cars…", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…"]