["In this July 9, 2019 photo, immigrant children line up in the dining hall at the Carrizo Springs, Texas facility. (AP)", "The children in federal care were not separated from their parents; they arrived unaccompanied.", "Conservative pundit Glenn Beck wrongly claimed on Twitter that President Joe Biden’s administration was doing the same thing that the Trump administration was rebuked for: separating families at the southwest border.", "Here’s what Beck tweeted Feb. 23:", "\"Just for the record, the Biden Administration IS separating children and parents, and building trailer park cages to hold those children. Where is the outrage from the left. We will interpret your silence as confirmation you never actually cared about kids ‘in cages.’\"", "Just for the record, the Biden Administration IS separating children and parents, and building trailer park cages to hold those children. Where is the outrage from the left. We will interpret your silence as confirmation you never actually cared about kids ‘in cages.’ @AOC https://t.co/gHFse4ZGfX", "Beck’s tweet tagged Rep. Alexandria Ocasio-Cortez, D-N.Y., who spoke out against the family separations during the Trump administration. It also included a link to a Washington Post story — which did not report what Beck claimed.", "An increasing number of unaccompanied children are arriving at the southern border and being put in temporary custody. From October to January, U.S. Border Patrol reported encounters with about 20,000 unaccompanied children at the southern border. For context, there were about 33,000 such encounters from Oct. 1, 2019, through Sept. 30, 2020.", "Typically, children are placed in state-licensed shelters. But due to space constraints at shelters during the coronavirus pandemic, the Biden administration has begun placing some of these children at a temporary facility in Texas. That decision has been criticized by immigrant advocates and people in Biden’s party who say that such temporary facilities are not suitable.", "Beck’s tweet was wrong on a major point: These children were not separated from their parents at the border. They arrived alone.", "Biden’s administration rescinded the Trump-era policy that led to systematic family separations. He established a task force to reunite families that were separated under the Trump administration.", "PolitiFact reached out to Beck through his website and Twitter but did not hear back.", "Children who arrive at the border without a parent or legal guardian are referred to the Office of Refugee Resettlement, part of U.S. Health and Human Services. That office is responsible for their temporary care until they are placed with a sponsor, who is usually a parent or close relative in the U.S.", "HHS reopened a temporary facility in Carrizo Springs, Texas, to respond to the influx of unaccompanied children and comply with COVID-19 mitigation strategies, such as social distancing. (That site was also used for about a month in mid 2019.)", "The Washington Post story that Beck cited was about this facility, which is housing children ages 13 to 17.", "\"Youth who have traveled to the U.S. alone are being placed in this shelter while case managers can locate family or sponsors in the U.S.,\" says a sign outside the facility.", "Both Amnesty International USA and Kids in Need of Defense, an advocacy group for unaccompanied migrant and refugee children in the U.S., urged the Biden administration to move children out of the temporary facility and into the homes of vetted sponsors or licensed shelters. \"Temporary facilities are an imperfect stopgap solution,\" said Denise Bell, a researcher for refugee and migrant rights at Amnesty International USA.", "Beck’s tweet said that children were being held in \"trailer park cages,\" and he cited a Washington Post tweet that had a picture of portable buildings, or trailers.", "HHS told PolitiFact that the structures depicted are \"portable offices equipped with air conditioning, paneling, tile flooring, table and chairs, telephones, computers and video conferencing capability.\" The portable offices are used by attorneys and mental health clinicians providing services to minors, HHS said.", "According to HHS, the Carrizo Springs facility has \"soft-sided structures'' — rigid frame structures with a canvas-like covering — used in areas for taking in children when they arrive, dining and indoor recreation, and serious health care needs. Dorms, classrooms, health care clinics, the barbershop and hair salon are inside buildings, HHS said.", "Beck said, \"Just for the record, the Biden Administration IS separating children and parents.\"", "Beck linked to a Washington Post article that does not corroborate his claims about family separations. Immigrant rights groups and the federal agency that takes temporary custody of immigrant children said that they were not separated from their parents, they arrived unaccompanied.", "We rate Beck’s claim False.", "Twitter, @GlennBeck tweet, Feb. 23, 2021", "Washington Post, First migrant facility for children opens under Biden, Feb. 22, 2021", "HHS.gov, Carrizo Springs Influx Care Facility, Feb. 22, 2021", "WhiteHouse.gov, Press Briefing by Press Secretary Jen Psaki, February 23, 2021", "CBP.gov, Southwest Land Border Encounters", "Email interview, HHS’ Administration for Children and Families, Feb. 23-25, 2021", "Facebook post, Facebook post, Feb. 24, 2021", "PolitiFact, Joe Biden’s plan to reunify families separated at the U.S.-Mexico border under Trump, Feb. 15, 2021; Biden fulfills promise to end Trump policy that led to family separations, Jan. 27, 2021", "Email interview, Amnesty International USA press office, Feb. 23, 2021", "Email interview, Kids in Need of Defense press office, Feb. 24, 2021", "Getty Images, Carrizo Springs, Texas facility, Washington Post photo caption; photo of sign at Carrizo Springs, Texas facility", "Twitter, @AZCentral tweet, May 27, 2018", "Washington Post, Three dozen migrants with flu virus quarantined at Texas processing facility, May 22, 2019", "Twitter, @WashingtonPost tweet, Feb. 22, 2021", "Mobile Mini website", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]