["About this rating", "On 19 January 2018, amidst allegations that President Donald Trump's lawyer had made a confidential $130,000 payment to porn actress Stormy Daniels to keep quiet about an affair she'd had with Trump several years earlier, the Babylon Bee published an article reporting that televangelist Jim Bakker had proclaimed Trump's time with Ms. Daniels had been spent not engaging in sexual intercourse, but merely \"sharing with her the good news of Jesus Christ\":", "BLUE EYE, MO—Squashing accusations that President Trump had a sexual encounter with porn star \"Stormy Daniels\" while he was married to Melania, televangelist Jim Bakker explained to his audience Friday that he had confirmed that Trump was merely scheduling private time with the woman in a hotel suite in order to share with her the good news of Jesus Christ, as he had become acquainted with her and was very concerned that she was not a Christian.", "\"It is preposterous to assert that a virtuous believer like Mr. Trump would cheat on his beautiful wife so callously, and while their child was only months old,\" a solemn Bakker said into the camera as colorful balloons provided a backdrop for some reason. \"He was so concerned with the eternal state of Miss Daniels' soul that he scheduled some alone time with just the two of them, so he could share with her how Jesus Christ had changed his life and how He could also save her from her sins.\"", "Some readers evidently mistook what seemed like an obvious spoof for real news:", "So wait, according to Jim Bakker, who cheated on his wife, Trump wouldn't cheat on his beautiful wife?? Better talk to Ivana and Marla about that Jimbo!", "— Jersey Redhead (@jrzyredhead) January 21, 2018", "To clear up any lingering confusion, we note here that this story is a fabrication, one which originated with the Babylon Bee, a religiously-oriented humor site that bills itself as \"Your Trusted Source for Christian News Satire.\"", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]