["Former Vice President Joe Biden has been consistently critical of how President Donald Trump has handled the coronavirus pandemic, often telling constituents that the president \"failed.\"", "Biden has laid out his own plan to respond to coronavirus on his website, which claims \"Biden knows how to mount an effective crisis response.\"", "But one post on Facebook took his confidence in his plan a step further.", "\"Joe Biden said if he had been President, not one person would have died from COVID-19, is he that damn STUPID,\" the post reads. It has been shared over 16,000 times.", "The page behind the post — TRUMP POWER — did not respond to a request from USA TODAY for comment.", "More:Fact check: CDC report doesn't show mask-wearers are more likely to contract COVID-19", "There's no record that Biden claimed he would have prevented all COVID-19 deaths if he had been president.", "The closest statement came from a town hall on CNN on Sept. 17.", "\"If the president had done his job — had done his job from the beginning — all the people would still be alive. All the people. I'm not making this up. Just look at the data,\" Biden said.", "Experts say that statement is untrue.", "More:Is it the flu or COVID-19? How to tell the difference", "A fact-check from the Washington Post concluded that there is \"no data\" to support that conclusion, and noted that even nations that have been praised for their pandemic response have suffered some deaths. South Korea, for example, had 377 deaths, and New Zealand had 25.", "\"I think it’s impossible to say every life could have been saved,\" Amesh Adalja, a scholar at the Johns Hopkins University Center for Health Security, told PolitiFact.", "Likewise, Nicholas Jewell, a professor at the University of California, Berkeley, said it would be \"magical thinking\" to suggest that 100% of deaths from COVID-19 could have been prevented.", "\"I haven’t seen any country really succeed to that extent,\" he said.", "Though deaths could have been reduced, at least some of the 200,000-plus casualties could not have been prevented, the experts agreed.", "Based on our research, the claim that Joe Biden said if he had been president, not one person would have died from COVID-19 is FALSE. In reality, Biden said that if Trump had responded better at the start of the pandemic, \"all the people would still be alive.\" Experts say that is false, too.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]