["In a conversation with reporters en route from Chicago to California recently, Sen. Barack Obama expressed a bleak outlook on the nation's economy.", "\"I have little doubt that we've moved into recession at this point,\" he said July 12, 2008.", "Aides said it was his most definitive judgment to date on the state of the economy. He made the point to support his call for a new economic stimulus package.", "\"The sooner we can get money into people's pockets, the sooner that we can stabilize the housing market,\" he continued. \"And the sooner that we can send a message to the markets that we're serious about creating an energy policy that will create greater energy efficiency over the next decade or so, I think the sooner we're going to get our fundamentals right.\"", "Prescriptions aside, we wondered whether his premise — that the nation is in a recession — was correct.", "There's ample reason to be concerned about the economy: home prices are down, automobile sales have slowed, unemployment is up, gas prices are sky-high, food prices are rising, and so on.", "But none of that necessarily means we're in a recession.", "By widespread consensus, the arbiter of whether this country is in a recession is the National Bureau of Economic Research, a private, nonprofit research organization based in Cambridge, Mass. What persuaded us of the bureau's status as the official recession referee was that countless economists said — both in interviews with us and in articles like\n\nthis\n\n,\n\nthis\n\nand\n\nthis\n\n— that the profession as a whole defers to the bureau on the matter.", "And the bureau has not said we are in a recession. That's not to say we're not — typically, the declaration comes six to 18 months after the recession hits.", "\"We have not said we're in a recession now, but that doesn't mean we're not in one because we always tell you after the fact,\" said Donna Zerwitz, spokesperson for the bureau.", "There's a widespread misconception, even among some economists, that the bureau defines recessions as two or more consecutive periods of decline in the country's gross domestic product. If that were the case, Obama would be wrong, because the GDP actually\n\nincreased slightly\n\nin the first quarter of 2008.", "But recessions are not always marked by two or more consecutive periods of negative GDP growth, the bureau says.", "\"Most of the recessions identified by our procedures do consist of two or more quarters of declining real GDP, but not all of them,\" the bureau\n\nexplains\n\non its Web site. \"Our procedure differs from the two-quarter rule in a number of ways.\"", "Recessions are declared by the bureau's Business Cycle Dating Committee, which is made up of seven volunteer economists. They consider the depth as well as the duration of the decline in economic activity. And they use a constellation of indicators, not just GDP.", "Here's how the group defines a recession, as pulled from its Web site: \"A recession is a significant decline in economic activity spread across the economy, lasting more than a few months, normally visible in real GDP, real income, employment, industrial production, and wholesale-retail sales.\"", "Bottom line: \"It's unknowable at this point whether what we're going through is a recession,\" said Chad Stone, chief economist at the nonpartisan Center on Budget and Policy Priorities in Washington, D.C. \"My opinion is that the formal definition of whether we're in a recession or not is less important than the fact that we have had a significant economic downturn.\"", "Still, Obama didn't say \"downturn,\" he said \"recession,\" a loaded term that can trigger an emotional reaction in an audience and, if it's uttered by the right person, a jittery response by stockholders and consumers. So we're holding him to it.", "Neither Obama's economic adviser Austan Goolsbee nor his spokesman Tommy Vietor returned calls to explain why Obama said what he did.", "Because the National Bureau of Economic Research has not ruled on the matter, we can't say for sure that Obama was wrong. But he implied that there is little doubt that we're in a recession, when in fact there is ample room for doubt. Remember, recessions typically include negative growth, and GDP actually rose slightly in the first quarter of this year.", "Obama may well have little doubt that we're in a recession. But it's difficult to conceive that his economic advisers, who surely have a handle on the technical nuances at work, had not informed him that there's room for plenty of doubt about that. So we rule his statement Barely True.", "Bureau of Economic Analysis,\n\nGross Domestic Product: First Quarter 2008,\n\naccessed June 26, 2008", "National Bureau of Economic Research,\n\nThe NBER's Dating Procedure\n\n, Jan. 7, 2008, accessed July 24, 2008", "New York Times,\n\n\"Rough\" \"Tough\" Times, but Still No 'Recession,'\n\nMay 3, 2008", "Wall Street Journal,\n\nRecession? Not So Fast, Say Some\n\n, May 14, 2008", "USA Today,\n\nEconomist Fears \"Nasty\" Recession Is Headed Our Way\n\n, Jan. 11, 2008", "Interview with Donna Zerwitz, director of public information for the National Bureau of Economic Research, July 24, 2008", "Interview with Anthony Yezer, professor of economics at George Washington University, July 24, 2008", "Interview with Chad Stone, chief economist at the Center on Budget and Policy Priorities, July 25, 2008", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]