["About this rating", "Does Arizona have a law limiting the number of dildos a person can have in their home? That rumor has been bouncing around blogs, books, and websites for decades. In December 2018, a Twitter user  renewed interest in this suspiciously strange piece of legislation:", "This restriction is not actually codified in Arizona law. But it almost was.", "Arizona State Rep. Leslie Johnson (R-Mesa) attempted to pass an obscenity law in the 1980s aimed at regulating pornography and banning the sale of dildos. House Bill 2613, which was later dubbed the \"dildo bill,\" would have made the commercial sale of \"obscene devices,\" such as dildos, a felony.", "The first news report we could find covering the bill was published in the Arizona Daily Star in December 1987:", "The original proposal focused only on the sale of \"obscene devices\" and not their ownership. Alan Sears, the lawyer who drafted the bill for Johnson, said that ownership of such devices was less important as women didn't like using them anyway. However, a provision of the proposed bill stated that ownership of six or more dildos would be considered proof of intent to sell them commercially -- which would have made such ownership a felony.", "While the bill faced some ridicule from members of the public (some Arizonans reportedly sported bumper stickers reading, \"When dildos are outlawed, only outlaws will have dildos\"), it was eventually passed by both the House and Senate. Ultimately, however, Gov. Rose Mofford vetoed the measure.", "Dildo ownership, however, was not at the center of Mofford's decision to veto the bill. The then-Arizona governor's action was based more on the term \"obscenity,\" how it was defined, and how it would be enforced:", "In her veto message, Mofford said she fully supports the enforcement of tough laws to eliminate obscene material, but \"I must regretfully use my veto power, primarily because I believe the bill is unconstitutional.\"", "The anti-pornography bill — also known as the \"dildo bill\" because it would have banned the commercial sale of sexual devices — would have allowed juries to decide what books and movies are obscene by using a standard of community acceptance rather than community tolerance.", "Moffard said she believes that the acceptance standard could allow higher courts to overturn convictions, so \"persons who would otherwise have been convicted under the tolerance standard would go free.\"", "She said she also feared that the acceptance standard — a tougher standard than used in several U.S. Supreme Court obscenity decisions — could allow the removal from library shelves and movie theaters of works that are widely recognized as fine literature or works of art.", "Johnson, who insisted that dildos were used solely to abuse children, filed similar legislation the following year. When the Arizona House amended some of the language in the bill, replacing the word \"dildo\" with \"child molestation devices,\" Johnson killed the legislation:", "The Arizona Legislature disposed of a couple of controversial bills. Rep. Leslie Whiting Johnson, best known for changing hats and hairdos daily, prematurely withdrew her dildo bill after her fellow representatives had amended it to her dissatisfaction. As originally crafted, the bill would have made it a felony to possess more than five sexual devices. That caused Rep. Bobby Raymond, D-Phoenix, to ask: \"Which one of my hands will I have to cut off?\"", "The story behind Johnson's obscenity law was eventually boiled down to a factually inaccurate sentence published on the website Dumblaws circa 1999. From there, it spread to a number of listicles concerning \"obscure laws\" in the United States. Perhaps most famously, photographer Olivia Locher created a visual representation of this rumor in her 2017 book I Fought the Law:", "Despite the widespread prevalence of the rumor, no law on the books in Arizona prohibits the number of dildos a person can own. The rumor stemmed from a failed piece of 1989 legislation dubbed the \"dildo bill\" which, among other things, would have made it a felony to sell sex toys. The \"ownership\" aspect of the rumor was due to language in the bill stating that owning more than six (not two) dildos would have constituted proof of intent to distribute.", "The Phoenix New Times reported on the legislation (and several other fabled Arizona statutes) in 2013 and asserted that Arizonans \"can have dildos stacked to the rafters\" without fear of legal repercussions.", "Carson, Susan.   \"Mofford Vetoes Bills on AIDS, Peep Shows, Mountain Bell.\"\r\n    Arizona Daily Star.   9 July 1988.", "Nett, Walt.   \"House Panel Chairman Kills Anti-Porn Bill Amid Protests.\"\r\n    Arizona Daily Star.   22 March 1988.", "Nett, Walt.   \"House Approves AIDS, Porn Bills.\"\r\n    Arizona Daily Star.   25 June 1988.", "Bass, Jonathan.   \"House OKS Bills on Child Abuse, Jail Fires, Insurance Firms' Books.\"\r\n    Arizona Daily Star.   15 March 1989.", "Pires, Kevin.   \"Arizona’s Two-Dildo Policy and Other Photos of Obscure Laws You Might Be Breaking.\"\r\n    Flavorwire.   11 November 2013.", "Locher, Olivia.   I Fought the Law: Photographs by Olivia Locher of the Strangest Laws from Each of the 50 States.\r\n    Chronicle Books, 2017.   ISBN 1452156956.", "Hendley, Matthew.   \"10 Arizona 'Dumb Laws' That Are Complete Horse S**t.\"\r\n    Phoenix New Times.   11 September 2013.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]