["On September 24, Rohan Gupta, chairman of the social media department of the Indian National Congress, tweeted pictures that showed shopkeepers sleeping next to their merchandise. Gupta wrote in his caption, “Here are the beneficiaries of the Modi wave that swept the nation!” His tweet had been liked 2,400 times and retweeted over 500 times at the time of writing. (archived link to the tweet)", "पूरे देश में मोदी लहर के लाभार्थी ! pic.twitter.com/09eLyDadFC", "— Rohan Gupta (@rohanrgupta) September 24, 2020", "These pictures are being shared at a time when India’s economy has hit its lowest point. Millions have lost their jobs because of the lockdowns imposed to control the spread of the coronavirus. Small businesses were among the worst affected. Modi government has faced criticism for the economic slump.", "These photos were also posted on Facebook on August 23.", "A parody Twitter account of former Uttar Pradesh Chief Minister Akhilesh Yadav shared these photos as well. (archived link to the tweet)", "ऐसे ही आराम फरमाओ मंदिर तो बन ही रहा है राफेल भी आ गया। अब और क्या करना है।", "आएगा तो मोदी ही 😀😀😀😀 pic.twitter.com/ePhslPJhb5", "— Akhilesh Yadav (@yadavakhiles143) August 2, 2020", "Fact-check", "When we did a reverse image search, we found these images in a tweet posted by Alka Lamba dated July 25, 2019. Lamba had written in her tweet, “The businessmen of Chandni Chowk and the rest of the country are victims of the Modi government’s policies.”", "Several other users had uploaded the photos on Facebook and Twitter around that time as well.", "This slideshow requires JavaScript.", "To sum it up, pictures of shopkeepers sleeping inside their shops last year were circulated as recent.", "Donate Now", "Kinjal Parmar holds a Bachelor of Science in Microbiology. However, her keen interest in journalism, drove her to pursue journalism from the Indian Institute of Mass Communication. At Alt News since 2019, she focuses on authentication of information which includes visual verification, media misreports, examining mis/disinformation across social media. She is the lead video producer at Alt News and manages social media accounts for the organization.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]