["About this rating", "Individuals who bought milk after 2003 in 15 states and the District of Columbia might be entitled to receive compensation due to a class action settlement.", "The deadline to submit a claim passed on 31 January 2017, and residents of most states were not part of the class that was eligible to be compensated under this settlement.", "In September 2016, social media users began circulating links to a web site (BoughtMilk.com) and asserting that anyone who had purchased milk after the year 2003 was eligible to participate in a class action lawsuit. As reported at the time, a settlement had been reached in an anti-trust class-action suit accusing dairy producers of artificially boosting milk prices:", "Major United States dairy producers will pay $52 million to settle an antitrust class-action lawsuit accusing them of slaughtering more than 500,000 cows to reduce milk supply and inflate prices.", "“This cow-killing program exploited both the animals and the consumers, and resulted in the early deaths of half a million cows,” attorney Cheryl Leahy told The Huffington Post in an email. Leahy is general counsel for Compassion Over Killing, an animal protection group that spearheaded the suit ... Class action firm Hagens Berman Sobol Shapiro LLP filed the suit in 2011 on behalf of dairy consumers, against dairy lobbying group National Milk Producers Federation and industry cooperatives Dairy Farmers of America, Land O’ Lakes, DairyLea Cooperative and Agrimark.", "In January 2017, news reports about the milk class action settlement appeared regularly because the deadline for affected consumers to request a share of that settlement was set at 31 January 2017. However, many social media users only saw headlines and brief descriptions which did not typically contain the specifics of the settlement or its restrictions.", "BoughtMilk.com was the \"official website for the Fresh Milk Products Price-Fixing Class Action Lawsuit,\" and a hub for filing claims and obtaining more information. According to that site, settlement eligibility applies only to consumers in 15 states and the District of Columbia:", "I was a resident of at least one of these states during at least part of 2003 to the present: Arizona, California, the District of Columbia, Kansas, Massachusetts, Michigan, Missouri, Nebraska, Nevada, New Hampshire, Oregon, South Dakota, Tennessee, Vermont, West Virginia, or Wisconsin.", "A question-and-answer section additionally explained that eligible class members living in those states must have purchased milk products since 2003:", "Individuals and entities who, as residents of Arizona, California, the District of Columbia, Kansas, Massachusetts, Michigan, Missouri, Nebraska, Nevada, New Hampshire, Oregon, South Dakota, Tennessee, Vermont, West Virginia, or Wisconsin, during the period of 2003 to the present, purchased milk or other fresh milk products (including cream, half & half, yogurt, cottage cheese, cream cheese, or sour cream) for their own use and not for resale. Governmental entities are excluded from the class.", "To be a class member, you must not have purchased the milk or other fresh milk products directly from a defendant. Instead, you must have purchased the milk indirectly, for example, through a grocery store or other retailer.", "According to BoughtMilk.com, eligible individuals could receive between $45 to $70 from a settlement pool of $52 million. The claim period began on 2 September 2016, and the final deadline for filing passed on 31 January 2017.", "Arthur, Keely.    \"Bought Milk? You Could Get Money.\"\r\n    WISC-TV.    12 January 2017.", "Delong, Katie.    \"Class Action Settlement: Have You Purchased Milk, Dairy Products in WI Since 2003? You Could Be Owed Money!\"\r\n    WITI-TV.    12 January 2017.", "Hanson, Hilary.    \"Dairy Industry Killed Off 500,000 Cows in Alleged Price-Fixing Scheme.\"\r\n<    em>Huffington Post.    8 September 2016.", "Hesselberg, George.    \"Bought Milk? Deadline for Refund in Price-Fixing Settlement Is Jan. 31.\"\r\n    Wisconsin State Journal.    12 January 2017.", "Miller, Ted.     \"Bought Milk? You Could Get Cash from a Lawsuit Settlement.\"\r\n    WBAY-TV.    12 January 2017.", "BoughtMilk.com.    \"Fresh Milk Products Antitrust Litigation.\"\r\n    Accessed 13 January 2017.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]