["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Ashley Moody, candidate for attorney general, speaks at the Republican Sunshine Summit Friday, June 29, 2018, in Kissimmee, Fla. (AP Photo/John Raoux)", "Once a Democrat, always a Democrat?", "That’s how a Republican candidate for Florida attorney general attacked his primary opponent in an ad weeks before the Aug. 28 primary.", "Frank White, a member of the Florida House since 2016, is challenging Ashley Moody, who was a Florida circuit court judge for 10 years before she resigned to run for attorney general.", "\"Ashley Moody sued Donald Trump for fraud,\" said an ad from White, referencing when Moody was a plaintiff in a lawsuit concerning Trump’s involvement in the development of the unfinished Trump Tower Tampa.", "\"Now she wants to be our Republican attorney general. How could we ever trust her?\"", "Then the ad goes even further: \"Ashley Moody was a lifelong Democrat.\"", "That would be an interesting development in a Republican primary, if it were true. But it is not.", "Moody was a registered Democrat for five years, but has been a registered Republican for the last 20.", "\"Lifelong\" ≠ 1993 to 1998", "Under law, Florida voter registrations are public records and can be released to any person upon request.", "So we acquired Moody’s records from the supervisor of elections in Hillsborough County, where Moody currently lives, as well as elections supervisors in other counties where she had previously lived.", "We found that Moody first registered to vote in 1993, when she was 18. At that time, she registered as a Democrat in Hillsborough County.", "Moody later moved to Alachua County to attend the University of Florida. On Jan. 6, 1998, she updated her voter registration and switched her party affiliation to Republican.", "Moody then moved back to Hillsborough County and registered again to vote there in 2002. She then switched her registration so that she was registered in Duval County on June 30, 2004, said Katrell McKenzie of the Duval County Supervisor of Elections Office.", "In June 2006, Moody switched to being registered in Hillsborough County once more.", "She has been registered as a Republican in Hillsborough since 2006.", "So Moody was a registered Democrat for five years, but for the last 20 years, she’s been a registered Republican.", "Asked how this qualifies Moody as a \"lifelong Democrat,\" a spokeswoman for Frank’s campaign gave an interesting response.", "Erin Isaac pointed out that \"the ad does not say she IS a lifelong Dem.\"", "\"Ashley Moody WAS a lifelong Democrat. Moody first registered as a Democrat and maintained that registration continually before reregistering, by continuing to act like a liberal. So she was a lifelong Democrat before she switched and continued liberal actions,\" Isaac explained.", "But most viewers of the ad aren’t paying attention to the small detail of whether White decided to call Moody a \"lifelong Democrat\" in the past or present tense.", "The Moody campaign website points out that Moody is not the only Republican politician to have started out by registering as a Democrat. President Donald Trump, Vice President Mike Pence and Florida Attorney General Pam Bondi (who has endorsed Moody in the race) were all previously registered Democrats. (Pence, regarded as a stalwart Republican who hosted a conservative talk radio show, was a youth coordinator for his county’s Democratic Party.)", "Our ruling", "White claimed Moody \"was a lifelong Democrat.\"", "Voter registration records show Moody did register as a Democrat in 1993, when she was 18. But she switched her party affiliation in 1998 to Republican, and has remained registered as a Republican ever since then.", "We rate this claim False.", "Frank White, campaign ad", "Email exchange with Christina Johnson, spokesperson, Ashley Moody for Attorney General, August 7-16, 2018", "Email exchange with Erin Isaac, spokesperson, Frank White for Attorney General, August 10 and 13, 2018", "Email exchange and phone interview with Gerri Kramer, director of communications, Hillsborough County Supervisor of Elections, August 17 and 20, 2018", "Email exchange with Alexis Hunter, Information Specialist, Alachua County Supervisor of Elections, August 17, 2018", "Email exchange with Katrell McKenzie, Duval County Supervisor of Elections Office, August 17-19, 2018", "Email exchange with Tami Bentley, director of administrative services, Pasco County Supervisor of Elections, August 17, 2018", "Tampa Bay Times, \"Look at how negative the GOP race for Florida attorney general has become,\" August 9, 2018", "Tampa Bay Times, \"Buyers still feel burned by Donald Trump after Tampa condo tower failure,\" December 15, 2015", "Florida Division of Elections, \"Voter Information as a Public Record,\" accessed August 20, 2018", "Tampa Bay Times, \"Ahead of attorney general run, former Hillsborough Judge Ashley Moody draws Bondi's support,\" June 5, 2017", "Politico Florida, \"GOP candidate for Florida attorney general once sued Trump in federal fraud case,\" June 8, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]