["About this rating", "Warren G. Harding, the 29th president of the United States, is now perhaps most commonly known for ranking at or near the top of \"Worst Presidents\" lists. Invocation of Harding's name does not typically call to mind any sterling achievements as president, but rather a litany of scandal and corruption: the bribery-induced Teapot Dome oil leases of Harding's Secretary of the Interior (Albert Fall); Harding's heavy drinking and fully stocked White House bar in the midst of Prohibition; Harding's long extramarital affair (including a child fathered out of wedlock) with Nan Britton, a woman 30 years his junior; and Harding's sudden and mysterious death  in office in 1923.", "Part and parcel of Harding's dissolute reputation is the claim that he once rashly gambled away the White House china on a single hand of poker:", "Warren G. Harding is widely described as the worst president in American history. He was our 29th chief executive, serving from 1921 to 1923. Although stories abound to explain just why he is considered our worst president, one of the funniest – depending on your point of view – is the fact that he gambled away an entire set of White House china. And he bet it all on one unfortunate hand. Some historians say the game wasn’t even real poker, but something called a “cold hand,”1 not unlike the children’s card game War.", "1 (A \"cold hand\" in poker is one in which each player is dealt a face-up hand of cards, and the highest-ranked hand wins -- unlike standard forms of poker, no cards are concealed, no additional cards are drawn, and no betting takes place after the deal.)", "Although \"Harding lost the White House china in a poker game\" is a common anecdote told about the 29th president, it is typically presented without reference to any documentation or evidence establishing it to be true. Yet the exact source of this claim is readily ascertainable: Betty Beale, the long-time Washington Star society writer whose columns were syndicated in numerous newspapers across the U.S.", "In 1965, Beale had occasion to write about Louise Cromwell Brooks, the American socialite who had recently passed away. Brooks, once dubbed \"one of Washington's most beautiful and attractive young women,\" was notorious for being a four-time divorcee, having married (and then split up with), in succession, Baltimore businessman Walter Booth Brooks Jr., General Douglas MacArthur, actor Lionel Atwill, and bandleader Alf Heiberg.", "Mrs. Louise Cromwell Brooks, 2/28/21", "Brooks was a personal acquaintance of Warren Harding's, which prompted Beale to include the following story in her highlights of Brooks' life:", "The story of [Brooks'] friendship with Warren Harding she preferred not to be written about during her lifetime. But I will never forget the tea party she had on March 6, 1943 for Martha Taft, wife of Senator Robert A. Taft who was then a candidate for president.", "Since she was promoting the Taft candidacy, all the decor was geared to the subject, not the least of which were the plates stacked on the table. I glanced at them, then looked back hard and long. I couldn't believe my eyes. Plainly visible in the center was the Presidential eagle. I casually picked up one and turned it over. On the back was printed in the china \"Harrison.\"", "I went up to her and whispered in her ear, \"Louise, where did you get the White House china?\"  \"That's an interesting story,\" she said. \"I won it in a hand of cold poker from President Harding.\"", "She occasionally played poker in those days, she said, with the President, his Secretary of War John Weeks and Gen. John J. Pershing, whose love letters to her she still had, she said. On this particular evening the game took place in her house at 1780 Massachusetts Avenue where the then gay and beautiful divorcee of Walter Brooks had many fascinating gatherings that frequently drew Harding. All at once during the game President Harding said, \"Louise, let's play a cold hand of poker -- just the two of us -- winner names the stakes.\"", "\"Whatever you want I will do,\" he assured her. But as the handsome Chief Executive was obviously attracted to her, she agreed to the stakes \"with reservations,\" she said.", "She won. And when he asked her to name her price, the heiress replied, \"I'll take a set of White House china.\"", "\"The very next day,\" continued Mrs. Heiberg, with a chuckle of recollection, \"a barrel of china of the Benjamin Harrison administration was delivered ay my door.\"", "This seems to be a credible account, related by an identifiable source with specific details of time and place. On the other hand, it's also a single-source, second-hand account, told by someone who putatively learned about the event 20 years after the fact and then didn't reveal what she was told until another 20 years had passed, when both of the principals (Harding and Brooks) were dead and could no longer confirm or deny it. This account could be literally true, it could be fabricated, or the truth could lie somewhere in between (e.g., Brooks played poker with Harding, and the president later made her a gift of some White House china, but the two events were not directly connected). At this remove, it's difficult to prove one way or the other.", "We note, however, that even if this tale were literally true, it wouldn't necessarily be as salacious as modern tellers make it sound. Rather than the common narrative (i.e., Harding foolishly bet -- and lost -- all the White House china in a drunken poker game), Beale presents an account of some friendly banter between Brooks and Harding over a game of cards. It might have been the case that, when pressed by Harding to state what she wanted to claim as her \"winnings,\" Brooks whimsically named the first thing that came to mind, something she never really expected to receive (and wouldn't have complained if she didn't get), but Harding decided to play along and make her a gift of some surplus White House china anyway.", "China pattern from the Benjamin Harrison White House", "According to Beale's account, even if Brooks did \"win\" some china from Harding in a poker game, what Harding \"paid up\" with wasn't all of the White House china, nor all of former president Benjamin Harrison's dinnerware. Some, but not all, presidential administrations commission china patterns for dinnerware which may continue to be manufactured and used in subsequent administrations, and while what Brooks allegedly received might have been Benjamin Harrison-patterned White House china, it wasn't necessarily manufactured during Harrison's term or used by him, and -- as Beale observed -- it represented only a small portion of the White House dinnerware reserve:", "Obviously, Harding did not send all of [the china] to her. A normal set and a White House set of china vary considerably in size, and the White House still has quite a bit of the Harrison china on hand.", "Even today, Benjamin Harrison presidential china is readily available for purchase on the open market.", "Beale, Betty.   \"Mesta-Kennedy Feud 'Only' a Tempest in a Teapot.\"\r\n    The Indianapolis Star.   4 July 1965   (p. 52).", "David Mikkelson founded the site now known as snopes.com back in 1994 as a creative outgrowth of his wide-ranging interests in a variety of subjects (particularly folklo ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]