["About this rating", "On 23 October 2016 the Huffington Post published an article with a headline proclaiming that the U.S. Supreme Court had upheld a 20-year prison term for former Vice President Dick Cheney:", "The US Supreme Court upheld a 20-year prison sentence for former Vice President Dick Cheney, convicted of war crimes committed during the Iraq war.", "The decision by the Court is final and cannot be further appealed, but it can be overturned by a presidential pardon. Such a pardon is unlikely as President Trump encouraged the prosecution of Cheney in the waning days of the 2016 Presidential campaign.", "Cheney had publicly endorsed Trump for president, but it was not enough to avoid a prosecution under President Trump’s revolutionary “fair and balanced” justice system. “Just like Fox News,” the President quipped.", "“We focused on jailing Cheney in order to attract Bernie Sanders supporters,” confided Kellyanne Conway, former Trump campaign manager. “And it worked. Despite all the mud thrown at us, we were able to rig our own rigged election. There was so much rigging going on, you could hang Christmas lights from it.”", "Indeed, cries of “Jail Chey-nee, Jail Chey-nee” thundered through crowds at Trump rallies and events. “Hillary Clinton had no response because we threatened her, too,” explained Conway, who is now President Trump’s Surgeon General. “There were those who complained about our threatening to jail government officials” said Conway, “but their pleas fell on deaf ears.”", "“They didn’t realize jailing government officials can cut both ways,” Conway said pointedly. Five others were convicted along with Cheney, and their sentences were upheld as well.", "The article was just a bit of satire (clearly labeled as such), set in 2019 and based on a Donald Trump presidency. But as Huffington Post articles are not typically satire-based, many social media users presumed the headline was legitimate and straightforward. And while the dateline included reference to the \"Goodyear Satire Co.,\" not all social media users note that level of detail when spotting shares in the wild.", "Huffington Post's foray into satirical territory with the Dick Cheney piece isn't the first time a mainstream news publication has confused readers with fake news items. The New Yorker's Andy Borowitz occasionally perplexes social media users unaware the non-satirical outlet maintained a satire column, and the New York Times confounded a number of readers with an item suggesting that the elite Stanford University admitted no students for the class of 2020.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]