["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Throughout his Republican presidential campaign, Sen. Marco Rubio of Florida has tried to distance himself from his involvement in a 2013 failed bipartisan immigration bill.", "The legislation has proven to be a liability for Rubio because it contained a path to citizenship for illegal immigrants, and some of Rubio’s opponents say his support for the bill is evidence that he’s not tough on immigration. On NBC’s Meet the Press Jan. 31, host Chuck Todd asked Rubio if he regretted being part of the Gang of Eight senators who authored the bill.", "\"Look, I tried to fix the problem,\" Rubio said, referring to illegal immigration. \"This is a real problem. And where are we today? We are worse off today than we were five years ago. We have more illegal immigrants here. We have two unconstitutional executive orders on amnesty. I went to Washington to fix a problem.\"", "Our ears perked up when Rubio said there are more illegal immigrants in the United States than there were five years ago, so we decided to check the numbers. We found that the latest available data doesn’t support Rubio’s statement.", "A July 2015 headline from the Pew Research Center directly counters Rubio that there are more illegal immigrants than five years ago: \"Unauthorized immigrant population stable for half a decade.\"", "Pew found that the number of illegal immigrants living in the United States has seen very little fluctuation, between 2010 and 2014, the latest five-year period of data available — going from 11.4 million in 2010 to 11.3 million in 2014. The illegal immigrant population peaked at 12.2 million in 2007. (See the chart created by Pew to the left.)", "The Pew analysis concluded that the illegal immigrant population has been stable the past few years because the number of new immigrants is about equal to the number of those living in the United States who are deported, leave on their own, or die.", "Pew also found that the number of illegal immigrants from Mexico, in particular, has been on the decline — going from a peak of 6.9 million in 2007 to 5.6 million in 2014.", "The decline in Mexican immigrants is the primary reason why illegal immigration stopped growing, said Robert Warren, a demographer and senior visiting fellow at the Center for Migration Studies. He pointed us to his own recent research on the subject.", "The report’s executive summary says illegal immigration is a hot political topic, in part, because people believe it’s on the rise. However, the paper finds that \"this belief is mistaken and that, in fact, the undocumented population has been decreasing for more than a half a decade.\"", "Warren’s report found that the illegal immigrant population has declined every year for the past five years of available data, landing at about 10.9 million illegal immigrants in 2014, down from 11.7 million in 2010.", "Why the decline in Mexican immigration?", "In a prior fact-check, we found that demographic change is possibly the biggest driver. The birth rate in Mexico has fallen steadily since at least 1990. Marc Rosenblum at the Migration Policy Institute said that translates into fewer people coming into the workforce.", "He said apprehensions at the border strongly suggest that fewer people are trying to sneak into the country. Data from the U.S. Border Patrol show a drop in total apprehensions of about 40 percent since 2009. It used to be border agents stopped around a million people coming in from Mexico per year. Last year, it was about 188,000.", "More surveillance, stiffer penalties and more barriers at the border have had the intended effect, he said.", "Other drivers include the hit on the construction industry during the recession. That was a sector that drew many immigrants, and while it has recovered a bit, it is not nearly as robust as it once was. Plus, according to one survey, Mexicans who return to their native country generally find that they make more money than when they left.", "Our ruling", "Rubio said, \"We have more illegal immigrants here\" than we did five years ago.", "Multiple estimates show that the illegal immigrant population has stabilized, or even decreased, from its peak in 2007 through 2014, the latest available data. According to Pew, the illegal immigrant population was 11.3 million in 2014, down from 11.4 million five years prior in 2010. This is in sharp contrast to dramatic and steady increases throughout the 1990s and early 2000s.", "There is no evidence to support the idea that the illegal immigrant population has grown in the past five years. We rate Rubio’s claim False.", "Pew Research Center, \"Unauthorized immigrant population stable for half a decade,\" July 22, 2015", "Pew Research Center, \"5 facts about illegal immigration in the U.S.,\" Nov. 19, 2015", "Pew Research Center, \"What we know about illegal immigration from Mexico,\" Nov. 20, 2015", "Journal on Migration and Human Security, \"US Undocumented Population Drops Below 11 Million in 2014, with Continued Declines in the Mexican Undocumented Population,\" Jan. 15, 2016", "Atlantic, \"Why Is the Undocumented-Immigrant Population Dropping?\" Jan. 25, 2016", "PolitiFact, \"Donald Trump wrongly says the number of illegal immigrants is 30 million or higher,\" July 28, 2015", "PolitiFact, \"Martin O'Malley: Net migration from Mexico was 0 in 2014,\" Nov. 15, 2015", "PolitiFact, \"Bill Clinton: Zero net migration from Mexico since 2010,\" June 22, 2015", "Emails, Robert Warren, senior visiting fellow at the Center for Migration Studies, Jan. 31, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]