["After sidestepping nearly every significant tradition in the transfer of power, now former President Donald Trump did uphold one routine of an outgoing president — leaving his predecessor a note.", "President Joe Biden — alongside Vice President Kamala Harris — was inaugurated on Jan. 20.", "However, despite no evidence of widespread fraud and dozens of failures in court, some of Trump's supporters and allies are continuing to push baseless conspiracy theories about a stolen election.", "Following the revelation that Trump had left Biden a note, people took to social media to speculate about whatit said.", "One Instagram post, from a Florida-based lifestyle account, shared an image of a note that reads \"Joe, you know I won,\" with the supposed signature of Trump on White House stationery. USA TODAY was unable to reach the poster for comment.", "The same letter was also shared here on this blog post and has 1,278,988 views as of Jan. 22.", "The image also was widely shared across social media.", "Fact check: What's true about the 2020 election, vote counting, Electoral College", "What does Trump's note to Biden say?", "The tradition of an outgoing president leaving letters for his successor is relatively new, but the practice has been upheld since Ronald Reagan wrote to George H.W. in 1989. Trump received a letter from Obama in 2017, which said in part, \"Regardless of the push and pull of daily politics, it’s up to us to leave those instruments of our democracy at least as strong as we found them.”", "Before Biden's inauguration, White House spokesperson Judd Deere confirmed that Trump had left a letter for Biden. The contents of the letter were not released.", "\"It’s a letter between 45 and 46,\" Deere said.", "After his inauguration, Biden confirmed to reporters that he had received the letter from Trump, noting that it was \"very generous.\"", "Biden also did not release the contents of Trump's letter, saying \"because it was private, I won't talk about it until I talk to him.\"", "It's unclear if the note means the two will end up having a conversation.", "According to White House Press Secretary Jen Psaki, there is no planned call between Trump and Biden.", "Fact check:Attendance at Biden's inauguration was restricted by COVID-19 pandemic", "There is no evidence that the letter depicted on social me is real. The contents of the post's letter also contradict Biden's assessment of it being \"very generous.\"", "Additionally, the seal at the top of the letter does not match the seals used on other letters from Trump that have been made public, like this one. The letter posted to Instagram is also dated \"20th January 2021,\" instead of the typical date formatting with the month first, followed by the day.", "Lastly, the letter's assertion that Trump won the election is false. Election officials, both Republicans and Democrats, have confirmed that there was no widespread voter fraud and lawsuits alleging fraud have been largely unsuccessful.", "Fact check:Viral TikTok alters Army Band's music to 'Hit the Road Jack'", "We rate this claim as FALSE, based on our research. There is no evidence that the letter posted to is legitimate. The contents of the post's letter also contradict Biden's assessment of the real letter being \"generous.\" Additionally, the satirical letter's claim that Trump won the election is false.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook."]