["This Facebook post was published on January 7, 2020. It has had more than 34,000 shares. The caption reads: “Australia Bushfire is Blooming Again” and “Regrowth after a Australia Bushfire.”", "Below is a screenshot of the misleading post:", "Other Facebook posts were published here, here, here, here, here, here, here and here with a similar claim.", "The claim is misleading; most of the photos have circulated in reports about unrelated events.", "The first image of resprouting trees has circulated in reports since May 2009, more than one decade before the recent bushfires.", "A Google reverse image search found the photo published here by Getty Images with a caption that reads: “New tree growth sprouts on the 3 month anniversary of 'Black Saturday', Australia's highest ever loss of life from a bushfire, on May 7, 2009 in Marysville, Australia.”", "Below is a screenshot of the post:", "This photo of reddish growth emerging from a tree trunk has circulated in reports about recent bushfires.", "A Google reverse image search found the photo was featured in this ABC News article dated November 27, 2019.  The photo’s caption reads: “New growth is already emerging in the Lake Innes Nature Reserve.”", "Below is a screenshot of the photo as it appears in the article:", "A Google reverse image search found this image of palm sprouting here in a 2016 ABC News article, which covered natural regrowth following the Waroona bushfire in January 2016.", "The image’s caption reads: “A zamia palm re-sprouts just a few weeks after the Waroona bushfire.”", "Below is a screenshot of the image in the ABC News article:", "A Google reverse image search found this photo of small green sprouts emerging from the ground featured in this ABC News article published on April 20, 2015.", "The image’s caption reads: “Sprouts of regrowth at Kestel Road Forest. Rainfall following the fires has helped to spur trees back into growth.”", "Below is a screenshot of the image in the article:", "This image of a fire lily is actually from a database of African plant photos.", "A Google reverse image search found the photo published here in the database of the Senckenberg Society for Natural Research, which maintains a photo guide for African plants.", "The photo’s caption states that the picture was taken on December 4, 2005 in the Western Cape of South Africa.", "Below is a screenshot of the entry:", "This photo of red shrubs appearing on a tree trunk has circulated in reports about recent bushfires.", "A Google reverse image search found this article published by BBC News on January 11, 2020.", "The photos were credited to Murray Lowe, who also published them in a Facebook post here with his watermark.", "Below is a screenshot of the Facebook post:", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]