["Five photos being shared on Facebook show wreckage. Two of the images show what look like rows of burned out cars. A third shows several people standing in front of a ruined building. Two more reveal debris, orange cones and smoke at an intersection.", "\"All of downtown Portland looks like this!\" reads a July 29 Facebook post about recent protests in Portland, Ore. \"Ask yourself why you haven’t seen this.\"", "The answer, it seems, is because these photos are not recent pictures of Portland. This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "One of the photos of cars is from August 2019, when a fire in Portland destroyed a townhouse, a gym and dozens of vehicles.", "The second car photo, taken by AP photographer Julio Cortez, is from May 30 and shows a parking lot filled with scorched vehicles in Minneapolis \"after a night of fires and looting\" after the death of George Floyd, according to the caption.", "The third photo shows the aftermath of a natural gas explosion near a construction site in Portland in October 2016. The fourth and fifth photos are also from after that explosion.", "We rate this post Pants on Fire.", "Facebook post, July 29, 2020", "Tweet, Aug. 27, 2019", "KOIN, Business owners say ‘apocalyptic’ fire could have been deadly, Aug. 27, 2019", "KOIN, Suspected Portland arsonist pleads not guilty, Dec. 3, 2019", "Chicago Tribune, Protests in Minneapolis and across the US following the death of George Floyd, May 27, 2020", "The Oregonian, Portland bagel shop owners sue pipeline company over 2016 explosion that destroyed business, Dec. 6, 2019", "The Mercury News, Portland gas blast: Injured firefighter hailed as hero, Oct. 21, 2016", "The Seattle Times, Gas explosion rocks Portland shopping district, injuring 8, Oct. 19, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]