["A viral message on Facebook, Twitter and WhatsApp claims that the pilot of the February 26 IAF airstrike on JeM camps at Pakistan’s Balakot is a girl named Urvisha Jariwala from Bhulka Bhavan school in Surat. A BJP leader from Rajasthan, Ritalba Solanki, was among those who made the assertion.", "Several individual users have shared an identical claim on Facebook. Some have also circulated other photographs of “Urvisha Jariwala”, including one where she can be seen in a fighter plane.", "A screenshot of the Facebook profile of “Urvisha Jariwala” has also been shared by some Facebook users.", "These images are viral on WhatsApp as well.", "is it true ?? It’s Viral on WA .. @zoo_bear@free_thinker @SMHoaxSlayer @boomlive_in pic.twitter.com/ai6K1pHW9j", "— Mr. Shah (@s_kejul619) February 26, 2019", "1. Upon searching the keywords – “Urvisha Jariwala Indian air force” and “Urvashi Jariwala Indian air force” – Google did not throw up any results. Alt News reverse-searched the woman’s image on Google and found that she is actually IAF pilot Sneha Shekhawat.", "According to a 2015 Times of India report, “Sneha Shekhawat made history as the first woman pilot to lead an IAF contingent in the 63-year history of the Republic Day parades.”", "2. We were also able to locate the second image – the one of the woman pilot on a fighter plane – on an NBC News article from 2014. The woman in the photograph is the first female fighter jet pilot of UAE, Al Mansouri.", "3. About the screenshot of the Facebook profile of “Urvisha Jariwal”, we found that an account by that name did exist but is now deactivated or deleted. A Google cache link still shows the profile ‘Urvisha Jariwala (urvi)’.", "Boomlive spoke to an unnamed source with the Indian air force who said the names of operatives involved in the airstrike have not been revealed due to confidentiality. “We have not released any names of any officers. In fact, there has been no official statement from the IAF except what the foreign secretary made. All such claims are rubbish,” they told Boomlive.", "The same claim of “Urvisha Jariwala” being the IAF pilot who led the attack on Jaish camps has also been circulated with the image attached below.", "Upon reverse-searching the photograph on Google, we found that the woman is Avani Chaturvedi, the first Indian woman pilot to fly fighter jet MiG-21 Bison.", "We found one more photograph that was captioned as “Urvisha Jariwala”.", "However, the woman in the image is IAF fighter pilot Mohona Singh.", "The aftermath of IAF’s airstrike on Jaish camps in the early hours of February 26 saw a surge in misinformation circulated not only on social media (1, 2) but also on mainstream media.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]