["By Saranac Hale Spencer", "Posted on May 31, 2019", "A picture of a cow used for a research project in 2008 has been circulating on social media with a false claim that “fringe leftist[s] are now advocating for cow fart bags to capture farts as a way to help prevent ‘global warming.'”", "A cow used in an Argentine research project in 2008 has become the star of a misleading post on social media in 2019.", "The cow, which is shown wearing an inflatable pink cylinder on its back, has had its picture shared more than 35,000 times on Facebook with this text: “I wish this was a joke but fringe leftist [sic] are now advocating for cow fart bags to capture farts as a way to help prevent ‘global warming.’ You can’t make this stuff up folks.”", "But that claim is made up.", "The backpack was used to collect gas produced during the cow’s digestive process so that scientists could study the effect its diet has on the production of methane and other volatile organic compounds in ruminants that contribute to climate change. The backpack was connected to the cow’s stomach through a hole in its ribs, and was collecting what would have been burps, not “farts,” as the Facebook post claims.", "But, most importantly, the backpack was not intended as a device to keep methane out of the atmosphere. Rather, it was used to help scientists study how cow’s digest what they eat.", "The same researchers who worked on that project used a similar gas collection system a year earlier to study the methane produced in the digestion of dairy cows. That study, which lasted 28 days and included six cows, found that the addition of tannins (an additive derived from plants) to the cows’ diet led to a 28 percent decrease in methane production.", "A later project by the same researchers, done in 2013, used the collection system to transform the methane into biofuel.", "According to the Environmental Protection Agency, between 50 percent and 65 percent of methane emissions around the world come from human activity, including the use of livestock, and the impact on the global climate is 25 times greater than the impact of carbon dioxide over 100 years.", "The agriculture sector was responsible for about 9 percent of total U.S. greenhouse gas emissions in 2017, according to the EPA.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "Brindicci, Marcos. “Cows Burp for Science in Argentina.” Reuters. 9 Jul 2008.", "Associated Press. ARGENTINA METHANE. AP Archive. 19 Apr 2010.", "Berra, Guillermo, et al. “Use of Tannins to Mitigate Methane Emission in Grazing Dairy Cows.” Accessed 29 May 2019.", "United States Environmental Protection Agency. “Overview of Greenhouse Gases.” Accessed 29 May 2019.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]