["As President-elect Joe Biden prepares to transition into the role of the president — and President Donald Trump’s days in the White House dwindle — supporters of the current president have looked for ways to disqualify Biden from winning the White House.", "A number of Facebook pages and users have recently shared an article by Reformation Charlotte, a right-wing website, that claims Biden is wanted in Ukraine on felony bribery charges. It cites One America News Network, a right-wing media outlet, as the information’s source.", "The article alleges that Biden is a suspect in “criminal allegations” and is wanted in Ukraine on felony charges for bribery. The OAN report claims Biden has been “formally listed” in a criminal case regarding the firing of former Ukrainian prosecutor general Viktor Shokin in exchange for dropping an investigation of his son Hunter. It further alleges Biden bribed former Ukraine President Petro Poroshenko with $1 billion in loan guarantees. Neither report cites any sources.", "“While the last four years have been spent by the Democrat party and presidential candidate, Joe Biden concocting a fake Russian collusion scandal and impeaching the president, Donald Trump for it, what is now apparent is that it wasn’t Donald Trump, but Joe Biden and many of his cronies — including his son, Hunter — who are actually guilty of crimes of corruption and treason,” the Reformation Charlotte article reads.", "In response to USA TODAY's request for comment, OAN White House reporter Chanel Dion pointed to her original report on the subject. Reformation Charlotte and both social media users did not respond to USA TODAY’s requests for comment.", "More:Computer repairman who claimed he gave Hunter Biden data to Giuliani closes shop as laptop saga gets stranger", "Though the Reformation Charlotte article was published Nov. 17, the news story to which it’s referring occurred in May, and that is when OAN reported it.", "Daria Kaleniuk, executive director and co-founder of the Anti-Corruption Action Centre, a leading anti-corruption voice in Ukraine, told PolitiFact in July that the complaint to which the OAN story refers was registered because it had been rejected by prosecutors.", "\"It doesn’t mean that Joe or Hunter Biden are suspects,” she said. “It means that, according to Ukrainian criminal procedure code, all formal criminal complaints have to be registered by law enforcement agencies, and if they don’t do so, the claimant can force prosecutors to start formal investigation through court.”", "Under Ukrainian law, anyone can request an investigation if the State Investigative Bureau declines to open one, and courts often order law enforcement to launch criminal cases even if there is no evidence, NBC News reported regarding the Biden probe. The Kyiv Post, the newspaper in Ukraine’s capital, reported that the judge who issued the ruling has a “toxic reputation” and is one of the country’s most controversial judges.", "Steven Pifer, former U.S. ambassador to Ukraine, told USA TODAY that despite the court’s charge, there was no investigation of Biden so far as he knows.", "“Ukrainian courts do some pretty bizarre things, and probably if you asked a lot of people, they would say the single most important thing Ukraine could do now would be to root out corruption in the judicial branch, and that’s from the constitutional court all the way down to the local courts,” he said.", "The probe into Joe Biden was closed Nov. 10 after finding no evidence of wrongdoing, according to NBC News. USA TODAY found no evidence Biden is “wanted” in Ukraine, nor facing criminal charges for bribery.", "Biden did threaten to withhold $1 billion in U.S. aid from Ukraine if Shokin, the former prosecutor general, was not removed – but that information has long been public, and isn’t illegal or unusual, Pifer said.", "Pifer said that during the Obama administration there were three $1 billion loan guarantees that the U.S. government provided to Ukraine. The loans functioned like signing on as a cosigner for a mortgage: If Ukraine pays the debt, which Pifer says it always has, it costs nothing. But the first time the country violates the terms, it wouldn't receive those funds from the United States again.", "More:Fact check: Biden leveraged $1B in aid to Ukraine to oust corrupt prosecutor, not to help his son", "Biden both privately and publicly admitted to withholding one of those loan guarantees to have Shokin fired, but that’s no scandal. Pifer said that from the State Department to the American Embassy in Kyiv, Ukraine, everyone wanted to see Shokin gone.", "“Everybody thought that this was a perfectly good use of American leverage to get rid of somebody who was seen as basically protecting corrupt individuals, and really, doing no investigations,” Pifer said.", "That was an issue because anti-corruption efforts were a large aspect of the Americans' work there.", "\"A big part of our diplomacy was pushing the Ukrainian government to clean up the corruption, partly because it was that corruption that allowed Russia to manipulate the country politically and economically,\" Charlie Kupchan, who served as a special assistant to President Barack Obama and a senior director for European Affairs on the National Security Council, previously told USA TODAY.", "Pifer, who also oversaw diplomacy with Russia and Ukraine under President George W. Bush, previously told USA TODAY he used similar methods to pressure Ukraine.", "And, there’s no evidence that Hunter Biden, Joe Biden’s son, was involved.", "Hunter Biden served on the board of directors for Ukraine’s largest gas company, Burisma Holdings. President Donald Trump, his personal attorney Rudy Giuliani and Ukrainian lawmaker Andriy Derkach, who released edited tapes of Biden and Poroshenko’s conversations, have suggested that Biden called for Shokin’s firing to protect Burisma Holdings from an investigation that might harm his son.", "“The story is that Hunter got the job and therefore, Biden tried to persuade Shokin not to investigate Burisma. But you can go back, and in 2015, there’s the American ambassador publicly criticizing the prosecutor general’s office for not investigating Burisma. ... It’s quite the opposite: People were asking for investigations of Burisma, not to shut it down,\" Pifer said.", "More:Explainer: Biden, allies pushed out Ukrainian prosecutor because he didn't pursue corruption cases", "At the time Biden called for Shokin’s removal, Burisma Holdings was not under scrutiny, according to the National Anti-Corruption Bureau of Ukraine, an independent agency that has worked closely with the FBI. Shokin's office had investigated Burisma, but the probe focused on a period before Hunter Biden joined the company, according to the anti-corruption bureau.", "“I think it was unwise for Hunter Biden to take any kind of job in Ukraine given that his father – it created an appearance,” Pifer said. “But as far as I can tell there’s no actual conflict.”", "Ukraine found no evidence against Hunter Biden after performing an audit, Reuters reported.", "In Ukraine, anyone can request an investigation if the State Investigative Bureau declines to open one. Courts often order law enforcement to do so even when there is no evidence, and Ukraine’s court system is corrupt, experts say. A probe into President-elect Joe Biden was closed Nov. 10; it found no evidence of wrongdoing. Biden’s actions in Ukraine while he was vice president were not unusual, and there is no legitimate connection to Hunter Biden. We rate the claim that Biden is wanted on bribery charges in Ukraine as FALSE because it was not supported by our research.", "Thank you for supporting our journalism. Youcan subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]