["About this rating", "In December 2020, an online advertisement displayed the words: \"Kate Middleton Just Dropped An Unexpected Baby Bombshell.\" Readers who clicked the ad were led to a 40-page slideshow story from Elite Daily that bore the headline: \"When Kate Had A Candid Conversation With A Fan, She Made An Unexpected Confession About William.\"", "There were two components here. First, the initial advertisement that read: \"Kate Middleton Just Dropped An Unexpected Baby Bombshell.\" Second, the ad led to the 40-page Elite Daily slideshow story, which itself was filled with ads. The goal of the company that created these components was to make more money on the ads that would be displayed during the slideshow than it cost to run the initial \"Unexpected Baby Bombshell\" ad in the first place. This strategy is known as advertising \"arbitrage.\"", "The Elite Daily website detailed over the course of 40 pages that Middleton made two comments in the last two years about the possibility of a fourth baby. While it's true that Middleton did say she and Prince William might not have more kids, it was misleading for the advertisement to say that any of Middleton's comments were from late 2020.", "In January 2020, Middleton said of the idea of more children: \"I don't think William wants any more.\" This comment was nearly a year before the advertisement was still being served by Elite Daily via the Taboola advertising platform. On Jan. 16, 2020, Entertainment Tonight reported:", "During an appearance in Bradford, England, the Duchess of Cambridge was overheard by multiple royal reporters speaking with a fan in the crowd who asked her about a potential royal baby no. 4. She replied, \"I don't think William wants any more.\"", "At the time, Kate had been speaking with Josh Macpalce, a 25-year-old who is autistic and has DiGeorge syndrome, who was telling her about how he sent her a card for the births of each of her children. He then held out his arms to the duchess and she bent down and said, \"Thank you for the hug.\"", "Kate, 38, and William, 37, are parents to 6-year-old Prince George, 4-year-old Princess Charlotte, and 1-year-old Prince Louis.", "Further, Elite Daily also included in its story a moment from March 2019, in which Middleton made a comment regarding the possibility of a fourth child. The International Business Times reported:", "Kate Middleton has expressed her true feelings about having another child. The Duchess of Cambridge admitted to feeling a baby fever when she met a 5-month-old baby boy during her and Prince William's royal tour in Ballymena, Northern Ireland.", "During their visit, the mother-of-three gushed about James Barr, and told his father Alan: \"He's gorgeous. It makes me feel a little broody.\"", "He asked: \"Baby number four?\"", "However, Kate laughed and replied: \"I think William would be a little worried.\"", "In early 2020, a number of rumors and predictions circulated that the couple's fourth baby was on the way and would arrive by year's end. However, as of December 2020, the couple had made no such announcement.", "There has been no shortage of royal family rumors in 2020, especially with the departure of Prince Harry and Meghan Markle, the Duke and Duchess of Sussex. The couple moved to Montecito, California, which is located north of Los Angeles.", "Snopes debunks a wide range of content, and online advertisements are no exception. Misleading ads often lead to obscure websites that host lengthy slideshow articles with lots of pages. It's called advertising \"arbitrage.\" The advertiser's goal is to make more money on ads displayed on the slideshow's pages than it cost to show the initial ad that lured them to it. Feel free to submit ads to us, and be sure to include a screenshot of the ad and the link to where the ad leads.", "Jordan Liles is a Senior Reporter who has been with Snopes since 2016.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]