["A photograph of former Jawaharlal Nehru University (JNU) students, including Kanhaiya Kumar, Umar Khalid and Anirban Bhattacharya is circulating on Twitter with the claim that the death of 76 Central Reserve Police Force (CRPF) soldiers was celebrated in JNU campus.", "pic.twitter.com/XhXomZWwz4", "— Satyamev Jayate (@patriotindian12) January 12, 2020", "The photo has the mark of ‘Social Tamasha’, a Facebook page which has often been found circulating misinformation. The text on the picture reads, “कैसे भूल सकते हो। जब छत्तीसग़ढ में 76 जवान शहीद हुए थे तब इसी JNU में जश्न मनाया गया था। (How can you forget when 76 CRPF soldiers were killed in Chattisgarh, JNU had celebrated the day.)”", "The massacre of 76 security personnel took place in Chattisgarh on April 6, 2010. According to an April 12, 2010 report by NDTV, a group ‘Forum Against War on People’ had organised an event in JNU, opposing the killing of Maoists. The event was held on the day of the massacre which led to clashes within the varsity premises. Student wings of both BJP and Congress unitedly alleged that the event celebrated the Dantewada attack. ‘Forum Against War on People’ however claimed that the event was set to be held on April 5 but had to be delayed for some reasons.", "The report also mentions, “The group [Forum Against War on People] that organised the function didn’t seek prior permission from the university authorities, but it claims the event had nothing to do with the killings in Dantewada.”", "Alt News ran a reverse image search and found the same picture used in a May 13, 2019 story by Outlook, crediting it to photojournalist Sanjay Rawat.", "Alt News contacted Rawat who confirmed that the photograph was shot by him on September 10, 2016. It shows students celebrating the victory of CPI (ML)-affiliated student body All India Students Association (AISA) and CPI’s student wing Students’ Federation of India (SFI) in the 2016 JNU students’ union elections.", "Furthermore, Kanhaiya Kumar was a student at JNU between 2011 and 2019. The Dantewada massacre took place in 2010.", "A photograph from 2016 was falsely shared with the claim that that it shows JNU students, including Kanhaiya Kumar, celebrating the attack on CRPF jawans in 2010. This was when Kumar was not even a student at the university.", "Donate Now", "Defence Correspondent turned fact-checker. Two times award winning journalist by Govt. of Goa.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]