["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "On CNN, host Candy Crowley moderated a conversation between Obamacare supporter Ezekiel Emanuel (center) and Rep. John Fleming, R-La., who opposes the law.", "As the fallout from President Barack Obama’s health care law takes center stage, some critics are raising concerns about how much access Americans will have to insurance and physicians in the future.", "On CNN’s State of the Union, Rep. John Fleming, R-La., a physician and a critic of Obamacare, and Ezekiel Emanuel, a health policy specialist at the University of Pennsylvania who supports the law, faced off.", "At one point, they debated the situation in Massachusetts, where a law similar to Obamacare was signed in 2006.", "As evidence that the federal law won’t work, Fleming said that in Massachusetts, \"half of the primary care doctors are not accepting new patients.\"", "His point was that even if you have insurance, you won’t necessarily be able to see a doctor.", "We decided to check Fleming’s statistic to see if it’s correct.", "The statistic comes from an annual survey by the Massachusetts Medical Society, a professional association founded in 1781 that, among other things, publishes the prestigious New England Journal of Medicine.", "The 2013 edition of the society’s \"Patient Access to Care\" survey -- which was based on 1,137 phone interviews with Massachusetts physicians -- found that 51 percent of family medicine practitioners in the state were accepting new patients. As Fleming indicated, almost exactly half are not.", "We will point out a few caveats, none of which seriously undercut Fleming’s claim.", "• While \"family medicine\" is certainly one type of \"primary care doctor,\" there are others. One type, internal medicine doctors, had a lower percentage (45 percent) accepting new patients, but another, pediatricians, had a higher percentage (70 percent).", "• There is substantial regional variation even within Massachusetts. The largest county in the state, Middlesex, had more doctors accepting new patients, at rates five to eight percentage points higher than the state as a whole. Other counties, such as Suffolk, had rates well below the state average.", "• Your likelihood of being accepted as a new patient depends heavily on what kind of insurance you have. Family medicine doctors accept 90 percent of new Medicare patients and 70 percent of patients with MassHealth, the state’s vehicle for Medicaid and Children’s Health Insurance Program.", "The 2013 survey did not look at new-patient acceptance rates for those who had private insurance or for patients with Commonwealth Care or Commonwealth Choice, the programs created under the 2006 law to insure those who previously had no insurance.", "However, data from the society’s 2011 survey does show a danger sign for those worried that doctors will be unwilling to take patients newly insured by the national health care law.", "The 2011 survey found that family medicine physicians were significantly less likely to accept new patients with Commonwealth Care or Commonwealth Choice -- 56 percent and 44 percent, respectively -- than they were new Medicare and Medicaid patients.", "Equally striking, the survey found, the percentage of family doctors taking new patients with any type of insurance has fallen since 2007 from 70 percent to 51 percent.", "That said, determining whether Massachusetts is out of line on any of these benchmarks is tricky, since comparable data for other states is virtually nonexistent, and the available national data is calculated differently and is several years old.", "Our ruling", "Fleming said that in Massachusetts, \"half of the primary care doctors are not accepting new patients.\" That number is supported by a credible annual survey of Massachusetts doctors. While this doesn’t necessarily mean the same thing will happen on the national level, the statistic is solid. We rate it True.", "John Fleming, comments on CNN’s State of the Union, Oct. 27, 2013", "Massachusetts Medical Society, \"2013 MMS Patient Access to Care Study,\" July 15, 2013", "Massachusetts Medical Society, \"2012 MMS Patient Access to Care Studies,\" Aug. 8, 2012", "Massachusetts Medical Society, \"2011 Patient Access to Health Care Survey,\" May 8, 2011", "Center for Studying Health System Change, \"A Snapshot of U.S. Physicians: Key Findings from the 2008 Health Tracking Physician Survey,\" Sept. 2009", "Centers for Disease Control and Prevention, \"NCHS Data Brief: Generalist and Specialty Physicians: Supply and Access, 2009–2010,\" Sept. 2012", "U.S. Census Bureau, \"Annual Estimates of the Resident Population for Counties: April 1, 2010 to July 1, 2012, Massachusetts\" accessed Oct. 29, 2013", "Joshua Archambault, \"Medicaid Patient Access in Mass.,\" Aug 9, 2012", "Email interview with Rick Gulla, Massachusetts Medical Society spokesman, Oct. 29, 2013", "Email interview with Kelly Gilbert Raskauskas, spokeswoman for the Connecticut State Medical Society, Oct. 29, 2013", "Email interview with Joshua Archambault, director of health care policy at the Pioneer Institute, Oct. 29, 2013", "Email interview with Jonathan Gruber, economist at the Massachusetts Institute of Technology, Oct. 29, 2013", "Email interview with Jonathan Oberlander, professor of social medicine and health policy and management at the University of North Carolina-Chapel Hill, Oct. 29, 2013", "Email interview with R.J. Mills, spokesman for the American Medical Association, Oct. 29, 2013", "Email interview with Doug Sachtleben, communications director for John Fleming, Oct. 29, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]