["The video was published here on Twitter on May 23, 2020. It has been viewed more than 55,100 times.", "The seven-second clip shows a large Buddha statue being washed away down a street as cars pass by.", "The post’s caption reads: “#CHINA – The Situation in the harbour city of #Guangzhou with more than 13 Million inhabitants is worse, due to a flood catastrophe.”", "Torrential rain and flooding was reported across much of the Chinese city of Guangzhou in May 2020. The rainfall was reported by Chinese state newspaper China Daily and the state media company China Global Television Network.", "The video was also shared here on Instagram with a claim that it was taken in the Chinese city of Chongqing and here on Youtube beside a claim that it showed the aftermath of a tsunami in Indonesia.", "However, these claims are false.", "A reverse Google Image search of keyframes extracted from the video found an earlier version of the footage published here on the Spanish forecast website tiempo.com on October 25, 2018.", "The report’s Spanish headline translates to English as: “The effects of DANA in the Canary Islands”.", "DANA is an acronym of “Depresión Aislada en Niveles Altos”, which is a meteorological phenomenon that results in heavy rain and prolonged storms in Spain.", "The Canary Islands is a Spanish archipelago in the Atlantic Ocean.", "The YouTube video embedded in the report, titled “The effects of heavy rain in the Canary Islands”, features a green trash container being swept away -- not a Buddha statue as seen in the misleading posts.", "Below are screenshot comparisons between the video in the misleading post (L) and the 2018 tiempo.com video (R):", "Heavy rain and flooding on the Canary Islands in October 2018 was reported by many local and international media, including here by the Spanish newspaper La Provincia and here by the US television channel ABC.", "The street in Canary Islands' city of Santa Cruz de Tenerife where the flooding occured can be seen here on Google Street View.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]