["Multiple conservative news sources have claimed this week that vote counting software from Dominion Voting Systems deleted votes for President Donald Trump or switched votes to President-elect Joe Biden.", "OAN’s Lilia Fifield made the claim on air earlier this week, per a clip on Mediaite.", "\"Election systems across the country are found to have deleted millions of votes cast for President Trump,\" she said. \"According to an unaudited analysis of data obtained from Edison Research, states using Dominion Voting Systems may have switched as many as 435,000 votes from President Trump to Joe Biden, and the author also finds another 2.7 million Trump votes appear to have been deleted by Dominion including almost one million truckloads in Pennsylvania alone.\"", "Fact or fiction?:We're fact checking the news and sending it to your inbox. Sign up to get that here.", "Similar claims appeared on Gateway Pundit, though it credits the findings to the website thedonald.win, whose author also cites Edison Research.", "Trump himself then magnified the claim.", "“Report: Dominion deleted 2.7 million Trump votes nationwide. Data analysis finds 221,000 Pennsylvania votes switched from President Trump to Biden. 941,000 Trump votes deleted. States using Dominion Voting Systems switched 435,000 votes from Trump to Biden,\" he wrote on Twitter.", "His son Donald Trump Jr. also implied that Dominion Voting Systems had improperly tallied votes for Biden in a post on Instagram.", "\"What's the difference between a Dominion voting machine and Hunter Biden? Nothing. They both give 10% to the 'big guy,'\" the post read.", "OANN, The Gateway Pundit, the White House, and Trump Jr. have not responded to requests for comment from USA TODAY.", "A national coalition announced Thursday that there is no evidence that any voting software deleted or changed votes in last week's election, per USA TODAY.", "In fact, the security group — which includes the Department of Homeland Security's Cybersecurity and Infrastructure Security Agency and the National Association of State Election Directors — described the election as \"the most secure in American history.\"", "\"There is no evidence that any voting system deleted or lost votes, changed votes, or was in any way compromised,\" the coalition concluded.", "More:Fact check: No one was allowed to vote after Nov. 3", "More:Fact check: False claim that deceased Michigan man voted in 2020", "It added that all states with close results have paper records of each vote that allow for a recount, if necessary.", "\"This is an added benefit for security and resilience,\" the coalition wrote. \"This process allows for the identification and correction of any mistakes or errors.\"", "CISA Director Chris Krebs also retweeted a message from election law expert David Becker that condemned \"wild and baseless claims about voting machines,\" according to CBS News.", "Edward Perez, an election-technology expert at the OSET Institute, a nonprofit that studies voting infrastructure, told the New York Times that claims about Dominion voting machines are \"misinformation at best and, in many cases, they’re outright disinformation.\"", "“I’m not aware of any evidence of specific things or defects in Dominion software that would lead one to believe that votes had been recorded or counted incorrectly,\" Perez said.", "Dominion Voting Systems released a statement this week to deny the claims that its machines had deleted or changed votes.", "\"Dominion Voting Systems categorically denies false assertions about vote switching issues with our voting systems,\" the statement reads. \"Vote deletion/switching assertions are completely false.\"", "The statement also addresses some specific details of allegations from Trump and Gateway Pundit.", "Dominion calls the claim from Trump that its machines deleted 941,000 votes for him in Pennsylvania alone \"impossible.\"", "That's because Dominion only serves 14 counties in the state, which produced a total of 1.3 million votes — 52%, or 676,000, of which went to Trump. That only leaves 624,000 other votes, fewer than what Trump claims were switched.", "The statement from Dominion Voting Systems also noted that Edison Research — a firm that OANN and Gateway Pundit cited in their stories — has refuted claims that it produced any data to support allegations of vote switching.", "Larry Rosin, the president of Edison Research, told The Dispatch Fact Check, that it never produced any data to that effect.", "\"Edison Research created no such report and we are not aware of any voter fraud,\" he said.", "A few — though not all — of the counties in Michigan and Georgia that experienced minor issues on Election Day used voting systems made by Dominion.", "But the errors were not glitches with the machine, and there's no indication that the software affected the vote counts.", "In Michigan, inaccuracies in two counties were due to human errors, not software issues, per a statement from the Michigan Department of State. Just one county used software from Dominion.", "\"As with other isolated user errors that have occurred in the reporting of unofficial results both in this and previous elections, this is not the result of any intentional misconduct by an election official or because of software or equipment malfunctioning or failing to work properly,\" the statement read.", "And in one Georgia county, an apparent problem with Dominion software delayed officials’ reporting of the vote tallies but did not affect the actual vote count, per the New York Times.", "Based on our research, the claim that Dominion Voting Systems deleted votes for Donald Trump or switched votes to Joe Biden is FALSE. A national election security coalition announced on Thursday that \"there is no evidence that any voting system deleted or lost votes, changed votes, or was in any way compromised.\" Other experts and Dominion itself also condemned the claims.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook."]