["AFP Fact Check staff in Nigeria received the message several times, without a link to the claimed video. One version claims that US news channel CNN reported the video would “hack” phones when opened.", "“They are going to start circulating a video on WhatsApp that shows how the Covid19 curve is flattening in Argentina,” the message reads.  “The file is called ‘Argentina is doing it’, do not open it or see it, it hacks your phone in 10 seconds and it cannot be stopped in any way.  Pass the information on to your family and friends. Reported on CNN.”", "A similar version of the message has made its way onto Facebook, where it has been shared more than a hundred times, including here.", "It was also shared in South Africa and the United States here, here, here, here, as well as alongside an unrelated video from China here.", "The National Information Technology Development Agency in Nigeria (NITDA) issued a statement dismissing the message as a hoax.", "“The fake news tagged ‘Argentina Is Doing It’, being circulated over social media, particularly on WhatsApp, is aimed at causing panic and inducing terror in individuals,” it reads.", "“This message has been identified as fake.”", "NITDA called “on all well-meaning Nigerians to support the federal government in its efforts at containing the spread of COVID-19 in the country by not spreading fake news”.", "AFP Fact Check ran multiple advanced Google searches on the CNN website and found no reports of WhatsApp video hacks.", "However, the searches did reveal that this type of message has been in circulation from at least 2017.", "“Tomorrow comes a video for whatsapp is called martinelli do not open it hacks the phone in 10 seconds and you can not stop in any way pass the data to yours and friends (sic),” a hoax message from 2017 reads.", "Another fake version from the same year claimed: “Tell all contacts from your list not to accept a video called the Dance of the Pope. It is a virus that formats your mobile. Beware it is very dangerous. They announced it today on the radio. Pass on to as many as you can.”.", "Both messages were debunked here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]