["After supporters of President Donald Trump rioted and breached the U.S. Capitol on Wednesday, President-elect Joe Biden condemned the violence as an \"assault on the rule of law.\"", "\"To storm the Capitol, to smash windows, to occupy offices, the floor of the United States Senate, rummaging through desks, on the Capitol, on the House of Representatives, threatening the safety of duly elected officials – it's not protest, it's insurrection,\" he said from Wilmington, Delaware, according to WBUR-FM in Boston.", "Soon after his remarks, critics claimed on Facebook that Biden had not condemned violent protests by activists from Black Lives Matter and antifa.", "The posts – from users such as Dennis Michael Lynch and Ryan Reynolds – have been shared thousands of times.", "\"Joe Biden gets on TV and riffs into DC protesters as a whole. He doesn't point to just the few who took things too far,\" Lynch wrote. \"I wonder why Joe didn't call for BLM and ANTIFA to stop burning down cities, looting stores, hurting innocent people, and attacking police.\"", "\"Funny watching Biden condemn the today's violence after he stood by SILENTLY for months while Antifa burned city after city to the ground,\" Reynolds wrote.", "Lynch and Reynolds did not respond to requests from USA TODAY for comment.", "Fact check:Social media falsely claims Vice President Mike Pence was arrested", "After George Floyd died under the knee of a Minneapolis police officer May 25, protests by anti-racist and anti-fascist activists erupted around the nation. The demonstrations, which continued throughout the summer, at times turned violent and resulted in deaths and property damage.", "Though Biden voiced support for protesters’ right to demonstrate, he has consistently condemned violence, including acts linked to activists from Black Lives Matter and antifa, a political movement of far-left militants who oppose neo-Nazis and white supremacists at demonstrations and other events.", "Here are five of his statements to that effect last summer.", "On May 29, he told CNN that people “have a right to be, in fact, angry and frustrated. And more violence, hurting more people, isn’t going to answer the question.\"", "On May 31, he wrote in a statement on Medium that protesting police brutality is “right and necessary” and “an utterly American response.\"", "“But burning down communities and needless destruction is not,” Biden wrote. “Violence that endangers lives is not. Violence that guts and shutters businesses that serve the community is not.”", "On June 2, in a speech in Philadelphia, recorded by ABC News, Biden said there is \"no place for violence, no place for looting or destroying property or burning churches or destroying businesses.\"", "\"We need to distinguish between legitimate peaceful protest and opportunistic violent destruction,\" he said.", "On July 28, in a speech in Wilmington, Delaware, he echoed that sentiment, per C-SPAN.", "“Peaceful protesters should be protected – but arsonists and anarchists should be prosecuted – and local law enforcement can do that,\" he said.", "On Aug. 31, after a man was fatally shot in Portland, Oregon, Biden released a statement on his campaign website with another condemnation of protest-related violence: \"The deadly violence we saw overnight in Portland is unacceptable,\" he said. \"Shooting in the streets of a great American city is unacceptable. I condemn this violence unequivocally. I condemn violence of every kind by anyone, whether on the left or the right. And I challenge Donald Trump to do the same.\"", "USA TODAY has debunked similar posts that claimed Biden and Democrats have failed to condemn violent protests.", "Fact check: Images falsely claim to show this week's pro-Trump demonstrations", "Based on our research, the claim that President-elect Joe Biden condemned violence Jan. 6 but didn't condemn violent protests by BLM or antifa last summer is FALSE. From May to August, Biden made at least five statements condemning protest-related violence linked to anti-racist and anti-fascist demonstrations.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]