["The image was published in this Facebook post on September 24, 2019.", "It purports to show teenage climate change campaigner Greta Thunberg on the front cover of a magazine called “People With Money”.", "The post’s caption states: “Greta Thunberg tops annual list of highest-paid activists", "“In 2017 it looked like the activist’s spectacular career was winding down. Suddenly, she was back on top. People With Money reports on Monday (September 23) that Thunberg is the highest-paid activist in the world, pulling in an astonishing $46 million between August 2018 and August 2019, a nearly $20 million lead over her closest competition.”", "Below is a screenshot of the misleading post:", "The same image was published in Facebook posts here, here and here, as well as on Twitter here and here with a similar claim.", "The claim is false; the image of the magazine cover originated on a parody website.", "A Yandex reverse image search of the magazine cover found this article published on a satirical website called Mediamass.", "The article’s headline states; “Greta Thunberg Highest-Paid Activist in the World”.", "It features the magazine cover and similar text to what appears in the misleading Facebook post.", "Below is a screenshot of the article:", "Mediamass describes itself here as “media criticism through satire.”", "“The website mediamass.net is the medium of our satire to expose with humour, exaggeration and ridicule the contemporary mass production and mass consumption that we observe,” the page states.", "The website hosts other articles which claim other people are the highest-paid activists in the world, including Malala Yousafvai, Richard Spencer, and Bianca Jagger.", "A spokesperson for Thunberg told AFP by email on September 25 that the claims about the activist’s earnings were untrue.", "“This post is not correct. Greta never receives payment for her activism. She does not accept fees for any appearances or media engagements. Furthermore, all of the income her family receives from their two books is donated to charity,” the spokesperson said.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]