["About this rating", "In late February 2021, an email newsletter pushed a campaign to recall California Gov. Gavin Newsom. The first of several points made in the email pertained to an incident from Nov. 6, 2020, during the COVID-19 pandemic. On that night, Newsom was said to have dined with lobbyists at the posh French Laundry restaurant in Napa Valley. Photographs also purportedly showed him mask-less, including when he was away from the table.", "The mass email described the incident as one in a \"series of failures\":", "Dear (name), a fellow California voter,", "You probably saw the news or have experienced the failures of Gavin Newsom yourself. California’s public schools statewide remain closed while private schools just miles away are open. Gavin Newsom’s inability or unwillingness to open our schools is going to create an education gap for our students that will be felt for decades. The Sacramento Bee reported that individuals are fleeing the public school system by the thousands!", "This is just one more in a series of failures of Governor Gavin Newsom over the last 12 months.", "- Ordering Californians to stay home and wear masks, while Newsom arrogantly dined - maskless, against his own policy - with lobbyists at the fancy French Laundry restaurant in Napa Valley.", "It's true that Newsom dined with lobbyists at the French Laundry restaurant in Napa Valley. His team initially said that the Nov. 6 dinner was held outside. However, The Los Angeles Times reported that \"clandestine photos showed a private dining room that looked mostly inside.\" A photograph showed the governor mask-less while standing away from the table:", "According to Fox 11 Los Angeles, two lobbyists were present at the dinner. One was Dustin Corcoran, CEO of the California Medical Association. The other was Janus Norman, with the California Medical Association. The dinner was first reported by the San Francisco Chronicle.", "The Associated Press noted that the governor had previously \"pleaded with Californians to resist the temptation to socialize with friends and relatives outside their household.\"", "Newsom later apologized. \"While our family followed the restaurant's health protocols and took safety precautions, we should have modeled better behavior and not joined the dinner,\" he said.", "On Nov. 16, just 10 days after the dinner and ahead of the holiday season, he called for new restrictions on restaurants, churches, and other businesses.", "On March 10, 2021, the \"Recall Gavin Newsom\" campaign published that it reached 2,060,000 signatures. It was paid for by the California Patriot Coalition. The remainder of the email newsletter noted other points as to why the campaign's founders believed Newsom should be recalled.", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "Jordan Liles is a Senior Reporter who has been with Snopes since 2016.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]