["About this rating", "Engineer and entrepreneur Igor Pasternak hosted a fundraiser for U.S. Rep. Adam Schiff in 2013. Pasternak's business, in the past, provided some military hardware to Ukrainian military troops who were fighting Russian forces in Donbas.", "However, Pasternak is not a \"Ukrainian arms dealer.\" He was born in Kazakhstan but is an American citizen. His company, Worldwide Aeros Corp, is based in the U.S. and manufactures airships.", "A smear piece targeting U.S. Rep. Adam Schiff swept a California businessman and engineer into the mix and, in doing so, potentially endangered his child.", "On Sept. 29, 2019, the right-leaning website The Gateway Pundit posted a story headlined, \"EXPLOSIVE REPORT: Rep. Adam Schiff Linked to Prominent Ukrainian Arms Dealer!\" The purported \"arms dealer\" in the story is Igor Pasternak, who is neither a prominent arms dealer nor a Ukrainian.", "Soon after the Gateway Pundit story was published, Fox News primetime host Laura Ingraham boosted the same narrative on her own widely watched program. Both outlets were lashing out in defense of U.S. President Donald Trump, who is facing an impeachment inquiry spearheaded by Schiff, a Democrat from California who chairs the House Intelligence Committee.", "Trump is accused of using his office to obtain damaging information on a political rival from the Ukrainian government. Thus both The Gateway Pundit and Ingraham attempted to make the case that Schiff had equally inappropriate dealings with Ukraine. But the story is thin, based entirely on the fact that Pasternak, an engineer and business owner, hosted a fundraiser for Schiff in 2013.", "Fox News falsely reported that Pasternak \"moved his corporation into [Schiff's] California district\" and stated without proof that Schiff \"could have\" traded political favors for campaign donations.", "Pasternak's company, Worldwide Aeros Corp, is based in Montebello, California, and is not in Schiff's Congressional district (Pasternak's district is the 38th, represented by Linda Sanchez). Pasternak, who spoke to us by phone, said neither Fox nor The Gateway Pundit reached out to him for his side of the story.", "The Gateway Pundit story claims Pasternak \"sold arms in places like Syria\" and \"has also been connected to [billionaire philanthropist] George Soros.\" This is a laughable fantasy, Pasternak said.", "\"It’s not like stretching of the truth or a misrepresent the facts,\" Pasternak told us. \"It just has nothing to do with reality.\"", "It's also not a new narrative. The same story floated in 2018 on a different website, that time in response to a memo authored by Schiff detailing Russian meddling in the 2016 election.", "Pasternak did host a fundraiser for Schiff in 2013, but he told us he has donated to multiple politicians, both Democratic and Republican, a statement that can be confirmed by searching his name on the government transparency tool Open Secrets. And he did design some military hardware, including small arms and surveillance equipment, which were used by the Ukrainian military in that country's conflict with Russian forces.", "But his company's main occupation is the manufacture of airships, also known as lighter-than-air aircraft. Furthermore, Pasternak was raised in Ukraine but was born in Kazakhstan. He is also an American citizen. His mother tongue is Russian, he told us. He doesn't speak Ukrainian.", "Pasternak took The Gateway Pundit's smear against him in stride, joking that the website had publicized \"the best picture of me.\"", "But what attracted his concern was that the story included a collage of images, some of which Pasternak believes were taken from his Facebook account. In that collage were not only pictures of his young son but the boy's name. The story also contained the family's home address. The information has been posted by various troll accounts on social media, prompting Pasternak to contact authorities.", "\"It really to me is not a joke,\" Pasternak told us. \"If it was just me, then OK, thank you for publicizing my best picture.\" But Pasternak, who like Soros is Jewish, read it in a threatening light, noting the collage contained more images of his child than of him. \"They clearly understand he’s the most vulnerable point for me.\"", "Soros, whose foundation donates money to progressive causes, is the frequent target of anti-Semitic conspiracy theories.", "Pasternak said he didn't make any money off the equipment sent to the Ukrainian military and elected to do so after becoming emotionally moved while visiting Maidan square shortly after deadly clashes with protesters and police in 2014. Pasternak said it's possible he has been the target of disinformation because his pro-Ukraine activities in the face of Ukraine's conflict with Russia got him on \"Putin's bad list.\"", "Since at least 2014, the Russians have harnessed social media in the U.S. to spread disinformation to influence public opinion, a technique they deployed in their 2016 U.S. election-interference operation.", "We reached out to Gateway Pundit founder Jim Hoft, asking why the story on his website included the identity and photograph of an uninvolved child, but received no response.", "Although we normally link to stories we fact check, we chose not to do so in this case because the Pundit story identifies a child and contains his picture and address.", "Givas, Nick. \"Laura Ingraham Looks Into Rep. Adam Schiff's Alleged Ukraine Connection, Asks Why Media Ignores It.\"\r\n  Fox News. 2 October 2019.", "Weisburd, Andrew, at al. \"Trolling for Trump: How Russia Is Trying to Destroy Our Democracy.\"\r\n  War on the Rocks. 6 November 2016.", "The New Yorker. \"Inventing a Lighter-Than-Air Aircraft.\"\r\n  YouTube. 21 February 2016.", "DashArt.com.ua. \"Exhibition «Face of War» Showcased in Response to Putin’s Speech at United Nations.\"\r\n  September 2015.", "Traynor, Ian. \"Ukraine's Bloodiest Day: Dozens Dead as Kiev Protesters Regain Territory from Police.\"\r\n  The Guardian. 21 February 2014.", "Ponomarenko, Ilya. \"New Ukrainian M4-WAC47 Rifle 'a Strong Political Message to Russia.'\"\r\n  Kyiv Post. 28 January 2018.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]