["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Questioning why some small businesses around the country must close during the coronavirus pandemic, a recent Facebook post claims that several big companies have yet to see a single of their millions of employees catch COVID-19.", "\"Walmart- 1,500,000 employees, Amazon- 750,000 employees, Kroeger (sic)- 500,000 employees, Target- 350,000 employees, Cosco (sic)- 214,000 employees,\" the post says. \"3,314,000 total employees combined. All of these companies have not had any reported cases in the news. Yet, every employee in these companies encounters thousands of people a day. None of these companies have closed stores. However, all of a sudden, all the meat packing plants are closing and small businesses are still not allowed to open. None of this makes any sense at all.\"", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "And it’s wrong. As early as at least February, employees at these companies were contracting COVID-19 and, in some cases, dying. Here’s just a sampling of the news stories documenting different cases.", "• In Worcester, Mass., one Walmart closed in April after 23 employees there tested positive for COVID-19. As of May 1, that number had nearly doubled; 41 employees have tested positive.", "• Two Walmart employees from a Chicago-area store died of COVID-19.", "• Employees at a New Jersey Amazon warehouse reported about 48 infections there.", "• A worker at an Amazon fulfillment center in Tracy, Calif., died due to complications from COVID-19.", "• An Amazon employee in Seattle who left work feeling ill on Feb. 25 later tested positive for COVID-19. ,", "• Four workers at four separate Kroger stores in Michigan died after they were infected with the disease.", "• In Louisville, Ky., 13 employees at 10 different Kroger stores tested positive.", "• A Target employee in Short Pump, Va., has tested positive.", "• COVID-19 infected more Target employees at stores in Georgia, North Dakota, North Carolina, and California.", "• BuzzFeed reported in late March that Costco employees had said that managers in at least eight stores had notified staff that a coworker had tested positive.", "• An employee at a Seattle-area Costco died after contracting COVID-19.", "COVID-19 cases involving employees at these companies have been well-documented in news reports. We rate this Facebook post False.", "Facebook post, April 29, 2020", "10 Boston, Mass. Walmart closed for cleaning after 23 employees test positive for coronavirus, April 30, 2020", "10 Boston, Cases of Mass. Walmart employees with coronavirus nearly doubles, May 1, 2020", "The Washington Post, Grocery workers are beginning to die of coronavirus, April 6, 2020", "BuzzFeed, These Walmart employees are scared for their lives working through the coronavirus pandemic, April 8, 2020", "Fox Business, Walmart sued over coronavirus death by family of deceased employee, April 6, 2020", "USA Today, Four Michigan Kroger workers die after falling ill with COVID-19, April 14, 2020", "WHAS 11, 13 employees at 10 different Kroger stores test positive for COVID-19 coronavirus, April 21, 2020", "NJ.com, N.J. Amazon warehouse sees coronavirus outbreak with around 48 infections, employees claim, April 30, 2020", "ABC 10, Amazon worker in Tracy facility dies from COVID-19, company confirms, April 29, 2020", "Richmond Times-Dispatch, Target employee in Short Pump tests positive for coronavirus, April 28, 2020", "12 WRDW, Evans Target employee infected with coronavirus, company says, April 24, 2020", "KVRR, Target confirms employee at Fargo store has COVID-19, April 27, 2020", "Patch, Livermore Target employee tests positive for coronavirus, April 24, 2020", "The Charlotte Observer, Target employee at Midtown store tests positive for COVID-19, April 8, 2020", "BuzzFeed, Costco employees are testing positive for the coronavirus and their coworkers say managers aren’t being transparent, March 25, 2020", "BuzzFeed, A Costco corporate employee died from COVID-19 but staff still need approval to work from home, March 18, 2020", "BuzzFeed, More Costco employees have tested positive for the coronavirus days after a coworker died from the disease, March 19, 2020", "The Verge, Amazon confirms Seattle employee is in quarantine with coronavirus, March 3, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]