["About this rating", "In mid-October 2018, dozens of social media accounts started circulating the claim that Barron Trump, the youngest son of President Donald Trump, had been awarded the title of Chess Grandmaster:", "The tweets pushing this rumor also made several other outlandish claims: Some held that Barron Trump had an IQ of 146; others maintained that Barron's father Donald Trump studied under chess legend Bobby Fischer and was himself one of the most celebrated chess players of all time. Many of these tweets were also accompanied by the accusation that the mainstream news media was ignoring the many chess-related accomplishments of the Trump family.", "While it's true that mainstream news has largely ignored these stories, that circumstance isn't due to any perceived bias. These reports were left uncovered for the simple fact that they were untrue.", "The claim that Barron Trump was awarded the tile of Chess Grandmaster stemmed from an October 2017 satirical article published on the web site The Daily Chronicle:", "Everyone knows Barron Trump is the smartest President’s kid ever. Or should we call him First Son?", "Either way, Barron has been awarded the prestigious title of Chess Grandmaster this week from the International Board of Chessmasters ...", "This should be no surprise considering who is father is. Donald Trump is one of the highest ranked and most celebrated American chess players of all time.", "In the 1970s and 80s, Donald Trump studied under the tutelage of players like Bobby Fischer. Eventually, he won hundreds of chess tournaments abroad before retiring at the ripe old age of 40.", "Although the Daily Chronicle website states that they are \"All About The Facts, Not Feelings\" on their About page, they acknowledge that they publish satirical content in their privacy disclaimer.", "We double-checked anyway and found that Barron Trump was not listed among the 1600+ Chess Grandmasters in the World Chess Federation's database.", "If Barron Trump were truly awarded such a title at the age of 11, it would have been newsworthy not only because he is the son of a president, but also because he would have been the youngest person to ever achieve that honor. As of this writing, Sergey Karjakin holds the record for youngest Chess Grandmaster, having been awarded the title in 2003 at the age of 12 years and 7 months.", "Brooks, Gary.   \"Barron Trump Awarded Chess Grandmaster Title.\"\r\n    The Daily Chronicle.   26 October 2017.", "Watson, Leon.   \"Russian Chess Grandmaster Sergey Karjakin Says He is on 'Team Putin.'\"\r\n    Telegraph.   13 November 2017.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]