["About this rating", "Ben Stein, a lawyer by training, has also served as a speechwriter for President Richard M. Nixon, has to date authored dozens of books (both novels and non-fiction efforts), and continues to write editorials and columns for a number of publications.", "He is perhaps best known to the world at large, however, for his in-front-of-the-camera work as the dreadfully dull economics teacher in the film Ferris Bueller's Day Off, his similar role as the monotonic science teacher Mr. Cantwell on the TV series The Wonder Years, and as the keenly competitive host of the former Comedy Central game show Win Ben Stein's Money.", "Mr. Stein has also offered occasional commentaries for the CBS Sunday Morning news program, and the item quoted above is based on one such commentary, titled \"Confessions for the Holidays\" and delivered by Mr. Stein on that program on 18 December 2005, one week before Christmas.  However, we rate this item only \"partly true\" because the versions of this piece which now circulate online typically contain transcription errors, present only a truncated version of the original, and include additional text and other modifications that were not part of the piece as it was first aired.", "Here is the full version as broadcast, taken from a CBS News transcript of the program:", "CHARLES OSGOOD: We all have our own thoughts about the holidays. Here's Ben Stein with his.", "BEN STEIN: Here at this happy time of year, a few confessions from my beating heart. I have no freaking clue who Nick and Jessica are.", "(Footage of People magazine; Us magazine)", "STEIN: I see them on the cover of People and Us constantly when I'm buying my dog biscuits. I still don't know. I often ask the checkers at the grocery stores who they are. They don't know who Nick and Jessica are, either. Who are they? Will it change my life if I know who they are and why they've broken up? Why are they so darned important?", "(Footage of People magazine)", "STEIN: I don't know who Lindsay Lohan is either, and I don't care at all about Tom Cruise's baby.", "(Vintage footage of congressional hearing)", "STEIN: Am I going to be called before a Senate committee and asked if I'm a subversive? Maybe. But I just have no clue who Nick and Jessica are. Is this what it means to be no longer young? Hm, not so bad.", "Next confession: I am a Jew and every single one of my ancestors was Jewish, and it does not bother me even a little bit when people call those beautifully lit-up, bejeweled trees Christmas trees.", "(Footage of Christmas trees)", "STEIN: I don't feel threatened. I don't feel discriminated against. That's what they are — Christmas trees. It doesn't bother me a bit when people say 'Merry Christmas' to me. I don't think they're slighting me or getting ready to put me in a ghetto. In fact, I kind of like it. I shows that we're all brothers and sisters celebrating this happy time of year.", "It doesn't bother me one bit that there's a manger scene on display at a key intersection at my beach house in Malibu.", "(Footage of manger scene; menorah)", "STEIN: If people want a creche, fine. The menorah a few hundred yards away is fine, too. I do not like getting pushed around for being a Jew, and I don't think Christians like getting pushed around for being Christians. I think people who believe in God are sick and tired of getting pushed around, period. I have no idea where the concept came from that America is an explicitly atheist country. I can't find it in the Constitution and I don't like it being shoved down my throat. Or maybe I can put it another way. Where did the idea come from that we should worship Nick and Jessica and aren't allowed to worship God as we understand him? I guess that's a sign that I'm getting old, too. But there are a lot of us who are wondering where Nick and Jessica came from and where the America we used to know went to.", "The following bit about the White House's supposedly renaming Christmas trees as holiday trees began circulating on the Internet at the head of the Ben Stein Christmas piece in October 2011:", "Apparently the White House referred to Christmas Trees as Holiday Trees for the first time this year which prompted CBS presenter, Ben Stein, to present this piece which I would like to share with you. I think it applies just as much to many countries as it does to America", "Ben Stein's  \"Confessions for the Holidays\" debuted in December 2005, and the (false) \"the White House is now going to call them holiday trees\"  didn't appear until August 2009, so no, the former was not written as a reaction to the latter.  (As detailed in our White House Christmas article, Christmas trees continue to be referred to as Christmas trees by the White House, and at no point were they ever called anything else.)", "In mid-2006, someone added the following coda (not written by Ben Stein) to this piece.  It combines older items about a television appearance that Anne Graham Lotz (the daughter of evangelist Billy Graham) made just after the September 11 terrorist attacks and the false claim that the son of child care expert Dr. Benjamin Spock committed suicide:", "In light of the many jokes we send to one another for a laugh, this is a little different: This is not intended to be a joke; it's not funny, it's intended to get you thinking.", "Billy Graham's daughter was interviewed on the Early Show and Jane Clayson asked her \"How could God let something like this Happen?\" (regarding Katrina) Anne Graham gave an extremely profound and insightful response. She said, \"I believe God is deeply saddened by this, just as we are, but for years we've been telling God to get out of our schools, to get out of our government and to get out of our lives. And being the gentleman He is, I believe He has calmly backed out. How can we expect God to give us His blessing and His protection if we demand He leave us alone?\"", "In light of recent events .. terrorists attack, school shootings, etc. I think it started when Madeleine Murray O'Hare (she was murdered, her body found recently) complained she didn't want prayer in body our schools, and we said OK. Then someone said you better not read the Bible in school. the Bible says thou shalt not kill, thou shalt not steal, and love your neighbor as yourself. And we said OK.", "Then Dr. Benjamin Spock said we shouldn't spank our children when they misbehave because their little personalities would be warped and we might damage their self-esteem (Dr. Spock's son committed suicide).  We said an expert should know what he's talking about. And we said OK.", "Now we're asking ourselves why our children have no conscience, why they don't know right from wrong, and why it doesn't bother them to kill strangers, their classmates, and themselves.", "Probably, if we think about it long and hard enough, we can figure it out. I think it has a great deal to do with \"WE REAP WHAT WE SOW.\"", "Funny how simple it is for people to trash God and then wonder why the world's going to hell. Funny how we believe what the newspapers say, but question what the Bible says. Funny how you can send 'jokes' through e-mail and they spread like wildfire but when you start sending messages regarding the Lord, people think twice about sharing. Funny how lewd, crude, vulgar and obscene articles pass freely through cyberspace, but public discussion of God is through suppressed in the school and workplace.", "Are you laughing yet?", "Funny how when you forward this message, you will not send it to many on your address list because you're not sure what they on believe, or what they will think of you for sending it.", "Funny how we can be more worried about what other people think of us than what God thinks of us.", "Pass it on if you think it has merit. If not then just discard it... no one will know you did. But, if you discard this thought process, don't sit back and complain about what bad shape the world is in", "In 2014 the entire conglomeration mistakenly came to be attributed to journalist Steven Levy.", "Stein, Ben.   \"Confessions for the Holidays.\"\r\n    CBS News Transcripts.   18 December 2005.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]