["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "An arrest for marijuana possession by the Idaho State Police in Fruitland, Idaho in 2012. (AP/Nigel Duara)", "Marijuana came up a number of times during the first Democratic debate on Oct. 14, 2015 -- in some cases when candidates were asked whether they had used the stuff, and at other times in the context of criminal justice policy.", "A reader asked us to check one claim by Sen. Bernie Sanders related to marijuana. Late in the debate, Sanders was asked whether he had a position on a proposal to legalize recreational marijuana in Nevada, the state where the debate was being held.", "If he were a Nevada resident, Sanders said, \"I suspect I would vote yes. And I would vote yes because I am seeing in this country too many lives being destroyed for nonviolent offenses. We have a criminal justice system that lets CEOs on Wall Street walk away, and yet we are imprisoning or giving jail sentences to young people who are smoking marijuana. I think we have to think through this war on drugs.\"", "A moment later, Sanders’ rival for the nomination, Hillary Clinton, provided rhetorical support for Sanders’ claim, saying, \"I agree completely with the idea that we have got to stop imprisoning people who use marijuana.\"", "But is it true that, as Sanders put it, the United States is \"imprisoning or giving jail sentences to young people who are smoking marijuana\"? We decided to take a closer look.", "Prisoner data", "What the figures show is that possession itself isn’t usually enough to land someone in jail. Rather, those sentenced to prison for marijuana offenses were typically found to be committing crimes more serious than just possessing marijuana (or \"smoking\" it, as Sanders put it). Often, this means selling it or trafficking it.", "The Justice Department estimated that 3.6 percent of state inmates in 2013 had drug possession as their most serious offense. That includes possession charges for all drugs, not just marijuana. To gauge the marijuana-only percentage, we have to go back to data that’s about a decade old.", "The Justice Department periodically carries out surveys of inmates in state and federal correctional facilities, the last of which was from 2004. According to this study, only about three-tenths of 1 percent of state prison inmates were there because of marijuana possession alone, without a more serious charge.", "Meanwhile, the statistics for federal inmates paint a similar picture.", "The data shows that among the roughly 67,600 offenders sentenced to prison in federal criminal cases between Oct. 1, 2011 and Sept. 30, 2012, only 28 of them were incarcerated on drug-possession charges alone -- roughly four one-hundredths of 1 percent of all incarcerations. And that includes all drugs, not just marijuana.", "Looked at another way, the same report found that 99.9 percent of those sentenced to federal prison for any drug-related crime during that year-long period were sent to prison for something more serious than simple possession.", "Drug policy experts we contacted agree that imprisonment for marijuana possession by itself is rare.", "\"He’s wrong,\" said Jonathan P. Caulkins, a public policy professor and drug-policy specialist at Carnegie Mellon University's Heinz College. \"Basically no one goes to prison just because they use marijuana. The vast majority of time, the people who are in jail for marijuana possession also have other things that are part of their record.\"", "Nancy G. La Vigne, director of the Justice Policy Center at the Urban Institute, agreed. \"Very, very few people are incarcerated for low quantities of marijuana possession,\" she said.", "And Allen St. Pierre -- executive director of the pro-marijuana-legalization group NORML -- concurs, calling Sanders’ claim \"a tad off.\"", "NORML and other groups have estimated that there are 50,000 to 110,000 cannabis-only offenders are in prison in the United States -- yet \"most, but not all, of those incarcerated on marijuana charges are there for cultivation, sales or trafficking,\" he said.", "Some caveats", "All this said, we should note a few points.", "Experts say different jurisdictions may have divergent standards and thresholds in charging defendants for marijuana possession. Some states even consider passing around a joint at a party to be considered \"distributing,\" said Douglas Berman, an Ohio State University law professor.", "In addition, the statistics we cited above do not include people sent temporarily to jail -- potentially a much larger population than those serving sentences prison. The jail population could include people who have violated probation for testing positive for marijuana, or for failing to pay a fine for marijuana possession, said Bill Piper, the director of national affairs for the Drug Policy Alliance.", "Marijuana arrests", "As it happens, Sanders might have been on safer ground had he stuck to citing arrests for marijuana possession rather than prison time.", "St. Pierre said that the most recent FBI data shows that of the roughly 700,000 arrests for marijuana-related charges in 2014, about 90 percent were for possession only -- and these arrests can have radiating consequences.", "Even spending a night or two in jail for marijuana possession can cause \"tremendous disruption to their lives -- they can lose their jobs when they don’t show up for work the next day, or they can miss critical doctor appointments, or they can’t pick up their kids from school,\" Piper said. \"This is regardless of whatever penalty they get, and even if the charges are ultimately dropped.\"", "La Vigne added that the high arrest rates for marijuana possession has other negative consequences, such as racial disparities in exposure to the criminal justice system.", "Indeed, when we checked with Sanders’ staff, spokesman Warren Gunnels cited a news report of the FBI arrest statistics. As for prison time, he said that even if the numbers of people in prison for marijuana possession are relatively small, it’s still more than \"the number of senior executives on Wall Street who went to jail for the near collapse of the economy in 2008\" -- which is the comparison Sanders made during the debate.", "Our ruling", "Sanders said, \"We are imprisoning or giving jail sentences to young people who are smoking marijuana.\"", "Being sentenced to prison for marijuana possession by itself can happen -- but it’s exceedingly rare. Sanders would have been on safer ground had he kept to pointing out continuing high levels of arrests for marijuana possession. These can result in a night in jail and a cascade of problems for those who are arrested, but getting a prison sentence for just smoking a joint is extremely unusual.", "The statement contains an element of truth but ignores critical facts that would give a different impression, so we rate it Mostly False.", "Bernie Sanders, comments in CNN Democratic presidential debate, Oct. 13, 2015", "Department of Justice, \"Prisoners in 2014,\" September 2015", "Department of Justice, \"Survey of Inmates in State Correctional Facilities and the Survey of Inmates in Federal Correctional Facilities,\" 2004", "Justice Department, \"Federal Justice Statistics, 2012-Statistical Tables,\" January 2015", "NORML, \"FBI: Uptick In Marijuana Arrests In 2014,\" Sept. 28, 2015", "Jesse Wegman, \"The Injustice of Marijuana Arrests\" (New York Times op-ed), July 28, 2014", "Washington Post, \"Every minute, someone gets arrested for marijuana possession in the U.S.,\" Sept 28, 2015", "Rolling Stone, \"Myth: Prisons are full of people in for marijuana possession,\" Aug. 22, 2012", "Email interview with Nazgol Ghandnoosh, research analyst at the Sentencing Project, Oct. 14, 2015", "Email interview with Nancy G. La Vigne, director of the Justice Policy Center at the Urban Institute, Oct. 14, 2015", "Email interview with Allen St. Pierre, executive director, and Paul Armentano, deputy director of NORML, Oct. 14, 2015", "Email interview with Bill Piper, director of national affairs for the Drug Policy Alliance, Oct. 14, 2015", "Email interview with Douglas Berman, Ohio State University law professor, Oct. 14, 2015", "Email interview with Jonathan P. Caulkins, public policy professor at Carnegie Mellon University's Heinz College, Oct. 14, 2015", "Email interview with Warren Gunnels, spokesman for Bernie Sanders, Oct. 14, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]