["A video has gone viral on Facebook with the narrative that the victim of the Hyderabad rape and murder case was bestowed an award at a programme for her research in the field of veterinary science. According to the message, “हैदराबाद कांड में दिव्या रेड्डी का देवलोकमन होना केवल एक डॉ. का अंत नही हुआ । बल्कि शासन द्वारा पुरस्कृत एक वेटेरनरी साइंटिस्ट और रीसर्चर हवस के भेट चढ़ गया। यह पूरी दुनिया के लिए महान क्षति है। ॐ शान्ति सादर नमन।” (The Hyderabad case victim’s death is not the end, but it is a huge loss to the world- loose translation).", "The video posted on Facebook by a user has been shared over 5400 times.", "हैदराबाद कांड में दिव्या रेड्डी का देवलोकगमन होना केवल एक डॉ. का अंत नही हुआ । बल्कि शासन द्वारा पुरस्कृत एक वेटेरनरी साइंटिस्ट और रीसर्चर हवस के भेट चढ़ गया। यह पूरी दुनिया के लिए महान क्षति है।🙏 ॐ शान्ति सादर नमन", "Posted by Vashisht Kumar Dubey on Sunday, December 8, 2019", "It is viral on Facebook with an identical narrative.", "The woman seen felicitated in the video is not the victim of the Hyderabad rape and murder case. She is Divya Allola Reddy, the founder of ‘Klimom’, a farm cafe in Hyderabad which focuses on nutrients in cow’s milk and dissemination of the same among the people. This video is of a programme organised on World Milk Day in 2018. At 48 seconds, the woman can be heard introducing herself as Divya Allola Reddy. She was conferred the National Gopal Ratna award in 2018. Moreover, the name of this lady and the name of the Hyderabad victim are not the same. The lady in her speech takes the name of her husband, Gautam Reddy. However, none of the media reports on the Hyderabad case referred to the victim being married.", "Moreover, according to a report published in Deccan Chronicle on April 10, 2019, Divya Reddy is 35 years of age, whereas the Hyderabad rape victim was 26 years old.", "Thus, a video shot in 2018 on the occasion of World Milk Day showing Divya Allola Reddy receiving an award was shared widely on social media as the Hyderabad gang-rape and murder victim.", "Donate Now", "Kinjal Parmar holds a Bachelor of Science in Microbiology. However, her keen interest in journalism, drove her to pursue journalism from the Indian Institute of Mass Communication. At Alt News since 2019, she focuses on authentication of information which includes visual verification, media misreports, examining mis/disinformation across social media. She is the lead video producer at Alt News and manages social media accounts for the organization.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]