["About this rating", "On July 2, 2020, British socialite Ghislaine Maxwell was arrested and charged with conspiring with convicted pedophile Jeffrey Epstein to sexually abuse minors. Shortly afterward, a person claiming to be \"James Maxwell Trump\" started a Twitter account and shared an image supposedly showing a birth certificate proving that he was the biological son of Maxwell and U.S. President Donald Trump.", "This is not a real birth certificate for \"James Maxwell Trump,\" the supposed son of Trump and Maxwell. The above-displayed image is an altered version of a birth certificate for an unrelated person named Tara Ann Uzamere.", "Several red flags indicate this Twitter account is not on the up and up. For starters, it was started in the immediate aftermath of Maxwell's arrest. While some social media users shared photographs of Maxwell and Trump together to imply that the president was involved in the British socialite's alleged illegal activities (Maxwell has been photographed with numerous celebrities and politicians, including Bill Clinton and Michael Bloomberg), this account took the smear tactic one step further and pushed the unfounded claim that Trump and Maxwell had a love child.", "Furthermore, the account profile pic doesn't feature a real person named \"James Maxwell Trump\" (the image is actually a mashup of Trump's and Mark Zuckerberg's faces). Lastly, this account lists its \"location\" as \"in DJTJ's Head,\" a reference to Donald J. Trump Jr. In other words, it appears the goal of this account is to troll the Trump family, not spread legitimate concerns about an illicit affair.", "The birth certificate for \"James Maxwell Trump\" is also fake. This account took an image of a birth certificate for a person named \"Tara Ann Uzamere\" (this is one of the first images that pops up when you search for New York Birth Certificate on Google) and altered a few of the details to make it appear as if this was the birth certificate of a \"James Maxwell Trump.\" However, the fraudulent version maintained the same document numbers and discolorations as the original document.", "The birth certificate for Tara Ann Uzamere has been online since at least August 2019, long before the image of \"James Maxwell Trump\" started to circulate online.", "Although the creator of this hoax document did take care to alter the birth certificate number (top right), they changed it in a way that proves that this document is a hoax. The first three numbers indicate the birth area code, the next two indicate the year of registration, and the last six are serial registration numbers that are sequentially assigned. The Social Security Administration writes:", "Since 1948, most State registrars use a uniform numbering system.", "Birth certificates (BCs) issued by the States generally include an 11-digit number in a xxx xx xxxxxx format. The number begins with a 3-digit birth area code number followed by a 2-digit year of registration (almost always the year of birth) and lastly a 6-digit serial registration number (assigned sequentially to each birth as it is filed).", "On the real birth certificate, we see the first three numbers (156) correctly refer to the location of birth, New York City, and that the second two numbers (80) identify the correct birth year.  On the fraudulent document, the first three numbers indicate that this person was born in Utah (contrary to the listed birth place of Manhattan), and the next two numbers indicate that this birth certificate was registered in 1973, 19 years before this person was allegedly born.", "Dienst, Jonathan, et al.   \"Jeffrey Epstein Confidante Ghislaine Maxwell Arrested on Sex Abuse Charges.\"\r\n    NBC New York.   3 July 2020.", "Apostille Blog.   \"New York City Birth Certificate.\"\r\n    14 February 2019.", "Social Security Administration.   \"Reviewing a Birth Certificate Birth Area Code.\"\r\n    Retrieved 6 July 2020.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]