["About this rating", "On 23 May 2012,  President Barack Obama delivered the commencement address at the United States Air Force Academy (USAFA) in Colorado Springs, Colorado, during which he praised the graduates for establishing a number of records, from the serious to the playful:", "This Academy is one of the most demanding academic institutions in America.  And you have excelled.  I'm told you have set at least three Academy records:  The largest number of graduates ever to go directly on to graduate school; the largest number of female graduates in Academy history — You will follow in the footsteps of General Janet Wolfenbarger, who I was proud to nominate as the first female four-star general in Air Force history.", "And of course, your final and perhaps most impressive distinction — breaking the world's record for the largest game of dodgeball — 3,000 participants, 30 hours.  I didn't know that was possible.  Of course, you are also the class that snuck into the Superintendent’s office and moved all the furniture into your dorm rooms — which does bring me to some important business.  In keeping with longstanding tradition, I hereby grant amnesty to all cadets serving restrictions and confinements for minor offenses.  Of course, I leave it up to General Gould to define \"minor.\"", "The graduation ceremonies included an air show by the Air Force's Thunderbirds air demonstration squadron which, according to one anonymous account, was held up and halted for about half an hour after the jets' initial fly-by due to the departure of President Obama, who was scheduled to attend a fundraiser in Denver (and two in California) later in the day:", "I just wanted to pass on a little info in case some of you were not aware of this. Yesterday was the Air force Academy graduation ceremony. My friend from Texas had just arrived and we drove down the road to watch the Thunderbirds air show after the ceremony was finished. Most of you know Pres. Obama spoke at the ceremony and handed out the diploma's. When this finished it was time for the Thunderbirds to fly. There was one manuever then they disappeared. A man standing by me called a friend at Peterson Field and found out that the air show was halted because Obama wanted to leave. A helicopter soon appeared and flew around in a circular pattern above where we were - basically doing reconnesance as Obama's motor-cade was exiting the Air Force Academy. He was going to Denver to do some more campaigning since Colorado is a swing state. After he left the Thunderbirds came back and continued the show for the graduates. Think about this. Obama comes to a graduation, speaks etc. then decides to leave before the Thunderbirds can complete their air show. They had to fly around, & waste fuel. Thousands of people - the graduating cadets, parents, friends, observers in the vicinity parked in lots waiting to see them fly, inconvenienced, so Obama - his \"highness' could leave to go campaign in Denver! How disrespectful of EVERYONE in attendance. It would have taken only about 20-30 minutes more time to stay until the fly-over was finished thereby honoring the graduates, Thunderbirds and the military in general. However, this narcissistic disgrace of a 'Commander-in-Chief\" had to inconvenience everyone and leave interrupting the ceremony fly-over because everything is about him. I was disgusted by this and so was everyone else standing around near us. I hope this info gets passed on so others can learn how disrespectful this Pres. is toward the military. Not too many who witnessed this will be voting for him.", "This claim was also repeated in a blurb about the ceremonies published in the Colorado Springs Gazette:", "The thousands of graduation revelers at the academy had to wait a while longer for the F-16 Thunderbirds to show up again after their dramatic initial appearance at Falcon Stadium.", "Six Thunderbirds streaked past the cadets as they threw their caps into [the] air.", "But the expected air show afterwards had to wait.", "The presidential motorcade left the academy shortly after the hat toss and the air show took a break as Obama drove down Interstate 25.", "The Thunderbirds came back after a half-hour pause, drawing applause from spectators when they made their return — flying by in the diamond and the arrowhead formations.", "However, according to Tech. Sgt. Raymond Hoy, a Social Media Manager with HQ/USAFA Public Affairs, the delay in the Thunderbirds' air show was due to a refueling stop and had nothing to do with President Obama's departure.  Moreover, he added, it is common for presidents delivering commencement speeches at USAFA graduation ceremonies to leave prior to the air show:", "We've received a lot of queries on this. The president's departure had nothing to do with the delay in the Thunderbird's show, as has been reported. The Thunderbirds had to complete an aerial refuel after their initial flyover; this was planned from the start. They had been flying for a while before that single flyover. I was also told they had new engines and that had something to do with it.  While they were completing this [refueling], the president took the opportunity to leave. The official ceremony is complete after the hat toss/initial flyover.", "Also, presidents typically don't stay for the Thunderbird air show. President Bush didn't stay for the show during either of the graduations he attended. Some previous presidents didn't even stay for the entire ceremony, leaving after their commencement speech.", "The [Colorado Springs] Gazette.   \"AFA Graduation Notes: 1 Grad Ready to Get Married, Relax.\"\r\n    23 May 2012.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]