["The image was published here on August 12, 2020. It was shared in a Hong Kong-based pro-government Facebook group with more than 11,700 members.", "The post’s traditional Chinese-language caption translates to English as: “Agnes Chow has the appearance of an angel, but she has actually been receiving military training in secret. This is very dangerous.”", "Agnes Chow is a prominent Hong Kong activist and co-founder of Demosisto, a now-dissolved pro-democracy political party established in 2016. She was arrested for alleged crimes under Beijing's new National Security Law on August 10, 2020 and released on bail the next day. Here is an AFP report about her arrest.", "The image was also shared here, here, here, here and here on Facebook; as well as here on Gamer, a Taiwan-based forum, alongside a similar claim.", "The claim, however, is false.", "A reverse image search on Google found this video titled “Kamen Rider Zero-One- Episode 2 PREVIEW”, published on YouTube on August 31, 2019.", "The image in the misleading post can be seen at the video’s nine-second mark.", "Below is a screenshot comparison of the image in the misleading post (L) and the YouTube video (R):", "Kamen Rider Zero-One is a Japanese television series broadcast on TV Asahi since September 2019.", "A summary of the second episode on Kamen Rider Zero-One’s official website, as suggested by the title of the YouTube video above, reveals the actress in the scene is Hiroe Igeta. She is listed as playing the part of Yua Yaiba.", "In response to the misleading posts, Chow denied that she had been pictured holding a gun in this August 13, 2020 Facebook post. She shared a screenshot of one of the misleading posts alongside a caption which reads: “Brains are awesome. I wish everybody had one.”", "Joshua Wong, a co-founder of Demosisto alongside Chow, also addressed the misleading posts in this Facebook post published on August 13, 2020.", "Sharing a screenshot of the misleading post, he wrote in traditional Chinese: “People say: ‘once you join a pro-China party, your brain will suffer damage’. Let me tell you a secret; Agnes Chow can transform!”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]