["The photo has been shared more than 200 times after it was posted here on Facebook on March 22.", "The caption states, in part: “Just look at the crying president of #Italy. Italy has the most advance health care facilities but they failed to control #Corona because they were taking it as a joke in initial days & today their president cried that they are short of space for burying dead bodies of Corona victims? Ctto.\"", "COVID-19 has claimed more than 6,000 lives in Italy in one month, according to this AFP report. The global death toll is more than 16,000 according to World Health Organization (WHO) data on March 25.", "Below is a screenshot of the misleading post:", "The photo was also shared on Facebook here, here, here and here; on Twitter here, here, here and here; as well as on Instagram here and here with a similar claim.", "The claim is false; the photo shows Brazil’s president Jair Bolsonaro shedding a tear during a Thanksgiving speech in December 2019.", "A reverse image search on Google found the image in the misleading posts published in this December 2019 report by Brasilia-based news site Poder360 with credit to Sergio Lima, one of the site's photojournalists.", "Below is a screenshot comparison of the photo in the misleading posts (L) and the photo published by Poder360 (R):", "The report states Bolsonaro got emotional at a Thanksgiving service at the Planalto Palace, the president’s office, when he recalled being stabbed in the city of Juiz de Fora during the 2018 election campaign.", "The moment was captured in this YouTube video posted by Planalto on December 17, 2019, alongside a corresponding caption.", "The caption translates to English as: “President Jair Bolsonaro was thrilled to speak this Tuesday (17th) during the Thanksgiving Worship at the Planalto Palace. Bolsonaro recalled the moments when he was in the hospital, after being stabbed in Juiz de Fora, and that he asked God not to leave his daughter an orphan.”", "Below is a screenshot comparison of photos taken from the social media accounts of Bolsonaro (L) and his Italian counterpart Sergio Mattarella (R):", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]