["About this rating", "U.S. Rep. Ilhan Omar of Minnesota is a frequent target of political and sometimes Islamophobic attacks that challenge her loyalty to America. In this vein, several memes have presented claims that Omar once declared some version of the statement, “We are not here to be part of America. We are here to take over America”:", "We found no record of Omar's having said these words. Further, even as a paraphrase, the sentiment expressed by the meme does not accurately reflect her views. Omar has made several public statements that explicitly detail her perspective as a refugee, immigrant, Muslim, and American citizen, and none of those sentiments involve her view that a Muslim's role is to \"take over\" American society.", "“I took an oath to uphold the American Constitution. I am American as everyone else is,” she told Late Show host Steven Colbert in April 2019:", "In several public remarks, Omar has made the argument that American Muslims are just as American as anyone else and should, especially in a nation founded on the principle of religious freedom, be able to fully express themselves in the public sphere as much as any other American. In an April 2019 speech before the Council on American-Islamic Relations (CAIR), for example, Omar argued:", "Muslims, for a really long time in this country, have been told that there is a privilege, that there is a privilege that we are given, and it might be taken away. We are told that we should be appropriate, we should go to school, get an education, raise our children and not bother anyone, not make any kind of noise. Don’t make anyone uncomfortable -- be a good Muslim. But no matter how much we have tried to be the best neighbor, people have always worked on finding a way to not allow for every single civil liberty to be extended to us.", "So the truth is, you can go to school and be a good student. You can listen to your dad and mom and become a doctor. You can have that beautiful wedding that makes mom and dad happy. You can buy that beautiful house. But none of that stuff matters if you one day show up to the hospital and your wife, or maybe yourself, is having a baby, and you can’t have the access that you need because someone doesn’t recognize you as fully human.", "Following that speech, Omar told Voice of America that \"she was not elected to be ‘quiet’ or ‘invisible’ and that ‘I have to use my seat and leverage to represent the voices of those who elected me.’” Omar echoed this point in the aforementioned Late Show interview, telling Colbert “we” — referring to herself and two other progressive female politicians in their first term — “are not there to be quiet. We are not there to be invisible.”", "These statements, articulating Omar’s view that her job as an elected official in America is to protect her constituents' interests in Congress as described in the U.S. Constitution, are a far cry from the claim that she said “We” — meaning Muslims — “are not here to be part of America. We are here to take over America.\"", "Instead, the words ascribed to her in these memes are a commonly employed Islamophobic trope that asserts Muslims are unable to assimilate into America and that their ultimate goal is to covertly change the fabric of American society in their favor. This brand of Islamophobia is known in some circles as “stealth jihad” (a hashtag explicitly included in some of these memes) or in academic circles as “civilization jihad.”", "“Civilization jihad essentially refers to the idea that Muslim migration is a ... deliberate policy of civilizational replacement,” said Jonathon O’Donnell, who researches the politics of demonization as a postdoctoral fellow at the UCD Clinton Institute for American Studies in Dublin, Ireland. Terrorist acts, he told us during a Skype call for a May 2019 Snopes investigation about Islamophobic Facebook pages, are “not the real Jihad to these peoples. The real Jihad is this more subtle form of cultural infiltration and transformation.”", "Because Omar never said the words attributed to her in these memes, and because her actual views on the role of Muslims in American society run demonstrably counter to the notion that they want to \"take over America,” we rank this claim as false.", "Beinart, Peter.   “Ilhan Omar’s Deeply American Message.”\r\n    The Atlantic. &nbsp 15 April 2019.", "The Late Show with Stephen Colbert   (YouTube).   “Rep. Ilhan Omar Is As 'American as Everyone Else'.\"\r\n    11 April 2019.", "The Miami Times.   “Read the Transcript of Rep. Ilhan Omar’s Speech.\"\r\n    15 April 2019.", "Hassan, Mohamed Olad.   “Rep. Omar Speaks to VOA About Remarks That Sparked Controversy.”\r\n    Voice of America. &nbsp 29 April 2019.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]