["About this rating", "On 15 December 2018, the website WeAreTheLlod.com published an article about the alleged arrest of former NFL quarterback Colin Kaepernick:", "Liberal hero Colin Kaepernick loves to “kneel” when he’s making a scene about our “racist” country. But we’re pretty sure he didn’t like being forced to kneel by the Las Vegas police on Sunday.", "Kaepernick was arrested at the home of Marvin “Big G” Kirkpatrick after a neighbor called in a tip about “loud music and possible drug activity.” Police responded at 8:67 PM according to the Las Vegas Reporter. When they knocked at the door, someone inside was heard yelling “Oh **** it’s the cops! Hide the drugs!”", "This is not a genuine news story. WeAretheLlod.com is an entertainment site that does not publish factual stories.", "The site, which is part of the \"America's Last Line of Defense\" network of junk news entities, contains a number of indicators about the satirical nature of its content. For instance, the site's tag line is \"Information you probably shouldn't trust.\"", "Furthermore, the image accompanying this fake news story does not feature Colin Kaepernick. In a somewhat ironic twist, the accompanying photograph actually shows a man being arrested during a protest in St. Louis in September 2017 after former police officer Jason Stockley was found not guilty of the murder of 24-year-old African American Anthony Lamar Smith. Kaepernick is well-known for his on-field protests against racial injustice and police violence.", "WeAretheLlod.com.   \"BREAKING: Colin Kaepernick Arrested in Massive $200k Drug Bust.\"\r\n    16 December 2018.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]