["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A two-year-old viral photo with a disturbing sign about First Lady Melania Trump re-emerged on Facebook on Oct. 8, 2018, garnering more than 11,000 reactions and 8,000 shares. The photo caption said the sign-holder was part of the one-year-old #MeToo movement.", "That’s not true.", "The person holding the sign was planted to discredit protesters of President Donald Trump following the 2016 election, according to numerous news reports. Jack Posobiec, who is credited with planting the sign, also heavily promoted the debunked Pizzagate conspiracy theory and helped organize the DeploraBall, an informal inauguration party marked by clashes between Trump’s supporters and protesters.", "The photo was posted more recently by Joshua Feuerstein, a former pastor who uses social media to promote his vision of evangelical Christianity. Feuerstein notably made headlines in 2015 for his viral video attacking Starbucks over its holiday cups.", "The reposted 2016 photo shows someone in a crowd of people holding a sign that says \"Rape Melania.\"", "\"This is the tolerant left #MeToo movement ... suggesting a sexual assault against the First Lady!!! Wow!!\" the accompanying post read.", "This story was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "That photo has made waves on the internet before, originally posted a week after the 2016 election on Twitter by Alan Beck, a Trump supporter whose account has since been suspended.", "\"DC Trump Protestor (sic) ‘Rape Melania,’\" the original tweet said.", "People debated the legitimacy of the image and whether it was Photoshopped, but photos of the sign exist from different angles, taken by different people, confirming it was there.", "Response and reactions from Twitter users caused \"#RapeMelania\" to trend on Twitter, which prompted criticism against the social media platform for allowing such a hashtag to trend.\n\nThat was all nearly a year before #MeToo took off in October 2017, reigniting a decade-old movement launched by activist Tarana Burk.", "We rate this claim Pants on Fire.", "Joshua Feuerstein, Facebook post, Oct. 7, 2018", "@thereal_beck, tweet, Nov. 16, 2016", "The Washington Post, \"How one deplorable sign at an anti-Trump protest foreshadows the fight over fake news,\" Nov. 15, 2016", "The Washington Post, \"‘Rape Melania’ sign at anti-Trump protest draws strong rebuke, sparking Twitter trend,\" Nov. 13, 2016", "Snopes, \"‘Rape Melania’ Sign at Anti-Trump Protest,\" Nov. 15, 2016", "Buzzfeed, \"Inside The Alt-Right’s Campaign To Smear Trump Protesters As Anarchists,\" Jan. 11, 2017", "Business Insider, \"Trump retweets alt-right conspiracy theorist amid Charlottesville fallout,\" Aug. 15, 2017", "The Atlantic, \"The 'Macron Leaks' Rebel in the Briefing Room,\" May 10, 2017", "The Cincinnati Enquirer, \"Josh Mandel backs 'pizzagate' promoter, dings anti-hate group,\" July 23, 2018", "PolitiFact, \"Evangelical activist focuses on lack of Christmas on new Starbucks cups,\" Nov. 11, 2015", "The Guardian, \"Trump's erratic early morning Twitter retweets include one calling him fascist,\" Aug. 15, 2017", "The Washington Post, \"Pizzagate: From rumor, to hashtag, to gunfire in D.C.,\" Dec. 6, 2016", "The Washington Post, \"Clarendon Ballroom gets harassing calls after declining to host Trump backers’ ‘DeploraBall,’\" Dec. 15, 2016", "The New Yorker, \"From aggressive overtures to sexual assault: Harvey Weinstein’s accusers tell their stories,\" Oct. 10, 2017", "The New Yorker, \"One year of #MeToo,\" Oct. 10, 2018", "The New York Times, \"Harvey Weinstein paid off sexual harassment accusers for decades,\" Oct. 5, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]