["This photo has been shared more than 270 times since posted on Twitter on October 10, 2019.", "Below is a screenshot of the misleading post:", "The post’s Indonesian-language caption translates to English as: “The daughter of King Salman is very beautiful without a hijab. It is sinful to see it but it is unfortunate to ignore it. Where are the comments from the FPI 212? I guarantee your eyes will not blink with this vitamin!”", "“King Salman” refers to King Salman bin Abdulaziz Al Saud of Saudi Arabia. His profile can be read here in the website of Saudi state media Saudi Press Agency.", "“FPI” refers to the Islamic Defenders Front, an Indonesian Islamist organization which organised a mass rally against the then non-Muslim Jakarta governor on December 2, 2016, known as the “212 Rally”.", "The photo was also shared with a similar claim on Facebook here and in a blog post here.", "It was also shared in English on Pinterest here and here with a claim that the woman is Princess Reem Alwaleed bin Talal, another member of the Saudi royal family who is not the daughter of King Salman.", "The claim is false; a Google reverse image search found that the photo was published here on Alamy.com and shows Kardashian attending an event in Los Angeles, California on March 4, 2008. The photo is credited to the entertainment news agency WENN.", "Below is a screenshot of the Alamy photo:", "The photo caption reads: “Kim Kardashian Along with the cast of ‘Entourage’ film a commercial for American Eagle on Melrose Ave.”", "Below is a screenshot comparison of the photo in the misleading post (L) and the Alamy photo of Kim Kardashian (R):", "King Salman does have one daughter named Princess Hassa bint Salman, the Associated Press reported here on September 12, 2019. However, there are hardly any photos of her.", "Some media reports have published a close-up photo of a woman and identified her as Princess Hassa, for example here by The Australian and here by Moroccan news outlet Le 360.", "Below is a screenshot of the report published by The Australian:", "Princess Reem, who is mentioned in the misleading English claims, is the daughter of Prince Alwaleed bin Talal, a Saudi billionaire and the nephew of King Salman.", "Below is a screenshot of the AFP photo of Princess Reem dated July 1, 2015:", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]