["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A voter casts a ballot Nov. 8, 2020, at a polling station in Naypyitaw, Myanmar. (AP)", "In November, after Aung San Suu Kyi’s ruling party in Myanmar claimed an overwhelming victory in the country’s parliamentary election, the military-backed opposition alleged election fraud.", "Myanmar’s election commission rejected those claims, but on Feb. 1, the military seized control of the country and detained Suu Kyi among other members of her party.", "On social media, some proponents of conspiracy theories saw the coup as a sign that something similar could happen in the United States, where supporters of former President Donald Trump have made baseless allegations about voter fraud and sought to overturn his election loss. Many of those claims involved Dominion Voting Systems, which makes election software and hardware.", "Now, another unfounded claim about the company is circulating online.", "\"The White House is freaking out after Myanmar military arrests political leaders for election fraud in their November 8 elections,\" one Facebook post said. \"Myanmar used Dominion Voting Systems.\"", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Searching online, including reviewing news stories about the election and military ouster, we found no evidence to support that claim.", "In a statement, a spokesperson for Dominion told PolitiFact: \"This is a completely false claim. Dominion systems have never been used in Myanmar at any time.\"", "That’s corroborated by a report on the 2020 election in Myanmar, which doesn’t mention Dominion or any electronic voting system. Voters used paper ballots, folding them to ensure secrecy before dropping them in the ballot box.", "We rate this post False.", "Facebook post, Feb. 1, 2021", "2020 General Election in Myanmar — Fact Sheet, 2020", "Reuters, Timeline: Events in troubled Myanmar since Suu Kyi’s NLD party came to power, Jan. 31, 2021", "The Associated Press, Myanmar election commission rejects military’s fraud claims, Jan. 29, 2021", "BBC News, Myanmar coup: What is happening and why?, Feb. 2, 2021", "Rolling Stone, QAnon conspiracy theorist are emboldened by the coup in Myanmar, Feb. 2, 2021", "Statement from Dominion Voting Systems, Feb. 2, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]