["By Rem Rieder", "Posted on October 16, 2020 | Corrected on December 22, 2020", "At a rally in North Carolina, President Donald Trump claimed Joe Biden lives in “beautiful houses all over the place” and must be “corrupt” to afford such a lifestyle. Biden owns two homes and had some lucrative years in the private sector.", "Trump also falsely claimed Biden, the Democratic presidential nominee, and his running mate, Kamala Harris, didn’t send him best wishes when he was stricken with COVID-19. They did.", "Trump, Oct, 15: And then you look at the way Joe Biden lives. He lives on a politician’s salary for his whole life. 47 years, right? And he lives in these beautiful houses all over the place. I haven’t seen him, but he’s a politician and you’re not supposed to live like you’ve made $20 million a year. So he’s corrupt as hell and everyone knows it.", "It is true that Biden, who has long cited his middle-class identity and his roots in working-class Scranton, Pennsylvania, has had a long career in public life. The Delaware Democrat was elected to the U.S. Senate at age 29 in 1972, and served until January 2009, when he began the first of two terms as vice president. He left office in January 2017 and has found some lucrative opportunities since, as many political figures do after they leave government work.", "In August 2019, Forbes estimated that Biden and his wife Jill were worth $9 million. The magazine said their wealth included two Delaware homes valued at $4 million combined, cash and investments worth around $4 million, and a federal pension worth more than $1 million.", "The magazine said that when Biden stepped down as vice president, he filed a financial disclosure form listing assets and liabilities worth somewhere between negative $897,000 and positive $489,000. But over the next 23 months, according to Forbes, citing tax filings, the couple made $15 million.", "Forbes said Joe Biden received $2.4 million in speaking fees and $1.8 million from book tour events. It also said he brought in $775,000 from the University of Pennsylvania, where he is the Benjamin Franklin professor of practice and where he heads the Penn Biden Center for Diplomacy & Global Engagement. It said Jill Biden added $700,000 in speaking fees.", "The Biden/Harris website includes links to Biden’s Office of Government Ethics forms for 2019 and 2020 and his federal income tax returns for 2016. and 2018. The Washington Post detailed Biden’s post-government income in a June 2019 story on how he “reaped millions in income since leaving the vice presidency.”", "While Trump is right that Biden spent many years on a government salary, the former vice president has had some very lucrative years in the private sector. Biden doesn’t have houses “all over the place.” He has two, including a vacation house in Rehoboth Beach, Delaware. And there is no evidence he earned money through any kind of corruption.", "At the rally, Trump also referred to the fact that the Biden campaign had announced on Oct. 15 that Harris’ communications director and a member of her flight crew had tested positive for COVID-19. Harris canceled her campaign travel through Oct. 18 as a result.", "Trump, Oct. 15: But we worry about [Harris]. I’m very concerned about her, because as you probably just heard just before I walked out, two of the people that travel with her, her chief of staff and somebody else in the plane with her all the time, they have been tested positive for COVID- 19. So we extend our best wishes, right? Right? Yes? We extend our best wishes. We extend our best, which is more than they did to me. But that’s OK. That’s OK.", "In fact, both Biden and Harris had made the gesture. Harris did so via Twitter on Oct. 2, the same day Trump revealed he and the first lady had tested positive, wishing the president and First Lady Melania Trump “a full and speedy recovery.”", "Doug and I join Joe Biden and Dr. Biden in wishing President Trump and the First Lady a full and speedy recovery. We’re keeping them and the entire Trump family in our thoughts.", "— Kamala Harris (@KamalaHarris) October 2, 2020", "Biden also tweeted on Oct. 2, wishing the first couple “a swift recovery.”", "Jill and I send our thoughts to President Trump and First Lady Melania Trump for a swift recovery. We will continue to pray for the health and safety of the president and his family.", "— Joe Biden (@JoeBiden) October 2, 2020", "Trump was admitted to Walter Reed National Military Medical Center on Oct. 2 and spent three nights there. Soon afterward he returned to the campaign trail.", "On the day Trump left the hospital, Biden started a campaign speech by saying, “And let me also say at the top, my prayers continue to be with the president and the first lady for their health and safety as they, like so many American families, are dealing with COVID-19.”", "Correction, Dec. 22: We originally omitted the word “Beach” from Rehoboth Beach, Delaware.", "Editor’s Note: Please consider a donation to FactCheck.org. We do not accept advertising. We rely on grants and individual donations from people like you. Credit card donations may be made through our “Donate” page. If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, 202 S. 36th St., Philadelphia, PA 19104.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here for more.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]