["About this rating", "Two common forms of modern folklore are claims that familiar old bits of rhyme and song (such as the nursery rhyme \"Ring Around the Rosie\") encode \"hidden\" meanings which have been passed along for centuries, and claims that common objects of secular origin — particularly objects associated with Christmas (such as the candy cane) — were deliberately created to embody symbols of Christian faith. Here we have an article that combines both these forms and posits that a mirthful Christmas festival song about romantic gift-giving actually originated as a coded catechism used by persecuted Catholics:", "Example:   [Collected via e-mail, 1998]", "You're all familiar with the Christmas song, \"The Twelve Days of Christmas\" I think. To most it's a delightful nonsense rhyme set to music. But it had a quite serious purpose when it was written.It is a good deal more than just a repetitious melody with pretty phrases and a list of strange gifts.", "Catholics in England during the period 1558 to 1829, when Parliament finally emancipated Catholics in England, were prohibited from ANY practice of their faith by law - private OR public. It was a crime to BE a Catholic.", "\"The Twelve Days of Christmas\" was written in England as one of the \"catechism songs\" to help young Catholics learn the tenets of their faith - a memory aid, when to be caught with anything in writing indicating adherence to the Catholic faith could not only get you imprisoned, it could get you hanged, or shortened by a head - or hanged, drawn and quartered, a rather peculiar and ghastly punishment I'm not aware was ever practiced anywhere else. Hanging, drawing and quartering involved hanging a person by the neck until they had almost, but not quite, suffocated to death; then the party was taken down from the gallows, and disembowelled while still alive; and while the entrails were still lying on the street, where the executioners stomped all over them, the victim was tied to four large farm horses, and literally torn into five parts - one to each limb and the remaining torso.", "The songs gifts are hidden meanings to the teachings of the faith. The \"true love\" mentioned in the song doesn't refer to an earthly suitor, it refers to God Himself. The \"me\" who receives the presents refers to every baptized person. The partridge in a pear tree is Jesus Christ, the Son of God. In the song, Christ is symbolically presented as a mother partridge which feigns injury to decoy predators from her helpless nestlings, much in memory of the expression of Christ's sadness over the fate of Jerusalem: \"Jerusalem! Jerusalem! How often would I have sheltered thee under my wings, as a hen does her chicks, but thou wouldst not have it so...\"", "The other symbols mean the following:", "2 Turtle Doves = The Old and New Testaments\n3 French Hens = Faith, Hope and Charity, the Theological Virtues\n4 Calling Birds = the Four Gospels and/or the Four Evangelists\n5 Golden Rings = The first Five Books of the Old Testament, the \"Pentateuch\", which gives the history of man's fall from grace.\n6 Geese A-laying = the six days of creation\n7 Swans A-swimming = the seven gifts of the Holy Spirit, the seven sacraments\n8 Maids A-milking = the eight beatitudes\n9 Ladies Dancing = the nine Fruits of the Holy Spirit\n10 Lords A-leaping = the ten commandments\n11 Pipers Piping = the eleven faithful apostles\n12 Drummers Drumming = the twelve points of doctrine in the Apostle's Creed", "Some versions of this piece do not specifically mention Catholicism or England. In these alternate versions, the song \"The Twelve Days of Christmas\" is said to have been developed by Christians who could not openly practice their faith because they lived in societies where Christianity was forbidden. Locating a place in the western world where the practice of Christianity was banned during the last several centuries is difficult enough, but trying to discern the usefulness of a Christmas song as a method of preserving tenets of Christianity in a society where the practice of Christianity itself was outlawed is truly a mind bender, since in such a society all facets of Christmas celebrations would surely be banned as well. Therefore, our discussion here will concentrate on the claim that \"The Twelve Days of Christmas\" was the creation of Catholics living in England after the Anglican Reformation.", "The history of the development of the Anglican Church and the relationship between Anglicans and Catholics in England over the subsequent centuries is a complex subject which could not be done justice in anything less than a lengthy and detailed discourse. (For an overview of the topic, we recommend the entry on \"England [Since the Reformation]\" in The Catholic Encyclopedia.) In short, the era under discussion begins with King Henry VIII's (1509-1547) break with the Catholic Church", "in Rome and his establishment of the Anglican Church. In 1558, Henry's Catholic daughter Mary I died, and her non-Catholic half-sister Elizabeth I took the throne; the following year the Act of Uniformity abolished \"the old worship,\" and the open practice of Catholicism was forbidden by law until Parliament passed the Catholic Emancipation Act in 1829. However, it is not accurate to say that, without exception, anyone caught practicing Catholicism (or possessing material indicating adherence to Catholicism) at any time during this 270-year period was immediately imprisoned or executed. The state's toleration of Catholicism waxed and waned with the political exigencies of the times, and during some periods Catholics were treated more leniently than others. (As an interesting side note, we should mention that during the Puritan Commonwealth of 1649-1660, legislation banning the celebration of Christmas in England by anyone, Anglican or otherwise, was enacted, although these laws were overturned with the restoration of the monarchy in 1660.)", "Two very large red flags indicate that the claim about the \"secret\" origins of the song \"The Twelve Days of Christmas\"\nis nothing more than a fanciful tale, similar to the many apocryphal \"hidden meanings\" of various nursery rhymes:", "Moreover, several flaws in the proffered explanation argue compellingly against it:", "What little has been offered in support of this claim is decidedly unconvincing. This piece is often attributed to Fr. Hal Stockert, and in his explanation on a page from the web site of the Catholic Information Network, he wrote:", "I found this information while I was researching for an entirely unrelated project which required me to go to the Latin texts of the sources pertinent to my research. Among those primary documents there were letters from Irish priests, mostly Jesuits, writing back to the motherhouse at Douai-Rheims, in France, mentioning this purely as an aside, and not at all as part of the main content of the letters.", "So where is the information gleaned from these letters? As Fr. Stockert explained to syndicated religion writer Terry Mattingly in 1999:", "\"I've got all kinds of people writing me demanding references for my work,\" he said. \"I wish I could give them what they want, but all of my notes were ruined when our church had a plumbing leak and the basement flooded.\" Meanwhile, he said, his copy of the original article is on \"a computer floppy disk that is so old that nobody has a machine that can read it, anymore.\"", "What we do know is that the twelve days of Christmas in the song are the twelve days between the birth of Christ (Christmas, December 25) and the coming of the Magi (Epiphany, January 6). Although the specific origins of the song \"The Twelve Days of Christmas\" are not known, it possibly began as a Twelfth Night \"memory-and-forfeits\" game in which the leader recited a verse, each of the players repeated the verse, the leader added another verse, and so on until one of the players made a mistake, with the player who erred having to pay a penalty, such as a offering up a kiss or a sweet. This is how the song was presented in its earliest known printed version, in the 1780 children's book Mirth Without Mischief. (The song is apparently much older than this printed version, but we do not currently know how much older.) Textual evidence indicates that the song \"The Twelve Days of Christmas\" was not English in origin, but French. Three French versions of the song are known, and items mentioned in the song itself (the partridge, for example, which was not introduced to England from France until the late 1770s) are indicative of a French origin.", "It is possible that \"The Twelve Days of Christmas\" has been confused with (or is a transformation of) a song called \"A New Dial\" (also known as \"In Those Twelve Days\"), which dates to at least 1625 and assigns religious meanings to each of the twelve days of Christmas (but not for the purposes of teaching a catechism). In a manner somewhat similar to the memory-and-forfeits performance of \"The Twelve Days of Christmas,\" the song \"A New Dial\" was recited in a question-and-answer format:", "(Using ordinary objects to represent biblical concepts is a common device, as exemplified by the several popular recordings of Deck of Cards.)", "\"The Twelve Days of Christmas\" is what most people take it to be: a secular song that celebrates the Christmas season with imagery of gifts and dancing and music. Some misinterpretations have crept into the English version over the years, though. For example, the fourth day's gift is four \"colly birds\" (or \"collie birds\"), not four \"calling birds.\" (The word \"colly\" literally means \"black as coal,\" and thus \"colly birds\" would be blackbirds.) The \"five golden rings\" refers not to five pieces of jewelry, but to five ring-necked birds (such as pheasants). When these errors are corrected, the pattern of the first seven gifts' all being types of birds is re-established.", "Nonetheless, plenty of writers continue to expound upon \"the beauty and truly biblical and spiritual meanings locked away in this wonderful song that puts Christ into Christmas where he doesn't appear to be.\" Perhaps those who consider this tale to be \"beautiful\" and \"inspirational\" (despite its obviously dubious truthfulness) should consider its underlying message: That one group of Jesus' followers had to hide their beliefs in order to avoid being tortured and killed by another group of Jesus' followers. Of all the aspects of Christianity to celebrate at Christmastime, that doesn't sound like a particularly good one to emphasize.", "Butler, William S. and L. Douglas Keeney.   Secret Messages.\r\n    New York: Simon & Schuster, 2001.   ISBN 0-684-86998-5   (p. 116-117).", "Dearmer, Percy.    The Oxford Book of Carols.\r\n    London: Oxford Univ. Press, 1928.", "Grant, Leigh.    Twelve Days of Christmas: A Celebration and History.\r\n    New York: Harry N. Abrams, 1995.   ISBN 0-8109-3881-2.", "Mattingly, Terry.   “A Christmas Mystery — 12 Days Worth.”\r\n    22 December 1999   [syndicated column].", "McKellar, Hugh D.   “The Twelve Days of Christmas.” \r\n  The Hymn.   October 1994   (pp. 30-32).", "Nissenbaum, Stephen.   The Battle for Christmas.\r\n    New York: Vintage Books, 1997.   ISBN 0-679-74038-4.", "Opie, Iona and Peter.   The Oxford Dictionary of Nursery Rhymes.\r\n    New York: Oxford University Press, 1997.   ISBN 0-19-860088-7   (pp. 470-471).", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]