["A photo of President Donald Trump and the first lady on Marine One en route to the final presidential debate in Nashville, Tennessee, has revitalized a conspiracy theory that the White House uses a body double to sub in for Melania Trump.", "\"The first picture of Trump and 'Melania' is from today — except it really doesn't look like Melania. This has happened a few times before,\" a post on Facebook reads. \"They just don't look like her ... some people are suggesting its her secret service agent who goes everywhere....\"", "Another post contains a screenshot of a tweet with the same photo, and the caption, \"Today's photo of a fake Melania. They think we won't notice this?", "Fact or fiction:We're fact checking the news and sending it to your inbox. Sign up to get that here.", "The users behind the posts have not responded to requests from USA TODAY for comment.", "The conspiracy theory that Melania Trump has a body double dates back to October 2017, and resurfaced at least twice, in July 2018 and March 2019.", "Each time, the allegations center on photos or videos of Melania Trump that social media users think just don't look like her. But that's relatively easily explained.", "An oft-cited video, for example, shows her face as \"slightly shrunken, distorted, and rounder,\" per Snopes. That's because it is footage of a television screen. Compared with the actual broadcast, it's clear that the first lady's strange appearance is \"not evidence of a body double. It’s evidence of a poorly working television.\"", "The recent photo from the debates was also an anomaly.", "In all the other snaps taken that day — including photos of the first couple in Marine One taken by the same photographer, Alex Brandon — Melania Trump looks like her usual self, per images available to USA TODAY via Associated Press.", "Akili Ramsess, the executive director of the National Press Photographers Association, previously explained to the Associated Press that the angle at which the photos are taken, the type of camera lens that is used, and the positioning of the photographer can all impact how subjects appear in photos.", "The conspiracy has also been fueled by the fact that Melania Trump appears to have a Secret Service agent who looks \"strikingly similar\" to her, per Business Insider.", "Jonathan Wackrow, a former Secret Service agent who served on the first family's detail, told CNN that \"the United States Secret Service doesn't use body doubles.\"", "\"Mrs. Trump's lead agent is a woman ... and she happens to look a little like her, but physically, she is much shorter,\" he said.", "He also said the lead agent spent time on assignment with former President Barack Obama's family, which was what made her a good fit for Trump.", "\"Those are the sorts of details considered, not at all whether an agent is some sort of body double,\" he said.", "More:Fact check: Viral comparison of Obamas, Trumps on charity and staffing is not all true", "The White House has not responded to multiple requests from USA TODAY for comment on the most recent allegations that the first lady has a body double.", "But the East Wing and Donald Trump himself have both condemned past iterations of the conspiracy theory.", "In October 2017, after the rumor cropped up on Twitter, Stephanie Grisham, communications director for the East Wing, told CNN that there is no truth to the theory.", "\"Once again, we find ourselves consumed with a ridiculous non-story when we could be talking about the work the first lady is doing on behalf of children, including the opioid crisis that is gripping our nation,\" Grisham said.", "There was another resurgence of the theory in March 2019, after the first lady accompanied President Trump on a visit to survey tornado damage in Alabama, per the Associated Press. That time, Trump took it upon himself to debunk the claim — though he blamed it, without evidence, on the media.", "\"The Fake News photoshopped pictures of Melania, then propelled conspiracy theories that it’s actually not her by my side in Alabama and other places,\" he wrote on Twitter.", "Grisham also took aim at the hosts of ABC's \"The View\" for discussing the theory on air, and said the episode \"went beyond the petty mean-girl spirit that we’ve grown accustomed to.”", "“People died, people lost family, people are hurting in Alabama,” Grisham told the Associated Press. “I personally watched the president and first lady hug, listen to and comfort people who had lost everything — and the ‘ladies’ of The View instead chose to laugh and joke about a body-double conspiracy.”", "Based on our research, the conspiracy theory that the White House has used a body double to sub for Melania Trump is FALSE. The White House and President Donald Trump have denied it, and the photos and videos that have been cited as proof of the theory have been anomalies. After all, no one looks the same in every photo that is taken of them.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]