["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Sen. Kamala Harris, D-Calif., speaks at the Black Enterprise Women of Power Summit, Friday, March 1, 2019, in Las Vegas. (AP Photo/John Locher)", "In her book, \"The Truths We Hold,\" California Sen. Kamala Harris asks \"How can you dream when you are drowning in student loan debt?\" in a section on the rising cost of living in America.", "On the campaign trail, the Democratic presidential hopeful has called student loan debt \"one of the biggest challenges facing our country and our students.\"", "In the Senate, she helped re-introduce the Debt-Free College Act, a bill she says will help reverse the growing student debt crisis. Specifically, it would provide states incentives through matching grants to increase investments in public higher education.", "The senator then made this eye-popping claim about how fast student loan debt has grown in a news release on March 6 announcing her support for the bill:", "\"College debt has increased 170 percent since 2006 and now exceeds $1.5 trillion dollars, which is second only to mortgage debt and surpasses even credit card debt.\"", "She tweeted a similar claim a few days later.", "But is student loan debt really growing that fast? And is it really second only to mortgage debt? We decided to crunch Harris’ numbers in this fact check.", "Our research", "To support the statement, a spokesman for Harris cited a Federal Reserve table showing the nation’s cumulative student loan debt for each year from 2006 through 2018. He also cited articles from The Washington Post and MarketWatch.", "The Federal Reserve table shows student loan debt at the end of 2006 was $521 billion. By the end of 2018, the most recent period available, it had grown to $1.57 trillion — which matches with Harris’ claim that it \"now exceeds $1.5 trillion.\"", "But after calculating the numbers, we found an increase of 201 percent, an even faster rate than the 170 percent Harris referenced.", "\"I’d say that her statement is mostly correct,\" said Mark Kantrowitz, a national financial aid expert. \"The one slight error: She actually underestimates the growth of student loan debt outstanding.\"", "Kantrowitz is publisher and vice president of research for SavingforCollege.com, a guide to college savings plans.", "\"The only way I get to 170 percent,\" he added, \"is if I compare the current debt outstanding to 2007 instead of 2006. That works out to be 170 percent.\"", "Hans Johnson, director of the Public Policy Institute of California’s Higher Education Center, also reviewed the data and found a 200 percent increase based on the most current Federal Reserve figures.", "SOURCE: Federal Reserve student loan data.", "Why is college debt growing so fast?", "More students going to college accounts for some of the growth of student loan debt, but only a small portion, Kantrowitz said.", "In 2006, there were 15.2 million college students. A decade later, that number had increased 11 percent to 16.9 million, he said, citing figures from the National Center for Education Statistics.", "Kantrowitz added that another factor is that federal grants have slowed as tuition has gone up. States often cut tuition assistance at the first signs of a financial crisis.", "The average student loan debt was nearly $30,000 for students graduating with a bachelor’s degree in 2018, Kantrowitz said. That is up from nearly $21,000 in 2006.", "College debt \"second only to mortgage debt and surpasses even credit card debt\"", "We found this part of Harris’ statement is accurate. In 2014, PolitiFact Virginia reported that \"student debt began to outpace credit card debt in the second quarter of 2010,\" citing data from the Federal Reserve Bank of New York.", "At the end of 2018, the nation’s overall credit card debt was $870 billion and mortgage balances stood at $9.1 trillion, according to the data.", "Our rating", "Sen. Kamala Harris said \"College debt has increased 170 percent since 2006 and now exceeds $1.5 trillion dollars, which is second only to mortgage debt and surpasses even credit card debt.\"", "She actually understated how fast student loan debt is growing. The most recent Federal Reserve figures show it’s increased 201 percent since 2006.", "Harris was right about college debt topping $1.5 trillion, and being second only to mortgage debt.", "We rate her overall statement Mostly True.", "MOSTLY TRUE – The statement is accurate but needs clarification or additional information.", "Click here for more on the six PolitiFact ratings and how we select facts to check.", "Sen. Kamala Harris, news release, Harris Joins Colleagues to Reintroduce Legislation to End Student Loan Debt Crisis, March 6, 2019", "Sen. Kamala Harris, tweet, March 11, 2019", "Chris Harris, spokesman for Sen. Kamala Harris, email exchange March 12, 2019", "Federal Reserve, Consumer Credit Outstanding (Levels), accessed March 2019", "Federal Reserve Bank of New York, Center for Microeconomic Data, accessed March 2019", "The Washington Post, column, U.S. student loan debt reaches a staggering $1.53 trillion., Oct. 3, 2018", "MarketWatch, Student debt just hit $1.5 trillion, May 12, 2018", "PolitiFact Virginia, Warner says U.S. student debt has surpassed credit card debt, June 10, 2014", "Mark Kantrowitz, publisher and vice president of research, SavingforCollege.com, phone interview, March 13, 2018", "Hans Johnson, director, Higher Education Center at the Public Policy Institute of California, email exchange March 20, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]