["“Happened today on 47 street ( Diamond Market) New York $100,000 given away.👇🏼👇🏼in ref to modi victory .. see how this millionaire Indian doing ..”, reads the caption posted along with a video of an individual throwing away cash on the streets.", "Happened today on 47 street ( Diamond Market) New York $100,000 given away.👆🏻👆🏻👆🏻in ref to modi victory .. see how this millionaire Indian doing ..", "Posted by Muralidharan Sundaram on Thursday, 23 May 2019", "This video has been shared by several individuals on Twitter and Facebook. It is being claimed that the incident took place in New York after Narendra Modi was re-elected as the Prime Minister for the second term.", "The video was also shared on WhatsApp.", "A YouTube search with keywords, “money shower new york”, led us to the same video uploaded on May 15, 2019. The video was titled, “Money Shower – The God Joe Kush throwing real $5 Bills on 47th street in the diamonds district in NY”.", "Alt News found the Instagram account of Joe Kush, who had a video of the same incident, where he showered money at a crowd on 47th street, New York. According to his Instagram account, Joe Kush is a video engineer and music producer.", "Surprised My Bratha @traxnyc Where To Next 😂😂 #NewYork #TheGod$✅ I ❤️ NYC @fredjproductions #MoneyShowerTour ☔️☔️#NewYorkCity ✈️#ThankGod ‼️#Detroit #Free #TheGod$✅ #Losangeles #Music 🎙#Newyork #Miami #lasvegas 🚨🚨🚔🚔#MoneyShowerTour #TheRainMan #KushGod #MoneyGod #rollsroyce", "A post shared by TheGod Joe Kush (@thegod_joekush) on May 16, 2019 at 7:04am PDT", "There are several videos of “money showers” carried out by Joe Kush. These visuals have also featured in the Kush’s music video.", "An unrelated video of a person throwing money away on the streets of New York was shared with a false claim that an Indian millionaire celebrating PM Modi’s return to power.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]