["About this rating", "In October 2016, a security camera at an underground subway station in Berlin captured footage of a man kicking a woman down a flight of stairs.", "The video was published by the German newspaper Bild in December 2016 in a report about senseless violence in the city:", "A spokesperson for the Berlin Police Workers' Party, told Bild : \"The incident shows in a brutal and shocking way how quickly everyone in every city in this city can become a victim of senseless violence.", "\"If we can not get more police off the streets and build the necessary pressure from the judiciary through tougher punishments, we run the risk that more and more people believe in our city is the law of the strongest.\"", "While the attacker was not identified in the original report, several web sites picked up on the video and shared it along with the claim — which was apparently made up and shared with the video without any proof or corroborating information at all — that it showed a Muslim immigrant kicking a woman down the stairs.", "RightWingNews.com, for instance, shared the video on 9 December 2016, along with the sensational title \"JUST FOR FUN! Muslim Migrants Kick German Girl Down Flight Of Stairs — Caught On CCTV [VIDEO].\" At the time this article was published, however, nobody had been arrested for the crime, and no attacker had been identified.", "On 12 December 2016, German police announced that they were questioning somebody connected to the attack:", "On 17 December 2016, Berlin Police announced that they had arrested a suspect allegedly responsible for the attack. He was not identified in the police report, but German media named him Svetoslav Stoykov, a 27-year-old from Bulgaria. Neither the man's religion nor his motivation for the attack were confirmed in the report.", "The Local.   \"Man Arrested for Kicking Woman Down Berlin U-Bahn Stairs.\"\r\n    19 December 2016.", "McCrum, Kristie.   \"Senseless Violence' as Leather-Jacketed Thug Kicks Woman Down Subway Stairs and She Lands on Her FACE.\"\r\n    The Mirror.   8 December 2016.", "Bild.   \"Sinnlose Gewalt Kann Jeden Treffen.\"\r\n    7 December 2016.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]