["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "This March 13, 2008, shows AK Steel's Middletown Works plant in Middletown, Ohio. Author J.D. Vance's book \"Hillbilly Elegy: A Memoir of a Family and Culture in Crisis\" provides a vivid tour of the stark world he grew up in. (AP)", "J.D. Vance, the author of the 2016 memoir Hillbilly Elegy, said that many Americans in the middle part of the country will become \"political frustrated\" if President Donald Trump doesn’t deliver on promises to grow their paychecks and improve the economy.", "While there are pockets of entrepreneurship across the country, there are few high-growth startup companies outside of California, New York and Boston, Vance said in a Dec. 31 interview on CBS’ Face the Nation.", "\"So the statistic I throw out is 50 percent of venture capital goes to California,\" Vance said. \"Most of the rest of it goes to New York and Massachusetts. That means there's 47 states fighting over a very small amount of the type of investment that creates really high quality, long term, durable jobs.\"", "Vance said that if more investment can be made in some of these other states it would create more high-quality job growth.", "Vance is a partner in the Revolution investment firm, which launched a bus tour to shine a spotlight on startups and invest in companies not located in Silicon Valley. Senate Majority Leader Mitch McConnell courted Vance to run against U.S. Sen. Sherrod Brown, D-Ohio, but Vance declined.", "We wondered about Vance’s statement about how venture capital is divvied up nationwide. We found those three states are the leading homes for venture capital, but Vance's point requires a bit more explanation.", "A spokeswoman for Revolution said that Vance was referring to data by the National Venture Capital Association, a trade association comprised of venture capital firms and corporate venture groups.", "The association’s annual yearbook compiles data on companies, closed deals and invested capital.", "In 2016, California had 55 percent of venture capital money, followed by New York at 10.6 percent and Massachusetts at 8.9 percent.", "In total, the three states accounted for about 75 percent of the capital invested. (Texas came in at fourth place, followed by Florida.)", "The share of venture capital claimed by these three states was corroborated by another source of data, the PricewaterhouseCoopers/CB Insights MoneyTree Report. Since 2012, the collective share of the top three states has increased from 68.5 percent to a peak of 76.8 percent. in 2015.", "The outlook is more promising for other states in terms of the number of deals. The same three states claimed about 52 percent of closed deals in 2016, according to the association’s yearbook. That’s still a majority of deals, but it’s \"a positive sign for burgeoning entrepreneurial ecosystems in the rest of the country,\" the yearbook said.", "The yearbook’s list of the top 10 venture capital deals in terms of the amount of money included Magic Leap, a reality technology company in South Florida, and Domo, a Utah-based company that provides data to businesses.", "Some states that were not on the venture capital radar a decade or so ago have received more dollars in recent years, experts told us. Some of these states look more impressive, for example, when broken down by invested capital per capita, such as Utah.", "It’s also possible that as more states invest in innovation ecosystems, they will increase how much venture capital they attract. But California, New York and Massachusetts will continue to build on their success.", "\"Success begets success, leading to more startups in these places, more capital and more opportunities for investment,\" said Elisabeth B. Reynolds, executive director of the MIT Industrial Performance Center.", "The hard part for states playing catch-up is attracting money. But there are now hubs of start-ups in Florida, including Gainesville, Orlando and Miami, said University of Florida business professor James Parrino.", "Vance said that \"50 percent of venture capital goes to California. Most of the rest of it goes to New York and Massachusetts.\"", "Vance is largely correct but doesn't describe the situation with precision.", "Data from a trade association showed that California received 55 percent of venture capital money followed by New York at 10.6 percent and Massachusetts at 8.9 percent.", "If we looked at the number of deals closed that year, the three states’ share added up to 52 percent. That left almost half of the deals for the rest of the country.", "We rate Vance’s claim Mostly True.", "Face the Nation, \"Transcript: J.D. Vance on Face the Nation,\" (Minute 14) Dec. 31, 2017", "National Venture Capital Association, Yearbook (see page 23), 2017", "Revolution, Rise of the Rest Seed Fund, Accessed Jan. 23, 2018", "JD Vance, Tweet, Jan. 19, 2018", "New York Times, \"Seeking Midwest Start-Up Gold,\" Nov. 20, 2017", "PricewaterhouseCoopers Money Tree report, Jan. 10, 2018", "State Science & Technology Institute, \"Useful Stats: Share of U.S. venture capital activity and per capita investment by state, 2010-2016,\" March 23, 2017", "Martin Prosperity, \"Spiky Venture Capital: The Geography of Venture Capital Investment by Metro and Zip Code,\" February 2016", "Forbes, \"The State Of Venture Capital In Utah,\" Dec. 1, 2015", "Politico, \"'Hillbilly Elegy' author Vance urged to run for Senate,\" Jan. 8, 2018", "Motherboard, \"Florida wants a slice of the tech industry,\" March 2, 2017", "Dayton Daily News, \"Hillbilly Elegy\" author mulls Senate bid, but does he live in Ohio?\" Jan. 11, 2018", "Sun Sentinel, \"Magic Leap leads Florida's venture capital raise in 4th quarter, 2nd only to Lyft nationwide,\" Jan. 10, 2018", "Deseret News, \"Could trio of Utah companies become the next Snapchat?\" March 10, 2017", "PolitiFact Texas, \"Steve Adler correctly says Austin No. 1 in Texas in startups, venture capital investment, patents,\" May 13, 2016", "Interview, Richard Florida, University of Toronto professor, Jan. 18, 2018", "Interview, Tracy Zuckerman Van Grack, Revolution spokeswoman, Jan. 18, 2018", "Interview, James Parrino, professor Warrington School of Business University of Florida, Jan. 18, 2018", "Interview, Elisabeth B. Reynolds, executive director of the MIT Industrial Performance Center, Jan. 20, 2018", "Interview, Leo Bley, PwC director, Jan. 19, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]