["Around May 30, several Twitter users posted a one-minute video in which a man can be seen slapping another in front of a car, making him do sit-ups and forcing him to lick his spittle from the car’s bonnet.", "The video is viral with the text, “A Muslim man being forced to lick a Hindu‘s spit. Most probably to break his Ramadan fast.” Twitter user @BurpingI posted the viral video along with the text. Since then it has been viewed over 10,000 times. Due to the violent and disturbing nature of the clip, Alt News isn’t embedding it in the article. Readers can watch the video here (archive link).", "Alt News performed a keyword search on Google and found several related results. The same video was published by TV9 Gujarati’s YouTube channel on April 7.", "According to the report, the incident took place in Limbayat area of Surat. During the broadcast, reporter Parul informed that the man who is slapping the other person is Salman. Another video report by ABP Gujarati confirms the same.", "The incident was also reported by Dainik Bhaskar and Divya Bhaskar on April 8. As per the reports, the man behaved violently because he didn’t want the victim to testify against a person named Ramzan. In fact, Salman can be heard instructing the same to the victim in the video. This can be heard onward the 38th-second mark. While repeatedly slapping the victim, Salman says in Hindi, “Will you now confess Ramzan’s name? Should I give [you] to the DCP? Will you confess Ramzan’s name? C’mon strip naked. Should I strip you naked and parade you publicly?” It is possible that the name ‘Ramzan’ might have led to the rumour that the incident has something to do with the festival of Ramzan.", "As per the Divya Bhaskar report, the car seen in the video belonged to Surat Municipal Corporation’s garden department. One can spot ‘SMC’ written on the car. Divya Bhaskar’s report also added that Limbayat police inspector VM Makwana said that a complaint would be lodged against the accused. Alt News spoke with Makwana who confirmed that a complaint has been filed. “Both the men in the video are from the Muslim community. Therefore the social media claim is wrong.”", "That a Muslim man was beaten and forced to lick the spittle of a Hindu man is not true. Both the perpetrator and the victim hailed from the same community.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "A purported video of a Muslim man beating a temple priest with a bat is…", "A picture depicting the Pakistani flag apparently bigger in size and apparently placed higher than…", "Amid the ongoing war between Israel and Hamas, a video of a fleet of cars…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "A clip featuring Pakistan men’s Cricket team captain Babar Azam is viral on social media…"]