["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Congressional hopeful Marie Newman, right, and U.S. Rep. Dan Lipinski, left, in 2018. (James Foster/Sun-Times)", "Marie Newman, who says she wants a rematch with U.S. Rep. Dan Lipinski, 3rd, in next year’s Democratic primary, said during a recent radio interview that the Southwest Side and Southwest suburban district needs a representative who understands how tough it is for voters to make ends meet.", "And to underscore the gravity of that financial pressure, Newman, who lost to Lipinski in 2018, cited an eye-popping statistic.", "\"We’re in a situation right now where 80% of the country is living paycheck to paycheck and that is not acceptable,\" she told WCPT, a talk radio station in Chicago.", "Democrats increasingly warn of a growing wealth gap between rich and poor. Still, 80% living paycheck to paycheck sounded shockingly high, so we decided to take a closer look.", "We asked Newman’s campaign where her number came from and a spokesman sent several news articles all linking back to an online survey conducted for the CareerBuilder employment website.", "A CareerBuilder press release describes the results of its survey, conducted among adults working full-time for private sector companies between 2016 and 2017 by the Harris Poll. The press release breaks down the numbers in a way Newman did not: 38% of employees said they sometimes live paycheck to paycheck, 17% said they usually do and 23% said they always do.", "But Kreg Steven Brown, an Urban Institute research associate who studies economic opportunity, said it was \"imprecise at best\" to include the nearly 40% of people who report only \"sometimes\" living paycheck to paycheck in the grand total.", "To be clear, that’s not on Newman alone. Both CareerBuilder and many of the articles that cite the survey also stressed that total over the specific breakdown.", "There are other problems with taking the 80% (78%, to be precise) total at face value. The CareerBuilder release, for instance, does not spell out the questions posed in its survey, leaving it unclear what participants were asked to consider when evaluating whether they were indeed \"living paycheck to paycheck.\"", "Polling experts we spoke with said that sort of detail is critical to know when evaluating the quality of survey results.", "\"If you’re asking people to look at a percentage of any kind without providing a way for people to also get access to the underlying information about data collection, you’re really asking people to take something on faith,\" said Nora Cate Schaeffer, vice president of the American Association for Public Opinion Research.", "We contacted CareerBuilder asking for more information about their 2017 survey. A spokeswoman told us the site no longer keeps it.", "The 80% paycheck to paycheck claim seems even more questionable when laid up against the results of other public opinion surveys that have asked similar questions.", "Indeed, a 2014 poll from Harris, the same organization that conducted the later poll for CareerBuilder, found that 46% of unretired U.S. adults say they \"live paycheck to paycheck and can’t afford to put money in savings.\"", "A recent Urban Institute report analyzed survey data from 2017 and found 32% of non-elderly U.S. adults had experienced some form of financial distress in the previous 12 months.", "A survey included in the U.S. Consumer Financial Protection Bureau’s 2017 report on financial well-being asked respondents whether they \"have difficulty making ends meet\" and found that 43% of U.S. adults said they had.", "And a survey conducted for a similar 2018 report from the Federal Reserve found that four in 10 adults, if faced with an unexpected $400 expense, would not be able to cover it or would have to sell something or borrow in order to do so. That fact has been cited — with varying degrees of accuracy — in several other claims PolitiFact recently fact-checked.", "As described in the CareerBuilder release, its survey sampled a subset of U.S. adults who are not yet retired. Experts said that might help explain why the results seemed off from similar polls that queried a broader range of respondents.", "Newman said, \"we’re in a situation right now where 80% of the country is living paycheck to paycheck.\"", "Her claim traces back to the results of a 2017 survey commissioned by a jobs site that provided scant details beyond the alarming topline numbers. The site also noted, however, that 38% of those respondents said they lived paycheck to paycheck \"sometimes\" rather than \"usually\" or \"always.\"", "Surveys asking similar questions in recent years have yielded results about financial distress that may still seem troubling but were nowhere as severe as the numbers highlighted by CareerBuilder and echoed by Newman.", "Newman’s claim accurately reflects the single survey she is relying on, but it appears to be an outlier among similar polls. We rate Newman’s claim Half True.", "HALF TRUE – The statement is partially accurate but leaves out important details or takes things out of context.", "Click here for more on the six PolitiFact ratings and how we select facts to check", "Correction: A previous version of this fact-check misstated an Urban Institute expert's name as Steven Kreg Brown. It has been updated to reflect that his name is Kreg Steven Brown.", "Radio interview: Marie Newman, WCPT, April 24, 2019", "Email interview: Nick Uniejewski, Newman spokesman, April 25, 2019", "\"78% Of Workers Live Paycheck To Paycheck,\" Forbes, Jan. 11, 2019", "\"The government shutdown spotlights a bigger issue: 78% of US workers live paycheck to paycheck,\" CNBC, Jan. 9, 2019", "Press release, CareerBuilder, Aug. 24, 2017", "Email interview: Kreg Steven Brown, research associate at the Urban Institute, April 26, 2019", "Phone interview: Kathleen Weldon, director of data operations and communications at Cornell University’s Roper Center for Public Opinion Research, April 25, 2019", "Phone interview: Nora Cate Schaeffer, vice president of the American Association for Public Opinion Research and faculty director at the University of Wisconsin Survey Center, April 26, 2019", "Email interview: Stephanie Rosenblum, CareerBuilder spokeswoman, April 26, 2019", "Press release, The Harris Poll, July 10, 2014", "Report: Financial well-being in America, U.S. Consumer Financial Protection Bureau, September 2017", "Report: Financial Distress Among American Families, Urban Institute, February 2019", "Report: Economic Well-Being of U.S. Households in 2017, Federal Reserve, May 2018", "\"An unexpected $400 expense would be damaging for many, but Kamala Harris overstates report’s finding,\" PolitiFact California, April 19, 2019", "\"Checking Howard Schultz's claim that 40 percent of Americans don't have $400 in the bank,\" PolitiFact, Jan. 29, 2019", "Email interview: Abdur Chowdhury, professor emeritus of economics at Marquette University, April 26, 2019", "Email interview: Jonathan J. Morduch, professor of public policy and economics at the Wagner Graduate School of Public Service at New York University, April 25, 2019", "Email interview: Daniel Schneider, professor of sociology at University of California at Berkeley, April 25, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]