["About this rating", "A kick to the groin is, like childbirth, an undeniably intense experience. That area of the human body is delicate and filled with nerves, and whether you've been kicked or just had a baby, it's very likely that you'll be off your feet for awhile.", "But which is more painful? It's difficult to know for sure, but a graphic meme has been circulating for years claiming that a blow to the testicles is the clear winner, hands down: \"A kick in the balls is above 9000 del (units) of pain which is similar to giving birth to 160 kids & breaking up to 3200 bones at a time.\"", "The earliest version of this claim we could find was posted to the website Joy Reactor on 30 March 2010. That posting included a different image and additional claims about having a baby:", "DO YOU KNOW? A human body can bear only up to AS del (unit) of pain. But at the rime of giving birth, a woman feels up to 57 del (unit) of pain. This Is similar to twenty bones getting fracture at a time. Love our mother, the most beautiful person on this earth, our best critic, yet our strongest supporter.", "A Kick in the nuts its above 9000 in the scale of pain. It's similar to giving birth to 160 kids and breaking up to 3200 bones at a time. Love your father, he did well protecting his balls so you could live.", "This meme does little to shed any light on the battle of which experience is the most painful. First and foremost, there is no \"del\" unit of pain. Researchers at Cornell University proposed a measurement of pain called the \"dol\" in the 1940s, but this measurement was never widely used. The \"del\" can't be explained away by a typo, either, as the dol scale only had a range between 0 and 10.5.", "The logic is also nonsensical. The main reason the dol -- and other measurements of pain -- ever caught on is that pain is subjective and difficult to quantify by nature:", "Everyone feels pain differently. Some people have conditions that should cause great pain, but don't. Others have no sign of a physical problem, but are in great pain. Your level of chronic pain can't be assessed in a scientific test or screening.", "To help compensate for this problem, many doctors rely on pain scales to get a more concrete sense of a person's pain. You might have seen a pain scale in your doctor's office before. One common type shows a series of numbered cartoon faces moving from 0 (smiling and pain-free) to 10 (weeping in agony.) A doctor would ask a person in pain which face matched up with what they were feeling.", "There's no clear answer to the question of which is more painful, as comparing the two events is nearly impossible. One causes a brief rush of pain that disappears relatively quickly, and the other comes and goes, but for several hours (at least). When ASAPScience investigated this question in 2013, they ruled that it was a tie:", "The claim that getting hit in the testicles causes \"9000 del of pain\" and that childbirth causes \"57 del of pain\" is not based on any scientific information and appears to have been made up out of whole cloth.", "Hardy, James.   \"Studies on Pain: An Investigation of Some Quantitative Aspects of the Dol Scale of Pain Intensity.\"     The Journal of Clinical Investigation.   27 May 1948.", "Griffin, Morgan.   \"Using the Pain Scale: How to Talk About Pain.\"     WebMD.   9 March 2011.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]