["About this rating", "In May 2017, a Reddit user posted a graphic that purported to list all of President Trump's accomplishments during his first four months in office. It was then widely shared on social media:", "TRUMP ACCOMPLISHMENTS ..\nRetweet the hell out of this to annoy @ABC @CBS @cnn @cnbc @MSNBC @nbc @nytimes @washingtonpost #dishonestmedia. pic.twitter.com/ITArBQgcmJ", "— Small Biz for Trump (@SmallBiz4Trump) May 15, 2017", "Creating homebrew visual aids touting the accomplishments (or failures) of top politicians is a popular online pastime, not least because it's a cheap and easy way to propagandize, and because there are no pesky standards of fairness and accuracy to meet. As we've noted with regard to previous specimens (for example, a late-2016 meme touting the alleged economic achievements of President Obama), the graphic format lends itself to the display of cherry-picked facts to make a simplistic case with no semblance of context or nuance.", "In this case, the claim is that, despite all the carping in the mainstream press about \"chaos\" and \"ineptitude\" in the Oval Office, President Trump has actually accomplished quite a lot during his first four months as chief executive, and thus you will not find mention of major campaign promises Trump has had difficulty keeping so far, such as instituting a Muslim immigration ban and building a wall on the Mexican border.", "Also, since it's very much a partisan case being made, there will be disagreement over what constitutes an \"accomplishment.\" Some feats, such as reducing unemployment, are uncontroversial, while others, such as dismantling entire government agencies, aren't likely to be regarded as accomplishments by those who find the functions of those agencies critical.", "Here are the claims:", "4.4 percent - lowest since May 2007", "As reported in the Washington Post, government data released on 5 May 2017 indicated that the national unemployment rate hit a new low in April:", "The U.S. job market rebounded strongly last month and the unemployment rate fell to the lowest level seen in a decade, government data released Friday morning showed, calming fears that had bubbled up in the past month about the state of the economy.", "Employers added 211,000 jobs in April as the unemployment rate ticked down to 4.4 percent, the lowest level since May 2007.", "It bears pointing out that the jobless rate had already been on a steady decline since 2010. Further, unemployment hit a previous nine-year low of 4.6 percent in December 2016 when President Obama was still in office. It climbed back up to 4.8 percent in January, dipped to 4.7 percent in February, and to 4.5 percent in March 2017.", "To what degree short-term improvements in the economy since January can be attributed to a new chief executive whose economic policies remain nascent is perennially up for debate, though according to The New York Times' senior economic correspondent Neil Irwin, a \"Trump effect\" that is buoying corporate hiring policies after the election cannot be ruled out:", "So does Mr. Trump deserve any credit for solid economic results? If you think the economy is driven by concrete, specific policies around taxes, spending, monetary policy and regulation, the answer is no. If you think that what really matters is the mood in the executive suite, then just maybe.", "SoftBank $50B\n Exxon $20B\n Hyundai $3.1B\n Apple $1B\n Chrysler $1B\n GM $1B\n Bayer AG $1B\nToyota $600M\n LG $250M", "This is a mostly-accurate, partial list of corporations who have announced investments in American facilities and/or jobs since the election of Donald Trump. With the exception of Bayer AG (which announced $8 billion in new investments, not $1 billion as claimed), the dollar amounts match those cited in press reports between January and April 2017 (sources: Softbank, Exxon Mobil Corp., Hyundai-Kia, Apple, Fiat Chrysler, General Motors, Bayer AG, Toyota, LG Electronics).", "It's not necessarily accurate to characterize all of these commitments as \"accomplishments\" of President Trump, however. As CBS Moneywatch's Irina Ivanova reported in January 2017:", "Few of the jobs companies are promising to create in the U.S. can be attributed to a sudden renewed commitment to USA Inc. inspired by Trump’s “America First” policies. Indeed, the businesses Trump has been quick to praise have been careful not to characterize their recent hiring announcements as new. And as usual with corporate investments of this scale, such plans are typically months — or even years — in the making, suggesting they long predate the presidential election.", "For example, Fiat Chrysler said their promise of a $1 billion investment in Michigan and Ohio plants, projected to create 2,000 jobs, was the \"second phase\" of an industrialization plan announced in 2016. GM's $1 billion investment was \"several years in the making,\" according to sources cited by CBS.", "The largest of all the announced commitments, SoftBank's pledge of $50 billion, was also in the works long before Trump won the election:", "Another widely publicized corporate initiative that Trump trumpeted — a promise by SoftBank to create 50,000 high-tech jobs in the U.S. — was the result of a tech fund the company announced on Oct. 14 — three weeks before the election. Given the massive tech industry in the U.S., economists say much of the planned $50 billion investment would have found its way to the states regardless of who occupied the White House.", "“You don’t just decide overnight to invest $3 billion,” said Nathan Jensen, a professor at the University of Texas who studies interactions between government and corporations.", "Bayer AG's commitment to an $8 billion investment and the creation of 3,000 U.S. jobs was announced by the Trump transition team after the president-elect met in January 2017 with the CEOs of Bayer AG and Monsanto, who are planning a merger. Transition spokesman Sean Spicer credited Trump's negotiating skills for the pledge, but some analysts were skeptical that the companies had actually promised anything that wasn't already on the table when plans for the merger were first revealed in September 2016:", "Bayer and Monsanto said in a joint statement after Spicer's remarks that the \"combined company expects to spend approximately $16 billion in R&D in agriculture over the next six years with at least half of this investment made in the United States.\"", "That amounts to about $2.7 billion a year, which roughly equates to what the combined companies already spend in that area globally, [Wall Street analyst Jeremy] Redenius said. As for the U.S. breakdown, he estimates it's likely close to half already; Monsanto spends $1.5 billion a year, the majority of which is in the U.S., he said, and Bayer already invests in R&D here as well.", "\"Not an increase, but not substantially cutting,\" he said of the global figure.", "The merger, which awaits U.S. regulatory approval, is not likely to be completed until 2018, CNBC reported.", "$182B in April 2017", "It is true that the U.S. Treasury reported a $182 billion budget surplus in April 2017, the largest April surplus since 2001 (and the second-largest in history), according to MarketWatch. It's unclear exactly how that surplus is attributable to President Trump, however. April is typically a surplus month because of tax receipts. In addition, citing a Congressional Budget Office (CBO) review as its source, Associated Press reported that the April 2017 surplus was \"inflated\" because of a tax deadline change allowing corporations to pay federal taxes in April that in previous years were paid in March.", "It remains to be seen what effect Tump's policies will have on the budget deficit for 2017 as a whole (the fiscal year ends on 30 September). The CBO projects a 4.6 percent drop in the deficit from what it was in 2016, but that is based on laws and policies already in effect when Trump took office.", "DOW at 20,896", "The stock market can be fickle. As of April 29, the Dow Jones Industrial Average was at 20,940.51, 6.12 percent higher than when Trump took office — positive movement, unquestionably. That number had risen to 20,981.94 by 16 May, then plummeted 372 points the next day as the market was shaken by news that Trump had shared classified information with Russian diplomats in the White House and attempted to divert FBI Director James Comey from an investigation of Trump's alleged ties to Russia before he fired him.", "Currently at 125.6", "It's true that the Consumer Confidence Index, a metric assessing how ordinary consumers feel about the strength of the economy, hit 125.6 in March 2017, its highest point since 2000. It is also true that it fell five points to 120.3 the following month. Even so, it showed that consumers (as of April) had more confidence in the economy under Trump than under Obama, during whose administration the index never exceeded 113.7 (although it did manage to rise to that point after bottoming out in 2009 at 25).", "Passed 32 bills through Congress", "As of 17 May 2017, President Trump had signed 34 bills passed by Congress, a comparatively high number in such a short period of time (since Franklin Delano Roosevelt, who signed 76 pieces of legislation in his first 100 days, only Harry Truman, at 55, signed more).", "That's not to say that all of the legislation signed by Trump between January and May 2017 was necessarily noteworthy, however. One bill changed the name of a Veterans Affairs outpatient clinic in Pago Pago, American Samoa; another renamed a VA health center in Pennsylvania; another approves the location of a memorial honoring Desert Storm and Desert Shield veterans; three appointed citizen regents to the board of the Smithsonian Institution.", "Nor should it be assumed that Trump's signing of a given bill meant he or his administration was actively involved in its passage. Thirteen such bills nullifying federal regulations enacted during the Obama administration (such as H.J. Res. 69, reversing a U.S. Fish and Wildlife rule pertaining to Alaska's National Wildlife Refuges and S.J. Res. 34, reversing FCC Internet privacy rules) were rushed through Congress and quickly signed because they made use of the Congressional Review Act of 1996, which imposes a 60-day limit on the time allowed to overrule previously passed laws.", "Appointed constitutionalist Supreme Court Justice Neil Gorsuch", "This is true. Gorsuch was confirmed by the U.S. Senate on 7 April 2017.", "After 8 years of inaction", "This is true. Trump fulfilled a campaign promise by signing an executive order withdrawing the U.S. from the Trans-Pacific Partnership international trade agreement on 23 January 2017, one day after announcing he would renegotiate it. Despite President Obama's fervent support for the deal, many groups, including labor unions, were critical of the TPP, and CNN reported that its chances of approval by Congress were already \"bleak.\"", "40 percent fewer illegal border crossings and deportation of violent and repeat offenders", "The number of illegal border crossings from Mexico into the U.S. in February 2017 were indeed down 40 percent from the previous month, according to statistics provided by the Department of Homeland Security, and that downward trend, which had actually started the previous November, continued in March and April 2017. This U.S. Customs and Border Protection chart shows how striking the change was compared to the previous five years:", "Water contamination crisis started in April 2014", "It's true that in March 2017, the U.S. Environmental Protection Agency (EPA) awarded a $100 million grant to the state of Michigan to upgrade the drinking water infrastructure in Flint, which experienced a lead pollution crisis potentially affecting as many as 100,000 people beginning in 2014. There has been some dispute, however, over whether this ought to be labeled a \"Trump accomplishment\" or an \"Obama accomplishment.\"", "As we noted in a previous article, funding for the grant came from a bill signed by President Obama in 2016, though the monies weren't officially awarded until after he left office, hence some prefer to credit it to Trump.", "Strengthening relationships\n    China\n    Japan\n    Russia\n    UK\n Tough on North Korea\n Tough on Syria\n Freed Humanitarian Workers from Egypt", "Although President Trump pledged to \"strengthen\" overseas relationships going into office and he had already met with several important foreign leaders by mid-May 2017, it is too soon to tell to what degree his promise will bear fruit.", "China: The president-elect got off to a rocky start with China in December by accepting a congratulatory call from the leader of Taiwan, which China views as a province,not an independent nation, and with which the U.S. does not have diplomatic relations. China lodged a formal complaint. In April, Trump met with Chinese President Xi Jinping, with whom he said he made \"tremendous progress\" but no breakthroughs. A trade deal negotiated by the Trump administration with China in May was rated \"pretty good\" by The Wall Street Journal.", "Japan: Japanese Prime Minister Abe, who has met twice with Trump, issued a joint statement with him reaffirming the \"unshakable alliance\" between the U.S. and Japan. That is despite Trump having called Japan a \"currency manipulator\" during the presidential campaign and pulling out of the TPP, which Abe supported. Whether the \"very, very good chemistry\" Trump says he has with Abe will improve the relationship between the two countries over the long haul remains to be seen.", "Russia: U.S.-Russia relations have been strained for many years, a situation not improved by Russia's attempts to meddle in the U.S. presidential election, nor by the fact that Trump associates are under investigation for possible collusion in that effort. A U.S. missile strike by Trump against Syria, with whose government Russia is closely allied, were strongly condemned by Russian leaders, who warned there could be \"extremely serious\" consequences.", "U.K.: British Prime Minister Theresa May was the first foreign leader to visit the Trump White House, and their cordial meeting was portrayed by both countries as a renewal of the \"special relationship\" between the U.S and the U.K. According to the BBC, Obama was seen by many Britons as more interested in the European Union as a whole than in the U.K. itself, while Trump, who was in favor of Brexit, is perceived as the opposite.", "Tough on Korea? President Trump has employed what the Washington Post calls \"hard-line rhetoric\" against North Korea, including threats of force, in hopes of squelching that county's increasing militarism, a strategy some experts dismiss as \"macho posturing\" that could escalate into a Cuban Missile Crisis-like confrontation.", "Tough on Syria? In April 2017, Trump ordered U.S. missile strikes against an air base in Syria in response to an alleged chemical weapons attack on civilians by the Syrian government, which has been known to brutalize its own people during the ongoing civil war there. Trump's gesture came up short, however, in that the Syrian Air Force was able to launch a new attack against rebel forces from that same base just hours later.", "Humanitarian workers in Egypt: In April 2017 President Trump negotiated the release of U.S.. citizen Aya Hijazi, her Egyptian husband, and four other humanitarian workers from a prison in Cairo, Egypt, where they had been locked up since 2014, without evidence or trial, on charges of child abuse and trafficking.", "Trimming the fat at many overblown government agencies and promoting small business growth by reigning in the EPA", "Although it is true that President Trump signed an executive order on 13 March 2017 directing the heads of executive branch departments to eliminate all \"unnecessary\" agencies and reorganize those that remain to improve their \"efficiency, effectiveness, and accountability,\" the order gave said department heads six months from the date of signing to come up with suggestions for this process, so not much fat has been trimmed thus far despite the groundwork being laid.", "Regarding efforts to \"reign in\" the Environmental Protection Agency (EPA), a CNN report confirms that's been among Trump's top priorities from the start:", "President Donald Trump made a campaign trail promise to eliminate the Environmental Protection Agency — a department once looked to as an important national force tackling climate change — and during his first 100 days in office has held true to his word, taking swift strides towards dismantling the agency and rolling back regulations.", "Alongside EPA Administrator Scott Pruitt, a former Oklahoma attorney general who once worked tangentially with the fossil fuel industry to oppose Obama-era regulations, the Trump administration has so far issued a flurry of EPA-focused executive orders, proposed employee buyouts, handed down a social media gag order and is proposing significant cuts to the EPA budget.", "The National Federation of Independent Business (NFIB), a small business advocacy group, has hailed Trump's commitment to cutting \"burdensome regulations,\" while environmental protection groups see it as a threat to public health and the future of the planet.", "Finished Dakota Access Pipeline & reversed Obama's \"Land Grab\" EO, freeing US to use our own natural resources", "The controversial Dakota Access Pipeline project, halted under President Obama, was revived by President Trump and will begin commercial operations on 1 June 2017. Trump also issued an executive order directing a review of lands designated as national monuments:", "Specifically, the review will consider all national monument designations of federal public lands since 1996 that are 100,000 acres or larger. Mr Trump singled out former President Barack Obama’s “egregious” use of federal power in using the Antiquities Act to “unilaterally” place swaths of American land and water under federal control, adding, “it’s time we ended this abusive practice.”", "As with many of the other items discussed above, whether or not one regards this as an \"accomplishment\" (as opposed, say, to a travesty) will depend almost entirely on one's political views going in.", "Baker, Peter and Davenport, Coral.   \"Trump Revives Keystone Pipeline Rejected by Obama.\"\r\n   The New York Times.   24 January 2017.", "Bradner, Eric.   \"Trump's TPP Withdrawal: 5 Things to Know.\"\r\n   CNN.   23 January 2017.", "Bunge, Jacob and Alessi, Christopher.   \"Bayer, After Trump Meeting, Pledges to Add Thousands of U.S. Jobs.\"\r\n   The Wall Street Journal.   18 January 2017.", "Carroll, Lauren.   \"Trump Has Signed More Bills in 100 Days than Any President Since Truman, Spicer Says.\"\r\n   Politifact.com.   27 April 2017.", "Crutsinger, Martin.   \"Federal Government Records $182.4 Billion Budget Surplus.\"\r\n   Associated Press.   10 May 2017.", "DeCambre, Mark.   \"How Trump's Stock Market Ranks During His First 100 Days in Office.\"\r\n   MarketWatch.   30 April 2017.", "Green, Miranda.   \"Trump's EPA: Cuts, Infighting and No Talk of Climate Change.\"\r\n   CNN.   4 May 2017.", "Greene, Leonard.   \"Stock Market Suffers Biggest Blow Since President Trump Took Office.\"\r\n   New York Daily News.   17 May 2017.", "Ivanova, Irina.   \"Trump Isn't the Reason Corporate America Is Investing in the U.S.\"\r\n   CBS News.   18 January 2017.", "Kopan, Tal.   \"Does Border Drop Mean Trump's Tough Talk Is Working?\"\r\n   CNN.   9 March 2017.", "Kulish, Nicholas and Santos, Fernanda.   \"Illegal Border Crossings Appear to Drop Under Trump.\r\n   The New York Times.   8 March 2017.", "Liptak, Adam and Flegenheimer, Matt.   \"Neil Gorsuch Confirmed by Senate as Supreme Court Justice.\"\r\n   The New York Times.   7 April 2017.", "McKelvey, Tara.   \"Special Relationship Gets a New Lease on Life.\"\r\n   BBC.   27 January 2017.", "Robb, Greg.   \"U.S. April Budget Surplus Rises to $182 Billion.\"\r\n   MarketWatch.   10 May 2017.", "Rucker, Philip and DeYoung, Karen.   \"Freed Egyptian American Prisoner Returns Home Following Trump Intervention.\"\r\n   The Washington Post.   20 April 2017.", "Ryan, Missy, Denyer, Simon and Rauhala, Emily.   \"On North Korea, Trump Administration Talks Tough but Hopes to Avoid War.\"\r\n   The Washington Post.   19 April 2017.", "Ryan, Tim.   \"Trump Directs Department Heads to Trim Agency Fat.\"\r\n   Courthouse News.   14 March 2017.", "Savransky, Rebecca.   \"Tillerson: U.S.-Russia Relationship 'At an All-Time Low Point' Since End of Cold War.\"\r\n   The Hill.   14 May 2017.", "Thomas, Lauren.   \"Consumer Confidence Lags in April as Americans Are Less Optimistic About Economy.\"\r\n   CNBC.   25 April 2017.", "Watson, Kathryn.   \"Trump Executive Order Calls for Review of 'Egregious' Federal Land Grab.\"\r\n   CBS News.   26 April 2017.", "Boston Herald.   \"Editorial: Getting Tough in Syria.\"\r\n   20 May 2017.", "CBO.gov.   \"Monthly Budget Review for April 2017.\"\r\n   5 May 2017.", "Democracy Now.   \"Trump's Proposed EPA Cuts Threaten Health & Lives of Tens of Millions of Americans.\"\r\n   3 March 2017.", "NFIB.com.   \"In Targeting the Waters of the United States Rule, President Trump Looks to Dismantle Another Burdensome Regulation.\"\r\n   3 March 2017.", "PRNewsWire.com.   \"The Conference Board Consumer Confidence Index Declined in April.\"\r\n   25 April 2017.", "TradingEconomics.com.   \"United States Unemployment Rate.\"\r\n   5 May 2017.", "U.S. Customs and Border Protection.   \"Southwest Border Migration.\"\r\n   1 May 2017.", "The Wall Street Journal.   \"Japan's Abe Talks Trump.\"\r\n   22 May 2017.", "The Wall Street Journal.   \"Trump's Pretty Good China Deal.\"\r\n   14 May 2017.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]