["California's annual wildfires bring not only death and destruction, they are stirring controversy over the federal government's response to the financial needs of the state.", "A Facebook user has circulated a post charging that President Donald Trump has helped Russia with its fires, but not California.", "The Sept. 17 post says, \"Trump says No Aid for CA fires. But in July he offered to help Putin with fires in Russia.\" It has over 6,900 shares in its first 24 hours. The Facebook user who posted the item did not immediately respond to requests for comment.", "The claim stems from a number of tweets and public statements by the president, in which he threatened to withhold financial help, accusing California of mismanagement of its forests.", "For at least two years, the president has criticized California's handling of the fires, particularly over what he says is inadequate management of its forests.", "In November 2018: \"There is no reason for these massive, deadly and costly forest fires in California except that forest management is so poor,\" Trump tweeted. \"Billions of dollars are given each year, with so many lives lost, all because of gross mismanagement of the forests. Remedy now, or no more Fed payments!\"", "On Jan.9, 2019: \"Billions of dollars are sent to the State of California for Forest fires that, with proper Forest Management, would never happen. Unless they get their act together, which is unlikely, I have ordered FEMA to send no more money. It is a disgraceful situation in lives & money!\"", "On Nov. 3, 2019, he revisited the theme in a series of tweets: \"The Governor of California, @GavinNewsom, has done a terrible job of forest management. I told him from the first day we met that he must “clean” his forest floors regardless of what his bosses, the environmentalists, DEMAND of him. Must also do burns and cut fire stoppers.......Every year, as the fire’s rage & California burns, it is the same thing-and then he comes to the Federal Government for $$$ help. No more. Get your act together Governor. You don’t see close to the level of burn in other states...But our teams are working well together in.........putting these massive, and many, fires out. Great firefighters! Also, open up the ridiculously closed water lanes coming down from the North. Don’t pour it out into the Pacific Ocean. Should be done immediately. California desperately needs water, and you can have it now!\"", "In August, at a rally in Pennsylvania, Trump threatened to withhold fire aid to the Golden State, Politico reported.", "\"I see again the forest fires are starting,\" he said. \"They’re starting again in California,\" he said. \"I said, you gotta clean your floors, you gotta clean your forests — there are many, many years of leaves and broken trees and they’re like, like, so flammable, you touch them and it goes up.\"", "More:In California: Trump visits NorCal amid fires", "He added: \"Maybe we’re just going to have to make them pay for it because they don’t listen to us.”", "According to the University of California Cooperative Extension, federal agencies, like the National Park Service, U.S. Forest Service and Bureau of Land Management, own and manage 19 million acres, or 57% of the forests in California. About 40% is owned by families, Native American tribes, or companies. And state and local agencies — from Cal Fire to land trusts, plus open space, park and water districts — own about 3%.", "Regarding fire aid for Russia, the Kremlin first raised the issue in a statement on July 31, 2019, as wildfires ravaged Siberia:", "“Vladimir Putin had a telephone conversation with US President Donald Trump this evening at the American side’s initiative. The US President offered help in putting out wildfires in Siberia. ... The President of Russia expressed sincere gratitude for the kind attention and the offer of help and assistance. Vladimir Putin said he will accept the offer if it becomes necessary.", "“The President of Russia regards the US President’s offer as a sign that it is possible that full-scale bilateral relations will be restored in the future,\" the Kremlin statement continued.", "Initially, the White House was coy on whether any aid was offered, according to CBS News, acknowledging that a discussion between the two leaders about wildfires had taken place but not stating directly that assistance had been offered. According to the White House, Trump \"expressed concern over the vast wildfires afflicting Siberia\" and the leaders \"discussed trade between the two countries,\" CBS reported.", "Trump, however, confirmed the offer of help when asked by reporters at a brief Aug. 1, 2019, news conference, Voice of America reported.", "“Mostly we discussed the forest fires in Siberia, and other parts of Russia,\" the president said. \"And I said, look, we have the greatest equipment, if we could help you let us know. Large sections are burning, and so I said to President Putin, if we can help you, let me know.”", "Despite the offers, there is no evidence that any aid was ever sent.", "As for California, although Trump threatened to withhold aid, the White House announced on Aug. 22 that the president \"declared that a major disaster exists in the State of California and ordered Federal aid to supplement State, tribal, and local recovery efforts in the areas affected by wildfires.\"", "Likewise, Gov. Gavin Newsom said on Aug. 22 that the White House \"has approved California’s request for a Presidential Major Disaster Declaration to bolster the state’s emergency response to wildfires burning in Northern California and support impacted residents in Lake, Napa, San Mateo, Santa Cruz, Solano, Sonoma and Yolo counties.\"", "“Thank you to the President for your partnership and granting this urgent Major Disaster Declaration,\" Newsom added. \"California is battling two of the largest fires in our history and has seen nearly 600 new fires in the last week caused by dry lightning strikes. These are unprecedented times and conditions, but California is strong – we will get through this,” said Governor Newsom.", "California Public Radio declared the Facebook post as false.", "Our research shows that while the president threatened on numerous occasions to withhold aid to fire-ravaged California, the White House nonetheless offered such aid. We also found that the president offered to help Russia with its wildfires, although there is no evidence any help was ever given. We rate this claim as FALSE.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook."]