["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Alaska Republican Dan Sullivan attacked his opponent, Sen. Mark Begich, in this social-media meme.", "Dan Sullivan, the Republican Senate candidate in Alaska, is charging that his opponent, Sen. Mark Begich, is an ineffective lawmaker compared to other Alaska senators.", "According to a recent Sullivan campaign mailer, Begich -- who has been in office since 2009 -- has passed zero pieces of legislation during his first term.", "The Sullivan campaign reinforced this line of attack in a Facebook meme that said Begich has passed one bill, and all it did was name a building.", "This meme compared Begich’s record to that of other Alaska senators, saying that Begich’s predecessor, the late Republican Sen. Ted Stevens, passed 13 bills during his first term in the chamber, and that current Sen. Lisa Murkowski, also a Republican, passed five during her first term.", "We wondered: Did only one of Begich's bills pass during his first term? And is that the only way to measure his effectiveness as a legislator?", "We searched the Congressional Quarterly congressional database and found that since becoming a senator in 2009, Sen. Begich has only sponsored one bill that was eventually enacted, and that bill was to name an Alaska courthouse.", "So Sullivan has a point. But it’s a point that should be taken with a grain of salt.", "First, the claim has quickly become outdated. Last week -- after the mailer and meme first appeared -- the Senate and House passed a Begich-sponsored bill to increase veterans’ disability compensation that President Barack Obama is expected to sign into law.", "Second, counting the number of passed bills sponsored by a lawmaker is not the only -- or even the best -- way to gauge their effectiveness. In reality, there are many ways for a member of Congress to get desired legislation to the president’s desk beyond being the bill’s chief sponsor, said Norman Ornstein, a congressional expert at the American Enterprise Institute.", "\"There are some lawmakers who sponsor or cosponsor a lot of bills, but it doesn't reflect much of anything,\" he said, adding that the name on a bill that passes may be more of a reflection of who chaired the committee of jurisdiction rather than the member who actually drove the bill.", "Begich has co-sponsored 37 bills that became law. For seven of these laws, he was one of five or fewer co-sponsors, meaning he likely would have had tangible influence over the bill.", "And on three of these, Begich was the sole cosponsor of bills put forward by Murkowski, his fellow Alaska senator. All three dealt with Alaska-specific issues, such as Denali National Park.", "Meanwhile, a lawmaker’s name doesn’t have to be on a bill to accomplish legislative goals. Here are a few examples for Begich:", "• The Coast Guard and Maritime Transportation Act of 2012 included a provision authored by Begich that explored the possibility of a deep-water port in the Arctic. Begich didn’t sponsor or co-sponsor that bill, which originated in the House, but he did sponsor the corresponding Senate version.", "• In a previous fact-check, we found that Begich had played a key role in getting Washington to open up the Arctic Ocean to oil drilling for the first time in decades. A lawyer involved with the efforts told PolitiFact at the time that Begich’s \"biggest influence has been picking up the phone or having those people into his office or in hearings and saying ‘Dammit, we need to get this done.’ \"", "• In 2012, Alaska Native tribal health programs signed an agreement with the Department of Veterans’ Affairs that allowed Alaska Native veterans to receive medical care in tribal areas, rather than having to travel to Anchorage or Seattle. The Alaska Army National Guard and the Southeast Alaska Regional Health Consortium both said Begich supported that effort.", "• In the 2009 economic stimulus package, Begich fought for funds that benefited Alaska military bases and that helped build a hospital in Nome, Alaska, McClatchy reported.", "Additionally, Begich heads the Senate’s Democratic Steering and Outreach Committee, which has responsibilities beyond passing legislation, including improving the party’s relationship with traditionally Republican constituencies, according to his profile in Congressional Quarterly.", "So simply looking at the number of Begich-sponsored bills signed into law doesn’t give a full sense of his activities in the Senate.", "It’s also worth remembering that partisan gridlock has meant that a historically low number of bills are passing these days, meaning fewer opportunities for Begich -- or anyone else -- to get their names on a signed bill.", "As of July, about 800 bills have become law since Begich took office in 2009, according to compiled GovTrack data. If every member of Congress were to pass the same number of bills, that would break down to about 1.5 bills per person over the 5.5-year period.", "It was much different in Stevens’ first term, which ran from 1969 to 1974. Congress passed nearly 800 bills between 1973 and 1974 alone. (We don’t have data back further than that.) That breaks down to about 1.5 bills per person in just two years.", "Our ruling", "Sullivan said Begich is ineffective because he has passed only \"one bill, the naming of a building.\" Technically, Sullivan has a point -- at the time Sullivan’s post went up, Begich had only sponsored one bill that was eventually enacted, and it named a courthouse. Another Begich-sponsored bill concerning veterans’ issues subsequently passed both the House and Senate.", "However, this is an oversimplification, since Begich has had success pushing a legislative agenda in ways that don’t end up with his name on an enacted bill. Notably, Begich has been one of a small number of co-sponsors on bills that have passed, and legislative language he sponsored has ended up enacted in bills with someone else’s name on it.", "The claim is partially accurate but leaves out important details, so we rate it Half True.", "Dan Sullivan Facebook, First-term accomplishments meme, Sept. 17, 2014", "CQ, Mark Begich member profile, accessed Sept. 19, 2014", "CQ, advanced search of Begich-sponsored bills, accessed Sept. 19, 2014", "GovTrack, S. 1710 (112th), March 14, 2012", "Washington Post, \"The 113th Congress is historically good at not passing bills,\" July 9, 2014", "McClatchy DC, \"Categorizing Alaska's Begich depends what you look at,\" March 20, 2013", "Southeast Alaska Regional Health Consortium, \"SEARHC signs agreement to provide local care for veterans,\" May 14, 2012", "Congress.gov, H.R. 2838 (112th): Coast Guard and Maritime Transportation Act of 2012, Sept. 2, 2011", "Congress.gov, S. 2258: Veterans’ Compensation Cost-of-Living Adjustment Act of 2014, Sept. 16, 2014", "PolitiFact, \"Mark Begich ad says he forced D.C. to open the Arctic to oil drilling,\" March 24, 2014", "PolitiFact, \"Conservative group claims Michigan Senate candidate Gary Peters hasn't done anything in Congress,\" Aug. 20, 2014", "PolitiFact, \"'Hot Air' movie not accurate on Boxer's laws,\" May 28, 2010\nEmail and phone interviews, Begich spokesman Max Croes, Sept. 19, 2014", "Email and phone interviews, Sullivan spokesman Mike Anderson, Sept. 19, 2014", "Email interview, Norman Ornstein, Congress expert at the American Enterprise Institute, Sept. 19, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]