["By Angelo Fichera", "Posted on November 12, 2019", "Viral Facebook posts falsely claim that President Donald Trump “stole” charitable donations meant for veterans. A court ruled Trump illegally used his foundation for political purposes when it held a fundraiser for veterans, but all of the money raised went to veterans’ groups.", "President Donald Trump was recently ordered to pay $2 million to several charities to settle a lawsuit over the dealings of his now-defunct charitable organization, the Trump Foundation. But social media posts have distorted the facts about the court order to falsely claim that the foundation “stole” money earmarked for veterans.", "“It is a fact that draft dodger Trump stole charitable cash donations that were meant for our Veterans,” Facebook posts read.", "A different popular post says that a veterans’ event hosted by Trump raised “$2.6M” but that “NONE of the veterans groups that were supposed to get the money got a single dime. It all went to the campaign.”", "Yet another post — a meme referring to former NFL quarterback Colin Kaepernick’s kneeling during the national anthem — reads: “If you believe a black man kneeling to peacefully protest racism dishonors veterans but Donald Trump stealing $2.8 million in charity from veterans doesn’t — you need to stop disguising your racism as patriotism.”", "Those posts, spread during Veterans Day, misrepresent the facts of the case and the court order that resolved it.", "The order finalized a settlement between the New York Attorney General’s Office, Trump and the Donald J. Trump Foundation. Then-state Attorney General Barbara Underwood filed a lawsuit against the Trump and his foundation in June 2018. The state accused the organization of “a pattern of persistent illegal conduct, occurring over more than a decade, that includes extensive unlawful political coordination with the Trump presidential campaign, repeated and willful self-dealing transactions to benefit Mr. Trump’s personal and business interests, and violations of basic legal obligations for non-profit foundations.”", "One specific example cited was a “nationally televised fundraiser Mr. Trump held in lieu of participating in the presidential primary debate in Des Moines, Iowa, on January 28, 2016.” That Iowa fundraiser was billed as a special event for veterans; its website, donaldtrumpforvets.com, featured the name of the Trump Foundation and noted that it was a nonprofit.", "According to the final settlement, the fundraiser raised about $5.6 million — “of which $2.823 million was contributed to the Foundation; the balance was contributed by donors directly to various veterans’ groups.” But the attorney general argued the fundraiser was actually carried out by Trump’s 2016 presidential campaign and unlawfully leveraged for political purposes.", "State Supreme Court Justice Saliann Scarpulla, in her Nov. 7 court order, wrote that the $2.8 million donated to the Trump Foundation “was used for Mr. Trump’s political campaign and disbursed by Mr. Trump’s campaign staff, rather than by the Foundation,” in violation of state law. However, she acknowledged that “the Funds did ultimately reach their intended destinations, i.e., charitable organizations supporting veterans.”", "Records obtained by the state show donations totaling $2.825 million were given to 34 veterans organizations between January 2016 and June 2016.", "So, it’s false to claim that Trump “stole” the money and that “none of the veterans groups that were supposed to get the money got a single dime.”", "Instead, the judge agreed that the foundation — through the fundraiser and the subsequent grants to veterans groups (which were announced at campaign events) — was illegally used for political activities. Scarpulla wrote that a “review of the record, including the factual admissions in the Final Stipulation, establishes that Mr. Trump breached his fiduciary duty to the Foundation.”", "“Mr. Trump’s fiduciary duty breaches included allowing his campaign to orchestrate the Fundraiser, allowing his campaign, instead of the Foundation, to direct distribution of the Funds, and using the Fundraiser and distribution of the Funds to further Mr. Trump’s political campaign,” the order noted.", "While the state argued that the judge should order Trump to pay $2.823 million in damages based on the fundraiser matter, Scarpulla set the amount at $2 million.", "The Trump Foundation agreed in late 2018 to dissolve as part of the settlement with the state. The foundation agreed to donate its remaining assets of $1.78 million — along with the newly announced $2 million in damages to be paid by Trump — to eight reputable charities.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "“A.G. Underwood Announces Stipulation Dissolving Trump Foundation Under Judicial Supervision, With AG Review Of Recipient Charities.” Press release, New York State Office of the Attorney General. 18 Dec 2018.", "“Attorney General Underwood Announces Lawsuit Against Donald J. Trump Foundation And Its Board Of Directors For Extensive And Persistent Violations Of State And Federal Law.” Press release, New York State Office of the Attorney General. 14 Jun 2018.", "The People of the State of New York v. Donald Trump, et. al. Index No. 451130/2018. Decision + Order on Petition. Supreme Court of the State of New York, County of New York. 7 Nov 2019.", "“Presidential Candidate Donald Trump Rally in Des Moines, Iowa.” C-SPAN. Video. 28 Jan 2016.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]