["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A girl completes an exercise at a school in Cambodia (Global Partnership for Education)", "In development circles, no one quibbles that it’s good to educate girls. There’s plenty of evidence that it helps them and if they become mothers, that it helps their children.", "The head of the United Nations' World Food Programme Ertharin Cousin was in Armenia on Sept. 5, 2016, to talk about the importance of child nutrition and in the course of her speech, she mentioned a talking point on this topic that has been in play for decades.", "\"One extra year of schooling for girls reduces infant mortality rates among their children by up to 10 percent,\" Cousin said.", "It turns out, there are problems with Cousin’s claim. As often happens, this is a statement that has morphed over time, shifting from a more cautious assertion to a more definitive one.", "We’ll give you the highlights.", "The origins, changes to the 10 percent claim", "Staff at the World Food Programme told us they got their figure from UNESCO, the United Nations Educational, Scientific and Cultural Organization. It was part of a 2011 collection of illustrations and talking points called Education Counts and this graphic was among them.", "It reads: \"Each extra year of a mother’s schooling reduces the probability of infant mortality by 5% to 10%.\"", "Before we jump into stat forensics mode, it’s important to say that UNESCO has retired this talking point.", "The way they put it now in their 2016 global education monitoring report is, \"Achieving universal secondary schooling would make a meaningful contribution to reducing infant and child mortality.\" In short, the new statement drops the precision of the old.", "Yet there are numbers that come along with that new, broader statement.", "\"If all women in sub-Saharan Africa had upper secondary education by 2030, it would prevent 3.5 million deaths from 2050-60,\" UNESCO spokeswoman Katharine Redman told us.", "UNESCO’s wording clearly changed between 2011 and 2016 and it’s useful to note the details.", "They moved from talking about infant mortality to infant and child mortality. That’s important because the research on the tie between a mother’s education and the health of her children looked at the number of children who died before they turned 5 years old (child mortality), not the number who died before their first birthday (infant mortality).", "That research includes a seminal article from 1993, and a key 2010 survey of data from 175 countries that UNESCO in particular has relied on. Both found that more education for women is associated with lower child mortality rates. They did not measure infant mortality.", "So strictly speaking, UNESCO’s 2011 statement was a bit off when it came out.", "Does the distinction between infant and child mortality matter? It depends on who you ask.", "Health statistician Michael Stoto at Georgetown University said the two are highly correlated, so as one changed, so would the other.", "But Jishnu Das, a World Bank economist who studies both education and health, said in countries such as India, infant and child mortality rates take different paths.", "\"The child mortality rate has consistently declined while the infant mortality rate is roughly the same over a fairly long time period,\" Das said.", "The difference has implications for the role of maternal education.", "Deaths in infancy, Das told us, tend to come from complications that hit within the first few days after birth. On the other hand, deaths up to the fifth birthday relate more to \"what’s going on with the household.\"", "While the education level of the mother can improve the odds in both cases, Das said her decisions have a bigger impact on the health of older children. Knowing the importance of getting kids vaccinated and recognizing the danger of diarrhea are just two ways that can play out.", "UNESCO’s latest claim also backed away from the simple equation that each additional year of schooling would cut the child mortality rate. Instead, the agency now looks at the effect of blocks of education -- primary, lower secondary (middle school) and upper secondary (high school).", "So Cousin’s statement is relying on data that is no longer supported by its authors.", "But you can still find the organization’s old material on the Internet. Similarly, we noticed how the claim has morphed over time.", "In 1993, a Yale economist wrote \"An added year of maternal education tends to be associated with a fairly constant percentage decline in child mortality rates .. between 5 and 10 percent. By 2004 researchers cited that work as \"An extra year of girls’ education can reduce infant mortality by 5–10 percent.\"", "And by 2015, the same 1993 chapter was cited as saying \"an extra year of girls’ education cuts infant mortality by 5 to 10 percent.\"", "The differences are subtle, but they all change the meaning of the statistic and the validity of supporting research.", "It’s not all education", "Researchers Das and Stoto both emphasized that so many aspects of life can be in flux as schooling increases that it’s tough to untangle the underlying dynamics.", "At the same time a country opens more classrooms for young women, it might also be building new health clinics and improving the local water supply. All those changes would give newborns and toddlers better odds of survival.", "Emily Hannum, a University of Pennsylvania sociologist, told us there can be many reasons for the association.", "\"These could range from delayed marriage and increased age at childbearing, to lower fertility, to better access to or greater utilization of health care, to improved access to information about healthy parenting practices,\" Hannum said.", "Emmanuela Gakidou at the University of Washington is a key researcher in this field. Gakidou oversaw the 2010 research that supplied UNESCO with much of its data.", "Gakidou speaks cautiously about the impact of schooling on mortality rates.", "\"It’s hard to ascribe causality, but the data and analyses on this topic are robust enough that I think we can say that education among women of reproductive age leads to improved child survival,\" she told us. \"Other factors are also important, of course.\"", "Gakidou’s research did find that across the globe, one additional year of schooling is associated with a 10 percent decline in the child mortality rate, but Gakidou cautioned against thinking that would apply in any particular country.", "\"That’s the average effect at the global level and across all levels of education,\" she said.", "Our ruling", "The head of the World Food Programme said that one extra year of schooling for girls reduces the infant mortality rates among their children by up to 10 percent.", "Broadly speaking, the association between more education of young women and better odds for their offspring is real. But this claim suffers from several flaws. It speaks of infant mortality when the underlying research addressed child mortality. It asserts a causal link when the data, while very suggestive, don’t fully prove the point. And it treated every year of schooling the same.", "Perhaps most important, UNESCO, the source that the World Food Programme relied on, has distanced itself from this statistic.", "The statement is partially accurate but leaves out important details. We rate it Half True.", "Medium, How to build effective and sustainable National School Meals programs, Sept. 6, 2016", "UNESCO, Global education monitoring report, 2016", "UNESCO, Education & the Sustainable Development Goals, 2016", "UNESCO, Education transforms lives, 2013", "UNESCO, Education Counts: Towards the Millennium Development Goals,  2011a", "Lancet, Increased educational attainment and its effect on child mortality in 175 countries between 1970 and 2009: a systematic analysis, September 2010", "Demography, Maternal education and child health: Is there a strong causal relationship?, February 1998", "National Bureau of Economic Research, The impact of education on fertility and child mortality: do fathers really matter less than mothers?, May 2004", "Elizabeth King and Anne Hill, eds, Women’s Education in Developing Countries: Barriers, benefits and policies, World Bank, 1993", "Brookings Institution, What works in girls' education, Oct. 21, 2015", "Council on Foreign Relations, What works in girls’ education, 2004", "UNESCO, Key Messages and Data on Girls’ and Women’s Education and Literacy, April 2012", "Social Indicators Research,The determinants of Infant Mortality in the Less Developed Countries: A Cross-National Test of Five Theories, December 2000", "Journal of Human Ecology, Factors Influencing Infant and Child Mortality: A Case Study of Rajshahi District, Bangladesh, 2009", "World Development, Global Educational Expansion and Socio-Economic Development: An Assessment of Findings from the Social Sciences, 2004", "Email interview, Emily Hannum, professor of sociology and education, University of Pennsylvania, Sept. 9, 2016", "Email interview, Katharine Redman, spokeswoman, UNESCO, Sept. 12, 2016", "Email interview, Michael Stoto, professor, Health Systems Administration, Georgetown University, Sept. 12, 2016", "Email interview, Jishnu Das, lead economist, Development Research Group, World Bank, Sept. 12, 2016", "Email interview, Emmanuela Gakidou, professor, Department of Global Health, University of Washington, Sept. 9, 2016", "Email interview, Andre Vornic, spokesman, World Food Programme, Sept.7, 2016", "Photo: Global Partnership for Education, via Flickr Creative Commons", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]