["A Facebook page called “Your New Home” has been running several online promotions, claiming to give away free tiny houses and motorhomes. On February 10, 2021, the page published a post featuring an image of a tiny house.", "“This February - We are giving away three beautiful Tiny Houses for three families,” reads one of the posts, which has been shared more than 105,000 times since February 10, 2021. It then instructs people to share the post, comment with the word “WIN” and like the page.", "The page running the promotion does not list any website, and a web search came up empty.", "A reverse image search of the image used in the post shows that it is a home design by Build Tiny, a company in New Zealand that specialises in building mobile houses.", "Build Tiny told AFP Fact Check in an email that the Facebook account was using its photos against its wishes and that the promotion is a scam.", "“We are aware of these posts, there have been many similar posts all using images of our Camper tiny house. It is a SCAM and we are in no way affiliated with the page, the post, or the competition,” said Gina Stevens, the design director at Build Tiny. “We are powerless to have the images removed, [and] have reported the post and the page as a scam to Facebook, but new pages keep popping up.”", "On February 15, 2021, Build Tiny posted a warning on Facebook, explaining that images of its camper were being used to “promote a scam competition” on a similar Facebook page.", "Images from various sources", "The page has also used four other images in four different posts (here, here, here and here).", "One of the posts, published on March 12, 2021, also asks Facebook users to share, comment, and like the page. The post has been shared more than 1,900 times and people have commented on the post with the word “ME”, as instructed.", "A reverse image search shows that the photo was lifted from the website of a Canadian company called Summit Tiny Homes.", "In a message sent to AFP Fact Check through its official Facebook page, a representative for the company said that they were aware that some Facebook pages have been using their photos in fraudulent online promotions.", "“We have received reports about people using our housing designs in online scams and have reported to Facebook,” they said.", "On February 6, 2021, the page posted a video clip of a motorhome. Once again, the post once again asks people to comment on it to stand a chance of winning.", "“This February - We are giving away three beautiful mobile homes for three families. To participate: Simply share this post and comment 'me’ to WIN (sic),” reads the post.", "AFP Fact Checked traced the video clip to an auto garage in Switzerland called Autocenter Rickenbach Glanzmann. The video was lifted from their YouTube post advertising a Fiat Dethleffs motorhome.", "The Facebook page used another mobile home photo in a post published on February 2, 2021, once again with the same instructions.", "AFP Fact Check traced the photo to the website of a US company called New Frontier Tiny Homes. It was also featured in a 2017 article about the company.", "New Frontier Tiny Homes told AFP Fact Check in an email that the company has not authorised anyone to use their photos in promotions.", "“Over the years, we have received reports that scammers are using some of our photos to popularize social media pages. We have reported some, but they keep on re-inventing themselves, making it difficult for us to keep track,” said David Latimer, the company’s founder and CEO.", "Yet another post, published on the page on January 16, 2021, reads: “Unfortunately, the Christmas winner (Samantha B. – Nottingham) of our competition was under the age of 16 and unable to accept their prize. Therefore, we will be giving out this stuning Mobile Home (sic).”", "Maldita.es, a Spanish fact-checking organisation, flagged a post that was using the same photo in a similar online scam back in 2019.", "Scam to grow page", "The page uses fake giveaways to gain followers and reach. This sort of online scam is popular; it is used to attract followers to Facebook accounts or pages, which can then be sold on and renamed. The scammers may also mine people’s data, including names, phone numbers, email addresses and other personal information.", "AFP Fact Check has previously debunked numerous online giveaway scams. Read more about some of the most common types of Facebook scams in Africa.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]