["About this rating", "In February 2019 we began receiving inquiries about an internet report saying an Ohio woman had been arrested for eating her husband alive over a three-year period.", "An article published the previous month on the website News Insider said Francine Houston of Centerville was charged with mutilation and assault after police responded to a 911 call from a suspicious neighbor:", "A 62-year old Centerville, Ohio woman has been arrested on charges of mutilation and assault for a brutal crime involving her 65-year old husband.", "According to a source involved in the investigation, Mrs Francine Houston was taken into custody earlier this week after a neighbor phoned 911 to report an unusual sight through the window of the Houston property.", "The neighbor claimed to have seen Francine cutting flesh off her wheelchair-bound husband, Paul. Investigators were soon on the scene and confronted with one of the most gruesome sights imaginable.", "“There was an elderly man in a wheelchair and he was missing all his limbs, and there were fresh wounds on his abdomen,” said one of the horrified officers. “When we questioned his wife, she admitted she’d been cutting flesh off her husband for at least three years and eating it.”", "Alleged cases of homegrown cannibalism of this type this do occur, but this particularly gruesome and shocking story received no attention from local news venues whatsoever, and for good reason: It's a complete fiction. News Insider doesn't publish real news. It describes itself, rather, as \"the second most infamous fauxtire & satire entertainment website in the world. If it's disturbingly funny, you will find it here.\"", "But whereas legitimate satire tends to boast at least a modicum of literary and socially redeeming value, this article is neither entertaining nor pithy. News Insider is part of a network of junk news websites whose aggressively lurid content appears calculated instead to garner monetizable clicks and shares on social media. Among the other domains currently or formerly hosted at the same IP address are several whose names spoof those of real news organizations — NBCNews15.com, CBSNews15.com, FoxNews15.com, and CBSNews24.com, to name a few.", "Amazingly, the story about spousal cannibalism was received with enough credulity by social media users to prompt a debunking by local law enforcement. The Centerville Police Department posted the following on their Facebook page:\n\nEven more amazingly, the sheriff of another jurisdiction shared the News Insider article via his Twitter account, for which he was immediately, if politely, upbraided by the Centerville police:", "Sheriff Jones this is a completely false story designed as “click bait” to draw people onto their website. This is not from a news outlet, they claim to be an entertainment website. Please pass this along. Thanks", "— Centerville OH PD (@CentervilleOHPD) January 1, 2019", "Dwyer, Dean.   \"Centerville, OH: Woman Charged After Slowly 'Eating Her Husband Alive' Over Three Years.\"\r\n   News Insider.   1 January 2019.", "The Week.   \"7 Disturbing New Cases of Alleged Cannibalism.\"\r\n   5 June 2012.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]