["About this rating", "Blumenthal made a handful of false and misleading statements about having served in Vietnam during the period of American involvement in the war there.", "Blumenthal insisted that those misrepresentations were \"totally unintentional,\" as he has also more accurately and modestly represented his military service at other times.", "President Donald Trump's nomination of Brett Kavanaugh to serve on the U.S. Supreme Court prompted a fierce, largely partisan battle that reached a fever pitch in September 2018 when two women accused the U.S. Court of Appeals judge of having engaged in sexual assault and misconduct while he was in high school and university.", "Kavanaugh denied the allegations, but the controversy dominated political debate in the U.S. for weeks and threatened to derail the U.S. Senate's confirmation of Kavanaugh as a Supreme Court justice.", "Some supporters of President Trump and his nomination of Kavanaugh attempted to discredit the women and their associates, and the intense scrutiny associated with the saga meant that some who expressed opposition to Kavanaugh's nomination faced a backlash of their own.", "That was the case for Democratic Senator Richard Blumenthal of Connecticut, who told MSNBC on 17 September that proceeding with Kavanaugh's nomination would \"forever stain the Supreme Court\":", "Going forward with this nomination will cast a shadow and stain on an institution that depends, for its power, on credibility and trust ... This nomination would forever stain the Supreme Court in a way that I think may well be irreparable.", "﻿", "In response, a viral Facebook post termed Blumenthal himself a \"stain on the Senate\" and maintained that he \"lied about serving in Vietnam\":", "During his successful 2010 U.S. Senate campaign, Blumenthal said that he had \"misspoken\" about his military service during the Vietnam War after the New York Times obtained his Selective Service Record, which showed he received five separate draft deferments while a college student and then, when those deferments ran out, secured a spot in the U.S. Marine Corps Reserves (serving stateside, not in Vietnam).", "In a May 2010 investigation, the Times reported that Blumenthal, then Connecticut's attorney general, had on a handful of occasions given a misleading or inaccurate picture of his military service during the Vietnam War, including stating that \"I served in Vietnam\":", "At a ceremony honoring veterans and senior citizens who sent presents to soldiers overseas, Attorney General Richard Blumenthal of Connecticut rose and spoke of an earlier time in his life. “We have learned something important since the days that I served in Vietnam,” Mr. Blumenthal said to the group gathered in Norwalk in March 2008. “And you exemplify it. Whatever we think about the war, whatever we call it -- Afghanistan or Iraq -- we owe our military men and women unconditional support.”", "There was one problem: Mr. Blumenthal, a Democrat now running for the United States Senate, never served in Vietnam. He obtained at least five military deferments from 1965 to 1970 and took repeated steps that enabled him to avoid going to war, according to records.", "The deferments allowed Mr. Blumenthal to complete his studies at Harvard; pursue a graduate fellowship in England; serve as a special assistant to The Washington Post’s publisher, Katharine Graham; and ultimately take a job in the Nixon White House. In 1970, with his last deferment in jeopardy, he landed a coveted spot in the Marine Reserve, which virtually guaranteed that he would not be sent to Vietnam. He joined a unit in Washington that conducted drills and other exercises and focused on local projects, like fixing a campground and organizing a Toys for Tots drive.", "After checking an archive of Connecticut newspapers, we confirmed two separate statements in which Blumenthal either claimed or strongly implied that he had played a role in combat operations in Vietnam.", "In May 2003, the Bridgeport News reported on a rally in support of American troops in Iraq which had been organized by a local veterans council. During his speech at that rally, Blumenthal contrasted the support shown for troops in 2003 with that shown to American military personnel returning from Vietnam. \"When we returned, we saw nothing like this,\" Blumenthal said, suggesting that he had personally been among those troops who served in the country of Vietnam, which he was not:", "Blumenthal said what he was observing at City Hall moved him. \"I can't match the elegance of this picture,\" he told the crowd. \"I'm so proud to see the American flag, veterans, families, people whose hearts are with those fighting overseas.\" Blumenthal served in the Marines during the Vietnam era. \"When we returned, we saw nothing like this,\" he said. \"Let us do better by this generation of men and women.\"", "In May 2007, the Milford Mirror reported on that year's Memorial Day parade in the city. Blumenthal again suggested that he was among those troops subjected to abuse and harassment upon their return to the United States from Vietnam:", "Attorney General Richard Blumenthal said Milford was possibly the most beautiful spot in the state Sunday afternoon as people stood around the bandstand to salute fallen veterans. \"In Vietnam,\" Blumenthal said, \"we had to endure taunts and insults, and no one said 'Welcome home'. I say welcome home.\" Blumenthal said the country has learned a lesson since Vietnam, realizing that despite opinions about the ongoing war in the Middle East, military personnel there deserve respect and support.", "As reported by the New York Times, in March 2008 Blumenthal told a group of veterans in Norwalk, Connecticut, that \"We have learned something important since the days that I served in Vietnam\":", "https://youtu.be/wI7Hu6LcuWI\n\nHowever, Blumenthal has also at times described his military service in more accurate and modest terms. As shown in the MSNBC video above, in March 2010 (two months before the New York Times article) the then-Senate candidate directly contradicted his 2008 statement, saying that \"Serving in the United States military gave me a perspective as well even in the reserves, although I did not serve in Vietnam.\"", "In response to the 18 May 2010 Times article, Blumenthal arranged a press conference for the following day, during which he admitted that he had \"misspoken\" in the past when describing his military service:", "On a few occasions, I have misspoken about my service, and I regret that and I take full responsibility. But I will not allow anyone to take a few misplaced words and impugn my record of service to our country. I served in the United States Marine Corps Reserve and I am proud of it.", "In response to a question about allegations that he had misrepresented his military record, Blumenthal added:", "I may have misspoken -- I did misspeak -- on a few occasions out of hundreds that I have attended, whether events or ceremonies, and I will not allow anyone to take a few of those misplaced words and impugn my record of service. I regret that I misspoke on those occasions. I take full responsibility for it.", "Confirming the authenticity of the 2008 remarks attributed to him by the New York Times, Blumenthal asserted that he had intended to say \"since the days that I served during Vietnam,\" rather than \"since the days that I served in Vietnam\":", "A few misplaced words -- \"in\" instead of \"during\" -- totally unintentional.", "Blumenthal did not apologize for what he presented as his misstatements about his record. When invited to do so at the press conference, he merely repeated, \"I regret that I misspoke and I take full responsibility.\"", "Blumenthal's remarks at the May 2010 press conference can be viewed below:", "It is true that Blumenthal has made a handful of recorded statements that were false or misleading about his own military service during the Vietnam War and admitted as much after the publication of the New York Times' investigation in 2010. However, Blumenthal insisted that these falsehoods were \"totally unintentional\" and claimed that he had \"misspoken\" rather than being deliberately or knowingly untruthful.", "Blumenthal did not always describe his military service in false or misleading terms. At times he spoke more accurately and modestly about his time in the Marine Reserves, and in a 2010 campaign speech (given before the New York Times report was published), he stipulated that \"I did not serve in Vietnam.\"", "Farrow, Ronan amd Jane Mayer.   \"Senate Democrats Investigate a New Allegation of of Sexual Misconduct, From Brett Kavanaugh's College Years.\"\r\n    The New Yorker.   23 September 2018.", "Hernandez, Raymond.   \"Richard Blumenthal's Words on Vietnam Service Differ from History.\"\r\n    The New York Times.   17 May 2010.", "Durrell, Brad.   \"Bridgeport Shows Support for Troops.\"\r\n    The Bridgeport News.   1 May 2003.", "Dion, Jill Kaiser.   \"Parade Turnout Is Double Past Years' Attendance.\"\r\n    The Milford Mirror.   31 May 2007.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]