["The photo has been shared more than 160 times in this Facebook post uploaded on August 7, 2019.", "The photo is captioned: “This is what we all looked like at 12 weeks in the womb. Legal to kill in all 50 states. Anyone think its not a person? Pass this along. It literally might save a life.”", "Below is a screenshot of the post:", "The image has been shared tens of thousands times, for example here and here on Facebook, with an identical claim.", "The claim is false; the image actually shows a resin model of a purported fetus, which experts said did not accurately depict a 12 week old fetus.", "A Google reverse image search of the image led to this page on the One Tiny Life website, which sells 12-week-old resin models of fetuses for $25 each.", "Below is a screenshot comparison of the photo in the misleading post (L) and the image published on the One Tiny Life website (R):", "The artist, Donna Lee, wrote about the creation of the dolls on the website. It reads, in part:", "“I am not here to judge nor debate whether or not a woman should have a abortion, but to educate so she knows what a 12 week old fetus looks like. As for the medical accuracy of the 12 week clay fetus, I am an artist & did my best to portray accurate details out of a lump of clay. I have included in the model all the features that a 12 week old from conception has at this stage (neck, eyelids, ears, mouth, arms, legs, fingers & toes).", "“As for the [translucency] of the skin, that is a hard thing to capture. I hand-paint each one of these in multiple layers, but the transparent very thin skin of a 12 week old is difficult to portray in resin. I have begun to try to perfect my hand-painting of each model in order to show more deeper undertones and to give a more transparent skinlike appearance.”", "The Royal Women’s Hospital in Melbourne, Australia told AFP in a statement emailed August 23, 2019:", "“Specialists from the Royal Women’s Hospital, Melbourne, said the image did not accurately represent a fetus at 12 weeks gestation, for the following reasons:\n\t•    The skin of a 12 week fetus is thin and translucent; in the absence of developed fat and muscle this results in a more red appearance\n\t•    The proportions of the body parts of the fetus in the picture are not typical of 12 weeks fetuses, which have proportionally large hands and feet – the foot length is the approximately the same as the thigh length at this stage. \n\t•    The detailed facial features seen in the picture wouldn’t be present in a 12 week fetus.”", "Videos of a fetus at 12 weeks in the womb are available here and here on the website of the Endowment for Human Development, an American nonprofit organisation aimed at improving health science education and public health.", "The misleading claim has been circulating online since at least 2013, when fact-checking site Snopes published this report about the photo being shared on Facebook.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]