["About this rating", "In early May 2017, a viral post started circulating on Facebook, warning viewers that there was a new type of tick for which to be on the lookout. The post contains two photographs, one of a tick, and the other showing a person's skin — supposedly after the tick has burrowed inside. It was shared thousands of times:", "The person who created the post, Mychael Gallagher, told us the post is fake. He created it as an experiment with his two daughters, aged 8 and 11 years, to demonstrate how quickly false information can spread on social media. He told us in a message:", "This is 100% false. It's an experiment I did with my daughters. We wanted to see how fake news travels without anyone questioning it... I wasn't trying to scare anyone, nor did I think it would get more than 100 shares. I purposely used photos that looked fake. Like the St George watermark picture, but people still shared away without asking me any questions.", "As Gallagher pointed out, the first clue the post was not an authentic warning was that the pictures come from two different sources that have nothing to do with a \"new rare tick warning.\" The top photograph, if clicked, reveals a watermark from St. George News, which is a local news outlet for Southern Utah:", "The photograph originally accompanied a 4 October 2015 story published by the St. George News about a Grand Canyon tourist who came down with a rare disease called tick-borne relapsing fever after visiting the park:", "Prior to becoming ill, the visitor had been vacationing on the North Rim of Grand Canyon National Park and adjacent areas in mid-September, according to the statement. The visitor was treated successfully with a course of antibiotics.", "People contract TBRF after being bitten by infected soft ticks, which typically feed on rodents\nTick-borne relapsing fever, also called TBRF, is a rare, but treatable and curable, bacterial infection that occurs in the western United States, the media statement said. People contract TBRF after being bitten by infected soft ticks, which typically feed on rodents.", "The photograph below it has been on the Internet since 2008. It was originally posted on a message board for the web site SportFishWorld.com. The image was taken by a man who was bitten by a tick (but it simply bit him, and did not burrow beneath his skin). He documented the healing process:", "Gallagher told us that even though as of 23 May 2017 the post has been shared more than 50,000 times, no one bothered to ask him where he got the information — or whether it was real or fake.", "Scott, Kimberly. \"Grand Canyon Visitor Tests Positive for Fare Tick-Borne Relapsing Fever.\"\r\n  St. George News. 4 October 2015.", "Freeze, Amy. \"Rare, Potentially-Deadly Tick-Borne Disease Powassan Found in New York, New Jersey.\"\r\n  WABC [New York]. 10 May 2017.", "WPXI [Pittsburgh].   \"Experts Issue Warning About Heavy Tick Season.\"\r\n    31 March 2017.", "23 May 2017, 9:07 P.M.: Changed status from \"Unproven\" to \"False\" and added statements from Mychael Gallagher.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]