["About this rating", "In December 2019, readers asked us about the accuracy of articles that claimed stand-up comedian Michelle Wolf said in her 2019 Netflix special that having an abortion made her feel \"powerful\" and akin to God.", "On Dec. 18, the right-leaning website The Daily Wire published an article with the headline \"Anti-Trump Comedian Michelle Wolf Says Having Her Unborn Baby Killed Made Her Feel 'Powerful' Like 'God.'\" The story reported that:", "Anti-Trump comedian Michelle Wolf went on a political pro-abortion rant during her Netflix comedy special, titled “Joke Show.” Wolf spewed the left-wing abortion-on-demand talking points — this is now what passes for comedy — and then bragged about how her own abortion made her feel “powerful” like “God.”", "“You know how my abortion made me feel? Very powerful,” Wolf saying during the special, according to NewsBusters. “You know how people say you can’t play God? I walked out of there being like, ‘Move over Morgan Freeman, I am God!’” the female comedian continued, referring to the movie “Bruce Almighty.”", "The right-leaning NewsBusters website had earlier published a similar article that carried the headline \"Comedian Michelle Wolf Jokes Abortion Made Her 'Feel Very Powerful,' Like 'God.'\"", "The remarks came around 25 minutes into Wolf's 2019 stand-up comedy Netflix special \"Joke Show.\" She reflected on the issue of abortion, broadly presenting a permissive attitude towards it and musing that \"If it's a big deal to you, it's a big deal. If it's not, it's not. Both are correct.\" Switching between the wider political and moral issue of abortion, and her own personal experiences, Wolf described her own abortion as \"not a big deal.\" She then moved on to the segment that formed the basis of the Daily Wire and NewsBusters reports:", "Wolf: ... We don't talk about abortion in a real way. We talk about it in a very legislative way, but not in a real way. So I think a lot of women have a lot of apprehension surrounding it. You know, we talk about it so negatively that you feel like you should have this sense of shame after you get an abortion. Well you can feel any way you want after you get an abortion. Get one, see how you feel. [Audience laughs]. You know how my abortion made me feel? Very powerful. You know how people say you can't play God? [Gestures, audience laughs]. I walked out of there being like \"Move over Morgan Freeman, I am God!\" [Audience laughs]. And then I crossed the street very carefully. 'Cos that was the perfect time for God to be like \"You're not God, bitch, here's a bus.\" [Audience laughs].", "Both the Daily Wire and NewsBusters accurately quoted what Wolf said, and both acknowledged that her comments came in the context of a stand-up comedy performance. NewsBusters reflected that by specifying, in its headline, that Wolf had \"joked.\"", "Both websites have, in the past, defended other comedians against similarly outraged responses to jokes that some observers found offensive. In August, NewsBusters reported that \"lefty media\" \"can't take a joke,\" writing of the response to a series of jokes about trans issues by Dave Chappelle:", "\"Here we go. In the latest episode of 'Comedians In Heresy Getting Blacklisted,' legendary stand-up comedian Dave Chappelle has once again ran [sic] afoul of the politically correct crowd with jokes that refuse to kiss the ring of every insane progressive cause on the market. Leftwing sites like Vice and Slate couldn’t handle Chappelle’s jokes on trans people and cancel culture, recommending that viewers 'skip' his latest Netflix outing.\"", "That NewsBusters article was written by the same author who later condemned Wolf's abortion joke.", "In a similar vein, the Daily Wire in December defended Ricky Gervais against what it described as \"the guardians of cancel culture,\" publishing an article with the headline \"Woke [Social Justice Warriors] Are Now Blasting Ricky Gervais For Making Another Trans Joke.\"", "Prestigiacomo, Amanda.  \"Anti-Trump Comedian Michelle Wolf Says Having Her Unborn Baby Killed Made Her Feel 'Powerful' Like 'God.'\"\r\n  The Daily Wire.  18 December 2019.", "Hays, Gabriel.  \"Comedian Michelle Wolf Jokes Abortion Made Her 'Feel Very Powerful,' Like 'God.'\"\r\n  NewsBusters.  17 December 2019.", "Hays, Gabriel.  \"Can't Take a Joke: Lefty Media Slams Chappelle Stand Up as 'Transphobic.'\"\r\n  NewsBusters.  27 August 2019.", "Bois, Paul.  \"Woke SJWs Are Now Blasting Ricky Gervais for Making Another Trans Joke.\"\r\n  The Daily Wire.  22 December 2019.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]