["About this rating", "A photograph shows a woman sitting in a stadium while the majority of the crowd stands.", "The reasons why the woman was sitting, or whether the national anthem was playing when the picture was taken.", "A photograph purporting to show a Muslim woman sitting while the United States national anthem being played is frequently shared on social media along with disparaging and hateful remarks about Muslims and immigrants:", "I see the integration with our society is going well during our national anthem.", "She must be so oppressed with her iPhone and head not being cut off for being out without her husband", "The image has also been used by several far-right web sites (such as Mad World News) in articles aimed to denigrate the Muslim population. These articles labeled the photograph \"disturbing,\" called the woman's actions \"disgusting,\" and derided the thought of changing America's customs once again to appease Muslims:", "Quite the disturbing photo is going viral after it was snapped by a lady attending a public event. After the crowd was asked to rise for the National Anthem, her eye caught the disgusting thing a Muslim woman was doing &Amdahl; and it has quite a few people up in arms.", "[...]", "How many times do we hear how customs in America have to change for Muslims? How many times do they want to change something to suits their needs? This is America. If you don’t want to act like an American, go back to the third world hell hole which was created by the backwards beliefs of your religion.", "The photograph displayed above started circulating online after it was posted to Facebook by Lacey Zarnetski Hill on 22 February 2016. While Hill's post has since been deleted, the message was documented on a motocross forum:", "\"I don't usually post my opinion on this subject, but this infuriated me. I'll begin by saying that I don't treat people differently according to their appearance. I had a very friendly chat with and helped a Muslim couple find a specific toy in Target a couple weeks ago while we were shopping. I had no reason to treat them with any disrespect. With that being said, I'll make my point. Why would you choose to live in a country that you have no respect for? This was last night at the AMA Supercross in Dallas, Tx. Before the races began they, as they always do, did a great tribute of respect to our flag and those who serve our country. Every person stood and removed their hats in honor, as you can see. The whole time, this lady sat in her chair and played on her phone without showing any acknowledgement towards the thousands of people around her standing at attention. My husband, myself, and other Americans around us were offended at the lack of respect this woman showed towards the country she lives in. So my question is - Why live in America and reap the benefits of living in this great country if you have zero respect for the country and for those who serve it?\"", "While Hill's message provided a few details that were typically absent from subsequent social media postings, such as the location of the event (an AMA Supercross rally in Dallas, Texas) other details remain unclear. For instance, Hill wrote that the pictured woman sat during a \"great tribute of respect to our flag.\" While this could mean the national anthem, what it might be isn't explicitly stated in the original Facebook message.", "While this image is frequently shared along with messages criticizing the seated woman for disrespecting America, and while Hill writes that \"every person stood and removed their hats in honor,\" the image clearly shows at least one other person \"disrespecting\" the United States by wearing a hat. (It could also be argued that taking a photo during a \"great tribute of respect to our flag\" is just as disrespectful as remaining seated.)", "This photograph shows a brief moment in time, and it's impossible to know why the woman was sitting while the rest of the crowd stood. While many assumed that this woman was purposefully disrespecting the United States by sitting during a display of patriotism, there's no evidence to support that assumption. Perhaps the woman was entertaining an upset child, was momentarily fishing for something in her purse, was unable to stand, or stood moments after this photograph was taken.", "While the original Facebook message was deleted after the comment section filled with hateful rhetoric, Hill did offer some final thoughts on the image:", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]