["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Rep. Nick Rahall, D-W.Va., has voted with President Barack Obama less often than most Democrats, but still at far higher rates than he supported former President George W. Bush.", "Rep. Nick Rahall, D-W.Va., was first elected to the U.S. House of Representatives in 1976, but this fall, he will be fighting for his political life.", "Rahall -- whose district supported Mitt Romney over Barack Obama by a 33-percentage point margin in the 2012 presidential race -- is deemed no better than a tossup for re-election this fall against Democratic-turned-Republican state Sen. Evan Jenkins. A Republican poll in March 2014 had Jenkins up by a whopping 14 points.", "Given that in 2012 West Virginia gave Obama his fifth-worst showing of any state in the nation, it’s understandable that Rahall has been seeking to put some distance between himself and the president.", "During a March 12, 2014, interview with The Hill newspaper, Rahall said he will support Obama \"when he’s good for West Virginia\" and will \"oppose him when he’s bad for West Virginia.\" Asked if Obama had been good for his state overall, Rahall said, \"Probably not.\"", "He continued, \"I probably have supported George Bush more than I have Barack Obama, Am I going to switch parties because of that? No. I’m a Democrat, born a Democrat, am a Democrat and will die a Democrat.\"", "Was he correct about his support for the last two presidents? We took a look. (Rahall’s office did not respond to two inquiries for this article.)", "So what do Rahall’s vote patterns look like? We turned to Congressional Quarterly, which has tracked House members’ voting records since the 1950s in a number of ways, including how close they are to the president's stated policy stances.", "Year", "President", "Rahall’s presidential support", "2013", "Obama", "58 percent", "2012", "Obama", "64 percent", "2011", "Obama", "65 percent", "2010", "Obama", "88 percent", "2009", "Obama", "94 percent", "2008", "Bush", "18 percent", "2007", "Bush", "9 percent", "2006", "Bush", "47 percent", "2005", "Bush", "33 percent", "2004", "Bush", "45 percent", "2003", "Bush", "35 percent", "2002", "Bush", "28 percent", "2001", "Bush", "33 percent", "Average during Obama’s tenure", "74  percent", "Average during Bush’s tenure", "31 percent", "So Rahall’s memory was decidedly faulty. His \"presidential support\" score has been more than twice as high during Obama’s tenure than it was under George W. Bush.", "In fact, Rahall’s highest support score for Bush (47 percent) was lower than his lowest support for Obama (58 percent) by a double-digit margin.", "In the unlikely event that Rahall was referring to former President George H.W. Bush, we checked that possibility as well. As it turned out, Rahall’s average presidential support for the elder Bush was even lower -- 30 percent.", "Christopher Plein, an associate professor in the public administration department of West Virginia University, said that while it is important to look at the raw metrics, it’s also important to look at the substance of the votes themselves. He said that on issues of urgent importance to his constituents, such as regulations that are perceived to be a threat to coal mining, Rahall has not been hesitant to vote at cross purposes to Obama.", "\"My sense is that you would find Rep. Rahall’s positions showing variation across policy areas that might not align with common assumptions about Democratic stances on these matters,\" Plein said.", "However, while Rahall's level of voting support for Obama was lower than it was for all but 10 other Democrats in 2013, even that weak level of support is more than 27 percentage points higher than the most pro-Obama Republican in the House -- Rep. Walter Jones of North Carolina, who supported Obama about 31 percent of the time in 2013. So it's a stretch for Rahall to portray his voting record as being virtually Republican.", "Our ruling", "Rahall said, \"I probably have supported George Bush more than I have Barack Obama.\" He’s wrong: According to Congressional Quarterly, his average voting support for Obama has been 74 percent, compared to just 31 percent for George W. Bush, and his weakest support for Obama exceeded his strongest support for Bush by double digits. We rate his claim False.", "The Hill, \"Rahall: I supported Bush more than Obama,\" March 12, 2014", "Congressional Quarterly, \"Rep. Nick J. Rahall II, D–W.Va., CQ Voting Studies summary, updated February 2014 (CQ subscribers only)", "Congressional Quarterly, \"2013 Vote Studies: Presidential Support,\" Feb. 3, 2014 (CQ subscribers only)", "Email interview with Christopher Plein, associate professor in the public administration department of West Virginia University, March 17, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]