["The video was published here on Twitter on September 12, 2020. It has been viewed more than 205,500 times and retweeted more than 3,400 times after being posted by an account named \"Emergency (Breaking News)\".", "Part of the traditional Chinese-language caption translates to English as: “CCP spy arrested for starting a fire using a drone. On the 9th, FBI Officials revealed that an investigation has started since the US Department of Homeland Security's analysis model showed most of the initial fires of the west coast wildfires spread along forest roads.", "\"Li Jianjun, a 57-year-old resident who moved to the United States 20 years ago, was searched and a video was found on his laptop. GPS records of his car also show that he went to the fire site several times in early August.”", "The traditional Chinese text superimposed on the video reads: “The wildfire on the West Coast has spreaded along forests and roads, and following an investigation, a Chinese immigrant and CCP spy was arrested for starting the fire with a drone.”", "CCP is an acronym of the Chinese Communist Party, the single governing political party in China.", "The video shows fireballs being fired from an aircraft travelling over a forest. A map showing fires along the US West Coast can also be seen in the video.", "Record-breaking wildfires have burned through almost five million acres on the West Coast, forcing tens of thousands of people to evacuate their homes, AFP reported here on September 14.", "The video was also shared alongside a similar claim here, here, here, here, here and here on Facebook.", "It was also shared here, here, here, here, here and here on Twitter; and here on Weibo alongside a similar claim.", "The claim is, however, misleading.", "A reverse image search on Google found an identical video published on a US-based car enthusiast blog on August 22, 2020.", "The blog entry is titled: “POV heli-torch cam shows firefighters shooting fireballs from helicopter to stop larger fires”.", "It reads in part: “Firefighters do not randomly set trees on fire, they choose a planned line of trees to burn, keeping in mind factors like wind direction and how close it is to the larger fire they’re trying to put out.", "“What a burned line of trees does is create a firebreak or an obstacle to the spread of fire, such as a strip of open space in a forest.”", "A subsequent keyword search found the original video was also published here on Facebook and here on Instagram by Instagram user Fireman323 on August 21, 2020", "Both posts credit \"@joshua.payet\" in their captions.", "During a conversation with AFP through Instagram messenger, a person with access to the @joshua.payet account said he had filmed the video himself and was a trained firefighter. He did not reveal where the video was taken.", "“Fire agencies are not at liberty to tell you when and where an operation takes place. I can only say that \"prescribed burning'\" also known as fighting fire with fire, is a technique used by many [firefighters]. And it's my video,” he said.", "Below is a screenshot comparison between the misleading post (L) and the Facebook video (R):", "A separate keyword search found the map shown in the video in the misleading posts was published here in a September 10, 2020 report by US news magazine Newsweek. It is headlined: “Smoke From West Coast Wildfires Travels Over 4,000 Miles, Seen As Far Away As Hawaii and Ohio”.", "According to the article, the map is an image taken from Airnow.gov, a US government-run website that provides air quality data to show “smoke from West Coast wildfires traveling across the US”.", "Below is a screenshot comparison of the image in the misleading post (L) and the image in the Newsweek report (R):", "As of September 22, 2020, there were no credible media reports about a Chinese spy named Li Jianjun being arrested for starting wildfires in the US. The FBI and US Justice Department did not comment on the matter.", "The misleading claim was also debunked by Hong Kong fact-checking organisation Kauyim here and Factcheck Lab here in September 2020.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]