["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "If someone offering you $1,000 on Facebook for sharing a post sounds too good to be true, it probably is.", "So, sorry to the 84,000 people (at least) that shared this Oct. 29 Facebook post from Bill Rogers.", "\"As some of you may know I am the recent $3.4 million lotto winner. I’d like to spread some positivity so I’m sending $1,000 to the first 100k people that share this☺️☺️☺️ Comment done after you shared,\" the post said. It included a picture of a PayPal account with a balance of $3.46 million.", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "It’s a hoax.", "There are two ways to tell.", "First, the easy way. Multiply $1,000 by 100,000 and you get $100 million -- not the $3.4 million Rogers said he had.", "Second, if you performed a reverse Google image search of the picture Rogers included, you would find that this image, and gimmick, has been used before.", "The Twitter user @calebproera used the same image in a post Oct. 22. It popped up on a different Facebook timeline with the same message on Oct. 8.", "And if you searched the caption Rogers wrote, you would see the same post from a different Facebook user Oct. 8 and another version from a different Twitter user Oct. 6. And, for good measure, again on from Sept. 16.", "Sorry if you thought the free money was on its way.", "It’s not. This claim rates Pants on Fire.", "Facebook, Billy Rogers post, Oct. 29, 2018", "Twitter post, Oct. 22, 2018", "Facebook post, Oct. 8, 2018", "Facebook post, Oct. 8, 2018", "Twitter post, Oct. 6, 2018", "Twitter post, Sept. 16, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]