["By Saranac Hale Spencer", "Posted on November 30, 2018", "A popular website that spreads misinformation and conspiracy theories has twisted old news about a hate crimes hotline to create a bogus, anti-Muslim headline.", "In June 2017, Minneapolis opened a new hotline for reporting hate crimes.", "Why does that matter in 2018? Because on Nov. 27, a website known for spreading misinformation and conspiracy theories posted a story with the headline: “Minneapolis Installs Sharia Hotline to Report Americans Who Criticize Islam.”", "It’s typical for purveyors of misinformation to take old news, like the announcement of this hotline, and twist it to create an incendiary, clickbait headline that is based on a kernel of truth. The site that posted this story, News Punch, used to be called YourNewsWire, which we’ve written about several times before.", "Their method works, too. The News Punch story has been shared on social media pages with a combined following of 2.6 million, while a copy of the story that was posted on another website, The Liberty Eagle, has been shared on social media pages with a combined following of 2.2 million, according to data from CrowdTangle.", "But the headline isn’t true. Minneapolis didn’t create a “Sharia hotline to report Americans who criticize Islam.”", "Rather, the city started a hotline for reporting hate crimes, which it defined as “any crime against a person or property motivated by prejudice against someone’s race, religion, disability, sexual orientation, ethnicity, gender or gender identity. This includes prejudice-motivated property damage (including graffiti), stalking and assault.”", "The story that follows the false headline does include some accurate information, although it is mixed with misinformation, and is lifted largely from a right-wing website called WND that wrote about the hotline shortly after it was announced in 2017. WND describes itself as “a fiercely independent news site committed to hard-hitting investigative reporting of government waste,” but it was one of the sites to advance the thoroughly debunked “birther” conspiracy theory that former President Barack Obama wasn’t born in the U.S.", "One example of accurate information mixing with misinformation shows up in both the WND story and the News Punch story. They each cite a real statement from Minneapolis Department of Civil Rights Director Velma Korbel, who said after the 2016 election: “Since the general election, many of us have experienced, witnessed firsthand or heard of actions of: racism, xenophobia, sexism and bigotry directed at people here and in cities across the United States. In no uncertain terms, hate-motivated speech and actions have no place in Minneapolis nor will they be tolerated. Activities such as these are against the law. No one is above the law.”", "But both stories introduce the quote by claiming that the hotline would “target” supporters of President Donald Trump. That’s not true.", "Korbel’s statement says that there had been an increase in “hate-motivated speech and actions” since Trump was elected. Reported incidents of hate crimes rose by 17 percent nationally in 2017, according to the FBI’s annual hate crime statistics report released on Nov. 13. In Minnesota, there was a 23 percent increase in 2017, compared to the year before.", "The News Punch story also wrongly says Minneapolis is “run by Democrat Mayor Besty [sic] Hodges.” Betsy Hodges was the mayor when WND posted its story, but Jacob Frey is the current mayor. He took office in January.", "After publishing the story, News Punch changed its headline to say: “Minneapolis Installs ‘Sharia’ Hotline to Report ‘Hate Speech’ About Islam.” It’s still not true that it’s a “‘Sharia’ hotline,” and it isn’t true that the hotline is solely for reporting “‘hate speech’ about Islam.” Instead, it is for reporting hate crimes of any kind.", "As of this writing, the Liberty Eagle still had the original headline on its website.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on the social media network.", "“New hotline to report hate crimes: call 311 from inside Minneapolis or 612-673-3000.” Press release. Minneapolismn.gov. 19 Jun 2017.", "Dmitry, Baxter. “Minneapolis Installs ‘Sharia’ Hotline to Report ‘Hate Speech’ About Islam.” NewsPunch.com. 27 Nov 2018.", "“IS OBAMA CONSTITUTIONALLY ELIGIBLE TO SERVE? WND’s complete archive of news reports on the issue.” WND.com. 15 Jun 2012.", "Robertson, Lori. “Indeed, Born in the U.S.A.” FactCheck.org. 27 Apr 2011.", "“2017 Hate Crime Statistics Released — Report Shows More Departments Reporting Hate Crime Statistics.” Press Release. Federal Bureau of Investigation. 13 Nov 2018.", "Federal Bureau of Investigation. 2017 Hate Crimes Statistics — Agency Hate Crime Reporting by State. 13 Nov 2018.", "Federal Bureau of Investigation. 2016 Hate Crimes Statistics — Agency Hate Crime Reporting by State. 13 Nov 2017.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]