["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Trump supporters try to break through a police barrier, Wednesday, Jan. 6, 2021, at the Capitol in Washington. (AP)", "California Senate Republican Leader Shannon Grove falsely claimed antifa was to blame for the riots at the U.S. Capitol.", "Video and photographs from the scene show people wearing and waving Trump-branded paraphernalia and flags.", "Reporters covering the events described the crowd as Trump supporters. The crowd also included supporters of the QAnon conspiracy theory, according to reporters present.", "Grove deleted the tweet shortly after posting it.", "One of California’s highest ranking Republican leaders baselessly pinned Wednesday’s storming of the U.S. Capitol on antifa, despite overwhelming video evidence showing it was supporters of President Trump who broke into the building in Washington, D.C.", "\"Patriots don’t act like this !!! This was Antifa,\" Sen. Shannon Grove wrote in a Tweet, which has since been deleted.", "Grove is from Bakersfield and is the state Senate Republican Leader.", "Grove’s post, which was live on Twitter for only a few moments approximately, cited a separate tweet and photo from attorney and Trump supporter Lin Wood. He claimed two men in the photo are affiliated with antifa, a loosely affiliated group of far-left anti-fascism activists.", "The problem? One of the men was quickly identified by journalists who track far-right extremism as a neo-Nazi.", "Similar groundless claims about antifa appeared on Facebook and in pro-Trump media, including from Rep. Mo Brooks (R-Ala.) who tweeted \"ANTIFA fascists in backwards MAGA hats,\" suggesting that some members of the violent mob were not supporters of the president.", "But video and photographs from the scene show people wearing and waving Trump-branded paraphernalia and flags. Reporters covering the events described the crowd as Trump supporters. The crowd also included supporters of the QAnon conspiracy theory, according to reporters present.", "Trump spoke to a rally of supporters in Washington hours before the violence erupted, and he urged them to come to the city on Jan. 6 and back his efforts to overturn the election.", "Grove’s spokesperson declined an interview request and cited a follow-up tweet by the senator, which reads: \"This is unacceptable. America guarantees the freedom of speech and to protest, but this is not the way to settle differences. Enough.\"", "We rated Grove’s tweet about antifa Pants On Fire.", "PANTS ON FIRE – The statement is not accurate and makes a ridiculous claim.", "Image of deleted tweet by Sen. Shannon Grove, Jan. 6, 2021", "PolitiFact, A day of crisis at the US Capitol, fact-checked, Jan. 6, 2021", "PBS News, WATCH LIVE: Protesters breach U.S. Capitol building during Congress count of Electoral College votes, Jan. 6, 2021", "Associated Press, images from U.S. Capitol, Jan. 6, 2021", "Will Sommer, Daily Beast reporter, tweet, Jan. 6, 2021", "Igor Bobic, HuffPost reporter, tweet, Jan. 6, 2021", "Robert Evans, investigative journalist, tweet, Jan. 6, 2021", "Anna Merlan, senior staff writer at Vice, tweet, Jan. 6, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]