["GOP presidential hopeful Jeb Bush implied in a new campaign ad that the jobs boom Florida enjoyed while he was governor can be a reality for the entire country if he’s elected to the Oval Office.", "\"As governor, I cut taxes, cut spending, balanced budgets, and Florida led the nation in job creation,\" he said in a Sept. 8, 2015, commercial.", "We wanted to see if Bush’s claim about job creation really put Florida in front of all 50 states.", "Tallahassee tally", "The time frame Bush is using here is key, because he is relying on a distinct slice of jobs data. His campaign said they are measuring total job growth for the period between January 2000 and January 2007, or Bush’s last seven years as governor.", "Let’s look at the way Bush’s people have sampled it: Using Bureau of Labor Statistics data for seasonally adjusted, nonfarm jobs, Florida indeed led the nation in total job creation from 2000-07, with 1.1 million new jobs. Second in that time span was California, with 1 million.", "Bush took office on Jan. 5, 1999, however, so why leave off 1999? Because then the top two spots switch places. California created 1.48 million new jobs, while Florida made 1.33 million.", "Just looking at 2000 to 2007 leaves out context, though. First, the economy began to falter a month before Bush left office, and the state started losing positions a couple of months after that. By the end of 2007 Florida had shed 106,000 jobs, many of which were from the construction and real estate industries that had expanded during the housing bubble. The state eventually lost about 1 million, or almost the entire total of job expansion from Bush’s time as governor.", "And as economists have told PolitiFact Florida time and time and time (and time) again, governors have limited impact on jobs numbers in the first place. Officials often enjoy or suffer from economies beyond their direct control, and Bush was no different, said David Cooper, an analyst for the left-leaning Economic Policy Institute. And in this case, the end result isn’t something Bush should be too happy about.", "\"Florida’s job losses in the recession were far worse than the national average and far worse than all of its neighbors,\" Cooper said. \"I’m not sure how much credit we should give to the governor for the state’s job growth during that time, and even if we could credit him, I’m not sure he should want it.\"", "Also, the jobs during Bush’s time weren’t the greatest in the first place. Even the source Bush cites, a South Florida Sun-Sentinel wrap-up of Bush’s two terms the Post reprinted, said as much: \"But while Florida led the nation in job creation, much of that was in low-paid service industry jobs that left many Floridians without health insurance and scrambling for affordable housing amid a real estate boom that helped fuel business-friendly tax breaks.\"", "Former Sun-Sentinel reporter Linda Kleindienst, who now is editor of Tallahassee business magazine 850, told us she had used state numbers from the Office of Economic and Demographic Research. Her point was that while there were more jobs, many of them offered poor pay and often no benefits.", "And finally, using total job numbers to paint a picture of success isn’t the best method to measure success. Florida is one of the largest states, so of course it would create a lot of jobs.", "\"Comparing totals completely lacks context — it doesn’t really tell you anything unless you’re comparing totals among states of roughly equally sized economies and labor markets,\" Cooper said.", "A better way would be to measure Florida’s rate of job growth, as a percentage of total jobs. When we measure that, whether we start in January 1999 or 2000, Florida comes in fifth:", "State", "Jan. 1999 - Jan. 2007", "Jan. 2000 - Jan. 2007", "Nevada", "34.6 percent", "24.8 percent", "Arizona", "25.9 percent", "20.7 percent", "Wyoming", "23.7 percent", "20 percent", "Idaho", "22.6 percent", "17.9 percent", "Florida", "19.8 percent", "15.8 percent", "Our ruling", "Bush said \"Florida led the nation in job creation\" while he was governor.", "This is true if you parse the numbers the way his campaign did, looking only at total job growth over the last seven years of his eight-year tenure. But there are plenty of caveats to the talking point, including the prevalence of low-paying jobs that Bush policies didn’t necessarily create.  Many of those jobs evaporated after the housing bubble burst. A more level way to measure jobs would have been to look at the growth rate, which put Florida fifth in the country while Bush was in office.", "There are many angles to explore in jobs data, and Bush’s view only tells part of the story. We rate his statement Half True.", "YouTube, \"I've Delivered,\" Sept. 8, 2015", "South Florida Sun-Sentinel via Washington Post, \"The Jeb Bush Era Ends in Florida,\" Jan. 7, 2007", "PolitiFact Wisconsin, \"Dem recall candidate Tom Barrett says GOP Wisconsin Gov. Scott Walker ‘caused’ top job losses in U.S.,\" May 6, 2012", "PolitiFact New Hampshire, \"Obama attacks Romney over 40,000 lost manufacturing jobs in Massachusetts and state falling to 47th in job creation,\" June 14, 2012", "PolitiFact Florida, \"Rick Scott says Florida's economy soured under Charlie Crist,\" Dec. 14, 2012", "PolitiFact Florida, \"Rick Scott blames Charlie Crist for 832,000 job losses,\" Oct. 10, 2014", "PolitiFact Florida, \"Jeb Bush says 1.3 million jobs were created in Florida during his tenure -- more than Texas,\" June 3, 2015", "Center on Budget and Policy Priorities, \"Chart Book: The Legacy of the Great Recession,\" Sept. 9, 2015", "U.S. Bureau of Labor Statistics, \"State and Metro Area Employment, Hours, & Earnings,\" accessed Sept. 9, 2015", "Interview with Allie Brandenburger, Bush spokeswoman, Sept. 9, 2015", "Interview with Gary Steinberg, U.S. Bureau of Labor Statistics press officer, Sept. 9, 2015", "Interview with David Cooper, Economic Policy Institute economic analyst, Sept. 9, 2015", "Interview with Linda Kleindienst, 850 magazine editor, Sept. 9, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]