["The claims were shared in this Facebook post on February 1, 2021.", "It features a photo of Mikovits, who has previously falsely claimed that flu vaccines contain coronaviruses and that Covid-19 jabs could kill 50 million Americans. She appeared in the viral 2020 documentary “Plandemic”, which was widely discredited for making false claims about Covid-19.", "“Thanks to Anthony Fauci, she was arrested without charges and placed on a 5 year gag order, destroying her reputation, career, and personal life,” the post reads.", "“Molecular biologist Dr. Judy A. Mikovits was thrown in jail after discovering evidence that deadly retroviruses are transmitted through vaccines given to humans.”", "Identical posts have been shared on Facebook around the world during the pandemic, including Canada, the US and the Philippines.", "The claim is false. There are no credible reports that Mikovits has been detained in 2021.", "In 2011, she was arrested and briefly jailed in California. According to documents from a California district court, however, she was arrested on charges of theft from the laboratory that performed the ill-fated study, not for research on retroviruses.", "\"Plaintiff Judy Anne Mikovits... (was terminated) as a researcher with the Whittemore-Peterson Institute (WPI), located in Reno, Nevada, and (subsequently arrested on allegations) that she stole propriety information from the research facility. On November 18, 2011, plaintiff was arrested Ventura County,\" this court filing reads.", "She was earlier charged in Reno with \"possession of stolen property\" and \"unlawful taking of computer data, equipment, supplies, or other computer related property\".", "The same details surrounding her arrest were reported by the New York Times, Science magazine, ABC News, and the Chicago Tribune.", "The charges against her were eventually dropped, the New York Times reported on June 14, 2012.", "Discredited research", "The claim that Mikovits was jailed for her allegedly discovering evidence that “deadly retroviruses are transmitted through vaccines” is also misleading.", "Keyword searches on Google Scholar did not yield any reliable academic publication indicating she made such a discovery.", "Mikovits’s discredited study on retroviruses found that the retrovirus XMRV was frequently present in the blood of chronic fatigue sufferers, without establishing a causal link.", "The findings of the research were published in the academic journal Science in 2009 and aroused great interest at the time as it provided a possible explanation for the origins of chronic fatigue syndrome, a debilitating disease that had long baffled scientists.", "The study did not find that “deadly retroviruses are transmitted through vaccines”.", "The paper was retracted in 2011. Academic journal Science cited sample contamination and failure by multiple laboratories to replicate its findings.", "“Multiple laboratories, including those of the original authors, have failed to reliably detect (the retrovirus) or other… related viruses in chronic fatigue syndrome (CFS) patients,” the retraction read. “In addition, there is evidence of poor quality control in a number of specific experiments in the report.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]