["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Ted Cruz, shown here speaking at an Austin event Aug. 4, 2018, says in an ad that Beto O'Rourke is open to abolishing Immigration and Customs Enforcement (STEPHEN SPILLMAN, for the Austin American-Statesman).", "Republican Ted Cruz, seeking re-election to the U.S. Senate, calls Democratic challenger Beto O’Rourke too extreme and reckless for Texas in a video ad including the charge that O’Rourke, the El Paso congressman, is amenable to wiping out the nation’s lead immigration agency.", "In the ad, brought to light by an Aug. 3, 2018, Texas Tribune news story, Cruz’s narrator says: \"Not even Nancy Pelosi is open to abolishing ICE. But Beto is.\" Imagery shows Pelosi and O’Rourke and what looks like a July 2018 Tribune excerpt stating: \"...I’m open to doing that…\"", "By email, Cruz campaign spokeswoman Emily Miller pointed us to a July 1, 2018, Cruz press release taking note of the Tribune reporting that O’Rourke had said he was open to abolishing Immigration & Customs Enforcement, an idea embraced by some Democrats upset by actions including the separation of children and parents at the U.S.-Mexico border.", "Miller also pointed out a Cruz release noting that O’Rourke on July 18, 2018 voted against a resolution offering support to ICE officers. O’Rourke was among 34 Democrats to vote against the House-advanced resolution, which was described by The Hill, a Capitol newspaper, as a move by Republicans to divide Democrats by holding a vote on ICE's vitality to public safety. \"Republicans have pounced on those Democrats seeking to abolish ICE,\" the Hill reported, \"accusing them of defending immigrants with no legal status — including violent criminals — instead of protecting the American public.\"", "So, is O’Rourke open to offing ICE?", "He said as much in July 2018, we confirmed, though he also declared that he wouldn’t support abolition without a plan to shift its responsibilities elsewhere. More recently, O’Rourke has said abolition by itself doesn’t make sense.", "O’Rourke says he’s open to abolition if duties transfer", "Our search for relevant news accounts led us to a July 2, 2018, Tribune news story quoting O’Rourke initially saying at a San Antonio stop that he’s open to doing away with ICE or changing how it performs and giving its enforcement duties to another entity--and, in the same appearance, saying he opposes abolishing ICE.", "From the story:", "\"Asked about abolishing ICE Friday at a town hall in San Antonio, O'Rourke discussed the need to eliminate fear in immigrant communities under Trump and to find a better way to enforce immigration laws. ‘And if that involves doing away with this agency, giving that responsibility to somebody else, changing how this agency performs, I’m open to doing that,’ O’Rourke said.", "\"Yet he went on to flatly answer no when directly asked if he would abolish ICE, explaining that he does not currently know enough about how immigration law would be enforced without the agency.", "\"‘I understand the urgency of this,’ O’Rourke said in conclusion. ‘I just want to make sure that we’re constructive in how we talk about meeting this challenge and that I understand what abolishing ICE would mean in terms of enforcing our laws going forward.’\"", "The day before, Tribune reporter Patrick Svitek posted a tweet quoting O’Rourke at greater length.", "According to Svitek, O’Rourke agreed with the individual who asked him about ICE that there’s got \"to be a better way of enforcing our laws, not using those tactics that instill fear, that do not reflect the best of us, not separating children from their parents at the border and keeping them in cages. And so if there’s another, better way to enforce our immigration laws--and I hope we’re all on the same page that we want to make sure that laws are enforced, we want to make sure that our laws reflect who we are and that we change those laws to make sure that we make the most out of all of us--then I’m open to that.\"", "O’Rourke’s reply went on: \"And if that involves doing away with this agency, giving that responsibility to somebody else, changing how this agency performs, I’m open to doing that.\"", "Next, Svitek reported, someone asked: \"So would you abolish ICE?\" O’Rourke replied, per the tweet: \"No. So let me be really clear: I don’t know enough about how we would perform those same enforcement functions, if through another part of the Department of Homeland Security. But if you’re saying abolish the tactics that I just described, yes. I don’t know if you have to abolish the agency to do that…\" He added: \"I just want to make sure that we’re constructive in how we talk about meeting this challenge and that I understand what abolishing ICE would mean in terms of enforcing our laws going forward.\"", "Other news accounts", "Next we, searched the Nexis news database for instances of O’Rourke speaking about ICE, finding:", "--A July 5, 2018, Longview News-Journal news story quoting O’Rourke saying in a phone interview that he would join discussions of ICE’s future and how it fulfills its mandate.", "--A July 6, 2018, Houston Chronicle news story stating O’Rourke had stopped short of calling for ICE’s elimination but was willing to discuss the idea. According to the story, O’Rourke expressed a willingness after a stop in Hillsboro to discuss eliminating ICE, but he said that alone would not solve the problem. O’Rourke said it doesn’t matter if agencies like ICE and Homeland Security are eliminated if such moves don’t address practices including the separation of children from parents at the U.S.-Mexico border. \"I want to make sure we are ending the practices of taking kids from their families,\" O’Rourke said. \"I want to focus on ending the practices.\"", "--Most recently, O’Rourke was asked in an interview posted online July 25, 2018: \"Some of your Democratic colleagues are saying just abolish ICE altogether. A bridge too far for you?\" O’Rourke replied on ABC Radio’s Powerhouse Politics Podcast: \"I just don’t understand it. It’s not clear to me what that would accomplish.\" O’Rourke elaborated that abolishing the agency wouldn’t solve the separation of children from parents or the deaths of migrants near the border. \"Abolishing ICE does nothing to solve any of those issues,\" O’Rourke said, in contrast to making changes in federal policy.", "Ad also touches impeachment, narcotics", "Cruz’s ad also says O’Rourke supports impeaching President Donald Trump and suggested legalizing all narcotics including heroin--topics we’ve explored.", "O’Rourke said in an interview for Showtime’s \"The Circus\" in May 2018 that he was willing then to vote to impeach Trump, which constitutionally occurs in the House, though he’s since stressed that he’s not campaigned for impeachment proceedings to commence and he voted against a December 2017 impeachment resolution. This summer, we rated False a Cruz claim that O’Rourke was the nation’s only Senate candidate to call for impeaching Trump.", "On his campaign website, O’Rourke calls for ending the war on drugs and leaving marijuana regulation to the states. As a member of the El Paso City Council, O’Rourke in 2009 amended a council resolution to include language supporting \"an honest, open national debate on ending the prohibition on narcotics.\" At the time, O’Rourke was explicit about not yet personally favoring across-the-board legalization. The council-approved resolution, which didn’t specify any drugs including heroin, was later vetoed. In May 2018, we rated False a claim by Cruz that O’Rourke had a resolution to legalize all narcotics.", "Our ruling", "Cruz said in his ad that O’Rourke is \"open to abolishing ICE.\"", "In June 2018, O’Rourke said he’s open to abolishing ICE. However, he also said he wasn’t in favor of eliminating the agency without ensuring its enforcement duties were assigned elsewhere.", "We rate this claim Mostly True.", "MOSTLY TRUE – The statement is accurate but needs clarification or additional information. Click here for more on the six PolitiFact ratings and how we select facts to check.", "Emails, Emily Miller, Ted Cruz campaign, Aug. 6, 2018", "Webpages, House Resolution 990 and \"All Actions,\"\"Supporting the officers and personnel who carry out the important mission of the United States Immigration and Customs Enforcement,\" 117th Congress (2017-18) (accessed Aug. 6, 2018)", "News story, \"These Democrats want to abolish ICE,\" CNN, July 3, 2018", "News story, \"House backs resolution expressing support for ICE,\" The Hill, July 18, 2018", "News stories, Texas Tribune, \"Marijuana legalization, war on drugs emerge as issues in race between Beto O'Rourke and Ted Cruz,\" May 2, 2018; \"#AbolishICE? Texas Democrats begin to navigate emerging issue,\" July 2, 2018;  \"Ted Cruz releases first TV ads of 2018, including 3 attacking Beto O'Rourke,\" Aug. 3, 2018", "Tweet quoting Beto O’Rourke’s responses to queries about abolishing ICE, Patrick Svitek, Texas Tribune, June 30, 2018", "News story, \"GOP Sen. Cruz cruises into Longview with re-election campaign, touts Supreme Court choice,\" Longview News-Journal, July 5, 2018", "News story, \"Ted Cruz seizes on Beto O’Rourke’s willingness to consider abolishing ICE,\" Houston Chronicle, July 6, 2018", "Podcast including an interview with Beto O’Rourke, \"Powerhouse Politics,\" ABC Radio and TuneIn, July 25, 2018 (Question about abolishing ICE at about 20:30 mark)", "Web page, \"Justice,\" Beto O'Rourke campaign, undated (accessed May 2, 2018)", "Resolution, El Paso City Council, Jan. 6, 2009", "News story, \"Two Sides of a Border: One Violent, One Peaceful,\" New York Times, Jan. 22, 2009", "Truth-O-Meter articles, PolitiFact Texas, \"Silvestre Reyes says challenger favors legalizing drugs,\" March 7, 2012;  \"Ted Cruz falsely says Beto O'Rourke once resolved to legalize all narcotics,\"  May 2, 2018; \"Is Beto O'Rourke the only Senate candidate to call for Donald Trump's impeachment?,\" \"UPDATED: How Beto O'Rourke is a yes and no on impeaching Donald Trump now,\" July 25, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]