["In this Oct. 1, 2020 file photo, President Donald Trump walks from Marine One to the White House in Washington as he returns from Bedminster, N.J. (AP)", "On Monday, President Donald Trump claimed that the World Health Organization (WHO) \"admitted\" he was correct that using lockdowns to control the spread of COVID-19 was more damaging than the illness.", "In a post on Twitter, Trump wrote: \"The World Health Organization just admitted that I was right. Lockdowns are killing countries all over the world. The cure cannot be worse than the problem itself. Open up your states, Democrat governors. Open up New York. A long battle, but they finally did the right thing!\"", "He reiterated his statement later that night during a campaign rally, saying, \"But the World Health Organization, did you see what happened? They just came out a little while ago, and they admitted that Donald Trump was right. The lockdowns are doing tremendous damage to these Democrat-run states, where they’re locked out, sealed up. Suicide rates, drug rates, alcoholism, deaths by so many different forms. You can’t do that.\"", "Together, the tweet and these comments got considerable attention on social media.", "But did the WHO change its stance on lockdowns or concede anything to Trump, as he said it did? Briefly, no.", "Since May,  Trump has been vocal about asking states to reopen businesses, schools, religious services and other social activities. He also took credit for locking down the U.S. in the early stages of the pandemic, however. And his administration largely delegated lockdown decisions to governors and local governments.", "Yet those lockdowns — marked by stay-at-home orders and other restrictions — have been less stringent than those implemented in other countries, said Brooke Nichols, an assistant professor of global health at Boston University.", "The \"definition has differed country by country and state by state. I would argue that the U.S. has never had an actual enforced lockdown like there have been in some Asian countries and in Italy last spring,\" Nichols wrote in an email.", "We reached out to the Trump campaign and the White House to ask for more information about Trump’s assertion but didn’t receive a response.", "Although the Trump team didn’t get back to us, we noticed that the Trump War Room Twitter account responded to Trump’s tweet with a link to a video, appearing to back up the president’s claim.", "The video is a clip from an Oct. 8 interview with Dr. David Nabarro, a special envoy on COVID-19 for the WHO, by Scottish journalist Andrew Neil. The segment was televised by the British news outlet Spectator TV.", "In response to a question about the economic consequences of lockdowns, Nabarro said: \"We in the World Health Organization do not advocate lockdowns as the primary means of control of this virus. The only time we believe a lockdown is justified is to buy you time to reorganize, regroup, rebalance your resources; protect your health workers who are exhausted. But by and large, we’d rather not do it.\" Nabarro then went on to describe potential economic consequences, including effects on the tourism industry and farmers or the worsening of world poverty.", "We checked with Nabarro to find out if the clip accurately reflected the points he raised during a nearly 20-minute interview. He responded, by email: \"My comments were taken totally out of context. The WHO position is consistent.\"", "That context Nabarro mentioned covered a range of topics, such as the estimate that about 90% of the world’s population is still vulnerable to COVID-19, that lockdowns are only an effective pandemic response in extreme circumstances and what Nabarro means when he talks about finding the \"middle path.\"", "\"We’re saying we really do have to learn how to coexist with this virus in a way that doesn’t require constant closing down of economies, but at the same time in a way that is not associated with high levels of suffering and death,\" Nabarro said in the interview.", "To achieve that via the middle path approach, robust defenses against the virus must be put in place, said Nabarro, including having well-organized public health services, such as testing, contact tracing and isolation. It also involves communities adhering to public health guidelines such as wearing masks, physical distancing and practicing good hygiene.", "So, it’s really not accurate for the president to imply that the WHO has or has not supported lockdowns, said Lawrence Gostin, a global health law professor at Georgetown University. It’s not as simple as an either-or choice.", "\"No one is saying that lockdowns should never be used, just that they shouldn't be used as a primary or only method,\" Gostin wrote in an email.", "And Josh Michaud, associate director of global health policy at KFF, said both the WHO and public health experts have acknowledged there are economic consequences to lockdowns. (KHN is an editorially independent program of KFF.)", "\"Strict lockdowns are best used sparingly and in a time-limited fashion because they can cause negative health and economic consequences,\" said Michaud. \"That is why Nabarro said lockdowns are not recommended as the ‘primary’ control measure. Critics like to frame lockdowns as being recommended as the only measure, when in reality that is not the case.\"", "And what about Trump’s assertion that the WHO had changed its position and admitted he was right?", "A member of the WHO media office told us in a statement, \"Our position on lockdowns and other severe movement restrictions has been consistent since the beginning. We recognize that they are costly to societies, economies and individuals, but may need to be used if COVID-19 transmission is out of control.\"", "\"WHO has never advocated for national lockdowns as a primary means for controlling the virus. Dr. Nabarro was repeating our advice to governments to ‘do it all,’\" the spokesperson said.", "To test this premise, we looked at statements by WHO leaders over the course of the pandemic. In the multiple media briefings we reviewed from February onward, the WHO appeared consistent in its messaging about what lockdowns should be deployed for: to give governments time to respond to a high number of COVID-19 cases and get a reprieve for health care workers. Although WHO leaders in February supported the shutting down of the city of Wuhan, China, the presumed source of the COVID-19 outbreak, they have also acknowledged that lockdowns can have serious economic effects, and that robust testing, contact tracing and physical distancing are usually preferable to completely locking down.", "There is also no evidence the WHO \"admitted\" Trump was right about lockdowns.", "Trump tweeted on Monday and then said later that night at a campaign rally that the WHO admitted he was right about lockdowns.", "We found no evidence the WHO made this admission. And, based on a review of WHO communications, we found its messaging on the topic has been consistent since the pandemic’s early days.", "Trump also appears to have relied on a brief video clip of a wide-ranging interview with WHO special envoy Dr. David Nabarro that didn’t give an accurate portrayal of how Nabarro characterized the use of this intervention.", "We rate this statement False.", "4SD, \"Reflections About the Middle Path,\" accessed Oct. 14, 2020", "The Associated Press, \"AP Fact Check: Trump’s Distortions on WHO and Lockdowns,\" Oct. 13, 2020", "Email exchange with Dr. David Nabarro, special envoy of the World Health Organization to the director-general on COVID-19, Oct. 13, 2020", "Email interview with Brooke Nichols, assistant professor of global health at Boston University, Oct. 13, 2020", "Email interview with Josh Michaud, associate director for global health policy at KFF (Kaiser Family Foundation), Oct. 13, 2020", "Email interview with Lawrence Gostin, faculty director of the O’Neill Institute for National and Global Health Law at Georgetown University, Oct. 13, 2020", "Email statement from the World Health Organization press office, Oct. 13, 2020", "Forbes, \"WHO Warning About Covid-19 Coronavirus Lockdowns Is Taken out of Context,\" Oct. 13, 2020", "Newsweek, \"Fact Check: Does the WHO Now Agree With Donald Trump on Ending Lockdowns?\" Oct. 13, 2020", "The New York Times, \"Trump’s False Claims as He Resumes His Rallies After Hospitalization,\" Oct. 13, 2020", "Rev.com, \"Donald Trump Campaign Rally Sanford, Florida Transcript October 12: First Rally Since Diagnosis,\" Oct. 12, 2020", "Twitter, Donald Trump tweet, Oct. 12, 2020", "Twitter, Trump War Room tweet, Oct. 12, 2020", "Twitter, World Health Organization tweet, Oct. 13, 2020", "Twitter, Gabby Stern tweet, Oct. 13, 2020", "World Health Organization, \"Coronavirus Full Press Conference 12 Feb 2020,\" Feb. 12, 2020", "World Health Organization, \"COVID-19 Virtual Press Conference 13 April 2020,\" April 13, 2020", "World Health Organization, \"COVID-19 Virtual Press Conference 29 June 2020,\" June 29, 2020", "World Health Organization, \"WHO Director-General's Opening Remarks at the Media Briefing on COVID-19 — 21 August 2020,\" Aug. 21, 2020", "YouTube, \"The Week in 60 Minutes #6 - with Andrew Neil and WHO Covid-19 envoy David Nabarro | SpectatorTV,\" Oct. 8, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]