["Virginia Gov. Ralph Northam made confusing comments in 2019 about abortions when a mother is about to go into labor, but this Facebook post overreaches by claiming that killing newborns is legal in that state.", "Virginia Gov. Ralph Northam worked as a doctor before he was elected to helm the Commonwealth, and it’s not hard to find photos of him online wearing a stethoscope around his neck.", "One such picture shared on social media features text on top criticizing the state.", "\"Thanks Virginia,\" it says. \"OK to kill babies once born.\"", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "One account that posted the image also links to a Jan. 30, 2019, National Review article with this headline: \"Virginia governor defends letting infants die.\"", "It is not legal to kill babies once born in Virginia. That is a felony.", "But here’s what you need to know about the late-term abortion debate in the state.", "That story cites a radio interview Northam did with the station WTOP, after a Jan. 29, 2019, committee hearing on proposed legislation that would loosen restrictions on late-term abortions. The bill was introduced by Kathy Tran, a Democatic delegate to the state House, and during the hearing she fielded questions from Todd Gilbert, a Republican delegate.", "\"How late in the third trimester could a physician perform an abortion if he indicated it would impair the mental health of the woman?\" Gilbert asked.", "\"Through the third trimester,\" Tran said. \"The third trimester goes all the way up to 40 weeks.\"", "\"Where it’s obvious that the woman is about to give birth, would that still be a point at which she could request an abortion if she was so certified? She’s dilating,\" he said.", "\"My bill would allow that,\" Tran said.", "The next day, Northam appeared on the radio show. Reporter Julie Carey asked him this question:", "\"There was a very contentious committee hearing yesterday, when Fairfax County delegate Kathy Tran made her case for lifting restrictions on third-trimester abortions as well as other restrictions now in place, and she was pressed by a Republican delegate about whether her bill would permit an abortion even as a woman is essentially dilating, ready to give birth, and she answered that it would permit an abortion at that stage of labor. Do you support her measure? And explain her answer.\"", "Northam said he couldn’t speak for Tran but that the situation illustrates why such decisions should be made by physicians and parents.", "\"When we talk about third-trimester abortions, these are done with the consent of obviously the mother, with the consent of the physician — more than one physician, by the way — and it’s done in cases where there are severe deformities, there may be a fetus that is nonviable,\" he said.", "\"So in this particular example, if a mother’s in labor, I can tell you exactly what would happen. The infant would be delivered, the infant would be kept comfortable, the infant would be resuscitated if that’s what the mother and family desired, and then a discussion would ensue between the physicians and the mother,\" he said. \"So I think this was really blown out of proportion but again, we want the government not to be involved in these types of decisions. We want the decisions to be made by the mothers and the providers, and this is why legislators … most of whom are men, shouldn’t be telling a woman what she should and shouldn’t be doing with her body.\"", "Virginia law already allowed abortions after the second trimester but required three doctors to certify that the mother would die or her mental and physical health would be \"substantially and irremediably\" impaired without the procedure.", "Tran’s bill, which died in committee, would have eliminated the requirement that two other physicians certify that a late-term abortion is necessary to prevent the mother’s death or harm or mental or physical health. It also eliminated the words \"substantially and irremediably\" from the law, among other changes.", "In the interview, Northam said he supported keeping the state’s requirement that multiple physicians certify the abortion is necessary because \"these decisions shouldn’t be taken lightly.\"", "The Democratic governor’s comments drew criticism from conservatives, including U.S. Sen. Marco Rubio, R-Fla.", "\"I never thought I would see the day America had government officials who openly support legal infanticide,\" he tweeted on Jan. 30.", "U.S. Sen. Ben Sasse, R-Neb., called Northam’s comments \"morally repugnant.\"", "\"In just a few years pro-abortion zealots went from ‘safe, legal, and rare’ to ‘keep newborns comfortable while the doctor debates infanticide,’\" Sasse said. \"I don’t care what party you’re from — if you can’t say that it’s wrong to leave babies to die after birth, get the hell out of public office.\"", "Tran later said she misspoke when she was asked whether her bill would let an abortion happen when the mother was in labor and about to give birth.", "\"I should have said, ‘Clearly, no, because infanticide is not allowed in Virginia, and what would have happened in that moment would be a live birth.’\" In Virginia, killing a newborn is a felony punishable by death.", "A Northam spokesperson told Vox that his comments were \"absolutely not\" a reference to infanticide. Rather, they \"focused on the tragic and extremely rare case in which a woman with a nonviable pregnancy or severe fetal abnormalities went into labor.\" He called the idea that he approved of killing infants \"disgusting,\" according to the Washington Post.", "Our ruling", "The Facebook post says it’s \"OK to kill babies once born\" in Virginia.", "Late-term abortions are allowed under the state’s laws through the third trimester if doctors certify the procedure is necessary for the mother’s health — the proposed law discussed by Northam would not have changed the time period during which an abortion is allowed.", "As we’ve previously reported, Northam’s comments were confusing and he didn’t clarify what he meant by saying \"resuscitated.\" But he was speaking in the context of pregnancies in which the fetus has severe deformities or is nonviable. The Facebook post overreaches by claiming it’s OK to kill newborns. In Virginia, that’s a felony.", "We rate this post False.", "Facebook post, Jan. 30, 2019", "National Review, Virginia governor defends letting infants die, Jan. 20, 2019", "WTOP, Va. Gov. Northam draws outrage from GOP for defending abortion bill, Jan. 31, 2019", "Marco Rubio tweet, Jan. 30, 2019", "HB 2491, filed Jan. 9, 2019", "Vox, The controversy around Virginia’s new abortion bill, explained, Feb. 1, 2019", "The Washington Post, Del. Kathy Tran was known for nursing her baby on the House floor. Now she’s getting death threats over abortion, Jan. 31, 2019", "PolitiFact, Trump falsely claims Northam said he’d let doctors ‘execute’ newborns, Feb. 20, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]