["About this rating", "Brock Turner was released from prison in early September 2016, reigniting public outrage over what many people maintained was his unjustly light sentence in a sexual assault case.", "On 17 September 2016, The Good Lord Above web site published an article reporting that a \"flash mob\" armed with dildos had found and severely beaten Turner in retribution after his release:", "Rapist Brock Turner was released from jail on Friday after serving just three months of a six month prison sentence for sexually assaulting an unconscious woman at Stanford University. He was instantly beaten to a bloody pulp by a flash mob of furious people.", "He left the facility shortly after 6am local time, with a pack of protesters waiting for him. He ignored questions from reporters and attempted to get from the jail entrance to the backseat of a waiting car.", "“I was waiting for him to come out to protest him,” said witness Robert Selvidge. “Then suddenly this flash mob of like 50 random people springs into action and starts beating the crap outta him with dildos. They must’ve organized it on the Internet or something. The police didn’t interfere or nothing, they sort of just moved out of the way and let it happen. it was like everyone was cool with it.”", "Rapist Brock Turner was pelted with dildos by the flash mob for around 5 minutes before police finally stepped in to disperse the crowd. The crowd left peacefully and no arrests were made.", "There was no truth to this story, nor to any item published by The Good Lord Above. The site's disclaimer states that its content is satirical in nature:", "Thou shalt remember that The First Amendment protects satire as a form of free speech and expression. TheGoodLordAbove uses invented names in all of its stories, except in cases where public figures are being satirized. Any other use of real names is accidental and coincidental. TheGoodLordAbove is not intended for readers under 18 years of age.", "Prior to the Brock Turner piece, items published by the outlet mistaken for real news included claims Jennifer Aniston scathingly attacked the media for covering the Brangelina breakup instead serious material, Ted Cruz blamed God for career failures, the Dalai Lama converted to atheism, a Noah's Ark theme park was ironically destroyed in a flood, and Bernie Sanders' heroic rescue of a dog from a burning building was ignored by the media.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]