["“Bombshell as flu shots found to cause huge increases in coronavirus infections,” says the headline of an article shared as a screenshot on July 31, 2020 on Facebook.", "“Children who are vaccinated with flu shots have a 440 percent increase in risk of contradicting other respiratory infections such as coronavirus, researchers found in a published paper,” claims the post, which also circulated on Instagram.", "Several posts claim the evidence came from “The British Medical Journal,” sharing this link. However, that is not a scientific study, but rather a response to an article about the COVID-19 pandemic from a retired pediatrician.", "BMJ executive editor Theodora Bloom explained in an email that “Rapid responses” are comments to the editors that appear on the journal’s website but “are not indexed in PubMed and they are not journal articles.”", "“Although we moderate Rapid Responses to ensure they are not libellous, for example, they are certainly not endorsed by the publication,” she said.", "Another version of the post reveals that the source of the claim is an article on the website NaturalNews, one of a network of internet domains found to host health disinformation which AFP has fact-checked in the past.", "NaturalNews was removed from Facebook in May 2020 “for spammy and abusive behavior, not the content they posted,” according to a Facebook spokeswoman. “They misled people about the popularity of their posts and relied on content farms in Macedonia and the Philippines.”", "Brian Ward, professor in the McGill University Department of Medicine, said in an email that the claim has been “cherry-picked from a very weak study.”", "It is based on a 2012 study titled: “Increased Risk of Noninfluenza Respiratory Virus Infections Associated With Receipt of Inactivated Influenza Vaccine.”", "The study was conducted from 2008-2009, a decade before the novel coronavirus pandemic, and only included 115 children during one flu season.", "It found that over nine months, the children in the group that received trivalent inactivated influenza vaccine “had an increased risk of virologically-confirmed non-influenza infections.”", "Ward explained that the study, though published in Clinical Infectious Diseases, has methodological flaws, including having 1.5 times more children in the flu vaccine group, compared to the placebo group.", "Sarah Gilbert, professor of vaccinology at the University of Oxford’s Nuffield Department of Medicine, also said in an email that it is important not to overstate the findings of a small study.", "Gilbert further explained: “It isn’t that the flu shot directly made children more susceptible to other viruses.”", "She said the children in the placebo group who were not vaccinated were more likely to get the flu and there seemed to be short-term protection from other viruses right after recovering from the flu.", "Based on this study, “no-one should make decisions to avoid flu vaccinations,” Gilbert said.", "Danuta Skowronski, the principal investigator at the British Columbia Center for Disease Control (BCCDC), published a study in May 2020 that included thousands of people over multiple flu seasons in Canada. It found the “influenza vaccine did not affect seasonal coronavirus risk.”", "Skowronski, who plays a critical role in Canada’s national influenza program, helped develop test negative design, a methodology used worldwide to monitor how well the influenza vaccine protects.", "Asked if there was any particular coronavirus risk to children who receive the flu shot, Skowronski said: “We saw no association in children nor in adults between the receipt of influenza vaccine and coronavirus risk.”", "Similarly, a 2013 study conducted in the US state of Wisconsin covering six flu seasons and including more than 3,000 patients found: “Influenza vaccination was not associated with detection of noninfluenza respiratory viruses.”", "Claims that a 2017 study also found the flu shot left people vulnerable to infections were also shown to be misleading by AFP Fact Check here.", "The US Advisory Committee on Immunization Practices has not yet voted on the flu vaccine recommendations for 2020-2021, but Lisa Black, a spokeswoman for the American Academy of Pediatrics (AAP), said in an email that AAP has not changed its guidance because of the pandemic and “recommends that everyone over 6 months is vaccinated for influenza.”", "The same is true of the Canadian Paediatric Society. Spokeswoman Genevieve Brouillette said in an email: “Our general guidance (that everyone over 6 months of age be immunized against the seasonal flu) won’t be changing.”", "The US Centers for Disease Control and Prevention has said that how and where people get a flu vaccine may need to change due to the COVID-19 pandemic.", "This was echoed by Oxford’s Gilbert: “People leaving their homes to receive flu shots should take care to protect themselves against exposure to coronavirus by following all the public health guidelines on social distancing, handwashing and wearing face coverings.”", "The flu shot is a regular target of disinformation. AFP Fact Check has debunked the false claim that the vaccine contains coronaviruses, the false claim that receiving a flu shot will make you test positive for COVID-19, and false ingredient lists for the annual immunization.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]