["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Foxconn chairman Terry Gou and Wisconsin Gov. Scott Walker have promised billions in investments and thousands in jobs. (Mike De Sisti/Milwaukee Journal Sentinel)", "When Republican Gov. Scott Walker said iPhone manufacturer Foxconn was bringing 13,000 jobs to Wisconsin, we drew the line on his exuberance at Half True.", "Even the Taiwanese company itself has said only there is potential for 13,000 jobs, and that its initial plans call for 3,000.", "But some Democrats, including state Rep. Melissa Sargent of Madison, have also been overly effusive in criticizing the up to $3 billion in incentives Walker wants to give Foxconn.", "Sargent, who made news in early 2017 for proposals to legalize marijuana and eliminate the state’s \"tampon tax,\" posted this tweet on Aug. 2, 2017 -- a week after Foxconn announced in the East Room at the White House that it had chosen Wisconsin for its first major American factory:", "3,000 jobs cost #WI taxpayers more than $3 billion in tax giveaways. Break it down: more than $1 million in taxpayer dollars per job. #foxconn", "She had already made the claim in her official newsletter.", "The idea that the state would pay incentives to Foxconn worth more than $1 million per job might sound absurd on its face.", "And as we’ll see, Sargent took down her tweet.", "But we are talking some colossal numbers here.", "Half-a-million dollars per job, anyone?", "No, it’s not $1 million per job", "Under the deal it made with the state, Foxconn agrees to invest $10 billion to construct a facility in Wisconsin and create up to 13,000 jobs. Wisconsin agrees to, among other things, provide up to $3 billion in incentives.", "Sargent’s staff told us her $1 million-per-job claim was based on a column posted on the Bloomberg Businessweek website that was written by Tim Culpan. Culpan is a Taiwan-based technology columnist for Bloomberg Gadfly, a commentary site. He wrote that Wisconsin \"is paying as much as $1 million per job.\"", "Culpan’s $1 million claim was widely circulated -- by state Superintendent of Schools Tony Evers, who is weighing a run for governor in 2018; state Senate Minority Leader Jennifer Shilling, D-La Crosse; and a host of national media, including Vanity Fair, a Washington Post columnist, The Atlantic and others.", "If you take $3 billion in incentives -- the amount cited in Sargent’s tweet -- and divide it by 3,000 jobs, you get $1 million per job.", "But the $3 billion is the maximum -- to be paid only if Foxconn meets several requirements, including creating 13,000 jobs.", "If fewer jobs are created, the incentives paid are less.", "So, what is the cost per job?", "What the per-job cost might be", "The $3 billion -- up to $200 million per year for 15 years -- would amount to nearly 50 times the previous record paid by Wisconsin taxpayers, when the state in 2010 offered $65 million in subsidies to keep Mercury Marine from moving a factory from Fond du Lac to Oklahoma.", "The nonpartisan state Legislative Fiscal Bureau estimates it would take 25 years for taxpayers to recover the bulk of that -- the $2.85 billion the state would be paying Foxconn in cash. (The other $150 million would be provided through a sales tax exemption.)", "As for the per-job cost, we turned to an analysis by the Wisconsin Budget Project. The project is part of Kids Forward, formerly known as the Wisconsin Council on Children and Families, a left-leaning nonprofit.", "The $2.85 billion in cash payments, according to the analysis, would amount to $219,000 per job if 13,000 jobs are created and $587,000 per job if 3,000 jobs are created.", "An important note: As the analysis and Culpan noted, and as economist Timothy Bartik of the Upjohn Institute for Employment Research told us, the more Foxconn gears its plant for robotics, the fewer jobs it will create -- and thus the per-job cost of the incentives will be higher.", "Asked about Sargent’s taking down her tweet, one of her staff members told us the Bloomberg column \"was early,\" and that as more details of the incentive package were released, \"it became clear that estimates were more nuanced, and Melissa removed the tweet to prevent any confusion or misinformation.\"", "The news reporting, however, had been clear: up to $3 billion in incentives only if 13,000 jobs were created, not 3,000.", "The staffer, citing the Wisconsin Budget Project analysis, also told us there will be costs to taxpayers beyond the $3 billion, such as local government spending on infrastructure improvements and state borrowing for Interstate 94 improvements.", "But Sargent’s tweet referred only to the $3 billion in incentives, not those other potential costs.", "Our rating", "In a tweet she later took down, Sargent said that on the Foxconn deal, \"3,000 jobs cost #WI taxpayers more than $3 billion in tax giveaways. Break it down: more than $1 million in taxpayer dollars per job.\"", "The per-job cost could never reach $1 million if only 3,000 jobs are created; the full $3 billion would be paid only if 13,000 jobs are created.", "An analysis projects the per-job cost at $219,000 per job if 13,000 jobs are created and $587,000 per job if 3,000 jobs are created.", "We rate Sargent’s statement False.", "Twitter, Melissa Sargent tweet, Aug. 2, 2017", "Email, Melissa Sargent staff member Britt Cudaback, Aug. 8, 2017", "Melissa Sargent, newsletter, Aug. 1, 2017", "Wisconsin Budget Project, \"Different Assumptions about Foxconn Job Creation\nYield Much Higher Estimates of the Cost of Jobs,\" Aug. 3, 2017", "Email, Wisconsin Budget Project director Jon Peacock, Aug. 8, 2017", "Milwaukee Journal Sentinel, \"Foxconn announces $10 billion investment in Wisconsin and up to 13,000 jobs,\" July 27, 2017", "Milwaukee Journal Sentinel, \"Foxconn could get up to $200 million in cash a year from state residents for up to 15 years,\" July 28, 2017", "Interview, Upjohn Institute for Employment Research senior economist Timothy Bartik, Aug. 9, 2017", "Wisconsin Legislative Fiscal Bureau, Foxconn memo, Aug. 8, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]