["By Chloe Wilson", "Posted on October 4, 2018", "Q: Is actor Matt Damon “moving his family to Australia because of Trump”?", "A: No. Damon’s publicist denied that rumor months ago.", "Back in March, a rumor circulated that Matt Damon was moving to Australia, allegedly to escape the politics and policies of President Donald Trump. Damon’s supposed relocation was reported by the New York Post’s “Page Six” celebrity gossip column, which cited an unnamed “top Hollywood source.”", "But Jennifer Allen, Damon’s publicist, categorically denied that her client was “headed Down Under,” as the Post declared in a photo caption, or that he was purchasing property to be near fellow actor Chris Hemsworth in Byron Bay, New South Wales, as Australia’s Daily Telegraph reported based on speculation.", "“Matt has visited Australia several times recently, but he has not bought a house there nor is he moving there,” Allen wrote in an email to the Boston Globe for a March 15 article.", "Last month, the false story about the actor was recirculated on Facebook as a meme stating, “Matt Damon is moving his family to Australia because of Trump.” As of Oct. 4, that meme has been shared more than 5,600 times since it was posted Sept. 8.", "Damon supported Hillary Clinton for president in 2016 and he has been critical of Trump. He’s just not moving out of the country because of him.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on the social media network.", "Smith, Emily, and Mohr, Chris. “Is Matt Damon taking family to Australia because of Trump?” New York Post. 15 Mar 2018.", "Hansen, Jane. “Matt moves in: Welcome to my neighbourhood.” Daily Telegraph (Australia). 4 Mar 2018.", "Shanahan, Mark. “Is Matt Damon moving to Australia to escape Donald Trump?” Boston Globe. 17 Mar 2018", "“Spokeswoman: Damon not fleeing to Australia in Trump huff.” Associated Press. 17 Mar 2018.", "Hallemann, Caroline. “Why Matt Damon is Supporting Hillary Clinton.” Town & Country. 11 May 2016.", "Rothman, et al. “Matt Damon on Donald Trump Possibly Being President: ‘It Makes Me Nervous.'” ABC News. 28 Jul 2016.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]