["About this rating", "On 7 April 2017 the perennially dubious website World News Daily Report published what it called an account of a teacher stapling her student's lips shut for \"disrespecting\" her. The story is accompanied by a photograph of an unidentified woman, an image that has been disseminated online since 2012 in \"ugly mugshot\" galleries, matching the story's theme:", "According to witnesses at the Central High School, Dorothy Fransen was furious after one of her students, 17-year old Jeremy Dunlop, kept interrupting her class and making jokes about her physical appearance.", "She reportedly tackled the young man and held him on the ground while stapling his lips more than 45 times.", "There is a Central High School in Springfield, Missouri, where this story is set. But the only records for either \"Fransen\" or \"Dunlop\" are World News Daily Report and similarly suspect sites that have reproduced its story verbatim.", "Unlike those, however, World News Daily Report contains a disclaimer revealing its fictional nature:", "World News Daily Report assumes all responsibility for the satirical nature of its articles and for the fictional nature of their content. All characters appearing in the articles in this website – even those based on real people – are entirely fictional and any resemblance between them and any person, living, dead or undead, is purely a miracle.", "In 2012, Michigan State University student Zachary Tennen made a similar claim, saying that his own lips were stapled together at an off-campus party in an anti-Semitic attack against him.", "However, investigators later learned that while Tennen was punched in the mouth, there was \"no merit\" to his allegation that he was the victim of a hate crime; instead, multiple witnesses said that he had \"harassed and inappropriately touched women at the party,\" bringing about the hostile reaction.", "Curry, Colleen.   \"Michigan Student Says Lips Were Stapled Shut Because He Was Jewish.\"    ABC News.   28 August 2012.", "Howell, Brandon.   \"Jewish Michigan State Student Won't Be Charged For False Claims in Alleged Hate Crime Case.\"\r\n  Mlive.com.   27 September 2012.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]