["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "During debate over legislation that cuts about $1.5 billion in spending from the state’s current budget, state Rep. Sylvester Turner spoke in favor of an amendment that would have redirected $6.2 million from programs under the purview of Gov. Rick Perry to the Texas Higher Education Coordinating Board, which administers state-funded student financial aid programs.", "On the House floor March 31, Turner, a Houston Democrat, said that after expected reductions in funding for higher education, \"students in the state of Texas will need more financial aid than ever before because their tuition will go up. … Why are we more interested in protecting the governor’s agency than in providing financial aid to our students?\"", "Republican Rep. Jimmie Don Aycock of Killeen, an opponent of the amendment, responded by defending the programs handled by the governor’s office and indicating that tuition hikes are not a done deal: \"Some of the colleges, including A&M, have already guaranteed that they will not increase their tuition.\"", "The amendment failed, but we still wondered whether Texas A&M University and other colleges have really decided to freeze their tuition, as Perry urged in his February State of the State address.", "On Feb. 9, the day after Perry’s speech, the Fort Worth Star-Telegram reported that \"at least one public university system had already decided to freeze tuition.\" Texas A&M’s board of regents \"last year voted to freeze tuition rates for the 2011-12 academic year at 11 universities,\" according to the news article.", "Texas A&M spokesman Jason Cook confirmed that the university system had frozen \"designated\" tuition — what public universities charge students on top of state-set tuition — but he said A&M’s flagship university in College Station is proposing to raise additional tuition for three of its colleges: architecture, engineering and veterinary medicine.", "Cook told us the proposed hike only applies to certain undergraduates — about 1,415 architecture students, 7,880 engineering students and 510 students in a veterinary medicine program. Total enrollment last fall on the College Station campus was 49,426, so about 20 percent of students would pay the higher charges.", "A&M President Bowen Loftin will take the proposal to the university’s board of regents in May, Cook said — a year from when the board decided not to raise university-wide tuition this fall.", "Tuition won’t go up at the other universities in the A&M system, Cook said, but fees may go up. According to the an overview of tuition by the coordinating board, mandatory fees, such as library and laboratory fees, are charged to all students upon enrollment. Texas A&M University at College Station is proposing \"a small increase in three mandatory fees,\" he said.", "When he spoke on the House floor, Aycock said that A&M was among \"some of the colleges\" that have promised to freeze tuition. When we checked back with the lawmaker, he told us that he was only talking about institutions within the A&M system.", "Still, we think Texans who heard him could be left with the impression that some other public colleges in Texas had guaranteed tuition freezes.", "We looked for such pledges — unsuccessfully.", "Searching news articles, we discovered that the governing boards at three public higher education institutions had voted within the past two weeks to increase tuition and fees this fall at some campuses, including the University of North Texas in Denton, Del Mar community college in Corpus Christi and Midwestern State University in Wichita Falls. In each case, projected cuts to state funding were a factor in the board’s decision to implement the increases.", "Representatives of Texas Tech and the University of Houston also told us that fall tuition could be raised.", "What about the University of Texas system?", "The Austin American-Statesman reported in a March 3 story that the new chairman of the system’s board of regents, Gene Powell, has pledged to try to hold tuition at current levels or even lower. In Feb. 18 remarks to the board, Powell said: \"We are going to lower the cost (of a bachelor’s degree) if we can do it in any way.\"", "UT regents typically set tuition every two years. In March 2010, they voted to increase tuition and fee rates at most of the system’s institutions for both this school year and next.", "During that meeting, regents did not increase the 2011-12 cost of attending the system’s medical, dental and nursing health campuses but signaled that they would revisit the question the following year. And last month, they raised the tuition at those institutions.", "In a press release announcing the March 2010 vote, UT regents left the door open to consider an additional increase for this fall \"should available funding change.\" Because tuition recommendations originate at individual campuses, we checked with UT-Austin to see whether any increases for the fall are being considered. Robert Meckel, director of public affairs at the school, told us that \"there will be no proposal for a tuition increase\" for the next school year.", "We also asked Matt Flores, a spokesman for the UT System, whether any UT institutions had \"guaranteed\" that they wouldn’t raise tuition for the following school year, 2012-13.", "\"No,\" he said. \"That’s too speculative right now.\"", "So, where does that leave us?", "In his remarks on the House floor, Aycock said \"some colleges\" including Texas A&M have pledged not to increase tuition costs to students. That’s not quite what we found.", "It’s true that all but one of the A&M system’s campuses won’t be seeing tuition increases this fall. But 20 percent of students at the system’s flagship campus may have to pay higher tuition, and all A&M students could face mandatory fee increases. Outside the A&M family, we found no evidence of tuition freezes — instead we found impending tuition hikes.", "We rate Aycock’s statement Barely True.", "Editor's note: This statement was rated Barely True when it was published. On July 27, 2011, we changed the name for the rating to Mostly False.", "Texas House online, video/audio archives, March 31, 2011", "House Bill 4 relating to making supplemental appropriations and giving direction and adjustment authority regarding appropriations, filed March 8, 2011", "Texas Tribune, LiveBlog: House debates budget bills, March 31, 2011", "Fort Worth Star-Telegram, Perry urges public universities to freeze tuition, Feb. 9, 2011", "Texas A&M University, Tuition and fee schedule, academic year 2010-2011, accessed March 31, 2011", "Austin American-Statesman, Text of Perry’s state of the state speech, Feb. 8, 2011", "Interview with Jason Cook, vice president for marketing and communications, Texas A&M University, March 31, 2011", "Interview with Rep. Jimmie Don Aycock, April 1, 2011", "Fort Worth Star-Telegram, \"Tuition increase will help University of North Texas raise $6.3 million,\" March 21, 2011", "Interview with Kelley Reese, assistant vice president for university relations, communications and marketing, University of North Texas at Denton, March 31, 2011", "Corpus Christi Caller-Times, \"Del Mar approves tuition, fee hike,\" March 23, 2011", "Interview with Claudia Jackson, executive director of community and legislative relations, Del Mar College, March 31, 2011", "Wichita Falls Times Record News, \"Tuition increase keeps ‘promise’ \" March 29, 2011", "Midwestern State University, news release, \"MSU to resolve significant shortfall in state funding,\" March 26, 2011", "Interview with Chris Cook, director of communications, Texas Tech University, April 1, 2011", "Interview with Richard Bonnin, executive director of media relations, University of Houston, April 1, 2011", "Austin American-Statesman, \"New UT regents’ chairman setting glass-is-half-full tone,\" March 3, 2011", "Video of Gene Powell’s remarks to University of Texas System board of regents, Feb. 18, 2011", "Interview with Matt Flores, assistant director for public affairs, University of Texas System, March 31 and April 1, 2011", "University of Texas System, press release, \"Tuition and fee rates for UT System health institutions approved by regents,\" March 18, 2011", "University of Texas System, press release, \"2010-12 tuition and fee rates approved by UT System regents,\" March 3, 2010", "Interview with Robert Meckel, director of public affairs, University of Texas at Austin, March 31, 2011", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]