["By Robert Farley", "Posted on March 22, 2018", "President Donald Trump said nearly all of the land once controlled by ISIS in Syria and Iraq has been retaken and “it all took place since our election.” But even the State Department’s senior envoy to the anti-Islamic State coalition said in December that half of the ISIS caliphate was recaptured under Trump’s leadership.", "In remarks before the National Republican Congressional Committee on March 20, Trump said he would be campaigning against Democratic candidates who are “weak on terrorism, and weak on national defense.”", "Trump: And on terrorism, in Iraq and Syria, we’ve taken back almost 100 percent, in a very short period of time, of the land that they took. And it all took place since our election. We’ve taken back close to 100 percent.", "Trump is correct that coalition forces have recaptured nearly all of the territory once held by ISIS. The U.S-led coalition reported in January that 98 percent of the territory once held by ISIS had been reclaimed. But he is wrong to say “it all took place since our election.”", "In a briefing on Dec. 21, 2017, Brett McGurk, special presidential envoy for the global coalition to counter ISIS, said that about 98 percent of the land comprising the ISIS caliphate had been recovered by coalition forces.", "“And significantly, 50 percent of all the territory that ISIS has lost, they have lost in the last 11 months, since January,” McGurk said. “So 50 percent of all the territorial losses against ISIS have come in the last 11 months over the course of 2017.”", "According to analytics and consultancy firm IHS Markit, near its height in January 2015, the ISIS caliphate in Iraq and Syria covered about 35,000 square miles. By January 2016, that had been reduced to about 30,100 square miles. By the time Trump took office in January 2017, ISIS-controlled territory had shrunk to about 23,300 square miles.", "So clearly not all of the land was taken back under Trump, as he claimed.", "Trump often has taken the lion’s share of credit for gains made against ISIS. In  remarks before the Values Voter Summit on Oct. 13, 2017, for example, Trump said: “We’ve done more against ISIS in nine months than the previous administration has done during its whole administration — by far, by far.”", "It is true that the pace of land recovery from ISIS accelerated in 2017 under Trump. By June 2017, the caliphate had been reduced to about 14,000 square miles, IHS Markit reported. The caliphate’s de facto capital city of Raqqa in Syria was fully recaptured in October, and the following month, coalition forces retook the town of Rawa, the last populated town held by ISIS in Iraq.", "The recapture of Rawa prompted this tweet from McGurk:", "Iraqi forces with @coalition support announce the liberation of #Rawa in #Anbar province, among the last populated areas in #Iraq held by #ISIS terrorists. Days of its phony \"caliphate\" are coming to an end.", "— Brett McGurk (@brett_mcgurk) November 17, 2017", "During the press briefing in December, McGurk listed several initiatives by the Trump administration that he said accelerated the recapture of ISIS-controlled land. Among them, he said, was a decision to “[delegate] authorities immediately to Secretary Mattis and our commanders in the field” and to “deploy a small team of experts from the State Department into Syria to work with our military partners as we got into the campaign in Tabqa and Raqqa.”", "In an August 2017 interview with the Washington Post, McGurk also credited a “campaign of annihilation” in which forces surrounded cities held by ISIS militants prior to an assault to assure that no militant fighters could escape.", "Michael O’Hanlon, a senior fellow and director of foreign policy research at the Brookings Institution, told us back in August that Trump has “offered some new ideas,” but he said that Trump was overstating “the degree to which his own policies deserve primary credit for the shifts in Iraq and Syria.”", "The overarching policy to combat ISIS was begun under President Barack Obama, when on Oct. 17, 2014, the Department of Defense established Combined Joint Task Force – Operation Inherent Resolve, a coalition of more than 60 partners. According to O’Hanlon, “Many of the successes of the air campaign, the tightening on movements of ISIS money and people, occurred under Obama.”", "Recaptured land is only one measure for gauging the coalition effort. According to U.S. Air Forces Central Command data, as of the end of February, two-thirds of the sorties in which at least one weapon was released took place under Obama. And nearly 60 percent of the more than 100,000 missiles, bombs and other explosives released during the campaign came under Obama as well.", "Curiously, Trump starts the clock for the turnaround at the date of his election, rather than when he took office. He often has done that when making claims about jobs and stock market gains. In those cases, at least, an argument could be made that companies were reacting to the belief that once Trump took office, he’d enact business-friendly policies. It’s less clear why Trump would get any credit for coalition gains against ISIS in the months between his election and inauguration.", "Indeed, the offensive to recapture ISIS’ de facto capital city of Raqqa began in November 2016, under Obama, and by late December of that year, Voice of America was reporting that U.S.-backed Syrian Democratic Forces had made significant advances in the campaign. Ultimate victory there was not declared until October 2017, under Trump.", "It is fair to say that more land has been recaptured, and at a faster rate, under Trump. But it is simply inaccurate for Trump to claim, as he did, that “it all took place since our election.”", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]