["The claim was published here on Facebook on August 25, 2020. It was shared more than 23,000 times.", "The post's Malay-language caption translates to English as: “TIPS FOR HEADACHE", "“Don't have time to eat Panadol, if you can avoid it, avoid eating painkiller / Panadol", "“whenever you have a headache, not that these medications are not good, it can cure headaches but it may make us addicted, it means that when you're sick you have to take them, so it’s not good actually, we should try to control it.", "“Causes of headache :-\n\t1-Stress\n\t2-Eating late\n\t3-Lack of sleep", "“Medicine / treatment :-\n\t\"1-Cold water / water that has ice-wash the head / wash the hair\n\t\"2-drink warm water\n\t\"3-sleep for a while, only 30 minutes is enough\n\t\"Try first then know”.", "The post includes two images: the first shows a tab of pills with a pink cross drawn on it; the second shows a bottle of water with a green tick mark drawn over it.", "Panadol is a brand of paracetamol-based pain reliever produced by British multinational pharmaceutical company GlaxoSmithKline (GSK).", "An identical claim was also shared here, here and here on Facebook.", "The claim, however, is misleading, medical experts say.", "Dr Ahmad Firdaus Mohd Haris, one of the co-founders of Medical Mythbusters Malaysia, a Facebook page managed by medical professionals in Malaysia to debunk medical myths, told AFP that Panadol is safe to consume if taken in its correct dosage.", "“In general, Panadol and non-steroidal anti-inflammatory drugs (NSAIDs) are not addictive,\" he said in an email on August 28, 2020. “Unlike opiod based analgesic (painkillers), they do not have the same properties to induce addiction. Taken at the appropriate dose with healthcare worker guidance, these drugs are safe for consumption. The key here is ‘the dose makes the poison’. Taken without proper indication and incorrect or over dosage, it can be detrimental to health.”", "Muhammad Azmi Abdul Wahab, chief assistant director of the Pharmacy Policy & Strategic Planning Division from the Pharmaceutical Services Programme of the Ministry of Health Malaysia (KKM) said patients should take paracetamol according to the \"recommended daily dose\" and seek medical attention if their symptoms do not subside.", "“Paracetamol should not be taken with other products containing paracetamol as it often causes paracetamol overdose and toxicity,\" he said in an email to AFP on September 18, 2020. \"Most people tolerate well with paracetamol including pregnant women and breastfeeding mothers. However, some people may need to be extra careful with paracetamol. For example, people with allergic reaction to paracetamol, patients with liver or kidney problems and patients who are taking the blood thinning drug (warfarin).", "“Paracetamol should be taken according to the recommended daily dose. If the pain becomes unbearable and does not subside after taking paracetamol, patients should immediately seek medical attention so that the underlying cause of the pain can be treated.”", "On the FAQ section of Panadol's official Singapore website, it states: “Paracetamol does not cause dependency and is non-addictive. Panadol is suitable when used as directed. If symptoms persist, please consult your doctor or pharmacist.”", "Below is a screenshot of the Panadol Singapore webpage:", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]