["The photo was published here on Facebook on February 28, 2020. It has been shared more than 60 times.", "The post's Indonesian-language caption translates to English as: “The dajjal terrorist Narendra modi had excrement of his God for lunch.", "#SaveMuslimIndia\".", "Below is the screenshot of the misleading post:", "“Dajjal”, or the Deceiver, in Islamic eschatology, is a false messianic figure who is believed to come forth before the end of time.", "At least 50 people died during the deadly sectarian violence in Delhi triggered by the a citizenship law which critics claim discriminates against Muslims, as reported by AFP here.", "Some comments from Facebook users on the misleading post indicated they were misled by the photo.", "Comments included \"disgusting\" and \"Hope he is punshied by God\".", "Below is the screenshot of a comment in the misleading post:", "The same photo was published with a similar claim on Facebook here, here and here; as well as on Twitter here.", "The claim is false; the image has been doctored from an image of Modi eating a popular Indian dish during his visit to a festival in Delhi.", "A Google reverse image found the original photo was published here on February 19, 2020 on Modi’s official Twitter page. It was published alongside two other photos of him at the same event.", "Had tasty Litti Chokha for lunch along with a hot cup of tea... #HunarHaat pic.twitter.com/KGJSNJAyNu", "The photo’s caption reads: “Had tasty Litti Chokha for lunch along with a hot cup of tea… #HunarHaat”.", "“Litti chokha” is a popular dish from the Bihar-Jharkhand region in India which consists of baked dumplings and a mashed vegetable mix.", "“Hunar Haat” is a craft festival in New Delhi where artisans, craftsmen and culinary experts showcase their products.", "Below is a screenshot comparison between the photo in the misleading posts (L) and the photo on Modi's Twitter account (R):", "Indian daily Hindustan Times published a report about Modi’s visit to the festival here on February 19, 2020 headlined: “PM Modi visits artisans fair Hunar Haat in New Delhi, has ‘litti-chokha with kulhad chai’ for lunch”.", "A video on its YouTube channel here on February 20, 2020 shows Modi consuming litti chokha at the nine-second mark.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]