["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "This fake meme has been floating around Facebook.", "Is Facebook planning to ban all posts related to religion?", "A reader recently sent us links to an article shared on Facebook, titled, \"Facebook To Ban Religious Posts, Memes After Criticism From Atheism Groups,\" asking if we could verify its accuracy.", "The article was originally published several months ago on a website called the National Report; other versions have circulated as Facebook memes. Here’s a portion of the article:", "\"In a closed-door session with shareholders on Tuesday, Facebook executives wheeled out a set of new rules which, when implemented later this year, will ban their users from creating status updates and image posts related in any way to religion, while also vowing to disband groups and take down pages with religious goals or affiliations.\"", "The story goes on to claim that Facebook will implement the new rules in three phases by removing pages with religious themes; prohibiting the posting or sharing of religious images and memes; and implementing filters to weed out status updates that include words like \"Jesus,\" \"prayer,\" \"church,\" or \"God.\"", "This would be a pretty big deal if it were true, but there’s a problem: The National Report is a fake news site.", "The website, established in 2013, once included a disclaimer making that point clear.", "The disclaimer has since been removed, but was archived by urban-legend investigation site Snopes.com. It said, in part, \"All news articles contained within National Report are fiction, and presumably fake news. Any resemblance to the truth is purely coincidental.\"", "As for Facebook banning religion, similar bogus rumors have been floating around cyberspace for years. In March 2014, Snopes investigated a nearly identical claim. The message, allegedly issued by Facebook CEO Mark Zuckerberg, said that Facebook would be launching a \"No Religion\" campaign prohibiting the \"spreading (of) religious beliefs,\" and planned to delete the accounts of those who violated the new policy.", "Just to put the final nail in the coffin, we went looking and found many religiously affiliated pages on Facebook that have collected hundreds of thousands of \"likes.\" The Facebook page Jesus Daily, which claims to be the \"#1 most active Facebook Page in history where you can learn how to accept Jesus Christ as your Savior,\" has more than 26 million likes. Facebook pages for the Bible, Koran, and Torah have netted more than 40 million likes altogether. None have been deleted from Facebook.", "Our ruling", "A recent article claims that Facebook plans to institute a ban on all user-generated posts related to religion. However, the article comes from the National Report, a satirical website. It is not factual and was never intended to be. We rate the claim Pants on Fire.", "National Report, \"Facebook To Ban Religious Posts, Memes After Criticism From Atheism Groups,\" Jan. 2015.", "PolitiFact, \"Viral claims says IRS will be delaying tax refunds next year, but it’s fake news,\"  Oct. 16th, 2014.", "Snopes, \"Facebook ‘No Religion’ Campaign,\" March 7, 2014.", "Vision to America. \"Facebook to Soon Ban Religious Posts Because of Atheist Complaints,\" March 9th, 2015.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]