["About this rating", "It's not often that we run across sensational news stories that have potentially four misleading components all packed into one headline. However, on Dec. 12, 2020, the SheFinds.com website published just that: \"Amazon Just Announced A Major Game Changer In Time For Holiday Shopping--It's Too Good!\"", "Courtesy: SheFinds.com", "What grand announcement had Amazon made for the holidays that would change the face of online shopping? Would it be massive discounts? Was Amazon.com expanding its same-day delivery options? Perhaps it was giving out free holiday decorations?", "The story reported that Amazon tweeted reminder instructions for enabling shipment notifications for the Amazon Shopping mobile app.", "That's all.", "If you’ve been sitting by the window waiting for your Amazon package to arrive ever since you hit the “Buy now” button, it’s time to let the technology of 2020 do the work for you.", "Amazon just Tweeted out the friendly reminder that their Shipment Notifications in their Shopping App can help you keep track of your order progress. If you want to know when your order has arrived, head to your notification settings in the Amazon App to turn them on.", "The December 2nd Tweet showed shoppers exactly how to do that. Make sure Shipment Notifications are on by visiting Settings > Notifications > Shipping Notifications ON.", "In other words, the SheFinds.com headline was misleading and false. It claimed that Amazon had just made an announcement. In the body of the story, however, the word \"announcement\" became \"friendly reminder.\" Further, while the words \"major,\" \"game changer,\" and \"it's too good!\" are somewhat subjective, a tweet reminding customers how to turn on app notifications was anything but substantial.", "The only bright spot we found in the mix of misleading madness was the puppy featured in the Amazon video:", "We previously reported on three other stories from SheFinds.com. One mentioned that the Wendy's fast food restaurant chain had made a \"heartbreaking\" announcement. However, that was misleading. Another story claimed that Taco Bell was making \"MAJOR changes\" for the pandemic. The headline ended with the words: \"It's unreal!\" A third story falsely claimed \"huge changes\" were coming to McDonald's.", "Jordan Liles is a Senior Reporter who has been with Snopes since 2016.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]