["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Experts say the Federal Reserve is likely to be the largest source of funds for the $3 trillion.", "China is expected to buy little, if any, of the debt, because it does not have the money to lend.", "To finance its response to the coronavirus pandemic, will the United States borrow trillions of dollars from China?", "That’s the claim of Kentucky Republican Rand Paul, the first senator known to have been stricken by COVID-19.", "On May 4, the U.S. Treasury announced plans to borrow $3 trillion during the second quarter of 2020, largely to cover three packages approved by Congress and President Donald Trump that contain more than $2 trillion worth of stimulus in response to the coronavirus outbreak. The third and largest package included one-time $1,200 payments to many Americans, temporary $600-per-week bonuses on unemployment checks, and loans and grants to small businesses.", "Two days after the Treasury announcement, Paul was asked on Fox News' \"America's Newsroom\" whether there will be a fourth stimulus.", "\"To people who ask me, I remind them that we have no money. We have no rainy day account, we have no savings account,\" he said. \"The $3 trillion that we've already passed out is imaginary money. It's being borrowed basically from China. So the irony is we got the virus from China, and now we're going to be more dependent by borrowing more money from China.\"", "China, where the COVID-19 outbreak was first detected in December, is the second-largest foreign holder of U.S. debt. But experts told us there is no reason to believe it will be a large purchaser of the $3 trillion.", "To finance the government’s activities, the Treasury issues securities to various U.S. buyers (such as the Federal Reserve System, mutual funds, financial institutions and individual investors), to private investors overseas, and to the central banks of other countries, notably Japan and China. Because Congress suspended the \"debt ceiling\" for two years in 2019, the government can go into as much debt as it wishes, as long as there are takers for Treasury securities.", "The total federal debt eclipsed $25 trillion on May 4, two days before Paul made his statement.", "Of that $25 trillion, about $6 trillion is \"intragovernmental holdings\" — debt held by, for example, government trust funds, including the one that endows Social Security. The other $19 trillion is called public debt, which refers to all federal securities held by institutions and individuals outside the U.S. government, including individuals, corporations and foreign governments.", "China buys U.S. Treasury bonds in public auctions, the same way other nations and investment companies do.", "The latest Treasury Department figures, as of April 15, show that Japan, along with Japanese companies and investment groups, was the largest foreign holder of U.S. debt, at $1.27 trillion. China was second, with $1.09 trillion.", "Asked for information to support Paul’s statement, a spokesman for the senator cited the amount of U.S. debt held by China and said foreign holdings account for about 39% of public debt. Asked to elaborate, he didn’t reply.", "Several experts told us that those figures do not support Paul’s claim and that there is no other evidence to back it, either.", "Most of the debt incurred so far to deal with the coronavirus has been purchased by the Federal Reserve, not foreign or domestic savers, said Joshua Gordon, senior policy adviser at the Concord Coalition, a group that advocates for fiscal responsibility.", "David Dollar, a senior fellow in the China Center at the Brookings Institution and a former U.S. Treasury emissary to China, told PolitiFact that China lacks funds and \"there is no reason to expect\" China’s holdings of U.S. debt to increase in 2020. \"In theory it could borrow dollars on the international market in order to buy Treasurys, but this does not make any sense, as it would pay more in interest on its borrowing than it earns on the Treasurys, which is basically zero these days,\" he said.", "China has been reducing its U.S. debt holdings in recent years as a result of having less foreign currency, said economist Derek Scissors, resident scholar specializing in China with the American Enterprise Institute.", "\"We won’t be borrowing from China this year because China doesn’t have the money to lend us,\" he said. \"There probably isn’t enough global liquidity for most of the money to come from overseas. The largest portion is likely to come from U.S. institutions, which have few diversification options given economic contraction, and thus ultimately from American savers. The Fed itself may become the prime buyer.\"", "Mark Cabana, head of U.S. rates strategy at Bank of America Merrill Lynch, told Newsweek the Fed is set to be the biggest source of Treasury demand this year \"and we think by a long shot.\" China and other emerging market governments are selling their Treasury holdings to create dollars they can use to buy their own currencies, which are weak, he said.", "Barry Bosworth, a senior fellow in economic studies at Brookings, told PolitiFact \"there is no factual basis\" for Paul’s claim, \"since holdings of individual countries are only reported with a long lag. Most recently, new Treasury debt has been purchased by the Federal Reserve, and I expect that to continue.\"", "\"The Treasury issues securities in an open, very active market where investors, including other governments, are free to buy and sell as they wish,\" Bosworth added. \"We don’t know or care who are net purchasers. If investors are willing to buy U.S. securities at a time of chaos, it is good news.\"", "Paul said $3 trillion for federal coronavirus stimulus packages is \"being borrowed basically from China.\"", "Experts say that the Federal Reserve is likely to be a major source of funds for the $3 trillion and that China, with relatively little available funds, is expected to buy little if any of the debt.", "We rate Paul’s statement False.", "Fox News, \"America’s Newsroom\" interview (2:45) with Sen. Rand Paul, May 6, 2020", "Email, U.S. Sen. Rand Paul spokesman Sergio Gor, May 7, 2020", "Poynter, \"Where does the government get $2 trillion for a coronavirus bailout?,\" March 25, 2020", "Newsweek, \"China, Until Recently America's Largest Creditor, Won't Be Funding Your Stimulus Check,\" April 22, 2020", "CNBC, \"US Treasury seeks to borrow a record $3 trillion this quarter,\" May 4, 2020", "Congressional Budget Office, \"Federal Debt: A Primer,\" March 2020", "U.S. Treasury Department, news release, May 4, 2020", "Washington Post, \"Treasury plans to borrow $3 trillion from April through June as enormous coronavirus costs pile up,\" May 4, 2020", "PolitiFact, \"Randy Forbes says the U.S. pays China $73.9 million per day in debt interest,\" April 26, 2011", "Congressional Research Service, \"Foreign Holdings of Federal Debt,\" July 26, 2019", "Email, economist Derek Scissors, resident scholar specializing in China with the American Enterprise Institute, May 8, 2020", "Email, Kara Alaimo, Hofstra University journalism, media studies and public relations professor and former U.S. Treasury spokeswoman, May 8, 2020", "Email, David Dollar, a senior fellow in the John L. Thornton China Center at Brookings Institution and former U.S. Treasury economic and financial emissary to China, May 12, 2020", "Department of the Treasury, debt to the penny, accessed May 8, 2020", "Department of the Treasury, major foreign holders of Treasury securities, April 15, 2020", "Email, Barry Bosworth, senior fellow in economic studies at the Brookings Institution, May 11, 2020", "Email, Joshua Gordon, senior policy advisor at the Concord Coalition, May 13, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]