["This fake Nancy Pelosi quotation came from a satire website.", "It’d probably be big news if House Minority Leader Nancy Pelosi, D-Calif., publicly stated that she favors extending emergency room wait times.", "And many Facebook posts seem to suggest she does. They claim Pelosi wrote in defense of criticism to President Barack Obama’s health care reform law, \"Waiting long hours in the emergency room will allow you to make new friends!\" Some Affordable Care Act critics have predicted that Obamacare will cause emergency room wait times to go up.", "PolitiFact wanted to put this claim to rest after a skeptical reader wrote in asking us whether Pelosi actually said this.", "Our own searches for news clips came up empty. A spokesman from Pelosi’s office told us she didn’t say it.", "Sure enough, we traced the Pelosi quote in question back to a satire website. Duh Progressive likens itself to a right-leaning version of The Onion. Most of the site’s articles are politically charged takes on the news.", "Their article, which purports to be written by Pelosi herself, is meant to poke fun at the way Democrats defend the Affordable Care Act from critics. The fake first-person narrative reads:", "\"Naysayers claim the ACA will turn our nation’s emergency rooms into those similar to Europe’s, where people can sit all day in understaffed hospitals as they wait to get their feverish illnesses addressed, or their broken limbs fixed, their convulsions stopped, that knife removed from their skulls, or their fingers reattached.", "I doubt such dire fears will ever come true here.   But for argument’s sake let us presume I am wrong (which I never am) and that '’Obamacare'’ will force Americans to wait in emergency rooms longer than they already do.  In that case, has it ever occurred to people the great new friends that can be made while waiting for hours in abject misery alongside others also in abject pain and misery?\"", "Pelosi, like most of her party, consistently supports Obamacare. And hey, she may also support making new friends. But there’s no evidence to suggest that she twisted potentially longer emergency room wait times into a good thing.", "Our ruling", "Facebook posts quoted Pelosi as saying, \"Waiting long hours in the emergency room will allow you to make new friends!\" We quickly traced back the claims to a satirical article. Pelosi never actually said this, or anything remotely similar. This claim is ridiculous and off-base, so we rated it Pants on Fire.", "Duh Progressive, \"Nancy Pelosi: 'Waiting long hours in the emergency room will allow you to make new friends,\" Jan. 16, 2014", "Facebook posts, January 2014", "Huffington Post, \"Obamacare could cause longer wait times at ERs, doctors say,\" Jan. 16, 2014", "Phone interview with Drew Hammill, Nancy Pelosi’s spokesman, Feb. 25, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]