["President Donald Trump touted the United States’ environmental health during a speech in coal country.", "\"I want clean air. I want crystal clean water. And we’ve got it. We’ve got the cleanest country in the planet right now,\" Trump said in an Aug. 21 rally in Charleston, W.Va. \"There’s nobody cleaner than us, and it’s getting better and better.\"", "Does the United States dominate when it comes to water and air quality? Let’s take a look.", "The Environmental Performance Index is the go-to source for questions on environmental quality. Yale and Columbia University researchers teamed up with the World Economic Forum in 2018 to compile the data.", "Using 10 categories, they ranked the United States 27th. On air it ranks 10th and on water, 29th. Among wealthy democracies, the United States ranks toward the bottom, according to Zachary Wendling, principal investigator at the Environmental Performance Index.", "Switzerland ranked first on the overall index, Barbados ranked first on air quality, and eight European countries tied for first on water. European countries, Canada, Australia, New Zealand, Taiwan and Japan tend to top the United States in environmental performance.", "Clean air", "The air quality ranking is broken up into three parts. On indoor air quality, the United States ranks first. We don’t cook by burning biomass, so that isn’t surprising, Jeffrey Geddes, a Boston University professor who studies air quality, told us.", "The United States ranks 88th on exposure to particulate matter, which Geddes called \"a really good indicator for health effects from air pollution.\"", "The scientists used satellites and ground-based measurements to collect the data for 228 countries and territories dating from 2008 to 2015. That predates Trump. In general, however, changes between 2018 scores and the baseline (roughly 10 years earlier) are mixed and small, Wendling said.", "The Environmental Protection Agency’s own research shows a continued decline in air pollutants from 1990. But experts said Trump’s deregulatory practices may have the opposite effect.", "\"Deregulation of automobile emissions standards will increase air pollution, particularly in dense urban areas,\" said Elizabeth Albright, an environmental science professor at Duke University.", "The United States ranks 29th overall in water quality. In drinking water, it ranks first (alongside nine other countries) and in sanitation, 31st.", "\"For both drinking water and sanitation, the United States is performing okay in absolute terms, with about 3.3 disability-adjusted life-years lost per 100,000 people from risks due to unsafe drinking water, as compared to 6.4 for unsafe sanitation,\" Wendling said.", "Wendling said the lower sanitation ranking might be explained by rural populations that rely on septic tanks, but there is enough uncertainty in the data that estimates for high-income countries should be treated with caution.", "Experts said the United States still had a long ways to go before being ranked cleanest.", "\"Any idea we have the freshest water is entirely laughable,\" said Ashok Gadgil, an environmental engineering professor at Berkeley University.", "\"The U.S. does a very good job of producing relatively clean drinking water at very low cost, but we fall far short on our investments in water infrastructure investments—that was the case in Flint, and it also is the case in thousands of other water systems around the country,\" said Marc Edwards, a Virginia Tech environmental and water resources engineer. \"Some people could argue it is clean enough for the price, but we are not the cleanest.\"", "In 2016, 5,363 water systems serving 17.6 million people violated EPA's lead and copper rule, according to the Natural Resources Defense Council, an environmentalist non-profit group.", "The White House did not respond our request for comment.", "Trump said, \"I want clean air. I want crystal clean water. And we’ve got it. We’ve got the cleanest country in the planet right now.\"", "No ranking places the United States at the top of their list for cleanliness.", "The United States has ample room to improve on air quality when it comes to other developed democracies. While some cities’ water systems violate domestic environmental standards, the United States overall ties for best when it comes to drinking water.", "We rate this statement Mostly False.", "Environmental Performance Index, United States of America, 2018", "Environmental Protection Agency, Annual air trends, 2018", "NRDC, What's in your water? Flint and beyond, 2016", "Phone interview with Ashok Gadgil, environmental engineering professor at Berkeley University, Aug. 22, 2018", "Email interview with Mark Drajem, spokesman for NRDC, Aug. 22, 2018", "Email interview with Daniel Esty, director of the Yale Center for Environmental Law and Policy, Aug. 22, 2018", "Email interview with Zachary Wendling, principal investigator at the Environmental Performance Index, Aug. 22, 2018", "Email interview with Jason west, professor of environmental sciences and engineering at the University of North Carolina, Aug. 22, 2018", "Email interview with Marc Edwards, Virginia Tech environmental and water resources engineer, Aug. 22, 2018", "Email interview with Elizabeth Albright, an environmental science professor at Duke University, Aug. 22, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]