["By Angelo Fichera", "Posted on July 23, 2020", "The Committee to Defend the President has been running a six-second Facebook ad targeting older voters in North Carolina that takes former Vice President Joe Biden’s words out of context to brand him as a KKK sympathizer who twice used the “N-word.”", "The Committee to Defend the President is a political group supporting President Donald Trump. It has also produced two longer versions that contain more claims — including that Biden “partnered with segregationists.” As a senator, Biden did work with lawmakers who were segregationists, including on measures in the 1970s that opposed busing as a method to integrate schools.", "Biden’s comments last year about working with segregationists being a sign of “civility” became a point of contention with competitors in the Democratic primary.", "The committee has been promoting the ads to Facebook users in the swing state of North Carolina, according to Facebook advertising data. The state, which has the 10th highest number of electoral votes, voted for Obama in 2008, then for Republican Mitt Romney in 2012 and Trump in 2016. Polls show that Biden is slightly ahead of Trump in the state.", "Most of the group’s Facebook spending on the series of ads has been put behind the six-second ad, which began running July 15. As of July 22, the group was estimated to have paid at least $7,700 to run the ad on the platform, primarily targeting users 55 and older; it had accrued more than 400,000 impressions. The group also has spent about $66,000 airing a 30-second version of the ad in North Carolina in the Raleigh-Durham market, according to Advertising Analytics.", "While the ad’s voiceover says that Biden “praised KKK members” — plural — on-screen text specifically says that Biden “praised KKK member Robert Byrd,” citing a July 3, 2010, story from the BBC about a memorial service for the late Sen. Robert Byrd of West Virginia.", "When we asked the committee for evidence for each of its claims, it noted only Biden’s remarks about Byrd.", "The BBC article recounted how Biden, who was vice president at the time, and others — including Obama — spoke at the service. Biden said that Byrd, a Democrat who was the longest-serving senator in history when he died, was “a friend, and he was a mentor and he was a guide.”", "It’s true that Byrd was once a KKK member — he organized and led a local chapter in West Virginia and was involved with the group throughout the 1940s.", "However, Byrd then went on to a long career in politics during which he repeatedly apologized and said he regretted his ties to the group.", "In a memoir he published in 2005, Byrd wrote of his affiliation with the group: “It has emerged throughout my life to haunt and embarrass me and has taught me in a very graphic way what one major mistake can do to one’s life, career, and reputation.”", "Byrd also told the Washington Post: “I know now I was wrong. Intolerance had no place in America. I apologized a thousand times … and I don’t mind apologizing over and over again. I can’t erase what happened.”", "When Byrd died, Biden was far from the only one to “praise” him.", "The NAACP’s then-president said in a statement, which acknowledged the senator’s former KKK ties, that “Senator Byrd reflects the transformative power of this nation.”", "McConnell, the Republican Senate leader, also spoke at Byrd’s memorial service — and other Republicans issued statements remembering Byrd. Texas Sen. John Cornyn said that Byrd was “a tireless public servant” and that the “Senate has lost a great champion, he will be missed greatly.”", "That’s not to say Byrd’s checkered history is absolved in everyone’s eyes: The Committee to Defend the President pointed to the fact that a private college in West Virginia recently announced that it would remove Byrd’s name from its health center, citing “divisiveness and pain.”", "But the matter is more nuanced than simply saying that Biden “praised KKK members.” And there is no evidence that Biden praised any other members of the racist group, making the plural use of the word “members” inaccurate.", "To support its claim that Biden “repeated the N-word twice on camera,” the video’s text quotes Biden as saying, “We don’t need any more N***** bigshots.” It cites a C-SPAN video from 1985.", "That video is actually of a public hearing by the Senate Judiciary Committee and Biden’s words were not his own. Nor was he “repeating” the “N-word” in a manner to agree with or endorse it, as the ad implies.", "That hearing was on the nomination of William Reynolds, who was nominated by President Ronald Reagan to be associate attorney general. At the time, Biden was the ranking minority member on the committee.", "Reynolds was the assistant attorney general for civil rights, and Biden questioned Reynolds’ role in a Louisiana redistricting plan that had been struck down by the courts because it was biased against Blacks, as the Washington Post reported at the time. Reynolds had declined to challenge the state’s plan.", "Biden was reading from a court ruling — which cited a confidential memo written by Reynolds’ staff — to suggest Reynolds was aware of racial motivations behind the plan, and to question Reynolds’ commitment to voting rights.", "Early in the C-SPAN video (at the 1-minute mark) Biden says he planned to revisit the Louisiana case and tells Reynolds that “your critics suggest as you well know … that you are very insensitive to the concerns of minority persons.”", "Later, at 16:55 in the video, Biden quotes from the court order and memo, which relayed what “important … legislators” who had opposed an earlier plan (known as the “Nunez plan”) had said: “We already have a n***** mayor; we don’t need any more n***** big shots.'”", "“It seems to me that it’s awful clear that the court had no trouble finding, on a factual basis and outlining how it looked at this case, that there were clear, clear evidence of intent to discriminate against Black folks,” Biden went on to say (18:10).", "Reynolds’ nomination was ultimately unsuccessful.", "Chad Banghart, executive director of the Committee to Defend the President, sent us a link to a recent Breitbart story that found that Biden quoted the line from the memo other times during the hearings; the story questioned if even repeating the quote was acceptable.", "That doesn’t change that the committee’s ad fails to acknowledge that the words were not Biden’s own.", "Editor’s note: Swing State Watch is an occasional series about false and misleading political messages in key states that will help decide the 2020 presidential election.", "Editor’s note: FactCheck.org does not accept advertising. We rely on grants and individual donations from people like you. Please consider a donation. Credit card donations may be made through our “Donate” page. If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, 202 S. 36th St., Philadelphia, PA 19104.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]