["About this rating", "In June 2019, the Chicago investment firm Chicago BDT Capital Partners acquired a majority stake in the Texas-based restaurant chain Whataburger. The news was unsettling to some Texans who feared that their beloved burger joint would undergo some unwanted changes:", "Ok, I say we all chip in and buy Whataburger back. Make honey butter chicken biscuits available all day, add kolaches to the menu and change nothing else. Especially not the ketchup. https://t.co/HadutHXJ9l", "— JJ Watt (@JJWatt) June 14, 2019", "Shortly after this news broke, an image purportedly showing a screenshot of a message posted to Whataburger's Twitter account -- in which the restaurant chain announced that they were changing their colors from orange and white to blue, black, and white in honor of Chicago's baseball teams -- began to circulate on social media:", "This was not a genuine tweet from Whataburger: It does not appear anywhere on the company's Twitter timeline, and we were unable to locate any archived versions of this supposed message.", "Furthermore, the Whataburger Twitter account has responded to several curious social media users to inform them that the above-displayed image is fake. In other words, Whataburger is not changing their signature orange color to blue, black, and white in honor of the Chicago Cubs and Chicago White Sox:", "The social media post announcing that Whataburger was changing their colors was fake, but the following social media post from Whataburger assuring fans that they will continue to make Texas proud is real:", "Fernandez, Manny.   \"Whataburger Got Sold to Chicago. Texas Is Flipping Out.\"\r\n    The New York Times.   20 June 2019.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]