["About this rating", "A picture supposedly showing an unusual wood pattern beneath the bark of a burned tree is met with a wide range of reactions (and humorous comments) whenever it circulates on social media:", "This is a genuine photograph of wood burl, a growth in a tree that causes deformed grain, beneath the bark of a burned tree.", "While we have not been able to locate the exact source of this image, we have found images showing similar wood burl patterns, such as the following video from Hunski Hardwoods, an urban logging company:", "John Dittes, a trained botanist with 30 years experience in education and natural resource consulting, said that he first encountered the \"spaghetti tree\" image circa 2017. While he couldn't remember exactly where it came from, he said that he was 100% sure it was real and shared a similar example of this \"spaghetti\" burl pattern:", "Regarding the photo itself, I am confident (100%) that it is \"real\". [...] I've seen many, many examples of such patterns in burl wood.", "While burl is a tree deformity, it can come in some beautiful patterns that makes it valuable to wood workers. Here's Hunski Hardwoods description of burl on its website:", "A burl is a tree growth in which the grain has grown in a deformed manner. It is usually found on the trunk, at the base of the tree, and sometimes underground in the form of a rounded outgrowth. It is caused by some kind of stress, such as injury, virus, fungus, insect infestation or mold growth. Burl wood is the wood that is harvested from that growth, and it holds hidden treasures of unusual design.", "Burls result in a uniquely patterned wood, which is highly prized for its beauty. It is valued and sought after by artists, furniture makers and sculptors. Burl wood can be found in many tree species and is used in making furniture, different types of veneer, inlays, turning wood, gun stocks, music wood, and other household items.", "One reason this image may have drawn skepticism is that it is reminiscent of a famous April Fool's Day joke pulled by the BBC in 1957, when the respected news outlet put out a video report about an annual spaghetti harvest:", "While the recent tree picture may be reminiscent of the famous \"spaghetti tree hoax,\" the picture did not originate with the BBC. This is a genuine photograph of burl wood beneath the bark of a burned tree.", "BBC.   \"1957: BBC Fools the Nation.\"\r\n    Retrieved 10 January 2020.", "Hunski Hardwoods.   \"What is Burl Wood and How Does It Grow?\"\r\n    Retrieved 10 January 2020.", "Updated [25 January 2021]: Status changed from Unproven to True after learning more details about the origins of the image.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]