["By Robert Farley", "Posted on April 11, 2019", "Asked whether he believes federal law requires him to give Congress his tax returns, President Donald Trump responded, “There’s no law whatsoever.” He’s wrong about that.", "There is, in fact, a federal tax law that specifically states if the chairman of the House Ways and Means Committee makes a written request for an individual’s tax returns — as Rep. Richard Neal has done seeking Trump’s — the Treasury secretary “shall furnish” those returns. The law says those returns would be reviewed confidentially in an executive session.", "Some Republicans have argued that Neal needs to demonstrate a legitimate legislative purpose in order to review the president’s returns, and there is disagreement about whether he has. That is a debate that seems likely to end up in federal court.", "That legal dispute led a reporter to ask Trump on April 10, “Do you believe federal law requires you to give Congress your tax returns?”", "Trump responded, “No, there is no law. As you know, I got elected last time with this same issue. And while I’m under audit, I won’t do it. If I’m not under audit, I would do it. I had no problem with it. But while I’m under audit, I would not give my taxes. There’s no law whatsoever.”", "As we have written, there is no law that compels presidential candidates or presidents to publicly release their tax returns, though it has been a custom for them to do so for more than 30 years. Trump was the first major party presidential nominee not to release any tax returns, dating back to 1976, when President Gerald Ford released a summary of his tax returns, rather than the complete returns. Every major party nominee since then has released complete tax returns.", "But the reporter’s question wasn’t whether Trump was legally obligated to release his tax returns publicly, it was whether federal law required they be turned over to Congress.", "According to Joseph J. Thorndike, a historian at Tax Analysts, “Despite what the president said, there is a law.”", "In his April 3 letter to the IRS commissioner requesting Trump’s returns for the tax years 2013 through 2018, Neal cited the authority granted to him through an arcane provision in the IRS Code section 6103(f).", "IRS law generally requires that tax returns be kept confidential. But the section cited by Neal states, “Upon written request from the chairman of the Committee on Ways and Means of the House of Representatives, the chairman of the Committee on Finance of the Senate, or the chairman of the Joint Committee on Taxation, the Secretary shall furnish such committee with any return or return information specified in such request, except that any return or return information which can be associated with, or otherwise identify, directly or indirectly, a particular taxpayer shall be furnished to such committee only when sitting in closed executive session unless such taxpayer otherwise consents in writing to such disclosure.”", "“There is a law directly on point,” Edward Kleinbard, a professor at the University of Southern California Gould School of Law and chief of staff for Congress’ Joint Committee on Taxation from 2007 to 2009, told us via email.", "Some legal scholars, including Kleinbard, believe that Neal needs to demonstrate a legitimate legislative purpose for requesting the president’s returns. In his letter, Neal notes that the Ways and Means Committee is tasked with ensuring the IRS “is enforcing the laws in a fair and impartial manner.” Neal explains that he has requested the president’s returns to make sure the IRS is doing a good job in its mandated review of the president’s tax returns.", "Neal letter, April 3: Consistent with its authority, the Committee is considering legislative proposals and conducting oversight related to our Federal tax laws, including, but not limited to, the extent to which the IRS audits and enforces the Federal tax laws against a President. Under the Internal Revenue Manual, individual income tax returns of a President are subject to mandatory examination, but this practice is IRS policy and not codified in the Federal tax laws. It is necessary for the Committee to determine the scope of any such examination and whether it includes a review of underlying business activities required to be reported on the individual income tax return.", "Kleinbard believes that meets the threshold of proving a bona fide purpose for the request.", "“The Chairman’s request here was carefully written to explain his reasons, which include, wearing his oversight hat, ensuring that the IRS is doing its job auditing the President,” Kleinbard said. “Further, the President is the Taxpayer in Chief. We have a tax system in which we each assess tax against ourselves – that’s what you do when you file a return. The Taxpayer in Chief needs to set a standard of compliance to which we all should aspire. For him to abdicate that responsibility threatens the integrity of the income tax system, which surely is something that should concern W&M [the Ways and Means committee]. So there’s no doubt that W&M has more than met any standard that might be read into the statute.”", "In a phone interview, Thorndike agreed that Neal appears to have framed a legitimate request within the scope of his committee’s oversight responsibilities.", "The last time Congress looked into the IRS audit of a president’s returns was during the Richard Nixon administration. In that case, Nixon voluntarily provided his returns. A congressional committee concluded there were several items incorrectly reported on Nixon’s returns, finding he owed about $477,000 in additional taxes.", "“So there is good historical reason to be concerned” that the IRS is doing its job properly with review of presidential returns, Thorndike said.", "Thorndike said that while it seems Neal’s request is on solid legal footing, “it remains to be seen” how a court might rule.", "Treasury missed Neal’s deadline to produce the returns by April 10. In a letter sent to Neal that day, Treasury Secretary Steven Mnuchin said the request “raises serious issues concerning the constitutional scope of Congressional investigative authority, the legitimacy of the asserted legislative purpose, and the constitutional rights of American citizens.”", "“Given the seriousness of these issues, Mnuchin said Treasury has consulted with the Department of Justice “to ensure that our response is fully consistent with the law and the Constitution.”", "Mnuchin noted that Republican Sen. Chuck Grassley, who as chairman of the Senate Finance Committee has the same authority as Neal from IRS Code section 6103 (f), blasted Neal’s efforts as politically motivated. Grassley said the request was “a pretext to bring this president down.”", "The IRS statute states that if the returns were provided to Neal, they would be viewed confidentially in “closed executive session” of the Ways and Means Committee. But legal scholars said depending on what lawmakers find, it is possible the committee could conclude it has a constitutional responsibility to release the returns publicly.", "In a speech from the Senate floor, Grassley said the IRS is only required to turn over tax records under the law if the request is tied to “a legitimate legislative purpose in asking for them.”", "Although Neal said the aim is to make sure the IRS review of the president’s tax returns is being done fully, appropriately and impartially, Grassley contended, “There is no reason to believe the IRS is doing any less due diligence in its review of President Trump’s taxes than it has for any other president in our memory.”", "Jay Sekulow, an attorney for Trump, made similar arguments in an appearance on ABC’s “This Week” on April 7. Sekulow questioned what legitimate legislative purpose the request served.", "“This idea that you can use the IRS as a political weapon, which is what is happening here, is incorrect both as a matter of statutory law and constitutionally,” Sekulow said.", "As for Trump’s claim that “there is no law,” George K. Yin, a professor of law and taxation at the University of Virginia School of Law, who served as chief of staff of the Joint Committee on Taxation from 2003 to 2005, suspects Trump was referring to the custom — but not the law — that has been followed by presidents for the last four decades to release copies of their tax returns to the public.", "“I doubt that [Trump] has even heard of the law now being invoked by Chairman Neal,” Yin told us via email. “Since the question focused on giving Congress his returns, his answer is wrong but not egregiously wrong because of his likely confusion.”", "The IRS statute cited by Neal “contains no limits,” Yin said. “The chairman can request anyone’s returns and the Treasury Secretary is directed to furnish them.” Yin said there may be “an implicit condition” that Neal’s request have a “legitimate legislative purpose” such as oversight of the IRS. “But there is no specific precedent on this point because to my knowledge, the authority Mr. Neal is invoking has never been challenged,” Yin said.", "“Neal’s request stated two purposes that would qualify as legitimate legislative purposes,” Yin said, adding that Sekulow’s counterargument is that “the stated purposes are not the real purpose, and that the real purpose is simply to make a political attack.”", "Again, those are questions that would need to be settled in federal court. And that’s where the issue seems likely to be headed. “If it has to be litigated, it will be litigated,” Sekulow said on ABC’s “This Week.”", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]