["About this rating", "Most collections of unusual \"Are these real?\" type of images usually consist of either all genuine photographs or all digital manipulations.  This collection is unusual in that it's just about equally divided between the two categories:", "#1)", "#2)", "#3)", "#4)", "#5)", "#6)", "#7)", "#8)", "#9)", "#10)", "#11)", "Five of the eleven entries seen above are digital creations taken from various Photoshop contests hosted on the Worth1000 (now DesignCrowd) website, and six of the entries are genuine photographs of real structures from around the world.", "Here are the origins of each image, separated by \"Fabricated\" and \"Real\" classifications:", "Fabricated:\n\n #1 is an entry entitled \"Bond Mansion\" from Worth1000's \"Bizarrchitecture 3\" contest.", "#3 is an entry entitled \"Afrodite's Eye\" from Worth1000's \"Bizarrchitecture 4\" contest.", "#4 is an entry entitled \"You should see the front!\" from Worth1000's \"Bizarrchitecture 4\" contest.", "#5 is an entry entitled \"Kjerag Tower\" from Worth1000's \"Bizarrchitecture 4\" contest.", "#10 is an entry entitled \"Ice House\" from Worth1000's \"Bizarrchitecture 4\" contest.", "Real:\n\n #2 is the famous \"house between the rocks\" located in France, along La Côte de Granit Rose in Brittany near Plougrescant.", "#6 is an unusual treehouse restaurant located in Naha, Okinawa, Japan.  The eatery is not actually up a tree, but rather is perched in a concrete stand constructed to resemble a tree. Patrons access the restaurant through an elevator in the \"trunk.\"", "#9 is a very old mill (believed to date from the 16th century) that lies straddling two piers of an ancient bridge over the Seine River near Vernon, France.", "#11 is the Dar al-Hajar in Yemen, a rock palace built as summer residence for the Imam Yahya in the 1930s.", "#7 is the Thomas Point Shoal Lighthouse, a 19th century structure located in Chesapeake Bay, south of Annapolis, Maryland.", "#8 is the early 20th century lighthouse of Westerhever, located on the Eiderstedt Peninsula in Germany's Schleswig-Holstein region.", "Dallas Morning News.   \"Dine Underwater with the Fish in Maldives.\"\r\n    4 November 2005.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]