["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "People cheer and hold up signs during a town hall forum on Feb. 17, 2015 in Houston. (AP photo)", "Like many conservatives, U.S. Ron Johnson has repeatedly called for the United States to secure its borders.", "But in making that call again Oct. 7, 2015, the Wisconsin Republican also seemed to defend most of the estimated 11 million residents who are living in the country illegally.", "Johnson was interviewed on a conservative talk show on KTLK-AM in Minnesota's Twin Cities. The topic was a hearing he would lead the next day as chairman of the Senate Committee on Homeland Security and Governmental Affairs.", "Asked by a listener if it's possible to secure the border and \"negotiate\" undocumented immigrants, Johnson replied:", "\"Of course, that is the first step. We have to secure the border, we have to give the American public confidence that we're going to actually secure the border.", "\"And then, we're a compassionate nation. We're going to deal with that reality of 11 to 12 million people. By the way, in our hearings, (we were told) 8.1 million of those people in this country illegally are working, and most of them are working hard, contributing to their communities. This is an untenable situation, we need to bring those people out of the shadows, but first we need to secure the border.\"", "If Johnson’s statistical claim is accurate, two-thirds or more of undocumented immigrants are employed.", "But his description of the 8 million as workers overstates the situation a bit.", "The figures", "The U.S. Bureau of Labor Statistics does not attempt to count the number of unauthorized immigrants who are working.", "But we found estimates, based on census data, that were made by the the nonpartisan Pew Research Center. They are from a July 2015 report and a November 2014 report.", "As of 2014, there were 11.3 million unauthorized immigrants in the United States, Pew said, in an estimate roughly the same as one by the Department of Homeland Security.", "According to Pew: Most of them live in six states: California, Texas, Florida, New York, New Jersey and Illinois. Half are Mexican.", "Regarding work, Pew estimated that in 2012 there were 8.1 million unauthorized immigrants who were either working or looking for work -- that is, they were in the labor force -- people ages 16 and older who are employed or looking for work.", "Pew told us it does not have a breakdown on how many were working and how many were looking for work.", "When we asked Johnson’s office for information to back his statement, the office cited verbal testimony from Pew senior demographer Jeffrey Passel, the author of the research we've cited. He appeared before Johnson's committee in March 2015.", "Passel told the committee: \"Although unauthorized immigrants represent about three and a half percent of the nation’s population, the 8.1 million unauthorized immigrant workers account for about 5 percent of the labor force.\"", "So, Passel referred to the 8.1 million as workers, but also to the labor force, which counts workers and people looking for work.", "Our rating", "Johnson said 8.1 million of the estimated 11 million to 12 million people \"in this country illegally are working.\" His statement goes a bit too far.", "The latest estimates from a nonpartisan research group show that as of 2012, there were 8.1 million undocumented immigrants in the labor force -- some working, others looking for work.\n\nFor a statement that is accurate but needs clarification, our rating is Mostly True.", "More on Ron Johnson", "Says Democratic challenger Russ Feingold \"was the deciding vote on Obamacare (Mostly False)\"", "\"The Iranian parliament will get to say yes or no on this deal, and I think the United States Congress should have the exact same input into the process. (Mostly False)\"", "Two-thirds of the federal budget is \"permanent law ... it's permanently appropriated (Mostly True).\"", "WTLK-AM, interview (quote at 12:30) of U.S. Sen. Ron Johnson, Oct. 7, 2015", "Email exchange, U.S. Sen. Ron Johnson senior communications advisor Patrick McIlheran, Oct. 20, 2015", "PolitiFact Wisconsin, \"A big reason illegal immigrants become illegal is they change jobs, U.S. Sen. Rand Paul says (Half True),\" April 29, 2014", "Pew Research Center, \"5 facts about illegal immigration in the U.S.,\" July 24, 2015", "Pew Research Center, \"Share of Unauthorized Immigrant Workers in Production, Construction Jobs Falls Since 2007,\" March 26, 2015", "Pew Research Center, \"Unauthorized immigrant totals rise in 7 states, fall in 14,\" Nov. 18, 2014", "Pew Research Center, Jeffrey Passel testimony to U.S. Senate Committee on Homeland Security and Government Affairs, March 26, 2015", "Email exchange, U.S. Bureau of Labor Statistics press officer Gary Steinberg, Oct. 20, 2015", "Email exchange, Pew Research Center communications assistant Drew Larose, Oct. 20, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]