["About this rating", "Rumors are surging in the wake of George Floyd's death and resulting protests against police violence and racial injustice in the United States. Stay informed. Read our special coverage, contribute to support our mission, and submit any tips or claims you see here.", "On June 1, 2020, police officers and members of the National Guard in Washington, D.C.,  used tear gas and batons to clear an area occupied by peaceful protesters in front of St. John's Church before U.S. President Donald Trump arrived to give brief remarks and pose for photographs outside the church.", "The incident stirred up outrage online and many social media users accused Trump of behaving like a dictator.", "Soon thereafter, a pair of photos started to circulate online that compared Trump to Nazi dictator Adolf Hitler. One picture showed Trump holding a bible in front of St. John's Church. The other supposedly showed Hitler holding a bible in a crowd:", "The image of Trump is real. As stated above, this photograph was taken on June 1, 2020. ABC News described the events that preceded this photograph, writing:", "Police reinforced by National Guard troops forcefully pushed back protesters outside the White House Monday evening to clear a way for President Donald Trump to visit a church, just minutes after he said he wanted a military show of force against violent protests gripping the country.", "As television cameras showed live images of Trump's quick stop at the historic St. John's Church, where a small fire caused damage to its basement during protests the night before, the president posed with a Bible and with senior members of administration. Moments before, police had cleared largely peaceful demonstrators from the area, using tear gas and beating some with batons and shields, including at least one news photographer.", "A video from The Independent also shows Trump standing in front of St. John's Church with a bible:", "The image of Hitler, however, is a fake.", "A genuine photograph of Hitler standing in a crowd of people delivering the \"Heil Hitler\" salute was manipulated to appear as if he was holding a book. The original image is available via Getty with the following caption:", "Nazi German Fuhrer Adolf Hitler (C) saluting girding crowd raising arms in enthused mass heil, in undated image. (Photo by Heinrich Hoffmann/Timepix/The LIFE Picture Collection via Getty Images)", "A version on Alamy Images states that this photograph was taken in front of the Berghof, Hitler's home in the Bavarian Alps in Germany, in 1935. Here's a look at the original photograph (left) and the doctored version (right):", "A second image supposedly showing Hitler holding a bible was also circulate online. This image, too, was fake. The second fake image of Hitler holding a bible was created by manipulating a genuine image of the Nazi leader delivering a speech in 1937.", "Here's a look at the real photograph (left) and the doctored image (right):", "The full, uncropped version of the genuine Hitler photograph can be viewed on The Associated Press' website.", "Smith, David.   \"'Words of a Dictator': Trump's Threat to Deploy Military Raises Spectre of Fascism.\"\r\n    The Guardian.   2 June 2020.", "Chappell, Bill.   \"'He Did Not Pray': Fallout Grows From Trump's Photo-Op At St. John's Church.\"\r\n    NPR.   2 June 2020.", "Gittleson, Ben; Phelps, Jordyn.   \"Police Used Tear Gas, Pushed Back Peaceful Protesters for Trump Church Visit.\"\r\n    ABC News.   1 June 2020.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]