["“If you’re bowing down to him after bashing him and speaking ill of him for 6 years, then understand that his ideology and thinking are greater than you,” reads a message shared with a photograph of Prime Minister Narendra Modi bowing down to a statue of former PM Jawaharlal Nehru.", "[Hindi text: 6 साल जिसे कोसने के बाद , खूब बुरा भला बोलने के बाद , उन्ही को नमन करना पड़े तो समझ जाओ की उनकी विचारधारा और सोच तुमसे कितनी महान होगी।”]", "6 साल जिसे कोसने के बाद , खूब बुरा भला बोलने के बाद , उन्ही को नमन करना पड़े तो समझ जाओ की उनकी विचारधारा और सोच तुमसे कितनी महान होगी । pic.twitter.com/mk6T0vHWlg", "— शिवानी 🇮🇳 (@INSANIYAT34258) August 15, 2020", "The claim has been shared by quite a few Twitter and Facebook users.", "We found that PM Modi had tweeted a set of four images of the newly-inaugurated Rashtriya Swachhata Kendra on August 8, 2020.", "Sharing some glimpses from the newly inaugurated Rashtriya Swachhata Kendra. pic.twitter.com/bhGF3saejr", "— Narendra Modi (@narendramodi) August 8, 2020", "One of the images from the set was morphed to depict that the Prime Minister was paying respect to Nehru when in fact he was bowing down to Mahatma Gandhi’s statue.", "On August 8, PM Modi inaugurated the National Sanitation Center set up at Rajghat in New Delhi. Several media organisations covered the inauguration ceremony. Prime Minister Modi’s Office uploaded a video of the event on YouTube where, at 16 seconds, PM Modi can be seen offering flowers on the statue of Gandhi.", "Furthermore, the picture viral on social media carries a photo of Spiderman and @libtardu written on the right. It was created as a satirical post by the handle.", "Rarest moment", "Nehru ji se haath jod kar maafi mangte huye Modi ji pic.twitter.com/HwUTaMwMYh", "— Libtardu (@libtardu_) August 9, 2020", "Donate Now", "Kinjal Parmar holds a Bachelor of Science in Microbiology. However, her keen interest in journalism, drove her to pursue journalism from the Indian Institute of Mass Communication. At Alt News since 2019, she focuses on authentication of information which includes visual verification, media misreports, examining mis/disinformation across social media. She is the lead video producer at Alt News and manages social media accounts for the organization.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]