["The live stream was broadcast on a Facebook post on March 10, 2021.", "“Donald Trump Perfect Welcome,” the caption reads.", "The video shows former US president Donald Trump emerging from a car with his wife Melania.", "The couple are later shown watching a military parade.", "French President Emmanuel Macron is also seen waving from an open-top army vehicle.", "The footage was also live-streamed on this Facebook page on the same day, and posted on March 9, 2021 by a YouTube channel called ‘American Events’, where it has been viewed more than 130,000 times.", "However, the posts are misleading.", "Landmarks visible in the footage, most notably the Arc de Triomphe, suggest it was filmed in Paris.", "The military parade on the Champs-Elysées and planes showcasing the French tricolour flag indicates it shows a Bastille Day parade, which is held every year on July 14 to mark France’s national day.", "AFP ran a keyword search for “Trump Bastille Day” and found various news reports and videos of the former US president attending the celebration in Paris on July 14, 2017, where he was invited as guest of honour by French President Emmanuel Macron.", "The purported livestream appears to be a combination of two videos from the parade. A keyword search of “Bastille Day 2017” on YouTube led AFP to the first section, from 0:00 to 1:51, of the misleading livestream.", "The footage can be viewed here in this YouTube video published by France’s Ministry of the Armed Forces, which shows the military parade along the Champs-Elysées on July 14, 2017.", "Below is a comparison between the misleading livestream (L) and the video published by the Ministry of the Armed Forces (R):", "The second section, from 1:52 to 4:58 in the misleading livestream, shows a superimposed graphic from British newspaper The Guardian in the top corners of the video.", "A keyword search on Google found this YouTube video published on July 14, 2017, which is titled: “French army band medleys Daft Punk following Bastille Day parade”.", "Below is a comparison between the misleading livestream (L) and The Guardian’s video (R):", "AFP has previously debunked videos misleadingly broadcast as live-streams on social media.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]