["Amidst the ongoing farmers’ protest, several Twitter users have posted a video of Sikh men chanting pro-Pakistan slogans. The clip has been shared along with the Hindi text, “A glimpse of anti-national farmers’ protest in this one minute video. Kashmir will become Pakistan. Punjab will become Khalistan. (किसान आंदोलन की देश विरोधी झलक इस 1 मिनट के वीडियो में. कश्मीर बनेगा पाकिस्तान. पंजाब बनेगा खालिस्तान.)”", "*किसान आंदोलन की देश विरोधी झलक इस 1 मिनट के वीडियो में…..*", "*कश्मीर बनेगा पाकिस्तान* *पंजाब बनेगा खालिस्तान*", "Posted by Shiv Kushwaha on Wednesday, 9 December 2020", "The video is massively viral on Facebook with the same message.", "It was also shared with the text, “If you want them to be booked for sedition, make this video viral.”", "Twitter user @OmPraka43229608 posted the video, gaining over 1,000 retweets. (archived link)", "अगर आप भी चाहते है कि इनके ऊपर देशद्रोह का मुकदमा दर्ज हो तो ज्यादा से ज्यादा वायरल करें देश को एक साजिश करके तोड़ने की कोशिश की जा रही है जो कभी कामयाब नहीं होगी@HMOIndia pic.twitter.com/dQkx61xpEt", "— Om Prakash Rawat (@OmPraka43229608) December 8, 2020", "Akash RSS’s video gained close to 9,000 views since it was posted on December 8 (archived link). In the past, Alt News has document multiple instances of misinformation promoted by Akash RSS.", "अगर आप भी चाहते है कि इनके ऊपर देशद्रोह का मुकदमा दर्ज हो तो ज्यादा से ज्यादा वायरल करें pic.twitter.com/VwjbioLuOJ", "— Akash RSS (@Satynistha) December 8, 2020", "Some Facebook users have also posted this video. Additionally, Alt News received several requests on our WhatsApp helpline number (+917600011160) and on our official Android application to authenticate this claim.", "This slideshow requires JavaScript.", "Alt News performed a keyword search on Facebook and YouTube and found that the viral video was posted by local news outlets Kashmir Essence News and The Kashmir Pulse in October 2015.", "The juxtaposition below shows that both clips represent the same incident.", "Facebook Page Mission save Pakistan posted an image of the incident around the same time along with the link to a news report by The Deccan Chronicle.", "As per The Kashmir Pulse, Sikh protesters chanted pro-Pakistan slogans during a protest against the desecration of the Sikh scripture Guru Granth Sahib at Baramulla in Kashmir. The same was reported by The Deccan Chronicle.", "Thus, social media users posted a clip of Kashmiri Sikh protesters from 2015 and falsely linked it to the recent farmers’ protest. Over the past few weeks, multiple old images and videos have been shared as farmers’ protest to delegitimise the protest and falsely promote that the movement has a ‘Khalistani’ agenda.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]