["The photos were published on Facebook here on October 31, 2020. The post has been shared over 670 times.", "The post’s Sinhala language caption translates to English as: “What is a PCR machine...", "“Mercedes Maybach S650...Valued over Rs. 150 million...", "“The money spent on buying this, could have been spent on 10 PCR machines as well as procuring over 20 million PCR test kits.", "“I feel bad for the majority...”", "PCR machines are devices used for Covid-19 testing. The breakdown of a PCR machine at a hospital in Sri Lanka made headlines in late October after it delayed over 20,000 Covid-19 tests. The machine was fixed by Chinese technicians on November 3, 2020.", "The photos were also shared alongside similar claims on Facebook here, here, here and here.", "The claim, however, is misleading.", "The head of the Presidential Secretariat Transport Division denied the claim, saying that no Mercedes-Maybach S650 cars were recently purchased.", "“There is no truth to the claim that President Rajapaksa procured a Mercedes-Maybach S650 for his official fleet. He currently uses a Mercedes procured in 2017 during the tenure of former President Sirisena by the Ministry of Defense and it’s a Mercedes-Maybach S600,” the official told AFP by phone on November 2, 2020.", "The purchase of two Mercedes-Benzs in 2017 under former President Maithripala Sirisena was covered by the media at the time. A customs declaration was also published confirming the import of two Mercedes-Maybach S600 sedans.", "Moreover, in January 2020, local media reported that Rajapaksa suspended the purchasing of new vehicles for state agencies and government officials for the next three years.", "A reverse image search also found that the photo of Rajapaksa exiting a vehicle shared in the misleading posts was originally published on the president’s official Facebook page here on October 22, 2020.", "A review of photos and footage published on Rajapaksa’s Facebook page and by local news channels show the president consistently travelling in the same vehicle, as seen in February 2020 here and August 2020 here.", "Further reverse image searches found that the interior and exterior photos of the Mercedes-Maybach S650 shared in the misleading posts are stock promotional content.", "The exterior image of the car can be seen at the 30-second mark in this Youtube video published on August 8, 2020. The interior image can be seen in this magazine article published in 2017.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]