["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A recent attack mailer from the Republican Party of Florida calls Obama \"Soft On Crime.\"", "\"Barack Obama has consistently voted against tougher penalties for criminals — including major offenses — allowing criminals to remain on the streets,\" the mailer states.", "This mailer, like so many other mailers and TV ads, cherry-picks a few choice examples and conveniently ignores evidence that contradicts its conclusions. We'll review the four Obama positions highlighted by the mailer to back up its claim, and put Obama's position in a fuller context. We'll also examine Obama's fuller record on each front to show how the ad distorts its claims.", "A mail ad targeting Barack Obama.", "•   Against tough penalties for drug-related crimes.  \"Obama is against tougher penalties on crack-cocaine users and would use taxpayers dollars to provide addicts with hypodermic needles.\"", "When the federal Sentencing Commission voted in November to lower sentencing guidelines for crack-related crimes, and bring them closer to sentences for powder cocaine, Obama spoke approvingly of the action and said he supported applying the lower jail terms retroactively to current prisoners. Obama echoed concerns among some civil rights leaders and elected officials about disparities between mandatory prison terms for crack cocaine offenses, which affect mostly black prisoners, and terms for powder cocaine, which affect mostly whites.", "As for the second part of the claim, Obama did tell the Associated Press in February that if elected, he would move to repeal a 20-year-old ban on federal funding for needle exchange programs. And when he was an Illinois senator, Obama also supported a law that would allow the purchase of needles without a prescription.", "Obama's position was framed as an attempt to help stem the HIV/AIDS epidemic — particularly acute among black Americans — by encouraging drug addicts who might otherwise use contaminated needles to exchange them for clean ones. Obama also expressed concern about disease being spread to the innocent children of drug users.", "\"And what’s more important is the fact that many intravenous drug users are now passing on their afflictions onto a spouse who does not engage in drug use or, more tragically, an infant who, as a consequence of being born to a mother who engages in drug use, might be born with AIDS,\" Obama said. \"And so I think I recognize some of the cultural concerns and the symbolic concerns that people may have, what kind of message does this send. But I also think it’s just important to recognize the enormous costs and potentially fatal consequences that we’re placing on individuals when they are reusing dirty needles over and over again. We may think that’s what they deserve, but I personally, at least, think particularly because the impact often goes beyond the drug user themselves, that this is a modest, measured and effective strategy for dealing with this problem.\"", "For the Republican Party of Florida to single out these two positions to conclude that Obama is \"against tough penalties for drug related crimes\" is grossly misleading.", "It's not hard to find a few examples of Obama initiatives that show just the opposite. For example, Obama took aim at the methamphetamine epidemic when he co-sponsored the Combat Meth Act of 2005, which sought to provide more money to investigate and prosecute methamphetamine offenses, tighten controls on the sale of meth ingredients, and provide assistance grants to the children of meth abusers. And in 1997, Obama voted to increase penalties for marijuana possession.", "•   Against protecting children from danger.  \"Obama refused to take a stand and protect our children from guns fired at or near schools.\"", "This relates to a 1999 bill in the Illinois Senate that sought to allow adult prosecution for juveniles over the age of 15 charged with aggravated battery with a firearm within 1,000 feet of a school. Obama voted \"present,\" a procedural vote that carries the same effect as a no, though the bill passed overwhelmingly. Speaking before the general assembly at the time, Obama said, \"there is really no proof or indication that automatic transfers and increased penalties and adult penalties for juvenile offenses have, in fact, proven to be more effective in reducing juvenile crime or cutting back on recidivism.\"", "Yes, Obama did not support this bill, but there are many other votes that contradict the mailer's blanket claim that Obama is \"against protecting children from danger.\" In 2001, for example, Obama voted to increase penalties for repeat sex offenders; for those convicted of child abduction and child molestation. In 2005, he co-sponsored legislation to require sex offender data be available on the Web.", "•   Against tougher penalties for street gangs.  \"Obama voted against making gang members eligible for the death penalty if they kill someone to help their gang.\"", "In 2001, Obama was one of nine Illinois senators who voted against a bill that would have allowed the death penalty for a person convicted of first-degree murder \"in furtherance of a gang activity.\" Obama argued the law was too vague about what constituted gang activity and would disproportionately affect black and Hispanic neighborhoods.", "Again, this bill is not the entirety of Obama’s record with regard to gangs. Someone could just as easily have highligted a few other votes to reach an exactly opposite conclusion. In 2003, Obama voted to prohibit released gang members from associating with their old gang members. In 2004, he voted in favor of a law to make gang recruiting at a school a crime.", "•   Against protecting families from abuse.  \"Obama is against a cooling-off-period of 48 hours for those who abuse their family.\"", "Obama served on the Illinois Senate Judiciary Committee that declined to pass a bill that would have required anyone convicted of domestic battery to serve at least two days in jail. According to a Copley News Service story on April 20, 1999, opponents of the measure feared it would take away too much discretion from judges and tax already overcrowded jails. Specifically, the article says Obama \"questioned whether the bill would hurt prosecutors in the long run. Victims are usually reluctant to testify, so prosecutors have to push more for plea bargains. If defendants know they face a minimum two-day sentence, more will choose to fight their cases in court.\"", "Not mentioned in the mailer is that in 2001, Obama co-sponsored a bill to increase penalties for domestic batteries committed near domestic violence shelters. Or that in 2002, he co-sponsored a bill to toughen penalties for repeat domestic violence offenders.", "In each case, the RPOF has taken selective votes or positions to prop up sensational headlines that are belied by a fuller examination of Obama's record. Similarly, the claim that Obama has \"  consistently  voted against tougher penalties for criminals\" — when weighed against the entirety of Obama's record — is untrue. We rule the ad’s claim False.", "Illinois government Web site, 91st General Assembly,  Summary of Senate Bill 759", "Illinois government Web site, 91st General Assembly,  Vote on Senate Bill 759  , March 25, 1999", "Illinois government Web site, 92nd General Assembly,  Summary of House Bill 1812", "Illinois government Web site, 92nd General Assembly,  Vote on House Bill 1812  , March 15, 2001", "Illinois government Web site, 92nd General Assembly,  Status of Senate Bill 1080", "Illinois government Web site, 93rd General Assembly,  Summary of Senate Bill 880", "Illinois government Web site, 91st General Assembly,  Status of House Bill 33", "Illinois government Web site, 92nd General Assembly,  Status of House Bill 4081", "Illinois government Web site, 90th General Assembly,  Summary of House Bill 379", "Illinois government Web site, 93rd General Assembly,  Bill Status of House Bill 506   \n\nIllinois government Web site, 93rd General Assembly,  Bill Status of House Bill 4786", "The Library of Congress, 109th Congress,  H. R. 3199", "Obama campaign Web site,  Under the Radar: mailer claims Obama \"soft on crime.\"", "Milwaukee Journal Sentinel, Ruling takes color out of crack cases, by Eugene Kane, Dec. 13, 2007", "Associated Press, Obama says he would relax drug sentencing, address inequalities in justice system, by Nedra Pickler,  Sept. 28, 2007", "San Francisco Chronicle, Where they stand on crime, death penalty;\nDifferences are greater between parties than between candidates, by Bob Egelko, Feb. 10, 2008", "Associated Press, NAACP, other groups seek end to ban on federal funding for needle exchange, by David Crary, Feb. 7, 2008", "Copley News Service, Bill to require jail time for batterers fails, by Joe Mahr, April 20, 1999", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]