["About this rating", "In April 2019, an image supposedly showing an \"endangered starry butterfly\" was widely circulated on social media. One post from the Facebook page Earth Wonders, for instance, racked up more than 70,000 shares:", "This image is not a genuine photograph of anything, much less a depiction of a real butterfly. This picture is a piece of digital art created by Instagram user Sara Shakeel.", "The base image for this digital artwork can be found on the website of nature photographer Stephen Powell. The photograph was taken in Spain in 2012 and reportedly shows a black-veined white butterfly, which, unlike the \"endangered starry butterfly,\" actually exists.", "Here's a comparison of Powell's original photograph (left) and Shakeel's digital artwork (right):", "Shakeel originally posted this piece in March 2019 under the caption \"Nothing Lasts Forever ??.\" She then explained that this was a piece of collage art, not a genuine photograph of a butterfly, and tagged the item with hashtags such as #art #creation and #creative.", "Shakeel has garnered a reputation, as well as hundreds of thousands of followers, for her glittery creations. In November 2018, Forbes described Shakeel as a former dentist from Pakistan who has become a \"digi art sensation\":", "With nearly 400K followers on Instagram, Sara Shakeel may not have had any formal art training but then again, she didn't have to. She's one of these new wave artists, one of the Insta age and it's fair to say she's become somewhat of a digi art sensation if her massive following is anything to go by (which includes big brands and famous faces such as model Coco Rocha owning her artwork) ...", "For the Pakistani dentist-turned-artist, she is all about conveying emotions and there's no better [way] to communicate these [than] via the use of shiny, bright and alluring crystals of course (and there's plenty of rainbows in there for good measure).", "Powell, Stephen.   \"Glorious 4th July.\"\r\n    Wild About Spain.   4 July 2012.", "Carter, Felicity.   \"Meet Sara Shakeel: The Original Crystal Artist.\"\r\n    Forbes.   2 November 2018.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]