["About this rating", "A Fresno County woman was reported missing and found deceased in her vehicle on 10 June 2016, but police did not believe anything \"criminal\" occurred; a Visalia woman went missing on 9 June 2016 and police are investigating her suspicious disappearance.", "There were no reports of abductions or other women found deceased in Fresno and Tulare Counties in early June 2016; the missing Visalia woman's case was widely reported and not suppressed by police.", "On 15 June 2016, the above-reproduced warning began to circulate via social media, claiming that five women in central California's Fresno and Tulare counties had gone missing in the past 72 hours and that police were trying to suppress the story.", "The claim rapidly spread through \"better safe than sorry\" Facebook messages, with many users stating they received the warning via text message. News of the sort described in the posts seemed difficult to suppress, as the families of the three women missing (but not confirmed dead) would be searching for their loved ones.", "None of the missing or deceased women were named in the post, nor were details given about the circumstances under which all five had purportedly disappeared. The warning also didn't disclose the identities of the two women it claimed were found dead, and the only information specifying location held that \"one woman left for work to Valley Children's Hospital\" and hadn't been seen alive since.", "Information published on 11 June 2016 by the Fresno County Sheriff's Department stated that one woman was found dead inside her vehicle, and that preliminary findings indicated they believed nothing criminal had occurred in the circumstances under investigation:", "Members of the Fresno County Sheriff’s Office Crime Scene Unit have identified Alicia Haro, 47, of Fresno as the victim in a suspicious death investigation.", "Haro was reported as a missing person to the Fresno Police Department on Thursday, June 9th.", "Around 7:30 pm on Friday, a Fresno County Sheriff’s Office deputy responded to a call on E. Mt. View Ave., near S. Highland Ave. in the Selma area. A passerby reported finding an unresponsive woman in the driver seat of an SUV, which was parked inside an orchard. The deputy determined the woman was deceased and homicide detectives responded to begin an investigation.", "Preliminary results show nothing criminal took place to result in Haro’s death. An autopsy and toxicology tests are pending to determine an exact cause of death.", "Haro went missing on 9 June 2016, and was found dead in her vehicle on 10 June 2016; the warning circulated on 15 June 2016. No further instances of open missing persons cases nor suspicious deaths were reported in the region.", "The Tulare County Sheriff didn't maintain a page of such releases, but a coroner's page listed recent deaths in the jurisdiction. All causes of death from 9 June 2016 onward were listed as \"Natural,\" not suspicious. On 15 June 2016, the Visalia Times-Delta reported that social media rumors spreading about missing women in the area were not credible:", "Recently, the Visalia Police Department became aware of several social media postings related to missing and abducted females in Visalia and the surrounding communities.", "“We would like to take this opportunity to inform the public we currently do not have any information to support these claims, nor are we investigating any reports of abducted women,” Visalia Sgt. Damon Maurice said. “We have been in contact with the authors of recent online posts in an effort to determine if criminal conduct occurred.”", "The police department would like to remind the public to be alert, be vigilant and be aware of their surroundings, at all times.", "“If you experience or witness anything of a suspicious nature, please report this activity to us immediately,” Maurice said.", "On 10 June 2016, that outlet (and several others) reported the suspicious disappearance of a Visalia woman:", "Family and friends of a missing woman are asking for the public’s help in locating their loved one.", "Cecilia Bravo Cabrera, 30, was last seen at Tachi Palace Casino at 12:39 Thursday morning.", "She was driving a dark grey Chevrolet Malibu. Detectives found her vehicle in the area Traver but are still searching for Cabrera.", "We contacted the Tulare and Fresno County Sheriff's Departments to ask whether there was any truth to the warning. An officer from Fresno County confirmed that aside from the missing Visalia woman, no other disappearances had been reported in the region, and that the deceased woman found on 10 June 2016 did not appear to be a victim of foul play after a preliminary investigation.", "Neither case appeared to be linked with Valley Children's Hospital, nor did there appear to be any unreported cases of missing women in either county.", "Panoo, Ashleigh.   \"Tulare County Asking For Help Locating Missing Woman.\"\r\n    The Fresno Bee.   10 June 2016.", "Romero, Sheyanne.   \"Sheriff's Department Searching For Missing Woman.\"\r\n    Visalia Times-Delta.   10 June 2016.", "Romero, Sheyanne.   \"Rumors About Missing Visalia Women Are Rumors.\"\r\n    Visalia Times-Delta.   15 June 2016.", "YourCentralValley.com.   \"Missing Woman's Disappearance Suspicious.\"\r\n    14 June 2016.", "KFSN-TV.   \"New Developments Have Authorities Calling Missing Woman's Case Suspicious.\"\r\n    14 June 2016.", "Fresno County Sheriff's Office.   \"Missing Fresno Woman Found Deceased.\"\r\n    11 June 2016.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]