["About this rating", "In February 2016, the entertainment web site Nevada County Scooper reported that Metallica singer James Hetfield had earned a PhD in astrophysics:", "Metallica’s lead singer and heavy metal guitarist James Hetfield just put us all to shame by getting a PhD in astrophysics. Oh, and by the way, that’s Dr Hetfield to you.", "Hetfield recently finished defending his PhD dissertation at CalTech and made the announcement on Facebook. Apparently, the guy had been attending university on and off for the past 12 years!", "“I like playing music because it’s a good living and I get satisfaction from it. But I can’t feed my family with satisfaction,” said Dr Hetfield. “So I figured if Brian May could do it, so could I. Which is why I did this other gig. Turns out, I was pretty good at it.”", "While the article didn't gain much traction when it was first published, the  hoax was eventually picked up by legitimate publications, such as culture web site Lost at E Minor, and shared as real news:", "Metallica’s lead singer and heavy metal guitarist James Hetfield just put us all to shame by getting a PhD in astrophysics. Oh, and by the way, that’s Dr Hetfield to you.", "However, there is no truth to this rumor. Metallica's James Hetfield has not earned his PhD in astrophysics. The Nevada County Scooper is a well-known satire web site that has previously published high-profile hoax stories, such as a report that Merle Haggard had left his estate to an LBGT group, that White Stripes' drummer Meg White was joining the band Rush, and that Sen. Bernie Sanders called for \"chemtrail reform.\"", "This isn't the first time that James Hetfield has been the subject of a hoax news story this year. In March 2016, a rumor circulated that the Metallica singer had released a country album.  (The rumor was false.)", "This article would be remiss not to mention Brian May, perhaps best known as the guitarist for rock band Queen, who actually does have a PhD in astrophysics. May earned his degree from Imperial College London in 2007 (and also served as Chancellor of Liverpool John Moores University from 2008 to 2013), doing his research on zodiacal light: a misty, diffuse cone of light often seen in the night sky that is caused by interplanetary dust.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]