["One of the earliest versions of the claim was published by a Facebook page called “Fadlur-Rahmān Islamic Foundation FIF”. The account is known for promoting religious content in Nigeria.", "The post, which has racked up more than 270 shares since publication on March 2, 2021, claims that several Muslim worshippers in Pakistan had lost their lives in an inferno at a local mosque the previous day.", "“Pakistan found it difficult yesterday. Both Masjid & Islamiyyah (Madarasa) got burnt with many & many Muslims, SubhānaAllah. May Allah forgive whom died there & grant them Jannatul Firdaws finally (sic),” part of the Facebook post reads.", "Madrasa is an Arabic word that refers to an Islamic seminary or school, usually a part of the mosque in Pakistan.", "The same set of images was also shared by this Facebook page with almost 50,000 followers, alongside a similar claim.", "However, the photos were not taken in Pakistan and have been in circulation in previous years.", "Firstly, AFP Fact Check found that the main image of a burning building was taken in India nearly a decade ago.", "By conducting a reverse image search, we located the earliest version of the photo in an online report from June 26, 2012, by Indian news organisation Firstpost.", "The publication refers to plans by the authorities to conduct a fire safety audit of major heritage shrines in the Kashmir Valley of India after the 200-year-old Dastageer Sahib Shrine (pictured) was gutted by fire.", "Firstpost’s attribution of the image to Indian news agency PTI gave AFP Fact Check a clue to the source of the photo. A keyword search for “Dastageer Sahib” on the agency’s website found the image on page 5 of the search results.", "“Srinagar: Fire fighters and locals try to douse a massive fire that broke out at the 200-year-old Sufi heritage shrine of Dastageer Sahib at Khaniyar in Srinagar on Monday,” reads the caption on the photo, which can be seen by hovering the cursor over the image.", "By accessing the photo’s metadata using the InVID WeVerify tool, AFP Fact Check found that the photo was taken the previous day on June 25, 2012. This matches with the photo’s date on PTI archives.", "AFP Fact Check traced a set of two photos showing people wrapped in shrouds and lying on the ground to this Facebook post from February 24, 2020.", "The image shows anti-citizenship protesters in Aurangabad, a major city in the Indian state of Maharashtra.", "Indian news organisation JJP News covered the demonstration where men were dressed in shrouds to protest against the Citizenship Amendment Act and National Civil Register in South Delhi.", "Footage showing the demonstration also appeared on YouTube on the same day.", "A third reverse image search led AFP Fact Check to the archives of UK photo agency Shutterstock.", "The image of an open book on a blood-smeared floor was taken on November 18, 2014, in Jerusalem by photographer Kobi Gideon.", "“Blood on the synagogue floor where at least four Israelis have been killed and eight injured when two men with a pistol, knives and axes attacked a synagogue in Yeshiva compound in the Har Nof neighbourhood,” the photo caption reads. The attack was reported at the time by AFP.", "Meanwhile, AFP Fact Check found no evidence that any mosque was gutted by fire recently in Pakistan, a fact confirmed by AFP’s country correspondent, Masroor Gilani.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]