["About this rating", "On Oct. 9, 2019, a video supposedly showing a large banner reading \"(Trump) Betrayed and Murdered Kurdish People\" hanging from top of the Trump Tower in Las Vegas (while off-screen protesters chant \"Not my president\") started making its way around social media:", "Happening right now at the Trump Tower Hotel in Las Vegas.#KurdsBetrayedByTrump pic.twitter.com/QbZyOXkiNn", "— Paul Lidicul (@PaulLidicul) October 9, 2019", "This video does not show a genuine banner hanging from Trump Tower, but rather a digital creation from @PaulLidicul made in response to President Trump's decision not to aid American-allied Kurdish forces in Syria during a planned Turkish military campaign:", "[T]he White House said that the U.S. would withdraw troops from a region of northern Syria that borders Turkey. This comes ahead of a Turkish military incursion into Syria against those it considers terrorist threats. Among those perceived threats are Kurdish fighters, part of the Syrian Democratic Forces, who have been allied with the United States in fighting the Islamic State, or ISIS. (USA Today)", "@PaulLidicul responded to a number of comments on Twitter pointing out that the video was fake, arguing that \"whether that banner was physically or digitally put there is irrelevant -- the statement is MADE, the public outrage is REAL and the message is spread.\"", "@Paullidicul, who previously went by the handle @PaulLeeTicks, created a similar digitally altered video in June 2019 that supposedly showed a banner reading \"Concentration Camps\" hanging from Trump Tower:", "President Trump's decision not to help the United States' Turkish allies was widely criticized by both Republicans and Democrats, including some of Trump's staunchest defenders. Senator Lindsey Graham (R-S.C.), for example, said that the \"move ensure(d) the reemergence of ISIS\" and urged President Trump to \"change course while there is still time.\" Rep. Liz Cheney (R-Wyo.) asserted that \"President Trump’s decision to withdraw U.S. forces from northern Syria is having sickening and predictable consequences” and vowed that lawmakers “must and will act to limit the catastrophic impact of this decision.\"", "Everett, Burgess.   \"Trump’s GOP Allies Condemn President After ‘Sickening’ Turkish Incursion\"\r\n    Politico   8 October 2019.", "Santucci, Jeanine.   \"What We Know About Trump's Withdrawal from Northern Syria as Critics Argue It Abandons Kurdish Allies\"\r\n    USA Today   8 October 2019.", "AFP.   \"Real Banner on Trump Hotel?\"\r\n    11 July 2019.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]