["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Force F-16 Falcons from the New Jersey Air National Guard are armed at Prince Sultan Air Base in Saudi Arabia while enforcing the no-fly zone in southern Iraq in 2000. (US Air Force)", "As Hillary Clinton makes a second bid for the presidency, the record of her husband -- former President Bill Clinton -- is being revived on social media. Recently, a meme has been circulating that makes a little fun of the former president’s \"teflon\" nature -- failings didn‘t stick to him the way they stuck to other politicians.", "The meme features a photograph of Clinton with an impish grin and a twinkle in his eye, along with the following caption: \"I gave a speech in 1996 about Iraq having WMDs (weapons of mass destruction) and stuff. I said we needed a regime change for the security of our nation and to free the Iraqi people from an evil dictator. In 1998 I signed the Iraq Liberation Act. Ya’ll blamed it on Bush. Thanks for that!\"", "The meme argues that Clinton essentially escaped the opprobrium that plagued his successor, President George W. Bush, even though they said similar things about Saddam Hussein-era Iraq and the geopolitical threat it posed. By extension, the meme suggests that Democratic supporters of Clinton are hypocritical by celebrating Clinton but excoriating Bush.", "We looked back at the speeches in question and found that the meme’s pairing of Clinton’s views with Bush’s is misleading on several fronts.", "Clinton ‘gave a speech in 1996 about Iraq having WMDs’", "Clinton did indeed give a weekly radio address on Sept. 7, 1996, in which he said, \"We must redouble our efforts to stop the spread of weapons of mass destruction, including chemical weapons, such as those that Iraq and other rogue nations have developed.\"", "However, it’s important to note that Clinton focused on chemical weapons and did not bring up nuclear weapons, as Bush would later do.", "\"The Senate will vote on ratification of the Chemical Weapons Convention,\" Clinton said. \"By voting for this treaty, the Senate can help to banish poison gas from the earth, and make America's citizens and soldiers much more secure. … The treaty will increase the safety of our citizens at home, as well as our troops in the field. The destruction of current stockpiles, including at least 40,000 tons of poison gas in Russia alone, will put the largest potential sources of chemical weapons out of the reach of terrorists, and the trade controls will deny terrorists easy access to the ingredients they seek.\"", "Bush, by contrast, would later make much more sweeping claims.", "For instance, in a weekly radio address on Sept. 14, 2002, Bush said of Hussein-era Iraq, \"Today this regime likely maintains stockpiles of chemical and biological agents, and is improving and expanding facilities capable of producing chemical and biological weapons. Today Saddam Hussein has the scientists and infrastructure for a nuclear weapons program, and has illicitly sought to purchase the equipment needed to enrich uranium for a nuclear weapon. Should his regime acquire fissile material, it would be able to build a nuclear weapon within a year.\"", "Then, during his State of the Union address on Jan. 28, 2003 -- on the eve of the war -- Bush said, \"The International Atomic Energy Agency confirmed in the 1990s that Saddam Hussein had an advanced nuclear weapons development program, had a design for a nuclear weapon and was working on five different methods of enriching uranium for a bomb. The British government has learned that Saddam Hussein recently sought significant quantities of uranium from Africa. Our intelligence sources tell us that he has attempted to purchase high-strength aluminum tubes suitable for nuclear weapons production.\"", "So while it’s true that both Clinton and Bush mentioned weapons of mass destruction in relation to Iraq, Bush’s claim was much more expansive.", "Clinton ‘said we needed a regime change’", "Clinton was hardly friendly toward Hussein, but he did not take actions to use military might to oust the Iraqi leader from power.", "For instance, on Sept. 3, 1996, Clinton gave a speech responding to attacks by Iraqi forces on the Kurdish-controlled city of Irbil in northern Iraq.", "\"Hussein's objectives may change, but his methods are always the same: violence and aggression -- against the Kurds, against other ethnic minorities, against Iraq's neighbors,\" Clinton said. \"Our answer to that recklessness must be strong and immediate, as President Bush demonstrated in Operation Desert Storm, as we showed two years ago when Iraq amassed its forces on Kuwait's border. … We must make it clear that reckless acts have consequences, or those acts will increase. We must reduce Iraq's ability to strike out at its neighbors, and we must increase America's ability to contain Iraq over the long run.\"", "This approach was about containing Hussein, not about ousting him. Containment was also the mission of the years-long no-fly zones over Iraq that were enforced by George H.W. Bush, Clinton and, before the war began, George W. Bush.", "The meme cites the 1998 Iraq Liberation Act. Clinton did sign that law, which passed with just 38 dissenters in the House and by unanimous consent in the Senate. The law said it \"should be the policy of the United States to support efforts to remove the regime headed by Saddam Hussein from power in Iraq and to promote the emergence of a democratic government to replace that regime.\"", "However, the methods of regime change mentioned in the law are U.S. support for home-grown anti-Hussein movements, including humanitarian aid, broadcasting assistance and military goods and training. The recipients of such aid would need to include \"a broad spectrum of Iraqi individuals, groups, or both, opposed to the Saddam Hussein regime\" and be \"committed to democratic values, to respect for human rights, to peaceful relations with Iraq's neighbors, to maintaining Iraq's territorial integrity, and to fostering cooperation among democratic opponents of the Saddam Hussein regime.\"", "That’s a big difference from Bush’s decision to use military force to attack and enter Iraq and topple Hussein by force.", "\"There's a difference between what Clinton did and said and George W. Bush's decision to overtly invade and topple the Hussein regime with force,\" said Lance Janda, a military historian at Cameron University. \"We'll never know if Clinton would have done that. We know, however, that Bush did, and he and his supporters have to live with that alone. They don't get to cravenly try to share responsibility with a man who was long out of office when we invaded.\"", "Our ruling", "The meme says Clinton \"gave a speech in 1996 about Iraq having WMDs\" and \"said we needed a regime change,\" even though everyone blamed those things on George W. Bush.", "Clinton did cite weapons of mass destruction in a speech about Iraq that year, but it was much more limited -- it focused on Hussein’s holdings of chemical weapons, not the alleged nuclear or biological stockpiles that Bush later used as a justification for the Iraq War. Meanwhile, Clinton did sign a law backing regime change in Iraq, but it was limited to assistance to homegrown opposition groups, not to a ground war aimed at toppling Hussein, as Bush later pursued.", "The meme contains some element of truth but ignores critical facts that would give a different impression, so we rate it Mostly False.", "Social media meme, sent by a PolitiFact reader, June 15, 2015", "C-SPAN, President Clinton announces U.S. Attack on Iraq, Sept. 3, 1996 (accessed via Nexis)", "C-SPAN, President Clinton’s Weekly Radio Address, September 7, 1996 (accessed via Nexis)", "The White House, President George W. Bush’s Weekly Radio Address, September 14, 2002 (accessed via Nexis)", "The White House, The President’s State of the Union Address, January 29, 2002", "The White House, The President’s State of the Union Address, January 28, 2003", "BBC, \"Containment: The Iraqi no-fly zones,\" Dec. 29, 1998", "Email interview with Anthony Clark Arend, Georgetown University professor of government and foreign service, June 15, 2015", "Email interview with Lance Janda, military historian at Cameron University, June 15, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]