["About this rating", "In early 2018, the 2015 extrajudicial killing of 28-year-old Jeremy McDole in Wilmington, Delaware received renewed attention after the incident was the subject of a Facebook post.", "The post, which contains footage of McDole's shooting at the hands of police, has received millions of views since being published in January 2018. The caption reads:", "Cops murdered a man in a wheelchair in Wilmington, Delaware. Officers were not held accountable for their crimes, but the man's family received a $1,500,000 settlement.", "However, the post does not mention that McDole was actually shot and killed on 23 September 2015. The incident led to anger toward police and a lawsuit filed by McDole's family which resulted in a $1.5 million settlement being awarded to them in December 2016.", "According to reports, police encountered McDole after receiving reports about a man in a wheelchair who had allegedly shot himself. Cellphone camera footage of McDole's death shows an officer approaching him with his gun drawn yelling, \"Show me your hands!\" The camera moves down as a gunshot can be heard. Seconds later, more officers approach McDole with their own weapons drawn. McDole's hands can be seen moving from his waist to his legs and he can be seen adjusting himself in the chair, which he used after being shot when he was 18 years old.", "As McDole's hands move toward the front of his jeans, the officers fire on him. Despite being described as having a gun, no firearm is visible near him. Investigators later said that they recovered a .38-caliber handgun by his side, an allegation that McDole's family questioned.", "The family sued both the city of Wilmington and the police department in March 2016, saying that McDole was the victim of \"grossly excessive and wanton lethal force\" on the part of police.", "Two months later, the state state Department of Justice released a report stating that the four officers involved — Senior Cpl. Joseph Dellose, Cpl. Thomas Lynch, Cpl. James MacColl, and Senior Cpl. Danny Silva — would not be charged in connection with McDole's death.", "In January 2017, the United States Justice Department also said that it would not pursue a federal civil rights lawsuit against the officer, saying there was insufficient evidence to disprove the officers' claims that they shot McDole in self-defense.", "Masulli Reyes, Jessica. \"Activists Speak Out About Shooting of Man in Wheelchair.\"\r\n    Wilmington News Journal. 27 September 2015.", "Jorgensen, Sarah. \"Settlement Reached in Police-Involved Shooting of Man in a Wheelchair.\"\r\n    CNN. 16 December 2016.", "Wilmington News Journal. \"Timeline: The McDole Shooting Case.\"", "Chase, Randall. \"Family of Man Killed by Wilmington Police Files Lawsuit.\"\r\n    Associated Press, accessed via Seattle Times. 3 March 2016.", "Delaware Department of Justice. \"Report of the Department of Justice on Wilmington Police Department Use of Force.\"\r\n    12 May 2016.", "United States Department of Justice. \"Federal Officials Close Review Into the Death of Jeremy McDole.\"\r\n    6 January 2017.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]