["A video of an old woman dancing has been shared on social media with the claim that she is Prime Minister Narendra Modi’s mother Hiraben. “पीएम नरेंद्र मोदी की मां Hira ban,” is the message posted by Facebook page ‘सुषमा स्वराज जि राष्ट्रपति हो‘. The video has garnered 68,000 views and over 1,100 shares at the time of writing this article. It is noteworthy that the video is being shared amidst Navratri celebrations when garba is played especially in the western state of Gujarat.", "पीएम नरेंद्र मोदी की मां Hira ban", "Posted by सुषमा स्वराज जि राष्ट्रपति हो on Saturday, 5 October 2019", "A Facebook user also shared the video with an identical claim.", "The same video has been floating online since 2017. Lieutenant Governor of Puducherry Kiran Bedi had tweeted the video on October 20, 2017. She too claimed that the elderly woman was Hiraben Modi and wrote, “Spirit of Deepavali at tender age of 97.”", "Spirit of Deepavali at tender age of 97. She’s mother of @narendramodi (Hiraben Modi -1920) celebrating Diwali at her own home👇🏼@SadhguruJV pic.twitter.com/HBXAzNXomC", "— Kiran Bedi (@thekiranbedi) October 20, 2017", "A keyword search on YouTube leads one to the same video uploaded by numerous users. The earliest instance of the video was traced back to September 30, 2017, uploaded with the caption, “Garba fever.”", "Alt News had debunked this video when it was shared by Bedi two years ago. Bedi had tweeted a clarification after several social media users pointed out the misinformation.", "Am informed it’s mistaken identity @SadhguruJV. But salute to the mother with so much vigour. I hope i can be like her if/ when I am 96..! https://t.co/5llHN40tg8", "— Kiran Bedi (@thekiranbedi) October 20, 2017", "A facial comparison of the elderly woman and Hiraben Modi also stands as evidence that the one dancing in the video is not the PM’s mother. Hiraben Modi’s face is circular while the other woman has an oval face structure. Moreover, Hiraben Modi is seen wearing spectacles in all her publically available photographs, even the ones shot at home.", "A video of a random elderly woman has been circulating on social media with the false claim that she is Prime Minister Modi’s mother Hiraben.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]