["About this rating", "In a CNN interview, Senator Al Franken confirmed he planned to break with voters in his state by casting his superdelegate vote for Hillary Clinton; Franken's constituents overwhelmingly selected Sen. Bernie Sanders in the state's caucuses; Franken said that by electing him to office, his constituents affirmed their confidence in his judgment.", "Franken did not say his vote was more \"important\" than the votes of his constituents, but that he felt that his vote was best cast for Hillary Clinton.", "In March 2016, voters in Minnesota caucused for both Democrat and Republican candidates.  Senator Bernie Sanders won the Democratic vote by a double-digit margin:", "At the same time, discussions and debates were raging among voters and pundits about superdelegates, a suddenly relevant aspect of the candidate selection process. High-ranking party officials (senators, for example) counted as superdelegates, and made up about 15 percent of delegate votes to be counted during the July 2016 Democratic National Convention.", "On 30 March 2016, Sen. Al Franken (D-Minn.) appeared on CNN to discuss (among other things) his perspective on the presidential campaign and his intent to break from his state and cast his vote for Hillary Clinton, which — as an unpledged delegate, or a superdelegate — is his right:", "CNN also provided a transcript of the exchange:", "TAPPER: ... Senator Sanders won the Minnesota caucuses. You have endorsed Hillary Clinton. You are a superdelegate. What do you make of the argument put forward by the Sanders campaign that superdelegates who represent states that Sanders has won should consider voting for the candidate supported by Democratic voters in their state?", "FRANKEN: Well, superdelegates are part of our system. I haven't read that in the rules, that interpretation.", "TAPPER: You can vote for whoever you want.", "FRANKEN: Right.", "TAPPER: But they're saying shouldn't you, as a senator of Minnesota, follow the lead of the voters, the Democratic voters who turned out for the Minnesota caucuses?", "FRANKEN: I think Democratic voters who elected me to the Senate want me to exercise my judgment on who I think would be the best president of the United States, and I think that person is Hillary Clinton.", "Although Franken did confirm that he would vote differently than the majority of his constituents, at no point did he specifically state his judgment was \"more important\" than that of his constituency.", "The Democratic nomination process uses superdelegates, who (unlike ordinary delegates) remain unbound to any presidential candidate, and can switch their support at any time up to the actual nomination of a presidential candidate to represent the Democratic party.", "Kasimar, Ben, et al.   \"Sanders Pressures Clinton Superdelegates To Jump Ship.\"\r\nThe Hill.   29 March 2016.", "The New York Times.   \"Minnesota Caucus Results.\"\r\n13 May 2016.", "CNN Transcripts: The Lead With Jake Tapper.   \"Interview With Sen. Al Franken.\"\r\n30 March 2016.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]