["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Grandchildren of Democratic presidential candidate Joe Biden lead the Pledge of Allegiance during the first night of the Democratic National Convention on Aug. 17, 2020. (DNC via AP)", "A former U.S. senatorial candidate says the virtual Democratic National Convention left the word God out of the nation’s most famous and solemn oath.", "\"The DNC omitted ‘one nation under God’ from the Pledge of Allegiance,\" said Peggy Hubbard, who lost Illinois’ Republican primary election in March, in an Aug. 20 Facebook post.", "Hubbard’s post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.) It’s similar to other claims we’ve seen on Facebook, so we wanted to check it out.", "Some Democratic caucus members omitted \"one nation under God\" from the Pledge of Allegiance during DNC meetings. But the line was not excluded from any of the convention’s primetime televised spots. On each night of the DNC, \"under God\" was included in the Pledge of Allegiance.", "Conservative news outlets like the Washington Examiner have pointed out that, during the livestreamed Muslim Delegates Assembly on Aug. 18, one participant omitted \"under God\" from the Pledge. A delegate at an Aug. 18 LGBTQ Caucus meeting also abstained from saying it.", "There were 30 caucus and council meetings during the DNC, according to the party’s website. They were not the scripted, highly produced sessions that aired on television.", "The Pledge of Allegiance has existed in some form since the late 19th century, but in 1954, President Dwight Eisenhower signed a bill that officially added the words \"under God.\" There is a long history of legal challenges and religious objections to the inclusion of the phrase, particularly in public schools, where students are often asked to say the pledge.", "We reached out to Hubbard for a comment, but we haven’t heard back.", "Her Facebook post contains an element of truth but ignores critical facts that would give a different impression. We rate it Mostly False.", "Correction, Aug. 24, 2020: A previous version of this article incorrectly stated that, on the first night of the DNC, participants sang the \"Star-Spangled Banner\" instead of saying the Pledge of Allegiance. In fact, the pledge was included on the first night.", "Ballotpedia, Peggy Hubbard", "Democratic National Committee, \"DNC Announces Caucuses and Councils for the Democratic National Convention,\" Aug. 16, 2020", "Democratic National Convention, 08.18 LGBTQ Caucus", "Democratic National Convention, 08.18 Muslim Delegates Assembly", "Facebook post, Aug. 18, 2020", "Facebook post, Aug. 20, 2020", "Facebook post, Aug. 20, 2020", "The National Constitution Center, \"The history of legal challenges to the Pledge of Allegiance,\" June 14, 2020", "The University of Chicago Law School, \"‘Under God:’ The Pledge, Present and Future,\" Oct. 30, 2008", "The Washington Examiner, \"Democratic convention caucuses omit 'under God' while reciting Pledge of Allegiance,\" Aug. 20, 2020", "YouTube video from the Democratic National Convention, Aug. 17, 2020", "YouTube video from the Democratic National Convention, Aug. 18, 2020", "YouTube video from the Democratic National Convention, Aug. 19, 2020", "YouTube video from the Democratic National Convention, Aug. 20, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]