["The Indian Council of Medical Research (ICMR) has written to Bharat Biotech India Ltd (BBIL) to step up the clinical trials for their jointly-developed COVID-19 vaccine (BBV152 COVID vaccine) or ‘Covaxin’. In the view of this news, a photograph is widely circulating on social media with the claim that the first dose of the vaccine was administered on the “Vice President of BBIL Dr VK Srinivas”.", "Dr V. K.Srinivas , Vice President, Bharat biotech, taking Corona vaccine clinical trial", "After taking the first dose that he said he is the first person in India to take vaccine developed by his team in Bharat Biotech.", "Look at the confidence that they have in their product. pic.twitter.com/erNdwtjByy", "— Ravi Vallabhaneni (@ravivallabha) July 3, 2020", "The photograph is massively viral on Twitter and Facebook.", "ARE WE SEEING HISTORY BEING CREATED?", "(Disclaimer: these pics were sent to me, and not taken by me. Hence, can’t vouch…", "Posted by Srikant Sastri on Thursday, 2 July 2020", "It is also circulating on WhatsApp.", "1. The photograph shows the administration of BBV152 COVID vaccine.", "2. BBV152 can be administered intravenously.", "False.", "1. Bharat Biotech denies that the image represents clinal trials of BBV152", "In an email response to Alt News, BBIL wrote, “Certain images and messages being circulated on WhatsApp and other social media platforms have NOT been disseminated by Bharat Biotech. The image being circulated is a routine procedural blood draw for testing all production staff. ”", "Furthermore, in an interview with NDTV, Dr Krishna Ella, Chairman and MD of BBIL, said that human trials will start in 10 days.", "2. BBV152 cannot be administered intravenously", "BBV152 was registered for clinical trials with ICMR’s Clinical Trials Registry. As per the registration document, the route of administration of the vaccine is an intramuscular injection.", "Intra-muscular vaccines are not given in the elbow pit region (cubital fossa) due to a lack of muscles in that area. The cubital fossa is used to access superficial nerves, arteries and veins for intravenous administration. Furthermore, as seen in the picture, the person is wearing a tourniquet rubber band on his arm. The band is used to put pressure on a patient’s arm to draw blood. This is a compression method, highly unlikely to be used while administering a vaccine. The band is used to pool blood or accumulate blood to draw it intravenously, and this pooling of blood is not required for intramuscular vaccine administrations.", "What are the different routes of administration of vaccines?", "Vaccines can be administered using three different routes of injection, oral administration (for example, rotavirus vaccine) and intranasal spray application (for example, flu vaccine).", "The different routes of injection — intramuscular, subcutaneous and intradermal — depend on the point of entry of the vaccine and the place where the action is desired. Intramuscular injection administers the vaccine into the muscle mass (shoulder, butt or thigh). Subcutaneous injection administers the vaccine into the subcutis, the layer above the muscle and below the skin. Intradermal injection administers the vaccine in the epidermis, the topmost layer of the skin. The graphic below from the World Health Organisation explains the three routes of administration of a vaccine via injection.", "Some examples of vaccines administered through intramuscular injection are the Hepatitis B vaccine and measles-rubella vaccine.", "A photograph of a routine procedural blood draw was shared with the false claim that it represents the first dose of Covaxin being administered to Bharat Biotech’s Dr V K Srinivas. Moreover, the route of administration of BBV152, as per the vaccine’s registration document, is intramuscular while the image shows blood drawn intravenously.", "Donate Now", "A video of a ladder moving on its own, purportedly from Jharkhand, is viral on…", "In a 2-minute video, a man recommends a “technique” to prevent infection from Omicron, the…", "A video of a set of iron nails that appear to melt after being placed…", "Several social media users have shared an image that shows two columns — ‘Cepa/variante’ (Spanish…", "A 90-second video of a man dissecting a banana has been shared on the internet…."]