["About this rating", "On Veteran's Day 2019, an inaccurate tweet that accused U.S. President Donald Trump of once having attempted to evict a disabled veteran from a New York City property called Trump Village for owning a service dog drew outraged responses:", "This #VeteransDay please remember Trump once evicted a disabled US Army combat veteran of Afghanistan & Kosovo because he had a tiny therapy dog recommended by his doctors. Trump was then sued by the US Gov’t & the Veteran for discrimination—court docs/photo below. @VoteVets pic.twitter.com/HylwzCBLjE", "— Scott Dworkin (@funder) November 10, 2017", "A residential property bearing Trump's name in New York's Coney Island did try to evict Eugene Ovsishcher, an Afghanistan veteran, in 2012 because the housing complex had a no-dogs policy. Upon the advice of his doctors, Ovsishcher had obtained a service dog named Mickey, a Shih Tzu that helped him cope with post-traumatic stress disorder. Months later, the co-op board tried to evict Ovsishcher for having the dog, even though he possessed documentation from his doctors showing that the dog was a service animal.", "In January 2015, the U.S. Department of Housing and Urban Development (HUD) intervened, accusing Igor Olberman, who was at that time the president of the Trump Village co-op board, with violating the Fair Housing Act for failing to allow disabled residents to keep service animals. The resulting settlement reached between HUD and the co-op board noted that the housing complex was \"owned by shareholders, most of whom are residents of the building.\"", "The settlement stipulated that although Trump Village has since changed its policy and begun allowing residents to keep pets, it must allow reasonable accommodations for service animals should it ever revert to its previous policy and again disallow animals. Ovsishcher not only got to keep Mickey, he was also paid $15,000 by Trump Village as reimbursement for legal fees he incurred, according to the agreement.", "Thus the situation has not only been resolved, but it had nothing to do with Donald Trump. In 2015, the co-op board settled the case, allowing Ovsishcher to keep Mickey. And while the Trump Village complex where Ovsishcher lived may have been built by Donald Trump's father in 1964, the Trumps sold the property in 2003, long before dispute with Ovsishcher began. We are therefore labeling this claim \"False.\"", "Berger, Joseph. \"Taking His Doctor’s Advice Could Cost a Combat Veteran His Apartment.\"\r\n  The New York Times. 28 May 2012.", "Murphy, Doyle. \"HUD Enters Coney Island Dog Fight Between Vet and Trump Co-op.\"\r\n  [New York] Daily News. 10 January 2010.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]