["India’s farmers have been agitating against the centre’s new farm laws for nearly four months now. As part of the demonstrations, they held a tractor rally in the capital on January 26 where violence was reported after a group of protesters took a detour to the Red Fort. The Delhi police resorted to using lathi charge and fired tear gas bullets to disperse crowds. Several protestors were arrested, with the Delhi police later releasing the names of 122 people arrested in connection with the Republic Day violence.", "In the backdrop of this, a claim about the High Court ordering the release of the arrested farmers has been going viral. The viral Hindi message reads, “The Delhi High Court ordered the release of all the farmers arrested by the Delhi Police. Long live farmer unity, long live our food providers.” This post by Facebook user Pram Rasoda racked up more than 2,800 shares.", "Dozens of people have been circulating this post on Facebook as well.", "Alt News combed through recent news reports on the arrest of farm bill protesters. None of these mentioned orders for their release. The collective release of 122 detainees associated with the farmers’ movement would have undoubtedly garnered widespread media coverage. On the contrary, the Delhi High Court dismissed a petition on the release of the ‘illegally detained’ protesters. It also ordered the Delhi police to investigate the FIR as soon as possible. The High Court ruled that the arrested persons could not be released without entering into the merit of FIRs and investigation.", "We also reached out to Additional PRO Anil Mittal of the Delhi police who said that they have not received any such information.", "Thus, the viral claim about the Delhi High Court ordering the release of those arrested following the clashes at the Republic Day tractor rally is completely false.", "Donate Now", "A journalist and a dilettante person who always strives to learn new skills and meeting new people. Either sketching or working.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]