["On August 5, Bangalore Mirror tweeted an image of a cracked road while reporting that KSRTC has confirmed that all interstate bound toward Kolhapur, Maharashtra have been stopped at Nippani, Karnataka. This tweet went out at 11:44 pm and now stands deleted.", "About an hour prior to Bangalore Mirror’s tweet, at 10:52 pm, the identical image and words were tweeted by the media outlet’s Metro Editor, Sridhar Vivan. This tweet too stands deleted.", "The next day at 8:18 am, ANI tweeted the same picture of a cracked road claiming that it appeared on National Highway 4 near Nippani in Belagavi district, Karnataka (archive). It is noteworthy that Belagavi is experiencing flooding due to heavy rains.", "ANI’s tweet was picked up by Zee Salaam, Times of India and News9 minutes after it went live.", "Mirror Now also published the identical image claiming that a huge crack appeared on NH 4 due to heavy rains in Nipanni.", "Several users pointed out that the photograph was taken in Kasara on Mumbai-Nashik expressway and not in Nippani, Karnataka. Among them was one who highlighted a restaurant advertisement visible on a wall behind a policeman which said, “Green Land Pure Veg.” This is a restaurant in Igatpuri, Mumbai-Nashik Highway.", "It’s from Maharashtra pic.twitter.com/IVEaCQZnWB", "— 卂 几 ㄩ 尺 卂 Ꮆ Ҝ 卂 爪 卂 ㄥ (@Anuragkamal) August 6, 2019", "Photographs taken at the same spot but from a different angle were published by Zee News Hindi. In the image below, the same restaurant advertisement can be seen.", "The incident was also reported by Maharastra Times and ABP Majha.", "Several mainstream media outlets shared an image of a cracked road in Maharashtra as Karnataka. Alt News had recently published a report on Gujarati media broadcasting Maharashtra’s Hatnur dam as Vadodara’s Ajwa dam.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]