["About this rating", "In June 2018, the disreputable web site NY Evening News republished a quote ostensibly uttered by cinematic icon Clint Eastwood about how the star was \"leaving Hollywood\" because it was full of \"traitors and pedophilians\":", "This is not a genuine quote from Clint Eastwood, but rather a fabrication intended to attract the attention of alt-right conspiracy theorists by hitting on some of their favorite topics: Donald Trump, pedophilia, and Hollywood liberals.", "The NY Evening News (and other sites of its ilk) have pushed this fictitious quote before, as a verbatim copy of this \"article\" was posted to the same web site in March 2018. In both instances, the web site linked to the malware-infested BestUSAPoliticsNews.com.", "The NY Evening News claimed that Eastwood announced that he was \"leaving Hollywood\" during an appearance at the Cannes Film Festival for a 25th anniversary screening of his film Unforgiven:", "Actor Clint Eastwood Makes Massive Announcement:Hollywood Is The Place Of Traitors And Pedophilians,This Morning l’ve Decided To Leave This Awful Place And Fight Against Traitors With Reak American Patriots With President Trump.’Do You Stand With Clint? Legendary actor and film director Clint Eastwood told a crowd at the Cannes Film Festival Sunday that political correctness is killing the entertainment industry.The Western film icon,who was visiting the festival in southern France for a 25th anniversary screening of his 1992 film ‘Unforgiven,’said America’s obsession with political correctness started around the time of the release of his 1971 movie’Dirty Harry’ to The Hollywood Reporter.", "Eastwood did attend the Cannes Film Festival for the 25th anniversary of Unforgiven, but this event took place in May 2017. Furthermore, the referenced Hollywood Reporter article did not include any quotes from Eastwood about his leaving Hollywood or the film industry's being full of \"traitors\" or \"pedophilians\" [sic]. Rather, the actor talked about how political correctness has changed since he made the film Dirty Harry back in 1971:", "The Western film icon, who was visiting the festival in southern France for a 25th anniversary screening of his 1992 film “Unforgiven,” said America’s obsession with political correctness started around the time of the release of his 1971 movie “Dirty Harry,” according to The Hollywood Reporter.", "“It was far-out at that time, so I brought it to [director] Don [Siegel], and he liked it,” Mr. Eastwood said. “A lot of people thought it was politically incorrect. That was at the beginning of the era that we’re in now with political correctness. We are killing ourselves, we’ve lost our sense of humor. But I thought it was interesting and it was daring.”", "A number of conservative news outlets, such as the Washington Times, picked up on Eastwood's comments about political correctness. Again, however, those reports did not include any statements from Eastwood about pedophilia or Hollywood traitors.", "Furthermore, Eastwood has remained a regular Hollywood participant since this fictitious quote was first posted. He worked with Warner Bros. for the release of his 2018 film The 15:17 to Paris, and as of this writing is currently partnered with them for a new movie titled The Mule.", "In other words, Clint Eastwood has not turned his back on Hollywood.", "Kilday, Gregg.   \"Clint Eastwood Decries P.C. Culture in Cannes: \"We've Lost Our Sense of Humor.\"\r\n    Hollywood Reporter.   21 May 2017.", "Chasmar, Jessica.   \"Clint Eastwood: 'We Are Killing Ourselves' With Political Correctness.\"\r\n    The Washington Times.   22 May 2017.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]