["The photos, which show a charred structure and vandalized Hindu statue, were published on Facebook here on February 15, 2020. The post has been shared more than 5,400 times.", "Below is a screenshot of the misleading post:", "The post’s Hindi-language caption translates to English as: “This is the state of Hindu temples. Rohingya Muslims in Bengal are making the lives of Hindus very difficult. You have to think, Mamata Banerjee or Narendra Modi. Glory to India, glory to Hindutva.”", "The post names two prominent Indian politicians: Mamata Banerjee, the chief minister of West Bengal, and Narendra Modi, the Indian prime minister. It also references Hindutva, which is a far-right Hindu political movement advocating Hindu nationalism and the establishment of a Hindu state.", "The photos were also shared alongside similar claims on Facebook here, here and here; and on Twitter here and here.", "However, the claim is false.", "A reverse image search found that the photo of a defaced Hindu statue was published here on January 13, 2019, in an Indian news report about a vandalized temple in Jessore, a district in southwestern Bangladesh.", "The article notes that the “200-year old Temple is the pride of the community” and “was ransacked by a preparator named Yasin.” It also quotes Gobinda Chandra, the secretary-general of the National Hindu Grand Alliance Bangladesh, who confirmed and condemned the attack.", "Bangladesh police chief Tajul Islam confirmed to AFP on the telephone on March 17, 2020, about the incident.", "“The incident happened in 2019 in a village named Mahakal which is under Abhaynagar’s jurisdiction in Bangladesh,” he told AFP.", "The image of a charred structure was published here on December 28, 2018, in a report by bdnews24.com, a Bangladeshi news website, about an arson attack on homes that belonged to Hindus in Thakurgaon, a district in northwestern Bangladesh.", "One of the photo also has a watermark that says “bdnews24.com”.", "Below is a comparison of the photos in the misleading post (L) and the images published in the media reports (R):", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]