["About this rating", "Driven by a thriving retail industry, a cultural penchant for obligatory gift-giving, and a fascination with the West, the Japanese adopted (and adapted) several traditional Western holiday celebrations after World War II.  Stripped of their meaning and bent to the whims of retailers, however, these holidays have taken some rather unusual forms in Japan over the years.", "The Mary Chocolate Co. is credited with bringing Valentine's Day to Japan in 1958, with the twist that it should be a day for girls to give gifts to guys.  Naturally, this led to the retail industry's creation of \"White Day\" on March 14, an occasion for the boys to reciprocate all those chocolates they'd been given a month earlier by buying white presents (such as white candy, handkerchiefs, or panties) for their gals.  Likewise, the Seibu department store recast St. Patrick's Day as \"Green Day,\" a retail promotion featuring things green and Irish.  (It didn't work.)  The Japan Biscuit Association touted Halloween as an occasion that Americans celebrate by eating biscuits.  (When that failed to go over well, the custom melded into one of friends giving each other orange candy and cakes.)", "However, the Western holiday that carries the most influence in Japan is, not surprisingly, the holiday that carries the most influence in the West as well: Christmas.  Although St. Francis Xavier, a Spanish Jesuit missionary, brought Christianity to Japan in 1549, the celebration of Christmas was mostly limited to churches and missionary schools until the 20th century.  (Indeed, Christianity was outlawed in Japan after a religious uprising in 1639 and henceforth practiced only clandestinely until 1854.) The exchanging of gifts at Christmastime by Japanese families began in a small way early this century, and Japanese stores began offering Christmas sales in the 1930s. Starting with the American occupation of Japan in 1945, Christianity enjoyed a brief surge in popularity, and Christmas took off in a big (and commercialized) way.", "As you'd expect in a country where less than 2% of the population is Christian, Christmas is a primarily a secular occasion in Japan, with shops and businesses remaining open for the day. The Japanese have adopted many of the traditional trappings of 'Kurisumasu,' such as stores with elaborate displays of Christmas decorations and piped-in Christmas music, and homes made festive with Christmas lights, Christmas trees, and poinsettias.  The elimination of the religious aspects of Christmas and its hyper-commercialization have led to some unique (and, to us, bizarre) ways of celebrating it, however.", "The exchanging of kurisumasu cakes is not exactly a Western tradition, but it doesn't sound too unusual to us. What we do find unusual is reports of Japanese Christmas customs such as young couples exchanging presents of expensive jewelry, heading out to high-priced hotels, and being directed by scantily-clad female elves to rooms complete with Christmas trees, where the lovebirds spend their Christmas Eve in romantic bliss.  The co-optation of familiar Christmas figures, (both secular and religious) in the service of mass merchandising has also produced some rather curious blendings (real and imagined): Colonel Sanders dressed in a Santa suit (as KFC tried strenuously to promote fried chicken as the \"traditional\" Christmas meal), nuns singing advertising jingles to the tune of Christmas carols, Christmas cards featuring a ghoulish Santa in a graveyard accompanied by the Virgin Mary on broomstick, elves plastered on sake, and a Christmas revue featuring \"stripping nuns and three lecherous Wise Men.\" And sometimes they just don't get it at all, such as when a Japanese TV station reportedly ran the movie Merry Christmas, Mr. Lawrence,  a disturbing film about English soldiers in a Japanese POW camp, as its festive holiday offering.", "By far the most well known of these Japanese/Western holiday blendings is the notorious story of a department store somewhere in Japan that one year supposedly erected a prominent Christmas display featuring as its centerpiece the smiling figure Santa Claus nailed to a cross.  It's a perfect expression of the clash between the holy and the profane, the secular and the religious, the East and the West.  It speaks to xenophobic fears (these foreigners can't be trusted with our religion and our traditions!), and it's a darn funny story.", "Examples:", "A few Decembers ago a Japanese department store, desperate to appear westernised and with-it, mounted an extravagant Christmas display, featuring a life-sized Santa Claus, crucified upon a cross.1", "The granddaddy of cultural faux pas [in Japan] occurred just after World War II, when a Ginza department store rolled out its elaborate Christmas promotion: a smiling Santa nailed to a crucifix.2", "A Japanese department store reputedly once put up a big Christmas cartoon which had a Santa Claus prominently displayed on a crucifix. Whether or not this story, which has been doing the rounds in Tokyo for some years, is true or just another urban legend, is unclear.3", "[An American Motorola executive] recounted a famous story of 1945, the first year of the U.S. occupation of Japan after World War II, when shopkeepers in Tokyo's Ginza district knew there was a big Western holiday coming and they wanted to capitalize on it.", "\"They knew there was this guy in a white beard and a red suit, and they knew there was a religious angle,\" [he] said. \"And the result was little Santa Clauses on crucifixes.\"4", "A few years ago, in Kyoto, one department store filled its center window with an enormous effigy of a crucified Santa Claus.5", "However, despite all the people who assert that the tale of the crucified Santa is true and that they know someone who actually saw it, the literal truthfulness of this legend is suspect.  No one to our knowledge has produced evidence documenting that such a Christmas display was ever used commercially in Japan (other than as a knowing joke), such as a photograph of the scene or a contemporaneous news account that recorded its date and location.", "As well, in true urban legend fashion the details of where, when, and how the crucified Santa Claus was displayed are vague and vary from telling to telling:  Santa appeared on a cross in Kyoto, Tokyo, the Ginza district, or a specific department store (such as Mitsukoshi); he was represented with a gigantic figure, a life-sized display, several small characters, a billboard, or a cartoon drawing; and Santa was nailed to a cross in Japan in 1945 or 1962 or 1990 or anywhere between \"just after World War II\" to  \"a few years ago.\"", "As well, the mixing of Christian crucifixion iconography and Santa Claus is an unlikely pairing, even to non-Christians.  Nativity scenes, not crucifixes, are the religious displays featured at Christmastime, and anyone with the least bit of thoughtfulness would have to wonder why a smiling, happy, jolly figure would be depicted hanging from boards with nails driven through his hands and feet.  Santa Claus in a creche might be a plausible mistake (there are claims that figures such as the Seven Dwarfs have been spotted standing in for the Three Wise Men in various parts of the world), but a crucified Santa challenges credulity.  As parody it's believable; as an honest mistake we find it implausible.", "Perhaps the key to this legend is the timing.  Despite claims of crucified Santas in Japan that span the entire post-war era, the earliest reports of this legend we've found so far all stem from the early 1990s. Not coincidentally, up until that time Japan had been riding the economic high of their \"bubble economy,\" and Americans watched in dismay as the Japanese business model was widely touted as superior to the American, dire predictions were made about the dominance of the American (and world economy) by Japan, and asset-rich Japanese began snapping up foreign (especially American) real estate such as New York's Rockefeller Center.  Should we be surprised that a xenophobic legend involving a clash between Japan and one of the most hallowed aspects of Western culture might arise from such circumstances?", "Alternatively, we can ignore all the foreign trappings and simply interpret this legend as a commentary on the commercialization of Christmas, a holiday in which Jesus Christ has now been replaced (symbolically and literally) by Santa Claus.  This was the point artist Robert Cenedella was trying to make when he drew the ire of religious groups over his painting of a crucified Santa Claus, which was displayed in the window of New York's Art Students League in December 1997:", "Anderson, Walter Truett.   The Truth About the Truth.\r\n    New York: J P Tarcher, 1995.   ISBN 0-874-77801-8.", "Conry, Kieron.   \"A Time Not to Forget the Suffering Figure on the Cross.\"\r\n    The [London] Independent.   27 December 1994   (p. 15).", "Gaskell, John and Adam Hock.   \"Our Memories of Christmas Past Lost to Japanese.\"\r\n    The Sunday Telegraph.   6 January 1991   (p. 7).", "Healey, Phil and Rick Glanvill.   \"Urban Myths #67: Santa Sleighed.\"\r\n    The Guardian.   23 December 1993   (p. 43).", "McCarthy, Terry.   \"Christmastime for Everyone.\"\r\n    The [London] Independent.   19 December 1993   (p. 77).", "McKibben, Bill.   \"Christmas Unplugged.\"\r\n    Christianity Today.   9 December 1996   (p. 18).", "McQueen, Anjetta.   \"Artist's Crucified Santa Draws Fire.\"\r\n    Associated Press.   22 December 1997.", "Shweder, Richard.   \"Why Do Men Barbeque?\"\r\n    Daedalus.   Winter 1993.", "Sullivan, Kevin.   \"Dashing Through the Dough.\"\r\n    The Washington Post.   22 December 1995   (p. A21).", "Watanabe, Teresa.   \"Japanese Parade for St. Patrick, Whoever He Was.\"\r\n    Los Angeles Times.   16 March 1993   (p. 6).", "Yates, Ronald E.   \"Japanese Merrily Leave the Christ out of 'Kurisumasu.'\"\r\n    Chicago Tribune.   22 December 1985   (p. 16).", "The Buffalo News.   \"Buffalo's Favorite Santa Stories.\"\r\n    24 December 1995   (p. M8).", "The Economist.   \"Santa Christ.\"\r\n    25 December 1993   (p. 77).", "Financial Times.   \"A Cultural Clash of Symbols.\"\r\n    27 December 1984   (p. 8).", "Fortean Times.   \"Strange Days.\"\r\n    December 1994   (p. 5).", "The Hartford Courant.   \"Santa on a Cross.\"\r\n      23 December 1997   (p. F2).", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]