["The two images of Indonesian corruption investigator Novel Baswedan were posted on November 7, 2019, on Facebook here.", "Below is a screenshot of one of the misleading posts:", "The Indonesian-language caption translates to English as: \n\t“All Indonesians are deceived. \n\tHumans sometimes forget.. \n\tThat contact lens is sometimes put on the left, sometimes on the right.. \n\tSorry I just want to make a reminder sir.. ?? \n\t#AllIndonesiansAreDeceived.”", "Novel is a senior investigator at the Indonesian Corruption Eradication Commission. In April 2017, he was attacked with acid, leaving him partially blind. The police have not identified a suspect. A fact-finding task-force formed by president Joko “Jokowi” Widodo concluded the attack was related to Novel's work as a graft buster. Here is an AFP story on the investigation.", "More recently, a politician accused Novel of faking his eye injury and reported him to the police.", "The two photos were also shared alongside a similar claim on Facebook here and here; and on Twitter here, here and here.", "But the claim is false; one of the images has been flipped.", "Google keywords searches for the first image that shows Novel’s damaged right eye found this April 18, 2018, photo published on the website of Indonesian news portal Liputan6.com.", "Below is a screenshot of the Liputan 6 photo:", "Translated to English, the caption of the photo reads: “Corruption Eradication Commission senior investigator Novel Baswedan when he was at the commission’s office, Jakarta, Thursday (22/2). Novel Baswedan was previously splashed with acid after he joined a mass prayer at dawn on April 11, 2017. (Liputan6.com/Herman Zakharia).”", "Below is a screenshot comparison between the first photo in the misleading post (L) and Liputan 6 photo (R); AFP has cropped the original image to match the size of the misleading photo.", "Below is a screenshot comparison between the first misleading image (L) and the reversed version of Liputan 6 photo (R):", "The misleading image has an additional small red color on the bottom left corner. Image noise analysis using image forensic tool 29a.ch reveals an uneven texture of noise on the bottom-left corner bordered by a turquoise blue line.", "Below is a screenshot showing the noise analysis result of the misleading image; AFP has put a red arrow to point to the anomaly in the bottom-left corner.", "Google keyword searches for the second image showing Novel wearing a cap found the image is part of this October 18, 2019, video posted on the official YouTube channel of Indonesian broadcaster Kompas TV.", "The headline of the two-minute, 20-second video translates to English as: “Novel Baswedan’s case, the advocacy team sends a letter to the president.”", "At 1:39 mark, the video shows the same image seen in the second picture of the misleading posts.", "Below is a screenshot showing Novel at the 1:39 mark of the video:", "Below is a screenshot comparison between the second image in the misleading post (L) and a scene in the Kompas TV video (R):", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]