["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Wind turbines are shown on July 29, 2020, near Sweetwater, Texas. (AP/Gutierrez)", "Fox Nation host Lara Logan provided no evidence that frozen wind turbines in Texas were being sprayed with oil by helicopters.", "RWE Renewables Americas, which operates several wind farms in Texas, said it wasn’t using any de-icing agents on its wind turbines.", "Logan’s claim resembled online rumors that wrongly claimed a viral photo showed a helicopter spraying chemicals on a wind turbine in Texas. In reality, the image showed a helicopter spraying hot water. It was taken years ago in Sweden.", "As Fox News broadcasters pushed the misleading narrative that frozen wind turbines were to blame for Texas’ crippled energy system, Fox Nation host Lara Logan suggested that fossil fuels were coming to the rescue. Helicopters, she claimed, were spraying turbines with oil to defrost them.", "\"The reality is here that you’re flying helicopters, using fossil fuels, to put oil on wind turbines to defrost them,\" Logan said Feb. 19 on the Fox News program \"Outnumbered.\"", "Logan’s claim echoed online rumors, widely debunked, that claimed a photo showed a helicopter spraying chemicals on a frozen wind turbine in Texas.", "\"Oh the irony,\" said one of many Facebook posts sharing the photo. The post featured a screenshot of a tweet that read: \"A helicopter running on fossil fuel spraying a chemical made from fossil fuels onto a wind turbine made with fossils fuels during an ice storm is awesome.\"", "The photo, from years ago, actually shows a helicopter defrosting a turbine with hot water in Sweden. \"This is our helicopter back in 2015,\" Mats Widgren of Alpine Helicopters, the Swedish company responsible for the photo, told the Associated Press.", "The same photo appeared in Swedish news articles from that year, and also in two separate Alpine Helicopters presentations on airborne de-icing methods for wind turbines. The Swedish company heated the water with an oil burner, but it did not spray chemicals.", "Despite those facts, social media posts claiming the photo showed Texas spread widely. They were flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "A viral tweet wrongly claimed that an image showed a helicopter spraying chemicals on a frozen wind turbine in Texas.", "Logan did not cite any evidence to support her own claim, which asserted more broadly that helicopters were being flown in Texas to defrost ice-coated wind turbines with oil. But PolitiFact found no proof that such a practice was taking place in Texas.", "Fox News did not offer comment for this fact-check.", "A spokesperson for the Electric Reliability Council of Texas, which manages more than 90% of the state’s electric load, said she had not heard of such rumors until PolitiFact reached out.", "While frozen wind turbine blades can be manually de-iced, the extreme weather would have made it difficult to do so in Texas, where several airports were closed during the storm, said Jim Krane, an energy studies fellow at Rice University’s Baker Institute.", "\"No one I’ve asked in the Texas wind industry has heard of any aircraft de-icing of wind turbine blades,\" said Krane, who recently wrote about the need to winterize Texas’ energy system.", "\"Most wind turbines here don’t have any de-icing equipment, since it’s rare to have need for them here,\" added Daniel Cohan, an associate professor in civil and environmental engineering at Rice University, and a colleague of Krane’s.", "RWE Renewables Americas operates more than a dozen wind farms in Texas. Its Roscoe Wind Farm, a few hours west of Fort Worth, has more than 600 turbines.", "The company said Feb. 18 that icing and grid issues put part of its onshore wind fleet out of service. But spokesperson Matt Tulis denied using helicopters in the way Logan described.", "\"We are not using helicopters to spray oil on our turbines to defrost them,\" Tulis told PolitiFact. \"We don’t apply any kind of de-icing agent to the turbine or turbine blades.\"", "Turbines in places that regularly see low temperatures are often designed to withstand the cold. Some have ice-resistant coatings or heaters built into the blades.", "Those technologies used elsewhere in the world allow wind turbines to produce electricity at temperatures as low as 22 degrees below zero, Krane and his colleagues at the Baker Institute wrote for Forbes. But they make turbines pricier.", "Manual de-icing, which can be done by aircraft-based sprayers or by technicians who climb up the turbine towers, can involve chemicals, Krane and his team wrote in the article.", "After a rare blast of Arctic air hit Texas, Fox News hosts repeatedly claimed that frozen wind turbines were solely or mostly to blame for the power outages around the state. But experts and state energy officials said early on that the crisis was largely due to problems at thermal power plants, including those powered by natural gas.", "\"Wind’s failure was a small part of the overall Texas blackout,\" Krane said.", "Krane told PolitiFact that it shouldn’t be unexpected for renewable energy sources to rely on fossil fuels, which remain the main source of energy in the U.S.", "\"Avoiding their use, even in renewable power generation, is impossible,\" Krane said.", "Logan said, \"The reality is here (in Texas) that you’re flying helicopters using fossil fuels to put oil on wind turbines to defrost them.\"", "Logan’s claim resembled debunked claims that said an image showed a helicopter spraying chemicals on a wind turbine in Texas. The image was actually taken years ago in Sweden.", "Aircraft-based sprays are one way to manually defrost turbines that haven’t been winterized, but experts we consulted said they hadn’t heard of that practice being used in Texas. One company that runs several wind farms in Texas said it isn’t using helicopters to spray oil on its turbines.", "The burden of proof is on the speaker, and Logan provided none. We rate her claim False.", "Fox News, \"Outnumbered,\" Feb. 19, 2021", "Facebook posts, Feb. 16, 2021", "Various Google and Nexis searches, Feb. 24, 2021", "RWE website, accessed Feb. 24, 2021", "Forbes, \"Winterization And The Texas Blackout: Fail To Prepare? Prepare To Fail,\" Feb. 19, 2021", "AFP Fact Check, \"Photo shows helicopter de-icing wind turbine in Sweden, not Texas,\" Feb. 19, 2021", "USA Today, \"Fact check: Meme of wind turbine being de-iced includes 2015 image from Sweden,\" Feb. 18, 2021", "The Dispatch, \"Did a Helicopter Use Petroleum-Based Chemicals to De-Ice a Texas Wind Turbine?\" Feb. 18, 2021", "Bloomberg Law, \"Wind Farms Aren’t All Ready for Icing Amid Changing Climate,\" Feb. 18, 2021", "RWE, \"Extreme weather conditions harm RWE’s renewables electricity generation in the US state of Texas,\" Feb. 18, 2021", "The Associated Press, \"Photo does not show a helicopter de-icing a wind turbine in Texas,\" Feb. 17, 2021", "Climate Feedback, \"Viral photo of a helicopter de-icing a wind turbine is from Sweden, not Texas; current power outages in Texas are due to multiple fuel types going offline,\" Feb. 17, 2021", "Reuters, \"Fact check: Image of helicopter de-icing a wind turbine comes from Sweden, not Texas,\" Feb. 17, 2021", "Lead Stories, \"Fact Check: Helicopter Is NOT Spraying A Chemical Made Of Fossil Fuel On Wind Turbine- It's Hot Water,\" Feb. 16, 2021", "Newsweek, \"Fact Check: Is Texas Using Helicopters With Chemicals to De-Ice Frozen Wind Turbines?\" Feb. 16, 2021", "Gizmodo, \"Viral Image Claiming to Show a Helicopter De-Icing Texas Wind Turbines Is From Winter 2014 in Sweden,\" Feb. 16, 2021", "Luke Legate on Twitter, Feb. 14, 2021", "PolitiFact, \"How Fox News, far-right TV blamed green energy for Texas’ power outages,\" Feb. 19, 2021", "PolitiFact, \"Tucker Carlson falsely blames Green New Deal, wind energy for Texas power outage,\" Feb. 17, 2021", "PolitiFact, \"Natural gas, not wind turbines, main driver of Texas power shortage,\" Feb. 16, 2021", "Email interview with Daniel Cohan, associate professor in civil and environmental engineering at Rice University, Feb. 22, 2021", "Email interview with Jim Krane, the Wallace S. Wilson Fellow for Energy Studies at Rice University’s Baker Institute, Feb. 22, 2021", "Email interview with Leslie Sopko, communications manager for the Electric Reliability Council of Texas, Feb. 22, 2021", "Email interview with Matt Tulis, communications manager for RWE Renewables Americas, Feb. 22, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]