["In the backdrop of the uproar against the alleged gang-rape of a Dalit woman in Uttar Pradesh’s Hathras, a CCTV footage of a woman being kidnapped in broad daylight is viral with the claim that the incident took place in Uttar Pradesh. In the video, two women are seen walking when a white Innova stops and a man pulls one of them into the car. As per social media claims, the incident took place in UP.", "उत्तर प्रदेश में दिनदहाड़े बेटियों को उठाया जा रहा है अंधभक्त अभी भी आंखों पर पट्टी चढ़ाए हैं#मीडिया_योगी_का_इस्तीफा_माँगो pic.twitter.com/5x01VOkA43", "— शबीना बानो (@ShabinaBano_) October 4, 2020", "The video is viral on Facebook ( 1, 2, 3 ) and Twitter (1, 2, 3).", "A video of the CCTV footage playing on television was shot on camera. In the background, people can be heard speaking in Kannada. Taking this as a clue, we performed a keyword search and found multiple reports of this incident from Kolar district, Karnataka in August 2020. The same was reported by The News Minute (TNM) with the headline, “Karnataka man kidnaps woman in broad daylight for refusing marriage, caught on CCTV.”", "Karnataka man kidnaps woman in broad daylight for refusing marriage, caught on CCTVhttps://t.co/JrABexHFYs", "— The News Minute (@thenewsminute) August 15, 2020", "According to a statement by Kolar Superintendent of Police to TNM, the woman was kidnapped and kept in a lodge in Tumkur district where the kidnapper tried to convince her to marry him. “Around 10 am, we tracked the kidnappers after we chased them on foot. While the woman was rescued and is being brought back to Kolar, the kidnappers escaped,” said SP Karthik Reddy.", "According to the report, the woman was reunited with her family on August 14 while the police was still searching for the accused persons.", "It is clear that an incident from Karnataka is being shared with a false caption to portray lawlessness in Uttar Pradesh.", "Donate Now", "Co-founder, Alt News Co-Founder Alt News, I can be reached via Twitter at https://twitter.com/zoo_bear", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]