["The false claim was published here in a Facebook post on December 6. It has been shared more than 500 times.", "The text superimposed on the image in the misleading post reads: “China produces 90 percent of the world’s carbon emissions pollution! They didn’t go to China because it’s already a communist country!”", "The image also features Greta Thunberg, the Swedish teenage climate activist, and billionaire American financier George Soros.", "A speech bubble next to Thunberg reads: “Why are we not going to China?” In a second speech bubble, Soros appears to say “Shut up and stick to the script!”", "Below is a screenshot of the misleading post:", "Posts with a similar claim have been published on Facebook here and here.", "The claim is false; while China's carbon emissions were the highest of any country in the world in 2018, its share of total global emissions was estimated to be 29.7 percent -- not 90 percent.", "The data was compiled by the Emissions Database for Global Atmospheric Research, a joint project of the European Commission and the Netherlands Environmental Assessment Agency. It has published data on carbon dioxide emissions since 1970.", "According to the organisation’s most recent report, China topped a table of carbon emissions worldwide, contributing 29.7 percent of all global emissions in 2018, followed by the United States (13.9 percent), the European Union (9.1 percent) and India (6.9 percent).", "Below is a screenshot of the table, which appears on page 12 of the report:", "Below is an interactive map produced by UK-based scientific publication Our World in Data which shows the changes to annual carbon emissions by country from 1751 to 2017. The map uses data from the Global Carbon Project and the Carbon Dioxide Information Analysis Center.", "AFP Fact Check has also debunked several claims involving Greta Thunberg here. One of which includes a doctored photo here of her and Soros, who is also a regular target for conspiracy theories.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]