["About this rating", "The U.S. federal government shutdown, which entered its 21st day on 11 January 2019, had a significant negative impact on one institution of American life in particular: the national parks.", "With staff cut back to a minimum, monuments, forests, and wilderness areas around the country saw a buildup of trash and human waste, and volunteer groups were required to intervene in an effort to perform whatever maintenance and cleaning they could.", "In January, it was widely reported that three deaths had occurred in national parks during the shutdown, although it's not at all clear that those deaths would have been prevented if the parks in question had been fully staffed.", "On 10 January, \"The Other 98%\" Facebook page linked vandalism at the iconic Joshua Tree National Park in California to a lack of staff caused by the ongoing shutdown: \"During the shutdown, with Joshua Tree National Park open but no staff on duty, visitors cut down Joshua trees so they could drive into sensitive areas where vehicles are banned. The destroyed trees are irreplaceable; they take sixty years to mature and live for more than 500 years.\"", "The key claim in the widely-shared meme, that staffing shortages contributed to the destruction of some of the iconic eponymous Yucca brevifolia trees at Joshua Tree National Park, is accurate, according to facts confirmed and descriptions provided by park management. Although it wasn't correct to say that \"no staff\" were on duty during the shutdown, staff numbers were very heavily diminished.", "On 8 January, the National Park Service (NPS) announced that they would be temporarily closing Joshua Tree \"to allow park staff to address sanitation, safety, and resource protection issues in the park that have arisen during the lapse in appropriations\":", "Park officials are identifying the additional staff and resources needed to address immediate maintenance and sanitation issues and will utilize funds from the park fees to address those issues per the recently updated National Park Service contingency plan during a lapse in appropriations.", "While the vast majority of those who visit Joshua Tree National Park do so in a responsible manner, there have been incidents of new roads being created by motorists and the destruction of Joshua trees in recent days that have precipitated the closure. Law enforcement rangers will continue to patrol the park and enforce the closure until park staff complete the necessary cleanup and park protection measures.", "In an interview with the National Parks Traveller website (which published a photograph of one of the downed trees), Joshua Tree National Park Superintendent David Smith gave further details on the vandalism perpetrated in the park in early January:", "\"There are about a dozen instances of extensive vehicle traffic off roads and in some cases into wilderness,\" Smith replied when asked about the damage in the park. \"We have two new roads that were created inside the park. We had destruction of government property with the cutting of chains and locks for people to access campgrounds. We’ve never seen this level of out-of-bounds camping. Every day use area was occupied every evening. Joshua trees were actually cut down in order to make new roads.”", "According to National Parks Traveller, Smith also drew a clear connection between the significant cut in staff numbers during the shutdown and the ability of park staff to monitor visitor behavior and prevent the kind of damage seen in recent days:", "Monitoring a park the size of Joshua Tree, which covers 1,235 square miles and has about 20 different entrances due to dirt roads that ring the park, is extremely difficult with just eight law enforcement rangers. Were it not for the shutdown, there would have been more than 100 other \"sets of eyes\" to help keep an eye on visitor behavior, the superintendent said.", "\"We have 120 employees in the park, plus 30 associates that work for Great Basin Institute, the majority of whom are in the park every day,\" he said. \"Those are the folks that are in the campgrounds and in the day-use areas and doing science. So you’ve got 100 sets of eyes in the park every day with folks contacting visitors.\"", "The following day, 9 January, the National Park Service announced a reversal of the decision to temporarily close Joshua Tree, writing that management, acting on a controversial directive from acting Interior Secretary David Bernhardt, would use funds derived from visitor fees in order to bring back the staff needed to keep the park open:", "By immediately utilizing revenue generated by recreation fees, National Park Service officials have been able to avert a temporary closure of Joshua Tree National Park that had been previously scheduled for January 10. In addition, recently closed areas of the park will once again be accessible to visitors starting January 10. Some visitor services, including campgrounds and entrance stations, will reopen utilizing recreation fee revenue.", "National Park Service officials have determined that by using Federal Land and Recreation Enhancement funds to immediately bring back park maintenance crews to address sanitation issues, the park will be able to maintain some visitor services, including reopening the campgrounds.", "Crucially, the announcement again drew a direct link between diminished staff numbers caused by the government shutdown, and the earlier destruction of trees at Joshua Tree National Park:", "The park will also bring on additional staff to ensure the protection of park resources and mitigate some of the damage that has occurred during the lapse of appropriations. [Emphasis added.]", "O'Reilly, Andrew.   \"National Parks Grapple with Overflowing Trash and Human Waste as Shutdown Drags On.\"\r\n    Fox News. nbsp; 10 January 2019.", "Porter, Tom.   \"Shutdown: Three People Die as National Parks Left Largely Unpatrolled.\"\r\n    Newsweek.   6 January 2019.", "Davis, Zuri.   \"Don't Tie Tragic National Park Deaths to the Government Shutdown.\"\r\n    Reason.   8 January 2019.", "National Park Service.   \"Joshua Tree National Park to Temporarily Close for Cleanup and Repair.\"\r\n    8 January 2019.", "Repanshek, Kurt.   \"Joshua Tree National Park to Close for Cleanup, Repairs to Vandalism, Illegal Roads.\"\r\n    National Parks Traveller.   8 January 2019.", "National Park Service.   \"Joshua Tree National Park to Remain Accessible.\"\r\n    9 January 2019.", "Cama, Timothy and Miranda Green.   \"Dems Question Legality of Park Fees During Shutdown.\"\r\n     The Hill.   8 January 2019.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]