["U.S. Sen. Ron Johnson, a Wisconsin Republican, is being challenged by former U.S. Sen. Russ Feingold, a Democrat.", "In the race for the U.S. Senate, a new TV ad from challenger Russ Feingold claims that U.S. Sen. Ron Johnson, the Republican incumbent, \"voted five times for tax breaks that help companies ship Wisconsin jobs overseas.\"", "When it comes to attacks on Republican officeholders, this claim is not new.", "In 2014, PolitiFact National wrote: \"Democrats and their advocates have washed, rinsed and are now repeating one of their favorite talking points from 2012: that ‘(Insert Republican Here) supports tax breaks for corporations that ship jobs overseas.’ \"", "The piece called the description \"so simplistic as to be misleading,\" adding there is no specific tax break for sending jobs to other countries.", "OK, 2012 … 2014 … 2016 … we’re sensing a trend here.", "Let’s take a look at how Feingold’s claim fares on the Truth-O-Meter.", "Bring Jobs Home Act", "The Feingold campaign cited five votes by Johnson, two of which were on what was termed the Bring Jobs Home Act, which would have given companies credit for bringing jobs to the United States and denied existing deductions associated with moving a business outside the country.", "Those two votes were specifically addressed in a 2014 factcheck involving a claim against U.S. Sen. Mitch McConnell, R-Kentucky.", "The claim in the 2014 piece was that McConnell voted \"three times for corporate tax breaks that send Kentucky jobs overseas.\"", "Feingold’s campaign emphasized that the claim in their ad was that Johnson voted five times for tax breaks that help companies ship jobs overseas, not that corporate tax breaks by themselves are responsible for sending jobs outside the U.S.", "\"Like that PolitiFact notes, McConnell voted against denying deductions for costs associated with outsourcing,\" Feingold spokesman Michael Tyler said in an email to PolitiFact. \"That helps a company attempting to ship its jobs elsewhere.\"", "But the earlier item noted: \"The tax breaks that the law would have stopped are actually standard business expense deductions. Companies can write off many business-related expenses as tax-deductible -- including relocation. But this isn’t a special provision just for businesses that move outside of the United States. A business would get the same deductions for money spent moving from New York to California.\"", "Tax experts said there is very little money associated with these standard deductions and \"getting rid of deductions for business expenses associated with outsourcing would not be nearly enough to affect a company’s decision to engage in foreign activity.\"", "The legislation was proposed in 2012 and 2014 and Johnson voted \"no\" on procedural measures in each case, functionally voting to block the legislation from moving forward. The measures failed on procedural votes.", "The legislation itself was \"almost entirely symbolic,\" PolitiFact reported.", "Three votes on budget amendments", "Now let’s turn to the other three votes, taken in March 2015 and cited by the Feingold campaign, this time on amendments to Congress’ concurrent budget resolution for fiscal year 2016.", "Two were proposed by Democrats and a third was proposed by Vermont Sen. Bernie Sanders, an Independent who ran as a Democrat in the 2016 presidential race. The amendments were opposed by Republicans, with the two Independents voting with the Democrats.", "-- Amendment 817 statement of purpose: \"To establish a deficit-neutral reserve fund to provide tax benefits to patriot employers that invest in American jobs and provide fair pay and benefits to workers and to eliminate tax benefits for corporations that ship jobs overseas.\"", "-- Amendment 523 statement of purpose: \"To prevent United States companies from getting tax benefits for moving jobs overseas, to end offshore tax loopholes including inversions, and to provide incentives for United States companies to relocate overseas jobs to the United States.\"", "-- Amendment 323 statement of purpose: \"To create millions of middle class jobs by investing in our nation's infrastructure paid for by raising revenue through closing loopholes in the corporate and international tax system.\"", "USA TODAY reported that amendment 323 targets \"tax loopholes\" that \"let corporations and wealthy Americans shift jobs and profits overseas.\"", "But experts we spoke with said these votes had no practical effect.", "Congress’ concurrent budget resolution does not have the force of law and it would not be the place to change the tax code, said Steve Ellis, vice president of Taxpayers for Common Sense.", "\"To me those are just sort of messaging -- they were all very much of a partisan vote,\" Ellis said.", "He added: \"You can argue, well, he voted against whatever the message that the member, the Senator, was trying to get across, but I wouldn't necessarily say that was voting for tax breaks that help companies ship Wisconsin jobs overseas because if he had voted for it, it wouldn’t have had any effect and voting against it didn’t have any effect.\"", "In addition, he said, tax reform would have to originate in the House, and it would be dealt with by the Senate Committee on Finance and the House Committee on Ways and Means -- not on the floor of the Senate in a budget resolution.", "In an email, Johnson’s campaign said the senator’s position is that \"we should scrap the tax code, rather than favor any single deduction.\"", "Our rating", "Feingold’s campaign ad said Johnson \"voted five times for tax breaks that help companies ship Wisconsin jobs overseas.\"", "By voting against the Bring Jobs Home Act, Feingold is correct that Johnson voted against denying deductions associated with moving a business out of the country. But, as the 2014 PolitiFact notes, the law was mostly symbolic and these aren’t deductions specifically for moving jobs elsewhere, which is how the statement could easily be interpreted.", "The amendments to the budget resolution on which he voted had no practical effect, experts told us.", "We rate this claim False.", "YouTube, Russ Feingold campaign ad \"Truth,\" June 14, 2016", "Milwaukee Journal Sentinel, Feingold launches attack ad against Johnson, June 14, 2016", "Feingold campaign ad research, received via email July 6, 2016", "Email, Russ Feingold campaign spokesman Michael Tyler, Aug. 18, 2016", "Emails, Ron Johnson campaign spokesman Will Allison, Aug. 3 and Aug. 5, 2016", "PolitiFact National, \"Is there a corporate tax break that ships jobs overseas?\", Sept. 16, 2014", "PolitiFact National, \"Alison Lundergan Grimes ad says Mitch McConnell voted for corporate tax breaks for outsourcing,\" Sept. 12th, 2014", "GovTrack, S. 2569 (113th): Bring Jobs Home Act, accessed July, August 2016", "Senate.gov, 2012 Bring Jobs Home Act, accessed July, August 2016", "Senate.gov, 2014 Bring Jobs Home Act, accessed July, August 2016", "Congress.gov, Congress’ concurrent budget resolution for fiscal year 2016, accessed July, August 2016", "Senate.gov, S.Amdt. 817 to S.Con.Res. 11, accessed July, August 2016", "Congress.gov, S.Amdt. 817 to S.Con.Res. 11, accessed July, August 2016", "Senate.gov, S.Amdt. 523 to S.Con.Res. 11, accessed July, August 2016", "Congress.gov, S.Amdt. 523 to S.Con.Res. 11, accessed July, August 2016", "Senate.gov, S.Amdt. 323 to S.Con.Res. 11, accessed July, August 2016", "Congress.gov, S.Amdt. 323 to S.Con.Res. 11, accessed July, August 2016", "U.S. Sen. Dick Durbin press release, Durbin, Brown, Reed Introduce Budget Amendment To Reward Companies That Invest In American Workers, March 25, 2015", "USA Today, GOP blocks Sanders' proposal to close tax loophole, March 24, 2015", "The Hill, Senate Republicans block bill to end tax breaks for outsourcing, July 30, 2014", "The Hill, GOP senators block Dem ‘insourcing’ bill, July 19, 2012", "CNN Politics, GOP senators block top Obama jobs initiative, July 19, 2012", "Congressional Research Service, Introduction to the Federal Budget Process, Dec. 3, 2012", "U.S. Department of the Treasury, Writing and Enacting Tax Legislation, accessed Aug. 12, 2016", "Phone interview, Tax Policy Center fellow Roberton Williams, Aug. 9, 2016", "Phone interview, Taxpayers for Common Sense Vice President Steve Ellis, Aug. 10, 2016", "Phone interview, University of Wisconsin-Madison political science professor Barry Burden, Aug. 4, 2016", "Phone interview, George Washington University political science professor Sarah Binder, Aug. 5, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]