["Sen. Joe Manchin, D-W.Va., talks with reporters as he walks on Capitol Hill, Sept. 24, 2018. (AP/Alex Brandon)", "Patrick Morrisey, the Republican candidate seeking to oust U.S. Sen. Joe Manchin, D-W.Va., is attacking Manchin for not being a big enough advocate for gun rights.", "In the Sept. 7 tweet, Morrisey said, \"Joe Manchin has a \"D\" rating from the NRA, and fought alongside Obama and Schumer for anti-gun legislation.\" The NRA is the National Rifle Association, the nation’s largest gun-rights group, while Obama is former President Barack Obama and Schumer is Senate Minority Leader Chuck Schumer, D-N.Y.", "Joe Manchin has a \"D\" rating from the NRA, and fought alongside Obama and Schumer for anti-gun legislation. Lying liberal Joe abandoned our Second Amendment values and disrespected West Virginia gun owners. #WVsen pic.twitter.com/jvmf9IOJV4", "Here, we’ll focus on the NRA rating for Manchin.", "In a news release, the NRA said Manchin has earned a D rating from the group this year. In the same news release, the group said it was endorsing Morrisey and airing ads on his behalf in the Charleston and Bluefield markets.", "\"Contrary to what Joe Manchin says in West Virginia, he has supported the agenda of Barack Obama and Chuck Schumer by voting in favor of gun control in Washington, D.C.,\" said Chris Cox, chairman of the NRA Political Victory Fund.", "So it’s clear that the NRA has given Manchin a D rating this year. But the group hasn’t always been so negative about Manchin -- something the ad glosses over.", "In 2004, when Manchin was running for governor, he received an \"A+\" rating from the NRA and received the group’s endorsement when running for governor.", "And in 2010 and 2012, when Manchin was running for a U.S. Senate seat, he was endorsed by the NRA and received an \"A\" rating.", "\"Joe Manchin is committed to protecting the Right to Keep and Bear Arms guaranteed to all Americans,\" Cox wrote in 2012.", "Manchin’s relations with the NRA soured in 2013 after he and Sen. Pat Toomey, R-Pa., proposed legislation that would have enacted tighter background checks for certain gun purchases.", "The NRA Political Victory Fund website doesn’t allow for searches of past ratings, although it once did, the Washington Post reported in June 2018.", "Asked by the Post for the rationale for removing past grades, Jennifer Baker, an NRA spokeswoman, said, \"I don’t understand — why are you asking? What does it matter to you? The grades are not relevant after the election.\"", "Morrisey tweeted that \"Joe Manchin has a ‘D’ rating from the NRA.\"", "That’s certainly the case for 2018, and the NRA has endorsed Morrisey over Manchin this year.", "But this ignores that in previous campaigns, Manchin received ‘A’ and ‘A+’ ratings from the NRA and won the group’s endorsement those years.", "The statement is accurate but needs additional information, so we rate it Mostly True.", "Patrick Morrisey, tweet, Sept. 7, 2018", "NRA Political Victory Fund, \"NRA Launches Ad Campaign Against Manchin,\" Sept, 5, 2018", "NRA Political Victory Fund, \"NRA-PVF Endorses Joe Manchin for U.S. Senate in West Virginia,\" Oct. 2, 2012.", "NRA Political Victory Fund, \"NRA-PVF Endorses Joe Manchin for U.S. Senate in West Virginia,\" Sept. 23, 2010", "NRA Political Victory Fund, \"NRA-PVF Endorses Manchin for Governor,\" Oct. 22, 2004", "Washington Post, \"The NRA appears to pull old lawmaker grades from its website,\" June 12, 2018", "PolitiFact, \"A summary of the Manchin-Toomey gun proposal,\" Apr. 30, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]