["By Lori Robertson", "Posted on April 20, 2018", "Three weeks after the Trump administration imposed a 30 percent tariff on imported solar energy cells and panels, the president claimed that “a lot of places are opening up” to “make solar panels again.” Two weeks later, he said that “we’re opening up at least five plants,” and by mid-April, the number had grown to “seven or eight.”", "But solar energy experts told us they knew of just one new announced facility since the tariffs were implemented.", "We asked the White House press office for a list of the “seven or eight” plants, but we have not received a response. We will update this article if we do.", "“As of now we only have a definitive announcement for one new solar manufacturing facilities since the tariffs were introduced. And even that one is now planned to be smaller than originally intended,” Shayle Kann, a nonresident fellow at Columbia University’s Center on Global Energy Policy, told us.", "JinkoSolar, a Chinese company, announced on Jan. 29 that it would finalize plans for a manufacturing facility in the U.S. It will be in Jacksonville, Florida, and create 200 jobs, the company said in late March. That’s the only new post-tariff facility that the Solar Energy Industries Association was aware of as well.", "It’s unclear what Trump may be including in his count of solar plants. Both Kann and SEIA told us some U.S. manufacturers had announced or discussed plans to expand capacity. “But to my knowledge, none of those plans are definitive at this point,” said Kann, who is also the senior vice president of research and strategy at Energy Impact Partners, a sustainable energy investment firm.", "Also, SunPower, a solar systems and technology company that imports its solar panels, announced on April 18 that it would buy SolarWorld Americas, one of the companies that had petitioned the International Trade Commission for the tariffs.", "Trump made his most recent comments on April 18 at a joint press conference with Japanese Prime Minister Shinzo Abe. As we said, they come after Trump put the number of new solar plants at “at least five” on Feb. 26 and the more general “a lot” on Feb. 13.", "Trump, April 18: If you look at what we did with solar panels, where we put 30 percent tariffs on, we had 32 companies opened with pretty new plants, because it’s a relatively new industry. Of the 32 plants, 30 were closed and 2 were not doing well. Since putting the tariffs on, the two are doing very well, seven or eight are going to be opening, and a lot more will open.", "SEIA, a national trade association, opposed the tariffs, arguing that they would stunt demand and hurt U.S. installers and manufacturers in the industry that made products other than the solar panels themselves.", "Abigail Ross Hopper, SEIA’s president and CEO, said in a statement in response to Trump’s remarks: “The President was apparently misinformed about the number of plants that had been operating, the number that are going to be newly built and the status of the plants of the two petitioners.” (SEIA also disputes the president’s claim that 30 solar panel plants had closed before the tariffs, arguing that some made other products or didn’t close because of imports.)", "Greentech Media, which is part of the market analysis firm Wood Mackenzie, wrote in January that there were 14 “crystalline-silicon cell and/or module manufacturers in the U.S.” All of those companies would “theoretically” benefit from the tariffs, Greentech Media wrote, though “it’s not clear that all of these companies have active factories in the U.S. with the ability to reach any kind of scale.”", "Suniva and SolarWorld Americas are the two companies that pushed for the tariffs. They argued that cheap imports were hurting their businesses in a 2017 petition to the International Trade Commission. The ITC agreed last fall, and the Trump administration announced a new four-year tariff on Jan. 22 on imported solar cells and modules.", "A 30 percent tariff would be imposed in the first year, but that would decrease by 5 percentage points each year and end after year four. The first 2.5 gigawatts in cell imports are exempt.", "As for whether those two companies are “doing very well,” Suniva had filed for bankruptcy before making its ITC petition, and it’s still in bankruptcy proceedings. On April 17, a day before Trump’s comment, a bankruptcy judge said Suniva’s largest creditor could sell some of the company’s manufacturing equipment in a public auction, according to Reuters.", "SolarWorld Americas, however, is doing much better than that. SunPower announced this week that it would buy SolarWorld Americas, with its CEO describing the move as a reaction to the tariffs in an interview with Greentech Media. SunPower said it would “inject fresh capital” into its acquisition’s facility and implement its high-efficiency solar panel technology.", "The merger is expected to be finalized in several months, SunPower’s press release said.", "It’s certainly possible that another company will buy Suniva or at least its equipment and open or expand a production facility. And a handful of companies have said they are exploring expanding their capacity in the U.S. For instance, Longi Solar Technologies told Greentech Media in late January that it was “actively doing our homework” in considering a U.S. factory, which its general manager called “a big commitment.”", "That article cited other expansions in already operating facilities: an announcement in early January, before the tariffs were implemented, by Solaria Corp. that it would expand manufacturing thanks to new funding it had secured, and a Jan. 23 announcement by Mission Solar Energy that it was “ramping up production to meet product demands for 2018.”", "Perhaps the president is counting those types of announcements, but they’re not “seven or eight” plants that “are going to be opening.”", "Kann co-authored a Feb. 6 report for Columbia’s Center on Global Energy Policy that said: “Many manufacturers will certainly explore building manufacturing capacity in the United States, but a combination of timing, market factors, and the tariffs themselves will put an end to most of these schemes.”", "The report cited two reasons companies would “think twice before investing tens, or hundreds, of millions of dollars into new US solar panel manufacturing industry.” It noted that the tariff is reduced each year and eliminated after four years, and even with the tariff, the manufacturing costs could still make Southeast Asia solar panels more competitive.", "Similarly, Edurne Zoco, a research director of solar and energy storage for the analytics firm IHS Markit, said that the tariffs could prompt some additional module manufacturing capacity in the United States. But “we do not anticipate that it will bring a significant number of cell-manufacturing expansions,” Zoco told us in mid-February, when we did some initial research on this issue.", "The “competitive advantage of setting manufacturing in the U.S. grows smaller every year,” under the tariff, she said, “since global solar cell prices will continue to fall and the import tariff will be also reduced.”", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]