["By Angelo Fichera", "Posted on March 5, 2021", "In a 2010 TED Talk focused on developing new technologies to drastically reduce carbon dioxide emissions, Bill Gates briefly mentioned reducing the rate of population growth. A conspiratorial video circulating on Facebook misleadingly edits Gates’ talk to suggest his “wish” was to depopulate the planet through vaccines.", "A Facebook video viewed more than 100,000 times is using a deceptively edited clip of Bill Gates to accuse the Microsoft co-founder of advocating for a nefarious plan to depopulate the world through vaccines.", "The video — captioned, “Take a look at this #DepopulationAgenda” — employs a computer-generated voiceover that suggests Gates and other high-profile philanthropists want to remove some portion of the global population. The same video was uploaded to YouTube in April 2020, as misinformation relating to Gates swirled on social media.", "The Facebook version includes ominous music and is presented as a meme, adding an apocalyptic image of a syringe in front of a pile of skulls to further imply a deadly plan is afoot. The narration tells viewers it will use quotes directly from “Bill Gates himself so that later no one will accuse me of allegedly distorting his words.” But then it does just that.", "The video misleadingly edits Gates’ 2010 TED Talk — “Innovating to zero!” — which focused on the need to zero out carbon dioxide emissions through new approaches to energy production in order to fight climate change. Ignoring Gates’ theme of energy innovation, the video misleadingly portrays the speech as evidence of a purported “depopulation” agenda that involves COVID-19 and the global vaccination efforts of Gates, the World Health Organization and pharmaceutical companies.", "Before showing parts of Gates’ 2010 talk, the video presents part of a 2009 story in the Guardian that reported that Gates and other billionaire philanthropists had met and discussed overpopulation as a serious issue facing the world. But that was only one topic discussed. The video ignores that the group reportedly discussed a range of other issues, too — including education, government reform and the economic crisis at that time.", "It’s also worth noting — since the Facebook video doesn’t — that the same Guardian story also reported that a Bill and Melinda Gates Foundation vaccination project — Gavi, The Vaccine Alliance — was estimated at the time “to have prevented 3.4 million deaths in just eight years.”", "After its selective use of the Guardian article, the video then goes on to show a clip from Gates’ 2010 TED Talk as he was discussing the amount of carbon dioxide produced each year around the world.", "Bill Gates, “Innovating to zero!”: …over 26 billion tons. For each American, it’s about 20 tons. For people in poor countries, it’s less than one ton. It’s an average of about five tons for everyone on the planet. And somehow, we have to make changes that will bring that down to zero. It’s been constantly going up. It’s only various economic changes that have even flattened it at all, so we have to go from rapidly rising to falling, and falling all the way to zero.", "This equation has four factors, a little bit of multiplication. So you’ve got a thing on the left, CO2, that you want to get to zero, and that’s going to be based on the number of people, the services each person is using on average, the energy, on average, for each service, and the CO2 being put out per unit of energy. So let’s look at each one of these, and see how we can get this down to zero. Probably, one of these numbers is going to have to get pretty near to zero.", "That’s back from high school algebra. But let’s take a look.", "First, we’ve got population. The world today has 6.8 billion people. That’s headed up to about nine billion. Now, if we do a really great job on new vaccines, health care, reproductive health services, we could lower that by, perhaps, 10 or 15%. But there, we see an increase of about 1.3.", "That portion of Gates’ talk has spawned a false narrative that has persisted over the years that argues Gates was calling for the killing of millions of people by using vaccines — a narrative that the Facebook video again revisits.", "It’s clear, however, that Gates was referring once again to his belief that improving health and reducing child deaths, including through vaccines, can have the effect of limiting future population growth — which he has talked about many other times.", "In 2012, he again spoke about the need in underdeveloped countries to provide family planning services and better health care to decrease child mortality in order to deal with overpopulation. Similarly, in 2018, Melinda Gates, his wife and co-founder of the couple’s foundation, said: “When more children live past the age of 5, and when mothers can decide if and when to have children, population sizes don’t go up. They go down. Parents have fewer children when they’re confident those children will survive into adulthood.”", "Bill Gates went on in his full, unedited TED Talk to spend most of his time focusing on the need to drastically reduce carbon dioxide emissions through innovation in energy production. For example, he spoke about one venture he backs that aims to create more efficient nuclear energy by using the waste created by current nuclear reactors.", "But the video on Facebook cuts all of that — nearly 13 minutes in total — and moves directly from Gates briefly referencing the prospect of limiting population growth rate to his saying it’s his “wish” for such a technology. It provides no context for viewers to understand what hoped-for technology he was referencing.", "The edited video picks up his talk here:", "Bill Gates, “Innovating to zero!”: So this is a wish. It’s a very concrete wish that we invent this technology. If you gave me only one wish for the next 50 years — I could pick who’s president, I could pick a vaccine, which is something I love, or I could pick that this thing that’s half the cost with no CO2 gets invented — this is the wish I would pick. This is the one with the greatest impact. If we don’t get this wish, the division between the people who think short term and long term will be terrible, between the US and China, between poor countries and rich, and most of all, the lives of those two billion will be far worse.", "“So what have we heard from Bill?” the video voiceover says. “Global warming — which is supposedly caused by anthropogenic carbon emission — and to reset it, you need to slightly reduce the world’s population.”", "As we said, Gates briefly suggested that health care and vaccines could reduce the rate at which the population grows — but he didn’t propose killing off humans, as the video implies. His focus in the Ted Talk was on reducing carbon dioxide emissions by transforming the energy sector — something this misleading video leaves on the cutting-room floor.", "The full TED Talk can be seen here:", "The Facebook video continues by showing a 2011 clip of Gates speaking with CNN’s Sanjay Gupta about his pledge to spend $10 billion over a decade on vaccination efforts. He said in the interview that by reducing the number of children who die every year through vaccines, “the benefits there are in terms of reducing sickness, reducing the population growth, it really allows society a chance to take care of itself.”", "The video presents a loop of Gates saying the words, “reducing the population growth,” and then asks: “Amazing, isn’t it?”", "Except, as we said, Gates has been transparent about his belief that improved health and vaccines could reduce population growth.", "The video concludes by sowing doubt about the global response to the ongoing COVID-19 pandemic.", "It presents a lengthy video clip of Gates in 2015 discussing the need for pandemic preparedness — followed by details of Gates’ significant contributions to WHO and his foundation’s participation in a 2019 preparedness exercise involving a coronavirus — to baselessly insinuate that Gates, WHO and the pharmaceutical industry are behind a global effort to kill people.", "As we’ve explained before, such preparedness exercises have been held for many years. And some experts had warned of the potential for coronaviruses (which are a family of viruses) to trigger a pandemic at least 20 years before the 2019 outbreak of SARS-CoV-2, the virus that causes COVID-19.", "But the video ignores all of that context, instead feeding viewers a narrative that is heavy on innuendo and lacking in evidence.", "See more of our SciCheck work to learn about COVID-19 and vaccines.", "Editor’s note: SciCheck’s COVID-19/Vaccination Project is made possible by a grant from the Robert Wood Johnson Foundation. The foundation has no control over our editorial decisions, and the views expressed in our articles do not necessarily reflect the views of the foundation. The goal of the project is to increase exposure to accurate information about COVID-19 and vaccines, while decreasing the impact of misinformation.", "“A conversation with Bill Gates: Population growth.” Bill Gates. YouTube. 21 Aug 2012.", "“The Causes of Climate Change.” NASA. Accessed 3 Mar 2021.", "Gates, Bill (@BillGates). “How do we reduce population growth? By reducing infant mortality. I was surprised too. http://b-gat.es/ymQq7z.” Twitter. 9 Feb 2012.", "Gates, Bill and Melinda Gates. “10 tough questions we get asked.” GatesNotes. 13 Feb 2018.", "Hale Spencer, Saranac. “Conspiracy Theory Misinterprets Goals of Gates Foundation.” FactCheck.org. 14 Apr 2020.", "Hale Spencer, Saranac, et al. “New ‘Plandemic’ Video Peddles Misinformation, Conspiracies.” FactCheck.org. 21 Aug 2020.", "Harris, Paul. “They’re called the Good Club – and they want to save the world.” The Guardian. 30 May 2009.", "“Innovating to zero! | Bill Gates.” TED Talks. YouTube. 20 Feb 2010.", "Kasprak, Alex. “Did Bill Gates ‘Admit’ Vaccinations Are Designed So Governments Can ‘Depopulate’ the World?” Snopes. 10 Mar 2017.", "Swenson, Ali. “Bill Gates never said ‘3 billion people need to die.’” Associated Press. 26 Jan 2021.", "Wakabayashi, Daisuke, et al. “Bill Gates, at Odds With Trump on Virus, Becomes a Right-Wing Target.” New York Times. 17 Apr 2020.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]