["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The picture presented as proof was from a rally in support of reopening Wisconsin on April 24, 2020.", "Like most protests, that occurred on the West side of the building, where the flagpole atop the entrance is controlled by the state Assembly.", "The Assembly only flies the U.S. flag there when in session, and they weren’t that day.", "The additional detail about Evers ordering a flag to be removed is nonsense.", "When protesters gathered at the state Capitol in April to call for Gov. Tony Evers to reopen the state, the lack of an American flag at their chosen location became a point of contention.", "The Associated Press reported chants of \"Where’s our flag?\" and protesters calling it a \"disgrace.\"", "A similar claim surfaced in a viral Facebook post on June 12, 2020.", "\"Wisconsin Democrat Governor Evers removed the American flag from the Capitol building by ordering it to be taken down! This is beyond disgraceful!\" the post said.", "The text accompanied an undated photo showing protesters outside the Capitol building, with an empty flagpole circled in red.", "This question is particularly notable since in the intervening time, Evers has ordered the Capitol fly the rainbow pride flag for Pride Month (as he did in 2019) and the Juneteenth flag to commemorate the end of slavery.", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook).", "So did Evers really order the American flag removed at some point?", "Answering that means figuring out where and when this picture was taken. Let’s get to sleuthing.", "The Wisconsin Capitol building in Madison — completed in 1917 — is a symmetrical structure with a similar façade of pillars and windows facing north, south, east and west. The peak of each entry has a flagpole.", "So the first question is which flagpole we’re talking about.", "A review of photos from Google Maps shows the picture in question was taken at the West (State Street) entrance. That entrance has two rows of windows, with arched windows at the top. The other three entrances each have three rows, with a smaller row atop the arched windows.", "The west wing of the Capitol houses the state Assembly, so that body is in charge of which flag flies when. The Assembly policy — like the state Senate — is to fly the American flag, but only when the body is in session.", "The other element is when this photo was taken, since it’s undated in the Facebook post.", "The most notable recent rally there occurred April 24, 2020, when protesters gathered to pressure Evers into reopening the state amid the coronavirus pandemic. The lone readable sign in the image — SCIENCE says \"OPEN WISCONSIN!\" — gives us the key clue here.", "That’s certainly consistent with a reopen rally. But more importantly, that same sign can be seen in a Milwaukee Journal Sentinel photo of the event.", "So we have a picture from April 24 on the west wing of the Capitol.", "That’s the Assembly flagpole, and since the Assembly wasn’t in session that day (having adjourned the day before), not flying the American flag was standard operating procedure.", "The protesters could have seen the American flag in its usual spot alongside the Wisconsin flag if they had walked around to the east side of the Capitol.", "The governor has authority over that flagpole and the north wing pole that flies the POW-MIA flag. The state Senate controls the remaining south wing flagpole.", "So the Facebook post in question is not only wrong that Evers had authority over the flagpole in question, it goes a step further by claiming the U.S. flag was absent because of a specific order from the governor.", "Britt Cudabeck, a spokeswoman for Evers, confirmed the governor did not order any U.S. flag taken down. The U.S. and Wisconsin flags have flown daily on the east pole as usual.", "A Facebook post claims Evers ordered the U.S. flag removed from the state Capitol, posting as support a picture of an empty flagpole.", "Our research shows that photo was taken seven weeks before the Facebook post in front of the west  wing of the Capitol, which is controlled by the state Assembly. The flag only flies when the Assembly is in session, and it wasn’t that day.", "So the post is not only wrong, it moves into the realm of the ridiculous by manufacturing the assertion that Evers had specifically ordered the flag removed.", "We rate this claim Pants on Fire.", "Facebook post, June 12, 2020", "Google Maps, photos of the Wisconsin Capitol: North, South, East, West, accessed June 29, 2020", "Milwaukee Journal Sentinel, More than a thousand gather at Wisconsin State Capitol to protest restrictions as coronavirus cases rise (gallery, picture 34), April 24, 2020", "Wisconsin State Journal, Just Ask Us: Does Old Glory fly only when Gov. Scott Walker is working in the Capitol?, May 29, 2017", "Scott Bauer, twitter, April 24, 2020", "Scott Bauer, twitter, April 24, 2020", "Email exchange with Britt Cudabeck, spokeswoman for Gov. Tony Evers, June 29, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]