["Work continues at the Foxconn Technology Group's manufacturing complex in Mount Pleasant on Thursday, Feb. 6, 2020. (Mike De Sisti/Milwaukee Journal Sentinel)", "Foxconn’s deal with the state says they will “to the best of their ability” hire 13,000 people by 2022. And President Trump said at the groundbreaking the company would hire that many.", "The agreement with the state calls for 2,080 jobs by the end of 2019 to get all available tax credits.", "Foxconn construction and hiring have so far lagged well behind projections, but Moore is wrong to imply the 13,000 jobs are somehow already overdue.", "Foxconn Technology Group was awarded a record-shattering volume of tax credits amid pledges to build a $10 billion high-tech complex in Mount Pleasant that could eventually employ up to 13,000 people.", "The project, announced in 2017, has been slow to develop, to say the least. Among other signs:", "The latest jobs report from 2018 showed just over 100 jobs eligible for tax credits (2019 figures aren’t out yet).", "A timeline attached to the state credit application called for $2.1 billion in construction spending at the end of 2019. Foxconn has so far awarded about $370 million in contracts.", "The company has abandoned plans to build the latest \"Generation 10.5\" screens as originally promised in favor of a \"Generation 6\" plant.", "U.S. Rep. Gwen Moore, D-Wisconsin, is getting impatient.", "\"(President Donald) Trump promised 13,000 new jobs to the people of #Wisconsin,\" she tweeted Feb. 14, 2020. \"3 years later, we’re still waiting…\"", "Moore raises Trump’s role in the process, while also implying those 13,000 jobs are overdue. We checked out both elements of her claim.", "Trump has played a high-profile role throughout the Foxconn project.", "After a series of media reports raised the specter Foxconn might scale back or even suspend its Wisconsin plans, Trump spoke with then-CEO and Chairman Terry Gou. The company then announced in February 2019 it was still building a liquid crystal display manufacturing plant in Wisconsin.", "Trump had also been present for the groundbreaking in June 2018, where he said this:", "\"Moments ago we broke ground on a plant that will provide jobs for much more than 13,000 Wisconsin workers,\" the president said. \"Really something.\"", "He tweeted the same day that the plant \"will provide jobs for up to 15,000 Wisconsin Workers.\"", "It’s fair for Moore to summarize this as promising 13,000 jobs, since Trump made these claims without attribution or qualification.", "Moore’s \"still waiting\" claim doesn’t fare so well.", "Her phrasing implies the jobs should have been here three years ago, or at the very least should by now.", "That was never the promise.", "A memorandum of understanding between Foxconn and the state in July 2017 said the company \"agrees to … create up to 13,000 jobs with an estimated average salary of $53,875 over a period of up to six years.\"", "The formal agreement signed in November 2017 moved that up a bit, saying Foxconn agrees \"to the best of their ability, to projected employment of 13,000 jobs of hourly and salaried personnel of Wisconsin payroll between 2018 and the end of 2022.\" It goes on to note the headcount is subject to timely construction and \"business needs.\"", "When it comes to qualifying to get the tax credits, the timeline is a bit looser than that.", "Foxconn would need 13,000 jobs by 2022 to get the maximum available tax credits from the state, according to a credit disbursement schedule attached to the agreement. But that document also shows a minimum number of jobs needed to get some level of state credits, and that requires 5,200 jobs by 2022. That minimum threshold tops out at 10,400 in 2027, so Foxconn could get some level of incentives each year without ever reaching 13,000 jobs.", "The actual jobs count for Foxconn isn’t currently available. The company is required to report jobs for the prior year to the state by each April 1, and they have not yet reported 2019 figures. For 2018, Foxconn reported 189 jobs at the end of the year, of which 113 were deemed eligible for tax credits by the Wisconsin Economic Development Corp.", "The company declined to provide a specific jobs number to PolitiFact Wisconsin, simply noting that Foxconn has so far \"invested millions of dollars in Wisconsin while hiring hundreds of hardworking Foxconn employees.\"", "For maximum tax credits, Foxconn had to have 1,040 employees at the end of 2018 and 2,080 at the end of 2019.", "Moore said Trump promised 13,000 new jobs, and \"we’re still waiting\" three years later.", "She’s right that Trump referred to the jobs figure in what could reasonably be called a promise. But she’s off base with the impatient tone that implies those jobs are somehow overdue.", "The earliest date that could be seen as a deadline for 13,000 jobs is 2022, since Foxconn said in the state agreement it would seek to hire that many in that timeframe. While Foxconn’s progress has been slow, it’s not fair to claim we should be at 13,000 jobs by now.", "We rate Moore’s claim Half True.", "Gwen Moore, twitter, Feb. 14, 2020", "YouTube, President Donald Trump Touts Job Creation At Foxconn Groundbreaking In Wisconsin | NBC News, June 28, 2018", "Milwaukee Journal Sentinel, More signs emerge that the pace of Foxconn's Wisconsin project is falling short of expectations, Jan. 3, 2020", "Milwaukee Journal Sentinel, Foxconn confident it has enough jobs to get tax credits for this year, but last year many were disqualified, Dec. 12, 2019", "Foxconn agreement with Wisconsin Economic Development Corp., Tax credit disbursement schedule (page 24), Nov. 10, 2017", "Scott Walker, memorandum of understanding with Foxconn, July 27, 2017", "Wisconsin Economic Development Corp., Certification statement, Nov. 7, 2017", "Email exchange with David Callender, spokesman for Wisconsin Economic Development Corp., March 2, 2020", "Email exchange with Samara Sheff, spokeswoman for Gwen Moore, Feb. 21, 2020.", "Foxconn, email exchange with spokesman, March 2-3, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]