["On February 26, 2019, India said its warplanes had launched air strikes against militant camps in Pakistan's territory. Here is an AFP story on the strikes.", "Multiple Facebook posts including this one, published February 26, 2019 and shared more than 350 times, purport to show the IAF fighter pilot who conducted the strikes.", "The post contains an image of a woman in air force uniform wearing pilot glasses with a caption that says: \"Proud to inform you that the pilot of today's air strike is a girl from Surat Name : Urvisha Jariwala\".", "The same image and claim has been shared widely on Twitter, for example here.", "A reverse image search found that the woman in the photo is not called Urvisha Jariwala, she is actually an IAF flight lieutenant named Sneha Shekhawat.", "Bharat-rakshak.com, an online database of military personnel, lists Shekhawat as an IAF officer. Here is a link to her profile, which contains the same picture as the misleading post.", "A search on the same database using the keywords \"Urvisha Jariwala\" brings up no results.", "In 2012, Shekhawat led an IAF contingent at India’s Republic Day parade, becoming the first woman pilot to do so, according to this report by India Today.", "India’s national broadcaster Doordarshan also interviewed her in 2015. This tweet from the network’s verified account, published on October 8, 2015, advertises the interview using the same picture as the misleading post with Shekhawat’s name overlaid on the image.", "Meet Sneha Shekhawat in #AbKeBarasMoheBitiyaHiDijo, Friday morning at 9:30 am only on @DDNational pic.twitter.com/kTCLuMDgtg", "A promo video of the interview can also be viewed on the show’s YouTube account here.", "The composite image below shows a screenshot of the Doordarshan compared with the misleading image:", "Neither the IAF nor the Indian government have released the names of the fighter pilots involved in the airstrike on Pakistan.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]