["About this rating", "A trait North Korean dictator Kim Jong Un shares with U.S. President Donald Trump is a penchant for hurling sophomoric insults at perceived enemies and rivals, including each other.", "When Trump referred to Kim as \"Rocket Man\" in a 2017 speech warning that the United States would \"totally destroy\" North Korea if attacked by that country, Kim fired back that Trump is \"a mentally deranged U.S. dotard.\"", "In May 2019, North Korea's state media agency appeared to take inspiration from Trump (who often uses the epithet \"individual of low IQ\" to denigrate people he doesn't like) by calling Democratic presidential candidate Joe Biden \"a fool of low IQ\" in response to Biden's labeling Kim a \"tyrant.\" Trump, who has himself publicly insulted Biden several times since the latter's entry into the 2020 presidential race, tweeted that he \"smiled when [Kim] called Swampman Joe Biden a low IQ individual, & worse. Perhaps that’s sending me a signal?\"", "Trump took it even further in a press conference during a state visit to Japan by agreeing with Kim's assessment of Biden, as reported below by the Associated Press:", "“Kim Jong Un made a statement that Joe Biden is a low-IQ individual,” Trump said. “He probably is, based on his record. I think I agree with him on that.”", "Pressed on whether he was supporting a dictator over a former U.S. vice president, Trump recited a host of complaints about the Obama-Biden administration.", "U.S. officeholders have in the past generally avoided engaging in politics while on foreign soil, hewing to the adage that politics stops at the water’s edge. But Trump’s sharp attack on Biden, through his declaration of agreement with Kim, cast aside that tradition.", "Here is a video clip from that press conference:", "President Trump: \"Kim Jong un made a statement that Joe Biden is a low IQ individual. He probably is, based on his record. I think I agree with him on that.\" https://t.co/tzBI1eou2y pic.twitter.com/xRGewVfamp", "— The Hill (@thehill) May 28, 2019", "Despite criticism from members of both parties for siding with a foreign leader against an American and airing his political grievances on the international stage, Trump would double down on his remarks, but not before a random tweet by a U.S. foreign policy expert nudged the controversy into fictional territory. On 26 May, Time columnist Ian Bremmer attributed the following quote to the president:", "Though some who read it questioned its authenticity, the attributed quote — \"Kim Jong Un is smarter and would make a better President than Sleepy Joe Biden\" — was initially accepted as real and shared on social media by anti-Trump partisans:", "President Trump in Tokyo: “Kim Jong Un is smarter and would make a better President than Sleepy Joe Biden.”\nHey Evangelicals, here is a quick fun fact about Kim Jong Un: he currently has 50,000 Christians in Labor Concentration Camps.\nEnjoy church today you racist hypocrites.", "— Dawna (@onecaliberal) May 26, 2019", "A US traitor stood before people in Japan\ndeclared that, “Kim Jong Un is smarter and would make a better President than Sleepy Joe Biden.”", "That US traitor is the current @potus, Donald Trump", "Siding with a foreign enemy over a loyal US patriot, Joe Biden. Trump is unAmerican", "— Millgrist (@Millgrist1) May 26, 2019", "However, in follow-up tweets, Bremmer implicitly acknowledged that he had fabricated the quote (\"This is objectively a completely ludicrous quote,\" he wrote), while simultaneously defending it as \"plausible\" (\"we reasonably suspect Trump was thinking it\") and illustrative of a point he wished to make about \"the state of the media and the twitterverse today.\"", "In other words, Bremmer was parodying Trump; his intent was satirical. As we have had all too many occasions to point out on this site, however, satire can be a double-edged sword on social media, because some people have trouble recognizing satire as such. Bremmer was blasted by critics on all sides for not being clearer about his intent from the beginning. \"It's like he wants to give Trump ammo for the 'fake news' nonsense,\" wrote historian Kevin Kruse. He called on Bremmer to delete the tweet.", "Bremmer did remove the tweet, eventually, and issued a clarification and apology:", "My tweet yesterday about Trump preferring Kim Jong Un to Biden as President was meant in jest. The President correctly quoted me as saying it was a “completely ludicrous” statement. I should have been clearer. My apologies.", "— ian bremmer (@ianbremmer) May 27, 2019", "Whereupon Trump, as predicted, pounced on the opportunity to denounce Bremmer's original tweet as \"fake news\" and implied that it rose to the level of \"libel\":", ".@ianbremmer now admits that he MADE UP “a completely ludicrous quote,” attributing it to me. This is what’s going on in the age of Fake News. People think they can say anything and get away with it. Really, the libel laws should be changed to hold Fake News Media accountable!", "— Donald J. Trump (@realDonaldTrump) May 27, 2019", "Given Bremmer's admission, we rate as false the claim that Trump said Kim Jong Un is smarter and would make a better president than Joe Biden, while noting that the president did, in fact, defend the North Korean dictator's alleged characterization of Biden as having a low IQ. We note further that while Bremmer backed down in the face of criticism, Trump did not, electing instead to double down on the insult by making light of it in his final tweet on the subject:", "I was actually sticking up for Sleepy Joe Biden while on foreign soil. Kim Jong Un called him a “low IQ idiot,” and many other things, whereas I related the quote of Chairman Kim as a much softer “low IQ individual.” Who could possibly be upset with that?", "— Donald J. Trump (@realDonaldTrump) May 28, 2019", "A spokesperson for the Biden campaign called Trump's comments \"beneath the dignity of the office.\"", "Cillizza, Chris.   \"Donald Trump Spent His Japan Trip Tweeting About Joe Biden.\"\r\n   CNN.   28 May 2019.", "Colvin, Jill and Darlene Superville.   \"Trump in Japan: Pomp and Tense Circumstance.\"\r\n    Associated Press.   27 May 2019.", "Miles, Frank and Edmund DeMarche.   \"Trump Seizes on NYU Professor's Tweet to Push Change of Libel Laws.\"\r\n    Fox News.   27 May 2019.", "Ramzy, Austin.   \"Kim Jong Un Called Trump a 'Dotard.' What Does That Even Mean?\"\r\n    The New York Times.   22 September 2017.", "Riga, Kate.   \"Fox News Panel Berates Trump for Bashing Biden During Japan Trip.\"\r\n    Talking Points Memo.   28 May 2019.", "Rosenberg, Eli.   \"A Political Scientist Caused Confusion When He Made Up a Trump Quote. The President Noticed.\"\r\n    The Washington Post.   27 May 2019.", "Sonmez, Felicia.   \"Members of Both Parties Criticize Trump's 'Confidence' in Kim Jong Un.\"\r\n    The Washington Post.   26 May 2019.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]