["“Real Name – Mohammad Nisar Orange T-shirt, Tilak on Forhead. Now you can understand many things. You can also connect this to the so called “Bhagwa Goons” doing Violence during Amit Shah Road Show in Kolkata, They were all TMC Goons,” a Twitter user Ravi Singh shared this caption with a video of a man dressed in a saffron t-shirt being questioned by the police. An RAF (Rapid Action Force) officer points at the man and says, “He was stone-pelting”. When asked by others what his name was, the man replied, “Mohammed Nisar”.", "Singh, the editor of fake news website Dainik Bharat, wrote, “You can also connect this to the so-called “bhagwa goons” doing violence during Amit Shah’s roadshow in Kolkata.”", "Real Name – Mohammad Nisar Orange T-shirt, Tilak on Forhead Now you can understand many things", "You can also connect this to the so called “Bhagwa Goons” doing Violence during Amit Shah Road Show in Kolkata,", "They were all TMC Goons pic.twitter.com/AkkRZNnJwF", "— ravi singh (@mitthu) May 16, 2019", "His video was retweeted by multiple users, a bulk of those followed by BJP leaders, including the Prime Minister – Dr Shobha, Maria Wirth, Anil Kohli.", "Several people propagated that this man was caught stone-pelting at Amit Shah’s Kolkata rally and that the violence was orchestrated by the TMC.", "Shocking how #TMC orchestrated the Violence during @AmitShah Road Show in Kolkata yesterday.", "This guy in this Clip is Mohammed Nissar. Just observe he’s made to wear a #SaffronTShirt and a #Tilak on his forehead.", "He was caught pelting stones at @AmitShah Road Show. Shameful. pic.twitter.com/Dib6W3x3BG", "— Sunil Baitmangalkar (@SunilBaitman) May 16, 2019", "The video is also viral on Facebook.", "There are several hints in the video itself that suggest that it does not depict the aftermath of the violence at Kolkata’s Vidyasagar college. Firstly, the men are speaking a dialect uncommon in West Bengal. The accent sounds similar to that of the people from Hindi-speaking East Indian states – Bihar, Jharkhand, Uttar Pradesh or Chattisgarh. Secondly, the site where the man was caught does not resemble the Calcuttan streets where violence during Shah’s roadshow took place.", "Alt News found a user who commented that the video is from Jharkhand. “No this is stone pelting incident from Jugsalai #Jamshedpur #Jharkhand on polling day May 12 in a booth. His name Md Irshad, arrested and sent to jail,” he alleged.", "No this is stone pelting incident from Jugsalai #Jamshedpur #Jharkhand on polling day May 12 in a booth. His name Md Irshad, arrested and sent to jail.", "— Debashish Sarkar 🇮🇳 (@DebashishHiTs) May 17, 2019", "When we looked for media reports on the said incident, we came across a News18 Jharkhand broadcast where the same man can be seen caught by the police at 2:19 seconds.", "On May 12, clashes had broken out between BJP and JMM workers outside a polling booth. A heavy police force was deployed that used tear gas and resorted to lathi-charge to control the violence. According to a Times of India report, the police had arrested two stone-pelters.", "The viral video, therefore, stands unconnected to Vidyasagar College violence. Multiple claims were raised with regard to the clashes in West Bengal and Alt News’s fact-check on the assertions can be read here.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]