["The video was uploaded by an Australian-based TikTok user here. The post has been shared more than 130 times.", "The video shows a woman standing in front of a pile of rubble. She can be heard saying: “Please Trump, please stop them. Stop the shelling, stop the killing of these innocents. Please America, please stop them.”", "The video features superimposed text that reads: “Syrian woman begs Trump and America to stop Biden from killing Innocent [sic] people”.", "A second superimposed caption reads: “This is what Biden has done to Syria.”", "The video featuring the superimposed text was also shared hundreds of times on Facebook here, here, here and here; on TikTok here and here; and on Twitter here, here and here alongside a similar claim.", "The claim, however, is false.", "The footage, without the superimposed text, previously circulated in this YouTube video published by Bloomberg on July 23, 2019, more than one year before Biden took office in January 2021.", "In the video, the same woman can be seen making the same plea to Trump. She goes on to say: “This is the United States apathy towards the Syrian situation. We are getting shot everyday. We are getting killed everyday. Stop the killing of these innocent people, please America.”", "According to Bloomberg’s description, the video shows a woman named Rania Kisar in the Syrian city of Maarat al-Numan. The video was also uploaded to a Facebook account by the same name here.", "Multiple news outlets, including The Guardian, BBC and Al Jazeera, reported on the airstrike in Maarat al-Numan on July 22, 2019. The airstrike was carried out by Russian and Syrian forces, the reports said.", "The US condemned the strikes in a statement published here on the website for the US Embassy in Syria on July 23, 2019.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]