["A viral post circulating on social media claims to be an opinion piece defending President Donald Trump's \"lack of Decorum, Dignity and Statesmanship\" purportedly written by the former mayor of Livermore, California, Marshall Kamena.", "\"Very interesting theory on Trump's success,\" reads a July 2018 Facebook post that recently resurfaced. \"The mayor of Livermore California explains Trump’s popularity and success. This is perhaps the best explanation for Trump's popularity.\"", "The post claims Kamena ran on the Democratic ticket \"as he knew a Bay Area city would never vote for a Republican.\"", "The post has more than 228,000 shares and is accompanied by a photo of Trump and former President Barack Obama.", "USA TODAY was unable to reach the user for comment.", "Fact check:Trump loses several perks only if there's an impeachment conviction by Jan. 20", "The essay is not only misattributed to Kamena, but it also falsely claims he is the current mayor of Livermore.", "Kamena was elected as the mayor of Livermore in November 2001, and his term ended in November 2011, according to his LinkedIn account. The current mayor of Livermore is John Marchand.", "It is also false to claim Kamena \"ran on the Democratic ticket\" as Livermore's mayoral office is nonpartisan, according to its application page.", "Fact check: The Insurrection Act is not in effect and is unnecessary in DC", "Conservative author Evan Sayet confirmed to USA TODAY in an email that he is the original author of the viral text and is unsure \"as to how it got misattributed along the way.\"", "The essay first appeared as an opinion column in 2017 on Townhall under the headline \"He Fights.\"", "The column started to be misattributed to Kamena in forwarded emails and social media posts with the subject line “One Man’s Opinion,” according to Truth or Fiction, which debunked the claim in 2017.", "The post has been incorrectly attributed to Kamena on social media over the years. It was debunked in 2018 by Snopes and in 2020 by PolitiFact.", "USA TODAY was unable to reach Kamena for comment.", "Fact check: No record of viral Nancy Pelosi quote about immigrants who are here illegally", "The claim that the mayor of Livermore, California, wrote an essay explaining Trump's popularity and success is FALSE, based on our research. Conservative author Evan Sayet wrote the piece in 2017, and it has been misattributed throughout the years. The essay falsely claims Kamena is the current mayor of Livermore and ran as a Democrat.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook."]