["About this rating", "On Dec. 9, 2019, a volcano on New Zealand's White Island erupted, sending a plume of ash and steam more than two miles into the sky. Some 47 people were on the island at the time, many of them tourists. When the dust settled, authorities confirmed that at least 20 people were killed.", "A few weeks later, a video that supposedly showed the eruption circulated on social media:", "While New Zealand's White Island (or Whakaari) volcano truly erupted in December 2019, this video did not document that event.", "The video above was actually a simulation created by the Auckland War Memorial Museum. The museum shared this footage to its YouTube page under the title \"Auckland Museum Volcano Simulation - Auckland Museum\" and explained it was \"an educational simulation of an earthquake caused by a volcanic eruption.\"", "The simulation was also on display in the museum's Volcanoes Gallery.", "Auckland Museum, with support from EQC, the Earthquake Commission, are proud to present a dynamic permanent natural history exhibition: Volcanoes.", "This rare look at our turbulent geological home is an up close and personal examination of the scientific and human stories of volcanoes. The highly interactive exhibition will give visitors a walk through deep sea black smokers and also a grandstand as-live view of a volcanic eruption in Auckland.", "Plenty of real photographs and videos documenting the White Island eruption were available online.", "This image, for instance, was taken by photographer Michael Schade (available via Getty Images):", "Heavy smoke from volcanic eruption at New Zealand's White Island. (Photo by Michael Schade/Handout/Xinhua via Getty) (Xinhua/ via Getty Images)", "Allessandro Kauffmann had a close and terrifying view. The Brazilian tourist shared a video on Instagram showing the volcano erupting as his boat raced away from the island:", "And NBC News reporter Emmanuelle Saliba compiled this \"minute-by-minute\" look:", "NBC News.   \"New Zealand Volcano Eruption on White Island Kills at Least 5.\"\r\n    10 December 2019.", "abc.net.au.   \"New Zealand's White Island Volcano Disaster Death Toll Rises to 20 as Two Missing People Confirmed Dead.\"\r\n    22 January 2020.", "Wilson, Libby.   \"Whakaari/White Island: Watch Tourist's Full Video of Tour Moments Before Eruption.\"\r\n    Stuff.   12 December 2019.", "Howell, Elizabeth.   \"Satellite Sees Deadly New Zealand Volcano Eruption from Space (Photos).\"\r\n    Space.com.   11 December 2019.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]