["The claims were published here on Facebook on June 25, 2020. The post has been shared more than 260 times.", "The Tagalog-language claim translates to English as: “Just in case you get Infected with covid 19 corona virus’s [sic] / Just share / Read this.”", "The text in the image reads: \"Chinese are not taking any medicine or any vaccine for Corona virus. Every household has a Corona Virus case. They have stopped going to hospital for cure. They instead kill the virus with heat. / Very Hot Steam Inhalation from kettle 4 times a day / Hot Gargles 4 times a day / Hot tea 4 times a day / Virus dies in 4 days. / 5th Day you are Corona Negative.\"", "Similar claims have also been shared here, here, here and here on Facebook, and here and here on Twitter.", "The claims, however, are false; as of June 30, 2020, Chinese media continues to report on COVID-19 patients hospitalised across the country.", "This June 30, 2020 report by China’s state-run Xinhua News Agency states, in part: \"Chinese health authority said Tuesday it received reports of 19 newly confirmed COVID-19 cases on the Chinese mainland Monday, including eight domestically transmitted and 11 imported ones.", "\"By Monday, the Chinese mainland had reported a total of 1,918 imported cases. Of the cases, 1,830 had been discharged after recovery, and 88 remained hospitalized. No deaths from the imported cases had been reported.\"", "Another Xinhua report, published a day earlier, mentioned the discharge of the first person from the latest COVID-19 infection cluster in Beijing from a hospital in the Chinese capital.", "The report states in part: “He went to a hospital on June 12 after experiencing symptoms of fever and fatigue and tested positive in a nucleic acid test. The patient had been treated in Beijing Ditan Hospital since June 13.”", "Similarly, this news release from China’s National Health Commission, as well as other reports from Chinese media here and here, all made references to the hospitalisation of COVID-19 patients in China in June 2020.", "Experts say the claim about “killing” the novel coronavirus through \"steam inhalation\"; “hot gargles”; and by drinking hot tea are without any scientific basis and potentially harmful to human health. AFP has previously debunked the claims here, here and here.", "The Philippine health department also warned against steam inhalation in this Tagalog-language graphic posted to Facebook on June 25, 2020.", "“Steam inhalation... does not kill the COVID-19 virus and is not among the remedies against COVID-19,” the graphic states. “There’s a possibility that the virus attaches to the steam (aerosolization), that can lead to the spread of disease.”", "“It can also cause accidents like burns and scalding.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]