["Americans for Prosperity falsely claims Democrat Russ Feingold voted to raise taxes 250 times while in the U.S. Senate. (Milwaukee Journal Sentinel photo)", "Democrat Russ Feingold spent nearly two decades in the U.S. Senate, and is now trying to win back his old seat from Republican Ron Johnson, who ousted Feingold in 2010.", "A recent campaign ad from Americans for Prosperity claims one theme permeated Feingold’s tenure in Washington — a push for higher taxes. The conservative political advocacy group even puts a precise number on that claim:", "\"He voted time and again to make life more expensive for families in Wisconsin,\" the narrator says in the ad, released in August. \"Russ voted over 250 times to raise taxes — 250.\"", "The Club for Growth, another conservative group, used the same figure in an ad released Oct. 12, 2016, wording it as \"250 votes for higher taxes.\"", "Did Feingold really cast that many votes to raise taxes?", "The matter isn’t as straightforward as the nice round number leads viewers to believe.", "The foundational question is what constitutes a vote to \"raise taxes\"?", "More than half the votes cited in the ad — 150 — came on budget resolutions, which set non-binding parameters for considering tax and spending legislation. They are used as blueprints for the budget or in some cases to make a political statement.", "But PolitiFact has noted repeatedly that it is inaccurate to suggest votes on non-binding budget resolutions are the same as votes on legislation that sets policy. The resolutions often don’t include precise details and don’t on their own raise, lower or even keep taxes the same.", "\"You’re voting for kind of an overall map and taking multiple votes on that same map, and not directly raising or lowering taxes in a piece of legislation,\" said Joshua Gordon, policy director of the Concord Coalition, a group that urges deficit reduction.", "Americans for Prosperity contends the votes are a fair addition to the tally.", "\"Although many of the spending and revenue levels set in budget resolutions require additional legislative action to implement, there are a number of spending and tax policies set by budget resolutions,\" said James Fellinger, a spokesman for the group. \"Budget resolutions enact procedural changes in order to ease the passage of those policies — voting for a budget resolution is plainly supporting the policies it outlines.\"", "The ad’s tally also includes many votes that were actually against tax cuts — not in favor of tax increases. Feingold spokesman Michael Tyler said Feingold campaign counted more than 150 such examples among the votes cited by Americans for Prosperity.", "It’s not merely a semantic distinction. When PolitiFact Florida fact-checked a nearly identical claim about votes to raise taxes, three federal budget experts generally agreed that a vote against a new tax cut isn’t the same as a vote for a tax increase.", "Gordon said that element of the ad’s claim \"is probably the worst argument of all of them\" from a fiscal policy perspective.", "\"The voter reading that is going to believe (Feingold) voted in 250 separate times to raise an individual’s own income tax,\" Gordon said. \"By any standard that sort of accounting is false in terms of what we expect the average voter to take away from the (claim).\"", "Meanwhile, there is another problem:", "Though Americans for Prosperity cited 264 separate votes from Feingold, they came on only 65 pieces of legislation.", "The votes came on amendments that varied widely in content and scope, so each represented a different position. Nevertheless, that counting approach inflates the total.", "For example, Feingold cast 34 votes on Senate Concurrent Resolution 23 in 2003, which established Congress’ version of the budget for the following year. Each vote took a position on a proposed change of some kind, but should that count as 34 votes or one?", "\"Counting multiple votes on the same legislation and all of its permutations just serves to pad the number, but in some cases isn’t completely inaccurate, just not telling the full tale,\" Steve Ellis, vice president of Taxpayers for Common Sense, told PolitiFact Florida in 2012 when it tackled and rated a similar item.", "Another problem with the 250 tally: some of the votes come on nuanced, multi-part amendments that are not easily categorized.", "One example is the Health Care and Education Reconciliation Act of 2010, companion legislation to the Affordable Care Act that helped established Obamacare.", "Feingold cast three votes on March 24, 2010, against amendments that would exempt certain devices from a 2.3 percent tax (in effect, voting to raise a tax). But the amendment would have offset that by lowering the law’s affordability tax exemption for individuals (voting to lower a tax).", "Despite the offsetting effect, Americans for Prosperity lists it as a tax increase.", "Our rating", "Americans for Prosperity says Feingold voted more than 250 times to raise taxes as a U.S. senator, contending any vote in support of a higher tax should be part of that tally.", "But that number is built on assumptions and simplifications.", "Though Feingold cast tax-related votes that many times, more than half of those came on non-binding resolutions that took a position in favor of raising taxes but did not raise taxes by themselves.", "The claim also does not account for the large number of votes that were actually against a tax cut, not in favor of a tax increase. Experts say that’s a big difference. And it doesn’t acknowledge the nuanced nature of the votes themselves or that many votes came on elements of the same legislation.", "We rate the ad’s claim False.", "https://www.sharethefacts.co/share/8aecd592-a350-4255-97a3-e1210795a4a1", "YouTube, Americans for Prosperity, \"We know Russ Feingold,\" released Aug. 22, 2016", "YouTube, Club for Growth Action, \"Can’t Afford,\" Oct. 13, 2016", "PolitiFact Florida, Connie Mack said Bill Nelson voted to raise taxes 150 times, Aug. 20, 2012", "PolitiFact Florida, Connie Mack said Bill Nelson voted to raise taxes 272 times, Nov. 1, 2012", "PolitiFact, Obama voted for budget resolutions, not taxes, Aug. 8, 2008", "PolitiFact, The budget resolution isn’t that clear, April 14, 2008", "PolitiFact, McCain repeats questionable tax claim, Sept. 26, 2008", "Congressional Research Service, The Budget Reconciliation Process: Timing of Legislative Action, Feb. 23, 2016", "U.S. Senate website, definition of concurrent resolution, accessed Oct. 18, 2016", "Interview, Joshua Gordon, policy director, The Concord Coalition, Oct. 19, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]