["Republican presidential candidate, Sen. Marco Rubio, R-Fla., speaks during the CNN Republican presidential debate at the Ronald Reagan Presidential Library and Museum on Wednesday, Sept. 16, 2015. (AP photo)", "The struggles of Jeb Bush have pundits rethinking who will emerge as the Republican establishment alternative to 2016 outsiders like Ben Carson and Donald Trump.", "A name that keeps surfacing: Sen. Marco Rubio, R-Fla.", "Rubio is the \"candidate who seems to be in the cat-bird’s seat right now,\" said ABC’s George Stephanopoulos. Stephanopoulos asked liberal pundit and former Michigan Gov. Jennifer Granholm if Rubio has Democrats worried.", "Not really, Granholm said. \"He’s one of the most extreme,\" she said.", "\"For example, he doesn’t agree with a woman’s right to choose even in the case of rape or incest,\" Granholm said.", "We previously looked into some of Rubio’s statements and votes regarding abortion. Does he oppose abortion in the case of rape or incest?", "Rubio’s debate comments", "Rubio discussed his position on abortion during the first Republican presidential debate, Aug. 6, 2015, in Cleveland. We’ll show you the exchange between Rubio and moderator Megyn Kelly.", "Kelly: \"You favor a rape and incest exception to abortion bans. Cardinal Timothy Dolan of New York just said yesterday those exceptions are preposterous. He said they discriminate against an entire class of human beings. If you believe that life begins at conception, as you say you do, how do you justify ending a life just because it begins violently, through no fault of the baby?\"", "Rubio: \"Well, Megyn, first of all, I'm not sure that that's a correct assessment of my record. I would go on to add that I believe all --\"", "Kelly: \"You don't favor a rape and incest exception?\"", "Rubio: \"I have never said that. And I have never advocated that. What I have advocated is that we pass a law in this country that says all human life at every stage of its development is worthy of protection. In fact, I think that law already exists. It is called the Constitution of the United States.\"", "The exchange is noteworthy for two reasons. First, Rubio bristles at the suggestion that he favors abortion exceptions for rape and incest.", "But, he also never definitively answers Kelly’s question about his position.", "NBC’s Chuck Todd tried to get clarity a few days later on Meet the Press. The takeaway: Rubio supports legislation that makes abortion more rare whether or not exceptions for rape and incest are included. So that means he’ll support legislation that reduces abortion even if it includes exceptions. But that also means he doesn’t necessarily believe that an exception should be included in every piece of abortion legislation.", "\"I'll support any legislation that reduces the number of abortions, so that means a 20-week abortion ban. At five months, a child -- you'll recognize it as a human being in an ultrasound image. And I'll support that. That doesn't obviously cover the whole gamut, but it reduces the number of abortions,\" Rubio said.", "\"I'll support any legislation that reduces the number of abortions and there are those that have that exception in it. What I've never done is said I require that it must have or not have exceptions.\"", "Granholm’s office pointed us toward several news accounts highlighting Rubio’s position and the exchange between Kelly and Rubio.", "The articles largely reach the same conclusion: Rubio will support anti-abortion legislation that includes an exception for rape and incest, but he prefers that the procedure be illegal even in cases of rape and incest.", "\"I personally believe you do not correct one tragedy with a second tragedy. That's how I personally feel very strongly about,\" Rubio said Aug. 7, 2015, on CNN. \"I believe all human life irrespective of the circumstances in which it came into being is worthy of the protection of our laws. I recognize this is a tough question. It's a very difficult question. And I understand that. Believe me, I do. But by the same token if I have to weigh the two equities here, I'm always going to err on the side of life.\"", "Rubio’s record on abortion", "Rubio, for the record, has supported legislation in the Senate that includes exceptions for rape and incest.", "In November 2013, Rubio was one of 40 co-sponsors of a Senate bill entitled \"Pain-Capable Unborn Child Protection Act.\" Several GOP presidential candidates backed the bill, including main sponsor Lindsey Graham of South Carolina and co-sponsors Ted Cruz of Texas and Rand Paul of Kentucky.", "The bill bans abortions at 20 weeks or greater but includes exceptions, including rape and incest.", "Graham sponsored a similar version in 2015 -- and again Rubio is listed as one of dozens of co-sponsors. The 2015 version also has a rape exception, although the language differs. It requires adult women to obtain counseling or medical treatment for the rape 48 hours before the abortion, with separate criteria for minors about reporting the rape to law enforcement.", "Rubio has long been an opponent of abortion rights, and his record bears that out. National Right to Life gave him a 100 percent rating for the 112th and 113th congresses. In both sessions, the ratings were based on five votes, such as cutting off funding for Planned Parenthood, repealing or defunding the Affordable Care Act and protecting free speech.", "The Family Research Council also gave Rubio a 100 percent rating for 13 votes in 2013-14. And NARAL, a group that supports abortion rights, gave Rubio a zero every year between 2011 and 2014.", "\"I personally and deeply believe that all human life is worthy of the protection of our laws, I do,\" Rubio said in his Meet the Press interview. \"And I believe that irrespective of the conditions by which that life was conceived or anything else, and for me to be consistent on that belief, that's why I feel so strongly about it.", "\"That being said, I recognize that in order to have a consensus on laws that limit the number of abortions, a lot of people want to see those exceptions and that's why I've supported those laws in the past, as has every pro-life group in America.\"", "Our ruling", "Granholm said Rubio opposes abortion \"even in the case of rape and incest.\"", "The record suggests Rubio has staked out a slightly more nuanced position. Rubio is staunchly anti-abortion and has suggested he personally opposes abortion in cases of rape and incest, but he has supported abortion legislation that include those exceptions. Rubio says he supports legislation that makes abortion more rare.", "Granholm’s statement is accurate but needs clarification. We rate it Mostly True.", "ABC This Week, Oct. 25, 2015", "Meet the Press, interview with Marco Rubio, Aug. 9, 2015", "Email interview with Rubio spokesman Alex Conant, Oct. 25, 2015", "Email interview Granholm spokeswoman Carole Love, Oct. 25, 2015", "Los Angeles Times, Marco Rubio takes tough stand against abortion, with no exceptions for rape or incest, Aug. 7, 2015", "Bloomberg, Democrats See Opportunity in Marco Rubio's No to Abortion Even After Rape or Incest, Aug. 10. 2015", "Washington Times, Marco Rubio touts abortion opposition, including in cases of rape and incest, Aug. 7, 2015", "CNN, Interview with Sen. Marco Rubio, Aug. 7, 2015", "Congress.gov, S. 886, May 7, 2013", "Congress.gov, S. 1670, Introduced Nov. 7, 2013", "Congress.gov, S. 1533, Introduced June 11, 2015", "National Right to Life scorecards for U.S. Sen. Marco Rubio 112th and 113th congresses", "Family Research Council, Scorecard for U.S. Sen. Marco Rubio, 2013-14", "NARAL, Scorecard for U.S. Sen. Marco Rubio, 2014", "The Hill, \"Rubio: abortion rights’ arguments ‘indefensible,’\" July 10, 2015", "Florida House, HB 583 and SB 160, 2000", "Face the Nation, \"Rubio: Opposing abortion isn’t about denying rights,\" Aug. 26, 2012", "PolitiFact, U.S. Sen. Marco Rubio’s Truth-0-Meter record, Aug. 6, 2015", "Tallahassee Democrat, \"Legislator wants to ban abortion,\" (Accessed in Nexis) Feb. 19, 2009", "Miami Herald, \"Florida prohibits late term abortions,\" Accessed in Nexis May 4, 2000", "Miami Herald, \"Legislature’s abortion law put on hold,\" Accessed in Nexis, June 3, 2000", "Tampa Bay Times, \"Late term abortion ban on hold,\" July 7, 2000", "Interview, Alex Conant, U.S. Sen. Marco Rubio spokesman, Aug. 7, 2015", "Interview, Kevin Bishop, U.S. Sen. Lindsey Graham spokesman, Aug. 7, 2015", "Interview, Aniello Alioto, NARAL spokeswoman, Aug. 7, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]