["About this rating", "In 1990, Congress passed and President George H. W. Bush signed into law the Americans with Disabilities Act (ADA), which extended federal civil rights protections to people with mental or physical impairments:", "The ADA is one of America's most comprehensive pieces of civil rights legislation that prohibits discrimination and guarantees that people with disabilities have the same opportunities as everyone else to participate in the mainstream of American life -- to enjoy employment opportunities, to purchase goods and services, and to participate in State and local government programs and services. Modeled after the Civil Rights Act of 1964, which prohibits discrimination on the basis of race, color, religion, sex, or national origin – and Section 504 of the Rehabilitation Act of 1973 -- the ADA is an \"equal opportunity\" law for people with disabilities.", "More than a quarter-century on, and despite further work to be done, the ADA has so positively affected how people with disabilities are treated and perceived in America that the notion that laws once existed to keep physically and cognitively challenged people indoors and out of sight seems scarcely believable. But it was the case — and not so long ago.", "Beginning in the late 1800s, statutes known as \"unsightly beggar ordinances,\" aka \"ugly laws,\" were enacted in some American cities to rid public spaces of what Chicago Alderman James Peevey euphemistically referred to as \"street obstructions\":", "By street obstructions, Peevey didn't mean food carts, construction materials, roadblocks or potholes.", "He meant beggars, such as the ones described in the Tribune as \"the one-legged individual who, with drooping eye and painfully lugubrious countenance, holds forth his hat for pennies\" or \"the fellows who yell 'ba-na-naas'\" and \"the woman with two sick children who was drawn through the carding-machine in a woolen mill, and who grinds 'Mollie Darling' incessantly on a hurdy-gurdy on a street corner.\"", "Following the example of San Francisco, which had pioneered the legislation in 1867, Peevey helped pass a law in 1881 imposing fines (or stints in the poorhouse) on all who were \"diseased, maimed, mutilated, or in any way deformed, so as to be an unsightly or disgusting object,\" yet dared beg, panhandle, or otherwise make nuisances of themselves in public. Among other cities, Omaha, Columbus, Cleveland, and Portland, Oregon followed suit, all passing ugly laws using virtually identical language.", "In a discussion of Susan M. Schweik's The Ugly Laws: Disability in Public (2009), reviewer Shannon Sommer encapsulates the social and economic developments leading up to these measures:", "Schweik discusses in detail several factors which combined to create the perfect storm for the emergence of ugly law in America at this time. These include: the formation of Charity Organization Societies, the rise or eugenics and state institutions, an increasing focus on using urban planning to create beautiful cities, increasing immigration at a time when there were few restrictions placed on immigration, the large number of soldiers injured in the Civil War which had ended just a few years earlier, temperance and prohibition, and the increasing industrialization of society with resulting industrial-related injuries.", "Schweik notes that though the passage of new ugly laws ceased by the beginning of World War I and enforcement of existing statutes dwindled thereafter, they remained on the books until well into the latter half of the 20th century:", "Schweik found that the last known arrest under an ugly law occurred in Omaha, NE in 1974 when a policeman wanted to arrest a homeless man but had no basis for arrest. After searching the city code and finding that Omaha’s Ugly Law was still on the books he was able to take the man into custody on the basis that the man had “marks and scars on his body.” Prosecutors refused to press charges in this case. Schweik recounts one prosecutor pointing out that “criminal prosecution under this law would require the impossible: courtroom proof “that someone is ugly.”", "That same year, 1974, saw the demise of ugly laws in America. The last city to repeal was Chicago. One of the alderman responsible for killing the law, Paul T. Wigoda, denounced it as \"cruel and insensitive,\" and \"a throwback to the Middle Ages.\" It had been in effect for 93 years.", "Burgdorf Jr., Robert.   \"Why I Wrote the Americans with Disabilities Act.\"\r\n   The Washington Post.   24 July 2015.", "Greiwe, Elizabeth.   \"How an 'Ugly Law' Stayed on Chicago's Books for 93 Years.\"\r\n   Chicago Tribune.   23 June 2016.", "Long, Karen R.   \"Susan M. Schweik's 'The Ugly Law' Exposes Obscure Law of Discrimination.\"\r\n   The Plain Dealer.   4 August 2009.", "Royko, Mike.   \"A Law City Should Keep.\"\r\n   Chicago Daily News.   19 October 1973.", "Sommer, Shannon.   \"The Ugly Laws: Disability in Public.\"\r\n   Galaxy Book Review.   6 September 2011.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]