["A Twitter user Aviral Sharma, who is followed by Prime Minister Narendra Modi, shared a video where a policeman can be seen roughing up a few people who seem to be devotees inside a temple. Sharma claimed that “Christian police personnel manhandled Tirumala temple devotees”. He also took a jibe at the newly-election Chief Minister of Andhra Pradesh Jagan Mohan Reddy. “Jagan Reddy is a Vatican stooge who refused to light a lamp & gives Jerusalem ads on Tirupati bus tickets!” – wrote Sharma.", "A similar claim is also floating on Facebook. From the page ‘Resurging Dharma’ the video has received over 11,000 views. It was circulated with the claim – “Non #Hindu security personal manhandling Hindu devotees at #Tirumala, Save Tirumala. remove all non-#Hindus working inside Hindu Temples!” Several other users also have also shared the video.", "Non Hindu security personal manhandling Hindu devotees at Tirumala, Save Tirumala.", "Non #Hindu security personal manhandling Hindu devotees at #Tirumala, Save Tirumala.😢 remove all non-#Hindus working inside Hindu Temples! 😡", "Posted by Resurging Dharma on Friday, 23 August 2019", "The clip is, in fact, doing rounds on social media, with a similar claim, since 2017. From a Facebook page Amaravati – AP Capital, it drew 5.3 million views, more than 1.2 lakh shares and over 10,000 likes.", "Alt News broke the video into multiple frames and reverse-searched one of the images on Google. We were redirected to a 2014 broadcast by YouTube channel APN News which carried the same video. According to the channel, the incident took place in Banke Bihari Temple in Uttar Pradesh.", "The anchor says that a large number of devotees had gathered at the temple and the police manhandled a few of them to control the crowd. An officer got into a verbal scuffle with a woman whose husband was pushed around. Many devotees had to return without offering their prayers.", "Apart from the false claim that the video is from Andhra’s Tirumala temple, Twitter user Aviral Sharma also termed CM Jagan Mohan Reddy a “Vatican stooge” because he allegedly denied “lighting a lamp.” Reddy was recently on a US visit, seeking investments for his state. The BJP had claimed that the Andhra CM refused to light a ceremonial lamp and termed him ‘anti-Hindu’. It later came to light that the lamp was electric. BJP Andhra Pradesh has now taken down its tweet.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]