["The screenshot, shared here and here (archived posts), purports to show Trump congratulating his Ethiopian counterpart on his \"brave leadership in Ethiopia\".", "\"This is a good thing for the country and a good thing for the people of Ethiopia,\" it says.", "One post was shared shortly after Abiy won the Prize on October 11, and another after he collected the award in Oslo on December 10.", "The Nobel committee honoured Abiy -- Africa's youngest leader at 43 -- for progress in the months after he took power in April 2018, including formally ending a stalement with Eritrea and pushing to introduce democratic elections in a country long ruled by authoritarian governments.", "AFP ran a Google reverse image search on screenshot shared on Facebook and found an earlier share of the post in June 2018, long before Ahmed won the Nobel Peace Prize.", "However, an advanced search on Twitter found no trace of the tweet on Donald Trump's official account. We also searched keywords from the screenshot in The Trump Archive, a tool that saves all tweets from Trump's account -- even ones that have been deleted.", "Although Trump has tweeted about Ethiopia in the past, there was no record of a tweet congratulating Abiy Ahmed.", "Furthermore, an advanced search on Twitter using keywords from the tweet reveals an original post from an account called Habesha Networks.", "\"A wonderful congratulations to Dr. Abiy Ahmed and his brave leadership in Ethiopia. He is exactly what Africa needs. Bold, fresh, leadership. This is a good thing for the country and a good thing for the people of Ethiopia. My salute to you for real change.\"\n\t\t- #DJT? pic.twitter.com/pqw9xfU39O", "AFP has previously debunked fake Trump tweets relating to Ethiopia. You can read our fact-checks here and here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]