["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Among Ohio’s Republican candidates for governor, Lt. Gov. Mary Taylor portrays herself as more conservative than Attorney General Mike DeWine when it comes to Second Amendment issues.", "\"I do not trust Mike DeWine on guns,\" Taylor said during a Jan. 29 speech at the Washington Heights Baptist Church. \"He flip-flopped on the gun issue and has earned an F from the NRA. I have an A with the NRA.\"", "Taylor and DeWine are competing in the May 8 Republican primary for governor with hopes to replace term-limited Gov. John Kasich.", "There is no disputing that DeWine once received an F grade from the NRA, which was based on his stances while in the U.S. Senate more than a decade ago. In 2002, the Columbus Dispatch described DeWine as a \"Republican who's not afraid to stand up to the National Rifle Association.\"", "But when DeWine ran for Ohio attorney general in 2010, his positions on gun laws changed. Taylor omits that DeWine’s grades from pro-gun groups have risen as he has taken stances more in line with the NRA.", "The NRA did not respond to our requests to confirm DeWine’s grades, but DeWine’s campaign spokesman sent PolitiFact documents showing his grades by the NRA, as well as from a state group, the Buckeye Firearms Association.", "DeWine has served in elected office since he won a county prosecutor position in 1976. We largely focused our search of his gun stances starting with his tenure in the U.S. Senate from 1995 to 2007.", "Taylor’s campaign spokesman Michael Duchesne pointed to Vote Smart’s compilation of DeWine’s ratings from groups that take stances on gun laws. The NRA gave DeWine a 46 percent in 2000, an 8 percent in 2006 and an F in 2010.", "DeWine supported multiple gun control measures while a senator, including restrictions on sales at gun shows and the assault weapons ban.", "In 1999, DeWine was one of a handful of Republicans to side with Democrats to support an amendment to enact a waiting period on sales at gun shows following the mass shooting at Columbine High School.", "\"The amendment seemed on balance to make sense,\" he said a year later. \"I feel that the requirement to follow the Brady gun-check law should apply to everyone at a gun show and that's what this amendment did.\"", "In 2001, Dewine co-sponsored a bill with U.S. Sen. Charles Schumer, D-N.Y., to impose a three-day waiting period on gun show purchases, which was opposed by the NRA.", "DeWine was outspoken in favor of extending the assault weapons ban. In 2005 when Sen. Dianne Feinstein, D-Calif., introduced legislation to re-establish the expired ban, DeWine was among a group of bipartisan cosponsors.", "\"Re-establishing the assault weapons ban is simply good public policy. The law modestly prohibits a select few military-style weapons, all the while protecting the rights of legitimate gun owners nationwide,\" DeWine said. \"As a former prosecutor, I understand the challenges Ohio's mayors and law enforcement officials face, and we owe it to them to reestablish this law.\"", "In 2006, the Brady Campaign to Prevent Gun Violence endorsed DeWine in his re-election, according to news reports. DeWine lost to Democratic U.S. Rep. Sherrod Brown that fall.", "The Columbus Dispatch later wrote, \"DeWine's 2006 defeat was primarily because voters were sick of the war in Iraq, not because they believe everyone in Ohio should own a machine gun.\"", "In 2010 while running for attorney general, DeWine’s campaign told sportsmen and Second Amendment groups that he regretted his assault weapons vote, said Ryan Stubenrauch, who has worked on behalf of DeWine’s campaigns between 2010-18.", "Stubenrauch said that while DeWine was in the Senate, he heard from law enforcement officials who said they supported the assault weapons ban.", "But he later concluded the assault weapons ban \"didn’t do anything.\" (Firm conclusions about the impact of the ban are not possible, PolitiFact has previously concluded.)", "In 2010, the NRA still gave DeWine an F. But his support from gun rights groups would change after he was elected attorney general.", "While attorney general, DeWine repeatedly took stances in favor of gun rights by supporting legislation in Congress and the Ohio Legislature. He also signed on to amicus briefs before the U.S. Supreme Court, including in support of the Illinois State Rifle Association, opposed a federal proposal to ban a certain type of ammunition and supported efforts to arm school teachers.", "In 2012, DeWine supported the National Right-to-Carry Reciprocity Act to allow any person with a valid state-issued concealed firearm permit to carry the concealed firearm in many other states.", "He also supported state bills that removed some requirements for concealed carry license holders.", "When DeWine sought re-election in 2014, the Buckeye Firearms Association gave DeWine a B grade and endorsed him while the NRA gave him a C plus. DeWine’s campaign spokesman said as of Feb. 21 he wasn’t aware of any grade by the NRA for his current race.", "One other sign of DeWine’s pro-gun stance: He named Secretary of State Jon Husted, who has received an A plus from the NRA, as his running mate.", "Our rating will only be based on information that was available at the time that Taylor made her statement in January, but we will note that in February the Republicans split endorsements from state gun-rights groups. DeWine was endorsed by the Buckeye Firearms Association, and Taylor was endorsed by Ohioans for Concealed Carry.", "Taylor said DeWine \"flip-flopped on the gun issue and has earned an F from the NRA.\"", "DeWine did receiving failing grades from the NRA based on his record in the U.S. Senate, including in 2010 when he ran for Ohio Attorney General.", "As Taylor noted broadly, DeWine did flip-flop. As attorney general he has taken several stances more aligned with the NRA and no longer supports an assault weapons ban.", "Taylor zeroes in on DeWine’s record from many years ago and omits that by 2014, he had clearly earned the support of the Buckeye Firearms Association when it endorsed his re-election.", "We rate this claim Mostly True.", "YouTube, Lt. Gov. Mary Taylor speech at Washington Heights Baptist Church, Jan. 29, 2018", "Ballotpedia, Mike DeWine, Accessed Feb. 21, 2018", "On The Issues, Mike DeWine on gun control, 1998-2005", "Ohioans for Concealed Carry, OFCC Endorsing Taylor for Governor, Feb. 7, 2018", "Vote Smart, \"Mike DeWine's Ratings and Endorsements on Issue: Guns,\" 1999-2010", "Buckeye Firearms Association, \"Primary polling indicates potential DeWine-Cordray general election rematch,\" Jan. 29, 2018", "Buckeye Firearms Association, \"BATFE Director’s Comments Show Fight Isn’t Over; Ohio AG DeWine signs letter condemning potential ammo ban,\" March 23, 2015", "Buckeye Firearms Association, \"Ohio Attorney General Mike DeWine joins coalition urging passage of National Right-to-Carry Reciprocity,\" May 22, 2018", "Buckeye Firearms Association, \"Ohio Attorney General Mike DeWine calls for arming school employees,\" Dec. 19, 2012", "Buckeye Firearms Association, \"Buckeye Firearms Association PAC Endorses Mike DeWine for Governor,\" Feb. 8, 2018", "Buckeye Firearms Association, \"He's BAAACK!: Anti-gun Mike DeWine seeks Ohio AG slot three years after Ohio voters send him packing,\" July 6, 2009", "U.S. Supreme Court, Amicus Brief in Arie S. Friedman and the Illinois State Rifle Association v City of Highland Park, Illinois, Aug. 28, 2015", "AP, \"Senate rejects any new restrictions on gun-show sales,\" (Accessed in Nexis) May 12, 1999", "AP, \"Ohioans among just six GOP votes on gun-control amendment,\" (Accessed in Nexis) May 13, 1999", "Columbus Dispatch, \"Six challengers putting heat on incumbent DeWine hearing from critics, but party brass not among them,\" (Accessed in Nexis) Feb. 20, 2000", "AP, \"Gun vote inspired first-time candidate to oppose DeWine,\" (Accessed in Nexis) Feb. 19, 2000", "AP, \"McCain, Lieberman tout gun control bill,\" (Accessed in Nexis) May 15, 2001", "Gannett, \"DeWine signs onto ballistic fingerprinting bill,\" (Accessed in Nexis) Oct. 29, 2002", "Toledo Blade, \"Advocates of gun control win round in Congress,\" (Accessed in Nexis) March 3, 2004", "AP, \"Feinstein bill would re-establish assault weapons ban,\" March 14, 2005", "Columbus Dispatch, \"Laid-back DeWine failing to inspire conservatives this year,\" (Accessed in Nexis) Oct. 29, 2006", "Cleveland Plain Dealer, \"Senate OKs relaxing rules on weapons,\" (Accessed in Nexis) Dec. 10, 2014", "Columbus Dispatch, \"Courage scarce in face of NRA,\" (Accessed in Nexis) July 30, 2012", "Cincinnati Enquirer, \"Exploiting Mike DeWine's gun problem,\" Sept 9, 2017", "Cleveland Plain Dealer, \"GOP hopefuls brandish gun-rights backing Ohio governor’s race,\" Feb. 8, 2018", "PolitiFact, \"Fact-checking the NRA's response to proposed gun laws after Las Vegas,\" Oct. 10, 2017", "Interview, Ryan Stubenrauch, Mike DeWine’s campaign spokesman, Feb. 20, 2018", "Interview, Michael Duchesne, Mary Taylor’s campaign spokesman, Feb. 14, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]