["A Jan. 26 meme posted to Facebook alleges the sons of four politicians serve on the boards of energy companies with ties to Ukraine.", "The meme includes pictures of Sen. Mitt Romney, R-Utah, House Speaker Nancy Pelosi, D-Calif., President Joe Biden and former Secretary of State John Kerry beneath text that states \"Biden's son, Romney's son, Pelosi's son, Kerry's son ... all are on the board of directors for energy companies doing business in Ukraine.\"", "The meme was posted without a caption. USA TODAY reached out to the poster for comment.", "More:Fact check: Biden executive order halts border wall construction, redirects funding", "The source of the claim appears to be an Oct. 6, 2019, tweet by Jack Murphy, co-founder of conservative opinion outlet TrendingPolitics. Murphy's Twitter account was suspended along with the official account for TrendingPolitics in January, according to the website.", "\"Biden's son, Pelosi's son, Romney's son, Kerry’s son. All are on the board of directors for energy companies doing business in Ukraine… Coincidence? No,\" the tweet stated, according to PolitiFact.", "More:Fact check: False claim linking Paul Pelosi Jr., Hunter Biden and Burisma", "Kerry, a former senator who served in President Barack Obama's cabinet as secretary as state, was named Biden's special climate envoy in November, USA TODAY reported.", "Romney has become the target of many supporters of former President Donald Trump, having cast the sole Republican vote to convict the former president following his 2019 Senate impeachment trial.", "The Utah senator was one of five Republican senators who joined Democrats in rejecting Kentucky Sen. Rand Paul's motion to condemn Trump's second impeachment trial as unconstitutional, according to USA TODAY.", "Biden faced accusations from Trump's campaign in 2020 of attempting to thwart investigations into Ukrainian energy company Burisma Holdings. The president's son Hunter Biden served on the company's board, USA TODAY reported.", "Pelosi presided over both of the former president's impeachments in the House.", "More:Fact check: False conspiracy theories allege connection between Biden victory and Ukraine", "Trump's first impeachment stemmed from his attempt to persuade Ukrainian President Volodymyr Zelensky to investigate Joe Biden in exchange for military aid in September 2019.", "A rumor targeting Biden began circulating in October 2019. It accused Biden of withholding $1 billion in aid to Ukraine to stop an investigation into Ukrainian gas company Burisma Holdings. Biden's son, Hunter, was a Burisma board member from 2014-2019, according to USA TODAY.", "In 2016, then-Vice President Biden did leverage the aid to pressure Ukraine to oust prosecutor Viktor Shokin for failing to pursue corruption among top politicians. Burisma was not under scrutiny, and Hunter Biden was not investigated, USA TODAY reported.", "In a fall 2020 investigation, Senate Republicans determined Biden did not misuse his office to help his son, according to USA TODAY.", "The meme's claim about Hunter Biden is true, given his Burisma ties.", "National File, a news and opinion website for the \"New Right,\" and conservative opinion website Legal Insurrection published articles in late 2019 alleging Pelosi's son Paul Pelosi Jr.'s financial ties to Ukraine.", "In a Nov. 15, 2019, article, National File's Patrick Howley embedded his Oct. 3, 2019, tweet with a link to a video of Pelosi and her son speaking at a 2010 XPRIZE Foundation event held in Washington. The event was hosted by Viscoil Holdings LLC, a southern California-based energy company that reorganized as Singapore-based NRGLab in 2013, USA TODAY reported.", "The video was posted to the YouTube account for NRGLab & New Technology on March 5, 2013. The caption names Pelosi Jr. as \"a member of management team of Viscoil Group of Companies and NRGLab.\" In the video, Pelosi says he is a board member.", "Nancy Pelosi's office told FactCheck.org that Paul Pelosi Jr. worked for the group for a brief time before it dissolved in 2010. State records show the company was based in Escondido, California, according to reporting by USA TODAY.", "An Oct. 4, 2019, post to the website for conservative commentator Wayne Durpree alleged that Pelosi Jr. visited Ukraine in 2017 \"to meet with government officials in regards to a business initiative.\"", "He appeared on Ukrainian television during a 2017 visit to Kyiv to promote a partnership between Corporate Government Initiative — a corporate watchdog based in Arizona — and the Ukrainian government as part of the World Sports Alliance. He was executive director of CGI at the time, according to PolitiFact.", "A video of the appearance embedded in an article in The American Mirror has been removed from YouTube.", "In January, Pelosi Jr. became director and president of EVSX Corp., a subsidiary of Canadian mining company St-Georges Eco-Mining, according to a Jan. 20 company press release.", "Kerry has three stepsons from his marriage to Teresa Heinz-Kerry, USA TODAY reported in 2004.", "The eldest, John Heinz IV, is a noted recluse and blacksmith, according to a 2004 Chicago Tribune article. A Buddhist educator, Heinz once funded an arts and science school for at-risk youth in Bucks County, Pennsylvania. He will become chair of the Heinz Endowment in 2024, the Pittsburgh Post-Gazette reported.", "André Heinz co-founded investment startup Sustainable Technologies Fund after holding several jobs promoting environmental sustainability, according to the company's website.", "Younger brother, Christopher Heinz worked in private equity and venture capital, serving as senior vice president at PNC Bank before joining The Center for New American Security as director of the board of advisers for the Heinz Endowment, per the center's website.", "Heinz-Kerry transferred chairmanship of the Heinz Endowment to her three sons in 2016, according to the Post-Gazette.", "Kerry's stepsons have no apparent ties to Ukraine, though Christopher Heinz started an investment firm with Hunter Biden and Devon Archer, a fellow Yale graduate. A spokesman for Heinz told The Washington Post in 2019 that he ended the business relationship with Biden and Archer because “joining the board of Burisma Holdings was a bad idea,” according to reporting by FactCheck.org.", "The spokesman, Chris Bastardi, confirmed to FactCheck.org that Heinz has no Ukraine connections. “Mr. Heinz has never been on the board of any energy company; nor has he ever traveled to or worked in Ukraine,” Bastardi said. “Chris was never involved with Burisma in any way.”", "All but one of Romney's five sons are businessmen. Eldest son Tagg co-founded private equity firm Solomere Capital in 2008, according to its website.", "Matthew Romney is the managing director of Capital Markets for Sundance Bay, a Utah-based investment strategy firm. Youngest brother Craig Romney is the director for asset management for the company, according to its website.", "Josh Romney is chairman and owner of Utah-based mortgage lending company, Intercap Lending, per its website.", "Benjamin Romney is listed on the website for Intermountain Healthcare in Salt Lake City as a radiologist.", "USA TODAY reached out to Arielle Mueller, Romney's press secretary, for comment.", "\"We don’t comment on fake news from random internet trolls,\" she said.", "We rate this claim PARTLY FALSE, based on our research. A meme alleging the sons of several politicians served on the boards of energy companies based in Ukraine relies on unfounded information. Hunter Biden, son of President Joe Biden, was a board member of Ukrainian gas company Burisma Holdings from 2014-2019, but no longer works for the company. But it is false to make the claim of the other sons mentioned; the sons of Mitt Romney, John Kerry and Nancy Pelosi have no connections to boards that do work in Ukraine.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook."]