["A group of 22 migrants, mostly women and children from Honduras and Guatemala, in custody just after crossing the Rio Grande near McAllen, Texas, June 18, 2014. (Jennifer Whitney/The New York Times)", "So far this year, over 47,000 children without their parents have shown up at the southern border and the government is scrambling to deal with them. Homeland Security Secretary Jeh Johnson published an open letter in Spanish-language newspapers earlier this week, urging parents in El Salvador, Guatemala and Honduras to stop sending their children north. House Speaker John Boehner formed a group of representatives to focus on the surge of children migrants.", "In a news conference, Boehner faulted President Barack Obama.", "\"We’re seeing a humanitarian disaster, one of the administration’s own making,\" Boehner said.", "Some of the president’s critics go much further. In a June 24 broadcast, conservative talk show host Rush Limbaugh said the administration planned the surge at the border.", "\"You tell me this is not purposeful,\" Limbaugh said. \"Listen. Six months ago, the regime began planning how to transport tens of thousands of undocumented children from the border.\"", "For Limbaugh, the smoking gun is a Jan. 29, 2014, posting for contract work by the Homeland Security Department. The agency said it wanted a private company to take as many as 65,000 children in the course of the year and hand them over to the department of Health and Human Services.", "\"On Jan. 29, they knew,\" Limbaugh said. \"Somebody had advance knowledge that these thousands of undocumented children would be flooding the border ... All these kids were planned in advance to show up.\"", "That contract work posting has generated a lot of speculation in conservative circles. It appeared a week and a half ago on the website Infowars.com with the interpretation that the government sought to escort illegal immigrants into the United States. Soon after, that allegation morphed into the suspicion that the surge reflected some hidden plan by the administration to advance a political agenda.", "\"This advertisement raises a lot of questions,\" said the website Weasle Zippers on June 20. \"There is a lot of specificity reflected in this document that seeks to deal with an influx that hadn’t as yet happened.\"", "In this fact-check, we examine the evidence that the Obama administration planned the influx.", "The story behind the estimate", "In November 2013, the United States Conference of Catholic Bishops sent a delegation to Mexico, El Salvador, Guatemala and Honduras to get a better understanding of why unaccompanied children were flooding America’s southern border. Jeanne Atkinson, director of the Catholic Legal Immigration Network, went on that trip and met with two Homeland Security officials stationed in the region.", "The report from that trip said that in November the Homeland Security Department estimated \"that more than 60,000 unaccompanied minors could enter the United States during 2014.\"", "\"The numbers are not pulled out of a hat,\" Atkinson told PunditFact. \"Based on looking at past years and the daily numbers, we knew it was an estimate but it seemed like a reasonable estimate.\"", "A rising trend line", "Here’s a graph of the numbers Atkinson and her team saw. The figures from the Homeland Security Department (see the raw data here) show a rapid increase in the number of children stopped as they tried to enter the country. The shift began in 2011 and it was driven by children leaving El Salvador, Guatemala and Honduras.", "Between 2011 and 2012, the number of children leaving those three countries increased by 158 percent. The next year, the increase was 105 percent. We ran the numbers several different ways. Allowing for the modest increase from Mexico, by the end of fiscal year 2013, officials would have been looking at an average annual increase of 55 percent from the four countries combined. Multiply that by the total in 2013, about 38,000, and you get just under 60,000.", "The data in the graph are for fiscal years which end in September. The 2014 data does not include the entire year. The point is, in the fall of 2013, anyone looking at the situation would be seeing steep increases.", "W. Ralph Basham was commissioner of U.S. Customs and Border Protection from 2006 to 2009. Basham told PunditFact that the government estimates in 2013 follow established practice. He said people should remember they are based on more than just the numbers.", "\"The Border Patrol interview these people on the border,\" Basham said. \"When they hear what's going on the ground in these countries and why these people are leaving, they start to put the numbers together. They are always looking at trends to prepare themselves to deal with these surges. Unfortunately, this time it got ahead of them.\"", "Basham said he finds it \"hard to buy the notion that the administration planned this.\" He said the situation on the border stems from a \"perfect storm\" of rampant violence, sometimes by gangs, in El Salvador, Guatemala and Honduras, limited capacity in this country to quickly send these children home and a belief in Central America that if you get over the border, you can stay in America.", "The Migration Policy Institute, a research group that promotes better management of immigration flows, pointed to the impact of a 2008 law, the Trafficking Victims Protection Reauthorization Act. Under this legislation, signed before Obama took office, the government follows what the institute called a \"more child-friendly\" policy that could encourage more families to take the risk of trying to get their children into the country.", "Atkinson with the conference of Catholic bishops said she has heard first-hand accounts of the threats to children, including gang members seizing teenage girls from their homes.", "\"These mothers and grandmothers told me, ‘Do you think we would send them away if we had any other option?’ \" Atkinson said.", "Basham said the governments in El Salvador, Guatemala and Honduras need to contain this violence but so far, they’ve been unable to.", "Our ruling", "Limbaugh said the Obama administration planned the rapid influx of children attempting to get into the country. Not that the administration planned for the influx, but actually planned it. Limbaugh did not return our requests for comment, but his evidence was a request for contract services from early 2014 that projected that about 65,000 children would need to be moved to temporary shelters. Limbaugh viewed that estimate with suspicion.", "In reality, the rising number of unaccompanied children arriving at the border was well established by the end of 2013. Catholic relief workers and a past Homeland Security commissioner said all the data pointed to a continued increase into 2014. Many of the factors behind the surge of children lie outside the control of the administration. No expert we reached gave any credence to the idea that the administration planned this crisis on the border.", "We rate the claim Pants on Fire.", "Rush Limbaugh Show, Obama regime planned the influx of illegal alien children at the border, June 24, 2014", "Federal Business Opportunities, Escort Services for Unaccompanied Alien Children, Jan. 29, 2014", "Homeland Security Department, An Open Letter to the Parents of Children Crossing Our Southwest Border, June 23, 2014", "United States Conference of Catholic Bishops, Mission to Central America: The Flight of Unaccompanied Children to the United States, November 2013", "U.S. Customs and Border Protection, Southwest Border Unaccompanied Alien Children", "Weasel Zippers, Government Advertised In JANUARY For \"Escorts\" For 65,000 Illegal Alien Children To Be \"Resettled\", June 20, 2014", "Migration Policy Institute, Dramatic Surge in the Arrival of Unaccompanied Children Has Deep Roots and No Simple Solutions, June 13, 2014", "Dallas Morning News, Upfront hearings a must to stem tide of border-crossing children, June 22, 2014", "Media Matters, Alex Jones Conspiracy Theory On Immigration Makes Its Way To CNN, June 25, 2014", "InfoWars.com, DHS TO PAY FOR ILLEGAL IMMIGRANTS TO BE ESCORTED INTO U.S., June 19, 2014", "Investors Business Daily, Contract Shows Obama Planned Border Invasion, June 25, 2014", "Washington Examiner, Does this Jan. 29, 2014, contract bid request 'prove' Obama planned migrant child flood at the border?, June 20, 2014", "Mother Jones, 70,000 Kids Will Show Up Alone at Our Border This Year. What Happens to Them?, June 2014", "Center for Gender and Refugee Studies/Kids in Need of Defense, A treacherous journey: Child migrants navigating the U.S. immigration system, February 2014", "The Hill, Boehner: Obama's 'wheels are coming off', June 19, 2014", "CBS News, No short-term fixes for flood of unaccompanied child immigrants, June 25, 2014", "Politico, John Boehner forms group to address child migrant crisis, June 24, 2014", "Email interview, Jeanne Atkinson, executive director, Catholic Legal Immigration Network, June 27, 2014", "Email interview, Kenneth J. Wolfe, deputy director, Office of Public Affairs, Administration for Children and Families, U.S. Department of Health and Human Services, June 27, 2014", "Email interview, W. Ralph Basham,  former commissioner, U.S. Customs and Border Protection 2006 to 2009 and founding partner, Command Consulting Group, June 27, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]