["A message viral on WhatsApp reads, “Dear All, Pl, note that all the Banks will remain closed for six days. 2nd Sept- Sun, 3rd Sept-Janmashtami, 4th, 5th Sept – Banks strike protest for pension. 8th, 9th Sept- sat & sun – Closed. All ATM’s may remain cashless. Pl, plan accordingly.", "The message is also widely spread on Facebook by individual users claiming that all banks will be closed from September 2 to September 9, with the exception of September 7.", "The Ministry of Finance issued a press release on August 31 to clarify that the rumours circulating are baseless. Banks will remain shut on September 2 in the first week of the month as it is a Sunday. Janmashtami falls on September 3 and is not a gazetted holiday thus, only some banks might remain closed across the country. The United Forum of Reserve Bank Officers and Employees (UFRBOE) has called for a two-day mass casual leave on September 4 and 5 over longstanding pension-related issues. However, this will not have any effect on banking activities which will continue unimpeded. September 8 is the second Saturday of the month and September 9 is a Sunday hence, banks will remain closed on both the days.", "The MoF has also clarified that “banks are advised to ensure availability of sufficient cash for dispensation from ATMs.”", "Regulations pertaining to the refilling of ATMs will, however, undergo some regulations with effect from February 8, 2019. According to a new directive by the Union Home Ministry, no ATMs will be replenished with cash after 9 pm in cities, 6 pm in rural areas and 4 pm in Naxal-hit areas. The move aims to improve security by addressing attacks on cash vans, cash vaults, ATM frauds and other internal frauds.", "WhatsApp messages are often forwarded without authenticating the information thus, causing unnecessary panic among citizens. These should first be cross-checked with credible media sources before circulating to others.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]