["The photo was published in this Facebook post on June 14. It has been shared more than 2,000 times.", "The Facebook post's caption states: “China installed this banner in Ladakh. Clear message to Modi.”", "Modi refers to Indian Prime Minister Narendra Modi, who was elected in 2014.", "Renewed tensions between China and India in India-administered Ladakh led to a deadly clash that had killed at least 20 Indian soldiers on June 16. The confrontation marked the first deadly incident in a long-running border dispute between the two Asian nuclear powers in nearly half a century, AFP reported here.", "The photo was also shared here, here, here and here on Facebook, as well as here, here, here and here on Twitter alongside a similar claim.", "The claim is false; the photo has circulated in reports since 2012, before Modi became prime minister.", "A reverse image search on Google found the same photo published here in a report by Canadian newspaper Vancouver Sun on October 24, 2012. The photo was attributed to Daniel Berehulak, who was a Getty Images staff news photographer in India at the time, according to his personal website.", "A subsequent keyword search on Google found the photo published on Getty Images’ website on October 5, 2012.", "The Getty Images photo caption states: “An Indian Military banner post is seen on the road to Pangong Lake on October 5, 2012 near to Leh, Ladakh, India. Ladakh, nestled between the Kunlun mountain range in the north and the main Great Himalayas to the south, was once an ancient Buddhist Kingdom and for over half a century now, a strategic military outpost for India. Ladakh, sharing borders with both China and Pakistan, has seen an increase in tourism over the last few years, an alternative to Nepali Himalayan treks.”", "Below is a screenshot comparison of the photo in the misleading posts (L) and the Getty Images photo (R):", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]