["About this rating", "The appearance of a new volunteer patrol group in New York City spurred familiar but false accusations.", "Vehicles bearing the Muslim Community Patrol Service's name (MCPS) and emblem were first spotted in parts of Brooklyn in December 2018, prompting media personality Laura Loomer to post a photograph of one of the vehicles above the caption \"The job of the people driving the cars is to enforce Sharia law. In case you never thought Sharia would be in America, well, it's here. I HAVE BEEN WARNING ALL OF YOU!!! Time to wake up people. #NoSharia #911 #Neverforget\":", "While Sharia, a faith-based code of conduct, does exist, Loomer's post was among a cascade of falsehoods claiming that Muslims are intent on staging a takeover of the U.S.", "MCPS Vice President Noor Rabah dismissed the accusation that the group's purpose was to \"enforce Sharia law\":", "It's not about \"Sharia Law.\" It's about Muslims taking care of people in our community. But it's not just Muslims. If we're driving or we're patrolling and we see a guy attacking a woman we don't ask \"What's your religion? What do you believe in? Who's your God?\" We're there for preventative measures and it doesn't matter who's going through what -- white, black, orange, green, nun, hijabi, we're there to help our community.", "Like other local community patrol groups, MCPS members do not have the authority to arrest people. Rabah said the group had around 30 regular members, with 30 others volunteering services on a more limited basis. The photographs seen online, he maintained, captured the group's patrol vehicle on what he called a \"dry run\" before the MCPS program's formal launch in 2019.", "\"Most of our patrolling is going to be motor patrol,\" Rabah said. \"We will be driving. The goal is that with our presence, there will be a preventative measure for people who are inclined toward crime -- that seeing the car would stop the average criminal. That's one thing. Two, if we were to see something we would say something; if we see suspicious activity, if we see someone's driving drunk [or] causing a disturbance, just by being in these areas we can contact 911 a lot quicker than someone who is in trouble before things get out of proportion.\"", "Besides acting as \"eyes and ears\" for police, he added, MCPS members are already connected to their communities enough to defuse situations while avoiding potential cultural misunderstandings.", "\"We're not here to arrest people,\" he said. \"Rather, if we see for example a young man smoking weed -- we know him, we can come up to him, greet him and say, 'You might not care if a cop came to you right now and stopped you but you probably would care if your mom or dad found out that you were smoking weed.'\"", "While more than 30 members had already received certification in New York City's Community Emergency Response Teams (CERT) program and each member must pass a background check, Rabah said, the MCPS had already won the support of officials in the New York Police Department's 72nd District and planned to work with them to receive further training.", "However a department spokesperson, Sgt. Jessica McRorie, seemingly offered a negative reaction toward MCPS' vehicles in an interview with the website PJ Media, saying \"This is not an NYPD vehicle. The NYPD did not outfit or label this vehicle. This group is not officially sanctioned by the NYPD and they are subject to the law.\"", "By comparison, the website reported, the department endorsed another civilian patrol group, the Brooklyn Asian Safety Patrol (BASP), going so far as to allow it to use an official logo.  PJ Media offered nothing that demonstrated the MCPS could, or planned to, \"enforce Sharia law,\" beyond engaging in the speculative hypothetical that the MCPS might somehow \"apply ... Sharia in its community monitoring\":", "Given this background, the NYPD's full-throated insistence that there is no link between the Big Apple's police and the MCP suggests that the Islamic group does not enjoy the same status and training as [the Jewish patrol group] Shomrim or BASP.", "If the Muslim Community Patrol is off-book and does not coordinate with the NYPD, it may apply specific readings of Sharia (Islamic law) in its community monitoring. Since some forms of Sharia advocate honor killings, child brides, and other abuses, they may directly violate some American or New York City laws.", "Rabah asserted that his group's vehicles were approved by the 72nd Precinct before the test run.  \"We're not looking for someone to 'outfit' our car,\" he said. \"We're looking for equal respect.\"", "Ibrahim Hooper, spokesman for the Council on American-Islamic Relations, said McRorie's remark \"deserves further clarification by the NYPD.\" We asked the NYPD whether they shared the site's concern regarding \"Sharia Law\" and whether any officials had met with members of the Muslim patrol, but the department did not respond prior to publication.", "Both MCPS and BASP, along with Shomrim, were honored by Brooklyn Borough President Erik Adams and Kings County District Attorney Eric Sanchez at a ceremony on 2 January 2019.", "During the ceremony, Adams called for additional funding to be offered to community patrol groups.", "Seavers, Kris.   \"Laura Loomer Gets Booted from Twitter for Hate Speech.\"\r\n    Daily Dot.   21 November 2018.", "Bailey, Chelsea. \"Laura Loomer Banned from Uber & Lyft After Anti-Muslim Tweetstorm.\"\r\n    NBC News.   2 November 2017.", "Yeshiva World News.   \"Brooklyn Boro President Honors Volunteer Patrols – Including Shomrim and New Muslim Patrol.\"\r\n    Accessed 7 January 2019.", "Meminger, Dean.   \"Meet the Community Patrols Keeping NYC Safe.\"\r\n    NY1.   2 January 2019.", "Moore, Tina and Stephanie Pagones.   \"New York Muslims Have a New Security Patrol Group.\"\r\n    New York Post.   24 December 2018.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]