["Elba Island natural gas terminal along the Savannah River. AJC file photo", "Anything that has to do with jobs captures the scribes’ eyes here at PolitiFact Georgia.", "And it was an eye-popping number of jobs that the American Petroleum Institute attributed to the oil and gas industry in a recent press release.", "\"The oil and natural gas industry provides or supports 141,600 jobs in Georgia,\" according to the blog posting designed to highlight the economic and job impact the energy industry has on the Peach State.", "This for a state that has yet to produce a single drop of commercially produced gas or oil, we wondered?", "The numbers", "The API cited a 2013 report that it commissioned, Economic Impacts of the Oil and Natural Gas Industry on the U.S. Economy in 2011, from PricewaterhouseCoopers.", "The report includes state-by-state breakdowns on how many jobs have been created, as well as the overall economic impact of the U.S. oil and natural gas industry.", "The analysis arrives at the 141,600 job estimate first with data from the U.S. bureaus of Economic Analysis and of Labor Statistics for a dozen job codes. The report breaks that job tally into three categories.", "It says 42,638 jobs were directly involved in the oil and natural gas industry. That includes the expected extraction and production jobs and – as we will get to in a moment – a total of 29,146 jobs at gas stations with and without convenience stores.", "If that were the only category, those jobs would account for just 0.8 percent of all Georgia jobs.", "But the report classifies another 33,502 workers as indirectly involved in the oil and gas industry, or with positions in activities in outside industries that supply those fields.", "Drew Lyon, principal and leader of the national economics and statistics group at PwC and the author of the report, said care was taken to eliminate double counts so that some suppliers who would have been in the direct jobs tally were removed.", "Then the largest number of jobs -- 65,490 -- are counted as \"induced\" jobs. Lyon said those are the positions that are created to meet the demand from the spending of employees in the direct and indirect jobs.", "In that category, the general \"service\" field has by far the most indirect and induced jobs, with 43,349 workers – or 711 more employees than work directly for the oil and natural gas industries.", "Considering those jobs are apt to be in professional services, healthcare, education and the like – all known powerhouses in metro Atlanta’s economy -- those numbers are not surprising.", "And to Lyon, they show how many of those back office jobs -- say in human resources -- owe their existence to an industry thought of as minor in the Peach State.", "\"It’s no surprise, for example, that a significant amount of employment in Texas is directly related to oil and gas,\" Lyon said. \"But it’s of interest in how other states, either as suppliers to in-state or out-of-state producers, or through some of these other industries, are impacted by the oil and gas industry.\"", "Taken together, that brings the total to 141,600 jobs, or 2.7 percent of the Georgia workforce.", "But is it fair to count all of those jobs, knowing that two thirds of the positions in question are outside the oil and gas industries?", "Bruce Seaman, an economist at Georgia State’s Andrew Young School of Policy Studies, said he was not troubled with the methodology of the study.", "The report took care not to count jobs twice and also used commonly accepted input-output models to show the known relationships between industries (Basically, the output from one industry become inputs in another but must be adjusted not to exaggerate the impact).", "That said, Seaman wondered about the service station employees, who primarily are not working as pump attendants or mechanics. Especially at stations with stores, those workers are apt to run the cash registers, do janitorial work or even cook.", "\"Those jobs are more accurately convenience store retail jobs,\" Seaman said.", "The BLS codes back up that assessment, listing those positions as retail, versus the mining or production jobs expected in oil and gas.", "Lyon said PwC included those gas station positions as a best estimate of companies and jobs that exist only because of the gas and oil industry.", "Reid Porter, a spokesman at API, agreed, adding \"What happens in the oil and natural gas industry reverberates throughout the entire economy.\"", "Our ruling", "The American Petroleum Institute recently released a series of press releases, drawing attention to the economic impact of the oil and gas industry on every state.", "Georgia, it said, has 141,600 jobs provided or supported by oil and gas.", "A 2011 report by PricewaterhouseCoopers backs up the number by looking at direct positions in the industry, supportive jobs and, accounting for most of the workers, all of the positions created from the industry and its supply chain.", "The math and economics are right – to a point. But careful examination of the report shows that 68 percent of the jobs counted as directly working in the oil and gas industry could just as easily be classified as retail workers.", "Adjusting the base number up by 29,146 workers, then, amplifies the number of jobs that support the industry or caters to its whims.", "The report is clear that it counts those positions, though. And the claim takes care to say the industry \"supports\" that large number of workers.", "It’s accurate, but somewhat misleading. We rate the claim Mostly True.", "American Petroleum Institute, Energizing Georgia, Aug. 27, 2015", "American Petroleum Institute, Georgia oil and natural gas industry estimates, Aug. 27, 2015", "American Petroleum Institute, Energy Tomorrow blog, August 2015", "American Petroleum Institute, Energy and the States, August 2015", "PricewaterhouseCoopers, Economic Impacts of the Oil and Natural Gas Industry on the U.S. Economy in 2011, July 2013", "U.S. Bureau of Economic Analysis, Regional Data Tables, Total full-time and part-time employment by industry, Georgia 2011, accessed Sept. 16, 2016", "Atlanta Journal-Constitution, \"North Georgia becomes a hunting ground for natural gas,\" Oct. 7, 2015", "Interview Drew Lyon, principal and leader of national economics and statistics group at PricewaterhouseCoopers, Oct. 5, 2015", "Interview, Bruce Seaman, professor of economics, Georgia State University Andrew Young School of Policy Studies, Oct. 7, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]