["About this rating", "The agonizing pain known as \"blue balls\" is well known to just about any man who was ever a teenager, an ache caused by prolonged arousal without release — a condition often referred to by urologists as epididymal hypertension. But what causes this syndrome?", "Although anecdotal evidence suggests that epididymal hypertension is fairly common (especially in adolescent men) there is for some reason a remarkable dearth of peer-reviewed scientific literature on the topic. Case reports and speculative essays have been published, but a universally agreed-upon understanding of the mechanism is still lacking. According to one speculative paper published in Medical Hypotheses:", "Although epididymal hypertension pathophysiology has not been cleared yet, it is thought that it might be related to an increased distension of epididymis or to a pelvic venous dilatation [...]", "Dr. Abraham Morgentaler, an associate clinical professor of urology at Harvard Medical School, gave a layman’s explanation in a post for BuzzFeed Health:", "The testicles produce testosterone and sperm, but they also make other fluid to help propel the sperm through the various tubes, says Morgentaler. “With more stimulation, there’s more blood flow to the genital region, including the testicles. The fluid wants to get somewhere, but without there being that release, it builds up and builds pressure,” he says. When they get really filled up or congested, it causes the insides to stretch as they get engorged, and that’s what hurts.", "Two things are thought to be going on. First, the increase of blood to the penis, caused by the restriction of outflowing blood, fills a penile chamber called the corpus cavernosum, which in turn puts more pressure on the various \"tubes\" directing various fluids flowing through that region.", "The second factor, most agree, is that the production of seminal fluid puts even more pressure to expand (epididymal distension) within these already compressed tubes, and this can build up in a painful way absent an ejaculatory release. This is described in an October 2000 case report — the first ever peer-reviewed study of \"blue balls\" — of a 14-year-old male presenting with testicular pain:", "Perhaps if this persists and testicular venous drainage is slowed, pressure builds and causes pain. Is epididymal distension the cause of the pain? As with any disease entity, there is probably a spectrum of pain with “blue balls” varying from brief, mild discomfort to severe, sustained pain, as in the case described.", "There appears to be some disagreement among medical professionals regarding the \"blue\" part of \"blue balls\". Morgentaler, speaking to Buzzfeed, proffered this explanation for the name:", "The name probably refers more to the sensation than the color. “The experience is of it being bruised,” says Morgentaler. “It has that kind of sensitivity and tenderness.”", "Most men won’t even experience any noticeable swelling, but the engorgement happening inside the testicles is what’s causing all that pain.", "Speaking to Men’s Health magazine, however, Weill Cornell urologist Richard K. Lee suggested a slight tint of blue may be possible, but likely not without additional confounding issues:", "There’s also some evidence that a prolonged erection can cause some of the oxygen in your blood to be absorbed by the tissue in your genitals.", "This can leave the blood with a blue-ish hue, says urologist Richard K. Lee, M.D., [...] of Weill Cornell. Dr. Lee says this usually only happens when there’s some type of blockage.", "“Erectile dysfunction drugs or blood flow-constricting devices like a penis ring could cause this, but it’s not likely to occur naturally,” he adds.", "Blueness aside, the existence of the potential for discomfort is well-accepted. It has also, however, become a hot-button issue in sexual politics, as pain caused by foreplay without release has sometimes been employed by men or adolescents as a tool to guilt a partner into further sexual activity (\"I could die!\"). Such a tactic, while objectively immoral, also relies on the false assumption that there are actual long-term health risks associated with \"blue balls\".", "The consensus is that, save the coincidental occurrence of a testicular torsion, there are no long-term complications from the discomfort. In the 2000 case report, the authors suggested it could be remedied through \"sexual release\" or a dubious \"heavy lifting\" mechanism, which not only sounds like it potentially adds insult to injury, but also nimbly dances around the concept of masturbation altogether.", "This point was not lost on a number of published letters in response to the report bemoaning the fact that the easiest solution was not explicitly stated:", "In the discussion of treatment, however, we wonder whether the authors’ suggestion that “straining to move a very heavy object” is the first choice “simple maneuver [that] could bring immediate relief.” As this condition is coming to light in a highly respected pediatric journal, perhaps we should resurrect the advice of former Surgeon General Jocelyn Elders and teach masturbation in the schools.", "If masturbation isn’t your jam, Morgentaler has another easy solution: Just give it some time, rest a bit, and it will go away on its own. Perhaps these simple solutions are why there is such a dearth of scientific research into the ailment.", "Chalett, Jonathan M., and Nerenberg, Lewis, T.   \"“Blue Balls”: A Diagnostic Consideration in Testiculoscrotal Pain in Young Adults: A Case Report and Discussion.\"\r\n    Pediatrics.   October 2000.", "Segura-Sampedro, J.J.   \"Foreplay, a Selected Strategy That Might Be Able to Increase Fertility Rates.\"\r\n    Medical Hypotheses.   7 April 2017.", "Gueren, Casey.   \"Here’s What Blue Balls Actually Are.\"\r\n    BuzzFeed News.   29 April 2015.", "Andersson, K.E., and Wagner, G.   \"Physiology of Penile Erection.\"\r\n    Physiological Reviews.   January 1995.", "Heid, Markham.   The Real Reason ‘Blue Balls’ Hurts So Much.\"\r\n    Physiological Reviews.   14 April 2016.", "Rockney, Randy, et al.   “Blue Balls”\r\n    Pediatrics.   November 2001.", "Madison, Amber.   Hooking Up: A Girl's All-Out Guide to Sex and Sexuality.\r\n    Prometheus Books, 2006.   1615921540.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]