["The photo was published here on Twitter by former Pakistani cricketer Ramiz Raja on July 29, 2020. It has been retweeted more than 7,000 times.", "The tweet's Urdu-language caption translates to English as: “Sindh government has arranged milked tea for the whole of Karachi.”", "Karachi is the capital of the southern Pakistani province of Sindh.", "The photo was also shared here, here, here, here, here and here on Facebook and on Twitter here, here and here alongside a similar claim.", "The claim is false.", "A reverse image search on Google found an earlier version of the photo posted here by a user based in Mumbai, India. The caption of the tweet translates from romanised Hindi to English as: “She: How much tea can you drink? Me:”", "A search on Google Maps found the location here in Tilak Nagar, a neighbourhood in Mumbai.", "The location, a playground in Tilak Nagar, can also be seen in photographs published here by Indian media outlet The Indian Express and here by Indian newspaper Hindustan Times.", "Below is a screenshot comparison of the photo in the misleading post (L) and the Indian Express image (R) with similar features circled in red by AFP:", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]