["A video of a man being beaten up by a mob has been circulated on social media and messaging platforms with the claim that a Muslim man was beaten up in New Delhi. The duration of the video clip is 39 seconds.", "ये तो नहीं पता कहा का है ये वीडियो पर है बहुत दर्द नाक", "एक मुस्लिम को भीड़ का द्वारा मारा जा रहा है 😢", "ये जेसा भारत बना दिया है @narendramodi@ahmadal94278836@pakhandi_bhagao@LambaAlka@UN pic.twitter.com/QSAkBKvUYw — Follow_The_India♥️ नाज़िर ناظر Najir Hasan (@N_Hasan3) August 27, 2019", "The above video has been retweeted over 500 times. The complete message tweeted with the video says – “ये तो नहीं पता कहा का है ये वीडियो पर है बहुत दर्द नाक एक मुस्लिम को भीड़ का द्वारा मारा जा रहा है. ये जेसा भारत बना दिया है.”", "The twitter handle of Delhi Youth Congress tweeted the video with a similar message.", "Samir Abbas, executive editor at TV9 Bharatvarsh, tweeted the video with the words, “One more picture of the blot on our nation, a petty quarrel over buying headphones outside the Old Delhi railway station led to Owais, a Madrasa teacher from Shamli being lynched, Delhi police has arrested two accused shopkeepers Lallan and Sarfaraz. (translated)”. The tweet has now been deleted but its archived version can be accessed here.", "The same video has also been tweeted by a Pakistani user with the claim that a madrasa student was beaten up in India for refusing to chant ‘Jai Shri Ram’.", "A madrassa student Hafiz -ul-Quran was lynched for not chanting Jai Shri Ram in India on 27 August 2019 pic.twitter.com/apJui2LUud", "— Younis Baloch (@YouniisBaloch) August 28, 2019", "The same has been circulated on WhatsApp.", "Alt News found that the video represents an incident that took place in Meerut. But the claim circulated with it pertains to a different incident that occurred in Delhi.", "Alt News looked closely at the video in question, and found a signboard at 0:31 minutes which said, ‘Sara Hotel Bar & Restaurant’. Alt News searched for the same on Google, and found two of the top three results pertaining to Meerut, UP.", "On the supposition that the incident took place in Meerut, Alt News searched with specific key words, and found a Business Standard article of August 26, 2019 titled, ‘Mob thrashes man for allegedly molesting girl’.", "Alt News also found a video report on the same incident, by Times of India. According to reports, the man seen in the video was thrashed for allegedly having molested a girl inside a moving bus. To confirm that the video does indeed pertain to this incident, Alt News contacted DSP Meerut, who confirmed that the said incident did take place in Meerut.", "“Such an incident did occur. A girl traveling in a bus complained of harassment against a boy seated next to her. The people who were seated inside the bus beat up the boy. The girl has lodged a formal complaint against the boy, who is in jail. An FIR has also been filed over the incident wherein the boy was thrashed, and we will take action against those we identify from the video.” He added, “There is no communal angle. This is a case of molestation. Police has taken prompt action in this case.” (translated).", "The text accompanying the video claims that this incident took place in Delhi and that a madrasa teacher named Owais was beaten up and killed. It is true that such an incident did take place in Delhi. But the video shared along with it does not pertain to the incident, as shown in our fact-check above. According to a report by Hindustan Times, “A 27-year-old madrasa teacher was beaten to death by at least two hawkers in north Delhi’s Kotwali area on Monday after an argument over the price of a pair of headphones. Family members, however, alleged that the man was thrashed by a group of people. Police said they have arrested the two men and efforts to identify others are being made. The victim, Mohammad Ovais, was a resident of Shamli in Uttar Pradesh and taught in a madrasa in Greater Noida.” The incident occurred on August 27, 2019.", "In conclusion, it may be stated that while an incident did take place in Delhi wherein a madrasa teacher was beaten to death over a petty quarrel, the video circulated along with this claim is from Meerut, and pertains to an incident of alleged molestation, following which people beat up the accused.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]