["The purported screenshot was circulating on messaging app LINE on August 16, 2020.", "The Thai-language message at the top of the image translates to English in part as: “Xi invites all Chinese people to support the decisions of the national administrators by not visiting America and not using US products.", "“Announced on 13/8 today, it has been viewed by billions of people. Within three months, US products won't be sold.”", "The message at the bottom shows a photograph of Chinese President Xi Jinping alongside a caption that can be translated from simplified Chinese as: “From Beijing - Fighting back tears, leader Xi announced...\"", "A similar claim was also shared here, here and here on Facebook.", "The claim is false.", "The US was mentioned in several of the Chinese Ministry of Foreign Affairs (MFA)’s daily press briefings in August 2020 as US-Chinese relations deteriorated over the coronavirus pandemic and Beijing's crackdown in Hong Kong.", "However, a look at the transcript of the August 13 edition of the press meeting found no call for Chinese people to avoid using American products or travelling to the US.", "The purported call was not mentioned in the weekly policy briefing from China's State Council here.", "Similarly, keywords searches set between August 13 and at the time of writing on August 18 found no such claim on the MFA's Facebook, Twitter and Weibo accounts, nor was it found on the Twitter account of MFA spokesperson Zhao Lijian.", "AFP also conducted separate keyword searches on search engines Google and Baidu and found no relevant news reports about the purported announcement between August 13 and 18.", "According to Xinhua's Xi Jinping calendar, China's leader did not conduct any public activity or give any speech on August 13.", "The latest \"instruction\" from Xi Jinping was one on August 11 about food waste, and the latest transcript of his speech was published on July 31.", "There was also no mention of Xi Jinping or the US on August 13 under the \"important news\" section of the Chinese central government website.", "The photo of Xi Jinping in the misleading post was previously published in this January 2016 BBC report about Xi’s New Year’s Day speech.", "The photograph was credited to the Chinese state-run Xinhua News Agency.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]