["About this rating", "Swedish climate activist Greta Thunberg was interviewed on a CNN town hall program about the coronavirus pandemic.", "She did not appear on the show to offer expertise on the virus. Rather, she discussed her work as an activist on such issues as children's welfare and climate change during a pandemic.", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "Internet outrage ensued over a CNN advertisement for a town hall program about the ongoing COVID-19 coronavirus disease pandemic, which aired on May 14, 2020. The outrage was focused on CNN's booking of 17-year-old Swedish climate activist Greta Thunberg, with criticism falsely characterizing her appearance as being that of an \"expert panelist.\" \nAdding to the confusion, a number of news publications ran with the same false narrative. \"Greta Thunberg added to CNN’s expert coronavirus panel, Twitter erupts,\" read a New York Post headline. \"Greta Thunberg Isn't a Coronavirus Expert,\" Reason.com reasoned.", "It's true that Thunberg was a guest on the May 14 show, but she wasn't the only non-medical expert interviewed. Other guests interviewed remotely included Major League Baseball Commissioner Rob Manfred, who talked about ongoing negotiations with players amid a canceled season, and a private citizen, Neal Browning, who volunteered to participate in COVID-19 vaccine testing.", "Like the others, Thunberg spoke on a topic she was knowledgeable about, namely her effort to help raise money for the United Nations' Children's Fund (UNICEF), which is working to support children impacted by the pandemic. Her CNN appearance can be viewed below.", "On Twitter she addressed the criticism of her appearance on CNN, saying, \"It seems some people thought I was going to be on an expert panel, which of course has never been the case.\"", "Town hall co-host Anderson Cooper weighed in on the controversy after Thunberg's appearance, calling it a \"surreal, absurd drama.\" He noted that various promotions aired for both the show Thunberg appeared on and for previous town halls in the coronavirus series, which featured the likes of Manfred, singer Alicia Keys, chef Jose Andres, and film director Spike Lee as individual interviewees, not as panelists. Cooper opined that the Twitter circus was more about producing content \"lest you miss out on a cycle of phony outrage\" than it was about actual concern over Thunberg's appearance on the show.", "Because Thunberg was brought on CNN to discuss her efforts as a children's activist and her support for UNICEF, but was not there to play the role of a medical expert, we rate the claim that Thunberg was an \"expert panelist\" on CNN's coronavirus town hall as \"Mixture.\"", "CNN. \"Greta Thunberg Urges Public to Listen to the Experts Amid Pandemic.\"\r\n  YouTube. 14 May 2020.", "Sparks, Hannah. \"Greta Thunberg Added to CNN’s Expert Coronavirus Panel, Twitter Erupts.\"\r\n  New York Post. 13 May 2020.", "Noor, Poppy. \"Why Shouldn't Greta Thunberg Speak at CNN's Coronavirus Town Hall?\"\r\n  The Guardian. 14 May 2020.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]