["The misleading posts, including this one published on December 21, 2018, purports to show, people from a Hindu community in a village in Rajasthan in western India.", "The posts claim the violence occurred after the Indian National Congress party won state elections held that month.", "The Hindi-language caption to the post translates to: “After the formation of Congress government in Rajasthan, Muslims torched the houses of Marvadi Hindus and killed two of them in Darti village in Jaisalmer on the India-Pakistan border.”", "A similar post has also been shared here.", "The Indian National Congress, the main opposition party, did win the state elections. Here is a local news report on the result.", "However, a reverse image search found the video in the misleading post was posted repeatedly online in 2013 about an incident in Bangladesh.", "There are several videos of the 2013 incident available on Youtube for example, here and here.", "The earliest version AFP was able track down is one below posted to Youtube on March 2, 2013. It saId the incident took place on February 28, 2018 in Noakhali in Bangladesh.", "The people in the video are speaking the Bengali language spoken by the Bangladeshis. Starting at 0:05 seconds in the video above, a woman says: \"Our eyes were blindfolded and we were forced out of our homes. Fire destroyed our homes, we lost everything.\"", "This is the same quote as in the false Facebook post. The lady can be seen saying the same thing at the very start of that post.", "At 4 minute 36 seconds of the video from Bangladesh embedded above, a namplate can be seen in Bengali that translates to: ‘Office of the Police Superintendent Noakhali.", "A policeman then states the following: “Until now 10 of the suspects have been arrested in connection with the incident. Accompanied by the district magistrate, I visited the place yesterday. Policemen have been posted in the area to bring back confidence of the people.\"", "Noakhali is district in South-eastern Bangladesh, located in Chittagong division.", "That video matches with violence against Hindus that happened in Noakhali on February 28, 2013 and was reported in international media.", "Here is an AFP on that violence.  The violence story was also published in other local media reports such as here, here and here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]