["About this rating", "Most commercial airlines nowadays allow passengers with disabilities to travel with emotional support or psychiatric assist animals, but, as a United Airlines customer discovered recently, there are certain limitations to that policy that aren't up for negotiation.", "In late January 2018, Jet Set TV, a travel talk show, reported on their Facebook page that an unidentified woman and her emotional support peacock were unable to board their flight out of Newark Liberty International Airport:", "Incredulous? So was the bystander who shot this video of the woman entering the airport with the peacock on her shoulder:", "Despite the scanty details, national news outlets like Fox News picked up the story after confirming with United Airlines that the woman and her peacock were, in fact, booked for a flight but denied boarding passes.", "We followed up with the airline, whose spokesperson told us that the peacock did not meet the U.S. Department of Transportation's support animal guidelines \"for a number of reasons, including its weight and size.\"", "These are the DOT criteria for evaluating whether or not \"unusual\" service animals should be allowed in the passenger cabin:", "As indicated above, certain unusual service animals, pose unavoidable safety and/or public health concerns and airlines are not required to transport them. Snakes, other reptiles, ferrets, rodents, and spiders certainly fall within this category of animals. The release of such an animal in the aircraft cabin could result in a direct threat to the health or safety of passengers and crewmembers. For these reasons, airlines are not required to transport these types of service animals in the cabin, and carriage in the cargo hold will be in accordance with company policies on the carriage of animals generally.", "Other unusual animals such as miniature horses, pigs and monkeys should be evaluated on a case-by-case basis. Factors to consider are the animal's size, weight, state and foreign country restrictions, and whether or not the animal would pose a direct threat to the health or safety of others, or cause a fundamental alteration (significant disruption) in the cabin service. If none of these factors apply, the animal may accompany the passenger in the cabin. In most other situations, the animal should be carried in the cargo hold in accordance with company policy.", "The same guidelines permit airlines to require documentation of a person's mental or emotional disability by a licensed health care professional before granting permission for accompaniment by a service animal.", "Albeit true that peacocks aren't permitted to fly United, there's nothing to prevent them from having an Instagram page, which is how we learned that the bird in question is named Dexter, and that after being turned away at the Newark Airport he was on his way across the country, at last report, via automobile:", "@kumathedestructor took this great shot of me at #newarkairport today. Spent 6 hours trying to get on my flight to LA ?? (after following all required protocol) Tomorrow my human friends are going to drive me cross country! Keep an ?out for us! ? #bestroadtripbuddy #dexterthepeacock", "A post shared by  Dexter The Peacock (@dexterthepeacock) on Jan 27, 2018 at 7:01pm PST", "As it turns out, Dexter the Peacock is something of a celebrity in his hometown of Bushwick, New York, where he lives with his owner, a photographer and conceptual artist named Ventiko.", "Haddad, Evan.  \"The Emotional Support Peacock Who Has Made Global Headlines Is From Bushwick.\"\r\n  Bushwick Daily.  31 January 2018.", "Puhak, Janine.  \"Woman Denied Emotional Support Peacock on United Flight.\"\r\n  Fox News.  30 January 2018.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]