["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The artwork was made in 2020 and has never been displayed in the Denver International Airport.", "Conspiracy theories that claim COVID-19 was planned as part of a world domination scheme by the \"elite\" have run amok on the internet.", "A miscaptioned mural of people wearing masks was recently tacked onto those rumors as more evidence of the plot. But it’s not.", "In late June 2020, Facebook users shared a photograph of a mural that showed people of the world wearing masks. The posts claim that the mural was created in 1994 for the Denver International Airport, and the mural proves that the virus was planned.", "\"The Denver airport mural painted in 1994. Tell me this is not weird, how far do they plan this stuff in advance?\" text along the bottom of the image reads.", "One user who shared the image wrote: \"And I’m the conspiracy \"theorist\"?! Sorry, but no…\"", "Another said, \"PLANDEMIC 1994 Denver International airport. Illuminati artworks on display.\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The mural itself is legitimate. But it’s not from 1994, it’s not in the airport, and it didn’t portend the coronavirus pandemic.", "There is some confusion over who created the piece, but we can confirm that it has never been displayed in the Denver International Airport and was made in 2020, not 1994.", "The earliest online appearance of the piece was when CJ Trinidad, an artist in the Philippines, shared it to his Facebook page in February 2020 with the caption \"MASKCOMMUNICATION.\"", "He posted multiple photographs of the artwork, including one of it in progress, and another of him posing with it. His signature appears at the bottom right corner of the piece, and apparel that features the artwork has also been shared on his Facebook account.", "But the same piece was credited to someone named Neha Kumari for a coronavirus-themed global art competition hosted by the Indian Council for Cultural Relations. Kumari entered it into the competition under a different title. The image of the mural on the website also shows Trinidad’s signature is cut off.", "Authorship aside, the listed submission date of the artwork on the contest website is where people may have gotten the wrong idea about when it was created.", "The piece is listed on the site as being submitted on Dec. 28, 1995, but this appears to be an error. The competition’s submissions didn’t open until April 2020. We reached out to the organization for clarification but haven’t heard back.", "As for the Denver airport piece of the claim, that’s easy to disprove. Alex Renteria, an airport spokesperson, told PolitiFact that the piece is not from the airport’s collection.", "\"The only mural painted in 1994 for DEN featuring international children wearing traditional clothing and that also features flags is Leo Tanguma’s ‘Children of the World Dream of Peace,’ but none are wearing masks,\" Renteria said.", "The airport opened to the public in February 1995 and has been a hotbed for conspiracy theories for decades, particularly involving its bold, and sometimes unnerving, public art pieces.", "Facebook posts claim that a piece of artwork that shows citizens of the world wearing masks was created in 1994 and is displayed in the Denver International Airport.", "While the original artist is still unclear, the image of the piece does not show a mural that was made in 1994 at the airport.", "We rate this False.", "Facebook post, June 26, 2020", "Facebook post, Feb. 25, 2020", "Facebook post, March 16, 2020", "Instagram post, June 28, 2020", "Indian Council for Cultural Relations, UNITED AGAINST CORONA- EXPRESS THROUGH ART, Accessed June 30, 2020", "Indian Council for Cultural Relations, SUFFERING AND FIGHTING AGAINST CORONA VIRUS, Accessed June 30, 2020", "Indian Council for Cultural Relations, Competition guidelines for participants, Accessed June 30, 2020", "Denver Post, The definitive guide to Denver International Airport’s biggest conspiracy theories, Oct. 31, 2016", "Email interview, Alex Renteria public information officer at the Denver International Airport, June 30, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]