["The photos and claim were shared in this Facebook post, which has been shared almost 300 times since it was published on February 4, 2020.", "Below is a screenshot of the post:", "The post’s Urdu caption translates to English as: “Warning. An extremely important message. In Pakistan also coronavirus alert has been issued. Try utmost not to eat chicken meat during the next 60 days. In Pakistan signs of coronavirus have started appearing in chickens. Share this message more and more so that the life of your own people is saved.”", "As of February 19, 2020, the coronavirus has killed at least 2,000 people and in mainland China alone it has infected over 74,000, AFP reported.", "The chicken photos were also shared alongside similar claims on Facebook here, here, here and here.", "This claim is false.", "Muhammad Salman, the chief of the virology department at Pakistan’s National Institute of Health, told AFP there is “no evidence” that the coronavirus has been found in chicken in Pakistan.", "“So many rumours are circulating on social media. We have no evidence of such claims. We have not issued any alert about chicken meat,\" Salman said.", "Pakistan’s Ministry of Health also denied issuing a warning about coronavirus in chicken. “Government has not issued any alert,\" an agency spokesperson told AFP via Facebook Messenger on February 13, 2020.", "The Pakistan Poultry Association, a private organisation of farmers, also called the claim “baseless propaganda.”", "“Pakistan Poultry Association strongly condemn this baseless propaganda against the Poultry Product and clarifies that the rumor is fake and baseless,\" the association said in a statement on February 17, 2020. \"The Corona Virus (2019-nCov) has not been reported in Chicken in the country. Moreover Poultry has not been reported to be involved in transmission of 2019-nCov to human so far in any part of the world.\"", "The photos featured in the misleading Facebook post are also being shared out of context.", "A Google reverse image search found the photos were published in this Tamil-language blog post on November 19, 2019, weeks before the coronavirus outbreak began.", "The article is titled “Risk - Warning - Don't buy broiler chicken for the next 3 months - Here's the full details” and reports on poultry diseases caused by growth additives.", "“Poultry growers have found that chickens have been infected with a variety of diseases, including cancer, due to the use of chemicals to grow the chicken in just 20 days,\" the report reads.", "Below is a screenshot comparison of the photos in the misleading Facebook post (L) and the Tamil blog article (R):", "Similar claims about novel coronavirus being found in chickens in India have been debunked by AFP Fact Check here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]