["Rep. Patrick Murphy (D-FL) speaks during his debate against Republican Sen. Marco Rubio (R-FL) during their U.S. Senate debate being held at Broward College on October 26, 2016 in Davie, Florida. (Photo by Joe Raedle/Getty Images)", "In the second U.S. Senate debate, U.S. Rep. Patrick Murphy accused U.S. Sen. Marco Rubio of wanting to \"dismantle\" Social Security -- a charge Rubio denied in a debate in South Florida -- and offered Rubio's own words as proof.", "According to Murphy, Rubio \"said Social Security and Medicare have, quote, ‘weakened us as a people.' \"", "Rubio said that Murphy distorted his words. \"What I said is debt is weakening our country, it absolutely is,\" Rubio replied in the Oct. 26 debate at Broward College.", "Murphy was referring to a speech Rubio gave at the Ronald Reagan presidential library in 2011. The quote is accurate, but it did not come in a speech arguing for such drastic reforms to Social Security and Medicare as Murphy described.", "Rubio’s ‘weakened us as a people’ comment", "During his speech, Rubio said Democrats and Republicans created programs and levels of spending that -- while well intentioned -- were doomed to fail from the start.", "\"These programs actually weakened us as a people. You see, almost in forever, it was institutions and society that assumed the role of taking care of one another. If someone was sick in your family, you took care of them. If a neighbor met misfortune, you took care of them. You saved for your retirement and your future because you had to.", "\"We took these things upon ourselves and our communities and our families and our homes and our churches and our synagogues. But all that changed when the government began to assume those responsibilities. All of the sudden, for an increasing number of people in our nation, it was no longer necessary to worry about saving for security because that was the government's job. ...", "\"The other thing is that we built a government and its programs without any account whatsoever for how we were going to pay for it. There was not thought given into how this was going to be sustained.\"", "A Rubio spokesman pointed us to the section in which Rubio said the programs didn’t take into account future costs. But Rubio did say that such programs \"weakened\" Americans.", "Rubio has long called for reforming Social Security and Medicare. In Florida, about 21 percent of Florida’s population -- about 3.9 million people -- receive Social Security benefits. About 4 million Floridians use Medicare for health insurance. The programs accounted for 41 percent of federal program expenditures in fiscal year 2015.", "The programs face long-term financing shortfalls, leading program trustees and federal budget experts to call for action by Congress. Rubio has said that he favors raising the retirement age for people such as himself in their 40s but not for current retirees or those who will retire soon.", "\"Social Security will go bankrupt, and it will bankrupt the country with it,\" Rubio said at a March presidential debate in Miami. \"So what it will require is people younger, like myself, people that are 30 years away from retirement, to accept that our Social Security is going to work differently than it did for my parents.\"", "Does Rubio want to privatize Social Security and turn Medicare into a voucher?", "Murphy also said that Rubio supported the bill by U.S. Rep. Paul Ryan, R-Wis., to privatize Social Security and turn Medicare into a voucher.", "Rubio has supported a \"premium support system\" that would give seniors a fixed amount of money to purchase insurance from Medicare or a private provider. That was similar to a plan by Ryan.", "Rubio voted for the Ryan budgets that included reductions in future Medicare spending. The burden would have fallen on beneficiaries to pay more out of pocket. While Rubio was in the Senate, Ryan’s Path to Prosperity budget resolution introduced in 2011 got rid of all mention of potential privatization, choosing instead to focus on overhauling Medicare and cutting taxes and expenditures.", "His resolution punted on Social Security: \"In the event that the Social Security program is not sustainable, the president, in conjunction with the Board of Trustees, must submit a plan for restoring balance to the fund.\" This would also require the U.S. House and Senate to provide ideas for potential solutions.", "While running for president in 2015, Rubio wrote an op-ed on Social Security in which he called for raising the retirement age, reducing growth in benefits for wealthy seniors and making it easier to save money -- but he didn’t call for privatization.", "In his current race, Rubio’s Social Security plan on his website makes no mention of privatization.", "Our ruling", "Murphy said that Rubio \"said Social Security and Medicare have ‘weakened us as a people,' \" he said.", "In a speech in 2011, Rubio talked about government programs intended to help people and said, \"These programs actually weakened us as a people.\" Rubio argued that people no longer had to worry about saving once they viewed it as the government’s job and that the government supplanted the role of families and religious institutions to help people in need. Rubio also expressed concern that that lawmakers lacked foresight as to how to pay for the programs in the future.", "The caveat here is that the quote is not evidence of Rubio aiming to dismantle these programs.", "We rate this claim Mostly True.", "U.S. Sen. Marco Rubio, Campaign plan on Social Security, 2016", "National Review op-ed by Sen. Marco Rubio, \"Saving Social Security in the 21st century,\" Aug. 15, 2015", "CBS Face the Nation, Transcript, Sept. 26, 2010", "The Weekly Standard, \"Rubio Emphasizes \"Prosperity and Compassion\" in Speech at Reagan Presidential Library,\" Aug. 24, 2011", "Think Progress, \"Marco Rubio: Medicare, Social Security ‘Weakened Us As People,’ Made Us Lazy,\" Aug. 24, 2011", "Wall Street Journal, \"GOP Aim: Cut $4 Trillion,\" April 4, 2011", "U.S. House of Representatives Budget Committee, \"Path to Prosperity,\" April 5, 2011", "U.S. House of Representatives Budget Committee, \"Path to Prosperity,\" March 20, 2012", "Tampa Bay Times, \"Rubio denies 'flip flop' on privatizing Social Security,\" Sept. 27, 2010", "PolitiFact Florida, \"In Reagan library speech, Marco Rubio takes on Social Security,\" Aug. 24, 2011", "PolitiFact Florida, \"Fact-checking Democratic attacks on Marco Rubio's statements on Social Security and Medicare,\" Sept. 16, 2016", "PolitiFact Florida, \"Fact-checking Marco Rubio's Social Security stance,\" Oct. 6, 2010", "PolitiFact, \"Radio ad from Barack Obama says Paul Ryan \"tried to change the whole game\" on Social Security,\" Aug. 28, 2010", "U.S. Rep. Patrick Murphy campaign, Rapid response press release, Oct. 26, 2016", "Interview, Michael Ahrens, U.S. Sen. Marco Rubio campaign spokesman, Oct. 26, 2016", "Interview, Galia Slayen, U.S. Rep. Patrick Murphy campaign spokesman, Oct. 27, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]