["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Refugees and migrants line up for food at a camp on the Greek island Lesbos. (AP)", "The United States spends about $50 billion on foreign aid, or about 1 percent of the entire federal budget. Much of it, whether in the form of development, health, humanitarian or military aid, involves the State Department at some point in the process. So at a confirmation hearing for Secretary of State nominee Rex Tillerson, Sen. Rand Paul, R-Ky., asked Tillerson about corruption in foreign aid.", "\"There are many, many, many reports talking about corruption within foreign aid,\" Paul said. \"That we give it to developing countries, and 70 percent of it's stolen off the top.\"", "Tillerson answered that he had once seen military forces steal shipments of food aid right at the airport. He said that sort of thing could be avoided if America picked the right partners to deliver aid.", "In this fact-check, we decided to take a closer look at Paul’s 70 percent figure.", "Across the board", "There is no question that the aid bucket can leak. Sergio Gor, Paul’s spokesman, told us Paul \"was pointing out how often foreign aid is stolen.\"", "But neither Paul’s office nor any expert we reached could point to any study that found that 70 percent of what we give winds up stolen.", "Gor sent us an article by noted aid researcher William Easterly at New York University that argued something altogether different.", "Easterly wrote that as of 2008, 76 percent of all American aid went to countries judged by the private consulting group PRS to be most corrupt. Does that mean all that money was lost?", "No. The corruption ranking is an indirect measure at best. It aims to help businesses figure out the risk of investing in a country and puts the most weight on patronage, nepotism and \"suspiciously close ties between politics and business.\"", "Easterly himself told us that his analysis is \"suggestive\" but in no way conclusive that 70 percent of aid money is stolen.", "\"It is inherently impossible to calculate the number ‘x percent of aid is stolen’ from the numbers that I use on how much aid goes to corrupt countries,\" Easterly said. \"The actual stealing of aid happens mostly in secret, using many tricks intended to deceive any outside observers. So nobody knows how much is actually stolen.\"", "Easterly wrote recently that in the name of fighting terrorism, the United States has \"redirected aid money to some of the most autocratic, corrupt, and oppressive regimes in the world\" such as Uzbekistan, Ethiopia and Uganda. He argued that this increased the risk of money going astray, but again, he said he couldn’t quantify the diversion.", "Morten Broberg, a law professor at Copenhagen University, focuses on corruption in development assistance and humanitarian aid.", "\"I do not recall coming across any detailed and convincing statistics,\" Broberg told us.", "Broberg called the 70 percent figure incorrect.", "Worst case examples", "Gor, Paul’s spokesman, told us \"there have been entire projects which have been fraudulently executed.\" He pointed to an op-ed about Nigeria that claimed, without any documentation, that hundreds of billions of dollars had been stolen from the government since 1960, an amount nearly equal to the foreign aid donors had sent.", "He also cited an Economist article that said that a year after Western governments had given the African nation of Malawi $1.2 billion, \"corrupt officials, businessmen and politicians pinched at least $30 million from the Malawian treasury.\"", "If true, that would be a lot of money, but it would amount to about 2.5 percent of the total aid -- not 70 percent.", "Providing aid in war zones is particularly susceptible to fraud. Government auditors for the U.S. Agency for International Development investigated 25 cases of fraud and corruption within the humanitarian aid effort in Syria. In one case, a Turkish vendor had replaced lentils with salt in food ration kits for Syrians running from the fighting. Out of $835 million spent, they said their investigations \"resulted in more than $11.5 million in savings.\"", "They also said at one point, as much as $300 million worth of program work was on hold, pending review. That does not mean fraud or theft had taken all that money. About a quarter of those funds were later allowed to move forward.", "Afghanistan and Iraq are major sinkholes of American aid. A 2014 Special Inspector General report on Afghanistan reconstruction said about $1.6 billion in aid was flowing through ministries that \"were unable to manage and account for funds.\" The report did not estimate how much aid was stolen. The report said that even when U.S. Agency for International Development staff knew that controls were weak, they continued to approve grants.", "For Iraq, the congressional Commission on Wartime Contracting estimated that the cost of fraud \"ran between 5 and 9 percent\" between 2002 and 2011. That amounted to as much as $18.5 billion over that period.", "Our ruling", "Paul said that 70 percent of foreign aid is \"stolen off the top.\" Paul’s office was unable to point to a study that backed that up for all American aid, and experts who study the issue knew of no such estimate.", "While theft is real, and possibly extreme on individual projects, it is not on the scale Paul asserted.", "We rate this claim False.", "https://www.sharethefacts.co/share/c2956347-4ba9-4b1b-a0a9-2794c2448aa9", "U.S. Senate, Secretary of State confirmation hearing, Jan. 11, 2017", "U.S. Agency for International Development - Office of Inspector General, Fraud Investigations Expose Weaknesses in Syria Humanitarian Aid Programs, July 14, 2016", "Global Fund, Investigation in Burkina Faso, Oct. 30, 2015", "U.S. Agency for International Development - Office of Inspector General, West African Man Charged In $12 Million Anti-Malaria Program Fraud Scheme, Oct. 30, 2015", "Time, U.S. Has No Idea How Much Aid To The Afghan Government Is Being Stolen, Jan. 30, 2014", "Economist, Misplaced charity, June 11, 2016", "New York Review of Books, The War on Terror vs. the War on Poverty, Nov. 24, 2016", "Der Spiegel, US Cuts Aid After Millions Siphoned Off to Dubai, July 5, 2010", "Government Accountability Office, AFGHANISTAN Key Oversight Issues for USAID Development Efforts, March 13, 2014", "Brown University, US Reconstruction Aid for Afghanistan: The Dollars and Sense, Jan. 5, 2015", "New American, Rand Paul Calls for Investigation of Foreign Aid Fraud, May 2, 2013", "Commission on Wartime Contracting, Report to Congress, August 2011", "World Bank, Anti-corruption,  Nov. 28, 2016", "Daily Mail, A country so corrupt it would be better to burn our aid money, Aug. 8, 2013", "Email interview, Sergio Gor, spokesman, Office of Sen. Rand Paul, Jan., 16, 2017", "Email interview, William Easterly, development economist, New York University, Jan. 15, 2017", "Email interview, Morten Broberg, professor of international development law, Copenhagen University, Jan. 14, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]