["About this rating", "In early September 2020, rumors spread across social media that wildfires on the West Coast, particularly Oregon, had been set by \"antifa\" — a rumor that area police departments worked to debunk, noting that it was making their efforts amid life-or-death emergency conditions more difficult.", "Catastrophic wildfires in Oregon, Washington, and California in early September 2020 have, as of this writing, killed seven people, forced thousands to evacuate, burned homes, and scorched millions of acres. Amid this chaos and destruction, emergency responders were forced to take time to counter misinformation galloping across social media platforms — rumors that falsely claimed political extremists were behind a coordinated arson campaign.", "For example a headline from the website The Gateway Pundit read, \"Antifa Radical Arrested for Arson in Washington State — Was Caught on Highway Live-Streaming on Facebook Before Arrest (Video).\" Podcast host Joe Rogan claimed during his Sept. 17, 2020, show that \"they've arrested left-wing people for lighting these forest fires.\"", "A 36-year-old Puyallup man was arrested on Sept. 9, 2020, on suspicion of setting a fire in the median on SR 167. But Washington State Patrol Trooper Ryan Burke told Snopes police don't have evidence that the incident was linked to antifa.", "For broader context, misinformation on social media appeared to attempt to link the wildfires to racial justice protests in the spring and summer of 2020 in various cities. In Portland, those protests had become protracted and sometimes violent, with clashes between \"antifa,\" a catchall term referring to loosely coordinated groups of anti-fascist activists, and right-wing counterprotesters.", "Here's an example of a post on Twitter falsely claiming that the warning about antifa setting fires in Molalla, Oregon, came from police:", "It's true that police in Molalla issued a warning on Sept. 9, 2020, specifically about looters exploiting chaos and vacant homes as residents fled encroaching flames. However, Molalla police updated the post to note that it was not referencing \"antifa.\"", "Remember when we said to follow official sources only. Remember when we said rumors make this already difficult incident even harder? Rumors spread just like wildfire and now our 9-1-1 dispatchers and professional staff are being overrun with requests for information and inquiries on an UNTRUE rumor that 6 Antifa members have been arrested for setting fires in DOUGLAS COUNTY, OREGON.", "THIS IS NOT TRUE! Unfortunately, people are spreading this rumor and it is causing problems.", "Do your part, STOP. SPREADING. RUMORS! Follow official sources of information such as local emergency response websites and pages, government websites and pages and local reputable news outlets.", "We left a phone message and sent an email to Romero's campaign asking why Romero posted the tweet, where he obtained the information and whether, as a candidate for public office, he believes he is contributing to the spread of rumors clogging up Douglas County's emergency dispatch lines. We didn't get a response in time for publication.", "Other social media posts claimed that police in Medford, Oregon, had arrested yet another group of antifa arsonists — a rumor that was swatted down by Medford Police on Sept. 9, 2020, who noted that some had gone so far as to create a fake graphic with the department's logo and included the right-wing group Proud Boys in the hoax:", "Another viral meme stated that someone was seen throwing molotov cocktails out of the windows of a black Mini Cooper heading toward Yachats, a city in Lincoln County, Oregon. Lincoln County Sheriff Curtis Landers told us via email that as far as police are aware, \"this was a false rumor.\"", "Joy Krawczyk, a spokeswoman for the Oregon Department of Forestry, told The New York Times that, while many of the fires in the state remain under investigation, there hasn't been any evidence that they were set as the result of a \"mass politically-influenced arson campaign.\"", "On Sept. 11, 2020, the FBI announced it had investigated reports of extremists setting wildfires, and found such claims to be untrue.", "The New York Times.   \"Wildfires Live Updates: Vast Destruction Across Three States.\"\r\n    Updated 10 September 2020.", "Haberman, Maggie and Charlie Savage.   \"Trump, Lacking Clear Authority, Says U.S. Will Declare Antifa a Terrorist Group.\"\r\n    The New York Times.   31 May 2020.", "Bella, Timothy.   \"Thousands Evacuated as 'Once in a Generation' Fires Burn Through Oregon.\"\r\n    The Washington Post.   9 September 2020.", "Cowan, Jill.   \"How the Wildfires Started, and Other Answers You Need.\"\r\n    The New York Times.   10 September 2020.", "Updated with information from Lincoln County Sheriffs.", "Updated with announcement from FBI Portland.", "Updated to note Joe Rogan claimed \"left-wing\" activists were starting forest fires on his podcast.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]