["Multiple photos have been shared thousands of times on Facebook alongside a claim they show a train in Sri Lanka that was renovated in 2020. The claim is misleading; most of the photos have circulated since 2013 in reports about a now-discontinued train service in Sri Lanka.", "The photos were published here on Facebook on August 29, 2020. The post has been shared more than 2,900 times.", "The post contain six photos: one shows the exteriors of a painted train and six others show various features inside a train.", "The post’s Sinhala caption translates to English as: “The Badulla A/C train started its journey yesterday with a facelift. It is the responsibility of the authorities and the passengers to make sure it is maintained this way.”", "Badulla is a city in Sri Lanka's Uva Province.", "The photos were also shared alongside similar claims on Facebook here, here, here, here and here.", "The claim, however, is misleading.", "A reverse image search on Google found two of the photos published in July 2013 on a promotional poster for Rajadhani Express, a train service in Sri Lanka.", "The poster, uploaded on Facebook here,  features the third and sixth photos in the misleading post.", "Below are screenshot comparisons between the third and sixth photos in the misleading post (L) and the photos in the poster (R):", "A further reverse image search found the second photo in the misleading post published here on the Rajadhani Express’s Facebook page in April 2013.", "Below is a screenshot comparison between the second misleading photo (L) and the Rajadhani Express’s photo (R):", "While AFP was not able to verify the source of the fourth and fifth photos in the misleading post, they appear to feature the same individuals seen in the other interior photos from 2013. The individuals included the train assistant in a yellow uniform and the two female passengers.", "Below is a screenshot comparison between the fourth and fifth photos in the misleading post (L) and the photos on the Rajadhani Express’s Facebook page (R), with the similarities circled in green:", "According to this April 2017 Facebook post published on the Rajadhani Express’ Facebook page, they have ceased operations in Sri Lanka.", "It reads, in part: “It is with great regret we announce the termination of Rajadhani Express Services effecting from 31st March 2017.”", "In response to the misleading posts, Sri Lanka Railways’ general manager M J D Fernando also told AFP by phone on September 2, 2020: “These claims are false - the images are of compartments facilitated by a private railway service that was operating a few years back. They suspended their operations with effect from 2017 and are no longer operational.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]