["About this rating", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "Over the weekend of April 17-20, 2020, protesters in cities across the U.S. turned out to demonstrate for the loosening of social-distancing restrictions enacted to deal with the COVID-19 coronavirus disease pandemic, holding that that restrictions were unnecessary or had continued for too long. Those protests encompassed the display of numerous signs and messages that seemed so outrageous in their sentiments as to leave many viewers who encountered them afterwards on social media wondering whether they were real. (Most were in fact real, although a few were fake.)", "One such example of this phenomenon was the following, an image of an automobile displaying a message on its rear window reading \"Your health is not more important than my liberties!\"", "The license plate on the car appears to be the \"Keep Kids Safe\" variant of vehicle plates issued in Connecticut, and the state capital of Hartford was the scene of a \"Rally to Reopen\" protest on April 20, as reported by the Hartford Courant:", "Hundreds of Connecticut residents paraded around the state Capitol [on the afternoon of April 20] in their cars, honking horns, flying American flags and displaying signs demanding the state reopen businesses and services that have been shut down during the coronavirus pandemic.", "The long line of protesting drivers snaked around the Capitol grounds and Frog Hollow neighborhood shortly after Gov. Ned Lamont announced deaths associated with the virus have topped 1,300 and that restrictive measures, including a new order to wear masks in public, should continue for weeks.", "The loud but socially distant protest in Hartford followed similar large, in-person rallies in state capitals around the country, including in Pennsylvania earlier Monday and in Michigan, Virginia and Texas over the past few days.", "The protesters nationwide claim Lamont and other governors’ unprecedented orders to shut down businesses, close schools and order millions to stay at home to stem the spread of the virus infringe on civil liberties and do more harm than good for society at large, said Dan Reale, chairman of the Libertarian Party of Connecticut, which organized the rally.", "One slightly different aspect of the Hartford protest was that it primarily comprised demonstrators driving around in their automobiles rather than gathering in person:", "The vehicle bearing the \"Your health is not more important than my liberties!\" message was in fact part of that \"Rally to Reopen\" procession in Hartford, having been captured in pictures by photojournalist Brad Horrigan that appeared in both the Courant's reporting on the demonstration and in an separate opinion piece about the protest:", "[While I lay in a hospital bed in Manhattan, forcing myself to breathe], in Connecticut — my home state — hundreds of people gathered in the capital city. American flags were billowing. Signs were flailing. Red hats were everywhere. I had no idea this was happening, but by the time I got home from the hospital, the photos were all over the Internet.", "“Your health is not more important than my liberties,” someone had scribbled on a car window. The pain in my chest — which had persisted and grown throughout the last eight days — was now compounded by something else.", "I couldn’t believe the state of my country. I couldn’t believe what my fellow Americans were doing to one another and not only how easily but how savagely they wanted to tear each other down.", "Miolene, Elissa.   \"While People Protested the Coronavirus Lockdown in Hartford, I Was Struggling to Breathe.\"\r\n    Hartford Courant.   23 April 2020.", "Murdock, Zach.   \"Hundreds Parade Through Hartford to Protest Gov. Ned Lamont’s Coronavirus Stay-at-Home Orders, Business Closures.\"\r\n    Hartford Courant.   20 April 2020.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]