["A video of a priest holding down a man dressed in police uniform is doing the rounds on social media. In the video, the priest can be seen grabbing the cop by his neck who visibly suffocates. Facebook page ‘Jago India’ posted the video along with the message, “Anda bokth, police बाले koमार क्यू रहे हो (Why are ‘andh bhakts’ beating the policeman -translated)”. The post has amassed more than 18,000 shares so far.", "Anda bokth, police बाले koमार क्यू रहे हो🤬🤬🤬", "Posted by Jago India on Monday, 6 April 2020", "Alt News broke the video into multiple keyframes with the help of digital verification tool InVid. Upon performing a reverse image search of one of the keyframes, we found the original video posted by a YouTube channel CWE on March 18, 2019. At 2:52 minutes in the video posted below, one can see the viral footage of the man acting as the priest holding down another man who is playing the role of a cop.", "The video has been evidently shot from different camera angles, suggesting that it is professionally made. Furthermore, we found many other videos on CWE featuring the same character “Singham Dubey” who plays the role of a cop. The actor’s name is Manish Dubey. He identifies himself as a professional wrestler in his Facebook bio.", "CWE stands for Continental Wrestling Entertainment. The channel calls itself “the first Indian Wrestling Entertainment Academy.” In the past as well, theatrical videos from the same platform have been shared as real incidents (1, 2, 3).", "Thus, a theatrical video of a man playing the role of a cop eaten by another actor role-plays as a priest has been shared on social media as a real incident. Earlier this week, another theatrical video by this platform was falsely shared as UP cop beaten at the residence of a village head in Muzaffarnagar district.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "Trigger Warning: Sexual Violence A distressing video of a girl forced to take her clothes…", "A clip featuring Pakistan men’s Cricket team captain Babar Azam is viral on social media…", "A 13-second clip featuring Bollywood actor Shah Rukh Khan is being shared on social media…", "Union minister of information and broadcasting Anurag Thakur on September 26 announced Waheeda Rehman as…"]