["About this rating", "The video in question does show a \"fistulated cow.\"", "What the video documents is neither a form of abuse nor a method to increase dairy production.", "On 18 April 2016, the Facebook page \"Best Videos You Will Ever See\" posted a video purportedly showing a cow with a hole in its side, along with the claim that what the video depicted was a new form of abuse by the dairy industry:", "The dairy industry invented yet another way to abuse cows — cutting a HOLE in the middle of the body in order to test which pasture maximizes the profits that can be made from milking them.", "Although the video was real, the \"Best Videos You Will Ever See\" page's claim was not. The video shows a cow with a surgical fistula, not a hole punched in the bovine to help farmers observe which pasture helps cows produce more milk.", "The hole in the cow's side was the result of a surgery called a \"rumen fistula,\" a procedure that provides researchers with a window to see into the cow's digestive system and to allow the transfer of microbes between healthy and sick cows. The surgery is frequently performed at veterinary schools and is typically viewed as a benefit both for the cows and for researchers:", "Behind every successful cow are millions of gut microorganisms — mostly bacteria, protozoa, and some fungi. This bastion of bugs that resides in a cow’s 20-gallon rumen are ultimately responsible for digesting all the plant material the bovine consumes.", "Being the quintessential symbiotic relationship — the cow supplies the bugs with nutrients and the bugs convert cellulose into usable energy for the cow — it also works the other way: when the cow gets sick, the bugs get sick, too. Then they die. And no gut bugs eventually means no cow.", "Transfaunation — the act of taking microbes from one source and putting them in another — can be a literal lifesaver when it comes to a bovine bellyache. And how does one go about retrieving such a sample? By creating a one-stop shop for your sick cow’s gut flora needs. Designated donor cows with a surgically installed port allow access to the rumen from the outside.", "According to an article in Modern Farmer, the surgery is relatively straightforward and does not effect the longevity of the animal:", "Placing a rumen fistula — the medical term for a permanent hole between an internal organ and the outside world — into a healthy cow for collection purposes is a relatively straightforward procedure and performed frequently at veterinary schools, according to Dr. Brian Aldridge, clinical professor and specialist in large animal internal medicine at the College of Veterinary Medicine at Illinois. “To put one in would take about an hour and a half,” he says.", "Rumen flora from a fistulated cow helps not only sick cows, but also sheep and goats because they share similar digestive systems.", "Sick farm animals and surgical patients aside, fistulated cows are also a staple in bovine nutrition research, since having a fistula makes it easy to sample rumen contents in order to study how different nutrients affect a cow’s digestive system. The cost of surgically installing a rumen fistula is about $300 and doesn’t affect the longevity or health of the cow, says Dr. Susan Fubini, professor of large animal surgery at Cornell University’s College of Veterinary Medicine. “The plastic cannulas themselves last forever,” she says. As for the fistulated cows, “They are without a doubt the happiest animals in our hospital.”", "Although fistulated cows may prove to be a startling sight at first glance to those unfamiliar with them, they are the part of a practice that is neither a new nor controversial. Cannulated cows have been used in veterinary research for decades, and most researchers contend that the animals do not suffer ill effects from the procedure.  A 2009 video showing Portia, a cow at Tufts University's Cummings School of Veterinary, provides more information about cannulated cows:", "The surgery is used to observe bovine digestive systems, and although it may result in healthier animals and (by extension) potentially higher profits, it is inaccurate to claim that the latter is the sole or primary factor behind the practice.", "Spector, Dina.    \"This Cow Lives with a Giant Hole in Her Side.\"\r\n    Business Insider.    10 October 2013.", "O'Brien, Anna.    \"Holey Cow: The Wonderful World of a Fistulated Cow.\"\r\n    Modern Farmer.    12 September 2014.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]