["About this rating", "In the early 1800s, the United States mistakenly built a fortress on the wrong side of the U.S.-Canada border. This fort became colloquially known as \"Fort Blunder.\"", "The viral image actually shows the remnants of \"Fort Montgomery,\" a second military base that was built atop the ruins of Fort Blunder after the United States obtained the land from Canada in the 1840s.", "An interesting piece of U.S.-Canadian history is often circulated on social media in the form of a meme that reads: \"This is Fort Blunder. It was built by the USA in 1818 on Lake Champlain to protect the USA from British / Canadian attacks. After spending 2 years & $275,000, surveyors discovered a problem: The fort was built on the wrong side of the border.\"", "The story relayed in this meme is largely accurate. The United States truly did build a base in the early 1800s that ended up being on the wrong side of the border. This fortress was never officially named but it has been known as \"Fort Blunder\" for nearly two centuries.", "The saga of Fort Blunder was mentioned in this excerpt published in London's The Champion and Weekly Herald in 1839:", "Sun, Apr 14, 1839 – 5 · The Champion and Weekly Herald (London, Greater London, England) · Newspapers.com", "The United States got a second crack at building this fortress in 1842, when the Webster-Ashburton Treaty was signed to resolve various border issues and placed the land under the ruinous \"Fort Blunder\" into American hands. The United States then built a second base that was officially named Fort Montgomery. Although not a slipup on the order of Fort Blunder, Fort Montgomery also saw little military action and would eventually be abandoned and fall to ruin. The above-displayed image shows the remnants of Fort Montgomery.", "In 1926, the Windsor Star published an article about how the United States built Fort Blunder on the wrong side of the border, how it was abandoned and fell to ruins, how a treaty placed the land in American hands, how it was rebuilt as Fort Montgomery in the 1840s, how it was again abandoned, and how it eventually became a tourist destination.", "Thu, Nov 18, 1926 – 26 · The Windsor Star (Windsor, Ontario, Canada) · Newspapers.com", "For a more modern take at the history of Fort Blunder, here's an excerpt from the New England Historical Society's page on the matter:", "In 1818, work began on a modern, heavy fortification at the northern end of Lake Champlain. The British had launched massive invasions of the United States through the lake during the American Revolution and the War of 1812. As a result, some of the hottest fighting took place in the region during both wars...", "To prevent that from happening again, President James Madison ordered the fort built. The State of New York helped out by ceding to the federal government a tiny spit of land called Island Point. The state also gave up 400 acres for a military reservation.", "Joseph Totten, later chief engineer of the U.S. Army, supervised construction of the octagonal, 30-foot-tall structure. It would have 125 cannons, and any British ship sailing past would come under heavy fire.", "Then, two years and $275,000 later, surveyors discovered a problem: The fort was being built on the wrong side of the border... All work stopped on the fort, and the heretofore unnamed citadel earned the nickname Fort Blunder.", "As of this writing, fans of U.S. History, New York real estate, or just folks looking to make a mistake, can purchase the remnants of Fort Montgomery and the land its on for just under $1 million. That listing contains a few aerial images that give a better look at what's left of Fort Montgomery.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]