["The video was published here on Facebook on May 20, 2020.", "The post’s caption reads: “Some where Landslide between on Guwahati to Shillong road”.", "Guwahati is a city in the Indian state of Assam and Shillong is the capital city of the neighbouring Meghalaya state.", "The post was published as northeast India experienced days of heavy rain, causing widespread flooding in Assam and landslides in Meghalaya.", "The video was also shared here, here, here and here on Facebook; here and here on Twitter; and here on YouTube alongside similar claims.", "However, the claim is false; the footage actually shows a landslide that happened in Indonesia in April 2020.", "A reverse image search of video keyframes extracted with InVID-WeVerify, a digital verification tool, found this report by Indonesian media outlet Tribun Jateng about a landslide in a suburb in the Indonesian province of West Java published on April 9, 2020.", "The report’s Indonesian title translates to English as: “Video of Bukit Landslide in seconds in Cianjur, sadly residents are busy recording, not warning riders”.", "The report features a video of the landslide taken from a slightly different angle.", "Below is a screenshot comparison between the video in the misleading post (L) and the Tribun Jateng video (R):", "The video was also shared on a local YouTube channel SumaNews, alongside a similar description on April 9, 2020.", "India’s Meghalaya Police also denied the claim, calling it “fake news”, in this tweet published on May 21, 2020.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]