["By Saranac Hale Spencer", "Posted on October 20, 2017", "Q: Was an “illegal alien” arrested for starting the wildfires that have ravaged northern California?", "A: No. The arrest was not related to the wildfires.", "Rumors about the fires that have ravaged northern California’s wine region are spreading on the internet like, well, wildfire.", "Several stories claiming that an immigrant living in the country without legal permission was responsible for starting them have been flagged by Facebook users as potentially fake.", "The stories — such as one that ran on a website called Illegal Alien Crime Report with the headline, “ILLEGAL ALIEN CHARGED WITH CALIFORNIA WILDFIRE THAT KILLED 40 PEOPLE” — cite an actual arrest, but it wasn’t related to the fires.", "Jesus Fabian Gonzalez was arrested for setting a small fire near the bridge where he had been living in Sonoma County on Oct. 15, a week after the major fires began. He is charged with one felony count of arson, Sgt. Spencer Crum told FactCheck.org.", "“He was charged with arson, but not for all the fires that have caused devastation over the last 10 days,” Crum said.", "It was a small fire that was put out within minutes by the local fire department, he said.", "Gonzales, who was familiar to patrolling officers in the park where he was arrested, said that he had started the fire to keep warm, Sonoma County Sheriff Robert Giordano said during a press conference on Oct. 17. Gonzales had both a fire extinguisher and a lighter with him at the time, Giordano said.", "No one has been arrested in relation to the fires that have burned 245,000 acres in northern California, Crum said.", "Rumors that the Gonzales arrest was related to the deadly wildfires stem from a story that ran on the popular conservative website, Breitbart, which quoted selectively from a short article about the arrest from the local Santa Rosa newspaper, The Press Democrat.", "It is true that U.S. Immigration and Customs Enforcement, or ICE, issued a request that the sheriff’s office detain Gonzales so that it could pursue deportation, as mentioned in the Breitbart story.", "“ICE lodged a detainer against Jesus Gonzalez [sic] with Sonoma County jail officials on October 16, following his arrest on felony charges for maliciously setting fire to a property,” ICE spokeswoman Sarah Rodriguez said in an email to FactCheck.org.", "ICE did not say that the arrest was related to the deadly wildfires, but it did say that it had sought to detain Gonzales four times in the last year.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to help identify and label viral fake news stories flagged by readers on the social media network.", "“ILLEGAL ALIEN CHARGED WITH CALIFORNIA WILDFIRE THAT KILLED 40 PEOPLE.” Illegalaliencrimereport.com. 17 Oct 2017", "Gonzales, Jesus. Sonoma County Detention Facility records. Accessed 18 Oct 2017.", "California Department of Forestry and Fire Protection. Statewide Fire Summary. Calfore.Ca.gov. 19 Oct 2017.", "Giordano, Robert. Press conference video. Facebook.com 17 Oct 2017.", "Street, Chriss. “ICE DETAINER ISSUED FOR SUSPECTED WINE COUNTRY ARSONIST IN SONOMA JAIL.” 17 Oct 2017.", "“Suspected arsonist arrested in Sonoma.” Pressdemocrat.com. 16 Oct 2017.", "Rodriguez, Sarah. Emailed statement. 18 Oct 2017.", "FactCheck.org Rating:", "Read More", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]