["In 1998, Jeb Bush, then governor-elect, visited students at Liberty City Charter School which he co-founded. The school later closed. (AP)", "Jeb Bush often talks about how Florida’s graduation rate was abysmal when he became governor and has since risen.", "But former state Sen. Dan Gelber, D-Miami Beach, says that the state's graduation rate was nothing to brag about when Bush left office -- or today.", "\"In 1998, when a newly elected Gov. Bush and a compliant Legislature started Florida’s ‘education revolution,’ our graduation rate was among the lowest in the nation,\" Gelber wrote in a June 21 Miami Herald op-ed. \"After Bush’s two terms in office, Florida’s graduation rate was dead last and remains near the bottom.\"", "He’s right that Florida’s graduation rate was among the lowest in the nation when Bush entered office in January 1999. But when Bush left in January 2007, was the state’s graduation rate \"dead last,\" and does it remain near the bottom today? The answer depends upon which ranking we examine.", "Was Florida’s rate ‘dead last’ when Bush left office?", "Bush did battle over what the state’s actual graduation rate was while in office. And Gelber was on the other side of that fight. In 2005, multiple news reports stated that Florida ranked 50th in graduation rates at 56.8 percent.", "The ranking came from Kansas-based Morgan Quitno Press, which compiled data to come up with annual state rankings on multiple topics. It used data from the National Education Association and the federal government to examine the number of public high school graduates compared with the number of ninth-graders four years earlier. (Morgan Quitno was later acquired by Congressional Quarterly.)", "Back then, Bush pointed to the Florida Department of Education’s data that showed a graduation rate of 71.9 percent. Florida counted GEDs and special education diplomas, boosting the rate above Morgan Quitno’s, which only counted standard diplomas. That method drew criticism, and now the state only counts standard diplomas.", "Overall, Bush disputed the rate cited by Morgan Quitno but not the ranking. However, in 2005 Bush announced that Florida signed a compact with 48 states to create common definitions for graduation rates to allow for state-by-state comparisons. Gelber said he found that the state held the 50th-place ranking in 2004 through 2006 using the Morgan Quitno annual data.", "There are a few different ways to measure graduation rates but those that are most often cited in recent years are methods used by the U.S. Education Department and by Education Week, a respected education publication. To see if Florida was \"dead last\" when Bush left office, we looked at those measures, and by both methods, when Bush left office, the state’s graduation rate was near the bottom of the pack but not \"dead last.\"", "The Education Department’s average freshman graduation rate provides an estimate of the percentage of high school students who graduate within four years of starting ninth grade. Florida was at 62.1 percent in 1997-98, the school year before Bush took office. It was 63.6 percent in 2005-06, Bush’s last full year in office.", "Four states were lower than Florida in 2005-06, making Florida 45th:", "Mississippi: 63.5 percent;", "Georgia: 62.4 percent;", "Louisiana: 59.5 percent;", "Nevada: 55.8 percent;", "South Carolina: 61 percent (based on a projected graduation rate).", "Education Week does its own analysis of graduation rates based on standard diplomas. (Read about their methodology here about their cumulative promotion index). In 2005-06, Florida’s rate was 57.5 percent, placing it 47th, ahead of New Mexico, Georgia and Nevada.", "So Florida wasn’t dead last according to two major rankings, but it did rank low.", "\"I think the big picture here is that every data series you use shows the same basic trend – Florida is real close to the bottom, however the numbers are added up,\" University of Iowa education professor David Bills said.", "We sent Gelber a summary of our findings.", "\"Any argument that we were 49th or 48th versus 50th under other equally reliable calculations doesn't alter in any way my statement and, more importantly, doesn't change the sorry state of Florida education after Jeb's alleged education revolution,\" Gelber responded.", "Does Florida’s graduation rate remain 'near the bottom' today?", "To examine if Florida’s graduation rate remains near the bottom, we turned to the most current data we could find comparing states’ graduation rates.", "Since 2010-11, the federal government has used a cohort method, which examines how many students receive a standard diploma within four years.", "Florida's rate was 76 percent in 2012-13, below the national average of 81 percent. Only seven states had a lower rate -- Alaska, Arizona, Georgia, Louisiana, Nevada, New Mexico and Oregon -- while two, Mississippi and Washington, were tied with Florida.", "This isn’t to say that Florida hasn’t made any progress. The graduation rate has increased in Florida since Bush started in office, but it has also risen nationally, which means Florida’s ranking compared with other states hasn’t changed that much.", "Richard Rothstein, a research associate at the left-leaning Economic Policy Institute, told PolitiFact that it’s not a good idea to attribute changes in graduation rates to any particular governor.", "\"The biggest predictor of graduation rates is the preparedness with which children come to school in kindergarten. If you know how prepared they were, you can predict graduation rates 12 years later. To the extent Bush had any influence on graduation rates, you should look at rates a decade after he left office. And for rates when he left office, look to the social, economic, and educational environment of the previous governor.\" Bush left office in 2007.", "Our ruling", "Gelber said that \"after Bush’s two terms in office, Florida’s graduation rate was dead last and remains near the bottom.\"", "Gelber cited Morgan Quitno data which showed Florida was 50th in 2004-06. But other data sources -- the federal government’s method and Education Week -- showed that Florida was near the bottom of the pack in Bush’s last full year but not dead last.", "Gelber is on more solid ground when he said that Florida \"remains near the bottom.\" In 2012-13, only seven states had a lower rate, while two were tied with Florida, according to the federal cohort method.", "We rate this claim Mostly True.", "Miami Herald op-ed by former state Sen. Dan Gelber, \"Jeb Bush: he ‘dumbed down’ Florida’s schools,\" June 21, 2015", "Former state Sen. Dan Gelber, Newsletter, 2008", "Former state Sen. Dan Gelber, State of the State response, 2008", "Morgan Quitno Press, Estimated public high school graduation rate, 2005", "National Center for Education Statistics, Public high school 4-year adjusted cohort graduation rate (ACGR) for the United States, the 50 states and the District of Columbia, School years 2010-11 to 2012-13", "National Center for Education Statistics, Public high school Averaged Freshman Graduation Rate (AFGR), by year and state or jurisdiction, School years 2002–03 through 2009–10", "Florida Department of Education, Florida’s Graduation rate and historical summary, 1998-2014", "Sherman Dorn, former University of South Florida Professor, \"Inflation of official Florida graduation rates,\" June 29, 2006", "Education Week, \"High school graduation rate approaching milestone, reaches highest point in 40 years,\" June 6, 2013", "CQ Press using National Education Association Data, Estimated public high school graduation rate, 2010", "Manhattan Institute, \"Public school graduation rates in the United States,\" 2002", "Economic Policy Institute, \"Rethinking high school graduation rates and trends,\" 2006", "WHJG, \"High school graduation rates,\" Nov. 16, 2005", "Associated Press, \"McBride ad blames Bush for poor schools,\" Oct. 15, 2002", "Tampa Bay Times, \"McBride’s first negative TV ad targets Floridae education,\" Oct. 16, 2002", "Associated Press, \"Florida High School graduation statistics hailed and deplored,\" Nov. 17, 2005", "Orlando Sentinel, \"Florida's high-school graduation rate on rise,\" (Accessed in Nexis) Dec. 1, 2007", "Associated Press, \"Florida’s graduation rate among lowest,\" April 28, 2014", "Congressional Quarterly, Press release, 2007", "PolitiFact Florida's Scott-O-Meter, Raise per-pupil education spending to an all-time high, Last update Feb. 25, 2015", "PolitiFact Florida, \"Florida's interim education commissioner gives props to state's graduation rate improvements,\" Aug. 23, 2013", "Interview, Cheryl Etters, Florida Department of Education spokeswoman, June 22, 2015", "Interview, Jim Bradshaw, U.S. Department of Education, June 23, 2015", "Interview, former state Sen. Dan Gelber, D-Miami Beach, June 22, 2015", "Interview, Matt Gorman, Jeb Bush campaign spokesman, June 22, 2015", "Interview, Richard Rothstein, research associate Economic Policy Institute, June 23, 2015", "Interview, Sherman Dorn, Professor and Director Division of Educational Leadership and Innovation at Arizona State University and former professor at University of South Florida, June 23, 2015", "Interview, Scott Morgan, co-owner of Morgan Quitno Press which was acquired by CQ in 2007, June 23, 2015", "Interview, David Bills, University of Iowa education professor, June 24, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]