["“Children playing Mobile Phone in the car while parent filling petrol outside. PLEASE INFORM EVERYONE….SHARE WITH ALL PLEASE.. VERY IMPORTANT COZ MOST OF US DO THIS….”", "The above message is being circulated on WhatsApp, along with a video clip which shows an explosion taking place at a petrol pump. The video is one minute long, and shows a car shattered by a huge explosion. One person who is leaning on the car is instantly knocked over and lies immobile on the floor.", "Children playing Mobile Phone in the car while parent filling petrol outside. PLEASE INFORM EVERYONE…. SHARE WITH ALL PLEASE.. VERY IMPORTANT COZ MOST OF US DO THIS…. Belongs My Family Raja Ram Wans & Mahabharat . pic.twitter.com/yQJ9RO4BmW", "— Raja Rakesh Ramesh Dalvi (@RakeshRameshDa2) September 6, 2019", "Alt News has received a request for verification of this video and the accompanying claim.", "Alt News found that this video has been posted for several months now, with many posts dating back to 2018. Facebook users have posted it at regular intervals.", "Alt News searched Google with the key words, ‘car explosion at gas station‘, and found a news article by The Sun, dated April 9, 2017. It contained a video of the same incident, taken from a different angle, which confirmed that the report pertained to the same incident. Stills from the two cameras are juxtaposed and placed below.", "The incident had reportedly occurred at Rio de Janeiro in Brazil. The date on the top right corner of the still on the right reads April 8, 2017.", "The cause of the explosion is not mobile phone usage in the petrol pump premises, as claimed in the message. The Sun‘s report states, “According to Rio fire department, the car was being filled up with natural gas when it appears a build-up of pressure inside the gas cylinder caused the car to explode.” The American fact-checking website Snopes too had fact-checked this false claim in 2018, confirming that pressure build-up in the natural gas cylinder of the vehicle was responsible for the explosion.", "It may be reiterated that the claim circulated along with the video is false. The incident occurred in Rio de Janeiro, Brazil and the cause of the explosion was build-up of pressure inside the CNG cylinder.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]