["About this rating", "In mid-October 2015, social media users began circulating a series of photographs purportedly showing then-93-year-old actress and game show panelist Betty White back when she was in her twenties:", "While the older woman pictured in the upper left-hand corner of the above-displayed image is certainly Betty White, the younger woman featured in the black and white images is not the former star of the Golden Girls television series. Instead, the photographs of \"Betty White in Her 20s\" actually show 1950s pin-up model Betty Brosmer:", "\"Betty's classic beauty put her on over 300 magazine covers and books. Betty had the greatest hourglass figure of all time: 38-18-36 (inches). She was in thousands of magazine spreads. Her face appeared on full-page ads in Life, Time, Fortune, Look, Saturday Evening Post and other leading magazines of her day. She won over 50 beauty contests before the age of 20. Betty, the ultimate Calendar Girl, appeared on hundreds of calendars. She was on numerous music album covers; On billboards in Times Square and billboards across the country; On life-size cutouts in retail stores selling Kodak film, Thom McAn shoes and other products.", "These images aren't the only ones to circulate under the misleading title \"Betty White In Her 20s.\" Another popular image purportedly showing the star of Hot in Cleveland in her 20s has been making the online rounds for several years:", "Although the woman pictured above is indeed Betty White, Getty Images lists the date on which that photograph was originally published was 22 September 1957, when Betty White (who was born in 1922) was actually 35 years old.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]