["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "\"My, my, my said the liar to the fly,\" begins a Nov. 10 Facebook post featuring former Secretary of State Hillary Clinton and U.S. House Speaker Nancy Pelosi smiling in photographs with a man. \"Here’s your whistleblower. Trump 2020.\"", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "That’s because the photo doesn’t show the whistleblower. The man in the photos is Alexander Soros, the son of Democratic fundraiser George Soros and deputy chairman of the Open Society Foundations.", "He posted the photo with Pelosi on Instagram on Sept. 2.", "\"Inspiring meeting with speaker @nancypelosi,\" he wrote. As she says: our #diversity is our strength, our #unity is our power! #bluewave2020\"", "He posted the photo with Clinton back in July 2016.", "\"There can only be one #womancrushwednesday today and that is of course @hillaryclinton, not just for being the first woman to run for president from this nation’s two largest political parties, but I believe the best presidential candidate this nation could have today!,\" he wrote.", "The whistleblower who alleged Trump is soliciting foreign interference from Ukraine in the 2020 election has legal protection from retaliation. U.S. officials have kept that person’s name confidential and most news organizations have also withheld the name.", "This photo’s claim is wrong, and even commenters on this Facebook post have offered corrections.", "We rate it False.", "Facebook post, Nov. 10, 2019", "The New York Times, Alexander Soros: The hate that is consuming us, Oct. 24, 2018", "Open Society Foundation, Alexander Soros bio, visited Nov. 12, 2019", "Alexander Soros Instagram post, Sept. 2, 2019", "Alexander Soros Instagram post, July 27, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]