["About this rating", "Calls to boycott the National Rifle Association intensified in the days following a school shooting in Parkland, Florida that left seventeen people dead on 14 February 2018. In response, a number of companies responded by ending partnership programs that provided discounts to NRA members:", "Shortly after Delta announced that it would stop offering discounts to NRA members, some argued that Planned Parenthood should be the actual subject of nationwide boycotts, despite not being involved directly or indirectly with the Parkland, Florida shooting in any way. One meme summed up that argument by stating without attribution that Planned Parenthood kills hundreds of babies a day, while the NRA has never directly killed anyone:", "This number appears to be derived from figures provided by the organization in 2015, which said that Planned Parenthood offices had performed 323,999 abortions in total the year before. However, that interpretation is dependent on subjective interpretations of when life supposedly begins; abortions are not counted as a \"cause of death\" by the Centers for Disease Control and Prevention.", "Georgia State Senator Michael Williams took issue with Delta's decision (the company is headquartered in Atlanta) and during an appearance on CNN said that the airline should also rescind its discounts for other organizations:", "If they're going to pull the discount for NRA members, why not pull it for Planned Parenthood or some of the left organizations out there?", "When CNN host Brianna Keilar asked Williams what evidence he had that Delta Air Lines offered discounted rates to Planned Parenthood members, adding that the network had examined these allegations and found no information to verify the claim, Williams explained that he \"looked it up on Google\" and did not know of the exact source — but that he would provide it at a later date:", "We searched for any credible sources to back the claim that Delta Air Lines offers a discount to members of Planned Parenthood (along with the official definition of what a member of Planned Parenthood might be: Did he mean donors to the nonprofit? Patients who do not donate? Some combination of the above? Is there a membership card?) but all we found were unverified claims in the comment sections of various articles and in random social media messages:", "Shortly after Williams appeared on CNN, Planned Parenthood denied his claims:", "Being a Planned Parenthood supporter doesn't come with corporate perks and discounts. People stand with Planned Parenthood because they support reproductive health and rights. https://t.co/RcHKSxI9As", "— Planned Parenthood Action (@PPact) February 28, 2018", "On 28 February 2018, Williams released a statement on Twitter:", "This statement offers no supporting evidence and, in fact, does nothing to address the original claim Williams made during his CNN appearance. Instead, it moves the goalposts completely by saying that while Delta does not contribute directly to Planned Parenthood, it indirectly supports the organization instead, by donating to groups such as the Susan G. Komen Foundation. However, we found some holes in this argument too. For example, American Airlines, not Delta Air Lines, is the official partner of the Susan G. Komen Foundation. Delta does host an annual fundraiser for breast cancer research, but the airline donates the proceeds to the Breast Cancer Research Foundation, not Susan G. Komen:", "Last month, Delta celebrated its 12th anniversary of the “Breast Cancer One” survivor flight, kicking off the airline’s Breast Cancer Awareness month throughout October and continuing the tradition of building awareness and raising funds for the Breast Cancer Research Foundation. This year’s flight honored 140 breast cancer survivors who flew from New York to Los Angeles. Festivities began with an event at the gate in JFK before the pink plane made its way to LAX, where survivors and attendees enjoyed another gatehouse event and an overnight stay, including dinner, hotel accommodations and a meet-and-greet with one of BCRF’s world-renowned researchers, Dr. Sofia Merajver from the University of Michigan.", "It is entirely possible that Delta has contributed to the Susan G. Komen Foundation, but this group is not a \"Delta partner,\" nor is it the main benefactor of their cancer research fundraiser.", "Williams doubled down on his claim that Delta was partnered with the Susan G. Komen Foundation when he shared a photograph of a Delta plane painted with pink ribbons and linked to a set of images on the web site FlashPointAgency:", "FlashPointAgency does say that this plane was designed as part of Delta's work with the Susan G. Komen Foundation. However, these images appear to be mislabeled. Another image in this set of photographs shows two women standing in front of a wall of logos for the Breast Cancer Research Foundation. As we noted above, Delta does frequently host fundraisers to support BCRF:", "Regardless of Delta Air Lines' relationships with the Susan G. Komen Foundation, the Breast Cancer Research Foundation, or anyone else, these groups have little to do with the senator's original claim, which is that Delta Air Lines provided discounts to Planned Parenthood members. Our examination of this rumor resulted in a chain of unfounded social media posts, but absolutely no supporting evidence.", "Aued, Blake.   \"Georgia Prospers When Businesses Don't Discriminate.\"\r\n    Flagpole.   28 September 2016.", "Goldschmidt, Debra.   \"Planned Parenthood: Fast Facts and Revealing Numbers.\"\r\n    CNN.   1 August 2017.", "Wattles, Jackie.   \"More Than a Dozen Businesses Ran Away From the NRA. How it Went Down.\"\r\n    CNN.   26 February 2018.", "Wattles, Jackie.   \"More Than a Dozen Businesses Ran Away From the NRA. How it Went Down.\"\r\n    CNN.   26 February 2018.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]