["About this rating", "August 2019 saw a flurry of social media posts sharing an article published earlier in the year on a website devoted to Christian-themed news, which alleged that Chelsea Clinton, the daughter of former President Bill Clinton, had tweeted a message saying that Satanism is a religion that \"deserves our respect.\"", "The article, posted on Jan. 13 under the category \"End Times Headlines\" on the website AmRedeemed, described Clinton's supposed paean to devil-worshippers as follows:", "Chelsea Clinton Says Satanism Is a Religion That Deserves Respect", "Chelsea Clinton has described Satanism as a “religion” that “deserves our respect”, as the “Satan-gate” scandal continues spiraling out of control, threatening to derail the spawn of Bill and Hillary Clinton’s budding political aspirations.", "The 37-year-old Clinton, fired back at critics who denounced her warm greeting to the Church of Satan on Twitter on January 1, claiming that Satanists, devil-worshippers and Luciferians deserve civility and respect.", "Unbelievably, the spawn of Bill and Hillary Clinton also compared Satanism to her own religion, Methodist Christianity, and her husband’s Jewish faith.", "As Snopes has previously reported, the tweet in which Clinton supposedly made these statements was issued on Jan. 1:", "Oh goodness gracious. We can be civil, cheerful, respectful to & friends with people who don’t share our religious beliefs. Sometimes, we even marry them. I’m a Methodist & my husband is Jewish, thank you for asking. A very happy New Year to you Rhonda! https://t.co/8UH9SP8EWO", "— Chelsea Clinton (@ChelseaClinton) January 3, 2018", "For context, that tweet came in response to comments on a conversation between Clinton and Chrissy Teigen in which Clinton casually tagged the Church of Satan's Twitter account, noting that a year earlier they had ended up in the same thread thanks to someone else's tagging the two of them at the same time. The Church of Satan replied to Clinton's mention, prompting Clinton to joke, \"It's been so long! Happy New Year!\" This elicited a torrent of scorn and accusations that Clinton is a \"Satan worshipper,\" hence her above-quoted tweet dated Jan. 3.", "As the text of that tweet amply shows, Clinton did not, in fact, say that Satanism is a religion that deserves respect. Her exact words were: \"We can be civil, cheerful, respectful to & friends with people who don’t share our religious beliefs.\" It's also inaccurate to claim that Clinton \"compared Satanism to her own religion, Methodist Christianity, and her husband’s Jewish faith.\" In point of fact, by naming their faiths she was illustrating her own point, which was that one can be respectful with people who don't share one's own religious beliefs. \"Sometimes, we even marry them,\" she wrote.", "Nor did Clinton refer to Satanism as a \"religion.\" She spoke of being respectful to those \"who don't share our religious beliefs\" -- a sentiment that encompasses non-religious as well as religious people.", "Though we won't belabor the point, the AmRedeemed article went on to mischaracterize the tenets of the Church of Satan by stating that \"The Church of Satan openly worship the Beast, and claim that Evil is a state of being worth striving for.\" The Church of Satan does not characterize itself as a religion and does not \"worship\" any supernatural entity, including Satan. \"We reject all theism and recognize all gods and religions [including Satan] to be man-made social institutions,\" a representative of the organization told us. He added that members of the Church of Satan regard Satan as a symbol representing \"carnality, individualism, and rational self-interest.\"", "Emery, David.   \"Did Chelsea Clinton Tweet ‘Happy New Year’ to the Church of Satan?\"\r\n   Snopes.com.   5 January 2018.", "AmRedeemed.   \"Chelsea Clinton Says Satanism Is A Religion That Deserves Respect.\"\r\n   13 January 2019.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]