["By Eugene Kiely", "Posted on September 4, 2018", "President Donald Trump distorted the facts in a Labor Day tweet complaining about the Justice Department’s indictments last month of two of his earliest congressional allies, Reps. Chris Collins and Duncan Hunter Jr.", "In the tweet, Trump described both cases as “long running, Obama era, investigations.” That’s wrong in Collins’ case and misleading in Hunter’s case:", "In both cases, the indictments were executed by U.S. attorneys appointed by Attorney General Jeff Sessions: Geoffrey S. Berman, who was appointed the U.S. attorney for the Southern District of New York in January 2018, and Adam Braverman, who became the U.S. attorney for the Southern District of California on Nov. 16, 2017. Sessions, of course, was appointed by Trump.", "Collins and Hunter were the first two members of Congress to support Trump for president. Their endorsements came on Feb. 24, 2016, a day after Trump defeated his two top rivals, Sens. Marco Rubio and Ted Cruz, in the Nevada caucus. (Jeb Bush had already dropped out earlier that month.)", "In a Labor Day tweet, Trump criticized his attorney general for the timing of the indictments of “two very popular Republican Congressmen,” saying the “well publicized” charges could hurt the Republican Party in this fall’s midterm election. The president also wrongly described the indictments as being the result of “[t]wo long running, Obama era, investigations.”", "Two long running, Obama era, investigations of  two very popular Republican Congressmen were brought to a well publicized charge, just ahead of the Mid-Terms, by the Jeff Sessions Justice Department. Two easy wins now in doubt because there is not enough time. Good job Jeff……", "— Donald J. Trump (@realDonaldTrump) September 3, 2018", "Let’s look first at the indictment of Collins, whose charges stemmed from a Trump-era investigation.", "Collins, a board member and stockholder in Innate Immunotherapeutics Ltd., received an email on June 22, 2017, from Innate’s chief executive about the clinical trial results for a drug being developed by Innate, according to the Aug. 8 indictment.", "The company’s “primary business was the research and development of a drug called MIS416, which was intended to treat Secondary Progressive Multiple Sclerosis,” but the CEO said the test results showed “no clinically meaningful or statistically significant” differences in outcomes between the drug and the placebo. “No doubt we will want to consider this extremely bad news,” the company CEO said.", "A separate civil complaint filed the same day by the U.S. Securities and Exchange Commission described what happened after Collins received the CEO’s email.", "SEC, Aug. 8: Christopher Collins responded to the email and then approximately 15 seconds later began attempting to reach his son, Cameron Collins. After exchanging several missed calls, Christopher Collins and Cameron Collins connected and spoke for six minutes. Over the next two trading days, between the opening of the market on Friday, June 23, and the close of the market on Monday, June 26, and while the clinical trial results were still nonpublic, Cameron Collins sold a total of nearly 1.4 million Innate shares based on material, nonpublic information he received from Christopher Collins. Cameron and Christopher Collins spoke by telephone at least nine times during that same time period.", "The SEC complaint also alleges that Cameron Collins and his fiancee drove to her parents’ house “shortly after” he talked to his father on June 22. “Within minutes of their arrival, his girlfriend’s mother took steps to sell her Innate shares,” the SEC complaint says.", "As a result of the insider tip, prosecutors say Cameron Collins avoided $570,900 in stock losses and his fiancee’s parents prevented a loss of $143,900. The indictment says the congressman did not sell any of his stock in the company.", "The New York congressman, his son and Stephen Zarsky, the father of his son’s fiancee, were each charged with conspiracy, securities fraud, wire fraud and making false statements to the FBI.", "It’s not clear when the Department of Justice started its investigation of Collins, who previously had been under a separate House ethics investigation regarding his investments in Innate. There is no public record indicating that the Justice Department had been investigating Collins’ investments in the company prior to June 22, and the department declined to comment in an email to us.", "But it is clear that the investigation that led to the congressman’s indictment began after Trump took office — so the president is wrong to describe it as a “long running, Obama era” investigation.", "As for Hunter, the California Republican and his wife, Margaret, were indicted on Aug. 21 for allegedly spending more than $250,000 in campaign funds on personal expenses and filing false campaign finance reports to cover up the spending.", "Trump is correct that the charges against Hunter stemmed from an investigation that was opened during the Obama administration. However, Trump also described it as a “long running, Obama era” investigation, when in fact the investigation lasted longer under the Trump administration than it did under the Obama administration.", "“The criminal investigation began in June of 2016, two months after the Federal Election Commission and the San Diego Union-Tribune questioned some of Hunter’s campaign expenses as potentially personal,” the DOJ said in a statement announcing the indictment of Hunter and his wife.", "That means that the federal investigation of the Hunters lasted only about eight months under the Obama administration and extended another 19 months under the Trump administration, ending with the Aug. 21 indictment.", "The indictment against the Hunters was filed by Braverman, who, again, was appointed by Sessions. “The indictment alleges that Congressman Hunter and his wife repeatedly dipped into campaign coffers as if they were personal bank accounts, and falsified FEC campaign finance reports to cover their tracks,” Braverman said in the DOJ press release on the indictment. “Elected representatives should jealously guard the public’s trust, not abuse their positions for personal gain. Today’s indictment is a reminder that no one is above the law.”", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]