["No vaccine for the new coronavirus is expected for months or more.", "There is no vaccine for COVID-19, the new coronavirus that first appeared in China. None is expected soon.", "The vaccine for cattle won’t help humans, and won’t protect against this new form of coronavirus.", "The fact that there’s already a coronavirus vaccine for cattle should make you doubt claims that the virus causing the current human outbreak is new and deadly.", "That’s what a Facebook post would lead you to believe. It adds to a long list of misleading claims about the virus that, as of March 1, 2020, had hit 59 countries.", "\"Just in case you are wondering how much the media controls people, America has been vaccinating cattle for coronavirus for years,\" the Feb. 27, 2020, post claims, \"yet the news tells you it’s new and gunna kill you all so go buy mask.\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The post shows a photo of a bottle with labeling that includes, \"Bovine Rotavirus-Coronavirus Vaccine\" and \"For veterinary use only.\" (The image and the post were deleted in the course of our reporting, but we found similar posts showing the image elsewhere along with similar claims.)", "The vaccine pictured, called ScourGuard 4K, is made by animal drug manufacturer Zoetis and is real. And we found products with similar labeling available for sale online.", "But the vaccine is, according to the drug manufacturer, \"effective as an aid in preventing diarrhea caused by bovine rotavirus (serotypes G6 and G10), bovine coronavirus, and E. coli in calves of vaccinated dams.\" It won’t help humans, at least not now.", "\"The coronavirus used in the Bovine Rotavirus-Coronavirus Vaccine is distinct from the current coronavirus,\" said Ming Tan, a faculty member of the Division of Infectious Diseases at Cincinnati Children's Hospital Medical Center.", "\"The antibodies produced by the Bovine Rotavirus-Coronavirus Vaccine will not recognize the current\" coronavirus \"and thus will not protect humans from infection.\"", "Studies would need to be done to determine whether the bovine vaccine could provide any help with the current coronavirus, said Amesh Adalja, senior scholar at Johns Hopkins University’s Center for Health Security. \"The bovine vaccine may be formulated in a manner that is not conducive to humans,\" he said.", "There is a \"very remote\" chance a bovine vaccine might work in humans, said Richard Watanabe, professor of preventive medicine at the University of Southern California, but \"the possibility it would work is low enough that it is more efficient to design a vaccine specifically for COVD-19.\"", "It helps to differentiate some terms being used in the news and social media.", "Many reports refer to the coronavirus. But coronavirus is a general term; there are different coronaviruses out there. Coronaviruses are a large family of viruses which may cause illness in animals or humans. They’ve been around for a long time, but there are different strains.", "More specific terms relating to the current situation include:", "2019 novel coronavirus — novel, as in, new.", "SARS-CoV-2 — the technical name of the new virus.", "COVID-19  — the name of the disease caused by the new coronavirus, as in \"coronavirus disease, 2019.\"", "All three of those terms refer specifically to the coronavirus that was discovered in late 2019 in Wuhan, China, and has spread around the world.", "Unfortunately, there is no vaccine for COVID-19 and none is expected soon.", "One of the leading American experts on coronavirus, Anthony Fauci, who is director of the federal government’s National Institute of Allergy and Infectious Diseases, told Fox News on Feb. 27, 2020, his team is working with a drugmaker and expects to begin a clinical trial within the \"next month and a half.\"", "\"That whole process is going to take about a year to a year and a half. Even though we are going as fast as you possibly can, it's still going to take a good year, year and a half to see if we have a vaccine that works,\" he said.", "A Facebook post claims: \"America has been vaccinating cattle for coronavirus for years, yet the news tells you it’s new and gunna kill you all so go buy mask.\"", "Despite what the post suggests, the existence of a bovine vaccine doesn’t mean there is a coronavirus vaccine for humans, and none is expected soon.", "We rate the claim False.", "Facebook, post, Feb. 27, 2020", "PolitiFact, \"Separating fact from fiction on the coronavirus,\" Feb. 28, 2020", "Fox News, \"Dr. Anthony Fauci tells public to be prepared for coronavirus, but still 'do the things you always do,’\" Feb. 25, 2020", "World Health Organization, \"Naming the coronavirus disease (COVID-19) and the virus that causes it,\" accessed March 2, 2020", "World Health Organization, \"COVID-19 FAQs,\" accessed March 2, 2020", "U.S. Centers for Disease Control, \"Preventing COVID-19 Spread in Communities,\" March 1, 2020", "Columbia Journalism Review, \"How to name a coronavirus,\" Feb. 24, 2020", "Email, Amesh Adalja, senior scholar at Johns Hopkins University’s Center for Health Security, March 2, 2020", "Email, Ming Tan, faculty member of the Division of Infectious Diseases at Cincinnati Children's Hospital Medical Center, March 2, 2020", "Email, Richard Watanabe, professor of preventive medicine at the University of Southern California’s Kerk School of Medicine, March 2, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]