["About this rating", "On the evening of Jan. 8, 2021, Twitter announced it was permanently suspending U.S. President Donald Trump's account, saying that the president's messages could incite further violence in the days following the attack on the U.S. Capitol. While many welcomed Twitter's decision, some argued that the social media company was stepping into \"Orwellian\" territory, a reference to author George Orwell who is perhaps best known for the dystopian novel \"1984.\"", "Sean Davis, co-founder of right-wing magazine The Federalist, took to Twitter to claim that the social media network was \"banning references to Orwell\" and not allowing the use of hashtag #1984.", "Twitter is not deleting or banning references to Orwell, as evidenced by the fact that Davis' tweet, which references Orwell, is still available on Twitter as of this writing.", "While it's true that #1984 can't be used as a hashtag, this has nothing to do with censorship, politics, Trump, or the Capitol riot. Twitter does not let users create hashtags solely from numbers. You can't make a hashtag for #1234, #2021, or any other string of numbers.", "In a help section on its website, Twitter explains some of the reasons why \"My hashtags aren't working\":", "Is the hashtag made up entirely of numbers?", "If you write #1 or #123 the hashtag will not be hyperlinked and is therefore not searchable. However, if you include letters following the numbers in the hashtag, for example, #123go, then the hashtag will work correctly.", "As Twitter explains, those wanting to make an Orwell-related hashtag could use terms such as #1984Orwell or #Orwell1984.", "It should also be noted that while Orwell's \"1984\" is often invoked by those who feel that they have been censored, the book's message runs far deeper than anti-censorship. Orwell was also concerned with the rise of totalitarian governments and their ability to use propaganda and censorship (the censors in \"1984\" worked for \"Big Brother\" in the government's \"Ministry of Truth\") to convince citizens of an alternate and ever-changing history.", "Whatever your interpretation of \"1984,\" it is a book worth reading and discussing (possibly with a functional hashtag like #1984Orwell).", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]