["About this rating", "In early December 2018, the Malaysian newspaper Sinar Harian reported that a 16-year-old in Rembau, a town south of the capital of Kuala Lumpur, had been found dead by his mother. The teenager, Mohd Aidi Azzhar Zahrin had blood coming from his left ear and had been listening to music through earphones plugged into his charging cell phone. Sinar Harian stated that an autopsy had been performed and had revealed the cause of death to be electrocution.", "Neither Sinar Harian nor its English-language peer the New Strait Times asserted that the youngster was electrocuted by the earphones he was wearing, but that was the conclusion reached by a number of international publications, including widely-read U.S.-based Vice and Teen Vogue, both of whom aggregated the story.", "For example, a 9 December 2018 Vice headline read \"A 16-Year-Old Has Died After Being Electrocuted by His Headphones,\" with the text of the story stating:", "Mohd is at least the fourth person this year to be killed by a headphone-inflicted electric shock. In February, 17-year-old student Luiza Pinheiro was similarly found dead on the floor of her home in Riacho Frio, Brazil after a “huge electric charge” surged through her phone and the headphones melted in her ears, NewsCorp reported.", "Indeed, reports of people dying from being electrocuted by their headphones pop up every so often, but the true causes of these deaths remain unclear. As in the case of Mohd Aidi Azzhar Zahrin, the details from news reports were not specific, and we haven't yet seen clear evidence that his earphones caused the youngster's tragic passing.", "A Yahoo7! news report contained a purported photograph from the scene (linked here, however we caution it is graphic). A portion of the teen's bloody face can be seen along with an earbud held aloft by a gloved hand, but the earbud appears to be undamaged (save perhaps for a small black mark).", "The claim that the teenager was electrocuted by the earphones he was wearing rests on a comment offered by district police chief Deputy Superintendent Anuar Bakri Abdul Salam to a local reporter, but the local versions of the story do not maintain it was the teen's earphones specifically that caused the electrocution death. The New Strait Times reported, for example, that:", "Anuar Bakri said the woman then contacted a nearby clinic and a medical officer was rushed to the house.", "\"Checks showed no sign of bruises or injuries. However, there was bleeding in the boy's left ear,\" he said.", "He said the boy was believed to be wearing the headphone while the handphone was charging.", "\"The medical officer later confirmed that the boy had died hours earlier.\" he said.", "Anuar Bakri added that a post mortem conducted at Tuanku Ja'afar Hospital revealed that the cause of death to be related to electrocution.", "In regards to this story, we consulted a half-dozen emergency room (ER) physicians (members of the advocacy organization American College of Emergency Physicians, or ACEP), and none of them considered it likely that a person could die from an electrical shock received via earphones plugged into a cell phone, although some of them said more details about the incident were needed. None of the reports we found about the incident, for example, specified what kind of phone or earphones the teen had.", "Los Angeles-area ER doctor Patrick Cichon said that amperage (\"current flow\") is more lethal than voltage (\"current potential\"), but both amperage and voltage are below lethal thresholds in typical earphones. Therefore, Dr. Cichon wrote, it would be \"highly unusual unless using defective equipment or operating outside all normal operating parameters for something like this to occur.\"", "Dr. Eric Lavonas, professor of emergency medicine and medical staff president at Denver Health, told us not enough voltage runs through such devices to cause a death as described in the viral news reports. \"The plug assembly converts high voltage (in Malaysia, 220V wall outlet) into low voltage before it enters the phone. And of course the phone is only putting out low voltage to the headset,\" he wrote.", "Detroit physician Brad Uren told us he had seen the story in the wild before we contacted him, and he doubted the veracity of the reporting from get-go. For such a death to occur, he averred, it would require a number of unlikely factors to coalesce into a deadly worst-case scenario.", "Most phones charge at 5 volts and \"relatively low amperage,\" Uren told us via email. Even if a failure occurred at the plug or charger level, \"that current would then need to travel through the phone and across the headphone plug into the ear pieces. The small circuits in a phone would probably have a hard time carrying significant current to the earpieces,\" he said, continuing on to state that:", "I don't know of any headphones with exposed metal or conductive material, but they may exist. If non-conducting there would need to be significant sweat or salty water, etc. in the ear to conduct electricity to the body from some part of the headphone which would theoretically be energized. (Such a level of wetness would probably result in enough discomfort to cause the user to remove them before the result described.)", "Though true that relatively low current has been reported to cause significant injury or death, this is usually current delivered to the heart. This story described ears and head as the apparent site of injury. Seizure or respiratory arrest is possible, I suppose, assuming such a worst case scenario.", "As an emergency room doctor, Uren& stopped short of calling the notion impossible because \"I have seen some strange things in my career thus far,\" but he added the story that the teen died from being electrocuted by earbuds \"strains credibility.\"", "We reached out to the National Electrical Contractors Association for further information from the electrical engineering aspect of the story, but they told us that not enough details about the incident were publicly available for them to be able to weigh in on the subject.", "Zulkifili, Syamilah.   \"Remaja Maut Terkena Renjatan Telefon Bimbit.\"\r\n    Sinar Harian.   4 December 2018.", "Mohd Helmi Irwadi Mohd Nor.  \" Teen Electrocuted While Charging Mobile Phone.\"\r\n    New Strait Times.   5 December 2018.", "Butler, Gavin.   \"A 16-Year-Old Has Died After Being Electrocuted by His Headphones.\"\r\n    Vice.   9 December 2018.", "McNamara, Brittney.   \"A Teen Died After Reportedly Being Shocked by His Headphones.\"\r\n    Teen Vogue.   10 December 2018.", "Yahoo7 News.   \"Boy, 16, Electrocuted to Death While Using Headphones.\"\r\n    8 December 2018.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]