["About this rating", "A French-language film, scheduled for release on Netflix on Sept. 9, 2020, became the subject of controversy thanks to a major marketing mess-up. \"Cuties\" — also known as \"Mignonnes\" in French — was a movie about an 11-year-old girl who joins a dance group. A poster for the film shared by Netflix in August 2020 showed the girls in the dance group wearing short shorts and crop tops and engaging in various provocative poses. (The offending poster can be viewed here.)", "We learned that Netflix did indeed commission this poster. Its release was followed by outrage, with many arguing that it was inappropriate and sexualized young girls.", "The version commissioned by Netflix was vastly different from the poster used for the French theatrical release in April:", "Netflix tweeted an apology on Aug. 20 that stated that:", "We’re deeply sorry for the inappropriate artwork that we used for Cuties. It was not OK, nor was it representative of this French film which premiered at Sundance. We’ve now updated the pictures and description.", "The film, which won the World Cinema Dramatic Directing Award at the Sundance Film Festival in 2020, tells the story of a Senegalese Muslim girl named Amy living in Paris. According to some reports, Netflix’s original description of the film indicated that Amy \"becomes fascinated with a twerking dance crew.\" The description of the film on the company's website now reads: \"11-year-old Amy starts to rebel against her conservative family's traditions when she becomes fascinated with a free-spirited dance crew.\"", "Based on the outcry and Netflix’s subsequent apology, we rate this claim as \"True.\"", "Grater, Tom.   \"Netflix Apologizes for 'Inappropriate' ‘Cuties’ Poster That Was Criticized for Sexualizing Children.\"\r\n    Deadline.   20 August 2020.", "IMDb.   \"Cuties.\"\r\n    Accessed 21 August 2020.", "Jensen, Erin.   \"Netflix Is 'Deeply Sorry' for 'Inappropriate Artwork' Used for Film About Kids' Dance Group.\"\r\n    USA Today.   20 August 2020.", "Kirchner, Madison Malone.   \"Wait, What’s Going on with Netflix and Cuties?\"\r\n    Vulture   20 August 2020.", "Nur Nasreen Ibrahim is a reporter with experience working in television, international news coverage, fact checking, and creative writing.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]