["On September 6, Times Now reported that China has thrown open the Pangong Tso Lake to international tourists and domestic tourists as well. “The videos of opening Pangong Tso Lake to the international tourists on the Chinese side are being disseminated by China itself. The move seems like a PR exercise to gather more attention to their side,” claimed Times Now with the anchor asserting, “These are the visuals that we have acquired.”", "India and China have been embroiled in cross-border skirmishes which aggravated after 20 Indian army men were martyred in Galwan Valley on June 15. People’s Liberation Army’s (PLA) western theatre command (WAC) claimed that China had to take “countermeasures” after Indian border troops fired warning shots on September 7 near the Shenpao mountain region near the south bank of Pangong Tso, reported Hindustan Times. The Indian army has dismissed the allegations.", "China has indeed released a video of the lake on the Chinese side. This was also tweeted by a journalist of the state-controlled broadcaster CGTN.", "🇨🇳Actually, #PangongTso in #China is open to tourists at home and abroad for quite a long time. The lake is near Chinese national highway, a good place for self-driving travel. We have a resort on the lake there. 😆 pic.twitter.com/ZbaWDUw1gk", "— Shen Shiwei沈诗伟 (@shen_shiwei) September 8, 2020", "But funnily enough, Times Now aired scenes of the ‘3 Idiots’ shooting point at Pangong Lake to report on the development. Bollywood film ‘3 idiots’ released in 2009 leading to a surge in Ladakh tourism. On the Indian side of the Pangong Lake is a ‘3 idiots’ shooting point built to attract tourists. Times Now aired these visuals as China “throwing open” Pangong Lake for domestic and international tourists. According to The Indian Express, the lake is 135-km long, out of which about 45 km-long western portion is under Indian control while the rest is controlled by the Chinese.", "Alt News has juxtaposed screenshots of the Times Now broadcast with a publicly available YouTube video of the ‘3 idiots’ shooting point at Pangong Lake. As evident, yellow bike and chair used in the film can be spotted here. A poster of the movie can also be seen.", "This slideshow requires JavaScript.", "The ‘3 idiots’ spot has several yellow coloured bikes which, according to The Hindu, can be rented by tourists.", "The one with a conical object attached to it was used by actor Kareen Kapoor in the film. A similar scooter is also visible in the video broadcast by Times Now.", "This slideshow requires JavaScript.", "To sum it up, while there have been reports of the Chinese side of the Pangong Lake opening up for tourists, Times Now aired visuals of the ‘3 idiots’ shooting point on the Indian side to report on the news.", "[Update: Times Now took down is broadcast ‘China throws open Pangong Tso Lake for international tourists amid border tensions with India’ after this fact-check was published. A downloaded video of the same has been added to the report.]", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A claim that Nobel laureate Amartya Sen has passed away went viral on social media…", "Within hours of Prime Minister of Canada Justin Trudeau alleging that “agents of the government…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…", "On the front page of its national edition dated August 22, Hindi daily Dainik Jagran…", "In his reply to the no-confidence motion brought by the Opposition in the Lok Sabha,…"]