["About this rating", "In February 2017, news outlets reported on a new product called \"Mensez\" and its promise to solve menstrual inconveniences and serve as an alternative to tampons and pads by gluing women's labia together, along with the inventor's claims that it would revolutionize the menstruation-product industry.", "Although the reports about Mensez sounded to many readers like just more online satire, we found that a Wichita chiropractor named Dan Dopps was awarded indeed awarded a patent for the concept on 10 January 2017. The Wichita Eagle tracked down Dopps for a profile and quoted him as follows:", "“I don’t want to offend anyone in any of this,” Dan Dopps, CEO and president at Wichita-based Mensez Technologies, said in a phone interview. “It’s a good option that if women will actually consider, they will see it will improve their lives.”", "Dopps also owns Dopps Chiropractic Clinic at 8114 W. Central, according to his brother Brad Dopps. The clinic is independent of the other Dopps Chiropractic clinics in Wichita, and family members have disavowed the product ... Thea Butler, 26, shared screenshots of the “feminine lip-stick” after seeing screenshots of the post and realizing Dopps worked only a few minutes from her mother’s house.", "“I thought it was satire at first, and then I started looking at it, and I was like, ‘no, this guy has got to be serious,’” Butler said over the phone.", "Butler was one of many who responded with incredulity. Comments ranged from calling for Dopps to glue his mouth shut to asking whether he understood basic female anatomy.", "The Mensez account shot back.", "“Yes, I am a man and you as a woman, should have come up with a better solution then diapers and plugs, but you didn’t,” read a comment from the now-unavailable Mensez Facebook account. “Reason being women are focused on and distracted by your period 25% of the time, making them far less productive then they could be.”", "Dopps' brothers answered questions about the Mensez controversy, distancing themselves and their businesses from their sibling's foray into inventing:", "“None of us agree with what he’s doing or trying to do,” Brad Dopps said over the phone. “We have tried to control his concept and marketing, and we have been unable to prevent his freedom of thought, expression and speech.”", "Fred Dopps, another brother who owns a clinic at 2243 S. Meridian, said his brother’s idea has been “an embarrassment.”", "“Dan’s a great chiropractor, and he’s helped many people, but this has nothing to do with chiropractic, and I personally told him it was a bad idea to associate his name with the product,” Fred Dopps said over the phone. “I didn’t think it was in his best interest or the family name, which we’ve tried hard to build in this community.”", "Among myriad news reports about Mensez were some that pointed out the product had not been fully developed, nor did it appear to exist even in prototype form. Much of the information about Mensez came from Dopps' since-deleted Facebook page, where he purportedly made a number of inflammatory comments about women, vaginas, and menstruation:", "Anyone with basic knowledge of human anatomy knows that the vagina is a muscular, tube-shaped structure, with its opening located behind the urethra, where the urine is expelled. Several women have suggested that Dopps is a misogynist, and that a man shouldn’t make products for women without firsthand knowledge of female anatomy.", "He easily corroborated this charge in a response to one visitor's comment on the Mensez Facebook page, in which he explained that “[Y]ou as a woman should have come up with a better solution than diapers and plugs, but you didn’t. Reason being women are focused on and distracted by your period 25% of the time, making them far less productive than they could be. Women tend to be far more creative than men, but their periods that [sic] stifle them and play with their heads.” Dopps added over the phone that “a lot of the LGBT community, lesbians in particular, are furious at me because I’m a white straight man.”", "Although it is true that Dopps was issued a patent for Mensez-like concept in January 2017, inventions do not have to work, or even be feasible concepts, in order to be patented.  It is possible that Mensez was the legitimate brainchild of a person not entirely familiar with female anatomy, but it is also within the realm of possibility the concept was nothing more than a media hoax.", "We reached out to Dopps for general comment, and he sent us the following reply:", "Q: What made you come up with this?", "A: Innovation is essential it makes the world go round, we all have to have a new iPhone every year.   Feminine hygiene has not had any significant innovation in the past 50 years. That is if you don’t count a new colored boxes.", "I looked at the issues that women have like.  Security, comfort, reliability, cleanliness, convenience, humiliation, infections, health, discrete, cost, environment, and the overall hassle factor. I believe that Mensez is a simple elegant solution that will improve all of that, and that it will improve the lives of women around the world.", "Q: Can people actually order this [product], or is it still in the testing and funding stage?", "A: Mensez is not available. It an idea, with a patent a month ago, I am in the funding stage. Then there will need to be substantial development and testing and regulation approval.", "Q: What response are you getting from the women who have used it?", "No one has used it. I do not have the final formulation or certification.  When that happens it will be done by licensed professionals.", "Q: Some might question your qualifications because you are a Chiropractor and not an OB/GYN ... How would you respond to those concerns?", "A: Those people believe that a person is not allowed to think outside of their little box or specialty. Yet they know that innovation comes from thinking outside the box ... I always ask, why and I do think outside of box.  I like to connect the dots between boxes.", "I do not practice obstetrics,  but in my Chiropractic degree I had classes in Obstetrics and Gynecology and I did passed my national board exams in them.  I do know the anatomy and physiology.", "Q: How long does an application of Mensez lipstick last?", "A: It will last until it comes in contact with urine, or soap and water.", "Q: How about when it comes to sex? Does it just dissolve or do you have to wash it off?", "A: Wash it off. I imagine that most women would freshen up any.  The same as if they were wearing a tampon.", "Q: How does it affect the delicate ecosystem of flora and PH balance of a woman’s vagina?", "A: I don’t see that there will be any negative affect on that, if anything it will only improve.", "The PH is from natural secretions.", "There is no air exchange with the blood, which can alter the PH, cause odors and promote bacterial growth", "There are no potentially bacteria and chemical contaminated tampons being inserted.", "The irritations from the absorbent materials is gone.  Irritations increases your risk of infection.", "Mensez is an ELEGANT AND HEALTHY Idea", "The PH in the vagina is 3.5-4.5, we are not changing that.   The PH of urine is 6.5-8, and the difference between the two PH’s is one thing that helps to dissolve the Mensez seal.  It’s natural.", "Q: Please take me back to the first clinical trials and how you were able to get women to try this, because messing around down there can be a little scary?", "A: There have not been any clinical trials.", "Probable 20 % of the emails that I have gotten are women volunteering to test it.", "I personally have no interest in doing that.", "Q: So Mensez Lipstick seals the lips shut when a woman is on her period… and the menstrual blood just collects in the vagina waiting to drain? Is that how it works?", "A: Yes, the menstrual blood collects in the vagina the same location that a tampon collects it.", "The labia like all mucus membranes naturally want to stick together, it’s a very weak attraction and Mensez only increases that attraction between the labia.  It’s made of a combination of amino acids (the building blocks of protein) and oil.  It is not a glue as so many have been calling it.  The seal that is created is strong enough to prevent leakage until it comes in contact with urine.  A woman will not feel sensation of stretching or hair pulling with her normal activity.", "Q: There might also be some concerns that a man designed this for women ... how have you battled those concerns?", "A: I have done very poorly, it’s tough to communicating, it is so taboo, and guys are not allowed to an opinion about periods", "Q: Would you let your wife or daughter use it?", "A: Absolutely!", "Q: Would you also recommend using a pad as well as Mensez Lipstick, or is there a need for a pad?", "A: Yes, I don’t believe that any women would want to take that risk, at least a panty liner is required initially until she learns to use it and develops confidence.   There are normal variations in anatomy, and there will be some women that it will not work for.  Each one them will have to experiment with it how it works for them.", "Q: What kind of response have you gotten?", "A: Website traffic ranges between has been scary. 10,000 and 75,000 visitors per day.", "Thousands of emails and tweets from women wanting to buy it or volunteering to test it.", "A lot of high fives and companies and  foundations offering to provide funding, companies wanting distribution rights, Colombia, Bulgaria, Indonesia, South America.", "And there have been almost as many emails from haters, mainly because my Facebook post were not understood or taken out of context and there were some that were just wrong of me to post.", "I have had just set up the web site a month ago and started talking to women on face about Mensez.  There are a lot of smart women there that were willing to convers and share their issues.  I was not intending to offend anyone, I was totally unprepared and did not think that it would go viral.", "Q: And who is the ideal target age group for this?", "Younger women for sure, there are women that have bladder control issues and it will not work for them.  I do have some ideas for a similar solution that may come later for that group.  It will really come down to an individual bases and women will have to try it and see if they benefit.", "A: Did you ever consider pitching this on Shark Tank?", "With all my patents I consider Shark tank, but not with this idea, it’s too early and will take a whole lot of funding.  Whoever does that will want all the rights.  I personally want to sell the idea and intellectual rights and go on doing what I do.", "We note that both the questions and answers reproduced above came from Dobbs himself; he was not responding to a series of questions we posed to him ourselves.", "Brown, Kristen V.   \"Please Don't 'Glue' Your Vagina Shut During Your Period.\"\r\n    Gizmodo.   24 February 2017.", "Burgess, Katherine.   \"Wichita Chiropractor Takes Flak for ‘Lip-Stick’ Menstrual Product.\"\r\n    The Wichita Eagle.   21 February 2017.", "Palmer, Roxanne.   \"The Strangest Inventions Ever Patented.\"\r\n    The Week.   6 August 2014.", "Senapathy, Kavin.   \"A Male Chiropractor Wants Women to Use Controversial Methods to Contain Menstrual Flow.\"\r\n    Forbes.   20 February 2017.", "United States Patent and Trademark Office.   \"US9539077B1: Method for Alternatively Resisting and Permitting Menstrual Flow.\"\r\n    10 January 2017.", "Mensez.   \"Mensez Feminine Lip-Stick.\"\r\n    Accessed 27 February 2017.", "Quora.   \"Does an Invention Have to Be Proven to Work, Or Just Conceptually Feasible, To Be Patentable?\"\r\n    Accessed 7 November 2015.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]