["About this rating", "While evangelical leader Franklin Graham has been a staunch supporter of President Donald Trump, his father Rev. Billy Graham publicly warned against the prospect of religious figures becoming too attached to a political stance.", "Several readers contacted us in January 2018 seeking to confirm a statement attributed to the elder Graham:", "I don't want to see religious bigotry in any form. It would disturb me if there was a wedding between the religious fundamentalists and the political right. The hard right has no interest in religion except to manipulate it.", "The statement was also circulated online in meme form:", "In this case, the quote is authentic, and taken from the 1 February 1981 cover story in Parade magazine; it was part of Billy Graham's account of conversations with fellow reverend Jerry Falwell, who helmed the conservative politcal group the Moral Majority. Graham said:", "I told him to preach the Gospel. That's our calling. I want to preserve the purity of the Gospel and the freedom of religion in America. I don't want to see religious bigotry in any form. Liberals organized in the '60s, and conservatives certainly have a right to organize in the '80s, but it would disturb me if there was a wedding between the religious fundamentalists and the political right. The hard right has no interest in religion except to manipulate it.", "The statement was featured early on in the story and was also highlighted below a picture of Falwell and then-President Ronald Reagan:", "In the story, Graham admitted that he no longer thought of Communists as being \"disciples of Lucifer,\" contrary to his own rhetoric from earlier in his career. He also cast himself as having no part of Falwell's organization, which became a key conservative constituency before dissolving in 1989. He said:", "It would be unfortunate if people got the impression all evangelists belong to that group. The majority do not. I don't wish to be identified with them. I'm for morality. But morality goes beyond sex to human freedom and social justice. We as clergy know so very little to speak out with such authority on the Panama Canal or superiority of armaments. Evangelists can't be closely identified with any particular party or person. We have to stand in the middle to preach to all people, right and left. I haven't been faithful to my own advice in the past. I will be in the future.", "While the elder Graham has had relationships with several U.S. presidents spanning decades, he told Christianity Today in 2011 that, given the chance to do anything differently in his life, \"I also would have steered clear of politics.\"", "His son, on the other hand, has positioned himself as a Trump supporter since 2011, when he contributed to the debunked \"birther\" conspiracy theory that former President Barack Obama was not born in the United States. In October 2016, the younger Graham published a social media post (misattributed to his father) urging evangelical voters to vote for Trump.", "More recently, Franklin Graham has refused to criticize the president for reportedly calling African countries \"shitholes\" or for alleged extramarital affairs -- drawing criticism from Graham's own niece -- and claimed that the U.S. was \"in a coup d'etat\" perpetrated by political enemies of Trump who were using the media against him.", "Bailey, Sarah Pulliam.   \"Q & A: Billy Graham on Aging, Regrets, and Evangelicals.\"\r\n    Christianity Today.   21 January 2011.", "YouTube.   \"Interview with the Rev. Franklin Graham,\" uploaded by ABC News.\r\n    https://youtu.be/lx2E286GAcE   24 April 2011.", "Vales, Leinz.   \"Evangelical Leader Franklin Graham Says Trump is a 'Changed Person.'\"\r\n      CNN.    24 January 2018.", "Allen, Bob.    \"Franklin Graham Asserts That Trump Could be Toppled in a Coup.\"\r\n      Baptist News.    30 January 2018.", "Delk, Josh.    \"Billy Graham's Granddaughter: Trump Needs to Ask for Forgiveness.\"\r\n      The Hill.    27 January 2018.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]