["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "After Beto O’Rourke said on HBO’s Real Time with Bill Maher that he wants to help get the country back on track, Maher asked: \"And you don’t take PAC money?\"", "O’Rourke, the El Paso congressman nominated by Democrats to face Republican Sen. Ted Cruz in November 2018, replied during the program’s March 16, 2018, episode: \"I don’t take a dime of PAC money--no corporations, no special interests.\"", "MAHER: \"First of all, for those, anybody who’s watching that might not be a political junkie, what is PAC money? What does that mean?\"", "O’ROURKE: \"So, political action committees represent the corporations and interests that have business before Congress — so the pharmaceutical industries, the telecom industries, the energy industries, the insurance industries — and they give money to members of Congress not just for access, although that’s part of it.", "\"They’re also buying outcomes, actual legislative language that appears in the bills, and in the bills that become laws,\" O’Rourke said. \"When you wonder why Congress is so dysfunctional, why it doesn’t represent the interests of the people it purports to serve, it’s because it’s so tied to the sources of money that are coming in.\"", "O’Rourke, initially elected to the House in 2012, accepted PAC donations through his 2014 re-election. In 2017, we rated Half True an O’Rourke claim that he was one of two members of Congress taking no corporate cash or political action committee money. (There were five, and no member of Congress can legally take corporate cash.) O’Rourke had received about $297,000 in PAC donations in his House bids of 2012 and 2014 but hadn’t accepted PAC aid from 2015 into 2017.", "O’Rourke, who announced his Senate candidacy in March 2017, has since out-raised Cruz in all but one quarter.", "O'Rourke campaign's finance reports", "So, has O’Rourke also not taken PAC money?", "Chris Evans of O’Rourke’s campaign replied to our inquiry about this claim by noting in an email that for the second quarter of 2018, O’Rourke reported raising more than $10.4 million from individuals and absent PAC donations. Evans said all of O’Rourke’s 2017-18 filings with the Federal Election Commission would show a similar pattern--all contributions from individuals, none from PACs.", "On the FEC’s website, we checked O’Rourke’s seven campaign finance reports covering 2017 through June 2018. In the period, the reports state, O’Rourke’s campaign reported raising more than $23.5 million entirely from individuals. Each report shows a zero for contributions from PACs.", "Cruz’s Senate campaign reported raising more than $14 million in the same period--counting a little over $1 million from PACs, according to its finance report filed in July 2018.", "A PAC’s bundling", "Months after O’Rourke made his claim to Maher, Cruz’s campaign suggested that O’Rourke had benefited from a PAC’s--running afould of his no-PACs self-description. In July 2018, as noted in a Dallas Morning News account, Cruz said O’Rourke had accepted $167,408 in contributions collected, or bundled, from individuals by the J Street PAC, which says it endorses candidates based on goals including a focus on American diplomacy \"toward a two-state outcome between Israel and the Palestinians.\"", "To our inquiry, Evans defended the PAC-bundled donations, saying by email: \"Each contribution was made by an individual following individual contribution limits and the reporting requirements mandated for individuals such as name, address, employer.\"", "We separately heard back from the Center for Responsive Politics, which has long tracked the influence of money in politics.", "Andrew Mayersohn told us by email that the center doesn’t consider PAC earmarking/bundling of donations by individuals to be the same as a PAC contribution. Mayersohn also pointed us to an Aug. 6, 2018, Associated Press fact-check confirming that $170,000 in donations by individuals were routed to O’Rourke’s campaign through the J Street PAC, \"which also hosted an event to collect individual donations to put directly toward his campaign.\"", "That story quotes an unidentified FEC spokeswoman saying the commission doesn’t consider individuals’ donations delivered through \"conduit\" PACs to be PAC money. The AP story went on: \"Neither do campaign finance experts, who say the donations are more transparent than PAC donations. ‘No, it's not a PAC donation,’ said Victoria Farrar-Myers, an expert on campaign finance at Southern Methodist University in Dallas.\" Noted too:  By law, individual donations are capped at $2,700 per election while PACs may donate up to $5,000.", "Our ruling", "O’Rourke told Maher: \"I don’t take a dime of PAC money.\"", "O’Rourke’s campaign finance reports from the launch of his candidacy in 2017 through June 2018 show no PAC contributions. O’Rourke didn’t object to a PAC focused on Israel bundling donations for his campaign, but all of those were made by individuals.", "We rate this claim True.", "TRUE – The statement is accurate and there’s nothing significant missing. Click here for more on the six PolitiFact ratings and how we select facts to check.", "Beto O’Rourke interview, Real Time With Bill Maher, HBO, March 16, 2018 (YouTube video, PAC statement starting at 4:42 mark)", "News story, \"O’Rourke maintains blistering fundraising pace in race against Cruz,\" Austin American-Statesman, July 12, 2018", "Truth-O-Meter article, \"Beto O'Rourke claims near-uniqueness in not taking corporate or PAC contributions,\" PolitiFact Texas, July 27, 2017", "Emails, Chris Evans, communications director, Beto O’Rourke campaign, Aug. 15-16, 2018", "Web pages summarizing campaign finance filings by Beto O’Rourke and Ted Cruz, Federal Election Commission, January 2017 through June 2018 (accessed Aug. 16, 2018)", "News story, \"Here’s how much Beto O’Rourke and Ted Cruz have raised in their midterm Senate race,\" Texas Tribune, May 9, 2018", "Campaign-finance filings by Ted Cruz committees (aside from his campaign committee), Jobs, Freedom, and Security PAC,  \"Year-End, 2017,\" \"August Monthly (2018),\" Ted Cruz Victory Committee, \"Year-End, 2017,\" \"July (2018) Quarterly,\" FEC (accessed Aug. 16, 2018)", "News story, \"Ted Cruz bashes Beto O’Rourke for accepting funds raised by PAC, which bundled individual donations,\" Dallas Morning News, July 31, 2018", "Email, Andrew Mayersohn, committees researcher, Center for Responsive Politics, Aug. 16, 2018", "News story, \"AP FACT CHECK: O'Rourke gets money through PAC, not from it,\" The Associated Press, Aug. 6, 2018 (accessed Aug. 20, 2018 on The Virginian-Pilot website)", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]