["About this rating", "Ronald Reagan won the 1980 general election in a landslide despite trailing as much as 8% behind Jimmy Carter in some mid-October polls.", "Reagan wasn't trailing Carter in all polls, and significant events in the final weeks of the 1980 campaign helped to swing public opinion in Reagan's favor.", "Two-and-a-half weeks before the 2016 presidential election, GOP presidential candidate Donald Trump trailed behind Democrat Hillary Clinton by an average of 6% in national polls, a statistic that buoyed Clinton supporters, yet failed to rattle diehard supporters of Trump, who had managed, as The Guardian put it, to \"confound expectations\" all year:", "As smoke clears from weeks of political bombardment, White House watchers are convinced the only questions now are how big Hillary Clinton’s win will be and whether the Democrats can take Congress, too.", "Those Republicans still loyal to Trump cling to the hope that all the polls are wrong – that in barely two weeks’ time, angry voters will again stun the world. Over and over, Donald Trump is saying one word: Brexit.", "“We will win,” he told a rally in Pennsylvania on Friday. “We will shock the world. This is going to be Brexit-plus.”", "Hubris aside, some of his supporters remained worried about voter defections in the wake of the Trump \"groping\" scandal, prompting calls for an eleventh-hour get-out-the vote drive, not to mention homebrew efforts to rally people to the polls like the image macro below:", "The Internet meme was accurate insofar as public opinion polls taken in October 1980 showed Democrat Jimmy Carter holding as much as an eight-point lead over Republican Ronald Reagan (a Gallup poll two weeks before the election had Carter at 47% and Reagan at 39%), yet Reagan won a landslide victory in the general election, beating Carter 489 to 49 in electoral votes and by almost 10% in the popular vote. (It should be noted that 6.6% of the popular vote also went to a third-party candidate, John Anderson.)", "To conclude from that single example that polls simply ought not to be believed is a stretch, however. The 1980 upset was anomalous, the polling organization Gallup says, and based on factors unique to that year's campaign:", "Reagan's late-breaking surge that year is generally attributed to the only presidential debate between Carter and Reagan — held one week before the election, on Oct. 28 — which seemed to move voter preferences in Reagan's direction, as well as the ongoing Iran hostage crisis, which reached its one-year anniversary on Election Day. After trailing Carter by 8 points among registered voters (and by 3 points among likely voters) right before their debate, Reagan moved into a 3-point lead among likely voters immediately afterward, and he won the Nov. 4 election by 10 points.", "By contrast, in 2016 the two major party candidates have already faced off in three head-to-head debates, all held well before Election Day, that have resulted in little or no improvement in Trump's underdog position in the polls.  And among the many issues and challenges facing America, none of them looms in the forefront the way the Iranian hostage crisis (and the Iranian Revolution in general) did throughout the final year of Jimmy Carter's presidency, as Jonathan Chait noted back in 2012 when Republican challenger Mitt Romney found himself in a similar underdog position against incumbent president Barack Obama in that year's campaign home stretch:", "[In 1980] the economy cratered (nothing remotely comparable has occurred this year) and then the Iranian hostage crisis, after an initial rally-around-the-flag blip, steadily corroded Carter’s popularity. No equivalent of those factors can be seen yet today, and pinning your hopes on a scenario where your campaign suddenly picks up ten points in the final month seems to be either an act of self-delusion or a ploy to keep anxious conservatives at bay.", "John Sides similarly observed when commenting on the 2012 presidential race that the notion President Carter held a polling lead over Ronald Reagan in 1980 right up until the very end of the campaign is something of a misconception:", "... 1980 is a poor comparison with 2012 for many reasons.  One is simply that the economy is not as bad in 2012 as it was in 1980. But there is another apparent misconception in the Romney campaign, which Nate Silver rightly picked up on: Carter didn’t lead Reagan for much of the campaign.  The [poll tracking] plot shows what Chait describes, which is the ebbing of Carter’s poll standing throughout 1980.  Indeed, Reagan didn’t need his convention bump — which he certainly got — to put him in the lead.  The Democratic convention helped erode Reagan’s lead but it never closed it altogether.", "At the end of the campaign, Reagan did surge, but this only increased his lead.  His surge appears to have been brought on first by the debate, and then perhaps by several other events in the final week of the campaign:", "\"On Friday of that week the final economic indicator of the campaign showed inflation still seriously on the rise. And on Sunday morning, November 1, the Iranian parliament announced their conditions for freeing the American hostages. Jimmy Carter immediately abandoned campaigning and appeared on national television in the early evening to repeat much of what the public had been hearing all day. It was a week, in effect, with much that could affect the choices made by voters.\"", "Carter’s pollster, Patrick Caddell, believed that Iran’s rebuff doomed Carter, saying “It was all related to the hostages and events overseas.”", "Harry Enten of the statistical analysis web site FiveThirtyEight confirmed that in ordinary circumstances, October public opinion polls are usually reliable and highly predictive of final election results:", "In most years, the early-October polls [since 1952] were pretty close to the mark, with a correlation of +0.96 between the polls and the final result. Ten of the 16 elections featured errors of 3 percentage points or less, and in all but three campaigns, the polls were within 5 percentage points of the final outcome. Even in 2012, when Mitt Romney closed his deficit against President Obama after the first debate, the polls at this point still showed Obama leading. At this point in the election cycle, the average error of polls for all elections is just 3.3 percentage points (much lower than the 4.7-point error we found for just after the conventions), and every candidate who’s been ahead in the popular vote in mid-October went on to win the election.", "Given the rarity of last-minute upsets, did Enten think Donald Trump still had a chance to stage a comeback and win the general election despite lagging 6% in the polls?", "\"Its possible,\" he wrote. \"But it would be basically unprecedented.\"", "Is that an excuse for anyone, regardless of party affiliation, not to turn out to vote? No, it is not.", "Blanton, Dana.   \"Fox News Poll: Clinton Tops Trump by 6 Points.\"\r\n   Fox News.   18 October 2016.", "Enten, Harry.   \"Is There Any Precedent for a Trump Comeback?\"\r\n   FiveThirtyEight.   12 October 2016.", "Harwood, John.   \"History Suggests McCain Faces an Uphill Battle.\"\r\n   The New York Times.   12 October 2008.", "Jones, Daryl.   \"3 Unlikely Ways Donald Trump Could Win.\"\r\n   Forbes.   17 October 2016.", "Roberts, Dan and Chalabi, Mona.   \"‘Brexit Times Five’: Could Trump Really Win Despite Polls Favoring Clinton?\"\r\n   The Guardian.   22 October 2016.", "Saad, Lydia.   \"Late Upsets Are Rare, But Have Happened.\"\r\n   Gallup.   27 October 2008.", "RealClearPolitics.   \"General Election: Trump vs. Clinton.\"\r\n   22 October 2016.", "Reuters.   \"Donald Trump Still Trails Hillary Clinton in National Polls.\r\n   22 October 2016.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]