["About this rating", "Since as early as Sept. 23, 2018, a meme titled “Why I Stick My Neck Out for Trump” has been shared with various dubious claims of authorship. A post on the website me.me on that date, as well as a tweet from a user named “Mark the Deplorable” two days later, attest that the meme has been around since at least as early as September 2018. Since then, the message, shown below, has been attributed to a handful of individuals or anonymous sources, including, most recently, actor and director Clint Eastwood:", "The text’s attribution to Eastwood is a recent invention. The words apparently have been falsely attributed to others before him. For instance, sometime on or around May 3, 2019, the actual text of the aforementioned meme appeared as an “article” on Frontpage Magazine titled “Why I Stick My Neck Out For Trump.” Though the article is no longer on that outlet’s website, copy-pasted versions remain elsewhere that attributed authorship to David Makovsky, a fellow at The Washington Institute and director of their Project on Arab-Israel Relations.", "Makovsky, however, denied authorship of what he described as a 'false article.'\" On the same day the article appeared to have been published, Matovsky demanded, via Twitter, that Frontpage remove the article from its site. We reached out to both Makovsky and Jamie Glazov, Frontpage’s managing editor, for clarification on this issue, and have received no response. If the article was indeed published there, no evidence of its existence can be found presently.", "Later, in October 2019, social media posts began presenting the essay as having been “tweeted by Clint Eastwood.” This is an especially dubious scenario. Eastwood, a prominent Hollywood conservative who frequently has right-wing talking points falsely attributed to him on social media, does not have a Twitter — or any other social media — account. In 2016, Eastwood’s daughter, Morgan Eastwood, called out a Twitter account for impersonating her dad, stating that the actor “would not know how to use social media.” She reiterated this point in 2018, explicitly stating her dad has no social media presence of any kind.", "Because of multiple false claims of authorship for the essay, and because its attribution to Eastwood requires a social media account that does not exist, we rank the claim that Eastwood authored “Why I Stick My Neck Out For Trump” as \"False.\"", "me.me.   “People Message Me Why I Stick My Neck Out For Trump...”\r\n    23 September 2018.", "FreeRepublic.com.   “Why I Stick My Neck Out For Trump”\r\n    3 May 2019.", "Hainey, Michael.   “Clint and Scott Eastwood: No Holds Barred in Their First Interview Together.”\r\n    Esquire. &nbsp 3 August 2016.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]