["One misleading post was published on Facebook here on February 11, 2020. It has been shared more than 13,000 times and has since been deleted.", "Below is a screenshot of the misleading post:", "The Sinhala language text superimposed on the image translates to English as: “Let us stand against the conversion of the Ehelepola Walawwa into a Muslim school. Let’s protect our heritage.”", "The post’s caption reads: “Let's join”.", "Ehelepola Walawwa is located in Kandy, a major city in central Sri Lanka. It was the ancestral home of a courtier named Ehelepola Disawe during the Kandyan kingdom. The building was used as a prison during the British colonial era and then as a remand facility following independence. In 2013, the building was transferred under the purview of former Sri Lankan President Mahinda Rajapaksa to be restored as a cultural site.", "A similar claim about the site being converted into a school has also been shared on Facebook here, here, here and here.", "The claim is misleading; the Central Province Archeology Department told AFP that the site is undergoing renovations, but there were no plans to convert the building to a Muslim school.", "“The site has been named an archeological monument and it is currently undergoing conservation and rehabilitation,” the department’s site officer for Ehelepola Walawwa said by phone on February 12, 2020. “The Archeology Department supervises the project closely and is on site weekly and can assure you it has not even been suggested that the building be converted to a school.”", "The officer added that the only proposal made in terms of repurposing the building was a plan to convert it to a vegetarian restaurant, but that the proposal was not approved.", "The Kandy Urban Development Authority Director of Projects, Gamunu Premawardana, also refuted the claim.", "“It is false news. The site is undergoing conservation,” he told AFP by phone on February 12, 2020.", "The photog used in the misleading posts does not show the Ehelepola Walawwa. It shows the St. Paul’s Church in Kandy city.", "Below is a screenshot comparison of a Google Street View image of the St. Paul’s Church (L) and the misleading post (R):", "The conservation of Ehelepola Walawwa is part of a Kandy urban development plan being conducted in partnership with the Japan International Cooperation Agency (JICA).", "Here is a JICA report on the Kandy development plan published in September 2018. The report provides information on the conservation of Ehelepola Walawwa on page 10-19.", "Below is a screenshot of the report:", "On page 10-20, the report adds that the Ehelepola Walawwa is being renovated “without a clear idea of its future use, but it is considering to turn the place into a local food restaurant and a craft store.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]