["The federal government has some tools at its disposal to broaden insurance coverage for coronavirus testing, specifically when it comes to Medicare, Medicaid and Affordable Care Act marketplace plans.", "But Pence’s claim over simplifies what is involved in making this coverage assurance because a large swath of private health insurance falls beyond these categories. His statement fails to acknowledge the need for action at the state level and from the private sector.", "The vice president’s comments, however, were followed by steps by some insurers and states to cover the diagnostic test and waive cost sharing.", "Amid ongoing concern about the new coronavirus, Vice President Mike Pence sought to assure Americans that their health insurance will cover the tests needed for diagnosis.", "\"With regard to the cost, let me be very clear: HHS has designated the coronavirus test as an essential health benefit. That means, by definition, it's covered in the private health insurance of every American, as well as covered by Medicare and Medicaid.\"", "That got us wondering about Pence’s assurance. Can he really claim that this designation means that all Americans with private health insurance, Medicare and Medicaid will be covered?  And, is there a difference between coverage and cost?", "First, what are \"essential benefits\" and why does that matter?", "We reached out to the vice president’s office for details about his comments but got no reply.", "However, we also consulted with a range of experts, who helped us fill in the blanks.", "\"There are many things wrong with the statement,\" said Christen Linke Young, a fellow with the USC-Brookings Schaeffer Initiative for Health Policy.", "For one thing, many Americans’ insurance policies don’t have to include coverage of essential health benefits, but more on that later. Still, as Young and other experts helped us piece together the details, it became increasingly clear that this testing will ultimately be covered by most Americans’ health insurance. But, it is not a simple process ― the actual cost to patients is the biggest uncertainty ― and making it happen will require steps not only by the federal government, as Pence suggested, but also by state regulators and private insurers.", "Under the Affordable Care Act, insurance plans covering individuals and small employers must provide coverage of 10 essential health benefits (EHBs), including prescription drugs, maternity care, hospital care and laboratory services.", "Lab services could include diagnostic tests for, say, influenza, strep throat or even coronavirus.", "But there isn’t a master list of all the tests covered.", "\"They don’t say we only cover these particular diagnostic tests,\" said Young. \"It’s a broad category of coverage.\"", "So HHS probably does not have to designate the COVID-19 test as an EHB for it to be covered. HHS did not respond to a question from us about whether it had, indeed, designated coronavirus testing as an EHB.", "States, because they regulate insurers within their borders, are also weighing in to add clarity. New York and California, for example, have ordered insurers to cover coronavirus testing and waive patient costs.", "It also should be noted that Pence’s invoking of EHBs relies on the ACA, even as the administration has been a constant and staunch opponent of the law.", "\"The irony is great with this coming from an administration that has done everything it can to repeal the ACA, roll back essential health benefits and promote short-term plans that don’t cover much,\" said Sabrina Corlette, a research professor at the Center on Health Insurance Reforms at Georgetown University.", "But there’s another, bigger catch: EHBs apply only to a limited number of insurance plans ― those ACA-compliant plans purchased by individuals and small employers, which are defined as businesses with fewer than 50 employees.", "The requirements don’t apply to many workplace plans (including those provided by large businesses and self-insured plans), even though  most Americans ― about 157 million ― who have health insurance get it through their job.", "Most of these plans, though, do cover a wide range of benefits, including laboratory services, but they are not required by law to do so.", "Coronavirus testing would likely be lumped in, especially as \"employers likewise very much want COVID under control and do not want it spreading through their workforces,\" said James Gelfand, senior vice president at  the ERISA Industry Committee, which represents large employers.", "Private insurers are beginning to move in this direction, too. America’s Health Insurance Plans, the industry’s lobbying group, said in early March its members will cover diagnostic testing when ordered by a physician and will \"take action to ease network, referral, and prior authorization requirements and/or waive patient cost sharing.\"", "And what about Americans who have purchased alternative forms of insurance?", "The ACA’s rules ― including those on essential benefits ― don’t apply to several types of insurance that the Trump administration has promoted, including short-term plans. Such plans have lower premiums than ACA plans, mainly because they don’t have to offer a wide range of benefits or meet other ACA rules. Consumers should \"read the fine print to see what is in and what is out,\" said Corlette.", "Short-term plans also can cap annual treatment payment amounts, reject people with medical conditions ― or review their medical records after they make a claim to see if they had a preexisting condition that could disqualify them for coverage.", "Meanwhile, EHB rules don’t apply to Medicare. But that federal health insurance program for seniors and the disabled  has made clear on its website that it will cover the test, saying \"this test is covered when your doctor or other health care provider orders it, if you got the test on or after February 4, 2020.\"", "The agency that oversees Medicaid, the state-federal low-income health insurance program, issued a release saying that \"testing and diagnostic services are commonly covered\" and that lab tests are a \"mandatory benefit.\"", "No, coverage and cost are not the same.", "And that’s the key issue for policy and health experts.", "For those who have not yet hit their annual deductible, \"the full cost of diagnostic tests will fall on those who get them,\" said Nicholas Bagley, a professor at University of Michigan Law School. \"That will discourage some people from getting tested in the first place, which is a public health nightmare.\"", "Many private plans, both those offered by employers and those purchased by individuals, include deductibles that enrollees must meet before full coverage kicks in. Even after a deductible is satisfied, many plans also require some sort of copayment ― be it $10, $25 or more ― when seeing a doctor or going for a lab test. For emergency room visits, the cost sharing is higher.", "If insurers don’t waive cost sharing for the test, it could be an issue for some consumers.", "Still, Bagley said, the federal government is limited in its ability to order insurers or employers to waive patient payments, at least in the short term. Longer term, federal officials could seek to declare the tests \"preventive services,\" like mammograms or vaccines, which are free for insured patients. But that process would take more than a year to implement.", "In the meantime, it’s mainly up to insurers and employers to decide what to do. Cigna has announced it will waive patient costs for testing ― and others may soon as well, given AHIP’s statement. Another group, the Alliance of Community Health Plans, which represents nonprofit plans, didn’t specifically say its members would waive fees but pledged to \"ensure affordability is not a barrier to the individuals who are recommended for testing by their doctor or a public health authority.\"", "Pence said \"HHS has designated the coronavirus test as an essential health benefit. That means, by definition, it's covered in the private health insurance of every American, as well as covered by Medicare and Medicaid.\"", "There are a number of moving parts to this statement, but it tends to leave out important details. For instance, many private and employer health plans have flexibility about what benefits they cover and what consumers will pay. In addition, coverage does not necessary mean low cost.", "Bottom line: Pence's comment is an overstatement. It fails to acknowledge the need for action at the state level and from the private sector, too.", "For these reasons, we rate this claim as Half True.", "Mike Pence, remarks in Washington, D.C., March 4, 2020.", "America’s Health Insurance Plans, press release, March 5, 2020", "Phone interview with Nicholas Bagley, professor at the University of Michigan Law School, March 5, 2020.", "Phone interview with Timothy Stoltzfus Jost, emeritus law professor Washington and Lee University, March 5, 2020", "Phone interview with Christen Linke Young, fellow at USC-Brookings Schaeffer Initiative for Health Policy, March 5, 2020", "Email interview with James Gelfand, senior vice president, health policy, the ERISA Industry Committee, March 5, 2020", "Phone interview with Joe Antos, resident scholar at the American Enterprise Institute, March 5, 2020", "Phone Interview with Sabrina Corlette, research professor at the Center on Health Insurance Reforms at Georgetown University, March 5, 2020.", "\"Percentage of People by Type of Health Insurance Coverage and Change From 2017 to 2018,\" Census Bureau, accessed March 5, 2020.", "\"Coronavirus test,\" Medicare.gov, accessed March 5, 2020.", "\"Essential Health Benefits,\" healthcare.gov, accessed March 5, 2020.", "\"CMS Develops Additional Code for Coronavirus Test,\" press release, March 5, 2020.", "Why State Efforts to Mandate Coronavirus Testing Will Fall Short, The Incidental Economist, Nicholas Bagley, March 5, 2020.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]