["Before Gov. Chris Christie made his case in prime time last week for why Mitt Romney should be elected president, the governor pointed to his original endorsement in October as evidence that he truly believes in the Republican nominee.\n\nLeading up to his keynote address Tuesday at the Republican National Convention in Tampa, Fla., Christie dismissed a New York Post article claiming he doubted Romney could defeat President Barack Obama.", "As part of his rebuttal, Christie repeated a line he's said before: he was the first governor to endorse Romney.\n\n\"I’ve spent since October of last year -- first governor in America to endorse him -- (running) around the country to 15 different states campaigning for him and raising money,\" Christie said in an interview Tuesday on \"CBS This Morning.\"\n\n\"I didn’t do that ‘cause I had nothing else to do,\" Christie continued. \"I did it because I believe the guy’s the best guy to be president and that he can win.\"\n\nBut PolitiFact New Jersey found that Christie’s claim is off. He was one of the first Republican governors to back Romney, but not the first.", "The governor's office did not respond last week to an email presenting our findings.", "Here are the facts:\n\nA week after announcing he wouldn’t make a presidential run himself, Christie traveled to New Hampshire and endorsed Romney on Oct. 11, 2011.\n\n\"I’m here in New Hampshire today for one simple reason: America cannot survive another four years of Barack Obama, and Mitt Romney is the man we need to lead America and we need him now,\" Christie said during a news conference.\n\nBut about four months earlier, the Romney campaign announced he had the support of two other Republican governors: Nebraska Gov. Dave Heineman and Idaho Gov. Butch Otter.\n\nThe campaign announced Heineman's endorsement in a June 10, 2011 news release posted on its website.", "\"Mitt Romney has a proven record of balancing budgets, keeping taxes low, and creating an environment for job growth,\" Heineman said in the news release. \"As a governor, I understand the challenges this country faces and Mitt Romney has the experience to meet those challenges.\"", "In a June 20, 2011 news release on its website, the campaign said Otter would serve as co-chairman of Romney's Idaho Statewide Steering Committee. \"Mitt Romney has the experience needed to grow the economy and create jobs,\" Otter said in the release.\n\nIn the months ahead, news articles noted both governors’ endorsements.\n\n\"Romney has been endorsed by two governors, Dave Heineman of Nebraska and Butch Otter of Idaho, as well as one former governor, Colorado’s Bill Owens,\" according to a July 2, 2011 article on the Washington Post’s website.\n\nA Politico article on July 16, 2011 pointed out how only a few governors -- including Heineman and Otter -- had handed out endorsements in the GOP presidential primary race:\n\n\"Only a small handful of Republican governors have endorsed in the presidential race, with Govs. Dave Heineman of Nebraska and Butch Otter of Idaho backing Mitt Romney, and Georgia Gov. Nathan Deal endorsing Newt Gingrich.\"\n\nIn a Dec. 1 article in the New York Times, Heineman was identified as \"the first governor to endorse Mr. Romney.\"\n\nOur ruling\n\nIn light of a New York Post article claiming Christie doubted whether Romney could beat Obama, Christie claimed in a TV interview that he was the \"first governor in America to endorse\" Romney.\n\nBut about four months before Christie offered his endorsement, the Romney campaign announced he had the support of Republican governors in Nebraska and Idaho, and news articles noted both endorsements afterward.\n\nWe rate the statement False.", "To comment on this ruling, go to NJ.com.", "Editor's Note: After this story was published, we added a line noting how the governor's office had not responded to an email presenting our findings.", "https://www.sharethefacts.co/share/9bc52084-48a1-4732-a941-7b31c4baa16b", "CBS This Morning, Christie refutes New York Post claims, Aug. 28, 2012\n\nC-SPAN, Gov. Chris Christie’s speech before the California delegation, Aug. 27, 2012", "C-SPAN, N.J. Governor Addresses PA Delegation Breakfast, Aug. 29, 2012", "Mitt Romney campaign website, Mitt Romney Earns Support of Governor Dave Heineman, June 10, 2011\n\nJournalStar.com, Romney strikes gold in Nebraska, May 10, 2012\n\nOmaha.com, Heineman endorses Romney, again, June 10, 2011\n\nNew York Times, Republican Leaders Still Seem Torn About Romney, Dec. 1, 2011\n\nMitt Romney campaign website, Mitt Romney Announces Idaho Statewide Steering Committee, June 20, 2011\n\nThe Washington Post, In 2012 GOP race, where are the governors?, July 2, 2011\n\nPolitico, Bob McDonnell and Rick Perry talk 2012, July 16, 2011\n\nThe Star-Ledger, Gov. Christie: Romney 'is the man we need to lead America', Oct. 11, 2011\n\nNew York Post, Christie chose NJ over Mitt's VP role due to fears that they'd lose: sources, Aug. 27, 2012", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]