["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "FBI and ATF personnel examine the area involved in a Christmas Day explosion Dec. 29, 2020, in Nashville, Tenn. (AP)", "Law enforcement officials have said a man named Anthony Warner was responsible for the bombing and died in the blast. The bomb was located in a recreational vehicle.", "The video in the Facebook post shows smoke from the explosion over the Nashville skyline. It does not show a missile hitting the city.", "Conspiracy theorists say the suicide bombing that rocked downtown Nashville, Tenn., on Christmas Day was actually the result of a missile strike. Their evidence: a grainy black-and-white video.", "The video, which was posted by a Facebook page called Red Pill Radio on Dec. 28, shows the outline of buildings and a highway in Nashville. Then, a plume of smoke rises behind three light poles.", "\"You can see as there’s a line flying in, there’s a little bit of a glow and then there’s the explosion,\" a narrator says in the video. \"Very, very interesting.\"", "\"Nashville explosion a missile strike??\" reads the post caption from Red Pill Radio, a Facebook account that bears the slogan of the baseless QAnon conspiracy theory on its \"About\" page.", "(Screenshot from Facebook)", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.) Similar claims have been shared in hundreds of public posts, according to CrowdTangle, a social media insights tool.", "In its video, Red Pill Radio cites a Dec. 26 article from WorthyPolitics.com whose headline claims the video \"proves Nashville explosion was actually a missile strike.\" We have seen  similar claims from others who say the missile was aimed at the AT&T Building.", "There is no evidence to substantiate that theory. We rated Pants on Fire a similar claim that AT&T was targeted in the bombing as part of an election cover-up.", "While federal investigators are still looking into the bombing, law enforcement officials have said a man named Anthony Warner was responsible and died in the blast. The bomb was located in a recreational vehicle that Warner owned. Fact-checkers have debunked claims that the explosion was the result of a missile strike.", "The video in the Facebook post is security footage obtained by WKRN-TV, a station based in Nashville. It shows smoke from the explosion over the skyline. The clip does not show a missile hitting the city.", "Videos from law enforcement officials and local businesses show that the explosion occurred on 2nd Avenue North in downtown Nashville. The explosion injured three people and damaged several businesses, including the AT&T Building.", "This is video of Friday morning's explosion recorded by an MNPD camera at 2nd Ave N & Commerce St. pic.twitter.com/3vaXhoUOAR", "One clip captured an audio message warning people to evacuate the area seconds before the explosion. The Metropolitan Nashville Police Department identified the RV at the center of the blast in a Dec. 25 tweet.", "On Dec. 27, U.S. Attorney Don Cochran said the explosion appeared to be a suicide bombing carried out by a Warner. DNA from human remains found at the scene matched Warner, and investigators found financial records for components that he may have used to construct the bomb.", "FBI agents are investigating whether Warner may have been paranoid about 5G technology. Conspiracy theories about the cellular data networks have blossomed on social media over the past year, falsely claiming that 5G spreads COVID-19 and could be used as a spying tool by the government.", "The investigation of the Nashville bombing is ongoing, but the Facebook post is inaccurate and ridiculous. We rate it Pants on Fire!", "CNN, \"Investigators are looking at 'any and all possible motives' after identifying Nashville bomber,\" Dec. 28, 2020", "CrowdTangle, accessed Dec. 29, 2020", "Facebook post, Dec. 28, 2020", "Hal Turner Radio Show, \"Nashville ‘Bombing’ - Directed Energy Weapon Caught on Camera BEFORE Explosion! UPDATED: Now ‘National Defense Airspace,’\" Dec. 26, 2020", "The New York Times, \"Nashville Explosion: What to Know,\" Dec. 26, 2020", "NPR, \"Nashville Blast Suspect Died In Explosion, Officials Say,\" Dec. 27, 2020", "PolitiFact, \"Fact-checking a conspiracy theory about 5G and the coronavirus,\" April 3, 2020", "PolitiFact, \"No, AT&T was not conducting an audit of Dominion Voting Systems near Nashville explosion,\" Dec. 29, 2020", "Reuters, \"Fact check: Nashville blast was not caused by a missile strike,\" Dec. 28, 2020", "Snopes, \"Did a Missile Cause the Nashville Explosion?\" Dec. 28, 2020", "The Tennessean, \"'Evacuate now. There is a bomb': Human remains reportedly found near explosion in Nashville that damaged 41 buildings, injured 3,\" Dec. 25, 2020", "The Tennessean, \"Videos of Nashville bombing show massive explosion, immediate aftermath,\" Dec. 26, 2020", "Tweet from Metro Nashville PD, Dec. 26, 2020", "Video from Metro Nashville PD, Dec. 27, 2020", "WorthyPolitics.com, \"BREAKING EXCLUSIVE: A Video Proves Nashville Explosion Was Actually A Missile Strike, And The Target Was The AT&T/NSA Hardened Switching Facility ‘Spy Hub,’\" Dec. 26, 2020", "WSMV-TV, \"FBI agents investigating if 5G paranoia was behind Nashville bombing,\" Dec. 28, 2020", "WTVF-TV, \"False conspiracy theory about a Nashville missile attack is based on altered images,\" Dec. 28, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]