["About this rating", "In late May 2018, a parody message posted to the social media platform Twitter purporting to have been authored by conservative commentator Tomi Lahren circulated online although it had initially been created in 2016:", "Stepping out with my REAL HAIR, that Beyoncé pays thousands for. pic.twitter.com/Sp8UG0r3q9", "— Tomi Lahren (@TomlLahren) December 28, 2016", "Lahren is known for taking inflammatory positions on racial issues, such as comparing anti-police violence movement Black Lives Matter to the Ku Klux Klan and likening National Football League players kneeling during the anthem in protest of police killings of unarmed black Americans to \"pouting.\" But she did not post the above tweet.", "Lahren infamously attacked Beyoncé in December 2017 for presenting NFL player Colin Kaepernick with Sports Illustrated's Muhammad Ali Legacy Award. Lahren has an apparent obsession with the NFL protests which Kaepernick launched in 2016 while he was a quarterback for the San Francisco 49ers and goes on regular tirades about them.", "Her 5 December 2017 tweet calling the music icon \"police-hating\" and Kaepernick \"America-hating\" incited the wrath of Beyoncé's ardent fans (known as the \"Beyhive\" for swarming on anyone who publicly attacks the singer). As multiple web sites pointed out out at the time, the Beyhive response to Lahren's tweet was swift and unrelenting.", "The fake tweet above appeared a year before the authentic one caused a storm, and has fooled many since it was created. However a closer inspection of the account bearing Lahren's name and image from which it originated shows it is labeled a parody.", "Fox News.    \"Tomi Lahren: A Free Speech Lesson for NFL Anthem Kneelers.\"\r\n    25 September 2017.", "Moran, Lee.    \"Tomi Lahren Bashed Beyoncé And The Beyhive Fiercely Defended Its Queen.\"\r\n  Huffington Post.   6 December 2017.", "Reisman, Sam.    \"The Blaze‘s Tomi Lahren Sets Twitter on Fire, Blaming BLM for Dallas Police Murders.\"\r\n    Mediaite.com.    8 July 2016.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]