["Boxing legend Marvin Hagler died March 13 in his home in New Hampshire. He was 66.", "Many have taken to social media to express their admiration for boxing's greatest middleweight champion and to speculate about his cause of death.", "\"Marvin Hagler Was Allegedly in ICU Fighting After Effects of COVID Vaccine,\" claims a March 14 Instagram post from entertainment news outlet VladTV.com. This claim was also repeated by far-right publication The Gateway Pundit the same day, citing an Instagram post from fellow boxing great Thomas Hearn.", "\"A real true warrior Pray for the kind and his family.. he's in the ICU fighting the after effects of the vaccine!\" wrote Hearns on March 14 in a now-deleted post.", "VladTV.com's post has received nearly 3,000 likes since it was posted. In comments under The Gateway Pundit's post, which gained nearly 5,000 likes, Instagram users expressed distrust of the COVID-19 vaccine.", "\"Is it still a covid death if the vaccine is what kills you?\" asks one user.", "\"Omg another vaccine death,\" said another user.", "USA TODAY has reached out to VladTV.com for further comment.", "Fact check: Meghan and Harry were not paid for their Oprah interview", "On March 15, Hagler's widow, Kay Hagler, took to Facebook to address the rumors surrounding her husband's death", "\"I was the only person close to him until the last minute, and I am the only person that know how things went not even his family know all the details and I do NOT accept to read some stupid comment without knowing really what happen,\" she wrote, apologizing at the start of the post for potentially broken English. \"For sure wasn't the vaccine that caused his death. My baby left in peace with his usually smile and now is not the time to talk nonsense.\"", "According to a TMZ report, Hagler's son, James, said his father was taken to a New Hampshire hospital after experiencing chest pains and difficulty breathing.", "No specific cause of death has been declared but according to Hagler's official website, the boxing champ died \"of natural causes near his home in New Hampshire.\"", "Hearns, who was famously defeated by Hagler in 1985 with a third-round knockout, is the only source linking Hagler's death to the vaccine and has since deleted his Instagram post.", "USA TODAY has reached out to Hearns for further comment.", "The Gateway Pundit informed USA TODAY it had revised its Instagram post with Kay's statement.", "Fact check: COVID-19 stimulus bill doesn't include bonuses for members of House", "Hagler's death comes after reports of deaths after vaccination among the elderly in Europe and baseball legend Hank Aaron's death in January.", "Aaron's death nearly three weeks after he received his vaccination alongside other civil and human rights leaders at Morehouse Healthcare Clinic in Georgia has not been ruled vaccine-related.", "Deaths among the elderly in Norway and Germany have also been determined to be unrelated to the vaccine.", "Similar claims linking the COVID-19 vaccine to reports of death across the U.S. and elsewhere have been debunked by USA TODAY.", "The claim that boxing champion Marvin Hagler's death was caused by the COVID-19 vaccine is FALSE, based on our research. The claim originates from former boxer Thomas Hearns' March 14 Instagram post which has since been deleted. Hagler's widow, Kay Hagler, took to Facebook to dispel the misconception that the vaccine had anything to do with her husband's death.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook."]