["About this rating", "On Feb. 19, 2021, an image started to circulate on social media that supposedly showed a statement released by U.S. Sen. Ted Cruz in response to the blowback he received for traveling to Cancún, Mexico, during a severe winter storm that left millions of his constituents in Texas without power. In the statement, Cruz supposedly complains that he was \"forced\" to cancel his trip due to \"liberal cancel culture\":", "This is not a genuine statement from Cruz.", "This message was not posted on Cruz' social media accounts, nor was it released on the senator's website.", "The biggest giveaway that this statement is fake can be gleaned with a careful observation of this image. If you look closely at the image above, you'll noted that there are three small words in the bottom right corner that read: \"This is fake.\"", "Cruz has issued several statements related to his travel to Cancún. Cruz said that it was a \"mistake\" and that in \"hindsight, I wouldn't have done it.\" In another statement, he said that he was trying to be a \"good dad,\" and that his family wanted to get out of Texas during the cold weather.  While Cruz did say that the online \"firestorm\" expedited his decision to cancel his trip, he has not started fundraising off the idea that \"liberal cancel culture\" was to blame for his vacation cancellation.", "This is at least the second manipulated image that was circulated in the wake of this controversy that poked fun at Cruz. We previously covered a tweet that was supposedly sent by Cruz, reading: \"I’ll Believe in Climate Change When Texas Freezes Over.\" You can read more about that fake tweet here.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]