["About this rating", "One of the signs of creeping old fogeyism is finding out how many of the irrefutable truths we learned as youths turned out to be false. Today's being Flag Day reminds me of yet another cardinal rule I assimilated as a child which I later discovered was wrong: that if an American flag is allowed to touch the ground, it should be burned.", "The rules we observe with respect to our flag are laid out in the U.S. Code. (These codes specify how the flag should be displayed, but they do not establish any enforcement of legal penalties against those who violate them.) The notion that the U.S. flag should be burned after touching the ground is a long-held misconception based upon a conflation of two different parts of the flag code.", "Title 4, Chapter 1, Section 8 of the U.S. Code (\"Respect for flag\") states in paragraph (b) that:", "The flag should never touch anything beneath it, such as the ground, the floor, water, or merchandise.", "And in paragraph (k) it states:", "The flag, when it is in such condition that it is no longer a fitting emblem for display, should be destroyed in a dignified way, preferably by burning.", "The fallacy about burning a ground-touched flag arises from the mistaken beliefs that a flag which has been allowed to touch the ground is no longer \"suitable for display\" and must therefore be destroyed, and that the only proper form of disposal for a flag is to burn it. These beliefs reflect a misunderstanding or misinterpretation of the flag code.", "Although the flag should never be allowed to touch anything beneath it (including the ground), it is not automatically rendered unfit for display should this situation occur. The proper course of action in such a case is simply to adjust the flag, or the item(s) below it, so that they are no longer touching. Even if the flag has become soiled from contact with the ground (or something else) to the extent that is no longer suitable for display, it need not be disposed of: it is perfectly permissible to wash or dry clean a dirty flag in order to render it fit for display again. The flag need be destroyed only when it has become irreparably unsuitable for display due to circumstances such as fading, tattering, tearing, staining, partial burning, mutilation, or defacement.", "Also, burning is not the only acceptable method of disposing of a flag, just the preferred one. The intent of the code specifying a \"dignified way\" of disposal is to prevent a no-longer-usable flag from ending up in an undignified setting, such as being dumped into a trash can amidst a bunch of rotting garbage or thrown atop a junk heap. Destroying the flag by burning it ensures that the flag will not end up in such surroundings, but other options exist, such as handing it over to one of the many civic associations (e.g., Boy Scouts, Veterans of Foreign Wars, the American Legion) who accept non-serviceable flags for proper disposal.", "Schneider, Richard H.   Stars & Stripes Forever.     New York: William Morrow, 2003.   ISBN 0-06-052537-1   (p. 133).", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]