["The photo was published in this Facebook post on July 9, 2020 alongside three other images. The post has been shared more than 280 times.", "The text superimposed on the photo reads: “PULSE BREAKING / Bubonic plague alert in China, risk of human-to-human infection”.", "The post’s caption states, in part: “Two suspected cases of Bubonic plague were reported by a hospital in Inner Mongolia, China. The cases, a 27-year-old man and his 17-year-old brother have been confirmed by test results, and are being treated in hospitals in the province. The brothers had reportedly eaten ‘marmot meat’ following which they were infected.”", "The World Health Organization (WHO), on July 7, 2020 said it was monitoring a case of bubonic plague in China’s northern Inner Mongolia region after being notified by the authorities in Beijing. Here is an AFP report about the WHO announcement.", "Bubonic plague is a form of plague caused by the bite of an infected flea. Historically, plague has caused widespread pandemics with high mortality, but today can be easily treated with antibiotics.", "The photo was also shared here, here, here and here on Facebook, alongside a similar claim.", "The photo, however, has been shared in a misleading context.", "A combined reverse image search on Google and keyword search found it is an AFP photo taken in South Korea on March 6, 2020. It shows soldiers spraying disinfectant in the capital of Seoul in a bid to prevent the spread of COVID-19.", "The original AFP image can be seen below:", "The photo's caption reads: “South Korean soldiers wearing protective gear spray disinfectant on the street to help prevent the spread of the COVID-19 coronavirus, in Seoul on March 6, 2020. South Korea's total reported infections -- the largest figure outside China, where the coronavirus first emerged -- rose to 6,284 on March 6, the Korea Centers for Disease Control and Prevention said. / Jung Yeon-je / AFP”.", "Below is a screenshot comparison of the photo in the misleading post (L) and the AFP photo (R):", "The misleading post features three other images that do not relate to the recent cases of bubonic plague detected in Inner Mongolia.", "The first is a file image from the US Centers For Disease Control of bubonic plague bacteria under a microscope; the second shows a wax sculpture of a bubonic plague victim made by British sculptor Eleanor Crook.", "Below are screenshot comparisons of those photos in the misleading post (L) and the CDC and Eleanor Crook photos (R):", "The final image is an illustration of the symptoms of bubonic plague which has been widely shared on medical sites, including here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]