["“ઈકો ગાદી લઈને આવે છે નાના બાળકો લઈ જાય છે અને કિટની વેચે છે જલ્દી સારે મોબાઇલ મા ફોરવર્ડ કરો હમારા બાળકો ની જીદગી બચી જાય મહેસાણા પાટન પાલનપુર જલ્દી જપ્ત કરાવો GJ19AF 0827 (They come in Ecco car and kidnap your children and sell their kidneys. Immediately forward this message to all the mobile phones to save the lives of our children. Seize this car GJ19AF 0827 Alert Mehsana Patan Palanpur -translated)”", "The above message is being shared on WhatsApp with a set of images and a video. It was also shared on Facebook and Twitter with the same set of images in the past as well. The description of the visual and photographs are as followed:", "Alt News found the video and images to be old. They do not depict a gang of child kidnappers involved in the illegal organ trade.", "A close analysis of the policemen’s uniform hinted that he might be an officer with the Uttar Pradesh police force. With keyword a search on Google – “boy beheaded Uttar Pradesh” – we found an article published by Hindustan Times on February 22, 2017. “Drug addict beheads 7-year-old boy, eats his flesh in UP’s Pilibhit”, reads the headline of this article. Mohammed Monis, the victim, was reportedly playing outside his house when his twenty-year-old neighbour lured him inside his house and killed the child. According to a police officer, the body of the boy was lying on the floor with his decapitated head placed beside it. “The skin on the abdomen was missing and internal body parts and bloodstains were scattered across the room,” he said. We also found a video on YouTube corroborating the incident.", "This image was published by Patrika in an August 26, 2017 report. A gang of thieves was arrested by Hoshangabad police in Madhya Pradesh. The gang had a modus operandi of forming different teams for recce, the crime (robbery), and the selling of loot.", "This photograph has been circulating on social media with the infamous “child kidnapping” rumours since 2018. In June 2018, Alt New had debunked several other pictures, including this one, shared with the identical child kidnapping narrative. We couldn’t independently verify the image and its origin. However, it was fact-checked by Kannada newspaper Prajavani in 2018. The media outlet reported that according to Karnataka police, the said photo is 3-4 years old. At the time, police had appealed to people to not believe such rumours circulating on WhatsApp.", "Regarding the registration number of a vehicle circulating with the claim, Alt News contacted Bardoli (Surat) police. They said that they are looking into the matter.", "Since 2014, child-lifting rumours have sparked mob-lynchings across India, leading to the death of at least 30 people. The police had undertaken steps to quell the rumours however, they resurface on social media every now and then. The messages are circulated with slightly changed narratives but similar videos and images. For instance, Rohingya Muslims were made a part of the rumour last year. These messages are usually circulated in the language suited to the state where they are being shared. Similar to the message now circulating in Gujarati, Alt News had debunked a rumour last year, days before a pauper woman was mob-lynched in broad daylight in Ahmedabad. The best way to cross-check such rumours is to look for news reports, the absence of which is a hint the social media claims are most likely unverified.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]