["The image was published here on Facebook on January 28, 2020. It shows a photo of a goat and bears the logo of the Punjab Food Authority in a banner across the bottom.", "The post has been shared more than 893 times.", "Below is a screenshot of the misleading Facebook post:", "The Urdu-language text in the image translates to English as: “Very urgent message. In Pakistan too, coronavirus alert has been issued. For the next 60 days try your utmost to not eat goat meat. In Pakistan signs of this virus have started appearing in goats. Share this message as much as you can so that the life of your own people could be saved.”", "A new strain of coronavirus, believed to have originated from a wildlife market in the central Chinese city of Wuhan, has killed at least 213 people in China and infected almost ten thousand others according to this AFP report published on January 31, 2020.", "Doctors have identified cases in at least a dozen other countries, as reported here by AFP, but Pakistan is not among those with a confirmed case.", "The same image was also shared hundreds of times here, here, here, here and here on Facebook with a similar claim.", "This claim is false; the Punjab Food Authority issued a statement on its Facebook page on January 29, 2020, labelling the image “fake”.", "The post states: “Beware. This post published in the name of Punjab Food Authority is fake.”", "Below is a screenshot of the Punjab Food Authority Facebook post:", "Wasif Malik, a doctor under the Field Epidemiology & Disease Surveillance Division of Pakistan’s National Institute of Health, the lead organisation monitoring the novel coronavirus outbreak for the country, told AFP by phone on January 29, 2019 that there was no evidence the virus was spreading among goats.", "“So far we know that the virus was present in bats and snakes in China and all scientists agree with it, but there is no evidence of coronavirus presence in other animals,” Malik said.", "“In Pakistan no animal has been reported to carry the virus, so people can consume goat meat without any concern.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]