["About this rating", "On March 16, 2021, Robert Aaron Long, a 21-year-old from Woodstock, Georgia, was arrested in the fatal shootings of eight people at three spas in or around Atlanta. The killings, which occurred during a rise in violence against Asian-Americans, left six Asian women dead, leading many to believe that this was a race-based hate crime.", "While details are still coming to light about the killings and while authorities have yet to announce a motive, social media users began combing through Long's internet history to look for clues about his politics. The \"Daily Mao\" Twitter account, for example, claimed that Long had posted about China engaging in a \"COVID cover up\" shortly before the shooting:", "This is not a genuine post from Long's supposed Facebook page.", "For one, we've yet to see any credible reporting about messages posted to his personal Facebook page, if he even has an account. The Daily Beast reported on an Instagram comment supposedly written by Long, and also stated that the alleged shooter had appeared in other people's social media posts, including a video posted by his church, Crabapple First Baptist Church. But the article made no mention of Long's personal Facebook page.", "New York Times reporter Davey Alba noted that some visual flaws in this post indicated it was fake. The profile picture of Long, for instance, is slightly off-center. At the bottom of the post, you can see the blue of the thumbs-up icon bleed over into the shocked smiley face:", "It should also be noted that shortly after this message went viral, the Daily Mao posted a follow-up message saying that its \"source\" could no longer find the original post from the alleged shooter, and that this post should be treated as unverified until confirmed.", "This post isn't just \"unverified,\" it's false.", "Andy Stone, Facebook's policy communications director, confirmed that this message was not posted to a Facebook page belonging to Long:", "As of this writing, no credible news outlets have reported on a Facebook page belonging to Long, nor any specific Facebook posts that he may have written. This, coupled with the fact that there are several visual oddities in viral image, indicates that this post was photoshopped, and that it was not actually written by Long.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]