["About this rating", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "During the COVID-19 coronavirus disease pandemic in 2020, a popular social media meme asserted that philanthropist Bill Gates was partnered with business magnate George Soros in owning a lab in Wuhan, China (the presumed location where the COVID-19 outbreak originated), and was being sued by India over the deaths of girls resulting from vaccinations:", "It is true that the Microsoft co-founder, through his Bill & Melinda Gates Foundation, has expended billions of dollars funding research and childhood-immunization programs in developing countries. Gates, who has long warned that we are inadequately prepared to deal with global pandemics, has also pledged to make billions of dollars available for funding the manufacture of vaccines to combat the novel coronavirus. Dr. Anthony S. Fauci, the director of the National Institute of Allergy and Infectious Diseases, was a member of the Leadership Council for the Gates Foundation's Decade of Vaccines Collaboration effort launched in 2010.", "However, the meme jumps the rails at suggesting anything more than that Gates is interested in improving lives through medical research and vaccinations.", "Gates does not own a lab in Wuhan, China, in partnership with Soros; that claim is a combination of two separate and false rumors that we have already debunked at length: that the novel coronavirus that causes COVID-19 was deliberately engineered as a bioweapon, and that Soros owns the laboratory in Wuhan where the alleged development of the virus supposedly took place.", "The rumor that \"India is suing Bill Gates because he vaccinated 77,000 third world girls between the ages of 9 & 15 and many of them died\" is also a false one that we have explored at length. This claim is not directly connected to Gates or the Gates Foundation, but rather to the global health organization PATH (Program for Appropriate Technology in Health), which conducted a study beginning in 2009 to see if it could reduce the number of human papillomavirus (HPV) infections by providing cost-effective vaccines to impoverished communities. (The Gates Foundation was one of PATH’s global partners and reportedly provided funding for its HPV study.) The study caused controversy in India when seven of the girls involved in the trial in that country died after receiving their vaccines, but state investigations found those deaths were unrelated to the vaccinations:", "State investigations absolved the trial’s managers — PATH and the Indian Council of Medical Research (ICMR) in New Delhi — of responsibility in the deaths. Five were evidently unrelated to the vaccine: One girl drowned in a quarry; another died from a snake bite; two committed suicide by ingesting pesticides; and one died from complications of malaria. The causes of death for the other two girls were less certain: one possibly from pyrexia, or high fever, and a second from a suspected cerebral hemorrhage. Government investigators concluded that pyrexia was “very unlikely” to be related to the vaccine, and likewise they considered a link between stroke and the vaccine as “unlikely.” ICMR’s director general, microbiologist Vishwa Mohan Katoch, categorically rejects a connection: “Based on the enquiry, it is certain that causality of the seven deaths was not at all related to the HPV vaccine,” he insists.", "The Indian Council of Medical Research (ICMR) suspended PATH's HPV clinical trial in India over irregularities such as improperly obtained consent forms, and the Union Government issued a warning letter to PATH \"asking it to be careful while conducting clinical trials so as to ensure that discrepancies and violations are not repeated in future.\" But neither that global health organization nor the Gates Foundation is being \"sued\" by India or has been \"banned\" from operating in that country.", "Calfas, Jennifer.   \"Bill Gates to Help Fund Coronavirus-Vaccine Development.'\r\n    The Wall Street Journal.   5 April 2020.", "Bill & Melinda Gates Foundation.   \"Bill and Melinda Gates Pledge $10 Billion in Call for Decade of Vaccines.\"\r\n    January 2010.", "Glenn, Heidi.   \"Bill Gates, Who Has Warned About Pandemics for Years, on the U.S. Response So Far.\"\r\n    NPR.   9 April 2020.", "Dhar, Aarti.   \"Government Warns Path.\"\r\n    The Hindu.   25 August 2012.", "Evon, Dan.   \"Was the Bill and Melinda Gates Foundation Kicked Out of India?\"\r\n    Snopes.com.   24 October 2019.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]