["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Sen. Joe Manchin, D-W.Va., center, speaks to the media on Jan. 22, 2018, during the government shutdown. (AP)", "As the partial government shutdown was underway in January, Sen. Joe Manchin, D-W.Va., tweeted about his distaste for the closure.", "In the tweet sent on Jan. 2, 2019, Manchin wrote, \"I have always said we should never shutdown the government and governing this way is embarrassing for both Democrats and Republicans. This partial government shutdown effects every American, including the 18,000 federal employees in West Virginia.\"", "The tweet linked to a more detailed statement by the senator that listed some of the federal agencies that have workers in West Virginia.", "I have always said we should never shutdown the government and governing this way is embarrassing for both Democrats and Republicans. This partial government shutdown effects every American, including the 18,000 federal employees in West Virginia. MORE: https://t.co/BKrpwdWJa9", "We decided to take a closer look at whether Manchin was right that the partial government shutdown affected \"18,000 federal employees in West Virginia.\"", "How many federal workers are there in West Virginia? It turns out that Manchin’s number is in the ballpark.", "Data from the Office of Personnel Management -- the federal government’s human resources department -- shows that as of September 2017, West Virginia had a total of 18,656 federal workers.", "Determining the accuracy of Manchin’s tweet requires a look at some background on the shutdown.", "The shutdown stemmed largely from disagreement between President Donald Trump and the Democratic-controlled House over whether to build a wall on the U.S.-Mexico border and, if so, how much money should be allocated for it.", "It was a partial rather than a full shutdown because only some federal agencies had to close because their funding bills expired.", "The departments affected by the partial shutdown due to their funding bills expiring were Agriculture, Commerce, Homeland Security, Justice, parts of Interior (such as the Bureau of Reclamation), State, Transportation, Housing and Urban Development, Treasury and NASA.", "A range of independent agencies were also shuttered, including the U.S. Trade Representative, the Consumer Product Safety Commission, the Federal Communications Commission, the Federal Trade Commission, the National Archives and Records Administration, and the Smithsonian Institution.", "At the same time, other departments had valid spending bills in place, so they operated as normal. They included Defense, Labor, Health and Human Services, Education, Energy, the Army Corps of Engineers, Veterans Affairs and the Nuclear Regulatory Commission.", "The shuttered federal departments and agencies employed more than 800,000 people, or roughly 40 percent of the federal workforce. These 800,000 employees fell into two categories. About 380,000 were furloughed, meaning they could come to work and were not being paid. Another 420,000 weren’t being paid, but were required to remain on the job.", "This distinction is relevant for analyzing the text of Manchin’s tweet, because it means that 60 percent of federal workers whose agencies were running as normal were on the job and were paid on time.", "This means that not every West Virginia federal worker was directly affected by the shutdown, either by being furloughed or by being required to work without being paid.", "The workers who remained on the job and received their paychecks may have been affected by the shutdown by virtue of being ordinary Americans who lacked access to certain shuttered federal services. But they were not specifically affected because of their own federal job.", "And Manchin was correct in his detailed statement when he cited a range of departments and agencies that were left without valid funding bills. They included the Criminal Justice Information Services Division of the FBI, the Treasury Department's Bureau of Fiscal Service, the Justice Department’s Bureau of Prisons, and the National Science Foundation's Green Bank Observatory.", "Manchin tweeted that the partial government shutdown in early 2019 affected \"18,000 federal employees in West Virginia.\"", "Manchin is close on the number of federal workers in the state. However, it’s important to note that not all of those federal workers in West Virginia were either furloughed or required to work without pay; those employed by agencies with valid spending bills were working and getting paid as normal. We rate the statement Mostly True.", "Joe Manchin, tweet, Jan. 2, 2019", "Joe Manchin, \"Manchin Statement on How the Government Shutdown is Impacting West Virginia,\" Jan. 2, 2019", "Office of Personnel Management, \"Federal Civilian Employment by Major Geographic Area, State, and Selected Agency Executive Branch and Selected Other Agencies, Non-Postal, Non-Seasonal, Full-time, Permanent Employees and All Annuitants,\" September 2017", "PolitiFact, \"Your questions about the government shutdown, answered,\" Jan. 16, 2019", "Email interview with Mike Maciag, data editor for Governing magazine, Jan. 9, 2019", "Email interview with Onamé Thompson, press secretary for the Partnership for Public Service, Jan. 10, 2019", "Email interview with Jonathan Kott, spokesman for Sen. Joe Manchin, D-W.Va., Feb. 19, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]