["About this rating", "On 15 April 2016, a nondescript web site called USA Daily Records claimed that an Italian doctor discovered a \"surprisingly simple cure\" for multiple sclerosis, a progressive neurodegenerative disease:", "An Italian doctor has been getting dramatic results with a new type of treatment for Multiple Sclerosis, or MS, which affects up to 2.5 million people worldwide. In an initial study, Dr. Paolo Zamboni took 65 patients with relapsing-remitting MS, performed a simple operation to unblock restricted bloodflow out of the brain – and two years after the surgery, 73% of the patients had no symptoms. Dr. Zamboni’s thinking could turn the current understanding of MS on its head, and offer many sufferers a complete cure.", "Dr. Zamboni’s lucky find is yet to be accepted by the medical community, which is traditionally slow to accept revolutionary ideas. Still, most agree that while further study needs to be undertaken before this is looked upon as a cure for MS, the results thus far have been very positive.", "Naturally, support groups for MS sufferers are buzzing with the news that a simple operation could free patients from what they have always been told would be a lifelong affliction, and further studies are being undertaken by researchers around the world hoping to confirm the link between CCSVI and MS, and open the door for the treatment to become available for sufferers worldwide.", "The claim didn't come from a reputable medical journal or science-based publication, but rather a new, unknown web site registered in February 2016. The article's photograph (widely reproduced on social media) implied that a team of doctors was photographed while joyfully celebrating the breakthrough, but in actuality, it was an unrelated Getty Images picture from 2014:", "Spanish medics treating Ebola infected Spanish nurse Teresa Romero, Fernando de la Calle (L) and Marta Arsuaga (C) react as they leave a press conference at Carlos III Hospital in Madrid on October 21, 2014. A Spanish nurse who was the first person to catch Ebola outside Africa has beaten the deadly disease, officials said today, saying definitive tests showed she was free of the virus.", "Zamboni's hypothesis was actually new in 2009, more than six years before its reappearance in April 2016. An October 2012 New York Times Magazine article reported that the treatment seemed promising at the time:", "Surfing Facebook one day shortly after [an experimental treatment known as] Tysabri scare, [MS sufferer Adam] Gottschalk learned that an Italian vascular surgeon named Paolo Zamboni had hypothesized that the real cause of M.S. was something called chronic cerebrospinal venous insufficiency, or CCSVI. For decades, doctors have been confident that M.S. comes about because the immune system attacks the brain, though they don’t know why it does so. Zamboni contended instead that blocked veins prevent blood from draining from the head, causing iron to back up in the brain and damage nerves that send messages to the body.", "Zamboni’s first study, published in 2009 in a small neurological journal, purported to find CCSVI in 100 percent of M.S. sufferers at one stage of the disease, and he developed a surgical procedure to treat it: opening the veins that carry blood away from the head with the aim of restoring normal blood flow. This would be done by inflating a small balloon inside the vein to widen the passage, and in rare instances by placing a device to keep it open (as is commonly performed in the arteries of patients with heart disease).", "The experimental treatment didn't hold up, however. In October 2013, Zamboni's theory was described as conclusively debunked following the conclusion of a rigorous study, the results of which were published in medical journal The Lancet. News reports from the time of the study's publication described its findings as a \"death knell\" for Zamboni's theory:", "A narrowing of the veins from the brain is unlikely as a cause for multiple sclerosis, say researchers from B.C. and Saskatchewan who found the narrowing is a common and normal finding in most people.", "Italian Paolo Zamboni made headlines in Canada four years ago for his belief that clearing blocked or narrowed neck veins could relieve MS symptoms. Since then probably more than 3,000 Canadians have gone out of country for dilation treatment, said Dr. Anthony Traboulsee of the University of British Columbia.", "In Tuesday's online issue of the The Lancet, Traboulsee and his co-authors published their findings on the prevalence of narrowing, known as chronic cerebrospinal venous insufficiency or CCSVI, in people with MS, their siblings and unrelated healthy controls ... When the researchers used ultrasound to look for CCSVI, they found narrowing in more than 50 per cent of all three groups.", "The hypothesis that vein narrowing has a role in the cause of MS is unlikely since its prevalence was similar in all three groups, the study's authors concluded ... The study was solid and well-balanced, Dr. Paul Friedemann of the neurology department at Charité University in Berlin and Dr. Mike Wattjes of MS Center Amsterdam said in a journal commentary accompanying the research.", "However, there have been updates about new treatments for sufferers of multiple sclerosis that are unrelated to Zamboni's theory, and neither simple nor inexpensive.  In March 2016, The Telegraph published a piece about stem cell therapy for MS sufferers, calling the results \"dramatic\":", "Steven Storey was a marathon runner and triathlete before he was struck down with the disease and left completely paralysed: “I couldn’t flicker a muscle,” he said.", "But within nine days of the treatment he could move his toe and after 10 months managed a mile-long swim in the Lake District. He has also managed to ride a bike and walk again.", "A paper presented at the 2016 American Academy of Neurology meeting recommended more research into whether stem cell should be recommended as regenerative therapy.   However, chronic cerebrospinal venous insufficiency was not mentioned.", "Hutchinson, Michael.   \"Funding CCSVI Research Is/Was A Waste Of Valuable Time, Money And Intellectual Energy: Commentary.\"\r\nMultiple Sclerosis Journal.   June 2013.", "Traboulsee, Anthony L. et. al.   \"Prevalence Of Extracranial Venous Narrowing On Catheter Venography In People With Multiple Sclerosis, Their Siblings, And Unrelated Healthy Controls: A Blinded, Case-Control Study.\"\r\nThe Lancet.   09 October 2013.", "Tullis, Paul.   \"A Controversial ‘Cure’ For M.S..\"\r\nNew York Times Magazine.   26 October 2012.", "CBCnews Health.   \"Zamboni MS Vein Theory Debunked By Study.\"\r\n8 October 2013.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]