["Now that the election is over, according to comedian Amy Schumer, some Americans truly have something to fear.", "Public shaming.", "\"People are going to know if you voted or not,\" Schumer intoned in a video posted online Nov. 3, 2016, five days before the historic presidential contest.", "\"Your voting history is public record. It doesn’t say who you voted for, but it says if you voted at all. Anyone who knows you can just look that s*** up ….", "\"Your decision to vote or not is obviously up to you,\" she added. \"But judging you for that decision could be up to the Internet. And everyone has access to that. Even our parents.\"", "Schumer ended the video (which showed up in the Facebook feed of more than one Wisconsinite) with a call to vote for the Democratic nominee, Hillary Clinton, while making disparaging comments about the Republican nominee (and now president-elect) Donald Trump.", "So, Schumer doesn’t explicitly state that you can simply go online to see if someone voted.", "But her just-look-it-up reference makes it sound easy.", "Elections experts told us that, as Schumer stated, voter records generally are public records (except, of course, who you voted for). So, by and large, a person’s voting history is generally available by request.", "But not everywhere. And don’t expect it to be as easy as typing a name onto a website.", "Let’s start with Wisconsin, one of the states that, unexpectedly, helped carry Trump to victory.", "In Wisconsin", "If you know a voter’s full name and date of birth, you can search that person’s voting history on  a website maintained by the Wisconsin Elections Commission. It’s super quick. But voter participation isn’t instantly recorded. For the just-ended election, local election clerks have up to 45 days to record voter participation.", "And if you don’t know a person’s date of birth, the look-up is more difficult. You can still make a request of the state election commission -- or at the municipal clerk’s office, if you know where the voter lives. The request can be made by mail, email, fax or in person and, depending on how busy an office is, the records are provided as quickly as possible, state elections commission spokesman Reid Magney told us.", "Other states", "In other states, accessing voting histories can be more difficult -- or, in at least one state, not allowed.", "To search online in Nevada, the state requires a date of birth plus either the voter’s drivers license number or the last four digits of his or her Social Security number. Alabama doesn’t offer an online search option. Secretary of State spokesman John Bennett told us that if you make the request in person, by email or via phone from his office, often the record can be provided the same day (for 1 cent per voter, a fee that can be rounded up to $1).", "In Virginia, however, a voter’s voting history is not a public record that is available to the general public, the Virginia Department of Elections told us. Individual voting histories are provided, for a fee, only to groups such as candidates or political groups.", "That being said, it’s possible to pull up a Virginia resident’s voting history online -- but at the risk of violating the state’s computer fraud law. You must click a box certifying that you are searching for your own voter record, or that you are authorized to search for someone else’s record.", "(Schumer's publicist didn't respond to our requests for information.)", "Our rating", "Schumer said: \"Anyone who knows you can just\" look it up to \"see if you voted.\"", "Generally speaking, an individual’s voting history is a public record, though how easy it is to access can vary. Depending on the state, you might need information such as a date of birth to do an online search. And if you don’t have such details, you might have to make a request from a state elections office.", "Moreover, an individual’s voting history is not a public record in at least one state (Virginia).", "For a statement that is partially accurate but leaves out important details, our rating is Half True.", "https://www.sharethefacts.co/share/23001946-d8d0-4426-b34d-3209ac90ff47", "Twitter, Amy Schumer tweet, Nov. 3, 2016", "YouTube, Amy Schumer video, Nov. 4, 2016", "Vocativ, \"Celebrity PSAs Are Wrong: Voting Records Aren’t Easily Accessible,\" Nov. 7, 2016", "Wisconsin Elections Commission, MyVoteWisconsin website, accessed Nov. 9, 2016", "Email, Wisconsin Elections Commission public information officer Reid Magney, Nov. 7, 2016", "Email, U.S. Election Assistance Commission director of communications & clearinghouse Bryan Whitener, Nov. 7, 2016", "Nevada Secretary of State, voter registration search, accessed Nov. 9, 2016", "Virginia Department of Elections, voter search, accessed Nov. 9, 2016", "Email, Virginia Department of Elections spokeswoman Dena Potter, Nov. 9, 2016", "Email, University of California, Irvine, law and political science professor Richard Hasen, Nov. 7, 2016", "Email, Rutgers University political science professor Lorraine Minnite, Nov. 7, 2016", "Interview, Reporters Committee for Freedom of the Press legal fellow Rachael Jones, Nov. 9, 2016", "Interview, Alabama Secretary of State deputy chief of staff/director of communications John Bennett, Nov. 9, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]