["About this rating", "On 9 November 2016, web site FAMMTV published an article (bearing the unquestionably provocative title: \"DONALD TRUMP TELL BLACKS \"KISS YOUR SECTION 8, WELFARE & MEDICAID GOODBYE\") which appeared to report that president-elect Donald Trump said he planned to get rid of assistance programs that are purportedly being abused by \"lazy\" Americans:", "When Donald Trump officially take office, you can expect some major changes. Donald Trump believe Americans became lazy with all of the government assistance programs that the government offer the people. Donald Trump recently said \"Americans will no longer be able to be lazy, and depend on the government to take care of them\".", "Many working American believe a lot of government assistance programs need to be abolished. One of them programs are Section 8. Why do a such program exist anyway? Well Donald Trump doesn't believe in any of it and believe working citizens of America would like to see their tax money being spent in better ways than taking care of able working Americans that simply refuse to. Even though there are working Americans that are on Section 8, 75% of Section 8 recipients go through numerous jobs, and some refuse to work at all.", "Another program Donald Trump doesn't believe in is Welfare. Although he openly admitted that he see the point in the program, he don't think Americans understand that if should be used to help those get on their feet instead of a reliable source of income. He believe American need to recreate jobs and recreate American Businesses that other countries are now benefiting from.", "The article's lack of any substantiating material should have been a clue that it was not a real story. Had Trump made any sort of divisive or racist assertion of the sort (such as implying that social programs like Section 8 housing exist solely to benefit black people), those comments would have been unquestionably newsworthy in the wake of his upset victory in the 2016 election.", "United States presidents are not vested with the power to either create or pass laws on their own:", "The president does not have the power to create or rewrite legislation — that is Congress’s job. He is not authorized to dispense with or suspend the law. British kings made this practice familiar to the Framers of the Constitution, who deliberately chose to deny such a power to the president ... let’s start by referring to the Constitution. Article II charges the president with the duty to carry out the law — to “take care that the laws be faithfully executed.”", "FAMMTV features no disclaimer we could find warning their readers that their content is fabricated, and typically spreads cynical, racially-targeted falsehoods. Previous hoax stories published by this outlet include the claim that all unemployed \"baby mamas\" would be jailed if they failed to find jobs, that President Barack Obama amended the law to allow the purchase of hot food with SNAP benefits, and that the government targeted black women and their newborns via intentionally tainted epidurals.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]