["About this rating", "In May and June 2018, right-wing demonstrators and self-styled free speech advocates rallied to the defense of Tommy Robinson after the far-right English activist was jailed for risking the collapse of a child sexual abuse trial by confronting suspects outside the court in a Facebook Live video.", "There were \"Free Tommy Robinson\" protests in London, throughout England, in Belfast, and on a smaller scale in Australia and parts of Europe. Many of those demonstrating against Robinson's imprisonment emphasized freedom of expression and organizers took to using an image of Robinson with duct tape over his mouth.", "This outrage over the purported censorship of Robinson clashes with the reality of his frequent appearances on mainstream national television and radio in the United Kingdom in recent years, and the fact that he was not jailed for simply reporting on the ongoing child abuse case.", "In fact, he was jailed for contempt of court because his combative live broadcast from outside the court in the northern city of Leeds could have triggered the collapse of the trial itself. Robinson — whose real name is Stephen Yaxley-Lennon — was already on a suspended sentence for contempt of court after he confronted men he thought were suspects in an earlier child exploitation trial in May 2017, filming inside the court despite repeated warnings.", "The judge in the Leeds trial had issued a postponement order to the news media — meaning journalists can report the full details of the case, but only after it has already concluded — in order to avoid the possibility of a costly retrial which would risk re-traumatizing the alleged victims Robinson claims to have been championing.", "Against this background, the far-right Twitter account @RealitySmash posted a photograph on 9 June 2018, which he claimed showed \"the whole of London\" protesting in defense of Robinson. Continuing the \"censorship\" cries of many of Robinson's supporters, @RealitySmash claimed that \"the left want this picture taken down\":", "The left want this picture taken down because it shows the whole of London calling for Tommy Robinson to be released so please don't retweet it. pic.twitter.com/76sExOUTpr", "— Jason Collins (@RealitySmash) June 9, 2018", "In reality, the photograph does not show Tommy Robinson supporters rallying to his defense in London in 2018. It doesn't even show the city of London. In fact, this picture shows throngs of soccer fans celebrating Liverpool FC's historic victory in the 2005 Champions League final. The photograph was taken on 26 May 2005 in Liverpool — more than 200 miles north-west of London — by Martin Rickett for the AFP/Getty agency. You can see it in its proper context here.", "Local police estimated that between 750,000 and one million people took to the streets of Liverpool for a victory parade by the team, which won the European club competition for the first time in 21 years after a now legendary comeback against AC Milan.  Rickett's photograph shows crowds gathered around St George's Hall on Lime Street in the center of the city.", "@RealitySmash's wildly inaccurate tweet has become something of a meme in its own right, prompting ridicule from Twitter users in the U.K.", "The left want this picture taken down because it shows the whole of London calling for Tommy Robinson to be released so please don't retweet it. pic.twitter.com/1DwY8ZuMfu", "— Paul Kelly (@PaulKelly517) June 10, 2018", "The response has been particularly scathing in the city of Liverpool itself, which is widely regarded as a stronghold of left-wing politics in England. One local observer pointed out the irony of the Lime Street area of Liverpool being shown in the fake Tommy Robinson photograph, since this is where anti-racist Liverpudlian demonstrators in 2017 shut down an attempted rally by the far-right English Defence League — which was founded by Robinson himself:", "Seriously? You use a picture of St George's Hall on Lime Street in Liverpool. The very location where the edl were literally laughed out of town to the Benny Hill theme?https://t.co/1XvWtQUiXC", "— Liz Carlisle (@looniblu) June 10, 2018", "Mac Guill, Dan.  \"Was a Far-Right Activist Jailed for Breaching a Court Order Designed to 'Protect Muslim Pedophiles'?\"\r\n  Snopes.com.  29 May 2018.", "BBC News.  \"Victory Tour Seen by 'a Million.'\"\r\n  BBC News.  26 May 2005.", "Ottewell, David.  \"It's Official -- Liverpool Really is One of the Most Left-Wing Cities in Britain.\"\r\n  The Liverpool Echo.  24 September 2016.", "RT.  \"Far-right March in Liverpool Blocked by Left-Wingers, Police Arrest 12 After Clashes.\"\r\n  RT.  3 June 2017.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]