["The first of the back-to-back Democratic debates in July included spin from the candidates on gun violence, Republican tax cuts, climate change, manufacturing jobs and more.", "By Eugene Kiely, Brooks Jackson, Lori Robertson, D'Angelo Gore, Jessica McDonald and Saranac Hale Spencer", "Posted on July 31, 2019", "We flagged false and misleading claims from several candidates:", "The second set of Democratic primary debates was hosted by CNN at Detroit’s Fox Theatre on July 30 with 10 candidates. Another 10 will take the stage on July 31.", "O’Rourke falsely claimed that “no other country” has as many firearm-related deaths as the U.S.", "O’Rourke: How else can we explain that we lose nearly 40,000 people in this country to gun violence, a number that no other country comes even close to.", "O’Rourke didn’t specify a time period, but 39,773 people died from firearm-related injuries in the U.S. in 2017, according to the most recent Centers for Disease Control and Prevention data. Of those deaths, 60% were suicides and 36.6% were homicides.", "But it’s not true that no other country comes close to the U.S., as O’Rourke said.", "In 2016, there were an estimated 43,200 firearm injury deaths in Brazil, according to a 2018 study published in JAMA. That was more than the estimated 37,200 firearm deaths that year in the U.S. Mexico, with an estimated 15,400 deaths by firearms, was the next closest country.", "The U.S., with 10.6 deaths per 100,000 people, also did not have the highest firearm injury death rate. More than a dozen countries had a higher rate than the U.S., including Brazil (19.4), Honduras (22.5), Guatemala (32.3) and Venezuela (38.7). El Salvador’s rate of 39.2 deaths per 100,000 people was the highest.", "O’Rourke also claimed that the CDC is “prevented from actually studying the issue [of gun violence] in the first place.” Under what’s known as the Dickey Amendment, no CDC funds “for injury prevention and control … may be used, in whole or in part, to advocate or promote gun control.” However, compromise language accompanying a 2018 spending bill clarified that, while that prohibition remains, “the Secretary of Health and Human Services has stated the CDC has the authority to conduct research on the causes of gun violence.”", "Update, July 31: A spokesman for O’Rourke’s campaign told us the former congressman meant that “no other developed country comes close to the number of gun deaths” in the U.S. That claim is accurate, but it’s not what he said in the debate.", "The candidates engaged in some misleading claims about the effects of the 2017 Republican tax cut.", "“Left everyone behind?” — Klobuchar referred to the bill as “that regressive tax bill that left everyone behind, but really made his Mar-a-Lago friends richer.”", "The bill did benefit wealthy people like those able to afford the $200,000 membership fee to join Trump’s Palm Beach resort. A 2017 analysis by the Urban-Brookings Tax Policy Center estimated that in 2018 the average tax cut for those in the top one-tenth of 1% in income would amount to $193,380.", "But the bill certainly didn’t “leave everyone behind.” The TPC analysis estimated that the middle 20% in income would get an average cut of $930 in 2018.", "Klobuchar would have been correct to say that the bill favored the rich more than others. The TPC analysis estimated that the middle 20% would see their after-tax income go up 1.6%, less than half the 3.4% increase in after-tax income for the top 1%.", "“83 cents”? — Williamson dusted off a shopworn and misleading Democratic talking point that we’ve debunked before. She said, “We had a $2 trillion tax cut, where 83 cents of every dollar goes to the very, very richest among us.” That’s misleading.", "She’s referring to the TPC’s analysis of the effect of the Trump tax bill in 2027 — which is after most of the individual income tax changes would expire, should Congress not extend them. In 2025, when all of the bill’s provisions would still be in effect, the top 1% would get just over 25 cents of every dollar of the cuts.", "In explaining how he would run against Trump in the general election, Hickenlooper accused the president of “malpractice” and ticked off several examples — including manufacturing job growth.", "“Where’s the small manufacturing jobs that are supposed to come back?” he asked.", "It’s true that there are still 892,000 fewer manufacturing jobs, as of June, than there were in December 2007, when the Great Recession started. However, manufacturing jobs have increased under Trump.", "The economy has added 486,000 manufacturing jobs between Trump’s inauguration and June, according to the Bureau of Labor Statistics. As we wrote in the most recent installment of “Trump’s Numbers,” that amounts to 3.9% growth — the same rate as total employment has grown during that time.", "In discussing climate change, two candidates referred to decade-long deadlines to take action on the issue.", "Buttigieg broached the subject in his opening statement, saying, “Science tells us we have 12 years before we reach the horizon of catastrophe when it comes to our climate.”", "O’Rourke also referenced a similar time period. “I’ve listened to the scientists on this, and they’re very clear,” he said. “We don’t have more than 10 years to get this right.”", "In his closing statement, Buttigieg returned to the idea, adding, “By 2030 we will have passed the point of no return on climate.”", "As we explained in our coverage of the last Democratic debate, the time frames both politicians reference are pulled from a special report issued by the U.N.’s Intergovernmental Panel on Climate Change in 2018.", "The IPCC report concluded that to avoid many of the more severe impacts of climate change, global warming would have to be limited to 1.5 degrees Celsius above pre-industrial levels — or about half a degree more than current warming. To reach that goal, the report said carbon dioxide emissions around the world would need to fall 45% below 2010 levels by 2030, and be net-zero by 2050.", "With just 12 years between 2018 and 2030, the report’s message was misinterpreted by many to mean that just over a decade remained to take action on climate change, or before an ecological catastrophe.", "“The problem with that framing from a scientific perspective is that climate change is not pass/fail,” Benjamin Cook, a climate scientist at NASA explained in a phone interview. “The 1.5 and 2 degree thresholds aren’t magical tipping points,” he said, where “we’re okay before then and it’s a disaster afterwards.”", "The consequences will be worse if we wait, he said, but even if the world surpasses 2 degrees of warming, any action we take to prevent further warming would still have value.", "It’s a point that other scientists have made as well.", "“Please stop saying something globally bad is going to happen in 2030,” wrote Myles Allen, an author of the IPCC report and the leader of the ECI Climate Research Programme at the University of Oxford, in a Conversation article. “Bad stuff is already happening and every half a degree of warming matters, but the IPCC does not draw a ‘planetary boundary’ at 1.5°C beyond which lie climate dragons.”", "Sonali McDermid, a climate scientist at New York University, noted in an email that the longer we wait to take action, the harder it will be to make progress on climate change, which after the 1.5 degree target, could lead to or exacerbate loss of key ecosystems, increases in extremes, changes in seasonality that affect food production and infrastructure, and higher sea level rise. “But that doesn’t – and shouldn’t – imply or mean that we just give up after 12 years,” she wrote.", "So while the candidates are correct to say that scientists have warned about the effects of climate change — and advocate for sooner, rather than later movement on the issue — it’s not the case that 2030 is a “point of no return” or that there is a particular deadline for taking action.", "Ryan said of farmers, “They haven’t made a profit in five years.” That’s far from being true.", "The Economic Research Service of the U.S. Department of Agriculture recently projected that net farm income would rise 10% this year, to $69.4 billion. And that broad measure of farm profits hasn’t been below $60 billion since 2006.", "It’s true that net farm income peaked at $123 billion in 2013 — a period of high commodity prices. Ryan would have been on firmer ground had he said farmers haven’t seen a big profit increase in five years.", "Sanders twice said that there were “87 million uninsured or underinsured,” saying this was the case “tonight in America, as we speak.” A Commonwealth Fund study supports that figure, though it includes those who were insured at the time they were surveyed but had had a gap in coverage in the prior year.", "“Of the 194 million U.S. adults ages 19 to 64 in 2018, an estimated 87 million, or 45 percent, were inadequately insured,” the study found, directing readers to Tables 1 and 2. The 87 million figure includes: 24 million uninsured in 2018, 43.8 million who were “underinsured” and 19.3 million who were insured at the time of the survey but had a gap in coverage in the previous year. The underinsured measure looks at out-of-pocket costs, not including insurance premiums, and the plan deductible. It includes people whose out-of-pocket costs were 10 percent or more of household income over 12 months, or 5 percent or more of household income for those earning under 200% of the federal poverty level; it also includes those whose deductibles were 5 percent or more of household income.", "The study found that fewer adults were uninsured in 2018, compared with 2010, but more people were underinsured.", "Warren defended her plan to fund child care and education by taxing “the top one-tenth of 1% of fortunes in this country.”", "By collecting a 2% tax on net worth over $50 million and a 3% tax on net worth over $1 billion, Warren promises to provide universal child care for kids up to age 5 and universal pre-K, raise the wages of child care and preschool teachers, offer free tuition at community and technical colleges, dedicate $50 billion to historically black colleges and universities, and cancel student debt for 95 percent of those who have it.", "Delivering on that promise depends on her tax plan generating $2.75 trillion over 10 years. But some economists are skeptical that it will actually raise that much. We wrote about it here.", "An op-ed from Lawrence Summers, a former treasury secretary and an economic adviser to former President Barack Obama, and Natasha Sarin, a law and business professor, suggested that Warren’s plan would raise about 40% of the projection.", "The Warren campaign hit back on the criticisms raised in that piece, arguing that the tax plan wouldn’t be weakened by loopholes and would include funds to bolster IRS enforcement. But it’s far from settled as to whether or not Warren’s plan will be able to pay for everything it has promised.", "When asked about the economic impact of policy proposals that would reduce public reliance on fossil fuels, O’Rourke said “wind and solar jobs are the fastest-growing jobs in the country.”", "We covered this issue once before — when Washington Gov. Jay Inslee made a similar statement — and found no federal data that could support such a claim.", "The BLS, the country’s official custodian of employment data, discontinued collecting data on all so-called “green jobs” in 2013. However, the agency does measure the number of jobs for some individual green occupations on an annual basis and projects job growth for these occupations.", "In 2017, BLS projected that solar photovoltaic installers and wind turbine technicians will be the two fastest-growing occupations by 2026. But that’s future growth, not current growth, and it is on a percentage basis. The actual number of additional jobs projected by 2026 is quite small.", "By 2026, BLS projects there will be 11,800 additional solar installers and 5,600 new wind turbine service technicians. That would be a 105 percent increase in solar photovoltaic installers and a 96 percent increase in wind turbine technicians from 2016 levels. By contrast, the third fastest-growing occupation — home health aides — will add 431,200 jobs, an increase of 47 percent.", "Home health aides also appears on the agency’s “most new jobs” projections, but the solar and wind jobs do not.", "We also found that, as of May 2018, there were an estimated 8,950 solar installers and 5,580 wind turbine service technicians. But a BLS spokesman told us that those figures represent a moving three-year average, so those figures should not be compared with those from previous years.", "The BLS data limitations make it impossible to measure the growth in “green jobs” in a way that is comparable with other occupations tracked by the agency.", "Two candidates misrepresented the Green New Deal during the debate, inaccurately stating that the nonbinding resolution offers Americans a guarantee of a government job.", "When asked why he felt the Green New Deal was unrealistic, Delaney responded, “Well, first of all, because it ties its progress to other things that are completely unrelated to climate, like universal health care, guaranteed government jobs, and universal basic income. So that only makes it harder to do.”", "Hickenlooper made the same claim in the last debate, and repeated it again twice in this debate.", "The Green New Deal, he said, would “make sure that every American is guaranteed a government job that they want.”", "Later, when Hickenlooper was also asked why he is opposed to the Green New Deal, he replied, “Well, I think the guarantee for a public job for everyone who wants one is a classic part of the problem. It’s a distraction.”", "As we explained after the June debate, the Green New Deal guarantees “a job with a family-sustaining wage, adequate family and medical leave, paid vacations, and retirement security to all people of the United States.” The legislation, which failed to advance in the Senate in March, does not require the job be a public sector position.", "The Global Burden of Disease 2016 Injury Collaborators. “Global Mortality From Firearms, 1990-2016.” JAMA. 28 Aug 2018.", "Santhanam, Laura. “There’s a new global ranking of gun deaths. Here’s where the U.S. stands.” PBS NewsHour. 28 Aug 2018.", "Kochanek K.D., et al. “Deaths: Final data for 2017.” National Vital Statistics Reports; vol 68 no 9. National Center for Health Statistics. 24 Jun 2019.", "Collins, Sara R. et. al. “Health Insurance Coverage Eight Years After the ACA.” The Commonwealth Fund. 7 Feb 2019.", "Urban-Brookings Tax Policy Center. “Distributional Analysis of the Conference Agreement for the Tax Cuts and Jobs Act” 18 Dec 2017.", "Economic Research Service, U.S. Department of Agriculture. “Highlights From the March 2019 Farm Income Forecast: Farm Sector Profits Expected To Increase in 2019.” 7 Mar 2019.", "Economic Research Service, U.S. Department of Agriculture. “Value added to the U.S. economy by the agricultural sector, 2000-2009 Nominal (current dollars).” Data accessed 31 Jul 2019.", "Economic Research Service, U.S. Department of Agriculture. “Value added to the U.S. economy by the agricultural sector, 2010-2019F Nominal (current dollars).” Data accessed 31 Jul 2019.", "McDonald, Jessica. “The Facts on the ‘Green New Deal.’” FactCheck.org. 15 Feb 2019.", "Allen, Myles. “Why protesters should be wary of ‘12 years to climate breakdown’ rhetoric.” The Conversation. 18 Apr 2019.", "IPCC, 2018: Summary for Policymakers. Global warming of 1.5°C. An IPCC Special Report on the impacts of global warming of 1.5°C above pre-industrial levels and related global greenhouse gas emission pathways, in the context of strengthening the global response to the threat of climate change, sustainable development, and efforts to eradicate poverty. World Meteorological Organization, Geneva, Switzerland.", "Cook, Benjamin. Climate scientist, NASA. Interview with FactCheck.org. 26 Jul 2019.", "McDermid, Sonali. Assistant Professor of Environmental Studies, New York University. Emails sent to FactCheck.org. 28 and 30 Jul 2019.", "Bureau of Labor Statistics. “Employment, Hours, and Earnings from the Current Employment Statistics survey; All employees, thousands, manufacturing, seasonally adjusted.” Accessed 31 Jul 2019.", "Jackson, Brooks. “Trump’s Numbers July 2019 Update.” FactCheck.org. 12 Jul 2019.", "Kiely, Eugene. “Jay Inslee’s Green Jobs Claim.” FactCheck.org. 16 Apr 2019.", "Bureau of Labor Statistics. “Thirty fastest growing occupations projected to account for 19 percent of new jobs from 2016 to 2026.” Press release. 30 Oct 2017.", "Torpey, Elka. “Green growth: Employment projections in environmentally focused occupations.” Bureau of Labor Statistics. Apr 2018.", "Bureau of Labor Statistics. “Most New Jobs.” Updated 12 Apr 2019. Accessed 31 Jul 2019.", "Bureau of Labor Statistics. “Occupational Employment and Wages, May 2018. 47-2231 Solar Photovoltaic Installers.” Accessed 31 Jul 2019.", "Bureau of Labor Statistics. “Occupational Employment and Wages, May 2018. 49-9081 Wind Turbine Service Technicians.” Accessed 31 Jul 2019.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]