["About this rating", "In October 2018 former vice president Joe Biden was being touted as a potential Democratic challenger to President Donald Trump in the 2020 election, while Biden himself said he was not running for president \"at this point.\"  Nonetheless, Biden traveled to London that month to deliver a talk on foreign policy at an event titled \"A Vision for the Future of the Transatlantic Relationship.\"", "During that talk, the former VP offered some harsh words about Russian and Russian president Vladimir Putin, a dialog which the junk news site Your News Wire falsely represented with a headline and lead proclaiming that Biden asserted \"Putin Wants to Destroy the New World Order\":", "Biden said nothing in his talk about a \"New World Order\" (i.e., a conspiracy theory holding that \"a secretive power elite with a globalist agenda is conspiring to eventually rule the world through an authoritarian world government which will replace sovereign nation-states\"), much less anything about Putin's desire to destroy that non-existent entity.", "What Biden actually expressed in his Chatham House talk was a warning that the Russian president sought \"the dissolution of NATO and the European Union\" in order to destabilize and weaken a \"unified, democratic west\":", "In an event chaired by Chatham House director Sir Robin Niblett, Mr Biden warned of the dangers of what he called a \"declining but aggressive Russia\".", "He added: \"The Russians are using ever tool at their disposal to destabilise and sow discord.\"", "\"Putin's ultimate goal in my view is the dissolution of NATO and the European Union rather that the re-establishment of the Soviet Union.", "\"He would rather deal with individual nations he can try to strong-arm than a unified, democratic west.\"", "Turning his attention to the situation in his own country, [Biden] said: \"The democracy, freedom and openness which we cherish is under threat from within and from without by the siren calls of phony nationalism, populism and xenophobia which exists in many western democracies today, including the UK and the US.", "A video of former vice president Biden's talk can be viewed here.", "Adl-Tabataba, Sean.   \"Joe Biden: Putin Wants to Destroy the New World Order.\"\r\n    Your News Wire.   13 October 2018.", "McGrath, Ciarin.   \"World War 3: Putin Wants to Destroy NATO and the EU, Warns Joe Biden During UK Visit.\"\r\n    Express.   12 October 2018.", "Saenz, Arlette.   \"Joe Biden to Offer Contrast to Trump in London Foreign Policy Speech.\"\r\n    CNN.   4 October 2018.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]