["About this rating", "On Dec. 14, the website Conservative Tears published an article positing that the actor Carol Burnett had died.", "\"Carol Burnette [sic] Dead at 89 -- A Huge Trump Supporter Lost\"", "\"Television and film legend Carol Burnett has died at the age of 89. Not only has the world lost a great talent, but the President has lost a great friend and avid supporter.\"", "This item was not a factual recounting of real-life events. The article originated with a website that describes its output as being humorous or satirical in nature, as follows:", "\"Everything on this website is fiction. It is not a lie and it is not fake news because it is not real. If you believe that it is real, you should have your head examined. Any similarities between this site’s pure fantasy and actual people, places, and events are purely coincidental and all images should be considered altered and satirical.\"", "As well as originating on a website that describes its content as satire, the article contained several factual inaccuracies and inconsistencies that hinted it was a hoax. Burnett's name was misspelled in the headline, and the article provided two birth years (1934 and 1937), which were both inaccurate. Burnett was born in April 1933, and was therefore 86 years old at the time the article was published, not 89, as the headline falsely stated. Burnett has also been married three times, contrary to the article's claim that she \"never married.\"", "Furthermore, Burnett has not engaged in public political activism, contrary to what the Conservative Tears article asserted. Though she has not made explicit pronouncements about U.S. President Donald Trump, she indicated distaste for him in a 2016 interview with Larry King. When asked to comment on the then-Republican presidential candidate, she groaned, and added \"That's my comment\":", "While the article appeared on Conservative Tears with several \"satire\" labels, it was re-published elsewhere without such warnings, meaning readers unaware of its origins could have mistakenly understood it to be a serious report of Burnett's demise. For example, the website Teacher Of Cooking (whose banner reads \"Today Breaking News\") republished the article on Dec. 15, without any indication that it originated on a website that labels its content satire.", "Indeed, even some social media users who encountered the article on the Facebook page of America's Last Line of Defense (the network of websites of which Conservative Tears is a subsidiary) took its claims seriously, leading to several apparently earnest tributes to the popular actor and variety star:", "For background, here is why we sometimes write about satire/humor.", "ConservativeTears.com.  \"Carol Burnette Dead at 89 -- A Huge Trump Supporter Lost.\"\r\n  14 December 2019.", "TeacherOfCooking.com.  \"Carol Burnette Dead at 89 -- A Huge Trump Supporter Lost.\"\r\n  15 December 2019.", "Newcomb, Horace (ed.)  \"The Encyclopedia of Television.\"\r\n  Fitzroy Dearborn.  2004", "The Herald-Palladium/Associated Press.  \"Carol Burnett a Newlywed Again.\"\r\n  5 December 2001.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]