["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "President Donald Trump (from left), Foxconn chairman Terry Gou and Wisconsin U.S. Sen. Ron Johnson appeared at the White House to announce Foxconn's plans to build in Wisconsin. (Getty Images)", "Perhaps it shouldn’t be surprising that when it comes to the $10 billion, 20 million-square-foot factory being promised to Wisconsin, some statements border on the extreme.", "Foxconn \"is bringing\" 13,000 jobs. Half True.", "3,000 Foxconn jobs would cost Wisconsin $3 billion, or $1 million per job. False.", "Now comes a claim, made in response to a boast by Gov. Scott Walker, that the $3 billion incentives offer is the largest of its kind. The exchange occurred Aug. 7, 2017 exchange on Twitter, a week and a half after Foxconn, the maker of iPhones and other electronics, announced it would be coming to Wisconsin.", "Walker tweeted:", "Our bold reforms have prepared WI for Foxconn & thousands of jobs. Hard-working families will reap the benefits! #WIWinning", "One Wisconsin Now, a liberal advocacy group, retorted:", "You are willing to give the largest gift ever by a state to a foreign company. You got #foxconned, big guy.", "Wisconsin clearly isn’t offering a gift. The incentives are tied to Foxconn making investments in the plant and in payroll.", "But the best available source indicates the $3 billion would be the largest ever subsidy provided by a state to a foreign company.", "One Wisconsin Now’s evidence", "To back its claim, One Wisconsin Now cited June 2017 data from Good Jobs First, a Washington, D.C., nonprofit that calls itself \"a leading monitor and critic of company-specific subsidy deals,\" and has called the the Foxconn deal \"a sure loser for Wisconsin taxpayers.\"", "We checked with a number of experts on subsidies and none said they knew of any other compilation of subsidies. The experts include Todd Berry, president of the nonprofit Wisconsin Taxpayers Alliance; Jon Peacock, director of the nonprofit Wisconsin Budget Project; and economists Michael Leeds of Temple University, Charley Ballard of Michigan State University, Jeffrey Michael of the University of Pacific in Stockton, Calif., Sean Snaith at the University of Central Florida; Ball State University’s Michael Hicks; and Tim Bartik of the Upjohn Institute for Employment Research.", "Hicks, who heads Ball State’s Center for Business and Economic Research, told us that while he hasn’t always agreed with analyses done by Good Jobs First, the group’s data on subsidies is solid. And Bartik said it is the best such database he knows.", "Here are the top 12 subsidies given to companies by states, cities or counties, according to Good Jobs First:", "Recipient company", "Parent company", "Subsidy (in billions)", "Year", "State", "City", "County", "Boeing", "Boeing", "$8.7", "2013", "WA", "Alcoa", "Alcoa", "$5.6", "2007", "NY", "Massena", "Boeing", "Boeing", "$3.24", "2003", "WA", "Everett", "General Motors", "General Motors", "$2.34", "2009", "MI", "Orion Township", "Oakland", "Ford Motor", "Ford Motor", "$2.3", "2010", "MI", "statewide", "Sempra Energy", "Sempra Energy", "$2.19", "2013", "LA", "Hackberry", "Cameron", "Nike", "Nike", "$2.02", "2012", "OR", "Beaverton", "Washington", "Intel", "Intel", "$2", "2004", "NM", "Rio Rancho", "Sandoval", "Intel", "Intel", "$2", "2014", "OR", "Hillsboro", "Washington", "Lake Charles LNG Export Company, LLC", "Energy Transfer", "$1.79", "2015", "LA", "Lake Charles", "Calcasieu", "Cheniere Energy", "Cheniere Energy", "$1.69", "2010", "LA", "Cameron", "Cameron Parish", "Royal Dutch Shell", "Royal Dutch Shell", "$1.65", "2012", "PA", "The top 11 subsidies are all for American companies.", "At No. 12 is the estimated $1.65 billion in tax credits Pennsylvania approved for Royal Dutch Shell, which is based in The Netherlands. That package of tax breaks over 25 years was aimed at getting the company to build an ethane refinery that would include a minimum investment of $1 billion and employ at least 2,500 people.", "Using the U.S. Bureau of Labor Statistics’ Consumer Price Index inflation calculator, $1.65 billion in 2012 was worth about $2.39 billion as of July 2017 -- so, still well below Wisconsin’s $3 billion offer to Foxconn.", "(The Good Jobs First database does not take inflation into account.)", "But there are at least two important points to consider.", "1. The $3 billion wouldn’t be a gift, as One Wisconsin Now calls it. That’s the maximum amount the state would pay Foxconn, and only if the company spends roughly $18 billion -- about $9 billion for payroll and $9 billion in capital investments.", "2. It’s difficult to calculate the value of the jobs that the various incentives are aimed at creating -- or keeping. Some jobs pay more than others, of course. And some businesses are more likely than others to attract suppliers that might, in turn, create more jobs in a state.", "Supporters of the Foxconn deal say Wisconsin would win a keystone manufacturer that would bring world-leading technology and attract suppliers that would create their own jobs. Critics say it amounts to a multibillion-dollar bet on a company that makes screens — a product subject to constant market-disrupting competition and innovation.", "Our rating", "One Wisconsin Now says Wisconsin's $3 billion incentive offer to Foxconn is \"the largest gift ever by a state to a foreign company.\"", "The $3 billion wouldn’t be given -- it would be paid, in increments, based on how much Foxconn spends on capital investments and payroll.", "But the only compilation of government subsidies we found shows that the Foxconn offer would exceed the highest subsidy provided to a foreign company -- $1.65 billion in 2012, made by Pennsylvania to Dutch Royal Shell, based in The Netherlands.", "For a statement that is partially accurate but leaves out important information, our rating is Half True.", "Twitter, One Wisconsin Now tweet, Aug. 7, 2017", "Interview, One Wisconsin Now executive director Scot Ross, Aug. 14, 2017", "Good Jobs First, \"Megadeals,\" June 2017", "Interview, Good Jobs First executive director Greg LeRoy, Aug. 14, 2017", "Email, Ball State University Center for Business and Economic Research director Michael Hicks, Aug. 9, 2017", "Email, Upjohn Institute for Employment Research senior economist Tim Bartik, Aug. 9, 2017", "Interview, University of Central Florida Institute for Economic Competitiveness director Sean Snaith, Aug. 11, 2017", "Email, Todd Berry, president of the nonprofit Wisconsin Taxpayers Alliance, Aug. 10, 2017", "Email, Michael Leeds, Temple University Economics Department chair, Aug. 10, 2017", "Email, Jon Peacock, director of the nonprofit Wisconsin Budget Project;  Aug. 10, 2017", "Email, Jeffrey Michael, director of the Center for Business and Policy Research at the University of Pacific, Aug. 10, 2017", "Email, economics professor Charley Ballard of Michigan State University, Aug. 10, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]