["By Saranac Hale Spencer", "Posted on July 12, 2019", "Memes circulating online claim that former President Barack Obama removed the citizenship question from the 2010 census. He didn’t. The citizenship question in 2010 was handled the same way it had been since 1970.", "The Trump administration’s fight to add a question about citizenship to the 2020 census was lost in June when the Supreme Court ruled that the administration had concealed the reason it sought to add the question. The majority ruled that the administration gave a “contrived,” rather than “genuine,” justification for the question, and thus barred it from being included in the decennial census.", "The issue, though, is still being debated and an error has been widely introduced into that debate on social media. Several different memes are circulating online based on the false claim that former President Barack Obama removed the citizenship question from the 2010 census.", "One popular version of the claim is from Charlie Kirk, founder of the young conservative group Turning Point USA. His tweet has been liked more than 75,000 times and turned into a meme on Facebook. Kirk wrote: “If Barack Obama was able to remove the Citizenship Question from the census in 2010 without Supreme Court approval Why does President Trump need their approval to put it back on?”", "But Obama didn’t remove the citizenship question from the census.", "Explaining how the misconception developed requires some background.", "Starting at the beginning, the Constitution mandates that the U.S. population be counted every 10 years in order to determine the number of representatives each state should have and to distribute federal funds. The next decennial census is in 2020.", "As the country’s population grew, the complexity of the census also grew. In 1940, the Census Bureau, for the first time, used sampling as a way to get more detailed information about the population without overburdening all residents with too many questions. That year it sent additional questions to just 5 percent of the population and used statistical techniques to broaden the results. By 1970, the bureau was sending out a short-form questionnaire to every U.S. household and a long-form supplement with more detailed questions to a fraction of U.S. households.", "In 1997, the bureau outlined a plan to eliminate the long-form questionnaire after 2000 and replace it with the American Community Survey, which would be sent out to a small sample of households every year instead of once every 10 years. In 2005, the bureau started using that survey — which U.S. residents are required by law to answer, just as they are required to answer the census.", "That background is important for understanding where the citizenship questions have been asked.", "Here’s how it has been handled since 1820, the first year that a citizenship question was included:", "As the timeline shows, Obama did not remove the citizenship question from the census.", "Plans to replace the long-form questionnaire with the American Community Survey were underway during the Clinton administration and the shift happened during the Bush administration. The 2010 census that occurred during the Obama administration handled the citizenship question the same way it had been since 1970; there was no citizenship question on the short-form questionnaire sent to every U.S. household, but a citizenship question was asked on the supplemental form sent out to a smaller sample of households.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "Department of Commerce v. New York. No. 18–966. Supreme Court of the U.S. 27 Jun 2019.", "U.S. Census Bureau. Index of Questions. Accessed 11 Jul 2019.", "U.S. Census Bureau. “The American Community Survey: The Census Bureau’s Plan to Provide Timely 21st Century Data.” 1997.", "U.S. Census Bureau. American Community Survey (ACS) Questionnaire Archive. Accessed 11 Jul 2019.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]