["About this rating", "Pepsi updated the label on Aquafina in 2007 to clarify that the water came from a \"public water source.\"", "This announcement was made in 2007 (not 2019); the water used in Aquafina goes through a purification process before it gets bottled; Aquafina isn't the only bottled-water product to use a public water source.", "Articles claiming that Pepsi \"just admitted\" its brand of bottled water, Aquafina, was \"plain old tap water\" have been circulating on social media for several years. In 2015, for instance, the website True Activist published the following passage:", "In a shocking reveal, the Pepsi corporation admitted that its Aquafina bottled water is not purified water or spring water, but simply plain old tap water. The company will now be forced to change the labeling of the brand to reflect that it is just tap water.", "Several other websites have published similar articles. In September 2019, more than four years after the True Activist article was published, the Yucatan Times wrote that Pepsi had \"just admitted that the water they are using is just tap water.\"", "While these articles are based on a genuine news report, they are also outdated and exaggerated.", "These articles are referring to a 2007 decision by PepsiCo Inc. to amend the label on bottles of Aquafina to clarify that the water came from a \"public water source.\"", "Reuters reported at the time:", "PepsiCo Inc. will spell out that its Aquafina bottled water is made with tap water, a concession to the growing environmental and political opposition to the bottled water industry.", "According to Corporate Accountability International, a U.S. watchdog group, the world’s No. 2 beverage company will include the words “Public Water Source” on Aquafina labels.", "“If this helps clarify the fact that the water originates from public sources, then it’s a reasonable thing to do,” said Michelle Naughton, a Pepsi-Cola North America spokeswoman.", "While the water used in Aquafina products comes from public water sources, that does not mean it is \"just tap water.\" Before this tap water is bottled, it goes through various filtration and purification processes. In other words, Aquafina isn't simply turning on the faucet and filling up bottles.", "The Aquafina website provides a little insight into how its water is purified:", "Aquafina originates from public water sources and is then purified through a rigorous purification process. This purification process includes reverse osmosis and other filtering and purification methods. It removes things like chlorides, salts and other substances that can affect a water's taste. Every bottle of Aquafina is produced at one of our water purification centers. That's how you know you're getting pure water and perfect taste consistently every time you open an Aquafina. Anytime, anywhere.", "It should also be noted that it isn't uncommon for bottled-water companies to use public water sources. Dasani, for instance, the bottled water produced by the Coca-Cola Company, also uses public water sources:", "To create DASANI® water, we start with the local water supply, which is then filtered for purity using a state-of-the-art process called reverse osmosis. Afterwards, we add a special blend of minerals for that pure, crisp, fresh taste.", "A 2015 article from Mother Jones reported that 45% of bottled water in the United States originates with the municipal water supply. The other 55% comes from spring water:", "The details of where and how bottling companies get their water are often quite murky, but generally speaking, bottled water falls into two categories. The first is “spring water,” or groundwater that’s collected, according to the EPA, “at the point where water flows naturally to the earth’s surface or from a borehole that taps into the underground source.” About 55 percent of bottled water in the United States is spring water, including Crystal Geyser and Arrowhead.", "The other 45 percent comes from the municipal water supply, meaning that companies, including Aquafina and Dasani, simply treat tap water — the same stuff that comes out of your faucet at home — and bottle it up. (Weird, right?)", "To sum up: The water used in many bottled-water products, including Aquafina, comes from a public water source. This water then undergoes various filtration and purification processes before it is bottled and sold.", "Vibes, John.   \"Pepsi Admits That Its Aquafina Bottled Water Is Just Tap Water, Coca-Cola’s Dasani Is Next.\"\r\n    True Activist.   29 October 2015.", "Geller, Martinne.   \"Aquafina Labels to Spell Out Source - Tap Water.\"\r\n    Reuters.   11 August 2014.", "Lurie, Julia.   \"Bottled Water Comes From the Most Drought-Ridden Places in the Country.\"\r\n    Mother Jones.   11 August 2014.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]