["On March 4, Facebook page ‘Humans of Hindutva’ shared two images (archive link) of a television screen tuned in to Aaj Tak. In the first image, we can see “Alcohol and weed cure coronavirus? (शराब और गांजे में कोरोना वाइरस का इलाज?)” written in bold text. Similarly, the second image reads – “Taking a peg of alcohol can destroy coronavirus? (शराब के पैग लगाने से कोरोना वायरस का ख़ात्मा?) The images shared with the caption, “Meanwhile Aaj Tak team has completely lost their minds” received over 500 shares.", "Similarly, several social media users posted photos of Aaj Tak’s broadcast with the claim that the channel said that alcohol and marijuana can cure coronavirus infection.", "On February 22, Aaj Tak posted a 15-minute video on YouTube with the title: “Is the cure for coronavirus hidden in alcohol or weed? (Translated from: क्या Alcohol और Weed में छिपा हैं coronavirus का इलाज?]. The first five minutes of the broadcast fact-checked these claims associated with coronavirus. Photos of the fact-check have been taken out of context on social media and presented with the opposite claim – that the channel asserted that the infection can be cured with alcohol and cannabis.", "According to Aaj Tak, Shiv Sena-backed daily newspaper Saamana published an article that claimed alcohol can cure coronavirus. Alt News rummaged through Saamana’s e-papers prior to February 22 and found that such an article was indeed published on the front page of the February 14 edition.", "Apart from the alcohol claim, Aaj Tak also fact-checked the viral message that marijuana has medicinal properties capable of curing coronavirus infection. This was debunked by Alt News Science when filmmaker Vivek Agnihotri had shared a meme claiming the same,", "The screenshots (attached below) taken at 0:41 and 1:04 marks were posted by Facebook page ‘Humans of Hindutva’.", "This wasn’t an isolated case when photos of Aaj Tak’s fact-check report were taken out of context and used to promote the same misinformation the channel attempted to debunk. Its fact-check report on the viral claim that the Reserve Bank of India (RBI) decided to scrap Rs 2000 notes was misused in a similar fashion. It is noteworthy that the misuse has been possible because Aaj Tak does not explicitly state during its broadcast (as evident in the above screenshots) that the text flashed on the screen is actually the viral message and not a fact stated by the channel. A fact-check report by News18 was also taken out of context in the past for the same reasons.", "In conclusion, photos of a fact-check report by Aaj Tak that alcohol and cannabis cannot be used against coronavirus infection were taken out of context and widely shared on social media,", "Donate Now", "Priyanka Jha specialises in monitoring and researching mis/disinformation at Alt News. She also manages the Alt News Hindi portal.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]