["About this rating", "Two conservative radio hosts alleged on 28 September 2017 that members of the Oakland Raiders may purposefully put quarterback Derek Carr in harm's way for not taking part in a protest carried out by several black players -- a claim later picked up by several web sites.", "Hosts Jack Armstrong and Joe Getty claimed to have \"insider information\" concerning the performance of the Raiders' offensive line -- the only one in the National Football League comprised entirely of African-American players -- in a 27-10 loss to Washington four days earlier.", "According to Armstrong and Getty, an \"extremely reliable\" source on the team divulged to them that the offensive linemen allowed Carr to be sacked (tackled before he could throw the ball) in retaliation for his refusal to join them in protesting during the playing of the national anthem before the game.", "Carr was sacked four times during the game, which Armstrong and Getty claim is outside the norm. Getty first claimed that Carr (who is white) was sacked once during the 2016 season before amending his argument:", "So Derek Carr -- who was never sacked last year -- was sacked four times by the Redskins, back to back on the second offensive series of the Raiders. The first series he threw almost immediately an interception, so that series was over before it began. So for the first full series he was sacked twice, [on] back-to-back plays. Also, three times, the extremely dependable, never-does-this center (the guy who snaps the ball to the quarterback) snapped it before Carr was ready -- three times. He \"hiked\" it, as the kids say, into Carr's knees before he was supposed to.", "In reality, Carr was sacked 16 times during the previous season -- one of which resulted in a season-ending broken fibula. In 2015 he was sacked 31 times, and in 2014 it happened 24 times.", "Armstrong added:", "I think you're guessing where this is going. We have some insider information that this was not an accident.", "The hosts stated several times that they did not know if the allegations of \"Deep Route\" (as they called their alleged source) were true. According to them, however, the source claimed to have heard an offensive line member say of Carr, \"If he wants to stand alone for the national anthem, he can stand alone on the field.\"", "Armstrong said:", "If this story is true, you've got an animosity between a white quarterback and a black offensive line that you can't fix very easily. And the league is just gonna break down completely along racial lines.", "Getty added:", "A reporter got wind of this -- one reporter, and asked a team official about this and was told, \"If you report on this you will be blackballed. You will get no access to the Oakland Raiders, period. Your career reporting on the Raiders will be done if you report on this.", "However, the two hosts mentioned several times that the allegation had not been verified.", "Willard Ogan, the assignment manager for Comcast SportsNet Bay Area -- one of several local news outlets that regularly covers the team -- scoffed at the pair's story. He told us:", "Unless they would happen to want to name their source, I'm guessing they made this shit up on their way in. I'm at a loss for words. You've got to give me something more than this.", "He added that there was a logical flaw in the argument that Carr's offensive line willfully let him be sacked :", "They're trying to get to the Super Bowl. Why would they do this? He's the franchise quarterback.", "Regarding the allegation that a team official had threatened to cut off access to the team for an unnamed reporter, Ogan said that the Raiders have never threatened to \"blackball\" his station:", "Even when the Raiders were [playing] bad[ly], they never threatened to blackball any reporters. They may make it hard like any sports team when you're writing stuff they don't like to make it hard to get interviews. Put it like this: they're no different than the Yankees would be on stuff like this.", "Most of the team, including the offensive line (but not Carr), took part in a protest before the game, an offshoot of former San Francisco quarterback Colin Kaepernick's decision to kneel during the anthem prior to games during the 2016 season to protest extrajudicial killings carried out by police against communities of color. U.S. Army veteran Nate Boyer has confirmed that he helped Kaepernick decide to carry out his protest in that format, rather than sitting during the anthem.", "Raiders offensive tackle Donald Penn said that their demonstration was a direct response to President Donald Trump's call in September 2017 for NFL owners to fire any player who took part. Penn said:", "I wish I didn't have to do anything like that. I've been standing all the time, but when you get called out personally by the President of the country you gotta do something. I ain't wanna do that. I don't think my teammates wanna do that.", "He also said:", "This had nothing to do with disrespecting the military or the flag. I have the utmost respect for them. Because you will not see me over there shooting no guns. So I have so much respect for them and what they do. It had nothing to do with that. I hope they understand that. This all had to do with President Trump's comments. That's the only reason we did that.", "Penn's linemate Marshall Newhouse, however, attributed the protest to a wider range of issues:", "The injustice in the country just doesn't sit well with us, regardless of what the President said before. This is kind of an ongoing problem and we're making a statement about that. It might seem that way that it was kind of a reaction to the President, but this stuff's been going on for a long time.", "Tackle Kelechi Osemele also faced accusations on his Instagram page that he and his linemates allowed Carr to be sacked. He responded:", "If you guys really believe that...I don't even know what to tell you. Carr is our brother he fully supported our decision to make this statement we discussed this as a TEAM and we all have each other's back", "When asked whether the protest had an impact on the Raiders' performance, Carr said:", "I really hope not, but you never know. You don't know what's going on in everybody's head and all those things. But for me, it did not.", "The offensive line did not repeat the protest during the team's following game in Denver on 1 October 2017. Only one player on either squad -- Oakland running back Marshawn Lynch -- sat during the anthem, as he has done throughout the 2017 season.", "Carr suffered an injury after being sacked during the 1 October game. He was initially expected to miss between two and six weeks of action. But Ogan told us that he took part in the team's regular practice on 5 October 2017.", "We contacted both the Raiders and the National Football League seeking comment on Armstrong and Getty's allegations. We also contacted several other media outlets in the Bay Area about the duo's allegation that the team threatened to \"blackball\" a local reporter. We had not received a response by press time.", "Reid, Jason. \"Oakland Raiders Offensive Line: the Silver and Blackest.\"\r\nThe Undefeated. 8 December 2016.", "Schneidman, Matt. \"Most Raiders Sit in Protest: ‘When You Get Called Out Personally ... You Gotta Do Something.'\"\r\nSan Jose Mercury News. 24 September 2017.", "Gutierrez, Paul. \"Raiders' Jack Del Rio Says NFL Protests Didn't Affect Outcome of Game Against Redskins.\"\r\nESPN. 25 September 2017.", "Chavez, Chris. \"Raiders Staffers Cover Marshawn Lynch As He Sits During National Anthem.\"\r\nSports Illustrated. 1 October 2017.", "Stiles, Adam. \"Derek Carr has back injury, will miss 2-6 weeks.\"\r\nSB Nation. 2 October 2017.", "Sports Illustrated. \"Raiders QB Derek Carr Expected to Miss Six to Eight Weeks After Surgery.\"\r\n24 December 2016.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]