["Texas Attorney General Ken Paxton has sued four states that went for President-elect Joe Biden on grounds their election procedures violated the law, and he’s asking the U.S. Supreme Court to block those states from voting in the electoral college.", "Legal experts have characterized the lawsuit as a long shot — the court has yet to take up any election disputes. And on Dec. 8, the Supreme Court rejected an effort led by a Republican congressman to reverse Pennsylvania’s certification of Biden’s victory there.", "But on Facebook, the high court has agreed to hear the Texas case against states including Pennsylvania.", "\"JUST IN,\" one Facebook post said. \"The Supreme has decided to take up the Texas case. Let’s give Texas a YEEHAW!\"", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "On Dec. 8, the court ordered Pennsylvania and the other states named in the Texas suit — Michigan, Wisconsin and Georgia — to respond by Dec. 10.", "But that’s not the same as accepting the case. The court also set a deadline for Pennsylvania to respond in the case it rejected on Dec. 8.", "\"It’s not unusual,\" Dale Carpenter, a constitutional law professor at Southern Methodist University, told a CBS News affiliate in Texas. \"I don’t think it indicates anything very important.\"", "Steve Vladeck, a law professor at the University of Texas at Austin, tweeted on Dec. 8: \"The Court is *never* going to hear this one.\"", "The next day, he tweeted a quick fact-check of misinformation related to recent election lawsuits.", "\"SCOTUS hasn’t voted 6-3 to do *anything* election-related,\" he said. \"SCOTUS hasn’t ‘agreed to hear’ the Texas case.\"", "We rate this Facebook post False.", "This fact check is available at IFCN’s 2020 US Elections #Chatbot on WhatsApp. Click here, for more.", "Facebook post, Dec. 8, 2020", "Donald Trump tweet, Dec. 9, 2020", "The Texas Tribune, In new lawsuit, Texas contests election results in Georgia, Wisconsin, Michigan, Pennsylvania, Dec. 8, 2020", "The Associated Press, High court rejects GOP bid to halt Pennsylvania win, Dec. 8, 2020", "U.S. News & World Report, Long-shot Texas case urges Supreme Court to act on Trump election challenges, Dec. 8, 2020", "CBS DFW, Supreme Court orders reply to Texas AG Ken Paxton’s election lawsuit by 3pm Thursday, Dec. 9, 2020", "Steve Vladeck tweet, Dec. 8, 2020", "Steve Vladeck tweet, Dec. 9, 2020", "USA Today, Texas AG asks Supreme Court to overturn Trump’s losses in key states. Don’t hold your breath, Dec. 8, 2020", "USA Today, U.S. Supreme Court updates schedule, could hear Rep. Mike Kelly’s emergency request sooner, Dec. 4, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]