["About this rating", "In March 2016, a message reporting that a Nylabone brand pet product had caused a dog to have a seizure began circulating on Facebook, with the earliest iteration of the claim we could find having been posted on 8 March 2016 by Samantha Love:", "FYI. To all my friends and family who have a pet. This weekend A pet friend bought a couple bones at \"pets mart\" for Guido and Smudge. The name of the bone is \"NYLABONE\" chicken flavored. Smudge had a seizure while chewing the bone. He is two. Her sister googled the Nylabone. One of the side effects is they are toxic and can cause seizures. Your pet can not digest the bone if they swallow it. And you'll need to have it surgically removed. There is a push to get them pulled off the shelves. So pet owners beware. I'm buying only natural bones and horns & antlers to chew.", "Although Samantha Love's dog may have suffered a seizure while chewing on a Nylabone product, there's no evidence proving a cause-and-effect relationship between those two phenomena.  Love apparently based her claim on the notion that \"one of the side effects\" of Nylabones is that \"they are toxic and can cause seizures,\" information she supposedly found through a Google search but for which she provided no relevant links. We attempted to replicate Love's search but couldn't find any source claiming that Nylabones were toxic or that one of their side effects was seizures.", "While Love did not identify a specific product in her Facebook post, it's likely that she was referring to Nylabone's \"FlexiChew Bone — Chicken\" item. This product is made from \"Inert Soft Thermoplastic Polymer\" and \"Chicken Flavor\" and comes with a warning that it is \"not recommended for strong chewers.\"", "On 11 March 2016, Nylabone released a statement concerning the \"misinformation\" about their product line that was circulating on Facebook:", "Recently there has been some misinformation about the safety of our products circulating on Facebook. This negative information is incorrect, and we would like to set the record straight.", "All of our products are made from Non-Toxic, Pet-Safe materials and are designed for the specific chewing style and size of your dog. From gentle teething puppies to extreme power chewers, Nylabone has a chew for every dog.", "At Nylabone, we pride ourselves on being the leader in responsible animal care for over 50 years.", "Nylabone stands for quality in chews and treats. It is our goal to exceed consumer expectations for our products in innovation, safety, quality, and the enjoyment of the people and pets we serve.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]