["The video was shared on Facebook here on February 22, 2021.", "“This is the landing scene of ‘Perseverance Rover’ launched by NASA. What a great scene. It landed yesterday. Let’s enjoy together, friends,” reads the post’s Korean-language claim.", "The post circulated online just days after NASA’s Perseverance Rover successfully landed on Mars on February 18, 2021.", "The post links to a YouTube video that was also shared alongside a similar claim on Facebook here, here and here.", "The claim is false.", "The video shared in the posts in fact shows computer generated imagery from “Roving Mars”, an IMAX documentary released in 2006.", "The clip, published on YouTube here on March 1, 2011, is titled: “How to Get to Mars. Very Cool! HD.”", "The video’s description reads: “‘How To get to Mars’ is a clip from the IMAX documentary \"Roving Mars\" from 2006. This is an edited short version.", "“A little CLARIFICATION is needed! This is ANIMATION ment [sic] to ILLUSTRATE how NASA landed the two robots Spirit and Opportunity on Mars back in 2003/04.”", "“Roving Mars” is a 40-minute documentary that was released in January 2006. The film details the development and launch in 2003 of two NASA Mars rovers called Spirit and Opportunity, according to online database IMDb.", "The film largely uses computer generated animation based on images and data from the rovers to tell the story of the mission, as The Boston Globe noted here on January 25, 2009. NASA details the journey of Spirit and Opportunity on its website here.", "Below is a screenshot comparison of the YouTube video shared in the misleading posts (L) and the “Roving Mars” trailer published on IMDb (R):", "The film's official trailer can be seen on YouTube below:", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]