["A video clip wherein a person in uniform has held a young girl in his arms has been circulated on social media with the narrative that the child can only speak Tamil, and was found at the Nagpur railway station.", "This child speaks only tamil found in Nagpur Raliway station, now with station police. Pls share with all your groups until she reaches safely in her beloved parents good hands. Please try your best", "Posted by Venket Mani on Wednesday, December 12, 2018", "As can be seen from the above post, this video with the accompanying message has been floating on social media since 2018. The above post has been shared a whopping 34,000 times so far, and viewed in excess of 675,000 times. The video has been re-circulated now, on Facebook and YouTube with the identical claim. On YouTube, the video has been posted with the message in Tamil.", "The uniformed person in the video identifies himself as Sarfaraz Aman from Khwaja Ajmer Nagari thana. Through the video, he informs that this child is very young and cannot even tell her name. He further appeals for the video to be shared, so that it may reach her parents or guardians.", "From the information available in the video itself, it is apparent that the video pertains not to India, but most likely Pakistan. This is due to the uniform donned by the person in the video, which resembles the uniform of police in parts of Pakistan. Alt News took a frame from the video and reverse-searched it with the information from the video. The result threw up a YouTube link. The video had been posted in December 2018 with the caption, ‘Missing Child found by Khawaja Ajmer Nagri Police Karachi December 2018’.", "Alt News also found posts from December 2018 by Pakistani users, who had uploaded this video with the message in Urdu. In addition, Alt News searched ‘Khwaja Ajmer Nagari‘ on Google Maps, which confirmed that this locality is indeed in Karachi, Sindh. Furthermore, the uniform worn by the policeman does indeed pertain to Sindh, although the Sindh police uniform was changed recently.", "In conclusion, a video from Karachi, Pakistan which appeared online in December 2018, has been shared with the false claim that a Tamil girl child was found at the Nagpur railway station.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]