["About this rating", "The concept of \"magical thinking\" is perhaps best exemplified by what we commonly call superstition, as described by Scientific American:", "When it comes to superstitions, social scientists have generally agreed on one thing: they are fundamentally irrational. “Magical thinking” (as it has been called) is defined as the belief that an object, action or circumstance not logically related to a course of events can influence its outcome. In other words, stepping on a crack cannot, given what we know about the principles of causal relations, have any direct effect on the probability of your mother breaking her back. Those who live in fear of such a tragedy are engaging in magical thought and behaving irrationally.", "A statement about the yin and yang of magical thinking is frequently shared online, attributed to either author Lewis Carroll (the pen name of Charles Dodgson) or the most famous of his literary works, \"Alice in Wonderland\" (i.e., \"Alice's Adventures in Wonderland\"):", "However, the phrase \"Everyone wants a magical solution for their problem, and everyone refuses to believe in magic\" does not appear in any of Carroll/Dodgson's published works (either literary or non-fiction) or papers, nor was it contemporaneously recorded as something he once said. This quote actually stemmed from a Carroll-inspired character who appeared in a modern television series.", "\"Once Upon a Time,\" which originally aired on ABC from 2011 to 2018, was a fantasy series about \"a young woman [who] is drawn to a small Maine town and discovers that it's filled with elements of the fairy tale world.\" One of the characters who popped up in that series, Jefferson, was clearly based on Carroll's famous Mad Hatter (from his \"Alice\" books), and in the episode \"Hat Trick\" (S1E17, original airdate March 25, 2012), Jefferson delivered the line in question during a debate with Emma Swan about the difference between reality and imagination:", "Valdesolo, Piercarlo.   \"Why 'Magical Thinking' Works for Some People.\"\r\n    Scientific American.   19 October 2010.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]