["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Patrick Morrisey speaks to reporters on Nov. 1, 2018. (AP)", "EDITOR’S NOTE, Feb. 7, 2019: This version has been updated to reflect evidence and comments offered by Morrisey’s office after our initial publication. The rating has been changed from Half True to Mostly True. We have archived the original article here.", "West Virginia Attorney General Patrick Morrisey, a Republican, recently took to Facebook to criticize the Affordable Care Act, the landmark law also known as Obamacare. Morrisey is seeking to overturn the law through a suit filed by a number of Republican attorneys general.", "In his Jan. 2 post, Morrisey said the country must move on from the law because of \"skyrocketing premiums\" and \"corrupt subsidies.\" He said he would pursue other ways to help \"people with preexisting conditions.\"", "Morrisey sought to bolster his claim by citing how much premiums have increased in West Virginia.", "\"We need affordable, high quality, health care choices,\" he wrote. \"Obamacare isn’t doing that. Premiums have gone up 160 percent in West Virginia in 4 yrs — bankrupting families & destroying choice.\"", "Just how much have premiums gone up in West Virginia in the last four years? We took a closer look. Premiums have gone up, but not by as much as Morrisey said.", "Morrisey’s office pointed to a document published on May 23, 2017, by the federal Department of Health and Human Services. The document broke down premiums by state between 2013 and 2017.", "A table in the report said that premiums in West Virginia rose from $261 in 2013 to $702 in 2017, a 169 percent increase. By this measure, Morrisey actually understated the increase slightly.", "But there are two caveats to note.", "First, the period 2013 to 2017 is not the most obvious interpretation of \"premiums have gone up 160 percent in West Virginia in 4 yrs,\" because data also exists for 2018 and 2019.", "And second, the choice of 2013 data adds a complication, said Linda Blumberg, a fellow at the Urban Institute specializing in health care policy and the Affordable Care Act.", "That’s because Obamacare mandates -- such as barring denials of applications and requiring certain \"essential benefits\" -- hadn’t kicked in yet. Regulations changed in 2014, making it difficult to compare 2013 with 2017.", "\"The 2013 plans, on average, had lower actuarial value, covered fewer benefits, and excluded significant segments of the population -- those with significant health problems or risk of health problems,\" Blumberg said. Because of this, \"the premium comparisons are inappropriate across the periods, unless of course, you want average in the infinite premiums charged to people denied coverage outright, or the very high premiums charged to people who decided the plans offered were not worth the high prices charged to them.\"", "Morrisey’s office also provided updated data showing that the premiums for West Virginia using this method rose from $702 in 2017 to $855 in 2018. That demonstrates continued premium hikes -- a 228 percent increase over 2013 -- but in addition to using the problematic base year of 2013, this covers a span of five years, not four, as Morrisey had said.", "So what does the data look like over the most recent four years, from 2015 to 2019? This is an apples-to-apples comparison because the Obamacare mandates were in place all four years.", "The Kaiser Family Foundation, a nonprofit that focuses on health policy, tracks data on Affordable Care Act premiums by state. According to the foundation, the average benchmark premiums for West Virginia in the online insurance marketplace have risen from $289 in 2015 to $596 in 2019.", "That’s an increase of 106 percent.", "Using this measure, premiums did rise over the period Morrisey mentioned, though not quite as high as the 2013-to-2017 premiums did.", "Blumberg offered a similar figure -- 94 percent -- for the same period, using an online tool that tracks the state-by-state change in the lowest-priced \"silver\" premium, a mid-range category of coverage.", "Blumberg added that the 2018 and 2019 premiums experienced an extra bump because Morrisey’s fellow Republicans in the Trump administration stopped paying for cost-sharing subsidies directly, meaning that insurers have had to work those costs into their premiums.", "Morrisey said that Obamacare premiums \"have gone up 160 percent in West Virginia in 4 yrs.\"", "The source cited by Morrisey’s office offered a figure close to 160 percent, but it used data for 2013 to 2017, which is not the most recent data. Also, it’s important to know that there was a change in the regulatory rules in 2014.", "However, the actual rise in West Virginia premiums over the most recent four-year period, while not quite as fast as Morrisey said in his Facebook post, has been substantial. We rate the statement Mostly True.", "Patrick Morrisey, post on Facebook, Jan. 2, 2019", "Kaiser Family Foundation, Marketplace Average Benchmark Premiums, 2019", "Email Interviews with Linda Blumberg, Institute Fellow at the Urban Institute, Jan. 17 and Feb. 6, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]