["Supporters fill the street as former Vice President Joe Biden speaks during a stop in Philadelphia on Nov. 3, 2020. (AP)", "Real Clear Politics never called Pennsylvania for Biden. The political news site has not projected a winner of the election.", "Every major TV network and the Associated Press have called Pennsylvania for Biden. That puts him past the threshold of 270 electoral votes needed to win the election.", "Every major television network and the Associated Press have said Joe Biden is the projected winner of the presidential election. But on social media, some say the race is still too close to call.", "\"Joe Biden is no longer the President-elect according to RealClearPolitics,\" says text in a Nov. 9 Instagram post, which is a screenshot of a tweet from Samantha Marika, a conservative internet personality and conspiracy theorist.", "On Facebook, some users shared electoral maps to support their claims that Biden has not yet clinched the 270 electoral votes needed to win the White House. Others said President Donald Trump made up ground in battleground states where Biden was leading, such as Arizona, Georgia and Pennsylvania.", "(Screenshot from Facebook)", "\"This just in: Biden loses Pres-Elect Status, as Pennsylvania is now a toss up,\" says a Nov. 10 post. \"CNN changes GA and AZ back to too close to call.\"", "The posts were flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook, which owns Instagram.)", "In a Nov. 9 tweet, Rudy Giuliani, Trump’s personal lawyer, amplified the claim that Real Clear Politics \"took PA away from Biden and made it a toss up.\" So we wanted to take a closer look.", "The posts are inaccurate — Real Clear Politics never called Pennsylvania for Biden. The political news site still has several battleground states as toss-ups and has not projected a winner.", "In a Nov. 9 tweet, Tom Bevan, co-founder and president of Real Clear Politics, said Giuliani’s claim was false.", "\"We never called Pennsylvania, and nothing has changed,\" he said.", "Many of the Facebook and Instagram posts we found cite an article from TrendingPolitics.com, a conservative website that has made unsupported claims in the past. The site reported Nov. 9 that Real Clear Politics had \"REMOVED Pennsylvania from Biden's electoral vote total,\" but it later updated its story to indicate that’s not the case.", "Every major TV network and the AP have called Pennsylvania for Biden, which puts him past the threshold needed to win the election. The result will be finalized Jan. 6 when Congress counts the electoral votes.", "As of Nov. 10, only Fox News and the AP had called Arizona for Biden, despite what some social media posts say. The major networks and the AP have not called Georgia, where a recount is likely. CNN did not \"uncall\" Arizona or Georgia.", "Even without those two states, Biden would have enough electoral votes to win the election. He is the president-elect.", "The Instagram post is inaccurate. We rate it False.", "ABC News, Election 2020 Results and Live Updates, accessed Nov. 10, 2020", "The Atlanta Journal-Constitution, \"LIVE UPDATES: Ga. winding down vote count before audit, likely recount,\" Nov. 10, 2020", "CBS News, Presidential Results, accessed Nov. 10, 2020", "CNN, PRESIDENTIAL RESULTS, accessed Nov. 10, 2020", "Decision Desk HQ, 2020 General Elections, accessed Nov. 10, 2020", "Facebook post, Nov. 9, 2020", "Facebook post, Nov. 9, 2020", "Facebook post, Nov. 10, 2020", "Facebook post, Nov. 10, 2020", "Facebook post, Nov. 10, 2020", "Fox News, Presidential Election Results, accessed Nov. 10, 2020", "Instagram post, Nov. 9, 2020", "Instagram post, Nov. 9, 2020", "NBC News, U.S. Presidential Election Results 2020: Biden wins, accessed Nov. 10, 2020", "The New York Times, \"Tracking Which News Outlets Have Called the Presidential Race in Each State,\" Nov. 3, 2020", "PolitiFact, \"Disinformation targets Republicans who criticize Trump or support the impeachment inquiry,\" Nov. 22, 2019", "PolitiFact, \"The media have called the presidential race for Joe Biden. Here's what's next,\" Nov. 7, 2020", "PolitiFact, \"No, House Democrats did not sneak long recess into HEROES Act,\" May 22, 2020", "Real Clear Politics, 2020 Electoral College Map, accessed Nov. 10, 2020", "TrendingPolitics.com, \"BREAKING: RealClearPolitics Removes Pennsylvania From Biden's Electoral Total,\" Nov. 9, 2020", "Tweet from Rudy Giuiani, Nov. 9, 2020", "Tweet from Samantha Marika, Nov. 9, 2020", "Tweet from Tom Bevan, Nov. 9, 2020", "The Washington Post, \"First CNN, then within minutes, most other news organizations called the race for Biden,\" Nov. 7, 2020", "The Wayback Machine, accessed Nov. 10, 2020", "WUSA, 2020 Balance of Power, accessed Nov. 10, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]