["About this rating", "After health care workers and nursing home residents, senior citizens older than 65 will get the vaccine regardless of residency status, according to official statements. This would include elderly Canadians visiting Florida. However, there is confusion in some regions of Florida where hospitals are asking for proof of residency. Canada is slower than the U.S. in immunizations but has ordered enough of the vaccine for all of its population.", "The COVID-19 vaccine will be rolled out to senior citizens after other priority groups have received their doses. Canadian visitors who are not seniors will have to wait like everyone else for a rollout that could be months into 2021.", "It is unknown whether vaccines are being given to Canadian seniors for the purposes of increasing tourism. When asked if full-time residents would be given priority over snowbirds, Florida Gov. Ron DeSantis did not offer a clear answer. It is still unclear whether there is any sign that Canadian travelers to Florida can hope to get a vaccine quicker there.", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "As the COVID-19 vaccine rolled out in the United States and Canada in late 2020, many were wondering how it would impact tourism and travel, particularly the yearly trend of Canadians who travel to U.S. states for the winter months. Snowbirds, as they are commonly referred to, are people who migrate from colder locales across North America to warmer ones, and for many, the U.S. state of Florida is a prime destination.", "Some snowbirds are retirees who have reconsidered travel in 2020 because of the coronavirus pandemic, which is hitting the tourism industry in the U.S. hard.", "We received questions from Snopes readers asking if Florida was giving the vaccine to Canadians specifically to revive the tourism industry. We looked into the claim and found the answer was complicated.", "First in line are front-line health care workers and long-term care residents including those in nursing homes. After this round, vaccinations would be made available to all seniors older than 65 years of age.", "This includes seniors who are visiting, even Canadians. According to the Centers for Disease Control and Prevention’s (CDC) “Florida Interim COVID-19 Vaccination Plan,” one does not have to be a full-time Floridian to receive the vaccine in Florida: “The goal of the Florida COVID-19 Mass Vaccination plan is to immunize all Floridians and visitors who choose to be vaccinated.”", "But in some parts of Florida, there has been confusion about the residency status of people receiving the vaccine. According to a Tampa Bay Times report, some hospitals in Miami-Dade and Broward counties were requiring proof of local residency, at odds with the state directive. Jared Moskowitz, director of the Florida Division of Emergency Management, told the Miami Herald that there was no residency requirement by the state and they would notify hospitals of that rule.", "But out-of-state seniors, including Canadian snowbirds, are still weighing their options and want more clarity. Some of them are basing their decision to travel on where they will have a higher likelihood of getting the vaccine. Media reports highlighted Canadian snowbirds who reside in Florida for the winter and are also planning to get the vaccine when it becomes available to them.", "A lot of these decisions could be based on the availability of vaccines in Canada, where seniors will be prioritized in the first phase of immunizations alongside healthcare workers, residents and staff in longterm care homes, and adults in indigenous communities. The Canadian government has been criticized for its slow rollout, despite having ordered enough vaccines for the entire population. According to data from Oxford University’s “Our World in Data,” as of late December 2020, Canada had only administered 0.19 vaccination doses per 100 people in the total population (this does not measure the number of people who were vaccinated as each vaccination requires two doses). The U.S. by comparison has administered 0.64 doses per 100 people, even though authorities here are also being criticized for falling short of their vaccination goals.", "Canada expects the first 6 million doses of the vaccines from Pfizer and Moderna Inc. to arrive in the first quarter of 2021, enough for 3 million of the 38 million population. But general immunization for all 38 million Canadians will begin in April 2021 with a goal of 100% coverage by the end of the third quarter. Canada has ordered enough vaccines for a population four times its size, putting it ahead of most countries in the world. By August 2020, the U.S. by comparison had secured 800 million doses of at least six vaccines in development, just enough to vaccinate its population of 330 million.", "The numbers of infected could be another factor. There have been 1,292,244 cases and 21,408 deaths from COVID-19 reported in Florida since the beginning of the pandemic. There have been at least 565,500 confirmed cases of coronavirus in Canada in comparison, and at least 15,378 deaths from COVID-19 as of late December 2020.", "Travel across the U.S.-Canada border has also been closed for non-essential purposes and these restrictions were extended to Jan. 21, 2021. Canadians can still fly into the U.S. though not all Americans can fly into Canada.", "But whether any of these factors are encouraging Canadians to travel to the U.S. remains to be seen and snowbirds are divided. An NBC Boston report describes the loss of snowbirds to the U.S. tourism industry, particularly from Canada. But another CBC report describes how snowbirds are still flocking south, determined to escape a Canadian winter. The Canadian Snowbird Association estimates that around 30% of its more than 110,000 members will head to the United States Sunbelt which includes Florida this winter, despite soaring COVID-19 cases in the country.", "A survey of 1,000 people by the Travel Health Insurance Association of Canada (THIA) suggested that U.S. travel was falling out of favor with Canadians on account of the pandemic. Some 79% of Canadians and 90% of seniors surveyed said they would not travel to the U.S. this winter even if their travel health insurance policy provided coverage for COVID-19.", "Travel insurance providers also stopped selling COVID-19 medical coverage in March 2020, when Canada closed its borders and advised against non-essential travel abroad. But a few months later, several insurance providers resumed coverage for travel along with their regular insurance plans. The added insurance coverage for COVID-19 influenced some snowbirds from Canada to make the trip to Florida for this winter.", "In December 2020, Florida Gov. Ron DeSantis said that Florida would have enough vaccines for most if not all seniors, however, he did not offer a specific timeline. If 75% of the state's 3.12 million seniors over 70 want it, he said, “we will probably have enough vaccine over the next six weeks for that but not 4 million by February 1.” Based on this information and the fact that the U.S. is administering doses at a faster rate than Canada, it is possible but uncertain that Florida's vaccine rollout for some seniors will be quicker than parts of Canada where vaccinations have been slowed down due to a range of factors. But this vaccination trend may vary across Canada.", "Regardless of whether a vaccine or warmer climates are motivating Canadians to travel to the U.S., it is not clear if Florida is using the lure of a vaccine to attract more tourists. Based on the state's vaccination rollout rules, senior non-residents will be able to get the vaccine, but will still have to wait their turn like senior residents of the state.", "But will the state prioritize residents over the snowbirds? When asked if full-time residents over 65 would have priority over snowbirds, DeSantis did not have a clear answer. “Well… we have not necessarily done that, I mean, we’ll see,” he said.", "The state of Florida does not seem to be making an effort to promote vaccines as a reason to visit. Visit Florida, a tourism corporation funded by the government that is also described as Florida's official tourism agency, has a COVID-19 Travel Safety Information page that states: \"There is currently no vaccine to prevent COVID-19. The best way to prevent illness is to avoid being exposed to the virus.\"", "A range of factors may influence Canadians' travel into Florida, including the possibility of getting a vaccine, although it appears they will have to wait in line like everyone else and the rollout will prioritize health care workers first. Whether the possibility of getting a vaccine is also being pushed to increase visitors is unknown, especially since DeSantis did not have a real answer to whether snowbirds were at the back of the line. Given all that we know, we rate this claim as a “Mixture.”", "Nur Nasreen Ibrahim is a reporter with experience working in television, international news coverage, fact checking, and creative writing.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]