["About this rating", "In the early morning hours of 2 July 1937, Amelia Earhart departed from Papua New Guinea’s Lae Airfield on a course for a tiny mound in the Pacific Ocean named Howland Island. Waiting for them in deeper waters nearby was a United States Coast Guard Cutter named the Itasca, which was there to provide navigational support for what was intended to be Earhart’s most risky refuel in the middle of the ocean.", "In a mystery that continues to provoke impassioned debate to this day, Earhart never arrived at Howland Island, and the wreckage of her plane, and the remains of both Earhart and her navigator Fred Noonan have never conclusively been located, despite a large-scale search in the area of Howland Island by the Itasca and others in the weeks following her disappearance. Earhart was declared dead in absentia two years later.", "Howland or Nikumaroro Island?", "The most straightforward and, according to many experts, most likely explanation for her death is that Earhart ran out of fuel during an ultimately unsuccessful search for Howland Island. Fuel analysis performed by historians and scientists suggest that Earhart probably would have had very little extra fuel in the event of navigational problems by the time she was to have arrived at Howland Island, and the few radio transmissions between the Itasca and Earhart that went through suggest she was approaching its general location, as described by Smithsonian Magazine:", "The Itasca’s operators heard her transmissions, growing stronger as she approached Howland Island shortly after sunrise. At one point her signal was so strong the ship’s radio operator ran to the deck to look for her overhead. But he saw only empty sky, and she, it seems, just clouds and empty ocean. Near the end, her voice was becoming strained; she sounded “frantic,” according to the Itasca’s commanding officer. “We must be on you but cannot see you,” she radioed. “Gas is running low.”", "Competing theories with varying degrees of plausibility (some of which, such as her being captured and held by the Japanese as a POW, are already conclusively debunked) have been offered ever since.", "One group in particular has been remarkably successful in promoting their own theory of the incident to the mystery-loving public — The International Group for Historic Aircraft Recovery (TIGHAR), led by aviation accident investigator Ric Gillespie. The group is single-handedly responsible for the bulk of viral Amelia Earhart headlines over the past decade.", "TIGHAR’s hypothesis rests on the assumption that bones recovered from an island about 350 nautical miles south of Howland named Nikumaroro Island (but known at the time as Gardner Island), belong to Earhart. Throughout the years, a steady stream of artifacts found by TIGHAR and potentially associated with those human remains on the island have provided tantalizing suggestions for people invested in the theory that Earhart ended up somewhere else on land.", "Two of the main hurdles undermining widespread support for the TIGHAR explanation, however, are the fact that bones found on this island — discovered around 1940 — were originally described by a medical investigator as belonging to a stocky Polynesian male (not a tallish slim female of European descent like Earhart), and that nobody knows, presently, where the Nikumaroro Bones are.", "This means that everyone and anyone discussing those bones is relying on the same 1941 notes of two doctors’ examination of the find to make arguments about who they may belong to. This context is important when considering the most recent headlines inspired by TIGHAR’s work, such as this from the Daily Mail:", "Is this the final resting place of Amelia Earhart? Bones discovered on Pacific island are '99% certain to be hers' says scientist.", "The Nikumaroro Bones", "In early 1940, a local on the island of Nikumaroro came across a skull and a bottle. By September 1940, word of the find had made its way to Gerald \"Irish\" Gallagher, the first officer-in-charge of the Phoenix Islands Settlement Scheme — a failed British effort to colonize a series of largely uninhabited islands, including that of Nikumaroro, where he was stationed. Gallagher sent a telegram to his superiors regarding the find, suggesting that they could be the bones of Amelia Earhart and that they should keep the find quiet.", "Gallagher noted in this telegram that additional bones had been located, along with a women’s size 10 shoe and a sextant box. After a prolonged back and forth between British officials, the bones were shipped to Suva, Fiji and analyzed by two individuals — Lindsay Isaac and D.W. Hoodless.", "Isaac, a British medical officer, performed the first inspection on route to Fiji in the port of Tarawa on 11 February 1941. Following his analysis, Isaac sent Gallagher a telegram informing him that it was his view that the bones likely belonged to an elderly man of Polynesian descent — information that Gallagher described as anticlimactic.", "Hoodless, the principal of the Central Medical School in Suva, Fiji, performed a second inspection. Much of our information about the Nikumaroro Bones comes from a 4 April 1941 report from Hoodless to an officer of the British Western Pacific Territories. Hoodless, using an analysis of the bone’s lengths, concluded that the bones likely belonged to a 45- to 55-year-old male with a height of around five and a half feet. Hoodless speculated the bones could have belonged either a Polynesian or a European person; he could not be sure.", "As a result of these conclusions, the bones (which were lost after Hoodless’ analysis) were largely forgotten until 1998, when TIGHAR-associated researchers presented their theory at a meeting of the American Anthropological Association that the bones had been described incorrectly by Hoodless. The conclusion, made by forensic anthropologists Karen Burns and Richard Jantz using a reinterpretation of the information contained in the telegram, was that the bones could actually have belonged to someone who fits the Amelia Earhart profile:", "Based on the information now in hand, [forensic anthropologists Richard] Jantz and [Karen] Burns both concluded that the remains found on Nikumaroro in 1939-40 represented an individual who was: (1) More likely female than male (2) More likely white than Polynesian or other Pacific Islander (3) Most likely between 5'5\" and 5'9\" in height.", "This finding, which remains controversial, renewed interest in the Nikumaroro theory and has been the basis for numerous expeditions to the island to search for other artifacts that could bolster their interpretation. The group has gained exposure through press releases and from documentary film crews from media outlets that support their work.", "The 2018 paper that generated the viral claims that a scientist is \"99% certain\" that the Nikumaroro bones belonged to Earhart was written by Jantz, an author of the original 1998 paper. His 2018 paper is primarily a response to a 2015 critique of their work which argued that their reasons for questioning the 1941 analysis of the bones were insufficient.", "Scientists are \"99% Certain\" the Nikumaroro Bones Belong to Earhart", "In his 2018 paper, which like many of their finds came with a TIGHAR press release describing the find as essentially conclusive, Jantz reiterated his argument from the 1998 presentation that Hoodless could not (and did not) adequately analyze the bones. In this most recent paper, Jantz appears even more confident than his 1998 presentation, arguing that modern methods produce results that suggest a 99 percent certainty that the bones belonged to Earhart:", "When Hoodless conducted his analysis, forensic osteology was not yet a well-developed discipline. Evaluating his methods with reference to modern data and methods suggests that they were inadequate to his task; this is particularly the case with his sexing method. Therefore his sex assessment of the Nikumaroro bones cannot be assumed to be correct.", "To address the question of whether the Nikumaroro bones match estimates of Amelia Earhart’s bone lengths, I compare Earhart’s bone lengths with the Nikumaroro bones using Mahalanobis distance. This analysis reveals that Earhart is more similar to the Nikumaroro bones than 99% of individuals in a large reference sample. This strongly supports the conclusion that the Nikumaroro bones belonged to Amelia Earhart.", "That nearly-complete certainty refers specifically to the kind of analysis Jantz performed, in which he compared the dimensions of the Nikumaroro bones to a pool of data which contained a random assortment of 2776 Euro-American individual’s skeletal measurements. \"If the bones do not belong to Amelia Earhart,\" he wrote, \"then they are from someone very similar to her. And, as we have seen, a random individual has a very low probability of possessing that degree of similarity.\"", "He reviewed photos of Amelia Earhart that allowed for estimates of the actual length of Earhart’s skeletal features, and he reviewed the methods employed by Hoodless, suggesting they were out of date and not a reasonable basis for Hoodless's conclusions about them. His analysis determined that Amelia Earhart is a better fit for the Nikumaroro Bones than 99 percent of the 2776 individuals contained in his dataset of Euro-American skeletal measurements. In an e-mail, Jantz told us:", "It comes down to the fact the Earhart's measurements are more similar to the [Nikumaroro] bones than 99% of the general population, as defined by my reference sample of Euro-Americans.", "Other forensic anthropologists believe Jantz’s methods make sense. In an e-mail, Bruce Anderson, an adjunct professor of forensic anthropology at the University of Arizona who also works for the Pima County Office of the Medical Examiner, described Jantz as \"the pre-eminent physical/forensic anthropologist in the US in terms of measurements of the human body,\" adding:", "Sex assessment from skeletal remains is one, if not the most common, error that has been routinely made by non-physical/forensic anthropologists. [...] If I were a betting man, I'd put my money on the interpretation forwarded by Richard Jantz.", "Kristina Killgrove, a biological anthropologist at the University of West Florida, told the BBC the methods are an interesting solution to a hard scientific problem, but that the certainty of the findings has been oversold:", "Dr. Jantz has done a great job with the information at hand, in an attempt to go further in solving this case. But I disagree with the conclusion that we should necessarily assume that these bones are Earhart's. [...]", "I think that he has tried to correlate these measurements very well, which is an interesting approach, but to me it's a lot of what-iffing. It's essentially gaming out the logical conclusion of a whole lot of different variables. So this isn't a positive identification as Jantz notes as well in his article.", "While Jantz’s work may suggest a higher similarity between the Nikumaroro Bones and Earhart’s dimensions than was previously assumed, it does not explain away any of the other significant challenges to the Nikumaroro hypothesis. Jantz acknowledged that there was a limit on how much information the 1941 notes could tell a researcher, but that he hoped his research would demonstrate that there are still avenues available to scientists hoping to shed light on the mystery:", "What I hope my paper does is show that scientific methods can be used to examine this mystery. I understand there is only so much that can be done with the meager evidence left by Dr. Hoodless, but more can be done, and I hope will be.", "No one knows whether the bones will ever be found. If so, the matter could be put to rest in short order. If not, then we should bring as much evidence to  bear on the question as we possibly can.", "Problems with the Nikumaroro Conclusion", "The TIGHAR hypothesis provides few specifics on how Earhart would have ended up 400 miles south of her intended target. A common approach for aviation navigators during this era, in the event that they were unable to get a visual on the island (which was the case), or to receive their bearing from the Itasca (which was also the case), is to intentionally fly toward the north or south of the the expected target before flying a north-south line that would presumably intersect with the target.", "Historians on all sides of the debate generally agree that Earhart was likely trying to communicate this plan in the final undisputed transmissions received by the Itasca between 8:43 and 8:55 A.M., in which she stated, \"We are on the line 157 337\" (a compass bearing) and then a garbled transmission that many have interpreted as “we are running on line north and south.”", "In TIGHAR’s view, Earhart would have been south of the island, attempting to find it by going northward briefly, before pointing south, hoping that they would find Howland, but committed to south because their 157 337 line could, in a worst case scenario, intersect with either Baker Island (a bit south of Howland) or the more distant Nikumaroro:", "She knows that Howland Island is somewhere on this 157/337 line, close enough for the Itasca to hear her radio calls, but that could be several hundred miles. What to do now? Turn left? Turn right? By happy coincidence, Howland is not the only island on the 157/337 line. [...]", "Of course, the island they want to reach, and hope to reach, is Howland – the only place in the entire Central Pacific where there is an airfield – but the fate to be avoided at all costs is running out of gas over the open ocean.", "The most reasonable course of action is obvious: fly northwestward (337°) along the line for a short way to see if Howland is nearby in that direction. If it is not, turn around and proceed southeastward (157°) until you come to an island.", "Critics of the theory, like science writer and Skeptoid podcast host Brian Dunning, argue that 1.) the clear radio transmissions received by the Itasca make it apparent she was quite close to Howland and 2.) that if she was close to Howland she would not have had anywhere near enough fuel to make it to Nikumaroro.", "Earhart had a 50 W radio transmitter and utilized the 3105 khz HF radio frequency to communicate voice messages to the Itasca. The distance such a signal could travel varies based on large number of variables including time of day, weather, altitude, atmospheric conditions, and even celestial factors. The clearest transmission received by the Itasca came in at 7:42 A.M., and it stated Earhart’s belief she was where she expected the island to be: \"We must be on you but cannot see you but gas is running low. Been unable to reach you by radio. We are flying at 1000 feet.\"", "Her voice at this point was quite clear, according to the Itasca’s chief radioman Leo G. Bellarts:", "We could hear her voice just as easy as I'm hearing yours right now and I'm deaf in one ear now. But I'll tell you, you could hear her voice all over the shack and even outside the shack. You know, real loud and clear.", "Theodore Rappaport is an expert in wireless communication and an engineering professor at New York University and is also an active amateur radio operator who communicates around the world using high frequencies (HF) close to those used by Earhart. He told us: \"It is possible that her transmission could have traveled for 1,000 to 2,000 miles or even more into darkness, or along the sunlight/darkness boundary, but the distance into the daylight direction would have been much smaller, on the order of 100-200 miles.\" If she was transmitting using voice modulation, he says, the distances would be only slightly smaller than if she was transmitting Morse code.", "This would suggest she was within 200 miles, probably closer, to Howland when their gas was \"running low.\" Indeed, the Coast Guard assumed based on their radio communication with her that she went down in a sector between 40 miles and 200 miles from Howland Island.", "Given the 7:42 A.M. time of her clearest transmission, however, it is possible that these transmissions could have traveled further, thanks to some funky day-night interactions in the ionosphere that can — under certain circumstances — happen along the \"grey line\" between night and day. \"Shortwave radio communications for 400 miles on a path either north or south of her plane could be doable at that time of day,” Rappaport told us.", "Putting Earhart more than 200 miles south of Howland would be a huge error for two experienced aviators, and it runs contrary to the initial Coast Guard/Navy assumption she went down north west of the island. If she was that far off course, however, you would then have to argue they had enough fuel to make it close to Nikumaroro. TIGHAR suggests that she would have had hours of fuel (contrary to Earhart’s 7:42 A.M. statement of running low) after abandoning their hypothesized northward search for Howland.", "Marie K. and Elgen Long, in their famous book Amelia Earhart: The Mystery Solved, argued — based on a number of technical factors — that such a scenario would be unlikely, as they would have been perilously low on fuel once they arrived at what they felt was their intended target based on their reconstruction of her flight (a scenario that TIGHAR disputes). And then, there are those supporting artifacts collected near the Nikumaroro Bones and by later TIGHAR expeditions. Despite numerous proclamations of certainty regarding their link to Earhart, many of the finds have later been called into question. The island itself sits near currents that would likely transport trash and other artifacts to the island, and there is evidence of earlier habitation in the region. Additionally, a shipwreck occurred there on 29 November 1929 in which eleven people died.", "The bones themselves, in addition to being described as belonging to a short male, were assumed by Isaac in 1941 to be so weathered as to have been exposed for 20 years (long before Earhart’s disappearance), an assertion that cannot be addressed or challenged by modern techniques without the bones themselves.", "A lot of variables would have to line up all at once for the TIGHAR hypothesis to work with the Coast Guard/Navy data, and it also bears mentioning that Naval aircraft searched Nikumaroro island for Earhart and Noonan on July 9th and found no signs of Earhart, her plane, or Noonan.", "Due to these complicating factors, Jerry Adler argued in Smithsonian Magazine that Earhart running out of fuel near Howland \"remains the simplest explanation, but for that very reason, has attracted derision from those who prefer their history complicated.\"", "The historical record provides far less conclusive evidence than TIGHAR suggests, and arguing that notes provided by a deceased doctor about bones lost since 1941 offer 99 percent certainty is something of an oversell.", "Therefore, we rank the claim as unproven. We don’t expect that to change any time soon, either.", "U.S. National Archives Catalog.   \"U.S. Navy Report of the Search for Amelia Earhart\"\r\n    31 July 1937.", "Butler, Susan.   “Will Mystery of Amelia Earhart Be Solved?”\r\n    CNN.   25 March 2012.", "Long, Marie K. et al.   Amelia Earhart: The Mystery Solved.\r\n    Simon and Schuster, 2000.   ISBN 0-743-20217-1.", "Adler, Jerry.   “Will the Search for Amelia Earhart Ever End?”\r\n    Smithsonian.   January 2015.", "McCurry, Justin, and Jamiles Lartey.   “Blogger Discredits Claim Amelia Earhart Was Taken Prisoner by Japan.”\r\n    The Guardian.   11 July 2017.", "Havis, Michael.   “Is This the Final Resting Place of Amelia Earhart?”\r\n    Daily Mail.   7 March 2018.", "Killgrove, Kristina.   “The Mysterious Disappearance of Amelia Earhart's Skeleton.”\r\n    Forbes.   2 November 2016.", "phoenixislands.org.   \"History of the Phoenix Islands.\"\r\n    Accessed 14 March 2017.", "tighar.org.   \"The Bones Files\"\r\n    Accessed 14 March 2017.", "tighar.org.   \"The Tarawa File\"\r\n    Accessed 14 March 2017.", "tighar.org.   \"Amelia Earhart’s Bones and Shoes?\"\r\n    5 December 1998.", "Cross, Pamela, J., Wright, Richard.   “The Nikumaroro Bones Identification Controversy: First-Hand Examination Versus Evaluation by Proxy — Amelia Earhart Found or Still Missing?”\r\n    Journal of Archaeological Science: Reports.   September 2015.", "Jantz, Richard L.   “Amelia Earhart and the Nikumaroro Bones: A 1941 Analysis Versus Modern Quantitative Techniques”\r\n    Forensic Anthropology.   January 2018.", "tighar.org.   \"The Earhart Project in a Nutshell\"\r\n    Accessed 14 March 2017.", "tighar.org.   \"Log Jam\"\r\n    October 1996.", "Dunning, Brian.   “Amelia Earhart Redux: Competing Networks, Competing Craziness.”\r\n    Skeptoid.com.   18 July 2017.", "Everette, Michael.   “A Technical Analysis of the Western Electric Radio Communications Equipment Installed on Board Lockheed Electra NR16020.”\r\n    tighar.org.   18 July 2017.", "tighar.org.   \"Itasca Radio Log. Position One, Smoothed Copy.\"\r\n    Accessed 14 March 2017.", "chasingearhart.com.   “KHAQQ Calling Itasca! A Conversation with Leo Bellarts (Part One).\"\r\n    2 December 2017.", "Young, Stephanie.   “Itasca & the search for Amelia Earhart.”\r\n    Coast Guard Compass.   2 July 2012.", "www.robkalmeijer.nl.   \"An Introduction to Gray-line Dxing.\"\r\n    Accessed 14 March 2017.", "Yuhas, Alan.   “Has Amelia Earhart's Plane Finally Been Found? Not So Fast.”\r\n    The Guardian.   30 October 2014.", "Correction [15 March 2018]: The dataset used by Richard Jantz for comparison purposes included the measurements of 2776 individuals. An earlier version incorrectly stated that number as 500.", "Correction [24 March 2018]: Corrected to reflect that the Nikumaroro bones were likely first identified in early 1940, that Issac's analysis of the bones occurred en route to Fiji, and that the report communicating Hoodless' analysis of the bones was not a telegram, but a typed document delivered by hand.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]