["About this rating", "In mid-January 2020, social media users shared a photograph of a mobile billboard with a critical message directed at U.S. Sen. Susan Collins, R-Maine. The truck appeared to be parked outside a Bangor mansion that renowned novelist Stephen King owns.\n\nThe house in the background of the photograph does indeed belong to King, and the author of such landmark horror stories as \"The Shining\" has been vocal in his criticism of Collins (he has previously supported Democratic candidates). But King did not hire the billboard-carrying truck, and confirmed in a message to Snopes that he had \"nothing to do with that truck.\"", "The billboards are the work of four progressive organizations — MoveOn, Need to Impeach, Public Citizen, and Daily Kos — and represent a $400,000 ad campaign targeting GOP senators in ongoing impeachment proceedings against Republican President Donald Trump. Per the Washington, D.C.-focused blog The Hill, the ads have focused on eight senators and have implored citizens to contact the senators to demand a fair trial:", "Daily Kos, MoveOn, Need to Impeach and Public Citizen are setting up digital ads, mobile billboards and field campaigns in Alaska, Arizona, Colorado, Iowa, Kentucky, Maine, North Carolina and Utah, according to a press release from the groups.", "These ads encourage people to contact their senators to demand a “fair impeachment trial” and to vote to convict President Trump. The groups' campaign specifically targets and names Sens. Lisa Murkowski (R-Alaska), Martha McSally (R-Ariz.), Cory Gardner (R-Colo.), Joni Ernst (R-Iowa), Mitch McConnell (R-Ky.), Susan Collins (R-Maine), Thom Tillis (R-N.C.) and Mitt Romney (R-Utah).", "Nick Berning, spokesman for MoveOn, confirmed that while the truck with the sign was indeed parked in Bangor near where both King's property and Collins' home are located, King had nothing to do with the campaign.", "Impeachment proceedings in the Senate commenced on Jan. 20, 2020, with acrimony over the rules of the process. The text on the billboards, which states, \"Trump broke the law ... don't help him cover it up. Vote to convict and remove,\" reflects an accusation from Democrats that Trump and his Republican supporters who hold a majority in the Senate are withholding incriminating evidence against the president.", "Trump was impeached by the U.S. House in December 2019 on two articles of impeachment, obstructing Congress and abuse of power. He is accused of using his office in an attempt to extract damaging information from Ukraine on a potential 2020 campaign rival by withholding crucial military aid.", "Coleman, Justine. \"Progressive Groups Target Eight GOP Senators in Ad Campaign Ahead of Impeachment Trial.\"\r\n  The Hill. 8 January 2020.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]