["About this rating", "In mid-March 2021, some Netflix account holders received a test warning message that reminded users not to share their accounts with those who live outside of their home.", "And the internet was not happy.", "The rollout of the Netflix test message was first reported on March 10 by technology data research publication GammaWire.", "“If you don’t live with the owner of this account, you need your own account to keep watching,” the warning read. According to photos shared to social media, users were given the option to verify their account by email or text message, or to “verify later.” If they weren’t able to verify their account, they were also offered the opportunity to sign up for a 30-day free trial.", "In an email to Snopes, Netflix confirmed that the test message was sent out to the profiles of some users, but did not disclose how many accounts were impacted.", "“This test is designed to help ensure that people using Netflix accounts are authorized to do so,” wrote a spokesperson for the streaming platform.", "According to the market and consumer data company Statista, Netflix had over 203 million global users — with the U.S. accounting for over 73 million accounts — at the end of 2020. But the streaming giant did not respond to our follow-up questions to determine whether the test was rolled out only to accounts in the U.S. and whether it was meant to signify a more permanent change to the platform. It is unclear whether a service-wide rollout will eventually restrict account holders from sharing passwords to those who live outside of their homes.", "If we hear back regarding those questions, we will update this post.", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]