["Freshman Del. Kathy Tran, D-Fairfax, sparked a national controversy last week after saying a bill she introduced would allow abortions in Virginia to nearly the time of birth.", "Tran made the comment during tough questioning from Republicans at a Jan. 28 hearing on her bill, which would have eased abortion restrictions in all phases of pregnancy.", "Video of her statement went viral, drawing criticism from President Donald Trump and partisan charges that Democrats were endorsing \"infanticide.\" Democrats accused the GOP of launching a election-year stunt. A confusing radio interview by Democratic Gov. Ralph Northam - an abortion rights defender - poured gasoline on the debate.", "Tran sought to calm things on Jan. 29 by posting an 87-second video on Twitter, saying she was \"surprised\" by the GOP reaction and that her bill would not have altered Virginia’s law on third-trimester abortions. Her video has received more than a million views.", "\"I want to be very clear about what’s currently allowed in Virginia law,\" she said. \"Right now, women are able to access an abortion in the later stages of the pregnancy under certain conditions with approval of medical doctors. I’ve done nothing to change that.\"", "We fact-checked whether her bill, which was killed, really would have done \"nothing to change\" Virginia’s late-term abortion laws. We found problems with Tran’s claim.", "Virginia allows third-trimester abortions in hospitals if three physicians certify that a continued pregnancy would \"likely\" kill the woman or \"substantially and irremediably\" impair her mental or physical health.", "Tran’s bill would have lowered the authorization from three physicians to one. That doctor would only have to certify that the pregnancy would damage a woman’s health. The \"substantial and irremediable\" threshold would have been repealed.", "Opponents say the bill would have made third trimester abortions accessible to women who simply changed their mind about having a child.", "Supporters of the measure say there’s no evidence that late-term abortions are sought by women who capriciously decide not to have their baby. Third trimester abortions, they say, occur in extraordinarily rare circumstances when the fetus has no chance to survive outside the womb. There have been no third-trimester abortions in Virginia during the last three years, according to data from the state’s Department of Health. The Richmond Times-Dispatch reported that since 2000, two third-trimester abortions have been reported to the department.", "Tran’s Response", "We asked Tran’s office for an explanation of her video statement. Rodrigo Velasquez, her senior legislative aide, sent us an email after conferring with the delegate.", "He wrote that Tran acknowledges her bill would have lowered, from three to one, the number of doctors needed to sign off on a third-trimester abortion. \"The intent of her statement was to explain that there would still need to be a medical reason to terminate the pregnancy as certified by a licensed medical doctor,\" Velasquez said.", "Addressing the harm threshold, he wrote, \"...the words ‘substantially and irremediably’ do not address specific conditions in medical terms. Therefore, the removal of this phrase likely would not change the practice of current law.\"", "Our ruling", "Tran, in a videoed tweet viewed over 1 million times, said she’s \"done nothing to change\" Virginia’s law on late-term abortions. That’s wrong.", "She introduced an unsuccessful bill that would have eased Virginia's abortion restrictions for all pregnancy stages. In the final trimester, state law requires three physicians to certify that a continued pregnancy would either kill a woman or \"substantially and irremediably\" damage her mental or physical health.", "Tran’s bill would have lowered the requirements to one physician certifying that the pregnancy would damage the woman’s mental or physical health - the \"substantial and irremediable\" test would have been repealed.", "Third-trimester abortions are extremely rare; Virginia records show two have been performed since 2000. But that doesn’t clear Tran. The words in her bill make it clear; she did seek to change late-term laws.", "We rate her statement False.", "Del. Katie Tran, Twitter video, Jan. 29, 2019.", "Tran, Comments to House Courts of Justice Subcommittee 4, Jan. 28, 2019 (1:45 mark).", "Email from Rodrigo Velasquez, senior legislative aide for Tran, Feb. 4, 2019.", "Code of Virginia, § 18.2-74, accessed Feb. 1, 2019.", "Legislative Information System, HB2491, accessed Feb. 1, 2019.", "Richmond Times-Dispatch, \"State logs zero cases of abortion during the 3rd term,\" Feb. 1, 2019.", "President Donald Trump, tweet, Jan. 31, 2019.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]