["By Saranac Hale Spencer", "Posted on August 28, 2020", "Posts circulating on social media this summer falsely claimed that Black Lives Matter activists were responsible for the beating of five elderly white people shown in the posts’ photos. But the pictures have been online for at least five years — and most early uses identify the photos as originating in South Africa.", "Social media posts that feed into the narrative that Black Lives Matter protesters are violent have been circulating, as policing practices and the deaths of Black Americans at the hands of police officers drew millions to demonstrations across the country this summer.", "Although most demonstrations have been peaceful, the social media posts feature five pictures of elderly people with severe bruises and other injuries with text that says: “Beat up by BLM a hate group.” Some versions include other text, such as, “Victims of your sweet, ‘peacefully protesting’ BLM groups…”", "All five of the pictures are actually from an assortment of similar photos that have been circulating online since at least 2015.", "They have mostly been used in posts over the years claiming that white farmers in South Africa are under attack, but some have also been used in posts claiming that immigrants in Europe are violent.", "One of the photos dates back to at least 2014, when it was used in an article on an Afrikaans news website. Using Google’s translation tool, we found that the story identified the woman shown as Anne Els, 75, and said that she had been attacked in her home near Bloemfontein, the capital city of Free State, South Africa.", "Another picture featured in the recent posts was online as far back at 2010 — three years before Black Lives Matter had formed. That picture was used on a blog that linked to another Afrikaans news website, which identified the woman as Renske Cowan, also 75. It said that she was attacked in her home near Johannesburg.", "Neither of those original Afrikaans news accounts says that the women were farmers, but their photos, along with the others, have been used for years in internet posts claiming that white South African farmers are under attack.", "Those posts started showing up after the South African Police Service stopped reporting statistics on farm attacks and murders in 2008. A 2018 policy brief from the Institute for Security Studies explained that claims of “white genocide” grew following the change in police reporting. The brief stated that it’s difficult to assess the situation without official statistics, but that “[f]arm attacks and farm murders have increased in recent years in line with the general upward trend in South Africa’s serious and violent crimes.”", "That finding has been noted in U.S. Department of State reports on human rights in South Africa consistently since 2018.", "So, it’s unclear what the context is for each of the five photos included in the posts. But we know that they don’t show anyone who was hurt in this summer’s protests, since they’ve been around for years.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "Parker, Kim, et al. “Amid Protests, Majorities Across Racial and Ethnic Groups Express Support for the Black Lives Matter Movement.” Pew Research Center. 12 Jun 2020.", "Photo montage post. Vnnforum.com. 8 Apr 2015.", "Bruwer, Phillip. “Bloem-bejaarde vir selfoon en R150 aangerand.” Maroelamedia.co.za. 3 Oct 2014.", "“AFRIKANER PENSIONER BRUTALLY BEATEN IN GERMISTON.” Afrikaner-genocide-achives.blogspot.com. 28 Oct 2010.", "“Farm attacks in South Africa.” Defend-europe.com. 8 Jul 2020.", "Burger, Johan. Policy brief. “Violent crime on farms and smallholdings in South Africa.” The Institute for Security Studies. 2018.", "U.S. Department of State. South Africa 2019 Human Rights Report. Accessed 27 Aug 2020.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]