["About this rating", "On 29 September 2015, Reddit user jimmypork published the above image to r/funny in a thread titled \"Local school art project titled 'candlelight'\":", "Examples: [Collected via e-mail, October 2015]", "Saw the photo on Facebook with the following caption. Google is not telling me for sure if it is legit, and I’m tempted to think this is a study of Georgia O’Keefe paintings of “flowers”.", "When the teacher at a local elementary school asked her students to \"paint a candle flame\" ... It didn't turn out the way she had expected.", "In addition to its popularity on Reddit (where the image received thousands of upvotes), the image was shared on Facebook and Twitter, and at least two articles were inspired by the humorously suggestive image. Prior to its submission to Reddit, the image wasn't widely circulated on social media (and we were unable to find any previous iterations of the claim).", "The Reddit post carried no information other than the title labeling it a \"local school project titled 'candlelight,'\" lacking even a country to which the purported assignment was \"local.\" While nothing in the photograph specifically indicates it was captured in a school, the image similarly yielded no clues indicating it wasn't an elementary schoolkids' painting project gone slightly awry. Based on the scant information available, the most apparent observation that might be made was that the artwork lacked the typical construction paper mounting and block-lettered name or signature commonly seen in school art displays:", "The original poster didn't return to the thread to offer any additional information and was likely not a first-person source for the image. Among items previously shared by the same account were a photograph the poster described as an inadvertently phallic drawing done by his daughter, a Facebook screenshot of what he suggested was a ghost in the hospital room of a friend, and a photograph of a frog riding an insect (which he later admitted was \"stolen\" from elsewhere).", "Like many of the photographs shared on funny image sites (including ones of deliberately risqué images erroneously attributed to schoolchildren), a humorous backstory was likely concocted to further propel an already interesting image onto Reddit's front page.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]