["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "On Facebook, some users shared old photos of Iranian and Israeli missile strikes after the attack on two United States air bases in Iraq.", "Two of the photos, which a popular Facebook page published Jan. 7, depict several missiles being launched from the foreground of a mountain range. One appears to show an explosion.", "\"Approximately half an hour ago Iran attacked US Base in Iraq,\" the page wrote in its caption.", "The images were flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.) They have been shared more than 15,000 times.", "(Screenshot from Facebook)", "The photos don’t show the missiles that hit the Al Asad and Erbil bases in Iraq on Jan. 7. Using reverse image searches, we traced the images to three old missile strikes by Iran and Israel.", "The top photo depicts an Oct. 1, 2018, strike by Iran against the Islamic State in Syria. Its source is the Agence France-Presse (AFP).", "The photo on the bottom-left of the Facebook post shows a June 18, 2017, attack by Iran also against the Islamic State in Syria. It’s a handout that Iran’s state TV gave the European Pressphoto Agency.", "The photo on the bottom-right of the Facebook post depicts the impact of a Nov. 15, 2019, Israeli missile strike in the Gaza Strip. Its source is the AFP.", "Below is footage that Iran has released from its Jan. 7 strike in Iraq. There were no reported casualties.", "The Facebook posts are inaccurate. We rate them False.", "Al Jazeera, \"Iran fires missiles at ISIL positions in eastern Syria,\" June 18, 2017", "BBC, \"Israel-Gaza ceasefire strained by rockets and air strikes,\" Nov. 15, 2019", "Google Reverse Image Search, accessed Jan. 8, 2020", "The Guardian, \"Iran launches missiles at Iraq airbases hosting US and coalition troops,\" Jan. 8, 2020", "Facebook post, Jan. 7, 2020", "The Independent, \"Iran fires missiles at Syria targeting militants in retaliation over parade shooting,\" Oct. 1, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]