["By Angelo Fichera", "Posted on January 8, 2019", "A story shared on Facebook uses selective TV ratings data to make the misleading claim that CNN was not one of the 10 most watched cable networks in 2018.", "A conservative website takes aim at CNN by misrepresenting recently released 2018 year-end TV ratings data.", "The Jan. 3 headline on AmericanLookout.com reads, “RATINGS DISASTER: CNN Doesn’t Make Top 10 Of Most Watched Cable Networks In 2018.”", "The story doubles down on the headline, beginning with the assertion that “CNN is not even on the list of the most watched cable networks for 2018…an absolute disaster for the far left channel.”", "But that claim is based on incomplete information.", "CNN did not make the Top 10 list for basic cable networks in terms of prime-time viewership in 2018, according to Nielsen ratings data reported by Adweek and cited by AmericanLookout.com. CNN ranked No. 11 in prime time, which is from 8 p.m. to 11 p.m.", "The network did, however, make another Top 10 list for basic cable networks: It ranked No. 7 for total-day viewership (which measures viewing over 24 hours, from 6 a.m. to 6 a.m.). CNN averaged 706,000 total-day viewers in 2018, down 9 percent from 2017. Even Fox News, which ranked No. 1 in both prime-time and total-day viewers in 2018, saw a 5 percent drop in its average total-day viewership from the previous year.", "AmericanLookout.com included the prime-time rankings from the Adweek article, but omitted the part about total-day viewers, which clearly said “CNN earned a strong No. 7 ranking.” MSNBC, which gained viewers in both measurements from 2017 to 2018, ranked No. 2 for total-day viewers and No. 3 for prime time.", "Facebook users replying to the story on conservative pages called for CNN’s demise, denouncing it as “fake news” — a term popularized by President Donald Trump.", "It’s not the first time Nielsen ratings have been cherry-picked to mislead readers about CNN. Last year, a website known for sharing deceptive content went so far as to falsely claim the network would “permanently close its doors” due to a “ratings crisis.”", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on the social media network. Since 2015, FactCheck.org also has collaborated with CNN’s “State of the Union” to produce online fact-checking videos.", "Katz, A.J. “2018 Year-End Cable Ranker: Fox News, MSNBC, Hallmark Channel Are Among Top Networks to Also Post Audience Growth.” Adweek. 3 Jan 2019.", "LaChance, Mike. “RATINGS DISASTER: CNN Doesn’t Make Top 10 Of Most Watched Cable Networks In 2018.” AmericanLookout.com. 3 Jan 2019.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]