["The photo was published on May 28, 2020 in this article by BLes Mundo, a Spanish news media website.", "The article’s headline translates to English as: “Repression of Hong Kong could mean the decline of the Chinese regime internationally”.", "The photo is credited to Twitter user @pmchau1 and has a caption that translates as: “Police assault protesters in Hong Kong.”", "Fresh protests broke out in Hong Kong in late May 2020 over another proposed law that criminalizes insults to the national anthem with up to three years in jail, AFP reported here.", "The credited Twitter user published the photo here, here, and here in tweets that claim it shows a police officer taking aim at pro-democracy protesters in late May, 2020. The photo was also published here on LIHKG, a Hong Kong online forum, alongside a similar claim.", "The claim is false.", "A reverse image search on Google found the photo was in fact taken from a 2014 Hong Kong movie “That Demon Within”. The photo was published on a Yahoo movie webpage here.", "The photo was also included in this April 3, 2014 article about the movie published by ettoday.net, a Taiwan-based news site.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]