["Depo-Provera contraceptive injection has been debated in the medical community whether it increases women’s risk of HIV infection", "A South African Twitter user said the Depo-Provera injection led “to over 40% increase for women to contract HIV-1”. The link between the contraceptive and HIV risk has been debated since the 1990s.", "A study of 7,829 women in four African countries ruled out an increased risk of more than 30%, when Depo-Provera was compared to other contraceptives.", "But a larger study would be needed to detect a difference in risk below 30%, which an expert says could be relevant for women living in areas with high levels of HIV infection.", "Does a widely used contraceptive injection increase women’s risk of human immunodeficiency virus (HIV) infection by over 40%? A Twitter user has twice made the claim, in March and April 2020, to his 29,000 followers. His tweets were shared more than 1,000 times and “liked” more than 1,500 times.", "Injectables are the most common form of contraception in sub-Saharan Africa, according to the United Nations’ Contraceptive Use by Method 2019 report.", "The tweets specifically name the injectable DPMA, or depot medroxyprogesterone acetate, and its brand name, Depo-Provera. The link between Depo-Provera and higher risk of HIV infection has been debated in the medical community since the late 1990s.", "Does the drug increase a woman’s chance of becoming  HIV positive? And is the risk as high as 40%? We checked.", "Depo-Provera is an injectable hormonal contraceptive that lasts for 13 weeks. It slowly releases the synthetic hormone progestogen into the bloodstream to prevent pregnancy.", "The drug stops ovulation, the monthly release of an ovum, or human egg. It also thickens the cervical mucus and thins the lining of the womb.", "Depo-Provera is provided for free at South African public clinics.", "Since the early 1990s there have been concerns that Depo-Provera may increase a woman’s risk of HIV infection.", "A 2015 article in the Lancet medical journal examined data from 26 studies looking at various hormonal contraceptives and rates of HIV infection. It found “evidence of a small but increased risk of HIV acquisition” associated with Depo-Provera when compared to oral contraceptives and another injectable contraceptive, Noristerat. But the authors concluded that the risk was not high enough for Depo-Provera to be withdrawn.", "A second study found a “statistically significant” increase in HIV infection among Depo-Provera users, in some cases as high as 41% compared to Noristerat users.", "These concerns prompted the World Health Organization (WHO) to change Depo-Provera’s “medical eligibility criteria” in 2016. Before, it could be used without restriction as a category one contraceptive.", "It was moved to category two for women at high risk of contracting HIV. These included adolescent girls and young women in southern and eastern Africa. The new guidance said: “Women considering progestogen-only injectables should be advised about these concerns, about the uncertainty over whether there is a causal relationship, and about how to minimise their risk of acquiring HIV.”", "But the research behind the WHO’s guidance was limited. It did not conclusively prove that Depo-Provera increased a woman’s chance of HIV infection.", "“The problem is all of these studies were what we call observational studies,” said Prof Helen Rees, the executive director of the Wits Reproductive Health and HIV Institute.", "“Observational studies have inherent biases because the bottom line is, if you’re a person who chooses to use one [contraceptive] method over another there might be all sorts of things about you that differentiates you from a person who takes an IUD.” An IUD is an intrauterine device, a plastic or metal contraceptive object inserted into a woman’s womb.", "The observational studies could not take into account other factors, such as condom use, that might explain why one group had a higher HIV risk than another.", "One study using animals suggested that a key chemical in Depo-Provera was associated with an increased vulnerability to HIV in the female genital tract. But its findings are not considered conclusive.", "“These experiments are not definitive proof that the same things happen in the human body,” Prof Janet Hapgood, a molecular and cellular biologist at the University of Cape Town, told Africa Check.", "In 2015, the WHO partnered with researchers to find a definitive answer. This became the Evidence for Contraceptive Options and HIV Outcomes (Echo) clinical trial, which ran from December 2015 to September 2017.", "The trial involved 7,829 women aged 16 to 35 in Kenya, South Africa, Eswatini and Zambia. The women, who were “seeking effective contraception”, lived in 12 selected sites with high levels of HIV. They were randomly given one of three contraceptive methods: Depo-Provera, the levonorgestrel implant and the copper IUD.", "Rees said the research aimed to evaluate both hormonal and non-hormonal contraceptives.", "“If you didn’t find a difference between the three, it’s highly unlikely that two different hormones and a non-hormonal would be behaving, and [increasing the] risk, in the same manner,” she explained.", "Several news outlets reported that the trial found Depo-Provera did not increase a woman’s chance of HIV infection. But this was not accurate.", "The trial was designed to detect a 50% increase in HIV infection for each method, compared to the others. In practice, Rees said, it was sensitive enough to detect an increased risk of 30% or more.", "She said the 30% cut-off was decided in consultation with policy makers. It was a balancing act.", "“Once you got lower than [30%] most policy makers would say if you take out a popular contraceptive method you’re going to get more maternal deaths, more unsafe abortions,” Rees said.", "The trial concluded that it “did not find a substantial difference in HIV risk among the methods evaluated”. (Note: The trial looked at the link between Depo-Provera and HIV-1, the most common strain of the virus.)", "But an increased risk of less than 30% could not be ruled out, Prof Deborah Donnell, a biostatician at the University of Washington who was also involved in the trial, told Africa Check. It couldn’t be detected in the Echo trial because not enough women were studied.", "“It takes enormous trial sizes to rule out very small differences,” she said.", "“A trial that could reliably rule out a small difference – for example a 25% increase – would have to be approximately three to four times the size.”", "In August 2019, the WHO reversed its rating for Depo-Provera from category two to category one, giving the Echo trial as one reason. This means the contraceptive can be used without restriction in areas with a high risk of HIV.", "The Echo trial and the WHO’s decision have been criticised.", "In July 2019, more than 60 sexual and reproductive health rights experts and activists from 12 African countries raised their concerns about the decision in an open letter to the WHO.", "UCT’s Hapgood, one of the experts who signed the letter, told Africa Check an increased risk of 25% could be significant for women living in areas with high levels of HIV.", "She said: “It is doubtful that individual women and girls and health care providers would consider these potential increased risks as not being ‘substantial’ or ‘meaningful’.”", "Since the late 1990s, the medical community has debated whether the Depo-Provera contraceptive injection increases women’s risk of HIV infection.", "In March and April 2020  a Twitter user claimed the injection led “to African Women contracting HIV-1 by over 40%”.", "The Echo – Evidence for Contraceptive Options and HIV Outcomes –  trial examined HIV risk with three contraceptives, including Depo-Provera, in four African countries. It concluded that when the contraceptives were compared to each other, the increased risk of HIV transmission was not greater than 30%.", "But the trial could not rule out risk under a threshold of 30%.", "Please complete this form to receive the HTML sharing code.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "For democracy to function, public figures need to be held to account for what they say. The claims they make need to be checked, openly and impartially. Africa Check is an independent, non-partisan organisation which assesses claims made in the public arena using journalistic skills and evidence drawn from the latest online tools, readers, public sources and experts, sorting fact from fiction and publishing the results.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "© 2023 - Africa Check - All rights reserved.", "We will never charge you for verified, reliable information. Help us keep it that way by supporting our work.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "Support independent fact-checking in Africa."]