["About this rating", "A photograph of men claustrophobically crammed into a mining lift has been shared and re-shared online with several contradictory and likely false descriptions, many of which are shaped by a political narrative. One instance of such is a Facebook post which presents the photograph with the assertion that it is a “picture of Irish slaves in America,” adding the racially charged retort “All Lives Matter” at the end:", "The concept of Irish slavery in America, as we discussed in a 2016 article, is a notion that conflates the indentured servitude and/or inhumane working conditions experienced by many Irish immigrants in the 1800s with the race-based, hereditary system of chattel slavery in early America, often with the effect of minimizing the plight of African slaves and their descendants.", "Regardless, this photograph was likely not taken in the United States. Speaking to claims that the photograph could be of miners in West Virginia, Appalachian Magazine expressed skepticism that the picture had its origins in America:", "Being the son, grandson and great-grandson of West Virginia coal miners I certainly was raised to appreciate the deplorable conditions the Mountain State’s early miners were forced to endure, both below the ground in working conditions not fit for beasts, as well as above the ground in thieving company stores and rundown miner houses.", "With this being said, I was also raised with a firm enough grip on our history to recognize that our grandmothers didn’t dress like this at the turn of the last century ... and despite my desire for it to be true, something just didn’t feel right about this photo being from “down home”.", "One key example of something's “not feeling right” was the existence of what appeared to be clogs or “sabot,” wooden shoes common to working-class individuals and peasants in France and the surrounding Low Countries during the Industrial Revolution, on the feet of the women operating the lift as well as potentially some of the workers. This observation lends credence to the internet’s most popular theory on the backstory of the image, that it is a photograph of Italian workers in a Belgian mine around the turn of the 20th century century.", "Italian immigrants made up a large share of the workforce in Belgium's Wallonia mining region at that time, in part because of an arrangement between the governments of Italy and Belgium that developed in the early 1920s:", "A ... semi-official bilateral structure was set up in the spring of 1922 to channel Italian workers into the Belgian labor market. The Brussels labor exchange office signed an agreement with the Italian [office of employment] to send masons and other skilled construction workers to Brussels.", "In the beginning of 1923, the labor office of Brussels erroneously obtained a number of unqualified Italian workers through [this] arrangement ... The labor office contacted ... the mine companies in Charleroi, who were very eager to receive these Italians. This spontaneously established pattern of recruitment was endorsed by the Italian authorities.", "While the exact date and circumstances of the photograph remain in dispute, the picture is not of “Irish slaves” in the United States because, from a factual standpoint, that form of slavery did not exist in America and because, from a contextual standpoint, the photograph does not appear to have been taken in the United States.", "Appalachian Magazine.   \"The True History Behind This Viral Photo.\"\r\n    19 April 2017.", "Encyclopaedia Britannica.   \"Sabot.\"\r\n    Accessed 31 August 2018.", "Riflessioni Quasi Analitiche.   “Storia – Il Carbone Belga e la Schiavitù Degli Italiani.\"\r\n    14 April 2014.", "UNESCO.   “Major Mining Sites of Wallonia\"\r\n    Accessed 31 August 2018.", "Caestecker, Frank.   Alien Policy in Belgium, 1840-1940.\r\n     Berghahn Books, 2000.   ISBN 9781571819864   (p. 62).", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]