["“It just so happens that we are on track to have more votes than registered voters in every single state that could potentially win Trump the election. You’ve been caught Dems,” says a November 4 Facebook post.", "The posts echo unsubstantiated claims by President Donald Trump, who has alleged that his opponents are trying to “steal” the election.", "Multiple posts include the same table, claiming it shows the 2020 registered voter and turnout numbers for the states of Nevada, Pennsylvania, Minnesota, North Carolina, Wisconsin, Michigan, Arizona and Georgia.", "For its voter registration data, the table relies on a link from the World Population Review site, archived here.", "But the voter registration statistics mentioned in the table are outdated, matching official data from the US Census Bureau collected in November 2018.", "The title of the World Population Review table misleadingly read “Number Of Registered Voters by State 2020,” when in fact its sources tab provided a link to 2018 numbers. The page was later updated on November 4 to show the 2020 statistics and link to official state sources.", "“The page was updated on 11/4 after it was brought to my attention that the table was showing 2018 data. I updated it with the latest data released by each state's election website,” Shane Fulmer, the founder of World Population Review, told AFP via email.", "A second set of claims, including here and here, focused solely on the numbers for the key state of Wisconsin, also using the old World Population Review numbers.", "AFP debunked this claim here.", "AFP Fact Check verified the registration numbers for each state mentioned in the misleading table, below.", "The posts put Nevada’s registered voters at 1,277,000, claiming a 125 percent turnout.", "This is false. As of November 2, 2020, the number of registered voters in Nevada was 1,821,356.", "Additionally, same day voter registration is legal in Nevada, meaning the total number of registered voters in the state is likely higher now.", "The posts say Pennsylvania’s registered voters number 6,469,000, claiming a 109 percent turnout.", "But as of November 2, the Keystone state counted a total of 9,091,371 registered voters.", "October 19, 2020 was the deadline to register to vote in Pennsylvania.", "The posts say there are a total of 3,000,000 registered voters in Minnesota, claiming a 107 percent turnout.", "The actual number of registered voters in the state as of November 2 was 3,588,563.", "Voter registration on Election Day is allowed in the Minnesota, making it likely that the registration number was even higher after November 3.", "The posts put North Carolina’s registered voter total at 5,160,000, claiming a 106 percent turnout.", "The state’s website shows that as of November 3, 2020, a total of 7,361,219 voters had registered.", "The deadline to register to vote in North Carolina is 25 days before an election except for military or overseas voters, who had until 5:00 pm on the day before the vote to fill out the paperwork.", "North Carolina also allowed same day voter registration during its early voting period from October 15-31.", "The posts say Wisconsin has 3,129,000 registered voters, claiming a 105 percent turnout.", "As of November 1, the state had 3,684,726 registered voters, according to Wisconsin Elections Commission statistics.", "The state also allows Election Day voter registration, which may increase the final number of registered voters.", "The posts show Michigan as having 5,453,000 registered voters, claiming a 105 percent turnout.", "Michigan’s official voter information page currently shows a total of 8,128,430 registrations.", "There is no deadline to register to vote for an election in Michigan.", "The posts show 3,262,000 registered voters in Arizona, claiming a 101 percent turnout.", "The state is currently reporting 4,281,152 registered voters.", "The voter registration deadline was October 15, 2020.", "The posts show 4,840,000 registered voters for Georgia, claiming a 96 percent turnout.", "As of November 1, the state had 7,233,584 active voters, according to an official document from the secretary of state.", "The voter registration deadline for the general election in Georgia was October 5.", "The 2020 presidential election is expected to have a record turnout of about 160 million, including more than 101.1 million early voters, and 65.2 million votes by mail, according to US Elections project estimates.", "AFP has debunked numerous false claims of fraud in the election, available here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]