["Democratic presidential candidate Joe Biden, right, and former President Barack Obama greet each other with an air elbow bump, at a rally in Flint, Mich., Oct. 31, 2020. (AP)", "Biden’s tax returns from 2019 to 1998 are available in different places online. That amounts to 22 years worth of the financial documents.", "Trump has not released his tax returns, citing a pending audit.", "In a Halloween-day pitch to voters in Flint, Mich., former Vice President Joe Biden slammed President Donald Trump over the New York Times’ reporting on his long-concealed tax returns, which revealed that Trump paid $750 in federal income taxes in both 2017 and 2016.", "\"Why should you pay more in taxes than Donald Trump?\" Biden said at the event with former President Barack Obama. \"He paid $750 in taxes the one year we know of. He’s yet to release. I’ve released 22 years of my tax returns. You can go online and look. He hasn’t released one.\"", "\"He talks about corruption,\" Biden continued. \"What is he hiding?\"", "The Democratic presidential nominee’s 22-years claim is accurate. He has made it before, including ahead of the first presidential debate, when he made public his 2019 tax returns.", "The American people deserve transparency from their leaders, it's why as of today, I've released 22 years of my tax returns. https://t.co/6fwL20fWeI", "The Biden campaign website lists Biden’s federal and state tax returns for 2019, 2018, 2017 and 2016. It also lists Biden’s financial disclosure documents for 2020 and 2019 and the 2019 tax returns for his running mate, California Sen. Kamala Harris, and her husband.", "The returns show Biden and his wife, Jill, paid nearly $288,000 in federal income taxes in 2019.", "RELATED: Biden’s income sources aren’t such a big mystery", "Biden’s tax returns for the previous eight years, covering the rest of his two terms as Obama’s vice president, can be found in archived press releases from the Obama White House. Those included tax returns released for 2015, 2014, 2013, 2012, 2011, 2010, 2009, and 2008.", "Asked for the remaining 10 years’ worth of filings, the Biden campaign pointed to an archived Q&A from Obama’s 2008 campaign website, which linked to many years of Biden’s tax returns from his decades-long stint as a U.S. senator representing Delaware. The page included tax returns from 2007, 2006, 2005, 2004, 2003, 2002, 2001, 2000, 1999, and 1998.", "The 22 years of Biden tax returns are also available as part of an archive maintained by Tax Notes.", "Trump has not released his tax returns, breaking a promise he made during his 2016 campaign. According to the New York Times, the former real estate mogul and reality TV star has vowed for nearly a decade to release his tax returns under different conditions, but he hasn’t delivered.", "Trump is the only president or major-party presidential nominee in decades to keep his returns hidden from the public. Efforts by Congress and others to get hold of them have so far been unsuccessful.", "Trump has cited a pending Internal Revenue Service audit as reason for not publishing his tax returns. The IRS, however, has said nothing precludes a president from releasing tax returns while under audit — as President Richard Nixon did. Trump has also claimed, falsely, that his financial disclosures offer a more extensive picture of his finances.", "In recent years, the New York Times has obtained tax records and pieced together a more complete picture of Trump’s tax history. In September, the Times reported that Trump paid $750 in federal income taxes in both 2017 and 2016, and none at all in several years before that.", "Trump has provided no evidence to suggest that he’s paid more in taxes than the Times found. Tax experts said the complex tax history depicted by the Times report shows unusually aggressive tax avoidance and exceptionally persistent losses.", "The Trump campaign did not respond to a request for comment.", "Biden said, \"I’ve released 22 years of my tax returns. You can go online and look. (Donald Trump) hasn’t released one.\"", "Biden’s federal tax returns from 2019 dating back to 1998 are available online, as he claimed. The most recent returns are highlighted on his campaign website. Others can be found on the websites for the Obama White House and the 2008 Obama presidential campaign.", "Trump has not publicly released his tax returns, making him the only president or major-party presidential nominee in decades who has not done so.", "We rate Biden’s claim True.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more.", "Joe Biden on YouTube, \"Joe Biden and President Barack Obama Speak LIVE in Flint, Michigan | Joe Biden For President 2020,\" Oct. 31, 2020", "Joe Biden for President, \"Financial Disclosures and Tax Returns,\" accessed Oct. 31, 2020", "Obama for America, \"Have Senator Biden and Dr. Jill Biden released their tax returns for the last ten years?\" accessed via the Internet Archive Oct. 31, 2020", "Tax Notes, \"Presidential Tax Returns,\" accessed Oct. 31, 2020", "The White House of President Barack Obama, \"President Obama and Vice President Biden's 2015 Tax Returns,\" April 15, 2016", "The White House of President Barack Obama, \"President Obama and Vice President Biden’s 2014 Tax Returns,\" April 10, 2015", "The White House of President Barack Obama, \"President Obama and Vice President Biden’s 2013 Tax Returns,\" April 11, 2014", "The White House of President Barack Obama, \"President Obama and Vice President Biden’s 2012 Tax Returns,\" April 12, 2013", "The White House of President Barack Obama, \"President Obama and Vice President Biden’s 2011 Tax Returns,\" April 13, 2012", "The White House of President Barack Obama, \"President Obama and Vice President Biden’s Tax Returns and Tax Receipts,\" April 18, 2011", "The White House of President Barack Obama, \"President Obama and Vice President Biden’s Tax Returns,\" April 15, 2010", "The White House of President Barack Obama, \"Release of the President and Vice President’s Tax Returns,\" April 15, 2009", "The New York Times, \"The President’s Taxes: A Reader’s Guide,\" Oct. 31, 2020", "The Associated Press, \"Biden releases 2019 taxes as pre-debate contrast with Trump,\" Sept. 29, 2020", "Joe Biden on Twitter, Sept. 29, 2020", "The New York Times, \"Trump on Releasing His Tax Returns: From ‘Absolutely’ to ‘Political Prosecution,'\" July 9, 2020", "The New York Times, \"Vice President Biden's 2008 Income Tax Returns,\" April 15, 2009", "PolitiFact, \"Biden’s income sources aren’t such a big mystery,\" Oct. 22, 2020", "PolitiFact, \"Experts say Trump tax report shows aggressive tax avoidance, unusually persistent losses,\" Sept. 30, 2020", "PolitiFact, \"Fact-checking Joe Biden’s claim about his own income,\" Sept. 10, 2020", "PolitiFact, \"Donald Trump’s tax returns: How Congress might — or might not — get them,\" April 9, 2019", "PolitiFact, \"Trump 'might' release returns 'when I'm out of office,'\" May 12, 2017", "PolitiFact, \"Trump wrong that Americans don't care about his tax returns,\" Jan. 11, 2017", "PolitiFact, \"Tim Kaine correctly notes Richard Nixon released tax returns despite audit,\" Oct. 5, 2016", "PolitiFact, \"Pence's False claim that Trump 'hasn't broken' tax return promise,\" Oct. 5, 2020", "PolitiFact, \"Is Donald Trump the only major-party nominee in 40 years not to release his tax returns?\" Sept. 28, 2016", "PolitiFact, \"Donald Trump says his financial disclosures more than make up for lack of releasing tax returns,\" Sept. 7, 2016", "Email correspondence with the Biden campaign, Oct. 31, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]