["The video was viewed more than 80,000 times and shared more than 4,100 times in this post with a Chinese-language caption.", "The clip shows a silver coloured car parked inside a petrol station next to a pump. A man can be seen standing next to one of the car’s front windows. A powerful explosion at 00:01 blows up the car and tosses the man onto his back, where he lies motionless.", "The Chinese-language caption alongside the misleading post translates to English as: “This is terrible! The children were using mobile phones in the car, while their parents were refuelling outside, the car was destroyed and they were killed. Please share, it's very important.", "“A simple gesture from you may well save another life, as most of us are guilty of doing that (using phones in petrol stations) in the past. For safety reasons, don't use mobile phones at petrol stations! Don't make or pick up any calls either.”", "Below is a screenshot of the misleading Facebook post:", "Similar posts have been shared on social media platforms with the same video and captions, for example here and here on Facebook with a total of just under 2,000 shares, and here on Twitter. It has also been shared multiple times in English, including here.", "The claim is misleading; multiple news reports say a car exploded while being filled with natural gas, leaving one woman dead and two more injured in April 2017.", "A Google keyword and reverse image search for a screenshot of the video found a series of articles containing the same footage or screenshots of it. These articles state the explosion happened in Brazil’s Rio De Janeiro while the car was being filled with natural gas, on April 8, 2017.", "This news report published on the website for Rio de Janeiro’s O Dia newspaper includes longer footage of the same incident but shot from a different angle -- with the same sequence seen between 0:43 and 0:53.", "Below are three sets of screenshots, comparing the misleading video on Facebook (L) and the O Dia video (R):", "The O Dia Portuguese-language article translates to English in part as: “Last Saturday night a woman died when her car exploded while refueling. The car was destroyed and the structure's roof was damaged.", "\"According to the fire department, at around 9:30pm the car was being filled with Vehicle Natural Gas when the gas cylinder exploded. Security camera images show the driver, who was outside the vehicle, being thrown away.\"", "This G1 Rio article published on April 9, 2017 contains the same clip, with a similar explanation -- that the car was being filled with gas when it exploded.", "Other news reports about the incident, including this one published by Correio newspaper on April 9, 2017 and this one published by Veja magazine on the same day, state the car exploded after being filled with natural gas.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]