["The video has been shared more than 2,300 times since it was published on Facebook on June 2, 2020.", "The one-minute, 52-second video shows protesters, most of whom are wearing green jackets, marching and chanting: “Jokowi step down!”", "“Jokowi” is the popular nickname of Indonesian President Joko Widodo.", "The post’s Indonesian-language caption translates to English as: “JAKARTA-INDONESIA, the latest, Students’ slogan #JokowiStepDown. May God bless what they are doing. Amen.”", "The same video was also shared more than 6,000 times after it was posted on Facebook with similar claims here, here, here and here.", "The claim is misleading; the video has circulated online since September 2019, when students protested across the country against a criminal code revision bill.", "A reverse image search using a keyframe from the video found that the clip was previously posted on YouTube here and here on September 25, 2019.", "The caption reads: “TODAY. University students together chanted slogan Jokowi step down. This is the political news today. The criminal code revision bill rejected by university students activists has triggered pro and contra.”", "Students across Indonesia took to the streets in late September 2019 to protest a number of controversial pieces of legislation, including a criminal code revision bill, which would criminalize non-marital sex, restrict sales of contraceptives and make it illegal to insult the president. AFP’s reported on the demostrations here and here.", "Below is a screenshot comparison between the video in the misleading post (L) and the YouTube video (R):", "The green jackets seen in both the misleading video and the YouTube video are identical with the official student jacket of Muhammadiyah University Palembang, which can be seen here on the university’s  Instagram account.", "Mahasiswa Kedokteran Universitas Muhammadiyah Palembang Gelar Healthy Sunday . . Mahasiswa Fakultas Kedokteran Universitas Muhammadiyah Palembang menggelar kegiatan Healthy Sunday yang terdiri dari pemeriksaan gratis untuk masyarakat. Kegiatan sosial tersebut dilaksanakan pada masyarakat sekitar Lorong Banten 2, 3, 4 dan 5 serta Yayasan POPTI Palembang, Minggu (8/3/2020). . . Selain mendapatkan pemeriksaan kesehatan gratis, masyarakat berkesempatan melakukan konsultasi. Terutama, terkait tekanan darah dan kadar gula darah dengan dokter-dokter muda Fakultas Kedokteran Universitas Muhammadiyah Palembang. . . Mereka turut mengikuti talkshow mengenai diabetes. Panitia Kegiatan, Dyah Puspitaningtyas mengatakan, kegiatan pemeriksaan kesehatan merupakan bagian perayaan Hari Diabetes Dunia 2017 yang jatuh setiap 14 November. . . Pemeriksaan kesehatan gratis terselenggara berkat kerjasama mahasiswa Fakultas Kedokteran Universitas Muhammadiyah Palembang melalui organisasi IMM , DPM, BEM, AMSA, dan TBM.", "A post shared by  UMPalembang (Official IG) (@umpalembang) on Mar 8, 2020 at 10:10pm PDT", "Palembang is the capital of South Sumatra, a province on the island of Sumatra.", "Students in Palembang joined the nationwide protests against the criminal code revision bill on September 23 and 24, 2019, according to multiple media outlets, including CNN Indonesia and Detik.com.", "The street where the video was taken can be seen on Google Street View here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]