["By Eugene Kiely", "Posted on August 9, 2016", "The chairman of the House Democratic Caucus claimed that FBI Director James Comey testified that Hillary Clinton “had no knowledge” of sending and receiving classified emails on her private server as secretary of state. That’s not what Comey said.", "Comey actually said there was evidence that Clinton knew she was receiving classified information, but that he could not prove it “beyond a reasonable doubt” in court.", "“I do not believe there’s evidence beyond a reasonable doubt that she knew she was receiving classified information in violation of the requirements, but there is evidence of that,” Comey testified on July 7.", "Rep. Xavier Becerra, chairman of the House Democratic Caucus, made his remarks on “Fox News Sunday” on Aug. 7 during an exchange with host Chris Wallace. The two clashed over whether the FBI director contradicted Clinton’s public statements about sending classified emails on her private server.", "Wallace showed a clip of Rep. Trey Gowdy questioning Comey during a House Oversight Committee on July 7. Gowdy asked Comey, “Secretary Clinton said, ‘I did not e-mail ​any​ classified ​material​ to anyone on my e-mail. There is no classified material.’  Was that true?” Comey replies, “There was classified material e-mailed.”", "Wallace, Aug. 7:  Congressman, Comey directly contradicted what Clinton had been telling the American people for a year.", "Becerra: But, Chris, what you don’t also show is that Director Comey said that she had no knowledge of some of those so-called classified e-mails because they were either not marked or they were not classified at the time or they were incorrectly marked.  And so, he did come out and say — you don’t show that, but he did come out and say that she did not know.", "Wallace: They were marked and more importantly, he said that there was classified material that she had emailed.", "Becerra: But she did not know it. Otherwise, if there had been the intention to send classified emails, then the FBI would have pursued this much further. And so I think you’re trying to make more of this than what there is.", "(CROSSTALK)", "Wallace: She didn’t say, “I didn’t intend to send classified material.”", "Becerra: No.", "Wallace:  She said — that isn’t what she told the American people. She said there was no classified material.", "Becerra: Chris, she has made it clear that looking back at this, she would have done it differently, that she did make some mistakes, but that she never intended to send classified information over emails, and the FBI investigation confirms that. And so, while we may want to make more of it, the fact is the FBI has said we should move on and get to real important matters of the country.", "Becerra goes too far when he claims that Comey said Clinton “had no knowledge” that any emails contained classified information, and that “the FBI investigation confirms” that “she never intended to send classified information over emails.”", "As we have written, Comey said at a July 5 press conference that more than 2,000 of the 30,490 emails Clinton turned over to the State Department in December 2014 contained classified information, including 110 emails in 52 email chains that contained classified information at the time they were sent or received. He also said, “a very small number of the emails containing classified information bore markings indicating the presence of classified information.”", "In his July 7 testimony, Comey clarified that those three additional emails had “portion markings” indicating that they contained classified information, but he acknowledged under questioning from Rep. Matt Cartwright that they were not properly marked and therefore could have been missed by Clinton. He said those three emails were marked as classified with the letter “C” in the body of the email.", "Becerra’s office referred us to Comey’s July 7 testimony, specifically to Comey’s responses to questions from Cartwright, a Democrat, and Rep. Ken Buck, a Republican. But Comey was very careful in his testimony — as he was in his July 5 press conference — to make it clear that there was evidence that Clinton and her staff knew or should have known that classified information was housed on an unsecure server, but that there was no “clear evidence” to pursue a criminal prosecution.", "First, we will take a look at what Comey said at his press conference.", "Comey, July 5: Although we did not find clear evidence that Secretary Clinton or her colleagues intended to violate laws governing the handling of classified information, there is evidence that they were extremely careless in their handling of very sensitive, highly classified information.", "For example, seven e-mail chains concern matters that were classified at the Top Secret/Special Access Program level when they were sent and received. These chains involved Secretary Clinton both sending e-mails about those matters and receiving e-mails from others about the same matters. There is evidence to support a conclusion that any reasonable person in Secretary Clinton’s position, or in the position of those government employees with whom she was corresponding about these matters, should have known that an unclassified system was no place for that conversation. In addition to this highly sensitive information, we also found information that was properly classified as Secret by the U.S. Intelligence Community at the time it was discussed on e-mail (that is, excluding the later “up-classified” e-mails).", "None of these e-mails should have been on any kind of unclassified system, but their presence is especially concerning because all of these e-mails were housed on unclassified personal servers not even supported by full-time security staff, like those found at Departments and Agencies of the U.S. Government—or even with a commercial service like Gmail.", "Separately, it is important to say something about the marking of classified information. Only a very small number of the e-mails containing classified information bore markings indicating the presence of classified information. But even if information is not marked “classified” in an e-mail, participants who know or should know that the subject matter is classified are still obligated to protect it.", "Comey elaborated two days later, when Rep. Buck asked Comey if Clinton knew she received classified information. Comey balked at providing a yes or no answer.", "Comey, July 7: I can’t answer – I’m hesitating as a prosecutor because there’s always to what level of proof. I do not believe there’s evidence beyond a reasonable doubt that she knew she was receiving classified information in violation of the requirements, but there is evidence of that.", "Buck then asked if Clinton intended to retain classified material on her server, and Comey again responded that “there is evidence of that,” but not “beyond a reasonable doubt” — the legal standard needed for a successful prosecution:", "Comey, July 7: There is in my view not evidence beyond certainly probable cause, there’s not evidence beyond a reasonable doubt that she knew she was receiving classified information or that she intended to retain it on her server. There is evidence of that, but when I said there’s not clear evidence of intent that’s what I meant. I could not, even if the Department of Justice would bring that case, I could not prove beyond a reasonable doubt those two elements.", "Rather than saying Clinton had “no knowledge” that her emails contained classified information, Comey actually said there was evidence that she knew she was receiving and storing classified information, but that he could not prove it beyond a reasonable doubt in a court of law.", "https://www.sharethefacts.co/share/273516b8-f67f-4812-b345-c4ac9d006e1b", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]