["The chart was published on Facebook here on January 31, 2020. The post has been shared more than 2,200 times.", "Below is a screenshot of the misleading post:", "The chart, attributed to Business Insider, purports to show the number of infections, deaths and the fatality rate for several different virus outbreaks in recent decades.", "The chart is annotated with the text “PERSPECTIVES” at the top and with the rows for “H1N1” and “Wuhan” viruses highlighted in red. The fatality rate reads “17.40%” for H1N1 and “2%” for Wuhan.", "Further text at the bottom of the chart reads: \"H1N1 was started in the USA. Little efforts were made by the USA to stop the spread of the virus. It killed 284,500 worldwide and affected 214 countries. There was no mention by the western media that H1N1 is an American Pandemic Virus. / COMPARE THIS TO THE EFFORTS OF CHINA TO CONTAIN THE WUHAN VIRUS.\"", "The chart was also shared on Facebook by the Chinese Embassy in Manila here.", "However, the chart is being shared in a misleading context.", "Business Insider has since corrected the chart, which was first published here on January 31, 2020, to show that the H1N1 fatality rate was “0.02%” – not “17.40%”", "Below is a screenshot of the updated chart:", "Business Insider issued a correction on the article, which reads: “Correction: A previous version of the chart in this article incorrectly reported the case-fatality rate of H1N1. It is 0.02%.”", "This AFP report, citing figures from The Lancet medical review, says the 2009 H1N1 death toll was between 151,700 and 575,400.", "It reads, in part: “The virus turned out to be not as deadly as first feared.", "\"The pandemic alert was launched on June 11, 2009 and lifted on August 10, 2010 but the virus turned out to be not as deadly as first feared.", "\"Vaccines were rushed out, but in hindsight, the West, particularly Europe, and the WHO were criticised for overreacting at a time annual influenza epidemics every year kill between 250,000 and 500,000, according to the Geneva-based UN health agency.\"", "Meanwhile, the coronavirus, which was first detected in the central Chinese city of Wuhan in late 2019, continues to spread worldwide. The virus has now spread to dozens of countries and killed at least 1,011 people, AFP reported here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]