["About this rating", "In January 2016, dubious web sites began posting articles quoting a statement attributed to Russian president Vladimir Putin that castigated the West for slowing human evolution with vaccines and genetically-modified foods (GMOs), words supposedly taken from a report circulated by the Security Council of the Russian Federation (SCRF).", "The statement attributed to Putin claimed Western governments were subjugating their citizens with GMOs and vaccines, and Russia must \"fight\" that process:", "We as a species have the choice to continue to develop our bodies and brains in a healthy upward trajectory, or we can follow the Western example of recent decades and intentionally poison our population with genetically altered food, pharmaceuticals, vaccinations, and fast food that should be classified as a dangerous, addictive drug.”", "We must fight this. A physically and intellectually disabled population is not in our interests.", "The alleged Putin statement described the average Westerner as an \"intensively vaccinated borderline autistic fat man slumped in front of a screen battling a high-fructose corn syrup comedown.\"", "None of the articles cited or linked to the source of the Putin statement or the original report from which it was supposedly taken. The earliest instance of this item we could find was published on 9 January 2016 by a web site that pushes anti-vaccine propaganda and conspiracy theories (sample headline: \"7 Reasons Why ‘Conspiracy Theorists’ May Actually Be ‘Indigo People’\"), and since then it has been shared widely by other dubious, anti-science web sites such as Natural News.", "The rest of the story indicates the piece is little more than pro-Russian propaganda intended to appeal to Americans who subscribe to anti-scientific views about vaccines and foods and claims Russia is a major backer of organic farming:", "Russia under President Putin has been giving away land for free in the past few years to people willing to farm organically and sustainably. The goal is to become the world’s “leading exporter” of non-GMO foods that are based on “ecologically clean” production.", "Russia did give away land in its sparsely-populated far eastern region that borders China, but not specifically for organic farming. The giveaway was instead an effort to spur development in the region, according to the Global Post:", "President Vladimir Putin signed a law this month granting 2.5 acres of land to any Russian citizen who wants it. If they can prove they’ve done something with it after five years, primarily by agricultural means, it’s all theirs.", "Officials hope the program will rejuvenate a region that researchers estimate has lost nearly 2 million people since the Soviet Union collapsed in 1991.", "“It will allow Russians, especially the youth, to discover in the Far East a real chance for self-realization,” said Aleksandr Galushka, the minister for Far East development.", "Despite occupying roughly one-third of Russia, the Far East — with its vast forests, forbidding tundra and spectacular volcanoes — is now home to only 4 percent of its population.", "President Putin doesn't seem to hold an anti-vaccine stance. In early 2016, the Russian government was boasting that the country's scientists were developing vaccines for the Zika and Ebola viruses.", "In May 2016, the National Academies of Sciences, Engineering and Medicine released a report saying there was no proof that genetically-engineered food is linked to health or environmental harm. As of 2015, the Russian government had blocked the growing of GMO crops domestically and had restricted GMO-based imports, but we couldn't find any statements made by Putin revealing his personal views on the subject.", "Reuters.   \"Govt Decides to Ban GMO Food Production in Russia: Deputy PM.\"\r\n    23 September 2015.", "Ross, Eleanor.   \"Zika Virus: Vladimir Putin Orders Russian Scientists to Develop Vaccine.\"\r\n    The Independent.   30 January 2016.", "RT.   \"Russian Ebola Vaccine Presented to WHO.\"\r\n    15 February 2016.", "Peleschuk, Dan.   \"Russia Is Literally Giving Away Land for Free.\"\r\n    Global Post.   10 May 2016.", "Burres, Leonid.   \"Putin Signed a Law on the Distribution of Free Land: Where to Get Hectare.\" (translated)\r\n    MKRU.   2 May 2016.", "National Academies of Sciences, Engineering, and Medicine.   \"Genetically Engineered Crops: Experiences and Prospects.\"\r\n    May 2016.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]