["According to the author of the post, “This is happening right now in California!” However, the video was originally uploaded on Twitter on December 6, 2017. According to the platform’s geolocation feature, the video was taken in Los Angeles, which was threatened by several forest fires at the time.", "According to the map of forest fires published by the California Department of Forestry and Fire Protection, in December 2017, the Skirball Fire came dangerously close to the Getty Centre, a famous art museum located near Interstate 405 in the neighborhood of Brentwood.", "The flames were recorded by other social media users, and shared by a local news broadcast on the same day, December 6, 2017.", "By examining the frame at the 26 second mark of the video, one can easily identify of the video’s location. On the center top of the frame, a traffic sign indicating that Getty Centre Drive is a half mile (800 meters) away is visible, while a speed limit sign is in the background.", "By comparing that frame of the video with a screenshot of Google Street View, AFP was able to confirm that the video circulating on Facebook was indeed taken on Interstate 405, a half mile from the exit for Getty Center Drive.", "According to the forest fire map of the California firefighters in 2018, no fire of this type has occurred in the area surrounding the Getty Center so far this year. The closest one, the Woolsey fire, burns in the nearby city of Malibu, about 25 miles (40 kilometers) away.", "Although the video circulating on Facebook was indeed shot during a forest fire in California, the images are from December 2017. They were not shot during the fires that have assailed the Golden State since November 7, responsible for the death of 77 people and the disappearance of 1,000.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]