["A video widely circulating on social media shows a man in a hospital bed, with a mask covering his mouth, speaking with great difficulty. “Salaam-Alaikum, my health is better today. Hence, I thought of greeting you all and I request you all to not take the virus as a joke. This is a virus, not a joke. My health today is way better.” The man urges people to take precautions against the coronavirus pandemic. Several users have claimed that he is Dr Usama Riaz who caught the viral infection while treating patients suffering from COVID-19 and lost his life. The video is claimed to be the last message left by the doctor.", "Dr Usama Riaz, the warrior who contracted virus while treating patients, emphasizes severity of this virus.He lost the battle against corona but left a message for all of us Rip hero!#StayAtHomeSaveLives #CoronaFreePakistan pic.twitter.com/xiNPt7cBw1", "— khadija siddiqi (@khadijasid751) March 23, 2020", "Tweets by Khadija Siddiqi and Aarif Shah alleging that he is Dr Usama Riaz have garnered a combined retweet count of over 5,000. The video is viral on Twitter and Facebook with the same narrative.", "Dr Usama Riaz, contracted virus while treating patients, emphasizes severity of this virus. He bravely fought against corona & left a message for all of us before he died. Here are last his words. Real Hero 🙏#StayAtHomeSaveLives pic.twitter.com/OuswYICa8P", "— Aarif Shah (@aarifshaah) March 23, 2020", "Sonam Mahajan, a prominent social media user, tweeted the video with the message, “This is Dr. Usama Riaz from Pakistan. He got infected with coronavirus while treating others. This was his last video cuz he succumbed yesterday.”", "Another claim: COVID-19 patient from Bhilwara, Rajasthan", "Facebook user Kajla Sunil Choudhary posted the video claiming that he a coronavirus patient from Rajasthan’s Bhilwara. His message reads, “भीलवाड़ा के कोरोना पॉजिटिव डॉ. नियाज साहब का सभी के लिए सन्देश (A message for the public by Niyaz Sahab, a COVID-19 positive patient from Bhilwara.)” The post has been shared more than 1,700 times.", "Firstly, it is true that a 26-year-old doctor died in Pakistan due to contracting coronavirus while treating patients. His name was indeed Riaz. He was treating people in POK’s Gilgit-Baltistan region who had returned from Iraq and Iran.", "But the second and most important fact is that the man in the video is not the same doctor. He is doctor Mubashir Ahmad, who is from Pakistan and has been living in the United Kingdom for some time. He did contract the virus. His relative Nimra informed that he (Ahmad) is her uncle and his name is not Usama Riaz. She further stated that her uncle is fine and recuperating.", "Stop spreading wrong information he’s my uncle and his name is Mubhasir not “Dr Usama Riaz” and Alhamdullilah now he’s absolutely fine. https://t.co/wGdAAFmJuJ", "— Nimra (@smokyswaggin) March 24, 2020", "We found Ahmad’s Facebook profile and subsequently a post where he clarifies that he is not Dr Usama Riaz. While thanking God, Ahmad said that he is feeling much better but he is in the hospital at the moment. Posted below is the screenshot of his Facebook post. In the post, he talks about his video circulating with different people’s names which shouldn’t have happened and is wrong.", "He also posted a live video clarification where he referred to himself as Dr Mubashir Ahmad.", "The video viral on social media with false claims is a Facebook live which was posted by Ahmad on March 22, 2020.", "There is currently no specific treatment for coronavirus.", "Antibiotics do not help, as they do not work against viruses.", "Treatment aims to relieve the symptoms while your body fights the illness.", "You’ll need to stay in isolation, away from other people, until you have recovered.", "Please Please Please", "Posted by Mubashir Ahmad on Sunday, 22 March 2020", "Alt News could ascertain that a video of Dr Mubashir Ahmad was shared on social media with the claim that he is doctor Usama Riaz who died after contracting the coronavirus. In the comparison posted below, Ahmad is on the left while Usama is on the rights.", "Note: The number of positive cases of the novel coronavirus in India has exceeded 600. This has caused the government to impose a complete restriction on movement apart from essential services. Globally, more than 4 lakh confirmed cases and close to 21,000 deaths have been reported. There is a growing sense of panic among citizens, causing them to fall for a variety of online misinformation – misleading images and videos rousing fear or medical misinformation promoting pseudoscience and invalid treatments. While your intentions may be pure, misinformation, spread especially during a global pandemic, can take lives. We request our readers to practice caution and not forward unverified messages on WhatsApp and other social media platforms.", "Donate Now", "Ketan is Senior Editor at Alt News Hindi.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]