["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A truck crosses the Blue Water Bridge into Port Huron, Mich., from Sarnia, Ontario, Canada, on March 18, 2020. (AP)", "The U.S. has nearly twice as many confirmed COVID-19 deaths per capita as Canada.", "Leadership is one explanation for the gap. But there are others, including differences in the two nations’ health care systems and New York City being hit hard early in the outbreak.", "A Facebook post claimed that a difference in leadership explains why the United States has so many more COVID-19 deaths than Canada.", "\"It’s not that there’s a virus shield between Canada (4,500 deaths) and the U.S. (80,000 deaths),\" the post said. \"What exists is a difference in leadership.\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The United States has experienced more confirmed COVID-19 deaths than Canada. But when taking into account the larger population of the U.S., the gap is not nearly as large as the post claims.", "While experts say leadership is one factor affecting coronavirus mortality, other factors are in play as well.", "The raw numbers come from Our World in Data. That research organization is funded by philanthropists Bill and Melinda Gates and is led by Max Roser, director of the Oxford Martin Programme on Global Development at the University of Oxford.", "As of May 9, the date of the post, the confirmed COVID-19 death toll was 4,569 for Canada and 77,180 for the U.S., or nearly 17 times as many.", "But the United States has a much larger population. To account for that, Our World in Data also reports the number of COVID-19 deaths per million people as of May 9: 121.06 for Canada and 233.17 for the United States.", "So adjusted for population, the U.S. death toll is not quite double Canada’s.", "The U.S. leads the world in overall COVID-19 deaths. On a per-capita basis, it fares better than some countries, but worse than others.", "The U.S. is showing a lower number of deaths per capita than countries such as Spain and Italy. But despite claims by President Donald Trump, it has far more than Germany and many other countries, including Canada, South Korea, Iran, Russia, Poland and Switzerland.", "But comparing numbers at a particular point in time \"can be very misleading in terms of conclusions — because trajectories over time and the levels at different points in time are very different,\" said health economist Peter Berman, director of the School of Population and Public Health at the University of British Columbia and adjunct professor in global health at Harvard University.", "\"Canada and the U.S. are not too far apart today, but the U.S. was way higher than Canada some weeks ago,\" he said.", "The post does not define what it means by \"leadership,\" but there are differences in the ways the two countries’ governments responded to the outbreak.", "At the federal level, Canada supported widespread testing early and the U.S. did not, said Joshua Michaud, associate director of global health policy at the Kaiser Family Foundation. \"That has been one of the big weaknesses of the U.S. response. It took us a very long time to scale up testing in the United States.", "\"Provinces in Canada have generally coordinated well with the federal government on how to respond to the outbreak, whereas U.S. states have often taken their own paths and sometimes clashed with the federal government,\" said Michaud, a former infectious-disease epidemiologist. \"That has not helped the response in the United States, if you have that sort of tension.\"", "Berman said public-health officers in Canada are much more empowered legally, and medical care is largely under the same government authority as public health, so it is much easier to direct and coordinate a response.", "Canada’s politicians, he said, \"tended to cede the podium to the public-health scientists more and didn’t undermine or question them, especially in public. In the U.S., political leaders disagreed with scientists often and publicly.", "With the U.S. in an election cycle, Berman added, \"political opposition is looking for things to criticize, as is a politically polarized media. Also, the U.S. seems to me to be a more polarized society politically. All of this has different results in terms of coherence and coordination of policy response.\"", "News reports have also looked at differences in leadership.", "An analysis by the CBC, the Canadian broadcast network, said Trump gave mixed messages about social distancing, and one American study found that people in counties that voted predominantly for Trump in 2016 were less likely to perceive risk associated with coronavirus, seek information or practice physical distancing, the analysis noted. In contrast, according to the analysis, Canadian politicians were more consistent in their messaging, and tracking data collected by Google from smartphones suggested that Canadians practiced more physical distancing than Americans and began doing it earlier.", "In addition to citing Trump’s mixed messaging, the CBC analysis said the U.S. death rate is higher because its largest city, New York, was struck early in the pandemic; and because a lack of health insurance is a problem in the U.S., especially among Americans more vulnerable to COVID-19, such as African Americans.", "\"Canada has universal health care, whereas many people in the United States do not have health insurance or easy access to care, Michaud said. And, he said, the U.S. has a \"fractured\" health care system, with government providers, health insurance companies and private practitioners \"competing for scarce resources.\"", "A Facebook post claimed: \"It’s not that there’s a virus shield between Canada (4,500 deaths) and the U.S. (80,000 deaths). What exists, is a difference in leadership.\"", "These numbers aren’t directly comparable because the U.S. has a far larger population, so the post exaggerates the difference.", "But on a per-capita basis, the United States still has nearly twice as many COVID-19 deaths as Canada does.", "Experts said differences in how political leadership responded to the disease are one factor in the disparity. But there are others, such as the virus’ heavy impact on New York City; poor access to health insurance and health care among people more vulnerable to the coronavirus; and people’s different responses to guidelines aimed at containing the virus.", "The statement is partially accurate but leaves out important details.", "We rate it Half True.", "Facebook, post, May 9, 2020", "CBC, \"3 reasons the COVID-19 death rate is higher in U.S. than Canada,\" May 6, 2020", "New York Times, \"Canada Coronavirus Map and Case Count,\" May 13, 2020", "Our World in Data, \"Total confirmed COVID-19 deaths per million people,\" May 9, 2020", "Our World in Data, \"Daily and total confirmed COVID-19 deaths,\" May 9, 2020", "Canadian Press, \"Compared to U.S., Canada's COVID-19 response a case study in political civility,\" April 14, 2020", "Vox, \"Canada succeeded on coronavirus where America failed. Why?,\" May 4, 2020", "New York Times, \"Two Medical Systems, Two Pandemic Responses,\" May 1, 2020", "Interview, former infectious disease epidemiologist Joshua Michaud, associate director of global health policy at the Kaiser Family Foundation, May 14, 2020", "Email, health economist Peter Berman, director of the School of Population and Public Health at the University of British Columbia and adjunct professor in global health at Harvard University, May 14, 2020", "PolitiFact, \"Trump’s comparison of COVID-19 deaths in Germany, US is wrong,\" May 13, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]