["A Facebook post claimed that a threatening comment against black people was made by the owner of Taco Bell.", "Taco Bell, while not providing details, said the incident involved a former employee of a franchise.", "Taco Bell is owned by Yum! Brands, a global, publicly traded fast-food company based in Louisville, Ky.", "Amid national protests over the Minneapolis police custody death of George Floyd, a Facebook user claimed that the owner of a national fast-food chain had made a disparaging and threatening comment about black people.", "The June 1 post was made with abbreviated words and shared more than 33,000 times. It said:", "\"The owner of Taco Bell said them animals need to be shot (black ppl)! So stp spending money there.\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Details of this incident are unclear, but there’s nothing to support the contention that \"the owner\" of Taco Bell, or even an owner of a Taco Bell franchise, is involved.", "Taco Bell is actually owned by Louisville-based Yum! Brands, a global publicly traded fast-food company. Individuals can be franchisees, owning one or more restaurants.", "The post we’re checking does not indicate where the alleged threatening remark was made. But a follow-up post by the user gave a man’s name and referred to him as the Taco Bell owner.", "Other Facebook users weighed in. One linked to a June 2 article on Hip-HopVibe.com that said Facebook posters had identified the same man as the owner of a Taco Bell in Louisiana and as the one who made the statement.", "We found a screenshot being shared on Facebook that shows what the post said: \"I want those animals shot in the street for destroying peoples lives and businesses! All demoncrat cities. Go figure!\"", "It does not mention black people specifically.", "Taco Bell seemed to confirm that some threatening statement of this type had been made, but by a former employee of one of its franchised restaurants, not an owner.", "\"We confirmed with the franchisee that this individual no longer works for them and hasn’t in some time,\" Taco Bell said in a statement to PolitiFact. \"Taco Bell believes in all people and does not tolerate any kind of discrimination.\"", "The company did not reply to our request for more details.", "The post misrepresents the original comment and the speaker’s connection to Taco Bell. We rate it False.", "Facebook, post (archived here), June 1, 2020", "Facebook, post, June 1, 2020", "Email, Taco Bell public relations, June 15, 2020", "Hip-HopVibe.com, \"Taco Bell Issues Statement, Regarding Jay LeBlanc, Of Their Thibodaux, Louisiana Franchise, And Have Confirmed That He No Longer Works With The Franchisees For Their Company,\" June 2, 2020", "Email, Danielle Deibler, CEO of Marvelous AI, June 15, 2020", "Facebook, screenshot of multiple posts, June 3, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]