["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Plastic pollution covering a beach in Accra, Ghana, in 2018. (Wikimedia Commons)", "Not all news about the environment is bad these days, at least according to the conservative Young America’s Foundation.", "A recent Facebook post by the group said, \"FACT: Less than 1% of the trash in the ocean is from the United States.\" The graphic cites the prestigious Science magazine as the source of the tidbit and tells readers, \"An inconvenient truth that climate change alarmists leave out.\"", "When we took a closer look, we found that the post is based on real numbers, but it glosses over some context that paints a more nuanced picture.", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Young America’s Foundation pointed us to the peer-reviewed article in Science published in 2015.", "That article summarized the findings of several scientists from the United States and Australia in a table that ranked the 20 biggest contributors of \"mismanaged plastic waste.\" \"Mismanaged waste\" refers to material that is either littered or inadequately disposed, and thus could find its way into the oceans due to wind, tides, or rivers because it is dumped in open landfills.", "On that list, the United States ranked 20th. We used the paper’s data to create the following pie chart, which shows that the United States accounts for about 1% of the world total.", "A big reason why the United States ranks low as a global contributor of mismanaged plastic waste is that the United States, like other advanced industrialized countries, does a better job of securing its waste than lower-income nations do. (In fact, the United States is the only country on the 20-nation list that’s a high-income country.)", "So is there anything else to know?", "One of the paper’s co-authors, industrial ecology professor Roland Geyer of the University of California-Santa Barbara,, offered a few cautions.", "First, he said the data is already a decade old, and it is based on modeling, not empirical observations. So the \"uncertainties\" about the data \"are large,\" he said.", "Second, the data addresses how the plastic enters the oceans, not who made the plastic or even who used the plastic.", "\"A non-negligible portion of the plastic entering the oceans from Chinese soil could be from products originally produced in the U.S. or from plastic waste exported by the U.S. to China,\" Geyer said.", "Meanwhile, the paper did not address how much plastic was already in the ocean at the time the calculations were made, said George Leonard, the chief scientist at the Ocean Conservancy, an advocacy group. It’s possible that the United States accounted for a larger share of existing plastic waste that migrated to the ocean many years before.", "\"We estimated the total amount of mismanaged plastic waste generated within 50 kilometers of a coast that could enter the ocean,\" said Kara Lavender Law, a research professor of oceanography with the Sea Education Association in Woods Hole, Mass., and a co-author of the 2015 paper. \"We did not take into account plastic debris entering the ocean from other sources, such as natural disasters or lost or abandoned fishing gear.\"", "The upshot is that we don’t have a great idea of how big a contributor the United States is to ocean plastic pollution.", "In a Facebook post, Young America’s Foundation said, \"FACT: Less than 1% of the trash in the ocean is from the United States.\"", "This number stems from a peer-reviewed scientific article, but the post’s wording glosses over nuances about the finding. The 1% figure refers to \"mismanaged\" waste entering the ocean in 2010, and does not take into account the accumulated waste already in the ocean prior to that year.", "In addition, the study only looked at the country that immediately held the waste before it entered the ocean. It’s possible that the United States generated an additional volume of plastic waste that ended up in another country before going into the ocean.", "The statement is partially accurate but leaves out important details, so we rate it Half True.", "Young America’s Foundation, Facebook post, Jan. 2, 2020", "Science magazine, \"Plastic waste inputs from land into the ocean,\" Feb. 13, 2015", "Our World in Data, \"Plastic Pollution,\" September 2018", "Email interview with Richard Thompson, director of the Marine Institute at the University of Plymouth, Jan. 10, 2020", "Email interview with George Leonard, chief scientist at the Ocean Conservancy, Jan. 13, 2020", "Email interview with Roland Geyer, industrial ecology professor at the Bren School of Environmental Science and Management at the University of California-Santa Barbara, Jan. 13, 2020", "Email interview with Kara Lavender Law, research professor of oceanography with the Sea Education Association in Woods Hole, Mass., Jan. 14, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]