["About this rating", "On Oct. 30, 2019, a Facebook user claiming to be a registered nurse at the \"Royal Children’s Hospital, Brisbane\" posted an offer in the anti-vaccine Facebook group “Stop Mandatory Vaccination” to send chicken pox-infected lollipops (courtesy of her son’s recent infection with the virus) to other parents looking to impart “natural immunity” on their children. The post went viral when a screenshot was shared by a pro-vaccine Facebook page named Light for Riley:", "It is unclear, however, if this purported nurse was making a genuine offer, or if the offer itself was a hoax designed to inspire internet outrage. For one thing, there is no actual “Royal Children’s Hospital” in the town of Brisbane, Australia, as reported by Australia’s news.com.au:", "The woman’s Facebook description [claims] she works as a staff nurse at the “Royal Children’s Hospital, Brisbane”. The Royal Children’s Hospital is actually located in Melbourne and while there was a Royal Children’s Hospital in Brisbane, it was renamed to Brisbane Children’s Hospital in 1943 before being changed back in 1967. The only children’s hospital in Brisbane now is called the Queensland Children’s Hospital, which was opened in 2014.", "For another thing, Queensland Health, the entity that oversees all the hospitals in that Australian state, says nobody bearing the name of the alleged nurse works at any of their hospitals:", "Commenting directly on the viral Facebook post, a spokesperson from Children’s Health Queensland confirmed she was not a nurse — nor has she ever been. “There are no current or former employees by that name that have worked for Queensland Health as a registered nurse,” a spokesperson from Children’s Health Queensland said. “This is a serious issue and has been referred to police, who are investigating.”", "We reached out to the Queensland Police Department to ask if its investigation had turned up any new information, and we will update our post if any such information is provided. Because it is unclear who this Facebook user actually is and what the person's motive was behind the post, we rank the claim as “Unproven.”", "Lasker, Alex.   “Anti-Vax Mom Says She Gave Out Lollipops Tainted With Chickenpox for Halloween: 'We Have the Packaging Down Pat'.”\r\n    Yahoo News.   1 November 2019.", "Wolfe, Natalie.   “Police Investigating After Mum Claims to Infect Lollipops With Son’s Chickenpox in Brisbane.”\r\n    news.com.au.   1 November 2019.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]