["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "In a widely shared Facebook video, a woman wearing what looks like a white baker’s hat and a jacket with an ID card pinned to the lapel appears not to realize she’s being recorded. She’s working in front of an espresso machine and appears to be blowing on small paper packages — like cupcake wrappers — to separate them so that she can put pastries inside.", "\"CHECK THIS OUT,\" the video caption on the March 14 post says. \"CORONA VIRUS / DROPLETS IN FULL FORCE …. LET THIS GO VIRAL.\"", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "It’s noisy in the video, and two more people can be seen in the background, including a man rolling dough. But like the woman in the foreground, neither of them is wearing a mask.", "Using InVID, we searched for other places that this video has appeared online. In recent days and weeks, many people have shared it on social media. One tweet, from March 15, says: \"You can wash your hands ALL day long, use alcohol afterwards and protect yourself from the virus as much as you can ... then this happens at your favorite restaurant and you wonder where the covid is coming from.\" Another one from March 12 says: \"There is no point in washing your hands, rubbing alcohol, using a mask, but keep eating coxinha. #coronavirusbrasil\"", "But this video didn’t make its first appearance online in March. We found it published four months ago, on these Russian sites in March and April 2017, and on gfycat.com in March 2017.", "Certainly, watching someone in a commercial kitchen handle food as the woman in the video does could concern viewers anytime, not just during a pandemic.", "Paul Dawson, a professor of food, nutrition and packaging sciences at Clemson University, told us that this \"is definitely NOT an advisable practice regardless of COVID.\"", "\"There are several infectious diseases that can be transferred from the oral cavity,\" he said in an email. \"The only additional question is how long will the packaged food be held before someone eats it. The longer before someone consumes that food, the less chance that the contamination that may have been placed there by the person blowing on the wrapper will survive.\"", "The caption on this Facebook post, and others who have posted the video online, portray the clip as having been recorded recently amid the novel coronavirus outbreak.", "In reality, it was taken at least three years ago, long before the first case of the new coronavirus was reported in late 2019.", "We rate this post False.", "Facebook post, March 14, 2020", "Tweet, March 15, 2020", "Tweet, March 12, 2020", "SaveIG post, visited May 18, 2020", "Life, Topgif: The best of the past 24 hours, April 5, 2017", "Gfycat, Facepalm rage, March 30, 2017", "Pikabu post, March 31, 2017", "Email interview with Paul Dawson, professor of food, nutrition and packaging sciences, Clemson University, May 19, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]