["About this rating", "On 23 January 2018, Courtland Sykes — one of four Republican candidates campaigning for the nomination to challenge Democratic incumbent Claire McCaskill in the November general election — posted a document, \"excerpted and transcribed from interview questions and answers,\" to his campaign’s verified Facebook page with the title \"Do You Favor Women’s Rights?\"", "His answer, which included references to \"hell-bent feminist she devils\" and their \"crazed definition of modern womanhood\" made up to \"suit their own nasty, snake-filled heads,\" was a heavily qualified and logically incongruous \"yes\":", "Well — Chanel, my fiancee, has given me orders to favor them, so I’d better.", "But Chanel knows that my obedience comes with a small price that she loves to pay anyway: I want to come home to a home cooked dinner at six every night, one that she fixes and one that I expect one day to have daughters learn to fix after they become traditional homemakers and family wives—think Norman Rockwell here and Gloria Steinem be damned. [...]", "I support women's rights, but not the kind that has [sic] oppressed natural womanhood for five long decades—the kind of wrongheaded \"women's rights' that allows mean-spirited radical feminists to use political correctness and their little broom label of \"sexist\" to define womanhood and women's rights for me, for my family, for you and your family or for my country and the world. But good news: They're finished. Ask Hillary.", "While Sykes expects Chanel Rion, his fiancee, to have dinner prepared for him at 6:00 every night, it is worth noting that she is not solely a homemaker; she is a political cartoonist popular in pro-Trump circles who, among other causes, has championed Trump’s statement that \"both sides [were] wrong\" during a neo-Nazi rally and counter-protest in Charlottesville, Virginia. This sort of \"home based enterprise\" appears to be what Sykes is advocating for in terms of a woman’s role in society:", "I want daughters to have their own intelligence, their own dignity, their own workspace and their own degrees; I want them to build home based enterprises and live in homes shared with good husbands and I don't want them grow up into career obsessed banshees who forego home life and children and the happiness of family to become nail-biting manophobic hell-bent feminist she devils who shriek from the tops of a thousand tall buildings they are think they could have leaped over in a single bound — had men not \"suppressing them.\" It's just nuts. It always was.", "Sykes, who describes himself not as a member of the alt-right, but part of \"Trump’s America First movement,\" has been a controversial figure since he first announced his candidacy for the Senate in September 2017, opening his campaign with a video linking immigration to violence:", "Republican Courtland Sykes’ Senate campaign video includes an image of a man throwing a Molotov cocktail as the Navy veteran warns that immigration is out of control. Sykes, an Arkansas native who moved to Independence this month, released the video Tuesday to announce his candidacy in the GOP primary [...].", "Sykes’ announcement video includes warnings about immigration, crime and the possibility of nuclear war played over violent imagery before it transitions to a series of laudatory statements about President Donald Trump.", "The political newcomer with few, if any actual ties to the state of Missouri, is \"far from the leading GOP candidate,\" according to CBS News:", "Sykes is far from the leading GOP candidate — he isn't even backed by President Trump, whose values Sykes claims to espouse. Mr. Trump has casually endorsed Missouri's GOP Attorney General Josh Hawley, the favored Republican in the race.", "He had previously been accused espousing sexist views on the campaign trail, and has drawn ire for sharing memes comparing his opponent, Senator McCaskill, to Ursula, the villain in Disney’s The Little Mermaid. Those memes also compare Hillary Clinton and Elizabeth Warren to other female Disney villains.", "Courtland Sykes for U.S. Senate.   “Do You Favor Women’s Rights?”\r\n    23 January 2017.", "Lowry, Bryan.   \"Pro-Trump Candidate in Missouri Pairs Images of a Riot With Warnings on Immigration.\"\r\n    Kansas City Star.   27 September 2017.", "Watson, Kathryn.   \"Missouri U.S. Senate Hopeful Who Expects Dinner from Fiancée Nightly Says Feminists Have \"Snake-filled Heads.\"\r\n    CBS News.   25 January 2018.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]