["Dominated by law and order and also covering the economy and his administration’s response to the coronavirus pandemic, Trump’s speech on August 27, 2020 came 66 days before the November 3 election.", "AFP Fact Check breaks down Trump’s claims below.", "“Make no mistake, if you give power to Joe Biden, the radical left will defund police departments all across America,” Trump said.", "“They will make every city look like Democrat-run Portland, Oregon. No one will be safe in Biden's America,” he said.", "But unrest in Portland and other cities mentioned by Trump in his remarks took place with him in office, and Biden has not encouraged it.", "The Democratic candidate has said on multiple occasions that he does not want to “defund the police,” a phrase that became a rallying cry after the killing of unarmed black man George Floyd in Minneapolis police custody at the end of May.", "In a June op-ed in USA TODAY, Biden wrote: “While I do not believe federal dollars should go to police departments violating people’s rights or turning to violence as the first resort, I do not support defunding police.”", "And in his first televised joint interview with running mate Kamala Harris, aired on August 23, he told ABC: “I don't want to defund police departments. I think they need more help, they need more assistance.”", "Biden did however agree in a conversation with activist Ady Barkan that some funding for police could be redirected -- a statement that Vice President Mike Pence used to criticize the Democratic candidate on the third night of the convention.", "Ultimately, funding for the police is a matter decided on the state and local level, meaning that a president’s role in the matter is limited.", "“When I took bold action to issue a travel ban on China, very early indeed, Joe Biden called it hysterical and xenophobic. And then I introduced a ban on Europe, very early again,” Trump said.", "But rather than a ban on travel from China, the president imposed restrictions, effective February 2, accompanied by multiple exemptions. Only foreign nationals who had been in China within the past 14 days were banned. US citizens present in Hubei province within the same time period were subject to a mandatory quarantine upon returning home.", "Almost 40,000 Americans and other authorized travelers came into the US from China in the two months that followed Trump’s restrictions, according to an analysis by The New York Times.", "Trump suspended travel from Europe starting on March 13, but it too was not a complete ban, due to various exemptions. The United Kingdom was initially excluded by Trump but was later added to the travel restrictions.", "Trump also said that “to save as many lives as possible, we are focusing on the science, the facts and the data.”", "But especially in the early stages of the crisis, Trump repeatedly made comments downplaying the danger of the virus, such as comparing it to the common flu on March 9. On February 27, Trump had said the risk the virus posed to the American people was \"very low” and that the number of cases “is going to be down to close to zero” within days.", "And although the US Centers for Disease Control and Prevention recommended on April 3 that Americans wear face masks to help curb the spread of the virus, Trump refused to do so in public until July, a stance that was embraced by his political supporters. The president did not take a firm stance in support of masks until later that month, as cases rose in southern states.", "As of August 28, the coronavirus has killed more than 180,000 people in the United States and infected more than 5.8 million.", "“Within three short years, we built the strongest economy in the history of the world,” Trump said.", "This is false. The US Department of Labor in January 2020 issued revised numbers, which showed significantly slowed job growth during the first three years of the Trump administration.", "Some 6.5 million jobs were added between 2017-2019 -- 2.109m, 2.314m (Trump’s best year) and 2.096m. This compared to more than eight million jobs -- 3.004m, 2.72m and 2.345m -- in the three years before, under president Barack Obama.", "Despite these numbers, Trump misrepresented Biden’s record as Obama’s vice president.", "“Joe Biden is not the savior of America’s soul -- he is the destroyer of America's jobs, and if given the chance, he will be the destroyer of American greatness,” said Trump.", "Growth measured by gross domestic product (GDP) has not set records under Trump either. The best year of his presidency saw a three-percent rise in 2018, compared to 3.1 percent in 2015 under Obama. As recently as 2004 and 2005, under president George W. Bush, the economy grew 3.8 percent and 3.5 percent, respectively.", "“We will always, and very strongly, protect patients with pre-existing conditions, and that is a pledge from the entire Republican Party,” Trump said.", "But Trump’s Justice Department argued in a brief to the US Supreme Court that the Affordable Care Act (ACA) -- which requires insurance companies to cover pre-existing conditions -- should be struck down.", "The Trump administration has not provided an alternative to the ACA -- a signature piece of legislation known as Obamacare that was signed into law by the president’s predecessor -- meaning that if it is invalidated, protection for pre-existing conditions would end.", "In a July 19 interview with Fox News, Trump said: “We're signing a health care plan within two weeks.” More than a month later, such a plan has yet to materialize.", "AFP Fact check has debunked other inaccurate claims made during the Republican convention in articles available here and here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]