["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Funding for women’s health care in New Jersey has become a line of attack in the race between U.S. Sen. Robert Menendez, D-N.J., and his Republican challenger, state Sen. Joe Kyrillos, R-Monmouth.\n\nIn their first debate Thursday before the general election on Nov. 6, Menendez claimed that Kyrillos has voted six times to oppose women’s health care funding.\n\n\"When he had an opportunity to vote for women in terms of their health care, not once, not twice, but six times, he voted against women’s health care in our state,\" the Democratic senator said near the start of the debate.\n\nHe repeated the claim in his closing statement: \"And not once, not twice, but six times he voted against funding for women’s health care in our state, while I was bringing millions of dollars for those women to get health care.\"\n\nThe senator’s claim is on solid ground. Between June 2010 and June 2012, Kyrillos voted six times against providing about $7.5 million for family planning services, which could include breast exams, pregnancy testing and treatment of sexually transmitted diseases. The money could not be used for abortion procedures.\n\nChapin Fay, Kyrillos’ campaign manager, responded in a statement: \"New Jerseyans know that Joe Kyrillos is a pro-choice Republican who's voted for millions of dollars in women's health initiatives, and that's a fact.\"\n\nLet’s go through those six votes.\n\nSince Gov. Chris Christie, a Republican, eliminated the money in his budget for fiscal year 2011, the Democrat-led state Legislature has tried unsuccessfully to restore it. As we found in a previous fact-check, that funding reduction led to the closure of six family planning centers across the state.\n\nThe first set of Kyrillos’ votes occurred on June 28, 2010, when the state Senate considered a bill that would restore the roughly $7.5 million. The Senate cast two sets of votes to pass the bill, and Kyrillos voted no each time.\n\nThe state Assembly later passed the bill, but Christie vetoed it.\n\nOn Sept. 20, 2010, the Senate failed to get enough votes to override the veto. Kyrillos voted against the override.\n\nOn May 23, 2011, the Senate put forward another bill that would restore the funding for fiscal year 2011, and Kyrillos voted no. That bill passed the Senate, but was not voted on in the Assembly.\n\nSoon afterward, the legislature included the $7.5 million in the fiscal year 2012 budget sent to the governor, but Christie eliminated that funding as part of his line-item vetoes.\n\nOn July 11, 2011, when the Senate fell short of having enough votes to override that veto, Kyrillos voted against the override.\n\nThe most recent vote occurred on June 25, 2012, when the Senate passed a bill that would restore the funding for fiscal year 2012. Kyrillos voted no.\n\nThe Assembly also passed the bill that day, but Christie later vetoed it.\n\nHere’s a chart breaking down Kyrillos’ votes against funding for family planning services:", "*Due to an error in the original bill, the Senate voted twice on final passage of the legislation.", "Our ruling\n\nIn a debate last week, Menendez said in reference to Kyrillos: \"When he had an opportunity to vote for women in terms of their health care, not once, not twice, but six times, he voted against women’s health care in our state.\"\n\nThe senator’s claim is on target. Between June 2010 and June 2012, Kyrillos voted six times against providing about $7.5 million for family planning services.\n\nWe rate the statement True.", "To comment on this ruling, go to NJ.com.", "NJTV, NJ Decides 2012: Kyrillos/Menendez Debate for U.S. Senate, Oct. 4, 2012\n\nPolitiFact New Jersey, Cory Booker blasts Chris Christie for slashing funding to Planned Parenthood, causing a reduction in health services, Sept. 4, 2012\n\nPolitiFact New Jersey, State Sen. Loretta Weinberg says six of New Jersey’s 58 family planning centers closed because of budget cuts, June 10, 2011\n\nSenate Bill S-2139, vetoed by Gov. Chris Christie\n   \nSenate Bill SCR-210, a bill to override Gov. Chris Christie’s veto\n\nSenate Bill S-2899, passed by the New Jersey State Senate\n   \nSenate Bill S-788, vetoed by Gov. Chris Christie\n\nMenendez campaign website, Senator Menendez Keeps Command of 2012 Senate Race at First Debate, Oct. 4, 2012\n\nOffice of Legislative Services, Analysis of the Department of Health and Senior Services Budget: Fiscal Year 2010-2011, April 2010\n\nE-mail interview with Paul Brubaker, communications director for Menendez campaign, Oct. 5, 2012\n\nE-mail interview with Meaghan Cronin, spokeswoman for state Sen. Joe Kyrillos, Oct. 5, 2012", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]