["A viral video claiming to show ballots in Virginia for President Donald Trump being burned is making the rounds on social media after Democrat Joe Biden was projected to win the state's 13 electoral votes on Tuesday.", "The video, which has been viewed over 400,000 times on Instagram, purportedly shows a man putting \"about 80\" alleged pro-Trump ballots in a plastic bag and covering them with flammable liquid before setting them on fire.", "While the location is not specified, the video reveals candidates listed on the papers are from Virginia Beach, Virginia.", "The claim gained more traction after Eric Trump retweeted the video on Twitter with the caption \"Burning 80 Trump ballots.\"", "The claim also made its way to The Gateway Pundit, a conservative news outlet.", "USA TODAY reached out to the Instagram user, Eric Trump and the Gateway Pundit for comment.", "Fact check: Sharpie is 'perfectly fine' for Michigan ballots. In some counties, it is 'preferred.'", "Virginia Beach officials confirmed on Tuesday that the ballots are actually sample ballots and are not real.", "\"A concerned citizen shared a video with us that ostensibly shows someone burning ballots,\" the city said in a statement. \"They are NOT official ballots, they are sample ballots\"", "Virginia Beach staff also pointed out the absence of a bar code when the man picks up one of the ballot's in the video, noting that all official ballots have bar codes.", "In response to Trump's tweet, the city of Virginia Beach responded on Twitter, \"Those were sample ballots. Addressed this yesterday.\"", "Officials added that \"fire investigators are looking into the illegal burning.\"", "Christine Lewis, Virginia Beach's deputy registrar, told CNN that her office quickly noticed the deception in an effort to prevent the spread of misinformation.", "Local news outlets WTKR and WAVY-TV also debunked the video of the fake ballots on Election Day.", "Twitter has suspended the original account that posted the false information, which was retweeted by Trump.", "Fact check: No, Wisconsin did not take a break from counting election results", "City officials in Virginia Beach have confirmed that a video shows sample ballots. There is no evidence that ballots burning in a viral video were real ballots. We rate this claim as FALSE.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]