["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The claim was made during debate about defunding the police in Minneapolis in the wake of the death of George Floyd while in police custody.", "6,320 refugees from Somalia, which is nearly 100% Muslim, were resettled in Minnesota under President Barack Obama.", "There is no evidence of an effort to establish Sharia or Islamic law as part of any effort to defund police in Minneapolis.", "Amid nationwide demonstrations against police brutality, some protesters are demanding the defunding of police departments.", "A Facebook post claims the reason why protesters in Minneapolis are calling for defunding police is that they want to establish Islamic law there. The claim ignores the fact that the city is where George Floyd died May 25 after a police officer kneeled on his neck for nearly nine minutes, sparking weeks of local and national protests.", "\"The point of defunding the Police in Minneapolis is that Minnesota is where Obama settled 1 Million Islamics. They want Sharia Law,\" the June 8 post stated.", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Let’s unpack this.", "The talk of defending the police doesn’t necessarily mean defunding them entirely.", "As we’ve reported, while some protesters want to eliminate police departments, others want to revisit the functions of the police and redirect some of that funding toward other services.", "In Minneapolis, the City Council voted June 12 to begin efforts toward getting a charter amendment referendum on the November ballot. The proposal would eliminate the Minneapolis Police Department as a charter department and create a new public safety organization. A majority of council members have said they favor dismantling the Police Department.", "Refugee resettlement typically is reported based on the countries where refugees arrive from, not the religion they might practice. Minnesota, which has about 5.6 million people, has the nation’s largest number of people from Somalia, where more than 99% of the population is Muslim.", "Islam’s followers are Muslims, not \"Islamics.\" About 1% of Minnesota’s population is Muslim.", "We rated as Pants on Fire a claim that President Barack Obama settled 43,000 Somalian refugees in Minnesota as part of plans to elect Rep. Ilhan Omar, a Muslim and Minnesota Democrat, in 2018. About 6,320 refugees from Somalia were resettled in Minnesota between 2009 and 2017, when Obama served as president, but the pattern of Somali settlement in Minnesota long predated Obama’s tenure in the White House.", "As we’ve reported, Sharia is a form of Islamic law, although Muslims differ on its interpretation. It is a wide-ranging set of rules that govern aspects of Islamic life, including religious practice, daily living and financial dealings.", "Muslims living in the United States can put marital disputes and other personal matters in front of a tribunal made up of leaders of their faith. That’s allowed and has been used by Catholics, Jews, Lutherans, Baptists and other religions for decades. It falls under the umbrella of mediation, when people agree to work out their differences through a process outside of the courts.", "For any other situation, the government’s legal system prevails. .", "As Cyra Akila Choudhury, a law professor at Florida International University, told us for another fact-check: \"If Muslims choose to abide by Sharia as a private matter with regard to the practice of their religion, it is protected by the Constitution insofar as the practice does not contravene the laws of the land. So, for example, Sharia principles of criminal law would not be given accommodation.\"", "We didn’t find evidence of any effort to establish Sharia in Minneapolis.", "Micaela Schuneman, refugee services director for the International Institute of Minnesota, a nonprofit that does refugee resettlement in the Twin Cities, told PolitiFact that claiming that Muslims want to install Sharia \"is a fear tactic often cited by people opposed to refugee resettlement. But I am unaware of plans in any Minnesota communities to pass new laws or ordinances\" based on Sharia.", "The Council on American-Islamic Relations, which describes itself as the nation’s largest Muslim civil rights and advocacy organization, on June 10 called for dialogue with St. Charles, Mo., Mayor Dan Borgmeyer after Borgmeyer \"falsely\" claimed that Muslims in Minneapolis are seeking to enact Islamic principles into law.", "A Facebook post claimed: \"The point of defunding the Police in Minneapolis is that Minnesota is where Obama settled 1 Million Islamics. They want Sharia Law.\"", "The number of refugees from Somalia, which is nearly 100% Muslim, resettled in Minnesota under Obama is 6,320. Minneapolis is where the death of George Floyd occurred, touching off protests against police racism brutality. There is no evidence that efforts to defund the police in Minneapolis are at all related to Sharia.", "We rate the post False.", "Facebook, post (archived here), June 8, 2020", "Associated Press, \"Obama did not resettle 70,000 Somali refugees in Minnesota,\" April 18, 2019", "Council on American-Islamic Relations, news release, June 10, 2020", "PolitiFact, \"‘Defund the police’ movement: What do activists mean by that?\", June 9, 2020", "PolitiFact, \"Meme wrong about Somali-Americans in Ilhan Omar's district,\" March 5, 2019", "PolitiFact, \"Ask PolitiFact: Are there communities in the US under Sharia law? No,\" Sept. 3, 2019", "Minnesota Public Radio, \"Minneapolis council takes steps to put police department changes before voters,\" June 12, 2020", "Harvard Divinity School, \"Islam in Somalia,\" accessed June 14, 2020", "Institute for Social Policy and Understanding, \"American Muslim Poll 2019,\" May 1, 2019", "Email, Islamic Resource Group, based in St. Anthony, Minn.,  executive director John Emery, June 15, 2020", "Minnesota Legislative Reference Library, \"Immigrants in Minnesota,\" January 2020", "Email, Micaela Schuneman, refugee services director for the International Institute of Minnesota, a nonprofit that does refugee resettlement in the Twin Cities, June 15, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]