["After Vice President Kamala Harris’ historic swearing-in on Jan. 20, social media users started circulating claims that Harris purportedly refused to rest her hand on the Bible while taking the oath of office.", "“She did NOT place her hand on the Bible as you can clearly see when she was inaugurated while being sworn in, a purse/wallet is on top of that Bible,” a Facebook user wrote. The post included a photo of Harris placing her hand on a black object on top of a thick copy of the Bible.", "The post has been shared more than 400 times. USA TODAY has reached out to the user for comment.", "More:Fact check: Meme with images of Biden, Trump inaugurations draws false comparison", "Harris used two Bibles to be sworn in on Jan. 20, USA TODAY reported. One Bible belonged to the late civil rights icon and Supreme Court Justice Thurgood Marshall, who helped inspire her career path. The second Bible belonged to family friend Regina Shelton, whom Harris called a “second mother” to her and her sister.", "\"Mrs. Shelton would bring her Bible to church every Sunday. Sitting alongside her, I was introduced to the teachings of that Bible,\" Harris wrote in a Bustle article in 2019.", "A Getty Image photo of Harris’ swearing-in, captured at a different angle, shows that the black object Harris rested her hand on is a copy of the Bible.", "Harris’s faith has come under scrutiny, with some social media users making similar allegations that Harris previously refused to use a Bible to be sworn in. Harris identifies as a Baptist and she used a Bible to be sworn in as a U.S. senator in 2017, USA TODAY reported.", "In December, social media users circulated false claims that Harris said Christmas should not be a federal holiday. Some users also baselessly claimed she called churches \"propaganda centers,\" according to USA TODAY.", "More:Fact check: Arizona Senate, Maricopa County negotiating deal on election data", "Growing up with a Christian father and a Hindu mother, Harris attended services at both a Black Baptist church and a Hindu temple. Harris celebrates both Christmas and Hanukkah with her husband, Doug Emhoff, who is Jewish, USA TODAY reported.", "The claim that Vice President Kamala Harris placed her hand on a purse or a wallet instead of a Bible during her swearing-in is FALSE, based on our research. She used two Bibles on Inauguration Day.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook."]