["By Eugene Kiely, Caroline Wallace, Robert Farley and Lori Robertson", "Posted on October 14, 2016", "At this stage of the campaign, we often hear similar claims repeated over and over in stump speeches. As part of our running feature on those repeats, “Groundhog Friday,” we note here some of the misleading talking points we heard this week. It is by no means an exhaustive list. Follow the links to our original stories for more on each claim.", "Democratic presidential nominee Hillary Clinton on GOP nominee Donald Trump’s comments about wages, Oct. 10 rally in Detroit: “So, if people — if people aren’t worried about the fact he pays no income tax and if they’re not worried about how he’s misled people about where he gets his steel, point out to them that he actually stood on a debate stage during the Republican primaries and said, ‘Wages in America are too high.’ You know, I love it. He keeps denying these things. And he must forget that we do have video and audio in 2016 and you can actually pull it out again and show people.”", "This Democratic talking point has been around since at least the Democratic National Convention in July, when we first wrote about it when it was used by Sens. Bob Casey and Kirsten Gillibrand. It has been repeated by others, including Vice President Joe Biden, since then.", "Trump did use the phase “wages too high” at a Nov. 10, 2015, GOP debate, as Clinton said. But Trump made his remark when he was asked about raising the federal minimum wage to $15. He said he was opposed to raising the minimum wage; he did not say that the overall wages are currently too high.", "“[T]axes too high, wages too high, we’re not going to be able to compete against the world. I hate to say it, but we have to leave it the way it is,” he said. When he was asked about that “wages too high” comment two days later, he told Fox News: “And they said should we increase the minimum wage? And I’m saying that if we’re going to compete with other countries, we can’t do that because the wages would be too high. … The question was about the minimum wage. I’m not talking about wages being too high, I’m talking about minimum wage.”", "“Democratic Convention Day 1,” July 26", "https://www.sharethefacts.co/share/71fe945f-7495-4e13-8f61-b39a9138c3c4", "Clinton on Trump calling the military “a disaster,” Oct. 12 rally in Las Vegas: “He’s called our military a ‘disaster.’ Now, how can you be the commander in chief if you don’t respect the men and women who serve in the United States military?”", "As her running mate, Tim Kaine, has done, Clinton cherry-picks Trump’s words. The Republican nominee did say, in a January primary debate, “Our military is a disaster.” But he has made clear on numerous occasions that he’s referring to the funding of the military, not the men and women who serve in the armed forces. For instance, here’s Trump on Sept. 12 speaking at a National Guard Association Convention: “My plan calls for a major rebuilding of the entire military and the elimination of the defense — and we have to do this so quickly, it’s a disaster — of the defense sequester. It is a disaster. Have no choice, it is a disaster. It’s called depletion. We have been depleted as a military, we can’t let that happen. The greatest men and women on Earth, but we have been depleted by what’s taken place,” Trump said.", "“Kaine Twists Words of GOP Rivals,” Sept. 16", "https://www.sharethefacts.co/share/5d40c83b-cfe1-4ba4-9f91-19b08b04d2b1", "Republican presidential nominee Donald Trump on New York job loss, Oct. 10 rally in Ambridge, Pennsylvania: “And Hillary Clinton doesn’t have a clue about how to bring back jobs, that I can tell you, folks. She doesn’t have a clue. If she wanted to, she couldn’t do it. You know, in New York state, she ran for the Senate. And you know upstate New York is a disaster for jobs. And she said, ‘I’m going to bring back 200,000 jobs.’ Guess what? Right down the tubes, worse today than ever before.”", "This is a new twist on an old claim. As we have written before, Trump exaggerated when he claimed last month that New York’s job losses during Hillary Clinton’s eight years as the state’s U.S. senator were “worse than just about any place in the country.” This time, Trump is flat-out wrong when he claimed that New York is “worse today than ever before.”", "It is true, as Trump said, that Clinton in the 2000 campaign promised 200,000 jobs for upstate New York that did not materialize, as documented in an Aug. 7 Washington Post article. But New York is not “worse today than ever before.” As of August, New York’s unemployment rate stood at 4.8 percent, a tick below the national average and well below what it was in 1976, when it was above 10 percent for the entire year. The August unemployment rate in the upstate areas of Buffalo (4.7 percent), Rochester (4.5 percent) and Albany (4 percent) are all roughly half what they were during the Great Recession.", "“Trump’s Job Loss Exaggeration,” Sept. 14", "https://www.sharethefacts.co/share/372fac31-a9b1-4302-8925-83a302da6c62", "Trump on Clinton’s coal stance, Oct. 10 rally in Ambridge: “[W]eeks before Hillary Clinton made a statement someplace else before going to West Virginia and trying to get their vote, if you can believe this, she said we are going to close the mines and we’re going to put the miners out of work. Then she went to West Virginia and she tried to convince them, well, she didn’t mean it.”", "Trump is referring to Clinton’s comments at a CNN town hall forum in March in which she said she wants to “move away from coal,” but added, “we don’t want to forget those people.” She promised to bring renewable energy jobs to coal country to replace lost coal jobs.", "“GOP Convention, Day 2,” July 20", "https://www.sharethefacts.co/share/49caec93-cf5b-4a68-84e8-0c1222d8c4f2", "Donald Trump on Clinton’s emails, Oct. 10 rally in Wilkes-Barre: “33,000 emails … she deletes them, she bleaches them, that nobody does because it’s such an expensive process. … After she gets the subpoena, she does that.”", "This is a two-fer. Let’s start with the claim that Clinton “bleached” some of her emails, which Trump went on to describe as unusual and expensive. This frequent line from Trump is wrong on two counts: The software used to delete Clinton’s emails is free, and no chemicals were used. The FBI said that Platte River Networks, which set up and maintained Clinton’s server, used an open-source software program called BleachBit. BleachBit debunks Trump’s claims on its FAQ page: “Actually, it is completely free of charge for everyone in all situations.” It also says, “BleachBit is neither a chemical nor a physical device. BleachBit is an anti-forensics software application.”", "Trump also twists the facts when he says Clinton deleted emails after she got a subpoena. It is true that 31,830 emails that Clinton’s lawyers deemed personal were deleted after Clinton received a subpoena from a Republican-controlled House committee investigating the 2012 deaths of four Americans in Benghazi. But there is no evidence that Clinton knew that the emails were deleted after the subpoena was issued. The Clinton campaign directed a contractor managing Clinton’s server to delete the emails in December 2014. But the contractor didn’t get around to deleting the emails until late March 2015, after the subpoena was issued. The Clinton campaign says she only learned about the delay in deletions when the FBI released its report on its investigation in September, and we have found no evidence to contradict that.", "“Trump, Pence ‘Acid Wash’ Facts,” Sept. 8", "“The FBI Files on Clinton’s Emails,” Sept. 7", "https://www.sharethefacts.co/share/0c26a8ef-2ed8-4b67-b2bf-12ea7ea2e842", "Trump on Clinton and the red line with Syria, Oct. 10 rally in Wilkes-Barre: “And even the bad media admitted – you know when I said the line in the sand and she said ‘I wasn’t Secretary of State.’ Unfortunately, she was. She lied again.”", "Trump is referring to President Obama’s threat to use military force if Syrian President Bashar Assad used chemical weapons against his own people. But as was the case in the second debate, it’s unclear to us whether Trump was referring to Obama making the threat or not following through on it. As we noted then, Clinton was in office when Obama made his threat in August 2012, but not when the president defended his failure to back it up in September 2013. However, she did publicly support that decision even though she was no longer in office.", "“FactChecking the Second Presidential Debate,” Oct. 10", "https://www.sharethefacts.co/share/3f65fd19-ee05-4dba-ae68-3bd7de8175ab", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]