["About this rating", "In December 2018, a photograph showing a pelican and a dog lying together on a pier was posted by the Twitter account \"For Pitty's Sake,\" along with a piece of text that explained the supposed back story for the image:", "NEWS THAT MATTERS: A pelican befriended a stray dog who was often spotted hanging out all alone along the boat docks. The man who photographed this has adopted him but brings him back every day to see his friend, Petey the Pelican.", "The photograph is real, but the accompanying back story is not related to it. The pelican seen in this image was named \"Osman\" and not \"Petey,\" and he was sort of a town mascot in Turkey. The photograph is at least a decade old, and Osman the pelican has since died.", "We have not been able to identify the photographer who snapped this specific picture, but our searches uncovered a number of other photographs of this unusual pairing of bird and canine that were snapped in Erdek, Turkey, circa 2007. Details about the dog proved to be scarce (Turkey does have a large population of stray street dogs), but we found numerous photographs, videos, and news articles about Osman in that Turkish town.", "Osman the Pelican and the pictured dog truly did form an unlikely friendship. We found nearly a dozen photographs of the pair walking, playing, eating, and sleeping on the Turkish shore:", "Osman had numerous adventures, according to local reports. For instance, the pelican apparently didn't fly well due to age or injury, so he often hitched rides with local fishermen to the nearby island of Marmara. Osman also took the stage during a ceremony for the opening of a police station (as seen in the center image of the above-displayed collage), and while Osman was apparently one particular dog's good friend, this pelican was once attacked by other local canines.", "But perhaps the most relevant detail we came across dealt with the death of Osman and the end of this unusual friendship. According to a fisherman in Erdek, the dog stopped coming to the beach after his pelican friend died:", "Since the death of Osman the pelican, the dog has stopped appearing on the beach. An Erdek fisherman said, \"Osman the pelican died, and after that the friendly, cute dog was no longer seen on the beach. Normally, the dog and pelican were never separated from each other. Tourists visiting Erdek often took photographs of the two of them. Their friendship was a news story on many television channels. After the death of Osman, the dog disappeared from the beach.\"", "T24.   \"Pelikan Osman Unutulmadı.\"\r\n    11 August 2011.", "Haberler.   \"Pelikan Osman Erdek'in Maskotu Oldu.\"\r\n    2 May 2007.", "Sidner, Sara.   \"How Istanbul's Abandoned Street Dogs End Up in America.\"\r\n    CNN.   1 January 2016.", "Haber7.   \"'Pelikan Osman'ın Yeni Dostu.\"\r\n    14 August 2007.", "IHA.   \"Arkadaş Kaybına Dayanamadı Evini Terk Etti.\"\r\n    10 October 2008.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]