["The posts -- here, here and here -- misleadingly combine false quotes with actual remarks made by Kissinger, who remains an important, if controversial, figure on foreign policy matters.", "The wording has been altered by different users, as has Kissinger’s age. He is 96, but some posts claim he is 95.", "Purportedly quoting Kissinger on Trump, one post says: “Liberals and all those who favor (Hillary) Clinton will never admit it. They will never admit that he is the one true leader.\"", "It also criticizes the presidency of Barack Obama: \"After eight years of tyranny, we finally see a difference.”", "The post then goes to an overtly flattering quote about the US president, again attributing it to Kissinger: “Trump puts America and its people first. This is why people love him and this is why he will remain in charge for so long. There is not a single thing wrong with him and people need to open their eyes.”", "Some of the Facebook posts directly quote Kissinger, who served under presidents Richard Nixon and Gerald Ford, though others cite the remarks as reported speech.", "None of those statements were made by Kissinger, according to Courtney Glick, an assistant to the German-born former US diplomat, who was national security advisor prior to becoming secretary of state, a role he held until 1977.", "Glick, of the Kissinger Associates consulting firm, told AFP in an email: “I had the opportunity to speak with him about this further and he asked me to confirm with you that the comments you defined as suspicious are inventions, and they should be removed from Facebook.”", "The genuine remarks by Kissinger were made in a television interview that took place in December 2016, a month after Trump’s election victory but before he took office.", "The veteran diplomat gives credit to Trump for securing a shock victory over Democrat Hillary Clinton and, starting at the 5:07 minute mark, assesses what might happen during a Trump presidency.", "AFP Fact Check has previously debunked examples of celebrities and prominent public figures  such as Ron Howard and Tim Allen being falsely cited by Facebook users as supporting politicians or espousing political views online.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]