["About this rating", "In March 2016, the above-displayed image started circulating on Facebook, purportedly showing an official news release from the U.S. Department of the Interior stating that President Obama was preparing to reduce the size of the Navajo Nation by some four million acres:", "Due to the work involved to maintain sheep, the Navajo people have very significantly reduced the number of sheep on the reservation land. The need for vast amounts of grazing land is no longer needed by the reservation. Much of the reservation is no longer inhabited as the population has moved from rural area and congregated in a few cities on the reservation or near the reservation.", "The above-displayed letter is not an official news release from the U.S. Department of the Interior.  We found no mention of President's Obama's supposed plan to take land away from indigenous peoples posted on the Department of Interior's web site (which includes sections for recent news and press releases) or in the organization's social media accounts, nor did we find any mention of it on the official Navajo tourism department's web page. Additionally, if it were real, a plan of this magnitude would have spawned multiple articles and stories across news media. These articles, however, do not exist.", "This letter appears to be a commentary that recasts the background of the recent armed occupation of Oregon's Malheur National Wildlife Refuge by militants challenging the control and use of federal lands into one involving the Navajo, in order to highlight how the public would react differently to similar circumstances if Native Americans were the focus of the federal government's actions.  It may also be a commentary on the recent government transfer of land said to be sacred to the Apache to a foreign-based mining company (a move that Secretary of the Interior Sally Jewell opposed). A lawsuit over mismanaged mining and logging on Navajo trust lands ended with a landmark settlement from the Obama administration in 2014).", "We've reached out to the U.S. Department of the Interior for comment but have not yet received a response.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]