["On Tuesday, January 26, farmers’ unions decided to take out tractor rallies in Delhi in protests against the centre’s farm bills. Smaller rallies were also held in multiple locations around the country in support of the farmers’ agitation.", "A video of a vehicle running over elderly women has been shared multiple times on Twitter and on Facebook with varying claims that blame both protestors and the BJP for the women’s deaths during protests.", "(Warning: Content in the video may be distressing for some. Viewer discretion is advised.)", "Social media in-charge of BJP Mahila Morcha Priti Gandhi shared the video with the hashtag #FarmersProtestHijacked. She alluded that protestors ran over women with a tractor.", "Sharing deeply distressing, heart wrenching visuals from #FarmersProtestHijacked.", "Two old Women were killed & three badly Injured when a tractor ran over them.", "Not just the protesters, even those who are supporting them have blood on their hands!! pic.twitter.com/1LHPruIAqe", "— Priti Gandhi – प्रीति गांधी (@MrsGandhi) January 28, 2021", "Congress leader Alka Lamba too shared the video however with a polar opposite claim. She blamed BJP workers for killing two elderly women who had come to participate in the farmers’ rally", "हे राम.. :(, घोर अनर्थ आरोप है कि किसान आंदोलन में हिस्सा लेने पहुँच रही बुजुर्ग महिला किसानों को गुस्से में #BJP के कार्यकर्ता ने कुछ रोंद डाला… किसी मीडिया ने यह तस्वीरें दिखा क्या BJP नेताओं से सवाल किए..? शर्मनाक – पीड़ादायक :(.#FarmersProstest pic.twitter.com/vyH9WujRH0", "— Alka Lamba – अल्का लाम्बा 🇮🇳🙏 (@LambaAlka) January 29, 2021", "The third claim does not blame any group but alleges that the women were purposely mowed down by a water tanker in Delhi. The message claimed that the tanker belongs to ‘Aggarwal Co’.", "Alt News has received a fact-check request for the video on its WhatsApp number (+91 7600011160) with this claim.", "“गाजीपुर बॉर्डर पर बिजली काटने के बाद सुबह के समय जब पानी बंद किया तो गाजियाबाद नगर निगम जबरन पानी के टैंकर ले जाने लगा महिला किसान आगे लेट गई तो महिलाओं के ऊपर ट्रैक्टर चढ़ा कर यूपी सरकार अपने पानी के टैंकर वापस ले गई.” (After electricity was discontinued at Ghazipur border and the water was also cut-off in the morning, Ghaziabad Municipal Corporation attempted to forcefully take away a water tanker. When women farmers laid down in front of the tanker, they were run over and UP government took away its tanker.) – reads the claim.", "The video is also circulating with an identical claim on Twitter.", "@narendramodi @AmitShah @myogiadityanath @1stIndiaNews @ABPNews गाजीपुर बॉर्डर पर बिजली काटने के बाद सुबह के समय जब पानी बंद किया तो गाजियाबाद नगर निगम जबरन पानी के टैंकर ले जाने लगा महिला किसान आगे लेट गई तो महिलाओं के ऊपर ट्रैक्टर चढ़ा कर यूपी सरकार अपने पानी के टैंकर वापस ले pic.twitter.com/y3IS8Jj9AJ", "— @krishan Choudhary (@AZMIX40998093) February 2, 2021", "It is widespread on Facebook.", "This fact-check has been divided into two sections that separately answer the following questions:", "1. Where did the incident take place?", "2. Were the women intentionally killed?", "Incident from Amritsar", "Viral social media claims suggest that the incident took place in Delhi during the tractor parade. However, according to multiple news reports, when a group of women stepped out to participate in farmers’ protest in Vallah town of Amritsar, a water tanker ran over them. The incident took place on January 26.", "Jagran and Amar Ujala were among the local media organisations that reported on the incident. A copy of ANI’s story was carried by NDTV, Zee News and various other outlets. While ANI’s report says two women were killed and three others injured, Jagran says two women died and five other women were injured.", "SHO Sanjeev Kumar of Vallah police station confirmed to Alt News that two women Ninder Kaur and Simranjit Kaur had succumbed to injuries while three other women were wounded.", "Women died in an accident", "The driver of the water tank Shuklal Singh was handed over to the police by locals. An FIR was lodged against him under IPC sections 304 (Punishment for culpable homicide not amounting to murder) and 427 (Mischief causing damage to the amount of fifty rupees).", "SHO Kumar said that Shuklal Singh is a small contractor and in order to save time, he decided to drive the tanker himself. While doing so he lost control and ran over protestors. The driver is on remand and the officer further said that he didn’t carry a driver’s license.", "There are no reports that suggest that the driver had political links. Furthermore, the incident is unrelated to the Republic Day protest in Delhi. It took place in Amritsar. Right-wing propaganda website OpIndia’s fact-check of the video carries the false information that the women were mowed down by a tractor that was a part of farmers’ protest.", "Donate Now", "Kalim is a journalist with a keen interest in tech, misinformation, culture, etc", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]