["About this rating", "Some politicians complained that less pork was being served in Germany, diluting the country's culinary cultural heritage.", "Germany has banned pork in any way, shape, or form.", "On 7 March 2016, British tabloid Express reported that some German cafes and schools were phasing out pork products. The headline (\"GERMANY BANS SAUSAGES\") naturally made some readers infer that the country had banned pork entirely.", "The article itself described a less alarming scenario, in which a single politician said that pork was slowly disappearing from schools and cafeterias, and extrapolating that it was because Muslims were possibly objecting to its presence:", "SCHOOLS and canteens in Germany have BANNED pork from their menus over fears of offending Muslim migrants, a top politician has revealed.", "An increasing number of public canteens, child daycare centres and schools have stopped serving sausages, bacon and ham over religious considerations.", "Now members of Chancellor Angela Merkel’s CDU party are fighting to keep pork on the menu, insisting the consumption of pork is part of German culture.", "Daniel Günther, party representative, claimed that pork products were being taken off the menu in schools, nurseries and canteens across the country.", "He said: \"The protection of minorities - including for religious reasons - must not mean that the majority is overruled in their free decision by ill-conceived consideration.", "The paper surmised such a \"move\" would deepen resentment over immigration in Germany, without specifying precisely what, exactly, was moving:", "The move is likely to cause tensions among residents who support the introduction of restrictions on the inflow of refugees to the country.", "At around the same time, readers also asked about a Daily Mail piece making a similar claim about pork, reporting that schools in a locality in England (not Germany) were replacing pork with \"halal meat\":", "Parents have condemned a school's decision to ban all pork products from the menu and replace other meats with halal versions.", "Pupils aged between three and 11 at Brinsworth Manor Infant and Junior Schools in Rotherham - which Ofsted identifies as having only a small number of pupils from minority ethnic groups - will no longer be able to enjoy sausages, bacon or ham.", "Parents at both schools, which share a site, were told of the decision in a letter from Rotherham Council’s principal catering officer Ron Parry, who wrote that there had been ‘minor adjustments’ to the lunch menu.", "While many thought this article came out around the same time as the Germany one, it was actually already two years old (from 7 March 2014), and concerned one particular area in England, not Germany.  That story also contained the following reportage, which appeared to partially contradict its initial claims:", "The school governors at both schools are understood to have agreed to the menu change to ensure the meals are more inclusive.", "A spokesman for Rotherham Borough Council confirmed that school meals at both Brinsworth Manor schools have changed and now include halal and non-halal meat on the menu.", "She added that the Schools Catering Service supplies about 17,000 school meals every day to children at infant, junior, primary and secondary schools in Rotherham.", "She said: 'The provision of both halal and non-halal is not unusual in Rotherham's school. Currently, nine schools out of 115, select one of our menus that provide a mix of both halal and non-halal meals.", "'All meat on our menus, including halal, is sourced from reputable companies, which fully comply with the quality standards of the relevant individual meat boards.'", "At any rate, the \"pork ban\" didn't last even last until the end of March 2014; it was soon reversed, mostly due to pressure by far-right and nationalist political groups.", "On 1 March 2016, news outlet Deutsche Welle covered the matter of Germany's vanishing pork. According to that report, politician Daniel Günther had complained about what he perceived as a decreased number of pork-based items on cafeteria menus:", "CDU parliamentary group leader, Daniel Günther, bemoaned on Tuesday that an increasing number of canteens, nurseries and schools are removing pork from their menu due to religious considerations.", "\"The protection of minorities - including for religious reasons - must not mean that the majority is overruled in their free decision by ill-conceived consideration,\" Günther said, arguing that tolerance also means \"the appreciation and sufferance of other food cultures and lifestyles.\"", "Günther told local German newspaper \"Lübecker Nachrichten\" that at least one nursery in every voting district had stopped serving pork after taking Muslim children into consideration.", "\"The consumption of pork belongs to our culture,\" he argued, adding that those who didn't want to eat pork didn't have to.", "\"No one should be obliged to do so,\" he said. \"But we also don't want the majority having to refrain from pork.\"", "Deutsche Welle also provided more contextual information.  According to its article, many Germans mocked the initiative and felt it was completely without merit:", "The CDU's proposal was met with a wave of mockery on Tuesday, particularly on Twitter where the hashtag #schweinefleischpflicht - meaning \"pork duty\" - became Germany's top trending hashtag by late Tuesday afternoon.", "Accompanied with an image with the words \"Wurst case scenario\" - wurst being the German word for sausage - Germany's Green party tweeted: \"Now we finally know what the CDU meant with dominant culture.\"", "The WWF in Berlin also criticized the CDU proposal. \"At present there is little evidence that the pork cutlet and chop must be placed on the menus of German canteens as a protected species,\" the wildlife protection organization quipped.", "The exaggerated claims about pork bans in Germany weren't the first of their kind to appear in British media sources. An October 2015 press frenzy centered around purported bans on pork in UK offices (nothing was banned), and in June 2015 the Daily Mail claimed Muslims demanded someone's grandfather be exhumed (again, false). In 2014 claims circulated that KFC banned hand wipes because they were prohibited by Islam (they weren't), and around the same time a questionable story made the rounds about a couple booted from a bus for offending Muslims by singing the theme song to Peppa Pig.", "While it was true one or (at most) a few German politicians \"bemoaned\" what they believed was a disappearing presence of pork in school cafeterias, misleading headlines indicated that there was a \"ban on pork\". Finally, a number of Germans mocked the assertions as ludicrous and baseless.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]