["On December 21, Bollywood actor and former BJP MP Paresh Rawal posted a tweet claiming that Myanmar is situated at a distance of 1769 km from India and merely 2 km from China. He then goes on to blame seculars and intellectuals for illegal Rohingya Muslim infiltration. He wrote, “….Myanmar to India- 1769 kms ….Myanmar to China.- 2km But, Why the Rohingyas want to come to India? and not China? Because Unlike India, there are no seculars no Intellectuals no anti nationals no in China, who support refugees Rohingyas.” This post was retweeted close to 12,000 times and liked over 35,000 times.", "….Myanmar to India- 1769 kms ….Myanmar to China.- 2km But, Why the Rohingyas want to come to India? and not China?", "Because Unlike India, there are no seculars no Intellectuals no anti nationals no in China, who support refugees Rohingyas", "— Paresh Rawal (@SirPareshRawal) December 21, 2019", "Similarly, on December 17, founder of fake news platform Postcard News Mahesh Vikram Hegde who is ‘blessed to be followed by PM Narendra Modi,’ posted the same message along with an infographic that takes West Bengal as the point of entry from Myanmar to India. Several other users have posted the same claim on Twitter and Facebook.", "Myanmar to India- 1769 kms Myanmar to China.- 2km", "But, Why the Rohingyas want to come to India and not China?", "Because Unlike India,", "there are no seculars no Intellectuals no anti nationals no congress in China, who support Rohingyas pic.twitter.com/UKtbly3zqs", "— Mahesh Vikram Hegde (@mvmeet) December 17, 2019", "Just like how Myanmar shares a border with China, it also shares its border with four Indian states – Arunachal Pradesh, Nagaland, Mizoram, and Manipur. In fact, all three nations share borders.", "According to the Ministry of Home Affairs, the total length of the international border between Myanmar and India is 1,643 kilometres (km).", "A press release by Press Information Bureau from January 3, 2018, reported an agreement signed between India and Myanmar on Land Border Crossing. The objective of the agreement was to facilitate regulation and harmonization of already existing free movement rights for people ordinarily residing in the border areas of both countries, along with the basis of valid passports and visas.", "The claim made by Paresh Rawal and others that distance between Myanmar to China is 2 km and Myanmar to India is 1769 km is irrational and false. The former BJP MP has been featured on Alt News fact-checks several times in the past – for tweeting a fake newspaper clipping targetting Rahul Gandhi and for putting out false statistics to portray Modi government better at combating terror in J&K.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]