["Back in 1983, a substance abuse prevention education program was born in Los Angeles. It was called D.A.R.E. — Drug Abuse Resistance Education — and its lessons were led by police officers who visited classrooms to teach kids how to resist drugs and violence. Perhaps you were visited by such an officer or the program’s Daren the Lion mascot.", "A May 24 Facebook post has reimagined Daren just saying yes to drugs. Above a photo of the lion with a joint in his mouth are these words: \"D.A.R.E. removed cannabis from its list of gateway drugs.\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.) We called D.A.R.E. to ask about it.", "Richard Mahan, the organization’s chief operating officer, told us that years ago, D.A.R.E. listed substances that \"youth might experiment with,\" including nicotine and marijuana. But he said D.A.R.E. has never listed so-called \"gateway drugs,\" nor removed cannabis from such a list.", "But back in 2016, some news outlets reported that D.A.R.E. had delisted cannabis as a gateway drug. The headline on a February 2016 Teen Vogue story, for example, said, \"It’s official: marijuana is no longer a gateway drug.\"", "The story says that a Reddit user \"noticed that mysteriously, marijuana was no longer listed among D.A.R.E’s other, arguably more harmful counterparts of tobacco and alcohol.\" The Reddit post links to a dead page, but the url says: dare.org/keeping-kids-drug-free/.", "Using the Wayback Machine, which takes snapshots of web pages over time, we were able to find archived versions of when the web address worked. The earliest is from Aug. 14, 2013.", "\"What is a gateway drug?\" the site asks in bold near the top of the page. \"A gateway drug is a drug that opens the door to the use of other, harder drugs. Gateway drugs are typically inexpensive and readily available.\"", "The page includes sections on the dangers of tobacco and alcohol, but not cannabis. The only mention of marijuana is in the tobacco section. According to a federal report, the page says, \"tobacco use is associated with alcohol and illicit drug use and is generally the first drug used by young people who enter a sequence of drug use that can include tobacco, alcohol, marijuana, and harder drugs.\"", "We asked Mahan about the page and he pushed back on the idea that it \"lists\" gateway drugs.", "\"I think the way it reads is it says there is the potential for leading to the use of other drugs, and yes, I know the word ‘gateway’ is in there,\" he said. He noted that the page has been removed, and he said the D.A.R.E. curriculum today doesn’t teach about \"gateway drugs,\" for which he said there’s no single definition.", "Mahan also said he doesn’t know if cannabis was ever highlighted on the page like tobacco and alcohol were. If it was, \"there was no conscious decision to remove it.\"", "Frank Pegueros, D.A.R.E.’s chief executive officer, offered this explanation about the \"gateway drug\" page to Forbes in March 2016. The confusion, he said, is \"based on what appears to have been a partial posting of a document on our website.\"", "That part that was posted discussed alcohol and tobacco as gateway drugs, Forbes reported. Another part discussing marijuana as a gateway drug was on a subsequent page that wasn’t posted.", "\"It’s obvious from looking at the document that the entire document was not in fact posted, because it only addressed tobacco and alcohol,\" Pegueros told Forbes. \"It didn’t address marijuana or inhalants, the typical substances considered to be gateway drugs.\"", "Earlier that year, D.A.R.E. responded to reports that it had changed its position on marijuana.", "\"Had nominal research been conducted by the author(s) substantial reference on the D.A.R.E. website would have been found in support of D.A.R.E.’s position that marijuana is both an illegal and harmful drug to the youth of this nation,\" the post says. \"D.A.R.E. considers marijuana to be a dangerous drug for youth of the United States and the world!\"", "Mahan said this later Feb. 2, 2018, post on the D.A.R.E. website reflects the organization’s position on marijuana, including the answer to the question: \"What is D.A.R.E.’s position on marijuana as a gateway drug?\" The post continues:", "\"After decades of studies, the research is still inconclusive regarding whether or not marijuana is a gateway drug and, if so, what other variables may contribute to an individual who has repeatedly used marijuana being drawn to experiment or use other types of illicit drugs. D.A.R.E.’s curricula focus on providing students with the knowledge, skills, and tools to make decisions for safe and healthy living and the avoidance of high risk behaviors. Without question, a student’s use of marijuana is a high risk behavior with unhealthy consequences.\"", "The Facebook post says that \"D.A.R.E. removed cannabis from its list of gateway drugs.\" That claim seems to stem from a 2016 Reddit post about a page on D.A.R.E.’s website discussing gateways. The page has since been removed, but an archived snapshot of the website reveals that cannabis was not given the same attention as tobacco and alcohol.", "The problem is that cached versions of the page from as early as 2013 also don’t highlight marijuana as a gateway drug. Though it’s unclear if cannabis ever appeared on the page, D.A.R.E. says it was not removed from any gateway drug list and today it still considers marijuana a dangerous drug for youth.", "We rate this Facebook post False.", "Facebook post, May 24, 2019", "D.A.R.E. website, visited May 29, 2019", "Teen Vogue, \"It’s official: Marijuana is no longer a gateway drug,\" Feb. 26, 2019", "Reddit post, 2016", "Archived D.A.R.E. web page from Aug. 14, 2013", "D.A.R.E., \"Incorrect posting on pro-drug websites re: D.A.R.E.’s position on marijuana,\" Feb. 27, 2016", "D.A.R.E., \"D.A.R.E.’s position and curricula regarding marijuana and legalization,\" Feb. 2, 2018", "Leafly, \"Does D.A.R.E. still think cannabis is a gateway drug? Nobody knows,\" Feb. 26, 2016", "Forbes, \"No, DARE has not gone soft on pot,\" March 3, 2016", "Interview with Richard Mahan, chief operating officer, D.A.R.E., May 29, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]