["About this rating", "It may sound like a horrific scene from an \"Indiana Jones\" movie, but clusters of fire ants are floating through catastrophic floodwaters caused by Tropical Storm Harvey, which made landfall in southeast Texas in late August 2017.", "As waters rose throughout the Houston area causing widespread destruction and displacement, people began posting another unpleasant effect of the storm — surreal pictures of the rust-colored insects drifting along, tightly clinging together to form what look like rafts on the surface of flooding rain water — prompting some to ask if the images were real. They are, in fact, real.", "Houston Chronicle medical reporter Mike Hixenbaugh posted a video of one such colony, urging residents to keep their distance:", "Pro tip: Don't touch the floating fire ant colonies. They will ruin your day. #Harvey pic.twitter.com/uwJd0rA7qB", "— Mike Hixenbaugh (@Mike_Hixenbaugh) August 27, 2017", "The ant colonies have become large enough to prompt alarm from an entomologist from the University of Texas, Austin:", "Holy crap. I have never, in my entire career as an ant researcher, seen *anything* like this. https://t.co/jIjTOo3fZc", "— Alex Wild (@Myrmecos) August 29, 2017", "Hixenbaugh is right to urge caution. According to the Washington Post, fire ants are \"aggressive, territorial and venomous. Among vulnerable individuals, their stings can be fatal\". According to Paul Nester, an extension program specialist in integrated pest management, the phenomenon of floating colonies of fire ants in a rain storm is not unprecedented:", "Floodwaters will not drown fire ants. Instead, their colonies emerge from the soil, form a loose ball, float, and flow with the water until they reach a dry area or object they can crawl up on. Floating fire ant colonies can look like ribbons, streamers, mats, rafts, or an actual “ball” of ants floating on the water. These amoeba-like ant masses contain all of the colonies’ members: brood (eggs, larvae, pupae), queen ants, winged reproductive males and females, and worker ants.", "As the flood waters recede, these floating fire ant colonies will get onto anything they come in contact with and are attracted to — anything that might give them shelter until a mound can be re-established in the soil. This means that debris piles left from the floodwaters or from flooded homes are extremely inviting to the fire ant. In times of flooding, a general, preventive treatment for controlling the fire ants is out of the question. Ants and ant colonies must be dealt with quickly.", "Although it's possible to sink the ants by spraying them with water and dish soap, which breaks them apart, experts from Texas A&M told science and technology site The Verge that spraying them would bring you too close, and the best course of action is to simply avoid them. If they're floating in your direction, try to create waves that move them away. If one stings, it creates a chain reaction that induces the others to sting — so the best thing to do is brush them off as quickly as possible.", "Ingraham, Christopher. \"The Terrifying Science Behind Floating Fire Ant Colonies — and How to Destroy Them.\"\r\n  The Washington Post. 30 August 2017.", "Nester, Paul R. \"Flooding and Fire Ants: Protecting Yourself and Your Family.\"\r\n  Texas A&M, Agrilife Extension.  March 2014.", "Farokhmanesh, Megan. \"Here's How to Deal With Those Clumps of Floating Fire Ants in Houston.\"\r\n  The Verge. 29 August 2017.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]