["“CDC: Face Masks Don’t Prevent Covid-19, Study Finds Masks Have Negligible Impact on Coronavirus Numbers,” reads the headline of the article published on March 7, 2021 by One America News.", "The network, a favorite of former president Donald Trump, was suspended from YouTube for a week in November 2020 for falsely claiming there is a cure for Covid-19, and its article on the CDC study is part of a broader trend of inaccurate information about face masks and their impact on curbing the spread of the disease.", "The article has spread across social media, including here as a screenshot and here as a link. Similar claims also appear online, including here and here.", "The claims refer to CDC research that compared county-level data on mask mandates and restaurant reopenings with changes in Covid-19 case and death growth rates.", "State-issued mask mandates were in effect in more than 2,300 US counties during the March-December 2020 period under review.", "“It is important to note that the study did not examine the effectiveness of masks,” a CDC spokeswoman, told AFP by email.", "OAN claimed the study found that “face masks had a negligible impact on coronavirus numbers that didn’t exceed statistical margins of error.”", "This is incorrect. The study showed, and the spokeswoman confirmed, that the findings related to mask mandates were statistically meaningful.", "“In this study, mask mandates were associated with reductions in Covid-19 case and death growth rates within 20 days” of the mandate’s implementation, says the study, which includes a table showing that the results were statistically significant up to 100 days after the masking requirement took effect.", "The CDC emphasized that the study noted mask orders were linked to “statistically significant decreases in county-level daily Covid-19 case and death growth rates.”", "Dr Gery Guy, one of the study’s authors, said in an email that, “mask mandates were associated with a 1.5 percentage point decline in Covid-19 case growth rate each day between 41 and 60 days after implementation.”", "CDC Director Dr Rochelle Walensky referred to the study during a March 5 briefing.", "“Increases in both daily death rates and Covid cases and deaths slowed significantly within 20 days of putting mask mandates into place,” Walensky said, adding later: “You have decreases in cases and deaths when you wear masks, and you have increases in cases and deaths when you have in-person restaurant dining.”", "The release of the CDC study comes as states including Texas rescind face covering orders while vaccinations roll out but the nation’s infection rate remains high.", "“Community mitigation policies, such as state-issued mask mandates and prohibition of on-premises restaurant dining, have the potential to slow the spread of Covid-19, especially if implemented with other public health strategies,” the study concluded.", "Health authorities including the CDC say that wearing face masks is safe and helps protect against the coronavirus which causes Covid-19 disease. Their effectiveness in limiting potential spread has already been extensively documented.", "“Over the course of the pandemic, the scientific evidence and our understanding of masks have grown. The data we now have conclusively show that widespread use of masks is a very effective way to reduce the spread of Covid-19,” the CDC spokeswoman said.", "AFP Fact Check has debunked numerous false or misleading claims about face masks and Covid-19.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]