["About this rating", "In the aftermath of U.S. Election Day 2020, amid widespread, unsubstantiated conspiracy theories and allegations of electoral fraud, figures from the reelection campaign of U.S. President Donald Trump promoted content that was presented as proof of electoral fraud in Fulton County, Georgia.", "On Nov. 4, Donald Trump Jr. and Eric Trump, sons of the president and prominent campaign surrogates, both promoted a video that, according to its narrator, was definitive proof of \"voter fraud.\" The original video was tweeted out by Austin Fletcher, a right-wing online activist who uses the moniker \"Fleccas\":", "The 34-second video clip appears to show a vote-count worker, claimed by Fletcher to be located in \"ATL\" (Atlanta, Georgia), gesticulating at his desk. It's not clear whether the voice narrating the video is Fletcher's, but the narrator says:", "\"I wonder what's going on here. This dude has a fit about something. And then flips off a ballot, and then crumples it up. If that's not voter fraud, I don't know what is.\"", "The clip was taken from USA Today's YouTube live video stream of ongoing counts in various states and does indeed show a count worker in Atlanta, as the following screenshot demonstrates:", "The worker in question appeared to have been rather expressive and engaged in a variety of gesticulations while doing his work, as the following video shows:", "While the narrator of the viral video presented it as definitive proof of electoral fraud (\"If that's not voter fraud, I don't know what is\"), other eminently plausible explanations existed for the count worker's actions and non-verbal gestures.", "Firstly, it cannot be determined based on the video that the piece of paper the count worker crumpled up was a ballot.", "Secondly, the narrator's suggestion is that the count worker expressed anger or frustration in the video, and that this was linked to his personal political views and came in response to the contents of a ballot or ballots (that is, the candidate chosen in certain ballots). That, too, cannot be determined from watching the video.", "For example, if the worker was expressing frustration (and that is not clear from the video), it could well have been related to his execution of a specific task, rather than a politically motivated response. That is, he may have lost a count, for example, or he may have realized he had more ballots to check or count than he originally assumed, or any number of potential, apolitical, and innocuous causes for frustration or dismay.", "According to a statement read at a Nov. 6 press conference by Fulton County Elections Director Richard Barron, what the poll worker was seen discarding was, in point of fact, a sheet of instructions that had been left in the ballot envelope by a voter.", "\"Voters often include lists of instructions like the one discarded in the primary absentee ballot envelope when submitting their ballots in the mail and or drop boxes,\" Barron said. The poll worker occupied a station where the envelopes are separated and cut; the ballots are extracted elsewhere, he explained. \"At no time was the worker able to extract a ballot.\"", "Barron said the incident was witnessed by a state election board monitor, and his office had conducted a review of the video. The poll worker did nothing wrong. Even so, the worker had to go into hiding after receiving threats of violence when the video went viral.", "Have more information on this topic? Send us a tip.", "Updated [Nov. 7, 2020]: Updated with statement by the Fulton County elections director; rating changed to \"False.\"", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]