["About this rating", "In the 1990 classic movie \"Home Alone,\" Kevin McCallister, played by Macaulay Culkin, is accidentally left behind as his family travels for a Christmas vacation. Before McCallister has to set up traps to protect his home from a pair of bungling burglars, he does a few things that, under normal circumstances, his parents would not have allowed. He fires his b.b. gun in the house, he looks at a Playboy magazine, and he watches an old gangster movie called \"Angels with Filthy Souls\":", "This movie comes into play later in the film as McCallister pranks a pizza delivery guy, and then again (with the addition of firecrackers) when Kevin scares away Marv the burglar:", "As many people first viewed this movie when they were children, and since \"Angels with Filthy Souls\" looks just like an old-timey gangster movie, many viewers were left with the impression that director Christopher Columbus simply used clips from a real movie to create these scenes.", "But that's not the case. \"Angels with Filthy Souls\" is a fictional film that was created solely for \"Home Alone.\"", "\"Home Alone\" cinematographer Julio Macat told the Hollywood Reporter that \"Angels with Filthy Souls\" was filmed in a way to make it look like it came from the 1930s, but credited the actors, Ralph Foody and Michael Guido, with making the clip feel like it came from a real movie.", "\"What really helped was being in Chicago and having those theater actors ... I could tell that [Foody] came from the theater because he was larger than life.\"", "Macat also said that the title of the fictional movie was inspired by the 1938 James Cagney movie \"Angels with Dirty Faces.\"", "\"We really wanted to do an homage to the movie [Angels With Dirty Faces], but we really didn't watch it a lot. We just wanted the feel of a classic gangster film.\"", "In 2015, Vanity Fair spoke with some of the other people involved with making this movie within a movie. Guido, who played \"Snakes\" in the fictional film, recalled auditioning with director Christopher Columbus:", "\"I was definitely channeling Cagney ... Chris was laughing when I finished the scene and encouraged me to go a little further with it. It felt good and he must have liked it, because he gave me the part.\"", "Production designer John Muto said:", "\"Think about what a unique sequence it was within the film ... No children, a very simple shot plan, the exaggerated style of acting, the crazy action ... Given the rest of the film, it was kind of a party!\"", "The \"Angels with Filthy Souls\" gag in the original \"Home Alone\" was such a success that a fictional follow-up called \"Angels with Even Filthier Souls\" was made for the sequel \"Home Alone 2: Lost in New York.\" This time, Kevin used the film to scare away some hotel employees:", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]