["Did you hear the one about foreign students ripping off the U.S. by getting federal grants to go to college and then ditching our country to return home?", "The chain email from \"a Florida teacher\" arrived in our inbox March 28, 2013. It reads:", "\"This is a subject close to my heart. Do you know that we have adult students at the school where I teach who are NOT U.S. Citizens and who get the PELL Grant, which is a federal grant (no payback required) plus other federal grants to go to school?\n\n\"One student from the Dominican Republic told me that she didn't want me to find a job for her after she finished my program, because she was getting housing from our housing department and she was getting a PELL Grant which paid for her total tuition and books, plus money left over.\"", "The email also stated that this Dominican student accessed other special programs that supplied her with a credit card for gas and another to pay for daycare. The email continued:\n\n\"The one student I just mentioned told me she was not going to be a U.S. citizen because she plans to return to the Dominican Republic someday and that she 'loves HER country.’ I asked her if she felt guilty taking what the U.S. is giving her and then not even bothering to become a citizen and she told me that it doesn't bother her, because that is what the money is there for!\"", "We wanted to research if a noncitizen can get a Pell Grant to go to college with no intention of becoming a citizen and then simply return to their home country. As we soon discovered, this chain email has had a long life -- it was debunked in fact-checks by Snopes.com and Factcheck.org in 2008.", "Pell Grants", "Pell Grants are federal awards to low-income students for post-secondary education. The grants are for students to obtain bachelor's degrees or certain postbaccalaureate programs that lead to teacher certification.", "The grant does not have to be repaid, and the maximum amount for this year is $5,550.", "Citizens can get the grants. Also, students who are permanent residents -- commonly referred to as those who have a \"green card\" -- are considered eligible noncitizens and can get student aid if they meet eligibility criteria, said Jane Glickman, a U.S. Department of Education spokeswoman. We couldn’t find statistics on how many of the 9.7 million Pell Grant recipients are green-card holders, but Glickman said the vast majority are citizens.", "The chain email also claimed that the Pell Grant would pay for \"total tuition and books, plus money left over.\"", "It appears highly unlikely our Dominican student would be profiting from the Pell Grant, since the average price of a four-year college education is far above the grant. (PolitiFact’s 2011 analysis showed it covered about 34 percent of public college costs.)", "The email also suggested that this Dominican student is seeking a free ride from the United States and giving nothing in return. Legal permanent residents who get Pell Grants can choose to return to their country, however, the majority eventually apply for citizenship. And they do pay taxes.", "Other programs mentioned in the email", "The chain email claimed that the Dominican student was accessing two other programs, called WAIT and CARIBE, to help pay for expenses: \"She was looking into WAIT which gives students a CREDIT CARD for gas to come to school, and into CARIBE which is a special program (check it out - I did) for immigrants, and it pays for child care and all sorts of needs while they go to school or training.\"", "C.A.R.I.B.E. – Career Recruitment And Instruction In Basic English Refugee Program -- is a federally funded adult education program in Hillsborough County Public Schools. The program’s website explains that it \"provides English language, GED, and Hi-Tec vocational training to recent Cuban, Haitian, and other entrants with legal, documented refugee or asylee status.\" (The website puts those two words in bold.)", "Program manager Estela Weideman told PolitiFact that CARIBE does not provide child care but will refer students to other programs that provide vouchers for child care if they qualify.", "\"All we provide are English classes to the adults, and only those that qualify,\" Weideman said.", "The criteria is very specific -- participants must be refugees or asylum seekers, which typically means people fleeing oppressive regimes or war conditions.", "(In 2008, the director of this Hillsborough County program told Factcheck that he had received more than 600 emails about the chain letter and had received calls around the country, including from congressional offices.)", "Several other counties in Florida have similar adult education programs for refugees including in Miami-Dade County.", "It’s unlikely that this alleged Dominican student would qualify for Hillsborough’s program, though.", "State Department refugee admission statistics for 2012 do not show any refugees from the Dominican Republic. We also found no Dominicans were U.S. refugees from 2002 to 2011. The picture was more complex for those seeking asylum -- one category referred to as seeking asylum \"defensively\" as part of a removal hearing included tiny numbers from the Dominican Republican -- eight in 2011, for example.", "We couldn’t find anything on the other program mentioned in the email -- WAIT -- that would supposedly provide students with gas to go to school. This program doesn’t appear to exist.", "Our ruling", "The chain email paints a picture of free-loading foreigners, college students \"who are NOT U.S. citizens and who get the PELL Grant,\" then return to their home countries after getting free gas cards and child care.", "While green card residents can get Pell Grants, those people are generally legal permanent residents -- not people looking to return to their own countries.", "And there’s no free gas cards or child care.", "We rate the chain email’s claim Pants on Fire!", "Chain email, Letter from a Florida teacher,  March 28, 2013", "U.S. Department of Education, Federal Pell Grant Program, Accessed March 29, 2013", "U.S. Department of Education, Federal student aid, Accessed March 29, 2013", "U.S. Department of Education, Federal Pell Grant end of year report, 2009-10", "U.S. Department of State, Refugee admission statistics, 2012", "Hillsborough County Public Schools, Welcome to the CARIBE refugee program, Accessed March 29, 2013", "Miami-Dade Public Schools, Welcome to the SAVES program, Accessed March 29, 2013", "U.S. Department of Homeland Security, 2011 Yearbook of Immigration Statistics", "Snopes.com, Pell Grants, Jan. 30, 2008", "Factcheck.org, \"Letter by a Florida teacher,\" June 9, 2008", "University of South Florida, Lawton and Rhea Chiles Center for Healthy Mothers and Babies, 2008", "Chronicle of Higher Education, \"In a secret classroom in Georgia, immigrants learn to hope,\" Dec. 10, 2012", "Center for Immigration Studies, Estimating the impact of the Dream Act, November 2010", "PolitiFact, \"Kal Penn thanks Obama for ‘doubling funding for the Pell Grant,’\" Sept. 11, 2012", "PolitiFact, \"Sen. Whitehouse says full Pell Grants cover only 34 percent of public college costs, down from 72 percent in 1976,\" Sept. 22, 2011", "Interview, Christopher Bentley, spokesman for the U.S. Department of Health and Human Services,  March 29, 2013", "Interview, Jane Glickman, spokeswoman for the U.S. Department of Education, March 29, 2013", "Interview, Estela Weideman, program manager of CARIBE at Hillsborough County Public Schools, March 29, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]