["By Eugene Kiely and Jessica McDonald", "Posted on October 5, 2020", "Since President Donald Trump announced on Oct. 2 that he had tested positive for COVID-19, White House staff and the president’s physicians have provided confusing and at times contradictory information about the president’s health.", "Trump’s medical team has portrayed his illness as relatively mild and improving, but also has shared details that would suggest the president may be sicker than they have described.", "Here, we share what was said when and highlight instances in which information was not relayed with full accuracy or transparency.", "Evening", "Between 9 and 10 p.m. — Trump tells Fox News’ Sean Hannity: “I’ll get my test back either tonight or tomorrow morning. But, you know, I spend a lot of time with Hope, and so does the first lady,” in confirming that White House counselor Hope Hicks had tested positive. But before the Hannity interview, Trump had tested positive for COVID-19 using a rapid-results test, the Wall Street Journal later reported. He was awaiting the results on a more accurate test.", "Morning", "12:54 a.m. — In a tweet, the president announces he has tested positive for COVID-19. “Tonight, @FLOTUS and I tested positive for COVID-19. We will begin our quarantine and recovery process immediately. We will get through this TOGETHER!”", "1:06 a.m. — Shortly after Trump’s announcement, the White House releases a memo dated Oct. 1 from the president’s doctor, Navy physician Sean P. Conley. “This evening I received confirmation that both President Trump and First Lady Melania Trump have tested positive for SARS-CoV-2 virus,” Conley says. He also says, “The President and First Lady are both well at this time, and they plan to remain at home within the White House during their convalescence.” But those plans changed later in the day.", "Afternoon", "About 1:45 p.m. — In remarks to reporters, White House Press Secretary Kayleigh McEnany says the president is “hard at work despite the mild symptoms.”", "About 4 p.m — In a late afternoon memo, Conley provides a second update on the president’s condition and treatment. “As of this afternoon, the President remains fatigued but in good spirits.” But, he adds, “as a precautionary measure he received a single 8 gram dose of Regeneron’s polyclonal antibody cocktail.”", "“In addition to the polyclonal antibodies, the President has been taking zinc, vitamin D, famotidine, melatonin and a daily aspirin,” Conley says. There was no mention of the president receiving supplemental oxygen, which the public did not learn about until Sunday.", "About 5 p.m. — Trump is taken to Walter Reed National Military Medical Center. In a statement, the press secretary describes the president as being in “good spirits” with “mild symptoms.” McEnany says, “Out of an abundance of caution, and at the recommendation of his physician and medical experts, the President will be working from the presidential offices at Walter Reed for the next few days.”", "Evening", "11:34 p.m. — The White House issues a third medical update from Conley. In the memo, Conley says that as of “this evening” Trump is “doing very well” but he had recommended that the president be moved to Walter Reed “for further monitoring.” Conley adds, “He is not requiring any supplemental oxygen, but in consultation with specialists we have elected to initiate Remdesivir therapy. He has completed his first dose and is resting comfortably.” In fact, Trump did receive supplemental oxygen that day.", "Morning", "At a late morning press briefing, Dr. Sean Dooley, a pulmonologist at Walter Reed, says that “the President this morning is not on oxygen, not having difficulty breathing or walking around the White House Medical Unit upstairs.” Asked if that meant the president did not receive any supplemental oxygen, Conley responds, “He’s not on oxygen right now.” Pressed again, Conley falsely says, “Yesterday and today, he was not on oxygen.”", "As for other medical treatments, Dr. Brian Garibaldi says, “About 48 hours ago, the president received a special antibody therapy directed against the coronavirus, and we’re working very closely with the company to monitor him in terms of that outcome. Yesterday evening, he received his first dose of IV remdesivir. And our plan is to continue a five-day treatment course for remdesivir.” Garibaldi’s statement on when the antibody therapy treatment started seems to contradict Conley’s Friday evening memo.", "Conley also causes confusion when he says that Trump was “72 hours into the diagnosis,” raising questions about when Trump was first diagnosed. A reporter asks Conley, “You said 72 hours. That would put it that Wednesday.” He responds, “So Thursday afternoon, following the news of a close contact is when we repeated testing. And given clinical indications, I had a little bit more concern. And that’s when, late that night, we got the PCR confirmation that he was.”", "As for the president’s fever, Conley says, “It’s important to note the president’s been fever free for over 24 hours.” He gives a generally upbeat assessment, describing the president as “doing great” — although that would almost immediately be contradicted by a top White House staffer.", "After describing Trump’s vitals in good shape and his blood pressure in particular as “great,” Conley is asked why the president had been transferred to the hospital, to which Conley replies, “Because he’s the president of the United States.”", "Afternoon", "About 12 noon — In an email sent to reporters, the White House pool reporter traveling with the president passes along a statement that is attributed to “a source familiar with the president’s health” that says: “The president’s vitals over the last 24 hours were very concerning and the next 48 hours will be critical in terms of his care. We’re still not on a clear path to a full recovery.” It was later disclosed that the anonymous source was White House Chief of Staff Mark Meadows.", "About 1:50 p.m. — The White House releases a statement from Conley that seeks to address the confusion about when the president was diagnosed and when treatment began.", "“This morning while summarizing the President’s health, I incorrectly used the term ‘seventy-two hours’ instead of ‘day three’ and ‘forty eight hours’ instead of ‘day two’ with regard to his diagnosis and the administration of the polyclonal antibody therapy,” he says. “The President was first diagnosed with COVID-19 on the evening of Thursday, October 1st and had received Regeneron’s antibody cocktail on Friday, October 2nd.”", "Evening", "6:51 p.m. — Trump speaks to the public for the first time since being hospitalized in a four-minute video that he posts on Twitter. “I came here, wasn’t feeling so well. I feel much better now,” he says. “We’re working hard to get me all the way back.”", "9:08 p.m. — The White House releases a statement from Conley that says the president had made “substantial progress.”", "“This evening he completed his second dose of Remdesivir without complication,” Conley says. “He remains fever-free and off supplemental oxygen with a saturation level between 96 and 98% all day.” Conley’s statement does not clarify if the president had been on oxygen.", "Morning", "Shortly before noon — Conley and other doctors treating Trump give a press briefing. Conley says that “the president has experienced two episodes of transient drops in his oxygen saturation,” indicating Trump’s lungs may be compromised. As a result, the president began to take dexamethasone, a steroid drug.", "Conley also discloses for the first time that the president had received supplemental oxygen on Friday, for about an hour. “Late Friday morning, when I returned to the bedside, president had a high fever and his oxygen saturation was transiently dipping below 94%. Given these two developments, I was concerned for possible rapid progression of the illness,” Conley says. “I recommended the president we try some supplemental oxygen, see how he’d respond.”", "Asked why he failed to disclose earlier that the president had received supplemental oxygen, Conley says: “I was trying to reflect the upbeat attitude that the team, the president, that his course of illness has had. I didn’t want to give any information that might steer the course of illness in another direction and in doing so, it came off that we were trying to hide something, which wasn’t necessarily true.”", "When asked if Trump had received oxygen a second time, Conley suggests that the answer is no, but he isn’t definitive. “I’d have to check with the nursing staff. If he did, it was very, very limited,” he says, emphasizing that Trump was not on oxygen then and the only oxygen that Conley ordered had been on Friday morning.", "The addition of dexamethasone to the president’s regimen is particularly curious, as the drug is not recommended for patients who are not on supplemental oxygen.", "The RECOVERY trial in the U.K., which established the drug had a mortality benefit in hospitalized patients who were ventilated or on supplemental oxygen, did not find a benefit — and identified possible harm — in providing the drug to those who were not on oxygen at the time of randomization.", "This had led some physicians to speculate that Trump’s condition might be worse than what has been shared with the public, or that Trump might be receiving very aggressive treatment, which may not necessarily benefit him.", "Conley also refuses to provide specifics on other information that would get at Trump’s medical condition.", "When asked about what X-rays or CT scans show, and whether there are signs of pneumonia or lung damage, Conley responds vaguely, “We’re tracking all of that. There’s some expected findings, but nothing of any major clinical concern.”", "“Expected findings,” some doctors say, likely means some signs of lung damage — or at least enough concern to initiate the dexamethasone. As Vanderbilt University infectious disease expert Dr. William Schaffner told ABC News, Trump’s oxygen levels and CT scan results are “undoubtedly what targeted physicians’ decision to add dexamethasone.”", "Afternoon", "5:16 p.m. — Trump posts a short video on Twitter. “We’re getting great reports from the doctors,” he says.", "About 5:20 p.m. — Trump briefly leaves Walter Reed in a presidential motorcade to visit and wave to supporters outside before returning to the hospital. At least two Secret Service members, wearing what appeared to be N95 masks, were inside the enclosed vehicle with the president, who wore a mask. While the White House said the trip had been “cleared” by the medical team, some experts, including a physician at Walter Reed, considered the excursion unnecessarily risky for his security detail.", "Afternoon", "2:37 p.m. — Trump tweets: “I will be leaving the great Walter Reed Medical Center today at 6:30 P.M. Feeling really good! Don’t be afraid of Covid. Don’t let it dominate your life. … I feel better than I did 20 years ago!”", "About 3:10 p.m. — Conley, the president’s physician, and others on the president’s medical team give an update on Trump’s health and his scheduled return to the White House. “Though he may not entirely be out of the woods yet, the team and I agree that all our evaluations — and most importantly his clinical status — support the president’s safe return home,” Conley says.", "Dooley says the president’s temperature on the morning of Oct. 5 was 98.1 degrees. Conley says the president has not received fever reducing medication for the last 72 hours.", "Conley declines to discuss some details, such as the date of the president’s last negative test. Conley also would not share any information on the president’s viral load or possible lung damage. He would only say that the supplemental oxygen wasn’t required and the president wasn’t short of breath when it was administered, which happened twice. “It was more of us trying to anticipate needs and see how he’d respond,” he says, adding it was given for a short period of time.", "Editor’s Note: Please consider a donation to FactCheck.org. We do not accept advertising. We rely on grants and individual donations from people like you. Credit card donations may be made through our “Donate” page. If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, 202 S. 36th St., Philadelphia, PA 19104.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here for more.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]