["About this rating", "Snap, Inc. did lose a lot of value immediately after Rihanna told people to get rid of the app.", "The extent of the loss attributable to her statements is impossible to quantify.", "The singer Chris Brown's violent physical abuse of his one-time girlfriend, fellow singer and pop star Rihanna, was one of the most high-profile episodes of domestic violence in recent years, and one which raised awareness about the nature and consequences of that crime throughout the world.", "That made it particularly shocking to many observers when the social networking app Snapchat hosted a mobile game commercial which made light of Rihanna's abuse at the hands of Brown. The advertisement for the game Would You Rather? invited viewers to choose to \"Slap Rihanna\" or \"Punch Chris Brown.\"", "Is it just me, or is this ad that popped up on my Snapchat extremely tone deaf? Like what were they thinking with this? pic.twitter.com/7kP9RHcgNG", "— Royce Mann (@TheRoyceMann) March 12, 2018", "According to National Public Radio, the company behind Snapchat apologized and removed the commercial from circulation by 12 March 2018, but screengrabs of it had already begun to spread. On 15 March, Rihanna herself criticized the app for hosting the commercial in an Instagram post that has since been deleted:", "...I'm just trying to figure out what the point was with this mess! I'd love to call it ignorance, but I know you ain't that dumb! You spent money to animate something that would intentionally bring shame to DV [domestic violence] victims and made a joke of it!!! This isn't about my personal feelings, cause I don't have much of them...but all the women, children and men that have been victims of DV in the past and especially the ones who haven't made it out yet...you let us down! Shame on you.", "The star then appeared to encourage her 61 million Instagram followers to delete the Snapchat app, urging: \"Throw the whole app-oligy away.\"", "If she tells me to delete snapchat I’ll do it @rihanna pic.twitter.com/yUW1UOzNc2", "— Nicollette Williams (@nicollettemw) March 15, 2018", "Rihanna's critical intervention appears to have been an event that sparked a selloff of shares in Snap, Inc. the company behind the app, prompting a whole ecosystem of viral social media posts and news articles in response.", "On 15 March 2018, the company's share value dropped by 3.64 percent, the equivalent of roughly $754 million. While not unprecedented (it was only the 26th-biggest one-day percentage drop in value in the last year), this was a significant decline. Since March 2017, the average (median) one-day percentage loss in Snapchat's market value has been -0.34 percent, so the devaluation seen on 15 March was substantial.", "On a day where there was no other major bad news for Snapchat, the evidence is very strong that Rihanna's message to \"throw away\" the app (delivered instantly to 61 million people), as well as the ensuing media coverage, at the very least made a significant contribution to the nearly $800 million one-day loss.", "Held, Amy.  \"Snapchat's Stock Sinks After Rihanna Denounces Domestic Violence Ad.\"\r\n  National Public Radio.  17 March 2018.", "Petit, Stephanie.  \"Snapchat Stock Drops $800 Million After Rihanna Condemned Ad Making Light of Domestic Violence.\"\r\n  People.  18 March 2018.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]