["About this rating", "On July 3, 2020, the Brown Valley Observer website published an article positing that Ghislaine Maxwell, a longtime associate of deceased sex offender Jeffrey Epstein, tested positive for COVID-19 in the New Hampshire jail where she was held after her arrest on charges of the sexual exploitation of minors:", "Ghislaine Maxwell Has Tested Positive for COVID-19 in New Hampshire Jail, DOJ Reports", "An official report from the United States Department of Justice indicates that socialite and alleged Jeffrey Epstein co-conspirator Ghislaine Maxwell has tested positive for novel coronavirus (COVID-19) in New Hampshire while awaiting extradition to New York.", "“Once she was in custody and began to relax, officials noticed that she was displaying symptoms related to coronavirus including watery eyes, cough, and mucus. She stood to be tested regardless of symptoms while in custody, but her symptoms and the profile of this particular case caused local officials to speed up the testing practice,” a release from the US Department of Justice stated.", "This item was not a factual recounting of real-life events. The article originated with a website that describes its output as being humorous or satirical in nature, as follows:", "This is an entertainment website written to satirize news events, politics, and popular faces and ideas, and to provide commentary on social attitudes and trends.", "While familiar names of celebrities and other media figures as well as familiar agencies and organizations are used, all news stories contained within are fictional in nature.", "A similar claim about Ghislaine Maxwell circulated concurrently in the form of a purported screenshot of a misdated BBC article. However, no such story appeared on the BBC.com website and the screenshot was obviously fabricated:", "For background, here is why we sometimes write about satire/humor.", "Reuters.   \"Fact Check: BBC News Has Not Published a Future Date Article Saying Ghislaine Maxwell Is in Intensive Care for Coronavirus.\" \r\n   7 July 2020.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]