["“Indian Muslims chant “Allah-O-Akbar”; wave green imitation Pakistan flags as they march after election results in Rajasthan” tweeted Tarek Fatah with a video purportedly of a Muslim community’s rally in Rajasthan after Congress’ victory in the state. At the time of writing this article, it has been retweeted more than 600 times.", "Tarek Fatah later deleted his tweet, and reposted a different version of the tweet, changing the phrase “Pakistan flags” to “green Islamic flags”.", "Politics Solitics, a Facebook page has shared the same video with a message, “कांग्रेस समर्धक हिन्दु भाइयो मुबारक हो आपकी चाहत की मांग शुरू हो गयी है (Congratulation to our Congress supporting Hindu brothers, the demands for your wishes have begun -translated)”. So far, this post has garnered close to 11,000 shares and 2 lakh views.", "Several individual users on Facebook and Twitter have shared this video with similar claims suggesting that Muslims in Rajasthan are celebrating the electoral victory of Congress by taking out a rally where slogans like “Pakistan Zindabad” and “Babri Masjid le ke rahenge” were chanted.", "MadhuPurnima Kishwar has also shared the same video with the identical narrative. Actor Koena Mitra also quote-tweeted Madhu Kishwar’s tweet.", "The Quint had earlier reported that the video belongs to Uttar Pradesh and NOT Rajasthan as falsely claimed on social media. An extended YouTube video posted by Junaid Zubairi December 6, 2016 was titled, “संभल बाबरी मस्जिद जुलूस (Sambhal Babri masjid procession -translated)”. The flags seen in the video are actually representative of the ‘Indian Union Muslim League’ while it being claimed that these are Pakistani flags.", "Speaking to The Quint, Zubairi said that no rallies or procession were held in the city in past week and the video was almost a year old when it was posted.", "Several instances of misinformation have come to light within two days of Congress wining the election in Rajasthan. Earlier, a clipped video of Rahul Gandhi making about-turn on farm loan waiver was massively circulated on social media. Then, a video of riot in Morbi, Gujarat was shared as the clashes in Rajasthan after Congress’ victory in the state and an Islamic religious flag waved in a Congress victory procession in Tiwari, Rajasthan was passed off as Pakistani flag.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]