["About this rating", "Some apprenticeship programs for licenses in areas such as cosmetology and barbering require more total hours than policy academy training.", "Police must generally complete the entirety of their training before they ever begin working in the field, while apprentices are performing on-the-job training work while accumulating the hours needed to obtain a license.", "It is not uncommon after high profile cases of police-involved deaths of civilians that protesters (both in the physical and online worlds) display material contrasting the length of training required for police officers with those of other professions. The point of these comparisons is to make the case that law enforcement officers — who are empowered to use deadly force when they deem it necessary — receive far less training than people who ply trades that do not involve protecting the public safety or making life-and-death decisions:", "Such comparisons fail badly at making that point, however, because they contrast two very different types of training.", "Standards vary from place to place, but in general, people who undergo training at a police academy in a sizable metropolitan area — such as Seattle — are spending several months engaged in nothing but that training. They are not simultaneously performing hands-on police work while they are learning their profession, and they complete a curriculum that includes both classroom learning and physical training, encompassing everything from community service, human relations, and report writing to crisis intervention, firearms training, and criminal investigations —  before they begin working in the field.", "In most cases, rookies will have to complete probationary periods, lasting several weeks to several months, under the supervision of experienced field training officers (FTO) before being fully qualified to work on their own.", "People who pursue licenses in cosmetology (as illustrated above), however, are not spending 2,000 hours with classroom learning or other formal instruction before ever setting hands on customers, but rather are taking part in on-the-job training. They are working with mentors in apprenticeship programs, which may include a mixture of classroom learning, performing non-service duties (e.g., answering phones, cleaning), and providing hands-on service to clients, all of which goes towards accumulating the requisite number of hours needed for licensure.", "Simply contrasting the number of hours involved in these two very different types of training is misleading. In general, police trainees put in hundreds of hours of learning time before they take part in their initial patrol shift (and even then they remain under supervision for a considerable period of time afterwards), but manicurists are not required to spend hundreds of hours in the classroom and obtain a license before they ever file someone else's nails, for example, for the first time.", "cosmetology-license.com.   \"How to Become a Cosmetologist in Washington.\"\r\n    Accessed 8 June 2020.", "Washington State Department of Licensing.   \"How to Get Your WA License: Graduate of a School or Apprenticeship Program.\"\r\n    Accessed 8 June 2020.", "Rosenkrantz, Debbie.   \"Beyond the Classroom - Apprentice Programs.\"\r\n    Nails.   1 April 1998.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]