["About this rating", "On 2 November 2017, the Facebook page \"The Other 98%\" shared a meme comparing purported facts about the founder of the Papa John's (John Schnatter) and Little Caesar's (the late Mike Ilitch) pizza chains:", "Purported facts about Schnatter were accompanied by a red \"X\" (indicating dispproval) and those about Ilitch with a green check mark (indicating approval). The meme comprised seven claims in total, four about Schnatter and three about Ilitch, which we'll cover one by one:", "[Papa John's] John Schnatter, Founder", "[Little Caesar's] Mike Illitch [sic], Founder", "According to Federal Election Committee (FEC) filings, Schnatter made a total of $85,500 in political contributions in 2016, just over two percent of which went to the Trump campaign. Schnatter donated $1,000 each to two Trump campaign political action committees (PACs), he donated $33,400 to the Republican National Committee (RNC) and the Kentucky Republican Leadership Fund in 2016, and $6,200 to Rand Paul's PACs. As such, the claim was true but somewhat misleading: Schnatter (a resident of Louisville) did donate to the Trump campaign, but the bulk of his financial support went elsewhere, most of it to political activity on the state level.", "In early November 2012, it was widely reported that Schnatter planned to cut worker hours in response to provisions of the Affordable Care Act (ACA, or \"Obamacare\"):", "The CEO of popular pizza chain Papa John's says his employees may face reduced hours and he expects his business costs to rise because President Obama's re-election most likely insures the president's health care reform law will be implemented in full.", "NaplesNews.com reports John Schnatter made the remarks to a small group at Edison State College's Collier County campus the day after the election.", "Schnatter, who supported Mitt Romney in the election, said all Americans having health insurance under ObamaCare is a good, but estimates the change will cost Papa John's $5 million to $8 million annually.", "However, Schnatter asserted that his comments had been misinterpreted in an op-ed piece, explaining that his earlier remarks were speculative and pertained to franchisees of Papa John's (not the corporation itself):", "Many in the media reported that I said Papa John’s is going to close stores and cut jobs because of Obamacare. I never said that. The fact is we are going to open over hundreds of stores this year and next and increase employment by over 5,000 jobs worldwide. And, we have no plans to cut team hours as a result of the Affordable Care Act.", "Clearly there was some misunderstanding somewhere. The remarks that generated the headlines were made during an entrepreneur class I was asked to speak to at a Florida college. I was asked to share my experience as an entrepreneur and to provide the students with real-life small business situations. Unbeknownst to me, until she identified herself, a reporter was there.", "Here is the part of the interchange that was the genesis of the news:", "Reporter: “Do you think your — you know — franchise owners... are going to cut people hours back to make them part time instead of full time?”", "Me: “Well, in Hawaii there is a form of the same kind of health insurance and that’s what you do, you find loopholes to get around it. That’s what they’re going to do.”", "Reporter: “My understanding is that if you’re a full time employee, which is 35 hours or over, you’d be covered. Or if you’re part time then you wouldn’t be. So wouldn’t some business owners just cut people down like 34 hours a week so they wouldn’t have to pay for health insurance?”", "The reporter asked what I believed Papa John’s franchisees would do in response to Obamacare, not what Papa John’s would do ... Papa John’s, like most businesses, is still researching what the Affordable Care Act means to our operations. Regardless of the conclusion of our analysis, we will honor this law, as we do all laws, and continue to offer 100% of Papa John’s corporate employees and workers in company-owned stores health insurance as we have since the company was founded in 1984.", "In 2015, a Papa John's franchisee (not the chain, nor Schnatter) was found guilty of wage theft and noncompliance with New York State laws pertaining to overtime:", "Abdul Jamil Khokhar, who owns nine Papa John’s locations in New York City with BMY Foods, pled guilty to failing to pay workers in compliance with the New York Labor Law, which is a misdemeanor, and to filing false business records, a felony.", "He will serve 60 days in jail for failing to pay his workers the minimum wage and overtime and has agreed to pay $230,000 in restitution to the workers ... Instead of paying his employees the proper minimum overtime wages according to New York State law, Khokhar paid them the same minimum wage they would make during regular hours.", "To hide this illegal practice, he created fake names for employees in the computer system and used the fake names to avoid paying the time-and-a-half rate required for overtime. So an employee who worked for more than 40 hours would be paid for regular work hours under his or her own name, and any overtime hours would be paid as straight hours to a fictitious employee.", "Khokar was an independent franchise owner, and his 2015 conviction was falsely attributed to Schnatter in the meme. Separate instances also involved the actions of independent franchisees, not Papa John's itself.", "In August 2012, news outlets reported that Schnatter was planning to pass increased health insurance costs onto customers in order to protect \"shareholders' best interests\":", "And if the Patient Protection and Affordable Care Act rolls out as planned in 2014, Schnatter’s strategy is “of course ... to pass that cost on the consumer in order to protect our shareholders’ best interest,” he said in a recent conference call.", "Schnatter estimates that the legislation will cost Papa John’s about 11 cents to 14 cents per pizza, which equates to 15 cents to 20 cents per order. An average delivery charge runs $1.75 to $2.50.", "Schnatter's claims about an 11- to 14-cent per pizza increase in prices occurred in tandem with his earlier referenced ACA-related remarks. As with those previous comments, Schnatter later maintained his remarks had been misinterpreted:", "Most visibly, Papa John's CEO John Schnatter repeatedly claimed that Obamacare would increase the price of a pizza by eleven to fourteen cents (even if you accept his numbers, hardly a dramatic setback).", "CNN did some fact checking, and found that the exact costs of Obamacare for the chain were incalculable thanks to the pizza franchise's refusal to provide pertinent data (such as the number of pizzas they sell, how many full-time employees they have, what their current health care plan is, etc.). However, they rated Schnatter's claims as \"false\" because Obamacare does not require companies to provide health care plans to part-time employees, as well as exempts many small businesses (such as the local franchises which compose Papa John’s retail locations) from the health care requirements.", "After being debunked, Papa John's is backing off from its claims that Obamacare would raise prices and potentially cost jobs, now saying Schnatter was quoted incorrectly. Due to the business’ strength, the company now says, Papa John's could absorb the added costs easily.", "Schnatter stated that his earlier remarks were misconstrued, and denied pizza prices would go up by the minor amount mentioned. Although it was true Schnatter speculated higher Obamacare-related costs would be \"pass[ed] on\" to customers, he soon revised his position and no surcharge was added. The meme then turned to Ilitch, who died in February 2017.", "Back in February 2014, SportsBusiness Daily reported that Ilitch had arranged to pay for housing for civil rights icon Rosa Parks after she was robbed and assaulted in her Detroit home:", "On Aug. 31, 1994, Parks, then 81, was robbed and assaulted in her home in central Detroit. [Judge Damon] Keith called real estate developer Alfred Taubman, the owner of Riverfront Apartments, about finding a safer home for Parks. Taubman pledged to find the best home available.", "When Ilitch read about Keith’s plan and Taubman’s promise in the newspaper, he called the judge and said he would pay for Parks’ housing for as long as necessary. (Parks passed away in 2005 at the age of 92). Keith served as the executor of the trust established for Parks’ housing.", "The episode is just one of many throughout Ilitch’s life when he stepped forward to help (see box), usually outside of the spotlight.", "Keith produced a canceled November 1994 check and affirmed that Ilitch had paid Parks' rent from 1994 until her death in 2005, adding that it was \"important\" people learn of that circumstance.", "This claim appears to reference Little Caesar's Love Kitchen, described on the company's web site as follows:", "THE LITTLE CAESARS LOVE KITCHEN travels across the United States to help those in need. We have two trucks in operation so we can be of service 365 days a year. These restaurants on wheels have served more than three million people. The Love Kitchen has been recognized for its charitable efforts as well, receiving The President's Volunteer Action Award Citation from former Presidents George H. W. Bush and Bill Clinton. The Reagan administration also awarded the Love Kitchen a Presidential Citation for Private Sector Initiatives. Additionally, the Love Kitchen has received a certificate of appreciation from the State of Michigan and was recognized by the Detroit City Council for its efforts in the Gulf Coast region. The Love Kitchen’s 30th anniversary was recognized when it was listed in the Congressional Record by U.S. Congresswoman Candice Miller, on April 30, 2015.", "The Love Kitchen charity was founded by Ilitch in 1985.", "In September 2007, news outlets reported that Ilitch had \"received the U.S. Veterans Affairs Department's top civilian honor for giving war veterans franchise opportunities,\" with one press release stating:", "In recognition of his service to Veterans, Honorable R. James Nicholson, Secretary of Veterans Affairs, will present Little Caesar Enterprises, Inc. founder Michael Ilitch with the Secretary's Award, the highest tribute given to a private citizen by the United States Department of Veterans Affairs. The ceremony, which will take place today in the nation's capitol at the Department of Veterans Affairs at 2:30 p.m. ET, recognizes Mr. Ilitch's industry-leading support of Veterans through the Little Caesars Veterans Program.", "\"Michael Ilitch has demonstrated great patriotism by providing business opportunities to honorably discharged Veterans through the Little Caesars Veterans Program,\" said Nicholson. \"This award, the highest honor my office can bestow, represents the VA's appreciation of a Detroit business leader who is making a difference for U.S. military Veterans as they transition to civilian life or make a career change.\"", "Launched on Veterans Day (November 9) 2006, the program provides honorably discharged, service-disabled Veterans who qualify as Little Caesars franchisees a benefit of up to $68,000. Honorably discharged, non service-disabled Veterans who qualify as Little Caesars franchisees are eligible for a benefit of $10,000. Ilitch, a former Marine, has made giving back part of the way Little Caesars has done business since shortly after opening the first store in 1959.", "\"Veterans and their families have made significant sacrifices for our country, and I feel that it's important to acknowledge that, and to thank them for their service,\" said Michael Ilitch, founder and chairman, Little Caesars. \"As I thought about the businesses I own, I thought what better way to say thank you to the men and women who have given so much for our nation than to provide them with a business opportunity: becoming a Little Caesars franchisee. I'm very honored that the program, and the people who created it, are being recognized with this prestigious award.\"", "Aside from its literal veracity (or lack thereof), this meme also cherry-picks its \"facts\" to reflect poorly on Schnatter (whose political positions are well-known) and elides charitable contributions Papa John's has made to causes such as the Red Cross, children affected by domestic violence, and general philanthropic donations that Schnatter estimated to total around $30 million.", "Hsu, Tiffany.   \"Papa John's to Raise Pizza Prices If 'Obamacare' Survives: CEO.\"\r\n    Los Angeles Times.   8 August 2012.", "McKay, Tom.   \"Papa John's Backtracks from Claim That Pizza Prices Will Increase Because of Obamacare.\"\r\n    Mic.   27 January 2013.", "Schnatter, John.   \"The Real Scoop on Papa John’s and Obamacare.\"\r\n    Huffington Post.   13 January 2013.", "Wolfson, Andrew.   \"The Real Papa John: Pizza Entrepreneur John Schnatter Makes No Apologies for Wealth, Success, Obamacare Remarks.\"\r\n    Courier-Journal.   13 January 2013.", "Federal Elections Commission.   \"Individual Contributions: John H. Schnatter/Papa John's International, Inc; 2016.\"\r\n    Accessed 2 November 2017.", "Fox News.   \"CEO of Papa John's Says Employees' Hours Will Likely Be Cut Due to Obamacare.\"\r\n    11 November 2012.", "Fox News.   \"Papa John's Franchisee Gets Jail Time for Illegally Taking Employee Wages.\"\r\n    17 November 2015.", "RT.   \"Under Fire: Chipotle, Papa John, Mcdonald’s Over ‘Pervasive’ Wage Theft And Discrimination.\"\r\n    27 August 2016.", "WXYZ-TV.   \"Mike Ilitch Paid for Rosa Parks' Housing for More Than a Decade.\"\r\n    11 February 2017.", "UPI.   \"Little Caesars Founder Earns Vets Award.\"\r\n    18 September 2007.", "Press Release.   \"Veterans Affairs Secretary Honors Little Caesars Founder Michael Ilitch.\"\r\n    17 September 2007.", "QSR Magazine.   \"Papa John’s Teams Up with Cowboys for Charity.\"\r\n    9 August 2016.", "Ilitch Companies.   \"Mike Ilitch.\"\r\n    Accessed 2 November 2016.", "American Red Cross.   \"Hawaii Red Cross Is the Papa John’s Charity of the Month!\"\r\n    27 February 2017.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]