["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Cindi Castilla, president of the Dallas Eagle Forum, listens to U.S. Sen. Ted Cruz, R-Texas, speak in Austin in August 2018 (Stephen Spillman / for American-Statesman).", "During an Oct. 31 press conference, leaders from conservative advocacy organizations in Texas urged Gov. Greg Abbott to call a special legislative session to elect a new House speaker.", "Earlier that month, embattled House Speaker Dennis Bonnen announced that he would not seek re-election to his seat in the House.", "The activists also outlined policy proposals that they want lawmakers to address during a special session, proposals they say Republican leaders failed to pursue during the regular session earlier this year.", "Cindi Castilla, president of the Dallas Eagle Forum, said lawmakers need to take steps to limit what gender transition treatments are available to children, in light of an ongoing legal battle in Dallas over the gender identity of a 7-year-old.", "\"During our last session, our legislators decided to pass a law protecting Texans from e-cigarettes until they reach the age of 21,\" she said. \"They left children able to be sterilized and mutilated at any point in their life. This was a failing, and we need a remedy.", "\"Texas Eagle Forum asked lawmakers to carry a very common-sense bill that would protect young Texans. That bill would have protected (the child), no matter what the verdict was going to be from the courts.\"", "Before we dive into this check, it should be noted that medical or surgical treatments used by doctors for transitioning must meet the same safety requirements of other medications or surgeries. To suggest that any child might be mutilated by doctors is inaccurate.", "\"Children in Texas are already robustly protected by the Texas Family Code and medical rules of ethics,\" said Brian Klosterboer, an attorney at the American Civil Liberties Union of Texas, in a statement. \"No one in Texas may harm a child, including parents and medical professionals.\"", "When reached via email, Castilla said that she is unaware of any state laws that \"protect children from being given treatments that can lead to sterilization and no law prohibiting surgeries that would seek to make a child appear to be a gender different than the gender they were born.\"", "\"Thus far, it appears very young children have been protected from this only because of the good sense of the medical community,\" she said. \"As we see this protection waning among a small portion of the medical community we would like to make sure that the most vulnerable Texans are protected.\"", "Castilla said the bill she mentioned at the press conference would have \"protected children from these procedures,\" but the group could not find a lawmaker to carry the legislation.", "Dallas custody case", "The legal battle in Dallas that Castilla mentioned in her remarks is a custody dispute between a mother and father that centers on the gender identity of their 7-year-old child.", "The child’s mother says the 7-year-old is a transgender girl and wants to dress as a girl and be identified by female pronouns — a process referred to as a social transition. The child’s father disagrees and insists that the child is a boy.", "The case has spurred a national debate about children and their gender identities, with some Texas Republicans pledging to pursue legislation to prevent minors in Texas from transitioning by medical means.", "Gillian Branstetter, spokeswoman for the National Center for Transgender Equality, said an important point to consider in this case is the child’s age.", "\"This child is 7 years old,\" she said, noting that \"no one is talking about\" pursuing a medical or surgical transition. \"We’re talking about gender affirming parenting and letting the child explore who they are.\"", "Looking at the law", "Under federal law, transition-related medical care is considered the same as any other medically-necessary care and carries the same requirements when it comes to minors, according to Branstetter and attorneys with ACLU of Texas.", "Generally speaking, Texas law dictates that parents have a \"duty\" to provide medical and dental care to their children and they have the \"right\" to consent to that care.", "But pursuing gender transition treatment is an individualized process for transgender and gender non-binary people and can take many forms, according to multiple resources on gender identity and gender dysphoria.", "People with gender dysphoria — when a person feels a conflict between the gender they were assigned at birth and the gender with which they identify — choose to act on this in different ways.", "This can include wearing clothes and using pronouns associated with their gender identity; changing their gender and name on legal documents; pursuing hormone treatment or surgical options available for transitioning.", "Not every person who has gender dysphoria and is transgender will pursue medical or surgical transition treatment.", "People can be diagnosed with gender dysphoria at any age, even as children.", "\"While some children express feelings and behaviors relating to gender dysphoria at 4 years old or younger, many may not express feelings and behaviors until puberty or much later,\" reads an article on the subject from the American Psychiatric Association. \"For some children, when they experience puberty, they suddenly find themselves unable to identify with their own body.", "Medical treatment standards prioritize affirmation", "When it comes to caring for children who might be exhibiting signs of gender dysphoria, the American Academy of Pediatrics recommends the \"gender-affirmative care model\" that prioritizes validating a child’s gender identity and supporting their exploration and expression of that identity.", "\"There are absolutely no medical interventions or surgical interventions on any prepubertal child,\" said Colt Keo-Meier, a Texas-based psychologist and author who specializes in gender and sexual health. \"That is not happening.\"", "The widely accepted \"Standards of Care\" maintained by the World Professional Association for Transgender Health also emphasize this point.", "\"Before any physical interventions are considered for adolescents, extensive exploration of psychological, family, and social issues should be undertaken,\" the standards read. \"The duration of this exploration may vary considerably depending on the complexity of the situation.\"", "Once a child starts puberty, other options emerge. Keo-Meier said the most common treatment — medication to delay the onset of puberty — is fully reversible.", "\"That is literally just hitting pause,\" he said.", "The World Professional Association for Transgender Health outline minimum criteria that must be met before a child can receive puberty-suppressing medication, including that the child has demonstrated a \"long-lasting and intense pattern of gender nonconformity or gender dysphoria\" and that it \"emerged or worsened with the onset of puberty.\"", "Other, interventions like hormone therapy (partially reversible) or surgery (irreversible) won’t be considered until a patient reaches adolescence.", "Even then, the Standards of Care stress that certain procedures should not be performed until a patient is old enough to consent on their own (typically 16-18 years old) and others should occur only once a person has received other treatments for a specific time period.", "Our Ruling", "Castilla said state lawmakers \"left children able to be sterilized and mutilated at any point in their life\" by failing to adopt a law prohibiting minors from undergoing medical or surgical gender transitions.", "Castilla is right that there is no law regulating transition-related treatment separately from other medically-necessary care and the same age regulations apply — minors need parental consent.", "Widely accepted guidelines for transition care emphasize gender-affirming care and therapy as primary tools for children. More intensive options, like surgery or hormone treatment, are typically reserved for older adolescents (with parental consent) and adults.", "We rate this claim Mostly False.", "Austin American-Statesman, Conservative groups call for special legislative session, Oct. 30, 2019", "Dallas Morning News, Could transgender kids’ care be next ‘bathroom bill’ for Texas Republicans?, Oct. 25, 2019", "Dallas Morning News, Mother in Dallas 7-year-old transgender child custody case calls for judge’s recusal, Nov. 5, 2019", "GLAAD, Media Reference Guide — Transgender, accessed Nov. 1, 2019", "University of California-San Francisco, Transition Roadmap, accessed Nov. 1, 2019", "The World Professional Association for Transgender Health, Standards of Care Version 7, 2012", "Texas Health Steps, Teen Consent and Confidentiality, Nov. 7, 2019", "Phone interview with Gillian Branstetter, spokesperson for the National Center for Transgender Equality, Nov. 6, 2019", "Email interview with Branstetter, Nov. 6, 2019", "Centers for Disease Control and Prevention, Transgender Identity and Experiences of Violence Victimization, Substance Use, Suicide Risk, and Sexual Risk Behaviors Among High School Students, Jan. 25, 2019", "Endocrine News, Endocrine Society Urges Policy Makers to Follow Science on Transgender Health, October 2019", "American Academy of Pediatrics, AAP Policy Statement Urges Support and Care of Transgender and Gender-Diverse CHildren and Adolescents, Sept. 17, 2018", "American Academy of Pediatrics, Ensuring Comprehensive Care and Support for Transgender and Gender-Diverse Children and Adolescents, Oct. 2018", "The Arizona Republic, Judges can overrule parents on treatment for transgender children, Arizona Supreme Court rules, April 26, 2019", "American Psychiatric Association, What is Gender Dysphoria?, accessed Nov. 1, 2019", "U.S. Department of Health and Human Services, Access to Healthcare: Non-discrimination, accessed Nov. 4, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]