["Phil Scott is running for his second term as governor of Vermont. Photo by Bob LoCicero/VTDigger", "Gov. Phil Scott said in a debate this month that Vermont’s tax system is the most progressive in the nation.", "Scott made the claim while criticizing a proposal from his Democratic challenger, Christine Hallquist, who wants to use the income tax to pay for education. Vermont schools are primarily supported by a statewide property tax.", "Hallquist says an income tax would be a fairer way to pay for schools because it would ensure that wealthy residents pay a more equitable proportion of education costs.", "Scott countered that \"the people I’m talking to think they are paying their fair share and more.\"", "\"We have the most progressive tax system in the country, right here in Vermont,\" Scott said. \"So I’m not sure how many of these rich people we have left in Vermont because they’re moving out.\"", "Is Vermont’s tax system really the most progressive in the nation?", "Tax policy experts agree that Vermont’s tax system is among the most progressive in the country, but no research concludes that it is the most progressive.", "In fact, some suggest Vermont trails California and Delaware. And some researchers say that California, which has a much higher income tax than Vermont for those in the top bracket, clearly has a more progressive system.", "Scott's assertion came from a Vermont Department of Taxes presentation, according to Rebecca Kelley, the governor's spokesperson. At the time, the administration was crafting its proposal restructuring the state’s income tax system to adjust for federal tax changes.", "The department based its report on two sources: A study from the Tax Foundation and a graph by the Institute on Taxation and Economic Policy. \n \nThe Tax Foundation study, which was published in 2014 and looks at income tax structures across the country, concludes that Vermont, California and New Jersey have the most progressive rate structures \"by a wide margin.\"", "By two progressivity measures, Vermont falls behind the other states.", "The first measure looks at where the state’s top tax rate kicks in, an indicator of how much the wealthy residents pay, compared with others. Vermont ranked fifth in this category.", "The top ranked state, California had a 9.3 percent gap between the two rates: its top rate in 2014 was 13.3 percent, and its rate on those making $25,000 was 4 percent. In Vermont, which ranked third, the top rate was 8.95 percent and the lower rate was 3.55 percent.", "The second source Kelley pointed to was a graph by the Institute on Taxation and Economic Policy (ITEP), which compares the top 1 percent and bottom 20 percent of taxpayers in all 50 states. The graph compares how much residents in these two brackets pay in all state taxes, including income, property, and excise taxes.", "The graph, which relied on data from 2012, shows that Vermont had the second most progressive tax system -- after Delaware.", "The latest data from ITEP, released in a new report earlier this month, shows that Vermont’s system is the second most equitable in the country, behind California. The bottom 20 percent of Vermonters pay 8.7 percent of their income in state taxes while the top 1 percent pay 10.4 percent.", "Carl Davis, the research director for ITEP, said he doesn’t believe it would be accurate to call Vermont the most progressive state. California has a much higher top rate for the wealthiest taxpayers, he said.", "\"In our research Vermont does not have the most progressive system in the nation, but it is certainly far less regressive than the vast majority of states,\" Davis said.", "Vermont has one of the most progressive tax systems in the country, but no research exists showing that it has the most progressive system.", "The research the governor’s administration cited does not support the claim, but in several cases refutes it.", "However, research on the relative progressivity of state tax systems is limited and appears to vary greatly based on methodology.", "We rate this statement as Mostly False.", "Tax Foundation, Which States Have the Most Progressive Income Taxes? September 24, 2014", "Tax Foundation, State and Local Sales Tax Rates in 2014, March 18, 2014", "Institute on Taxation and Economic Policy, Who Pays? October 17, 2018", "Institute on Taxation and Economic Policy, Fairness Matters: A Chart Book on Who Pays State and Local Taxes, October 17, 2018", "VTDigger 2018 Gubernatorial Forum, October 10, 2018", "Interview, Carl Davis, research director for Institute on Taxation and Economic Policy, October 11, 2018", "Email interview, Rebecca Kelley, Gov. Phil Scott spokesperson, October 18, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]