["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "President Donald Trump speaks during a campaign rally at Erie International Airport, Tom Ridge Field in Erie, Pa, Tuesday, Oct. 20, 2020. (AP)", "President Donald Trump has criticized some governors for imposing restrictions to limit the spread of the coronavirus, and at a rally in Erie on Tuesday, he lambasted Pennsylvania Gov. Tom Wolf.", "Trump told his supporters that Pennsylvania \"never reopened\" after Wolf ordered the shutdown of \"non-life-sustaining businesses\" in March, soon after the outset of the pandemic.", "\"What the hell is going on with your state?\" Trump said. \"You guys never opened.\"", "Day-to-day life in Pennsylvania hasn’t returned to normal, and it may not until a coronavirus vaccine is widely available. But the state’s schools and businesses aren’t uniformly shuttered as they were in the spring.", "All 67 Pennsylvania counties are in the \"green\" phase of the Wolf administration's three-phase reopening plan and have been since July 3, meaning most businesses may operate at 75% capacity, and school districts may decide whether to offer in-person instruction. Lebanon County, east of Harrisburg, was the last county to move from \"yellow\" to \"green.\"", "Pennsylvania’s lockdown began on March 19, when Wolf ordered all non-life-sustaining businesses to close to help stop the spread of the virus. Two weeks later, Wolf issued a statewide stay-at-home order, and one week after that, he announced that schools would remain closed through the end of the academic year.", "At that point, all counties were in the \"red\" phase, with severe restrictions imposed by Wolf.", "In mid-April, the governor announced the criteria for counties to reopen — fewer than 50 new confirmed cases per 100,000 residents reported to the state in the previous 14 days. He said the state would also assess whether a county had enough testing and contact tracing, and he set May 8 as a target date to begin lifting restrictions.", "He followed through.", "That day, 24 counties moved from \"red\" to the \"yellow\" phase of reopening, and over the next two months, all counties moved into \"yellow\" and eventually to \"green,\" the least restrictive phase.", "Now that all Pennsylvania counties are in \"green,\" it has been up to each of the state’s 500 school districts to determine whether or not to offer in-person instruction. Philadelphia will welcome some students back to classrooms on Nov. 30, and Pittsburgh plans to reopen on Nov. 9. Students in the Central Bucks district returned on Sept. 30.", "All Pennsylvania counties have remained in the \"green\" phase even as case counts have climbed to the highest level since April, and Pennsylvania Secretary of Health Rachel Levine said as recently as Oct. 14 that the state has no plan to impose any new restrictions.", "\"We're in a much better place than we were in the spring,\" Levine said.", "Besides, whether Wolf has the power to impose another lockdown remains unsettled. In September, a federal judge struck down key elements of the governor’s virus mitigation strategy, labeling the limits he imposed on businesses and gatherings unconstitutional. The state appealed the ruling, and the U.S. Court of Appeals for the Third Circuit agreed to restore the restrictions on gatherings until it rules on Wolf’s petition for relief.", "The state’s COVID-19 dashboard, which displays real-time data on confirmed cases of the virus, shows that Philadelphia, Delaware, Berks and Centre counties all have more than 2,000 cases per 100,000 residents, well above the threshold the state deems safe. Two dozen other counties have more than 1,000 cases per 100,000 residents.", "But so far, Wolf has not imposed any new restrictions.", "Trump said Pennsylvania \"never opened.\" That’s not true. Most businesses were closed and residents were ordered to stay home in April, but restrictions have been lifted gradually since May, and no new lockdowns have been ordered even as case counts climb. Trump’s statement is inaccurate. We rate it False.", "Rev, \"Donald Trump Erie, PA Rally Transcript October 20,\" Oct. 20, 2020", "Commonwealth of Pennsylvania, \"Process to reopen Pennsylvania,\" accessed Oct. 21, 2020", "Patriot-News, \"Lebanon County, the lone yellow county in Pa., will move to green phase July 3,\" July 26, 2020", "Commonwealth of Pennsylvania, \"All non life-sustaining businesses in Pennsylvania to close physical locations as of 8 p.m. today to slow spread of COVID-19,\" March 19, 2020", "Commonwealth of Pennsylvania, \"Gov. Wolf, Sec. of Health: Pennsylvania on Statewide Stay-at-Home Order Beginning at 8 PM Tonight, ‘Most Prudent Option to Stop the Spread’\"April 1, 2020", "Commonwealth of Pennsylvania, \"Governor Wolf Extends School Closure for Remainder of Academic Year,\" April 9, 2020", "Commonwealth of Pennsylvania, \"Gov. Wolf Announces Reopening of 24 Counties Beginning May 8,\" May 1, 2020", "The Philadelphia Inquirer, \"Some Philly students may not be allowed to return to class this school year, Hite says,\" Oct. 14, 2020", "WPXI, \"Pittsburgh Public Schools moving forward with return to in-person learning,\" Oct. 21, 2020", "NBC10, \"Central Bucks Schools to Return to In-Person Learning,\" Sept. 14, 2020", "The Philadelphia Inquirer, \"Pennsylvania reports nearly 1,600 new cases, nearing pandemic highs,\" Oct. 15, 2020", "AP, \"Pennsylvania confirms virus resurges; no plans for lockdown,\" Oct. 14, 2020", "Spotlight PA, \"Wolf’s COVID-19 business closures, limit on gatherings unconstitutional, federal court rules,\" Sept. 14, 2020", "The Philadelphia Inquirer, \"Pa. crowd limits are in effect again after court order, though Wolf hints he’s considering fans at school sports events,\" Oct. 1, 2020", "Commonwealth of Pennsylvania, \"COVID-19 Data for Pennsylvania,\" accessed Oct. 21, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]