["About this rating", "As the daughter of a two-term president and a first lady who went on to serve as a U.S. senator, secretary of state, and presidential candidate, for better or worse Chelsea Clinton has spent the majority of her life in the public eye.", "Among the aspects of such extreme public visibility that count as \"worse,\" we presume, is being the target of defamatory rumors and conspiracy theories. For Chelsea Clinton (as well as for her parents), this includes accusations of being a \"devil worshiper.\"", "Rumors of Chelsea Clinton's supposed involvement in Satanism go back at least a decade and typically revolve around photographs of her that contain what is described as \"Satanic symbolism.\" This example, found on the \"alt news\" blog Rense.com, was posted in January 2008:", "The same photograph of Chelsea Clinton wearing a necklace adorned with a so-called \"upside-down\" or \"inverted\" cross, together with similar images, would reappear hundreds of times over the next ten years on websites and in social media posts labeling her a \"Satanist.\"", "This tweet from March 2016 elaborated on the theme:", "Like most Satanic worshipers Chelsea Clinton also wheres is an inverted cross pic.twitter.com/dX1ExYAMj3 @ChelseaClinton Filthy Whore", "— Ms. P Henry (@patriotshollow) March 11, 2016", "This one from April 2017 included additional photographs of Clinton wearing the \"upside-down\" cross:", "What's really is disturbing, is that Chelsea Clinton openly wears an upside down cross necklace to show her Satanic faith. pic.twitter.com/MF6LxYHltD", "— Kati Tamasi (@I_mKT2u) April 12, 2017", "And this 2018 tweet offered the closest (but also the blurriest) views of her necklace available on social media:", "Hmmm...\nCould Chelsea Clinton be a Satanist?\nIsn't they're symbol an upside down cross?? pic.twitter.com/Xfv3lczkYG", "— Ricky Rainey (@RickyRainey4) August 11, 2018", "These posts raise two critical questions. First, do the photographs authentically depict Clinton wearing an upside-down or inverted cross, or were they altered, misrepresented as, or mistaken for doing so? Second, is an inverted cross truly symbolic of Satan worship or involvement in a \"Satanic\" organization?", "To the first point, we put the question of whether or not Chelsea Clinton (who is a Methodist) wears an upside-down cross to her spokesperson, Bari Lurie, in January 2018. Lurie responded as follows:", "The photo online appears to be a Photoshop of the attached cross that she has and wears on rare occasion. It is a called a Greek Cross or an equilateral cross that was given to her as a gift when she graduated high school. She does not own and has never worn an upside-down cross.", "Photo provided by Bari Lurie", "The Greek cross (in contrast to the more familiar Latin cross) has four equilateral arms and has been in use since the fourth century, if not earlier. Clinton herself confirmed that she owns and wears one by tweeting a higher-quality image of the same pendant in response to questions about it in 2018:", "Hi Carmine - thank you for asking. Yes, it's clearly been distorted. The Greek cross I often wear is pictured below. It's quite clearly not upside down! pic.twitter.com/6BojdkX748", "— Chelsea Clinton (@ChelseaClinton) August 15, 2018", "Although it's not unreasonable to suppose that the images that seem to show Clinton wearing an inverted cross were purposely manipulated (as both she and her spokesperson suggested), the distortion may also simply be an effect of how low-resolution and blurry the images are. The cross is affixed to the necklace by a rounded clasp that may appear to be part of the cross itself at low resolutions. (For example, compare how the cross looks in the image above in which Clinton is wearing a light-green sweater to how it looks in higher-resolution images taken on the same occasion in 2006.)", "Last, here is a higher-quality image of Clinton wearing her Greek cross pendant at a social function in 2005:", "Embed from Getty Images", "As to whether or not it's legitimate to conclude that someone wearing an upside-down cross is ipso facto demonstrating \"fealty to Satan\" or membership in a Satanic church, we quote Hector Molina of the Catholic Answers website:", "The truth of the matter is that the upside-down cross is an ancient symbol of St. Peter's crucifixion. Tradition tells us that when St. Peter was martyred, he insisted that he be crucified upside down as he did not believe himself worth to be crucified in the manner of his Lord....", "As a result of the manner in which he was crucified, the Church has used the upside down cross (without a corpus, so not a crucifix) to designate Peter, not Christ. The Pope, being the successor of Peter, employs the symbol of the upside down cross as a symbolic reminder of St. Peter's humility and heroic martyrdom. Unlike an upside-down crucifix, which seeks to invert and subvert its meaning, there is nothing satanic about an upside down cross.", "That having been said, some people who call themselves \"Satanists\" do wear upside-down crosses and/or crucifixes. According to the Church of Satan's website, they do not regard the inverted cross as an official symbol, but members may wear such items if they find \"personal meaning\" in the gesture:", "The reversed cross is often seen by Christians as symbolic of St. Peter since legend states that he was crucified upside down (at his own request) by the Romans and thus it also can serve as symbolic of the office of the pope of the Roman Catholic Church. Literature has long depicted anyone who has embraced Satan and thus rejected Jesus as having embraced the reversed cross as symbolic of that act. Satanists are free to employ any symbols which they feel have resonance, so if such an upside-down cross has personal meaning they could use it.", "However, the prime symbol for Satanists is the Sigil of Baphomet ...", "Another high-profile organization claiming an affiliation with Satan, the Satanic Temple (best known for erecting a statue of a deity called Baphomet outside the Arkansas State Capitol building in August 2018), gives a more prominent place to the upside-down cross. This description of preparations for a \"Satanic ritual\" is from one of the temple's websites:", "It's a Saturday night, July 2015, and across Detroit the friends and followers of The Satanic Temple prepare themselves. They powder their faces and line their eyes, smack on black lipstick and slide into corsets, robes, three-piece suits. Later they convene in an empty warehouse. It's lit red, adorned with pentacles and an inverted cross.", "And there was this report in the 12 July 2018 edition of the Indianapolis Star:", "Community members wearing inverted crosses and pentagrams while picking up trash could soon become a common sight along a stretch of U.S. 421 in Boone County.", "This week, The Satanic Temple Indiana completed the first cleanup of the organization's \"Inverted Crossroads\" Adopt-A-Highway campaign.", "The inverted cross is a commonly used Satanic symbol.", "It should be noted, however, that neither the Church of Satan nor the Satanic Temple subscribes to a literal belief in Satan. Both groups, on the contrary, completely reject theism and the attendant worship of supernatural beings (including Satan), grounding their philosophies in rational self-interest and individualism instead.", "Mack, Justin L.   \"Why the Satanic Temple Indiana Adopted a Stretch of Highway in Boone County.\"     Indianapolis Star.   12 July 2018.", "Molina, Hector.   \"The Upside Down Cross: Satanic or Symbolic?\"     Catholic Answers.   17 July 2014.", "Symbols Project.   \"Greek Cross.\"     Accessed 22 August 2018.", "Symbols Project.   \"Latin Cross.\"     Accessed 22 August 2018.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]