["About this rating", "Nikola Tesla was an inventor, an engineer, a futurist, a physicist and — according to an frequently shared viral image — a swim instructor.", "A photograph purportedly showing the famous inventor at the beach has been shared with a variety of captions over the years. The Twitter account \"History Photographed, \"for instance, once claimed that it showed a young Tesla teaching a girl to swim in 1900, \"Weird History\" labeled the inventor a \"swim instructor,\" while \"The History Lovers Club\" merely noted that this was a young Tesla at the beach:", "None of these captions are accurate, however, as the man in the photograph is not Nikola Tesla. According to the Museum of the City of New York, this image was taken in 1898, and shows a man (identified as a \"swimming instructor\") and a woman (identified as a \"bather\") at Midland Beach in Staten Island.", "The man in this image does bear a passing resemblance to the famed inventor. However, Tesla was about 42 years old in 1898 (when this photograph was taken), while the man in the image appears to be quite younger. Here's a comparison of the \"Swim Instructor\" and an image of Tesla that was taken in 1896:", "One notable difference is the hairline, which is unlikely to stop receding (and in fact grow back) over a period of two years. The ears are also markedly different.", "It is also highly unlikely that Tesla had the time, inclination, or financial need to secure a job as a swim instructor around that time. Tesla already had several successful patents and was operating several laboratories around New York City by 1898.", "Gunderman, Richard.   \"The Extraordinary Life of Nikola Tesla.\"\r\n    Smithsonian Magazine.   5 January 2018.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]