["Ahead of President Joe Biden’s swearing-in on Jan. 20, social media users started to point out the crowd size at his inauguration ceremony, comparing it to now-former President Donald Trump’s audience in 2017.", "One viral Facebook post claims that Biden’s small inauguration crowd size proves that Trump actually won the election. Claims that Biden unfairly won the election are baseless and have been debunked multiple times.", "The post includes two photos, one showing a relatively empty National Mall outside the U.S. Capitol at this year’s inauguration and another showing a larger crowd at the same location in 2017.", "“2017 vs 2021...Trump vs Biden...Winner vs Loser,” the user captioned the post.", "The post garnered more than 2,700 reactions and 800 shares. USA TODAY has reached out to the user for comment.", "Fact check:Viral TikTok alters Army Band's music to 'Hit the Road Jack'", "The debate surrounding inauguration ceremony crowd sizes is not new. Trump’s inauguration crowd size was one of the first controversies to mark his administration after then-Press Secretary Sean Spicer falsely claimed that it was the largest audience to witness an inauguration.", "Presidential inaugurations are typically attended by hundreds of dignitaries, including former presidents, Supreme Court justices and lawmakers. Hundreds of thousands of attendees also spill out across the National Mall to watch the event, USA TODAY reported.", "Attendance for this year’s inauguration ceremony, however, was restricted due to the coronavirus pandemic.", "Fact check:Biden inauguration impacted by pandemic, security threats", "Both photos included in the post appear to be authentic screenshots of live coverage, according to an NBC livestream of Trump’s inauguration and a CNBC livestream of Biden’s inauguration. But officials encouraged people to celebrate Biden’s inauguration at home to prevent the spread of COVID-19, which has killed more than 400,000 Americans.", "\"There are many grand traditions to the inaugural, and we plan to honor them by highlighting more of our nation’s people than ever before while keeping everyone safe,\" Tony Allen, the inaugural committee’s chief executive officer, told USA TODAY.", "Tickets for Biden’s inauguration ceremony were limited. Although members of Congress are usually given a total of 200,000 tickets to distribute to constituents, they were only given tickets for themselves and one other guest this year to limit crowd size, according to the Joint Congressional Committee on Inaugural Ceremonies.", "Subway stations across the city were also closed and National Guard members were stationed near the Capitol ahead of the ceremony, according to USA TODAY.", "District of Columbia Mayor Muriel Bowser encouraged people to stay home and watch the inauguration virtually after a pro-Trump mob stormed the Capitol on Jan. 6, leaving five people dead.", "\"Our goals right now are to encourage Americans to participate virtually and to protect the District of Columbia from a repeat of the violent insurrection experienced at the Capitol and its grounds on January the 6th,\" Bowser said at a Jan. 11 press conference.", "More:The inauguration of Joe Biden and Kamala Harris", "Although Trump and his supporters have repeatedly alleged that Biden unfairly won the 2020 election, these claims are baseless. Election officials have said the election was conducted fairly and there is no evidence of widespread voter fraud.", "Both candidates received a record-breaking number of votes, but Biden beat Trump by more than 7 million votes, amassing about 81 million votes to Trump's roughly 74 million, USA TODAY reported.", "Lawsuits alleging voter fraud have largely failed in court, according to USA TODAY. In December, the Supreme Court rejected a lawsuit by Texas challenging the election results in four battleground states.", "Fact check:What's true about the 2020 election, vote counting, Electoral College", "The claim that President Joe Biden’s inauguration crowd size proves that former President Donald Trump actually won the 2020 election is FALSE, based on our research. While Biden’s inauguration ceremony crowd size was smaller than Trump’s, there were restrictions in place because of COVID-19.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]