["By Saranac Hale Spencer", "Posted on September 25, 2018", "Q: Is there a photo of former Vice President Joe Biden groping a woman’s chest?", "A: No. A Christmas party photo from 2013 has been altered to appear that he did.", "Former Vice President Joe Biden grasped a woman by the waist in a 2013 Christmas party picture, a move that got criticized at the time.", "Shortly after the photo became public, a website that describes its content as “conservative satire” manipulated the photo so it would appear that Biden was groping the woman’s chest with a bottle of Wild Turkey whiskey in his pocket.", "Neither of those things are shown in the original picture, which features Biden with The Hill’s White House correspondent, Amie Parnes.", "The manipulated version has been in regular circulation online for years with no indication that it was lifted from a website that considers its content to be satirical.", "After a woman recently came forward to accuse Supreme Court nominee Brett Kavanaugh of sexual assault, the doctored photo of Biden has reappeared – this time with a text box at the top that says: “Brett Kavanaugh eat your heart out!” The bottle of whiskey — a clue that it’s an altered image — has been cropped out of the latest version circulating on Facebook.", "One copy of it has been shared 17,000 times on Facebook. Another was shared almost 2,000 times.", "But the picture isn’t real, it’s just the latest incarnation of an old manipulation.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on the social media network.", "Rothstein, Betsy. “VICE PRESIDENT JOE BIDEN GROPES WHITE HOUSE REPORTER.” The Daily Caller. 16 Dec 2013.", "“Biden Sexually Molests Reporter.” WorldNewsBureau.com. 16 Dec 2013.", "Senate Committee on the Judiciary. “Update on the Senate Judiciary Committee’s Investigation into Allegations Involving Supreme Court Nominee Judge Brett M. Kavanaugh.” 23 Sep 2018.", "Higgins, James. “Brett Kavanaugh eat your heart out!” Facebook.com. 17 Sep 2018.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]