["President Donald Trump signed an $8.3 billion emergency spending bill to address the coronavirus on March 6.", "The bill was held up as both Republicans and Democrats negotiated over controlling the cost of vaccines and treatments.", "There is no evidence House Speaker Nancy Pelosi delayed the bill solely to run political ads.", "On March 6, 2020, President Donald Trump signed an $8.3 billion spending package to combat the spread of the novel coronavirus. The package sailed through the House and Senate with bipartisan support, but not without some partisan sniping.", "Some stories — like this one — are going around claiming Democratic House Speaker Nancy Pelosi delayed the bill in order to use the crisis as a political weapon against Republicans.", "The claim surfaced as Republicans and Democrats were still negotiating details of the spending package, such as where the money would come from and provisions on treatment costs.", "The story was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The article cites a recent report by conservative website Red State. That report, based on comments made by House Minority Leader Kevin McCarthy, R-Calif., says Pelosi held up the bill so that the campaign arm of House Democrats could run ads against Republicans on Super Tuesday about their lack of action regarding the virus.", "In a March 2 interview with Fox News host Laura Ingraham, McCarthy claimed Pelosi \"withheld the bill last week. You know why? So the DCCC could run ads against seven Republicans.\" He repeated the statement in a press conference the following day.", "It’s true that the Democratic Congressional Campaign Committee, the official campaign arm of House Democrats, released ads related to the coronavirus in seven Republican districts.", "But when McCarthy made the comments, he and other Republicans were participating in negotiations about the package. There is no indication that Pelosi deliberately held up the bill for the sake of the ad campaign.", "The DCCC announced on March 2 that the ads would run on Facebook in seven Republican congressional districts to call on their representatives to \"stand up\" to the Trump administration for an affordable coronavirus vaccine.", "The ads target comments made by Health and Human Services Secretary Alex Azar, who said during a hearing that the administration \"can’t control that price because we need the private sector.\"", "\"The Trump administration would rather pad the pockets of drug manufacturers than provide access to an affordable coronavirus vaccine,\" the ads say. The clip ends with the Republican representative’s name, asking if they agree.", "Reports indicate the bill stalled because of Democrats’ attempts to limit the cost of vaccines and other treatments that are developed in response to the outbreak.", "Pelosi has been consistent about those provisions in multiple statements.", "In a joint statement on Feb. 27, Pelosi and Senate Minority Leader Chuck Schumer said that any package Congress approves must be \"entirely new funding — not stolen from other accounts\" and must include provisions ensuring that:", "\"The president cannot transfer these new funds to anything other than the coronavirus and fighting infectious diseases; vaccines are affordable and available to all the need it; interest-free loans are made available for small businesses impacted by the outbreak; and state and local governments are reimbursed for costs incurred while assisting the federal response to the coronavirus outbreak.\"", "Pelosi called for the same provisions in another statement on Feb. 29, after the first coronavirus-related death was reported in the U.S. The Democrats’ requests did make it into the final bill.", "Drew Hammill, Pelosi’s deputy chief of staff, pointed us to a response he made to McCarthy on Twitter, in which he called the accusation \"disgusting and false.\"", "\".@GOPLeader, call your office. The bipartisan negotiations on the coronavirus funding supplemental are still underway. Your staff have been participating in those talks. This is a disgusting and false accusation.\"", ".@GOPLeader, call your office. The bipartisan negotiations on the coronavirus funding supplemental are still underway. Your staff have been participating in those talks. This is a disgusting and false accusation. https://t.co/F9tvdk2XPo", "\"It was a particularly outrageous statement,\" Hammill added in an email, \"because McCarthy’s own staff was participating in ongoing negotiations that had not concluded when he said this.\"", "We reached out to McCarthy’s office for a response but did not hear back in time of publication.", "The bill, which dwarfed the $2.5 billion in funding that the Trump administration initially proposed, was introduced in the House on March 4 and swiftly passed that day, 415-2. The two nays were from Republican Reps. Andy Biggs of Arizona and Ken Buck of Colorado. It passed the Senate the following day, with only Sen. Rand Paul, R-Ky., voting against it.", "The funding includes more than $3 billion for research and vaccine development and $2.2 billion for prevention, preparedness and response efforts. It also allocates $1 billion for state and local response.", "Stories claim Pelosi held up coronavirus emergency funds so that Democrats could campaign on the issue.", "During negotiations with Republicans on the funding package, Pelosi pushed for language on how the aid would be paid for and on the cost of treatments. Meanwhile, the House Democrats’ campaign arm ran ads targeting a Trump administration official’s comments about vaccine costs.", "The stories make unsupported claims about Pelosi’s motives and omit the role Republicans played in the bill’s negotiations. We rate it Mostly False.", "Archive.is, Pelosi Actually Slowed Coronavirus Funding so Dems Could Campaign On It, March 6, 2020", "Red State, Pelosi’s ‘Dirty Little Secret’: She Held Back Coronavirus Funding Bill so DCCC Could Run Super Tuesday Ads Against GOP, March 3, 2020", "Fox News, Rep. Kevin McCarthy says Nancy Pelosi put party over country in face of coronavirus threat, March 2, 2020", "Democratic Congressional Campaign Committee, DCCC Launches Ads Demanding Republicans Stand Up To Trump For An Affordable Coronavirus Vaccine, March 2, 2020", "Politico, Coronavirus emergency bill stalled over vaccine cost concerns, March 3, 2020", "Politico, House swiftly passes bipartisan $8.3B coronavirus package, March 4, 2020", "The Hill, This week: House eyes vote on emergency coronavirus funding, March 2, 2020", "The Hill, McCarthy blasts Democrats' campaign arm for ads against Republicans on coronavirus response, March 3, 2020", "Speaker.gov, Pelosi, Schumer Joint Statement on Congressional Action to Combat the Coronavirus, Feb. 27, 2020", "Congress.gov, H.R.6074 - Coronavirus Preparedness and Response Supplemental Appropriations Act, 2020, March 4, 2020", "Email interview, Drew Hammill deputy chief of staff for Nancy Pelosi, March 10, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]