["A woman talks on a cell phone as she walks past an abandoned home in east Buffalo, N.Y. There are as many as 10,000 vacant, abandoned homes in Buffalo, where the population has shrunk substantially since the 1950s. (AP)", "New York has seen significant population losses for a decade, and they exceed the losses experienced by other states.", "Tedisco described the one-year loss of 126,000 incorrectly; it refers to overall population loss, not just migration out of the state.", "From 2010 to 2019, New York lost more than 1 million people on net.", "Has New York state seen bigger losses in population from out-migration than any other state? That’s what state Sen. Jim Tedisco said in a press release issued with fellow members of the Senate Republican Conference", "On Jan. 5, Senate Republicans unveiled their plan to \"Reset New York State,\" saying they sought to lower taxes, improve local economies and get smarter about addressing the coronavirus pandemic.", "In the release, Tedisco said that in order for New York to address its economic challenges, the Legislature must first grapple with the pattern of New York residents fleeing the state for other locales.", "\"In order to reset New York State by safely restarting our economy, we need to address the elephant in the room that our state government is not talking about: the fact that for the third year in a row, New York leads the nation in outmigration of residents, with 126,000 people leaving last year and over one million in the past decade,\" Tedisco said in the release. \"When enough people who can afford to leave New York State are gone, who will be left to pay for the infrastructure, health care, schools and other necessities?\"", "New York has indeed experienced population losses over the past decade, we found, but the nature of the losses is not quite as Tedisco suggests.", "Adam Kramer, Tedisco’s chief of staff and director of communications, directed PolitiFact’s reporters to several articles referring to the total population decline of 126,000 people, but this figure isn’t necessarily tied to domestic out-migration.", "Kramer cited the U.S. Census Bureau’s new population figures released on Dec. 22, 2020, which show changes between July 2019 and July 2020. The figures show that New York’s population decreased by 126,355 people during that period, or a 0.65% drop from a year earlier.", "That was the nation’s largest loss of population for that period, with Illinois having the second-biggest loss.", "However, it’s important to note that the population loss figure is not necessarily attributable to out-migration to other states. The figure also reflects net international migration and natural increases from births minus deaths, said William Frey, chief demographer at the Brookings Institution, a think tank in Washington.", "In 2020, deaths could be a significant factor, since New York experienced roughly 25,000 coronavirus deaths during the period reflected in the Census statistics.", "The Census Bureau has not yet released a more detailed breakdown of population changes from 2019 to 2020, so it’s not clear yet how much of New York’s population loss stems from migration to other states.", "That said, recent history supports Tedisco claim that New York has experienced significant migration to other states. This brings us to his second assertion.", "Census data shows that between 2010 and 2019, New York state gained about 75,000 people overall. However, the population losses to other states were substantial — almost 1.38 million people. This was larger than any other state, with California ranking second.", "The reason for the overall gain is that the domestic losses were more than balanced out by a net gain of 698,000 from international migration and a net gain of more than 758,000 from births minus deaths.", "The breakdown for domestic out-migration isn’t available yet for 2020, but figures are available for the overall population figure. They show that New York’s small overall population gain from 2010 to 2019 was reversed by 2020, with the state losing almost 117,000 between 2010 and 2020.", "When Tedisco made his claim, his Republican colleagues largely blamed the state government for the population decline. Sen. Joseph Griffo said in the statement that people are leaving New York because of \"unwelcome policies, burdensome regulations and high taxes,\" while Sen. George Borrello cited \"high taxes, excessive, job-killing regulations, and a rising crime rate\" as reasons for population loss.", "Tom W. Smith, senior fellow and director of the University of Chicago’s Center for the Study of Politics and Society, said that these factors may help cause out-migration, but he added that other factors can as well, even the prevailing weather.", "Despite Tedisco’s assertion that out-migration will make it difficult for New York to be able to pay for infrastructure, health care, schools and other necessities in the future, Frey said New York’s population losses aren’t enough to cause that.", "\"While there may continue to be a negative domestic out-migration from New York, it has not been dramatically different than the past, especially when compared with the early 2000s,\" he said.", "Tedisco said that \"New York leads the nation in outmigration of residents, with 126,000 people leaving last year and over one million in the past decade.\"", "New York has seen significant population losses for a decade, exceeding the losses in other states. However, he described the one-year loss of 126,000 incorrectly. That figure refers to net population changes for all reasons, including gains from international in-migration and births minus deaths.", "We rate the statement Half True.", "New York State Senate, Senate Republican Leader Ortt And Republican Conference Announce Plan to \"Reset New York State\", January 5, 2021", "Brookings Institution, The 2010s saw the lowest population growth in U.S. history, December 22, 2020", "Northern New York Newspapers, Census Bureau: More people left New York than any other state, December 29, 2020", "Empire Center, New York Had Largest 2019-20 Population Decline, December 22, 2020", "Email interview with William Frey, chief demographer at the Brookings Institution, January, 17, 2021", "Email interview with Tom W. Smith, senior fellow and director of the Center for the Study of Politics and Society, December 15, 2021", "Email interview with Adam Kramer, chief of staff and director of communications for state Sen. Jim Tedisco, January 19, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]