["About this rating", "On 18 December 2017, an Amtrak train on its way from Seattle to Portland derailed and crashed in DuPont, Washington, killing three people and leaving scores of others injured.  According to the National Transportation Safety Board (NTSB), the train was traveling nearly 80 miles per hour in a 30-mile-per-hour zone at the time of the accident.", "Shortly after the tragedy, various disreputable web sites published articles under headlines such as “BREAKING: FBI Identifies Muslim Terrorist Who Derailed Amtrak Train\" and \"Derailed Amtrak Train Was No Accident After All, Muslim Man Arrested,” holding that the crash was deliberately caused by a 'Muslim terrorist' who sabotaged the tracks to cause a derailment (supposedly employing a method common to urban legendry):", "The Amtrak tragedy over the weekend was, as we all predicted, no accident — and according to the FBI, the terrorist was from the “religion of peace.”", "Muhammad Christopher Blair, 53, was born in rural Ohio to a Christian woman and a Muslim man she fell in love with who ultimately abandoned his family — but his religion and his hatred of America lived on through Blair, who was apparently “activated” over the weekend when he placed a gold Sacajawea dollar on the tracks above an overpass in Washington state in order to derail the train.", "Traditionally, a penny would be used (that’s what you see in old cartoons, right?) but the United Railway Administration began requiring changes in trains that would prevent coins at the time from causing damage when kids decided they wanted to play a prank. The gold dollar, however, is thicker than any currency at the time and is capable to causing a train to derail according to Harvard physics professor, Dr. James Wright.", "All of these reports were false and were spread by a known fake news network that includes sites such as nofakenews.online and reaganwasright.com, which carry identical disclaimers identifying their content as fiction:", "Everything on this website is fiction. It is not a lie and it is not fake news because it is not real. If you believe that it is real, you should have your head examined. Any similarities between this site’s pure fantasy and actual people, places, and events are purely coincidental and all images should be considered altered and satirical.", "The former site illustrated their story with a completely unrelated photograph of Shaker Aamer, a Saudi citizen who was freed in 2015 after spending 13 years in detention at Guantánamo Bay prison in Cuba.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]