["About this rating", "On 26 July 2016, the web site GodToday published an inaccurate article concerning TV personality Mike Rowe, his charity MikeroweWORKS, and presidential nominees Donald Trump and Hillary Clinton.", "On 13 May 2016, Mike Rowe posed a friendly challenge to Trump in a Facebook post addressing the recent sale of his old bathrobe:", "PS Dear Donald - To be clear, my decision to Trump myself has nothing to do with you personally. However, if you’re nevertheless feeling a slight twinge of guilt for gobbling up all the bandwith, I’d like to suggest a simple path to atonement. I run a modest foundation called @mikeroweWORKS. We award work ethic scholarships to people who wish to learn a skill that’s actually in demand. So far, we’ve distributed over $3 million dollars for the kind of training that gets tradespeople jobs. Anyway, my approach to fund raising is what you might call “non-traditional.” Yesterday, I auctioned off an old bathrobe, stolen from a swanky spa in Napa for $8,405.00. Check it out. https://www.ebay.com/itm/-/252381732048…", "This got me thinking - how much might someone bid for a bathrobe from The Trump Tower? (I took my Mom and Dad there a few months ago, and they had a ball. My Dad still has your slippers, and refuses to part with them.)", "I’d like to make a deal. If you’ve got a spare robe in the hotel inventory that you’re willing to part with, I'd love to auction it off for the benefit of mikeroweWORKS. What do you say? Might be fun to see what someone would pay for a Trump bathrobe that rewards work ethic. I guarantee that millions of voters will see the auction, and thousands of dollars will be raised. It’ll be Yuge!", "PPS. Hell, if you autograph the thing in laundry-proof marker, I bet we could raise enough dough to close the skills gap next week…", "Rowe ended his request for a Donald Trump bathrobe with a message emphasizing the nonpolitical nature of his charity, and a note welcoming similar donations from both Hillary Clinton and Bernie Sanders:", "PPPS Obviously, I can’t promise to vote for you simply because you send me an autographed bathrobe to auction off for a good cause. That sort of inducement - as I’m sure you know - would preclude the non-partisan nature of my foundation. Full disclosure - If Hillary and Bernie sent me a pantsuit and a rumpled jacket - respectively - I’d auction those off in heartbeat...", "On 22 July 2016, Rowe returned to Facebook to inform his fans that Trump had donated a signed bathrobe for his charity. While Rowe expressed gratitude to Trump for the donation, his message was again explicitly nonpartisan:", "As some of you might recall, I auctioned off my ratty old bathrobe several months ago, which raised $8,500 dollars for our scholarship fund. Shortly thereafter, I commented that a better bathrobe, one from Trump Tower and signed by Donald J. Trump, just might raise enough money to close the skills gap. (I also suggested that a tasteful pantsuit from Hillary Clinton, or a similar bathrobe from President Bill Clinton - either of which I’d happily model - would be a most welcome auction item for mikeroweWORKS.)", "Well, thanks to the magical synapses of social media, I am now in receipt of a genuine Trump bathrobe - hand delivered to me a few weeks ago in Baltimore, by a whirling dervish named Tana Goertz who works for Mr. Trump. As the attached video attests, Donald Trump is not only aware of mikeroweWORKS, he supports our objectives, and apparently took my challenge at face value.", "Once again, Rowe finished his Facebook post with a message explaining that his charity was nonpartisan and how the auction was for the benefit of the mikeroweWORKS Foundation, not a specific political party.  However, on 26 July 2016, the web site GodToday reported that Rowe had \"unleashed hell\" on Clinton after she said that she would not donate to his cause:", "Hillary refused to send anything and then gave Rowe a call. She had a conversation with him about the charity and determined she would not donate. Mike Rowe then asked her if she had any Christian values. She refused to answer. That is horrifying to think that a presidential candidate refuses to have Christian values! I am scared for our country. I am scared for our children. We need to fix this! Can you believe what she did?", "There's no evidence that this conversation between Rowe and Clinton ever happened, that Clinton had refused to donate, or that she \"refuses to have Christian values.\" In fact, Rowe ended his Facebook post stating that if Hillary or Bill found something to donate, he would happily auction it \"with the same level of enthusiasm and gratitude.\"", "As of 27 July 2016, the top bid for Donald Trump's bathrobe was more than $15,000.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]