["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "State Rep. Mary González of Clint made a claim about the relative safety of vasectomies and abortions in May 2017 House floor debate (Austin American-Statesman photo).", "A Democrat opposed to an abortion-related measure suggested that a snip exclusive to men has proved less safe than an abortion.", "Rep. Mary González of Clint asked the proposal’s author, Rep. Giovanni Capriglione, in May 2017 floor debate: \"First and foremost, did you know that an abortion procedure is actually... safer than a vasectomy?\"", "Capriglione, R-Southlake, replied that he hadn’t researched complications from procedures other than abortion and he also doesn’t believe all outcomes of abortion procedures in Texas are currently reported. His House Bill 2962 requires hospitals to submit reports to the state on abortion complications.", "Capriglione added: \"Not all medical procedures are equally important.\"", "Maybe not. Still, are abortions safer than vasectomies?", "Representative cites Texas figures, Kentucky story", "A González aide, Andrea Chevalier, said by email the legislator based her abortion-vasectomy safety claim on figures in a Texas Tribune news story and a Kentucky report.", "The cited June 2016 news story says that according to the Texas Department of State Health Services, fewer than 1 percent of Texas abortions in 2014 resulted in any complication to the woman. The story says the overall number of abortions in Texas had dropped to 54,902 from 63,849 in 2013 in the wake of changes in law, advanced by Republicans, expected to drive down the number of abortions by imposing hospital-level safety standards for clinics and requiring physician-providers to hold admitting privileges at nearby hospitals.", "Chevalier said that according to a 2006 article by two Kentucky physicians, the incidence of complications such as infection and bleeding from vasectomies can be as high as 15 percent.", "The article, published in American Family Physician, includes a chart indicating that how a man’s scrotum is penetrated to begin a vasectomy can result in different complication rates. \"No-scalpel vasectomy has been shown to reduce the risk of complications (i.e., bleeding and infection) compared with the incision technique,\" the article says.", "The chart, citing three studies published from 1990 through 2002, shows varied complication rates of 0.2 percent to 15.9 percent--and also wide variations in the results:", "SOURCE: Study, \"Vasectomy: An Update,\" American Family Physician, Dec. 15, 2016 (accessed May 15, 2017)", "We tried to reach the lead author of the update, Tennessee physician Paul Dassow, and didn’t hear back. We turned next to our own research.", "Abortion complications", "When we queried DSHS officials about complications due to abortions or vasectomies, spokesman Chris Van Deusen said by email the state doesn’t track fall-out from vasectomies.", "Van Deusen otherwise pointed us to agency-posted counts indicating that 54,310 Texas residents had abortions in the state in 2015. A separate chart says 52,938 abortion procedures led to no reported complications with 25 procedures resulting in complications, including 10 hemorrhages--which breaks out to a complication rate of less than one-tenth of 1 percent:", "^^ Abortions that took place outside of Texas.", "SOURCE: Chart on web page, \"Selected Characteristics of Induced Terminations of Pregnancy, Texas Residence, 2015,\" Texas Department of State Health Services, last updated March 22, 2017 (accessed May 15, 2017)", "For national perspective, we emailed Rebecca Wind of the Guttmacher Institute, a reproductive health and abortion rights nonprofit. Wind answered by pointing out the institute’s January 2017 \"fact sheet,\" which states a first-trimester abortion carries a risk of less than 0.05 percent of \"major complications that might need hospital care.\" A footnote notes a California study, published in 2013, that tallied a total of six major complications after 11,487 abortions. The study said complications of any kind--mostly minor--occurred 1.3 percent of the time.", "Also to our email inquiry, Barbara Tims of the Texas Medical Association pointed out a 2015 review of 57 studies of abortion complications published from 1980 through April 2015. With few exceptions, the review said, 1 percent or fewer first-trimester abortions resulted in \"cervical laceration needing sutures or hemorrhage that required medical management.\" Also, the report said, physicians who provided antibiotics to women after an abortion said that less than 2 percent of the patients developed infections.", "The researchers wrote: \"Major complications following first-trimester aspiration abortion were very rare. Unanticipated abdominal procedures and hemorrhage requiring transfusion occurred in ≤0.1% of abortions, and the proportion of patients requiring hospitalization to treat major complications was less than <0.5% in most studies reviewed.", "Vasectomy complications", "Wind said the institute doesn’t have expertise on vasectomy complications. But she helped us track down a 2005 analysis of available worldwide evidence for a British medical journal that said: \"Vasectomy, though safe and relatively simple, requires a high level of expertise to minimize complications.\"", "An accompanying chart indicates a 2 percent chance of hematoma, meaning swelling due to blood clotting. \"The incidence of hematoma formation,\" the article states, \"seems to correlate with the surgical experience. The hematoma rate was 4.6% for those performing 1–10 vasectomies per year, as against 1.6% for those performing 11–50 vasectomies a year,\" the article states, footnoting a U.S. study published in 1987.", "On the high end, the chart shows an average 3.4 percent chance of infection which the article says includes wound, urinary and epididymal infection.", "Separately, Tims of the TMA pointed out a July 2016 article from the Canadian Urological Association, footnoted to studies from 1984 through 2007, describing varied complication rates from vasectomies. The article states: \"Men must be informed about wound care and the potential for early complications: infection (0.2‒1.5%), bleeding or hematoma (4‒20%), and primary surgical failure (0.2‒5%). Men should also be made aware of late complications: chronic scrotal pain (1‒14%) and delayed vasectomy failure (0.05‒1%).\"", "We also queried the American Urological Association; by email, spokesman Brandon Corbett guided us to its \"Guideline\" for physicians, last amended in 2015, which states: \"The rates of surgical complications\" from vasectomies \"such as symptomatic hematoma and infection are 1-2%. These rates vary with the surgeon's experience and the criteria used to diagnose these conditions.\"", "Our ruling", "González said an \"abortion procedure is actually safer than a vasectomy.\"", "Both procedures rarely have complications, a clarification missing from this declaration. That said, abortion procedures appear to have lower complication rates.", "We rate the claim Mostly True.", "MOSTLY TRUE – The statement is accurate but needs clarification or additional information. Click here for more on the six PolitiFact ratings and how we select facts to check.", "Email, Andrea Chevalier, M.Ed., education policy analyst, Office of State Rep. Mary E. González, May 11, 2017", "Article, \"Vasectomy: An Update,\" American Family Physician, Dec. 15, 2016 (accessed May 15, 2017)", "Chart on web page, \"Selected Characteristics of Induced Terminations of Pregnancy, Texas Residence, 2015,\" Texas Department of State Health Services, last updated March 22, 2017 (accessed May 15, 2017)", "Emails, Rebecca Wind, associate director of communications, Guttmacher Institute, May 11 and 16, 2017", "Web page, \"Fact Sheet, Induced Abortion in the United States,\" the Guttmacher Institute, January 2017 (accessed May 15, 2017)", "Study, \"Safety of Aspiration Abortion Performed by Nurse Practitioners, Certified Nurse Midwives, and Physician Assistants Under a California Legal Waiver,\" American Journal of Pulic Health, March 2013 (cited in the 2017 Guttmacher Institute \"fact sheet\")", "Study, \"Complications from first-trimester aspiration abortion: a systematic review of the literature,\" Contraception, November 2015", "Article, \"Complications of vasectomy,\" Annals of the Royal College of Surgeons of England, November 2005 (accessed May 17, 2017)", "Article, \"CUA guideline: Vasectomy,\" Canadian Urological Association, July 2016 (accessed May 15, 2017)", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]