["About this rating", "In early December 2020, after months of litigation brought by news organizations, the Trump administration finally made public data about recipients of the Paycheck Protection Program (PPP), a bailout program rolled out in the spring that was meant to help small businesses survive economic fallout from the coronavirus pandemic.", "In all, 5.2 million businesses, including Snopes, were able to access forgivable PPP loans. But the release of the data showing what businesses received a portion of the more than $500 billion in taxpayer relief money was accompanied by scrutiny and controversy.", "In one controversy, the data released by the Small Business Administration showed sports performance and nutrition company TB12, which is owned by former New England Patriots quarterback Tom Brady, received nearly $1 million.", "According to the data released by the Small Business Association, TB12, a sports health company, received $960,855 in PPP loans in April 2020. The company did not state whether any jobs were saved on account of receiving the loan. On its LinkedIn Page, TB12 stated it has between 11 and 50 employees.", "Some on social media criticized the loan, citing Brady's own personal wealth. In March 2020, Brady signed a $50 million, two-year contract to play for the Tampa Bay Buccaneers.", "The data release also revealed that more than half the money went to larger businesses, including national chains. Another analysis found that more than $3.65 million went to businesses that were tenants in properties owned by U.S. President Donald Trump and his adviser and son-in-law, Jared Kushner.", "These discoveries were made even after news outlets reported that a vast proportion of small businesses owned by minorities and women were shut out of the PPP program because they didn't qualify, or because funds were exhausted at the time their applications were processed, per an analysis by CBS News. Thousands of small businesses have closed as a result of the pandemic.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]