["Workers prepare boxes of the Pfizer-BioNTech COVID-19 vaccine for shipment at a Michigan factory, Dec. 13, 2020. (AP)", "In a YouTube video posted Jan. 16, and shared on Facebook, Dr. Lee Merritt, who owns a Nebraska clinic that offers tattoo removal and other services, casts doubt on the safety of the COVID-19 vaccines.", "Merritt claims in an interview segment that the vaccine was sent to states before it was approved by the U.S. Food and Drug Administration.", "\"This vaccine was rolled out to distribution centers before they even made a show of caring about the FDA approving it,\" she tells interviewer Alex Newman. \"It went out for distribution, I know in Nebraska, it was in the distribution center days before the FDA even said they were going to approve it.\"", "The article was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "We looked into the timeline of the FDA’s approval of vaccines for emergency use, and when vaccine distribution began, and found no evidence for Merritt’s claim.", "We reached out to Merritt twice for any evidence of her claim, but did not hear back.", "Merritt, an orthopaedic surgeon, has spoken out against mask mandates, and has supported the use of hydroxychloroquine to treat COVID-19. Hydroxychloroquine, which was touted by President Donald Trump as a possible COVID-19 treatment, has been the subject of several fact-checks by PolitiFact, and researchers have concluded that it’s not an effective treatment for COVID-19.", "The FDA announced on Dec. 11 that it had approved the first vaccine, manufactured by Pfizer-BioNTech.", "In Nebraska, the Department of Health and Human Services announced on Dec. 14 that the first doses of the Pfizer vaccine \"arrived in Nebraska today.\"", "In the same announcement, the state said that it expected to receive 4,875 doses of the Pfizer vaccine by the end of the day and 15,600 by week's end.", "On Dec. 21, Nebraska announced that it expected to receive the Moderna vaccine in the next week. The Moderna vaccine was approved by the FDA on Dec. 18.", "The communications director for the Nebraska Department of Health and Human Services, Khalilah LeGrand, confirmed to PolitiFact that no shipments of vaccine were received before approval, nor could officials order vaccine prior to approval.", "The U.S. Department of Health and Human Services website outlines how the vaccine approval and distribution process works. \"Distribution of FDA-authorized vaccines begin 24 hours after the Emergency Use Authorization,\" the site states. \"The first deliveries of COVID-19 vaccines began December 14, 2020.\"", "HHS spokesman Bill Hall confirmed that no vaccines were distributed prior to FDA approval.", "We could find no news coverage of any vaccines arriving in Nebraska before they were approved by the FDA.", "Speaking at a news briefing on Dec. 12, the day after the FDA authorized the Pfizer-BioNTech vaccine, one of the federal government’s top vaccine distribution planners said that vaccines were being prepared for shipment. Gen. Gustave Perna, chief operating officer of Operation Warp Speed, said: \"As I speak today, right now, vaccines are being packaged with a lot of emphasis on quality assurance. To that end, tomorrow morning, vaccines will start rolling from manufacturing to distribution hubs.\"", "CNBC reported on how some of the vaccine distribution planning included sending protective gear for health care workers and inoculation supplies — but not the vaccine — to states ahead of FDA approval. These early shipments included needles, syringes and mixing vials. The advance planning also included building \"freezer farms\" to hold the vaccine, which requires cold storage.", "Pfizer shipped vaccines from its Kalamazoo, Mich., factory after FDA approval and from a distribution facility in Pleasant Prairie, Wis., to states.", "McKesson, which is distributing the Moderna vaccine, said that its shipping partners would deliver initial vaccine doses on Dec. 21, days after approval.", "Merritt claimed that doses of COVID-19 vaccine arrived in distribution centers in Nebraska before it was approved by the FDA.", "The Nebraska Department of Health and Human Services announced that it received both the Pfizer-BioNTech and Moderna vaccines after the dates of FDA approval.", "The U.S. Department of Health and Human Services said that it releases vaccines for distribution 24 hours after they are approved. A top planner of the federal government’s vaccine development efforts said that the vaccine began shipping after it was approved.", "We rate Merritt’s claim False.", "YouTube, Dr. Lee Merritt interview with The New American, Jan. 16, 2021. Accessed Feb. 6, 2021.", "U.S. Food and Drug Administration, news release, \"FDA Takes Key Action in Fight Against COVID-19 By Issuing Emergency Use Authorization for First COVID-19 Vaccine,\" Dec. 11, 2020. Accessed Feb. 6, 2021.", "Nebraska Department of Health and Human Services, news release, \"Nebraska Receives First Shipment Of COVID-19 Vaccine,\" Dec. 14, 2020. Accessed Feb. 6, 2021.", "Nebraska Department of Health and Human Services, news release, \"Nebraska COVID-19 Vaccine Update,\" Dec. 21, 2020. Accessed Feb. 6, 2021.", "U.S. Food and Drug Administration, news release, \"FDA Takes Additional Action in Fight Against COVID-19 By Issuing Emergency Use Authorization for Second COVID-19 Vaccine,\" Dec. 18, 2020. Accessed Feb. 6, 2021.", "U.S. Department of Health and Human Services website, \"COVID-19 Vaccine Distribution: The Process,\" Updated Jan. 29, 2021. Accessed Feb. 7, 2021.", "CNBC, \"Pfizer’s Covid vaccine is now shipping. Here’s how the U.S. plans to deliver it,\" Dec. 12, 2020. Accessed Feb. 7, 2021.", "C-SPAN, video, \"News Conference on COVID-19 Vaccine Distribution,\" Dec. 12, 2020. Accessed Feb. 7, 2021.", "Emailed statement, Khalilah A. LeGrand, communications director, Nebraska Department of Health and Human Services, Feb. 8, 2021.", "Emailed statement, Bill Hall, spokesperson, U.S. Department of Health and Human Services, Feb. 8, 2021.", "U.S. Department of Health and Human Services report, \"From the Factory to the Front Lines.\" Accessed Feb. 8, 2021.", "McKesson, news release, \"McKesson Fills Initial Government Orders for Moderna’s COVID-19 Vaccine,\" Dec. 20, 2020. Accessed Feb. 8, 2021.", "Pfizer, release, \"Covid-19 Vaccine U.S. Distribution Fact Sheet,\" Nov. 20, 2020. Accessed Feb. 8, 2021.", "Politico, article, \"U.S. begins shipping Pfizer's coronavirus vaccine,\" Dec. 13, 2020. Accessed Feb. 8, 2021.", "KHOU11, \"Why some Iowans won’t get the Pfizer coronavirus vaccine,\" Dec. 16, 2020. Accessed Feb. 9, 2021.", "KETV, \"Omaha City Council votes to extend mask mandate,\" Accessed Feb. 9, 2020.", "PolitiFact, \"Don’t fall for this video: Hydroxychloroquine is not a COVID-19 cure,\" July 28, 2020. Accessed Feb. 9, 2020.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]