["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "GOP presidential candidate Jeb Bush speaks at the National Urban League Conference in Fort Lauderdale on July 31, 2015. (New York Times photo)", "The Florida Legislature’s Democratic minority leader challenged former Gov. Jeb Bush’s commitment to voting outreach, accusing him of limiting access to polling places for black voters.", "Sen. Arthenia Joyner of Tampa sent out a letter addressed to Bush, who is running for the GOP presidential nomination, ahead of his speech to the National Urban League in Fort Lauderdale on July 31, 2015, excoriating him for shortening early voting hours as governor. She also said he purged voter rolls and refused to restore voting rights to convicted felons.", "\"Also troubling was your decision to significantly cut early voting prior to the 2008 presidential election,\" Joyner wrote on July 30. She said legislation he signed was designed \"to diminish turnout in minority communities that were increasingly relying on early voting.\"", "PolitiFact Florida has addressed the Bush-era voting purges in 2000 and 2004 before, as well as the recent history of restoring felon voting rights. But did Bush cut early voting hours?", "It turns out that while he signed a 2004 bill that allowed early voting, he also signed a bill the following year that set new limits on the practice.", "Voting changes", "After the 2000 presidential election’s numerous problems, Florida overhauled its system and began allowing early voting for the first time with a law Bush signed in 2004. That law provided for a statewide maximum of 14 early voting days and at least eight hours of voting per day.", "Early voting days could be any length counties chose; Pinellas allowed 10 hours per day in 2004, while Miami-Dade kept early voting polling places open for 12 hours per day.", "Many Floridians welcomed the changes, with some counties reporting more than 50 percent of voters cast ballots before Election Day. But there also were some reports of harassment at poorly monitored early voting sites, issues with poorly tested voting methods and a general lack of oversight for some locations, according to a 2005 Early Voting Information Center study.", "Still, some election supervisors asked lawmakers to expand early voting hours and add more locations. Bush and the GOP-led Legislature decided to do the opposite the following year.", "Joyner did not return our email or phone calls, but the 2005 law she mentioned, HB 1567, cut voting hours to a maximum of eight hours per day and limited polling places to election offices, city halls and libraries. Polling places could only be open between 7 a.m. and 7 p.m. Early voting also couldn’t be held more than eight hours total on any weekend, and it had to end the Sunday before the election.", "It did not change the 14-day maximum, but it did cut hours for counties that kept polls open longer than eight hours. In Miami-Dade, for example, early voting hours were cut by a third from prior 12-hour days, speaking to Joyner’s characterization that Bush \"significantly cut\" early voting.", "The changes took effect for the 2006 election cycle, the last before Bush left office in January 2007. Democrats accused Republicans of trying to limit access for minorities and workers who couldn’t leave their jobs to vote. GOP legislators said the changes were to bring some uniformity to polling options.", "Two years later, Illinois Sen. Barack Obama won Florida en route to a victory in the 2008 presidential election. There were reports of very long lines and finicky voting machines that year, but there also was an increase in registered voters.", "Between December 2007 and October 2008, more than 233,000 black Floridians registered to vote. About 54 percent of black voters cast early ballots in the 2008 election.", "Early voting continues to be popular statewide, especially with Democratic voters. About 53 percent of the 6 million people who participated in the 2014 election voted early in person or by absentee ballot.", "But debate over early voting remained after Bush left office. Gov. Rick Scott and the Legislature in 2011 further reduced the maximum early voting days to eight days. Long lines subsequently plagued the 2012 presidential election. An Ohio State study estimated 201,000 Floridians didn’t vote because of the wait on Election Day.", "In 2013, Scott signed a bill restoring early voting to up to 12 hours a day for 14 days.", "Our ruling", "Joyner said Bush \"significantly cut early voting prior to the 2008 presidential election.\"", "Bush signed a 2005 bill limiting early voting to a maximum of eight hours per day, specifying the changes would take effect in 2006. That did scale back early voting hours in some counties quite a bit.", "But there’s no mention that Bush also signed the 2004 bill that established early voting in Florida in the first place, part of a post-2000 election overhaul. We also have to add that the GOP-led Legislature drafted both bills.", "Joyner’s statement is accurate but could use additional information, so we rate it Mostly True.", "Miami Herald Naked Politics blog, \"Florida Senate minority leader to Jeb Bush: Apologize to black community,\" July 30, 2015", "New York Times, \"In Florida, Early Voting Means an Early Return to Problems,\" Oct. 19, 2004", "Tampa Bay Times, \"Bush signs bill limiting early voting,\" June 1, 2005", "CNN, \"Long lines, glitches reported during early voting,\" Oct. 28, 2008", "Reed College Early Voting Information Center, \"Early Voting in Florida, 2004,\" Sept. 1, 2005", "Rolling Stone, \"Florida GOP Takes Voter Suppression to a Brazen New Extreme,\" May 30, 2012", "PolitiFact Florida, \"Charlie Crist says Jeb Bush extended early voting,\" Nov. 8, 2012", "Bradenton Herald, \"Obama, others push for an overhaul of Florida's elections system after long waits,\" Nov. 8, 2012", "Orlando Sentinel, \"Analysis: 201,000 in Florida didn't vote because of long lines,\" Jan. 29, 2013", "Tampa Bay Times, \"How Florida kept blacks from voting,\" Oct. 17, 2013", "PolitiFact Florida, \"Eric Holder signed off on Florida's 2011 early voting law, Rick Scott says,\" Aug. 4, 2014", "PolitiFact Florida, \"Fact-checks about Florida voting and elections,\" Nov. 4, 2014", "Miami Herald Naked Politics blog, \"The 2014 governor's race votes and ad spending by Florida media market,\" Nov. 25, 2014", "PolitiFact Florida, \"Hillary Clinton revisits Florida's 2000 and 2004 voter purge when Jeb Bush was governor,\" June 9, 2015", "Florida Senate, \"CS for SB's 2346 & 516, 1st Engrossed,\" accessed July 31, 2015", "Florida Senate, \"HB 1567,\" accessed July 31, 2015", "Florida Senate, \"HB 7013,\" accessed Aug. 5, 2015", "Toronto Star, \"Florida voters fearing dejà vu,\" Sept. 29, 2004 (accessed via Nexis)", "Tampa Bay Times, \"Law limits early voting,\" June 21, 2005 (accessed via Nexis)", "Associated Press, \"Governor to take pen to bills altering state's elections laws,\" June 19, 2005 (accessed via Nexis)", "U.S. Senate, \"Senate Judiciary Subcommittee on Constitution, Civil Rights and Human Rights Hearing; ‘New State Voting Laws II: Protecting the Right to Vote in the Sunshine State,’ Jan. 27, 2012 (accessed via Nexis)", "Interview with Allie Brandenburger, Jeb Bush spokesman, Aug. 3, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]