["The photo was uploaded in this Facebook post on June 30, 2019, where it has been shared more than 81,000 times.", "The post contains two photos –- one of a dead man in a body bag and another showing Pakistani cricket fans letting off flares in stands.", "The Urdu caption translates to English as: “Extreme of enmity. Because of beating by ungrateful Afghans, a Pakistani lost his life –- may Allah grant him a high place in paradise. Amen.”", "Below is a screenshot of the misleading Facebook post:", "GRAPHIC IMAGES", "Show", "Hide", "The same photos and claim have circulated widely on Facebook, for example here, and have also been shared in WhatsApp groups:", "GRAPHIC IMAGES", "Show", "Hide", "The image of cricket fans in the misleading posts is actually an Associated Press (AP) photo of spectators at the June 29, 2019 cricket match between Pakistan and Afghanistan at Headingley.", "Here is the same published by the UK’s Daily Telegraph newspaper. The report does not mention any fatalities in post-match clashes.", "The image of a dead man in a body bag was posted alongside eight other similar images in this Facebook post on June 29, 2019.", "The Facebook post’s romanised Urdu language caption translates to English as: “May peace be upon you. My request is to all my friends that pray for my these friends that may Allah place them high in paradise and give forbearance to all their families. One week ago all these brothers of mine died in a car accident while going from Turkey to Greece. Miss you friend(s), Amen.”", "GRAPHIC IMAGES", "Show", "Hide", "AFP analysed the photo of the dead man in the misleading posts. It includes a number tag with Turkish text which translates to English as “autopsy branch”.", "Below is a close-up screenshot of the tag:", "The same Facebook post included this photo of multiple bodies lying next to a crashed van.", "The photo corresponded with a photo published in this report by the Daily Sabah, an English language newspaper based in Turkey, about a van accident in Turkey on June 26, 2019.", "Below is a screenshot comparison of the van photo in the Facebook post (L) and the photo of the crashed van on the Daily Sabah (r) with the corresponding features circled in red:", "GRAPHIC IMAGES", "Show", "Hide", "The Daily Sabah report states a van crashed in Meriç, a district in the Turkish province of Edirne near the border with Greece, leaving ten migrants dead.", "The Daily Sabah report states in part: “Ten illegal migrants were killed and 30 others were injured when a van carrying them crashed into the wall of a store Wednesday in Edirne.", "“The migrants were traveling in Meriç, a district of the northwestern province near the border with Greece, when gendarmerie troops tried to stop the van. The driver sped away before crashing into a store at an intersection in the early hours of yesterday. The victims were identified as Pakistani and Indian migrants while the driver was a Turkish man. The injured were taken to hospitals in Edirne and the driver, who was also injured, was detained after his treatment.”", "Police said they had not had any reports of fatalities after the World Cup match between Pakistan and Afghanistan on June 30, 2019.", "This is a West Yorkshire Police department statement published on July 3, 2019 about the match. It does not mention anyone being killed in the violent clashes between fans.", "The statement's first line says: \"West Yorkshire Police has launched an investigation into incidents of disorder inside and outside Headingley cricket ground during the match between Pakistan and Afghanistan at the weekend.\"", "In the press statement, Superintendent Chris Bowen, who heads operational policing for Leeds District, is quoted as saying: “While we did not receive any direct reports of people being injured, the footage that is out there clearly shows people being assaulted during these incidents. We would like to hear from anyone who was a victim.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]