["One misleading post was published here on Facebook on December 11, where it has been shared 50 times.", "Along with purported images of childbirth, the graphic includes text that reads: “A human body can bear only up to 45 del (unit) of pain. Yet at time of giving birth, a mother feels up to 57 del (unit) of pain. This is similar to 20 bones simultaneously getting fractured at a time.”", "“Can you imagine it now, the mother’s pain and love?” the text adds.", "Below is a screenshot of the misleading post:", "The same graphic was shared with an identical claim here on Facebook and here on Twitter.", "Multiple similar posts have also been published on meme sharing websites, for example here, here, here, here, here and here.", "The claim is false; there is no unit called a “del” used to measure pain.", "In the 1940s, a system known as the “dol scale” was developed that quantified pain levels using a dolorimeter, an instrument used to measure pain intensity. But unlike the scale of 0 to 45 referenced in the misleading posts, the dol scale assessed pain from 1 to 10. The scale was outlined in this 1947 report by the dolorimeter’s creators, published by The American Society for Clinical Investigation.", "A report published here in Oxford University's Journal of the History of Medicine and Allied Sciences in 2011 detailed how by the early 1950s, experts began assessing pain individually through clinical trials instead of the dolorimeter.", "Health professionals then began using a 10-point scale that incorporated descriptions and pictures of facial expressions to help assess pain, according to a report published here in December 2018 by Harvard Health Publishing, the consumer health division of the Harvard Medical School.", "But even that system has since been questioned.", "“We now realize the scale is too simple to measure something so complex,\" Dr. Jianren Mao, the chief of the Division of Pain Medicine at Massachusetts General Hospital was quoted as saying in the same report.", "\"What one person rates as an 8 or 4 may be quite different for someone else, so it is not always an accurate assessment,” he added.", "Below is a screenshot of the first part of the Harvard Medical School’s report:", "The same misleading claim about the pain of childbirth was also debunked here by Africa Check, a Johannesburg-based fact-check site, and here by Snopes, a US-based fact check organisation.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]