["An Oct. 29 article shared across Facebook claims the CDC has presented evidence that rejects the efficacy of masks.", "\"In a recent report in Emerging Infectious Diseases, the U.S. Centers for Disease Control and Prevention (CDC) suggests what experts have stated all along: There is no conclusive evidence that cloth masks protects (sic) users from coronavirus, especially since most people do not use them correctly and do not keep them clean,\" writes Raven Clabough in The New American, a print and digital magazine owned by right-leaning advocacy group the John Birch Society.", "She goes on to detail a 2015 study that allegedly found cloth masks lead to a higher rate of infection likely due to \"retained moisture\" and \"poor filtration.\"", "Two additional reports are framed as evidence against masks: one demonstrating \"70 percent of COVID-positive patients contracted the virus in spite of faithful mask wearing while in public\" and the other concluding masks and respirators were \"ineffective against the spread of influenza-like illnesses and respiratory illnesses believed to be spread by droplet and aerosol particles.\"", "USA TODAY has reached out to The New American for further comment.", "Citing scientific reports is well and good, but in this case, they do not prove the point the article is trying to make. The CDC endorses face masks as protection against COVID-19, and recently updated its guidance.", "More:Fact check: What's true and what's false about coronavirus?", "The 2015 randomized controlled trial mentioned by Clabough tested the efficacy of a \"locally manufactured, double-layered cotton mask\" against medical masks among health care workers in Vietnam.", "Participants were given five masks for a four-week period and asked to wash their masks daily with soap and water. Findings returned a \"consistently higher\" rate of infection among those in the cloth mask group than in the medical mask and control groups.", "However, because mask washing was not frequent enough or \"because they became moist and contaminated,\" the researchers — unaffiliated with the CDC and led by epidemiologist Dr. Abrar Chughtai of the University of New South Wales in Sydney, Australia — believed this was underlying poor performance, not the masks themselves.", "In an email to USA TODAY, Chughtai explained his team pursued the question further in a study published in September, this time using a two-layer cloth mask and comparing self-washing to hospital laundry.", "\"This new study showed that 'The risk of infection was more than double among (health care workers) self-washing their masks compared with the hospital laundry',\" he wrote.", "\"The majority of (health care workers) in the study reported hand-washing their mask themselves. This could explain the poor performance of two layered cloth masks, if the self-washing was inadequate. Cloth masks washed in the hospital laundry were as protective as medical masks.\"", "Chughtai stated that while in the first report, his group proposed improving cloth masks by \"selecting appropriate fabric\" or using \"a design that provides filtration and fit,\" in no way did it advocate against mask wearing.", "\"We are strong supporters of mask use,\" he wrote. \"Our (study) was in a hospital setting and we proposed that health care workers should not use cloth masks. Cloth masks are a more suitable option for community use when medical masks are unavailable.\"", "The second report cited by Clabough found that visiting locations offering \"on-site eating and drinking\" also likely led to COVID-19 infection.", "The report, published in the CDC's Morbidity and Mortality Weekly Report in September, interviewed over 300 adults age 18 and older who tested for COVID-19 in any of the diagnostic testing or health care centers associated with the CDC's Influenza Vaccine Effectiveness in the Critically Ill Network.", "Patients were asked many questions regarding their activities, whom they had come in contact with and mask wearing habits two weeks prior to testing. While it is true 71% of COVID-19 positive patients did wear masks out in public, they were also more likely to have come in contact with a known COVID-19 positive individual, dined at a restaurant or frequented a bar/coffee shop compared to mask wearers who tested negative for COVID-19.", "More:Fact check: CDC report doesn't show mask-wearers are more likely to contract COVID-19", "Given a report of COVID-19 infection linked to air conditioning in a restaurant in Guangzhou, China, the report speculates about a similar mechanism.", "\"Direction, ventilation, and intensity of airflow might affect virus transmission, even if social distancing measures and mask use are implemented according to current guidance,\" the report's authors write.", "They also ultimately conclude \"exposures and activities where mask use and social distancing are difficult to maintain, including going to locations that offer on-site eating and drinking\" — not masks alone — are important risk factors for COVID-19 infection.", "A third report brought up by Clabough, published in Emerging Infectious Diseases in February, evaluated the effectiveness of personal protective measures on influenza virus transmission. Protective measures included face masks, hand hygiene, and covering or diverting one's cough or sneeze in addition to environmental measures such as disinfecting objects and surfaces.", "In their assessment based on 10 different randomized controlled trials, the University of Hong Kong research group — unaffiliated with the CDC — conclude there was no evidence for surgical-type mask wearing \"in reducing laboratory-confirmed influenza transmission, either when worn by infected persons (source control) or by persons in the general community to reduce their susceptibility.\" They did note, however, the potential usefulness of face masks in reducing transmission of other infections and \"therefore have value in an influenza pandemic when health care resources are stretched.\"", "More:Fact check: A cold, the flu or a flu shot won't cause positive tests for novel coronavirus", "There are a few problems in extrapolating this to COVID-19. First, while influenza and the novel coronavirus are similar in being contagious respiratory illnesses and in symptom presentation, the two are not the same. Both are caused by completely separate viruses that use different proteins to enter their host cells. The viral transmission is much quicker with influenza than with coronavirus, and the incubation is typically one to four days after infection; coronavirus incubation period ranges from two days to as long as 14 days, according to some reports.", "In a July interview with PolitiFact, University of San Francisco research scientist Jeremy Howard stated that because how different influenza and COVID-19 are, \"we do not know whether evidence from influenza trials are relevant to COVID-19.\" He also emphasized none of the 10 trials reviewed were conducted during a pandemic.", "A second issue relates to statistics.", "According to the University of Hong Kong research group, a drawback to its review was that most studies analyzed \"were underpowered because of limited sample size, and some studies also reported suboptimal adherence in the face mask group.\" Underpowered refers to statistical power, or the power of a study to detect an effect when there is one. The magnitude of an effect as it occurs in nature or is found in a population is called the effect size. The larger it is, the stronger the relationship between two variables.", "\"It is wrong to say that our review said there was no effectiveness of face masks. We could only rule out very large effects,\" wrote Dr. Ben Cowling, PhD, one of the researchers involved, in a July email to FactCheck.org.", "He further added, \"while we said there was not a significant effect, we could not exclude the possibility that masks reduce transmission by 10% or 20%. Those would be useful effect sizes.\"", "We rate the claim that the CDC \"admits\" there is no evidence that cloth masks work against COVID-19 as FALSE because it is not supported by our research. Two of the three scientific reports mentioned in The New American article are unaffiliated with the CDC. One, out of the University of New South Wales in Australia, concluded cloth masks should not be used by health care workers except if they lack more rigorous protection but determined they were efficacious for community use. Another report released in a CDC publication found masks wearing was protective when individuals avoided high-risk exposures and activities. The third report from the University of Hong Kong determined face masks did not exhibit a large protective effect against influenza — not coronavirus — transmission, not that masks provided no protection at all.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]