["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Democratic presidential candidate Hillary Clinton claimed that her opposition to the 2008 Supreme Court case of District of Columbia vs. Heller was due to a desire to protect toddlers from firearms.", "Clinton said in the third presidential debate that she supported an individual’s right to bear arms but disagreed with how the court interpreted the Second Amendment because it didn’t accept \"reasonable regulations\" on gun ownership.", "\"What the District of Columbia was trying to do was to protect toddlers from guns,\" Clinton said.", "There’s been a lot of discussion over how Clinton views the Second Amendment, but we were curious if she was accurately describing the rationale behind the case.", "The Heller case itself was a challenge to the Firearms Control Regulations Act of 1975, a broad ordinance passed by the Washington, D.C., city council that largely banned residents from owning handguns, automatic weapons and the possession of unregistered firearms, as well as requiring firearms kept in a home to be \"unloaded, disassembled, or bound by a trigger lock or similar device.\"", "The handgun ban and subsequent gun control measures were widely considered to be one of the stricter rules on firearm ownership throughout the United States, though members of the D.C. council at the time said it seemed like the right thing to do.", "\"Handgun crimes were just getting out of sight,\" said Sterling Tucker, a D.C. Council chairman when the ban was enacted. \"We had to isolate and contain the problem. We thought a handgun law would do that.\"", "Passed in the mid 1970s, the ordinance continued with several legal challenges until 2007, when a federal court invalidated the law. That decision was upheld in a 5-4 Supreme Court ruling that the handgun ban and \"trigger lock\" provisions of the ordinance violated the Second Amendment.", "Before the Supreme Court ruling, city leaders fought hard to keep the ban, saying that its continued implementation reduced the number of stolen firearms and guns used in other crimes.", "In their appeal to the Supreme Court, the city government filed a petition with the court specifically citing the dangers posed to children if the gun ban was lifted.", "\"The smaller the weapon, the more likely a child can use it, and children as young as three years old are strong enough to fire today’s handguns,\" the petition stated (page 25).", "The same petition also addressed the history of the ban, saying that in 1976 that the Council determined existing law didn’t sufficiently address gun violence and specifically cited the \"chilling regularity with which handguns were taking the lives of children.\"", "But protecting children isn’t the only reason cited by the 30-page petition filed by the city’s government — the city also addressed general violent crime trends and other legal arguments in asking the Supreme Court to hear the case.", "And the court’s decision in Heller went far beyond just overturning the city’s gun ban, as it broadly affirmed for the first time an individual right to private gun ownership.", "Clinton’s campaign referred us to a gun control group claiming that gun locks and child access prevention laws help prevent unintentional firearm deaths for young children.", "PolitiFact has previously looked into whether the city’s gun ban had any effect on violent crime, finding that violent crime levels varied year-to-year and that other social and demographic factors played a larger role than gun laws.", "Our ruling", "Clinton said her opposition to the 2008 Heller case was because \"what the District of Columbia was trying to do was to protect toddlers from guns.\"", "City leaders did specifically cite the danger posed to children in trying to keep in place gun regulations, but the regulations were also a widespread ban on unregistered weapons, not just gun safety measures. Child safety wasn’t the sole topic cited by defenders of the city’s gun control ordinance, and the Heller decision dealt with a much broader issue than protecting toddlers from firearm deaths or injuries.", "We rate the statement Half True.", "https://www.sharethefacts.co/share/a1279632-b0c9-4856-8bc2-c64555f9f78f", "Email interview with Hillary Clinton campaign spokesman Josh Schwerin, Oct. 19, 2016", "Oyez, \"District of Columbia v. Heller,\" accessed Oct. 19, 2016", "Smartgunlaws.org, \"Protecting Strong Gun Laws: The Supreme Court Leaves Lower Court Victories Untouched,\" Aug. 2, 2016", "FactCheck.org, \"Trump Distorts Clinton’s Gun Stance,\" May 10, 2016", "PolitiFact, \"Marco Rubio says after D.C. passed gun laws, 'violence skyrocketed’,\" Jan. 28, 2013", "Washington Post, \"A History of D.C. Gun Ban,\" June 26, 2008", "Washington Post, \"D.C. Asks Supreme Court to Back Gun Ban,\" Sept. 4, 2007", "SCOTUSblog, \"Second Amendment case reaches Court; cross-appeal coming,\" Sept. 4, 2007", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]