["About this rating", "Photographs showing a large number of pigs on a flooded farm were circulated in the wake of Hurricane Florence in September 2018, along with a caption asserting that the pictures showed \"The victims nobody talks about\":", "These images are real, but they do not depict the aftermath of that September 2018 storm. The two aerial photographs were actually taken in September 1999 near a farm in North Carolina after Hurricane Floyd, with the largest image in this collage captured by Rick Dove of the Waterkeepers Alliance:", "In September 1999, almost immediately after receiving two strikes from Hurricane Dennis, Hurricane Floyd came roaring through Eastern North Carolina. In his path lay nearly 2,000 factory farm cesspools loaded with hundreds of millions of gallons of toxic fecal waste, wastewater treatment plants, factories and communities, many of which were in the flood plain.", "Hurricane Floyd produced some heavy rains. Unsustainable development greatly aggravated the storm's impacts. Most areas received around 10 inches of rain. A few received 20 inches.", "The other aerial photograph showing a group of pigs on the roof of a farm structure was taken by photographer Mel Nathason. In addition to creating an \"agricultural nightmare\" that left millions of animals (including an estimated 30,000 hogs) dead, Hurricane Floyd also flooded \"manure lagoons\" causing fecal contamination of North Carolina's drinking water:", "What happens when storm floods meet vast confined hog-rearing facilities and their lagoons? The Waterkeeper Alliance’s Rick Dove has been taking extraordinary aerial photos like the one above. Typical hog confinements, like the white buildings on the right in that photo, hold about 2,000 hogs each. According to the Environmental Working Group, there are 586,092 hogs in Wayne County and 229 manure lagoons.", "Waterkeeper Alliance’s Dove told me that in his recent airplane forays over eastern North Carolina, “Some of those lagoons were so submerged that we didn’t even know they were there when we photographed them.”", "[Robert B. Jackson, an environmental scientist at Duke University in Durham, North Carolina] pointed to a 1999 hurricane that flooded hog farms in North Carolina. \"Hurricane Floyd came through and flushed the contents of the hog waste lagoons out into the streams and rivers,\" he said. The result was widespread fecal contamination of drinking water. More than decade after Floyd, North Carolina still has more than 4,000 hog waste lagoons.", "We have not been able to pinpoint the exact origins of the two close-up photographs showing a hog in flooded waters but these images were both likely taken in 2008 during a flood in Iowa. Both images are included on the web site of the Kinship Circle, an Animal Advocacy, Education and Disaster Rescue organization that saved hundreds of hogs after a massive flood left some parts of Iowa under 12 feet of water.", "Although these pictures didn't originate with Hurricane Florence, North Carolina may be facing similar problems to encountered after Hurricane Floyd. The state has changed some of their farming policies since 1999 to prevent similar agriculture disasters, but manure pits at some hog farms have reportedly failed in the wake of Hurricane Florence:", "Flooded rivers from Florence’s drenching rains have swamped coal ash dumps and low-lying hog farms, raising pollution concerns as the swollen waterways approach their crests.", "North Carolina environmental regulators say several open-air manure pits at hog farms have failed, spilling pollution. State officials also were monitoring the ongoing threat from the breach of a Duke Energy coal ash landfill near Wilmington.", "A similar photograph of drowned pigs was circulated in conjunction with Florence, but this one stemmed from a flood in Vietnam the previous year and had nothing to do with the September 2018 hurricane:", "Philpott, Tom.   \"Hurricane Matthew Killed Millions of Farm Animals in North Carolina.\"\r\n    National Geographic   14 October 2016.", "Barton, Tom.   \"River Engulfs Parts of Cedar Rapids; Leak Threatens Des Moines Levee.\"\r\n    Des Moines Register   13 June 2008.", "Friend, Tim.   \"Water in America: Is It Safe to Drink?\"\r\n    National Geographic   17 February 2014.", "Ebbs, Stephanie.   \"Farmers Furiously Prep to Keep Pig, Chicken Waste Out of Floodwaters.\"\r\n    ABC News   13 September 2018.", "Biesecker, Michael.   \"Flooding from Hurricane Florence Is Overtaking Hog Farms and Coal Ash Dumps.\"\r\n    TIME   17 September 2018.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]