["About this rating", "On 24 November 2016, reporter Sarah Kendzior posted a message on Twitter that said that Ivanka Trump had once said that if Donald Trump wasn't her father, she would want to spray him with Mace:", "This video is real: President-elect Donald Trump really did joke about dating his own daughter during an appearance on The View. However, the clip does not feature his daughter's purported response.", "Kendizor evidently found Ivanka's alleged \"mace\" quote in the \"Quotables\" section of the Chicago Tribune. The screen shot she shared was real, and was published by the newspaper in August 2006:", "\"If he wasn't my father, I would spray him with Mace.\"", "Ivanka Trump, 24, the daughter of Donald Trump, on her father complimenting her figure on a talk show and then joking that he would date her if he weren't her father.", "The same quote, along with the same attribution, also appeared in an end-of-the-year quiz by the Telegraph. However, other reports about the Trumps' appearance on The View (including one published by the Chicago Tribune) never mentioned this particular quote.", "So where did it come from?", "The earliest version of this quote we could uncover was published on 17 March 2006, in the \"News For Dumb Guys\" section — a weekly feature in Louisiana's Shreveport Times — where it was attributed to comedian Conan O'Brien:", "\"While appearing on The View, Donald Trump said if his 25-year-old daughter Ivanka wasn’t his child, he would date her. Meanwhile, Ivanka said if Donald Trump wasn’t her father, she would mace him.\"", "CONAN O’BRIEN, ON LATE NIGHT", "Jordan Schlansky, a former producer for Late Night With Conan O'Brien and current producer of Conan, confirmed in an email that the above-displayed quote originated with Conan O'Brien:", "I can confirm your quote below was a monologue joke from the “Late Night with Conan O’Brien” episode originally broadcast on March 7, 2006. Unfortunately, we can’t provide footage as that program is controlled by NBC Universal.", "Lauri Hogan, Publicity Director at ABC Entertainment Group, provided a view-only copy of The View interview to Snopes.com and we can confirm that Ivanka Trump did not use this joke during the segment.", "Chicago Tribune.   \"Quotables\"\r\n    24 August 2006.", "Starr, Michael.   \"I'd Dave Ivanka: Trump - 'View' Remark 'Just a Joke.'\"\r\nNY Post.   7 March 2006.", "Chicago Tribune.   \"Trump: I'd date my daughter.\"\r\n    8 March 2006.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]