["About this rating", "On 24 June 2016, a shocking story suddenly appeared out of nowhere: Queen Rania, Jordan's beautiful consort to King Abdullah II bin al-Hussein, famous for her humanitarian work, was murdered by her husband in Rome. Why? Because of an affair she had, claimed the indifferently-punctuated article, with none other than the frontman to the band U2:", "According to many local observers the ominous news is considered widely as a harbinger of widening rifts within Jordan's tormented social fabrics as the Arab nation of seven million is equally divided into native Jordanians and descendents of Palestinian refugees whom Queen Rania belonged.Unbeknownst to many Westerners, the King Abdullah of Jordan, a close ally of Obama administration, supports and harbors fanatic Saudi-backed ISIS terrorists and seeks to spread terrorism in the Middle-East region.", "While Queen Rania showed herself as a typical glamorous Queen, showing more agreeable and democratic façade to her husband's despotic and repressive regime, but the rumors in Jordan whisper that there was a secret side to Rania’s life, that is least publicized. One thing facts could confirm though, Rania was living a life on the fast lane that is very much Hollywood, and Hollywood indeed, with all that come with that in stark contrast to restricted norms in her country. Dr. Oday al-Shana'a, a London-based former Jordanian court official and ex-friend believes that Bono, the famous Irish singer and so-called philanthropist seduced the innocent Queen.", "The story quickly spread through social media and aggregation sites, but there's no truth to it. AWD News, the web site on which the story originated, doesn't have more than a nodding acquaintance with facts, instead playing on nationalistic fantasy and conspiracy theory to create alarming (and thus clickable and shareable) stories.", "AWD News' story also included the following passage:", "\"I am sorry to inform you that due to yet unexpected reasons, Her Majesty the Queen was found dead at her Excelsior Hotel room, 9:00 pm yesterday night . His Majesty expresses his sincere gratitude to the international  outpouring of grief and sorrow over the Queen 's death,\" Moscow Times cited Mr. Tarawneh on Friday as saying, adding that before her death, the Queen did much to precipitate ending the long-troubled marriage by travelling to Rome to meet a family friend without King's permission.", "No such quote was published in the Moscow Times, nor could we find it reproduced in any article that is not a copy of the AWD News story.", "Other extremely dubious headlines that have appeared on the site include the following: \"European Union Unveils the Creation of 'EU Army' Hidden from British Voters Over the 'Danger of Russia,'\" \"Saudi Arabia offers Mark Zuckerberg $250 billion to buy Facebook and arrest the pro-democracy activists, say reports,\" and \"Assassins Who Killed British MP Jo Cox and Targeted Donald Trump Tied to UK Military, CIA.\" That last story alleges documents from the Kremlin's Foreign Intelligence Service show that the man who murdered Jo Cox and a man who threatened Donald Trump could be traced back to the same mental hospital. (Needless to say, no such documents exist.)", "If Queen Rania had indeed been murdered by King Abdullah II in Rome, the news wouldn't be leaked by a conspiracy-oriented web site out of Berlin. Also, if Queen Rania was indeed murdered on or before 24 June 2016, it's news to her, as she's still posting on social media:", "Happy birthday to Al Hussein! It has been a joy to watch you become the kind and dedicated man you are today. pic.twitter.com/l6S7eKGgfE", "— Rania Al Abdullah (@QueenRania) June 28, 2016", "Brooke Binkowski is a former editor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]