["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Democratic presidential candidate former Vice President Joe Biden, accompanied by his wife Jill, speaks to members of the press at the National Constitution Center in Philadelphia on March 10, 2020. (AP)", "A video circulating on Facebook shows Joe Biden lolling his tongue while his wife talks about his 2020 presidential campaign.", "The video is manipulated. It’s an example of “doctoring.”", "A conservative meme-maker created the video by stitching together footage from a recent clip of Joe and Jill Biden and a parody GIF created using a photo animation app.", "Facebook users are sharing a manipulated video of Joe and Jill Biden that makes it look like the Democratic presidential frontrunner is lolling his tongue while his wife is talking.", "The video, which was published April 28 on a popular conservative Facebook page, takes footage from a legitimate video the Bidens released April 26 that shows Jill Biden talking about her husband’s candidacy. But in the altered video, Joe Biden is rolling his tongue in circles while his wife speaks instead of staring silently at the camera as he does in the original.", "\"I guess the first question would be why is she giving his campaign speech?\" reads the caption on the altered video shared by a Facebook page called Red White Blue News. \"Second question is what the hell is wrong with him?\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "(Screenshot from Facebook)", "We’ve fact-checked several manipulated or deceptively edited videos about the 2020 presidential candidates, so we wanted to check this one out, too.", "The footage of Biden rolling his tongue is not real — a meme-maker manipulated the video by superimposing a digitally altered GIF on top of the original clip of the Bidens.", "A parody Twitter account published the GIF on April 26. It shows Biden in a blue blazer against a bookshelf backdrop. While the outfit is different, the head and tongue motion are identical to those in the Facebook video.", "\"Sloppy Joe is trending. I wonder if it's because of this,\" reads the tweet.", "President Donald Trump retweeted the GIF on April 26, prompting some Twitter users to say the president had shared a \"deepfake\" video, which uses artificial intelligence to make it look like someone is doing or saying something that never happened. But the GIF is not a deepfake — it was created using an app called MugLife, which lets users animate images", "Then one meme led to another.", "We traced the altered clip of the Bidens to a YouTube video uploaded April 27 by an account called \"Solentgreenis people.\" The video shows the same watermark as the Facebook clip and has more than 9,700 views.", "Solentgreenis people, also known as \"Solmemes,\" is a conservative meme-maker with nearly 20,000 subscribers. Solmemes regularly creates digitally altered videos of politicians like Trump and Biden.", "Solmemes’ video is labeled as comedy on YouTube, but it’s an example of what the Washington Post Fact Checker calls \"doctoring.\" That entails \"cropping, changing speed, using Photoshop, dubbing audio, or adding or deleting visual information\" to deceive the viewer.", "The clip of the Bidens is the latest example of manipulated videos on the 2020 campaign trail. Both Biden and Trump have published deceptively edited campaign videos attacking one another. In those cases, the ads used clips that omitted context. They did not transform footage altogether as this widely shared altered video does.", "The Facebook video is inaccurate and ridiculous. We rate it Pants on Fire!", "Facebook video, April 28, 2020", "InVid, accessed April 29, 2020", "MugLife, accessed April 29, 2020", "PolitiFact, \"Ad Watch: Biden video twists Trump’s words on coronavirus,\" March 15, 2020", "PolitiFact, \"Video shared by Trump omits full context of Biden’s comments,\" March 9, 2020", "Reddit thread, Aug. 26, 2019", "Tweet from The Hill, April 26, 2020", "Tweet, April 26, 2020", "Vice News, \"For the Love of God, Not Everything Is a Deepfake,\" April 27, 2020", "The Washington Post Fact Checker, \"The Fact Checker’s guide to manipulated video,\" accessed April 29, 2020", "The Washington Post Fact Checker, \"The sexual allegations against Joe Biden: The corroborators,\" April 29, 2020", "YouTube video from Solmemes, April 27, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]