["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Team Trump is telling supporters that President Donald Trump received record support from party voters during the Iowa caucuses.", "\"Did you see President Trump’s RECORD TURNOUT? Iowa - 32,389 Republicans. New Hampshire - 151,602 Republicans,\" Brad Parscale, the Trump 2020 campaign manager, wrote in a Feb. 25 tweet.", "It followed the theme from Trump on Twitter earlier in the month, just after the Iowa presidential precinct caucuses, when the president wrote that he had \"the largest re-election vote in the history of that great state, by far.\" Also, after the Iowa caucuses, the Iowa Republican Party sent a press release claiming that Trump broke turnout records set by former president Barack Obama in 2012 and that the caucuses had \"smashed turnout records for similar caucus years.\"", "Did Trump set a record in Iowa? Aaron Britt, communications director for the Iowa Republican Party wrote in an email to The Daily Iowan the \"smashing turnout records for similar caucus years\" claim referred to \"caucus turnout in general for years with an incumbent president.\"", "Britt said turnout for the Republican caucuses in 2004 when George W. Bush was the incumbent totaled around 7,000, and around 4,800 Republicans turned out in 1992, when George H.W Bush was the incumbent.", "Turnout for the Republican caucuses this year in Iowa totaled 32,340. That compares with an estimate of more than 25,000 when Barack Obama was the incumbent in 2012, according to a statement from Sue Dvorsky, who chaired the Iowa Democratic Party then.", "Trump received 97% of support in the Iowa caucuses, according to the Iowa Republican Party. Challenger Bill Weld received one pledged delegate from Iowa. In 2012, Obama received 99% of delegates, with 1% of delegates committed to undecided.", "We found Trump, his campaign and the Iowa GOP were accurate in claiming that turnout for Trump was higher on the Republican side than that from Democrats for Obama in 2012 and also for recent Republican incumbents — George H.W. Bush and George W. Bush — in Republican caucuses, and for Democratic incumbent Bill Clinton in 1996.", "The tweet included New Hampshire, where Trump set a record turnout for an incumbent.", "But the broad statement of smashing turnout records from Iowa requires qualifiers like the one Britt provided when asked. That’s because news reports from previous caucuses show in years when an incumbent was not running far exceed the 2020 Republican turnout. In 2012, more than 122,000 Republicans voted during their caucuses, the Des Moines Register reported.", "While Trump’s campaign encouraged Iowa Republicans to show their support for the president at the caucuses, preference votes weren’t taken at the caucuses for the uncontested nominations for incumbents Ronald Reagan in 1984, George H.W. Bush in 1992 and George W. Bush in 2004.", "Democrats still caucused when their incumbents ran, and Obama supporters could point to their candidate’s 99% support from Iowa Democrats in 2012 as being more than 97% for Trump from Republicans. Bill Clinton could do the same with his 98% support in 1996.", "David Redlawsk, a University of Delaware political science professor who has researched Iowa’s caucus evolving history in person for several elections, said preference polls have not been taken at every caucus for an incumbent candidate. \"It’s fairly rare for the incumbent party to even have an active caucus,\" he said. \"That’s ultimately the problem of that claim. Historically, when the party holds the caucus there was no real vote.\"", "And there’s this: Incumbent Jimmy Carter was opposed by Edward Kennedy in the 1980 Iowa Democratic caucuses, which news reports from then say drew about 100,000 participants. Carter won 59% of the delegate support that year, which could be construed to be support from about 59,000 attendees.", "Dave Nagle, a former Iowa Democratic Party chair and former U.S. congressman from Iowa, said in a Daily Iowan interview the 59,000 figure for Carter sounds about right but that he could not be 100% sure. Redlawsk also said that figure would be reasonably accurate.", "Donna Hoffman, a University of Northern Iowa political science professor, said determining turnout in an incumbent year can be difficult, especially in cases where no straw poll is taken.", "\"If you look at 2004, when George W. Bush was the incumbent, the Republicans didn’t even take a poll,\" Hoffman said. \"So any estimates there would be ballpark … in my notes I don’t even have an estimate in terms of Republican turnout.\"", "Hoffman said another problem with comparing caucus turnout is that, before 2020, Democratic caucuses did not report an exact turnout number — just an estimate based on the number of state delegate equivalents. \"It’s a little bit comparing apples to oranges because the Democrats are not reporting a vote like the Republicans do,\" Hoffman said.", "University of Iowa political science Professor Timothy Hagle said Republican turnout this year likely was driven by Trump encouraging Republicans to turn out to caucus, which not all incumbent candidates have done.", "\"If you look back at some of the other candidates …. they weren’t really trying to get people to turn out — it wasn’t necessarily an indication of how energized the base was,\" Hagle said about incumbents seeking re-election during the Iowa caucuses. \"What happened that was a little bit different this time is that the Trump campaign was actually trying to get people to turn out because they wanted it to look good, they wanted to have good turnout here and New Hampshire.\"", "The Trump campaign said that Trump garnered record support in the Iowa caucuses. Republican turnout for Trump topped turnout for Barack Obama in 2012 in terms of numbers but not for the percentage of votes cast by those turning out. Jimmy Carter’s 59% support of 100,000 attendees would be the record for an incumbent, though we don’t know a precise number because of the lack of records for that.", "Trump’s Iowa turnout did not smash records for a nonincumbent caucus. Turnout in 2020 for the Democrats was 176,000 in 2020, around 171,000 in 2012, and 238,000 in 2008, according to the Associated Press.", "The statement is partially accurate but leaves out important context. We rate it Half True.", "Phone interview with University of Northern Iowa professor Donna Hoffman", "Phone interview with University of Iowa political science professor Timothy Hagle", "Phone interview with University of Delaware political science professor David Redlawsk", "Phone interview with Dave Nagle, former Iowa Democratic Party chair and former U.S. congressman", "Phones interview and e-mail exchange with Iowa Republican Party communications director Aaron Britt", "The Republican Party of Iowa, Iowa GOP Caucus Turnout Breaks Obama 2012 Record, Feb.  3, 2020.", "Jean Michael Krogstad, The Des Moines Register, Caucus Turnout Robust, Nearing All Time Record, Jan.  4, 2012.", "Thomas Beaumont, the Associated Press, ‘A dissapointment,’ Iowa Caucus turnout below expectations, Feb.  7, 2020.", "Caucus report, The Des Moines Register, Jan. 4-5, 2008", "Caucus report, The Des Moines Register, Jan. 21, 2004", "Caucus report, The Des Moines Register, Jan. 25-26, 2000", "Caucus report, The Des Moines Register, Feb. 14, 1996", "Caucus report, The Des Moines Register, Feb. 12, 1992", "Caucus report, The Des Moines Register, Feb. 9-10, 1988", "Caucus report, The Des Moines Register, Feb. 22, 1984", "Caucus report, The Des Moines Register, Jan. 22-23, 1980", "Caucus report, The Des Moines Register, Jan. 20-21, 1976", "Caucus report, The Des Moines Register, Jan. 25, 1972", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]