["About this rating", "In early February 2021, a misleading online advertisement about an American congresswoman was displayed on the Outbrain advertising network. It said that U.S. Rep. Alexandria Ocasio-Cortez, also known as \"AOC,\" was married and teased a reveal of her husband's name:", "Readers who clicked the ad were led to a story on the Hollywood Tale website. It spanned 87 pages.", "However, the article said nothing about Ocasio-Cortez actually being married or having a husband. That's because she was not married at the time.", "Near the very end of the story, an incomplete and poorly written page described her boyfriend. The headline of the page left blank the amount of time that the couple had been together. The author also misspelled and failed to capitalize the name of a magazine.", "The Hollywood Tale page read as follows:", "Alexandria Ocasio-Cortez & Riley Roberts- Together For", "According to a 2018 Vogue profile, Ocasio-Cortez and Roberts met while studying at Boston University, in what AOC calls a \"true nerdy fashion.\" They both attended a weekly Friday afternoon conversation hosted by the dean at BU, called coffee and conversation. In the documentary \"Knock Down The House,\" their relationship is shown and it seems like Riley is Cortez's support system. The couple is highly in-love, fun fact is that Cortez's mom is her partner’s biggest fan. They are proud parents to a french bulldog.", "It's true that a 2018 story from Vogue chronicled the relationship between Ocasio-Cortez and her boyfriend, Riley Roberts:", "Ocasio-Cortez was born in the Parkchester neighborhood of the Bronx, and it’s where she lives now, in a one-bedroom apartment with her boyfriend, Riley Roberts, an easygoing redhead who works in web development. Her mother, an Evangelical Christian born in Puerto Rico, cleaned houses.", "Her father, who was born in the borough and became an architect, died of lung cancer at 48. Ocasio-Cortez was then a sophomore at Boston University, where she read not Karl Marx but Martin Luther King Jr. and Howard Thurman. A classmate she’s still close to is Alexandria Lafci, the cofounder of New Story, a San Francisco start-up experimenting with 3-D-printed homes in the developing world.", "Then there’s Roberts, whom Ocasio-Cortez met—\"in true nerdy fashion,\" she says—at a weekly Friday-afternoon conversation hosted by the dean at BU. He later moved from Arizona to be with her.", "In sum, Ocasio-Cortez was not married in early February 2021. The misleading online advertisement was nothing more than clickbait.", "Snopes debunks a wide range of content, and online advertisements are no exception. Misleading ads often lead to obscure websites that host lengthy slideshow articles with lots of pages. It's called advertising \"arbitrage.\" The advertiser's goal is to make more money on ads displayed on the slideshow's pages than it cost to show the initial ad that lured them to it. Feel free to submit ads to us, and be sure to include a screenshot of the ad and the link to where the ad leads.", "Jordan Liles is a Senior Reporter who has been with Snopes since 2016.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]