["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "State Rep. Jeff Shipley wrote that young people have a higher risk of dying from the HPV vaccination than of COVID-19. No deaths have ever been linked to the HPV vaccine.", "While young people are less at risk of dying of COVID-19 than older adults, some younger people have died from the virus.", "Iowa state Rep.  Jeff Shipley, R-Fairfield, is telling Iowans he wants younger Iowans to get back to work as the state begins to reopen, tweeting April 28 that \"seeing so many young people afraid of re-opening the economy because of the virus...Someone should tell them they have a greater chance of being killed by the HPV vaccine than COVID-19.\"", "seeing so many young people afraid of re-opening the economy because of the virus...Someone should tell them they have a greater chance of being killed by the HPV vaccine than COVID-19", "Shipley later tweeted that the remark was not meant to be taken literally, but as a \"hyperbole to engage critical thinking and relative public health risk.\"", "Shipley said in a phone interview with *The Daily Iowan* he did not have data to support his point about young people having a greater chance of being killed by the HPV vaccine than COVID-19 so we checked, and found his statement to be inaccurate.", "According to the Centers for Disease Control and Prevention, no deaths have been linked to the use of the HPV vaccine. The CDC recommends all children receive the vaccine at ages 11-12, though it can be used as early as age 9 and up to age 26.", "The vaccine can prevent cancer-causing HPV infections.", "Shipley said in the interview he wanted to raise a point that young people have less risk of becoming seriously ill from COVID-19 than older adults. He said young people should return to work, though public health experts say it isn’t safe for them to do so yet.", "\"What I’ve seen is a lot of young people are voicing that they’d much rather stay on welfare or unemployment than go back to work, and now they’re kind of complaining that they have to go to work, and they’re saying they don’t feel safe,\" Shipley said. \"I was really upset and kind of angry. And they say they are unsafe, but there’s really no data to support that.\"", "While older adults are most at risk of dying from COVID-19, young people are not immune. In Iowa, 2 percent of deaths from COVID-19 have been individuals under the age of 40.", "In the U.S, at least 325 people under the age of 35 have died of COVID-19 as of May 6, according to the CDC, though this accounts for less than 1 percent of COVID-19 deaths nationwide.", "Data from the World Health Organizations indicates that in studies of the HPV vaccine, the rate of serious adverse events was no higher in those who received the vaccine than those who received a placebo injection.", "Christine Petersen, director of the Center for Emerging Infectious Disease at the University of Iowa, said in a phone interview the risk of dying of COVID-19 is higher, given that no deaths have ever been linked to the HPV vaccine.", "The HPV vaccine prevents the most common types of human papillomavirus strains, which can cause cervical and other cancers.", "\"Roughly, for every 100,000 people in the state of Iowa, there are five who have had cervical cancer, there’s been zero that have died from the vaccine. We know that across the Iowa population, 7.27 people out of 100,000 have died of coronavirus,\" Peterson said.", "Shipley said he believes people who are most at risk should be social distancing, while younger adults can return to work.", "\"There’s a lot of ways we can protect ourselves and enforce social distancing between myself and my parents and my grandparents or whoever it is,\" Shipley said. \"Just because there are people at risk, that doesn’t necessarily mean we all need to stay home, collect government checks, and not go to work.\"", "Petersen warned that separating those at-risk from those who are not is not an easy task.", "\"I would caution that it’s not so easy to target at risk or not at-risk people,\" Petersen said. \"You can be undiagnosed with a disease that can cause you to be impressively immune compromised and not even know it yourself yet, or you can not want to declare it to the rest of the world.\"", "Petersen said COVID-19 still has a reproductive rate of 2 in Iowa, meaning on average, each positive case will spread the virus to two others.", "\"Those people may not show symptoms for at least a day, maybe two, so taking precautions isn’t just to protect yourself, it’s to protect those at risk people,\" Petersen said.", "Shipley wrote that young people are more at risk from the HPV vaccine than COVID-19. Both the CDC and the WHO have concluded that no deaths have been caused by the HPV vaccine, while young people have died from COVID-19 in the U.S and in Iowa.", "While young people are less at risk from the coronavirus than older people, adhering to social distancing protects people at risk of having greater complications from the coronavirus – including those who might not yet know they are at a higher risk. Moreover, Shipley conceded that he made the statement in order to start a discussion, not to give accurate information that could be taken literally. We rated Shipley’s claim as Pants on Fire.", "Phone interview with Jeff Shipley, Iowa Representative", "Phone interview with Christine Petersen, Director of the Center for Emerging Infectious Diseases at the University of Iowa", "The Center for Disease Control and Prevention, HPV Vaccine Safety and Effectiveness Data, November 15, 2019", "The Centers for Disease Control and Prevention, Vaccinating Boys and Girls, August 15, 2019", "The Centers for Disease Control and Prevention, Provisional Death Counts for Coronavirus Disease, May 6, 2020", "Coronavirus.iowa.gov, Case Counts Dashboard, May 7, 2020", "The World Health Organization, Observed Rate of Vaccine Reactions: Human Papillomavirus, December, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]