["The image was published here on Facebook on August 2, 2020.", "The post’s caption reads: “Shri Ram being honoured at time square. Proud moment. Share, comment, Jai Shri Ram.\"", "Times Square is a major commercial intersection and tourist destination in the Manhattan area of New York city.", "Jai Shree Ram is a Hindi expression that translates to victory to Hindu Lord Rama.", "The image was also shared alongside similar claims on Facebook here, here and here.", "The claim, however, is false.", "A Google search using the keywords ‘Times Square billboard generator’ found the exact template of the Times Square billboard on this website.", "The photo has been mirrored.", "Below is a screenshot comparison with some identifying features of the misleading photo (L) and billboard generator photo circled in red by AFP (R)", "A reverse image search on Google found a similar photo of Times Square in New York published on this website.", "Below is a screenshot comparison of the Facebook post photo (L) and wallpapertip.com photo (R):", "The misleading photo has been mirrored after adding images on the billboard generator website.", "The photo found on wallpapertip.com has been available on several blog posts for almost a decade, for example here in 2011 and here in 2015.", "Further, one of the pictures used in the misleading post has text written on the bottom that reads as: \"Alamy stock photo.\"  The photo was published in December 2016 here on the Alamy, an online stock photography agency. The caption reads as: \"Sri Vadapathira Kaliamman hindu temple. Avatar of Vishnu. Lord Rama 7th incarnation.\" This temple is located here in Singapore.", "Below is a screenshot comparison of the photo in a misleading post (L) and Alamy stock photo (R):", "On August 5, 2020, a model of Ram Temple, an image of Ram and the Indian flag was shown on a Times Square LED billboard, as reported here by Indian news agency ANI and here by Indian newspaper Indian Express.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]