["By Angelo Fichera", "Posted on January 22, 2020", "A viral YouTube video rehashed, and added to, a debunked hoax about House Speaker Nancy Pelosi taking money from Social Security to pay for the impeachment investigation into President Donald Trump. The claim originated on a self-described satirical website.", "As the impeachment trial of President Donald Trump began in the Senate, a long-circulating hoax about the House’s impeachment inquiry received renewed life in the form of a viral YouTube video.", "“Pelosi Steals Closer To $5 Billion From Social Security To Pay For Impeachment – Not $2.4 Billion,” the video’s headline read.", "The video peddled a false claim about House Speaker Nancy Pelosi that we debunked months ago and that was completely made up — explicitly so — by a website that calls its work satire. The video weaved additional layers of misinformation into the claim, too.", "The original bogus claim — “Pelosi Diverts $2.4 Billion From Social Security To Cover Impeachment Costs” — was first spread in October by a website under the umbrella of America’s Last Line of Defense. That publication uses a number of websites to spread its self-declared satirical work, but many of its stories sow confusion among social media users.", "The new YouTube video was posted Jan. 16 by an account belonging to a frequent YouTube user named William Mount. It was viewed more than 190,000 times in the days following, gaining shares on Facebook with the help of conservative groups and pages. The video was deleted after we contacted Mount about his claims, but the false headline remains on Facebook posts that shared the video.", "“What you’re about to see will stun you, shock you, anger you, if you have an IQ above room temperature,” Mount told his viewers in the video.", "The video began by reporting the Last Line of Defense story as fact, showing the bogus article and quoting a section about Pelosi filing a “re-appropriation form 77-A in the Congressional Budget office” to move “the amount from the Department of Social Security to cover the cost.” No such form exists, and the agency responsible for Social Security is the Social Security Administration.", "Using the imagined story about the $2.4 billion diversion as a basis, Mount then launched into a long diatribe filled with more erroneous claims about “stolen” money from Social Security.", "For example, referring to the annual Social Security cost-of-living adjustment, he claimed: “Wonder why federal employees got a 2.4% COLA raise and Social Security only got a 1.6% raise? This was used by Pelosi to pay for the impeachment.”", "Social Security recipients did receive a 1.6% cost-of-living raise for 2020, but as we’ve previously explained, that amount is not determined by lawmakers. Instead, the annual adjustment is determined by economic calculations to ensure that the purchasing power of Social Security benefits isn’t eroded by inflation.", "We don’t yet know how much the House’s impeachment investigation — or the now-unfolding Senate impeachment trial — will ultimately cost taxpayers. Unofficial, outside projections of the cost of the House inquiry have offered figures in the millions, not billions.", "The five-month impeachment proceedings against former President Bill Clinton cost about $1.2 million, according to a 1999 Associated Press report, which would be nearly $1.9 million in today’s dollars, when adjusted for inflation.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "“About Us.” Potatriotsunite.com. Accessed 11 Oct 2019.", "“Impeachment Work Cost $1.2 Million.” Associated Press. 16 Apr 1999.", "“Pelosi Diverts $2.4 Billion From Social Security To Cover Impeachment Costs.” Potatriotsunite.com. 4 Oct 2019.", "“Social Security: The Trust Funds.” Congressional Research Service. 8 May 2019.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]