["Democratic presidential candidate former Vice President Joe Biden speaks during a Democratic presidential primary debate on Nov. 20, 2019, in Atlanta. (AP)", "When the subject of \"Medicare for All\" came up during the Democratic debate last week, former Vice President Joe Biden claimed that the majority of his party does not favor it.", "\"The fact is that right now the vast majority of Democrats do not support Medicare for All,\" he said, adding, \"It couldn't pass the United States Senate right now with Democrats. It couldn't pass the House.\"", "This seemed to be a very strong statement, and we weren’t sure that voters’ positions on this issue were as clear-cut as Biden made them out to be, so we asked his campaign where he got the information.", "Public opinion", "The Biden campaign initially directed us to news coverage of a January 2019 Kaiser Family Foundation tracking poll, which noted that the majority of Americans generally oppose  Medicare for All if they hear arguments that frame the program as requiring Americans to pay more taxes or leading to delays in testing and treatment. (Kaiser Health News is an editorially independent program of the foundation.)", "On the flip side, though, when -- in the same poll -- Medicare for All was described as guaranteeing health insurance as a right for all Americans, or that it would eliminate health insurance premiums and reduce out-of-pocket costs, the majority favored the national health plan.", "That poll, now nearly a year old, found that when simply asked, 56% said they did favor having \"a national health plan, sometimes called Medicare-for-all, where all Americans would get their insurance from a single government plan.\"", "Those percentages, though, reflected the views of  all Americans, not just Democrats. The same poll broke down respondents’ answers by political party and showed that 81% of Democrats favored creating a national health plan.", "The KFF Health Tracking Poll, done monthly, indicates Democrats’ support for Medicare for All has weakened, but not entirely. Its most recent version, published in November, revealed large majorities of Democrats support a public option (88%) and Medicare for All (77%). KFF's January 2019 tracking poll has 85% of Democrats favoring a Medicare buy-in.", "\"The majority of Democrats do support Medicare for All, but Medicare for All is not as popular as public option or a Medicare buy-in,\" said Ashley Kirzinger, who is the associate director for public opinion and survey research at KFF.", "Other polls show similar results: support for Medicare for All among Democrats but stronger support for the incremental approaches Biden backs.", "A September NBC News/Wall Street Journal poll, for instance, found 67% of Democrats said they supported adopting Medicare for All. The public option fared better, with 75% of Democrats supporting the proposal.", "\"The data … does show majority support among Democratic voters (whether that reaches a \"vast majority\" depends upon your interpretation), but higher support for a public option,\"Jeff Horwitt, senior vice president with Hart Research Associates wrote in an email. Hart Research Associates conducted the NBC/WSJ poll.", "The Biden campaign also directed us to a September KFF Health Tracking Poll that showed that 55% of Democrats prefer a candidate who would build on the existing Affordable Care Act, while 40% of Democrats prefer a candidate who would replace the ACA with Medicare for All.", "And one more from the Biden campaign -- a CNN article citing a July CNN and SSRS poll that found almost half (48%) of all respondents who lean Democratic said the national program should not replace private insurance, while 31% said that it should.", "That same CNN/SSRS poll, though, had 85% of respondents who are Democrats or Democratic-leaning independents responding \"yes\" when asked if the government should provide a national health insurance program for all Americans, even if it would require higher taxes.", "The numbers from these various polls seem to communicate a range of opinions among Democrats about Medicare for All.", "Robert Blendon of the Harvard T.H. Chan School of Public Health said he thinks Biden’s statement rings true based on a poll he helped conduct, in partnership with the Commonwealth Fund and The New York Times.", "Rather than asking survey respondents if they favored Medicare for All, the survey asked them to choose among Medicare for All, improving the existing ACA or replacing the ACA with state health plans.", "For registered Democrats, the results were close between two of the proposals: 46% preferred Medicare for All and 45% preferred improving the existing ACA. Only 7% preferred replacing the ACA with state health plans. In this survey, Medicare for All was not preferred by a majority of Democrats.", "But Blendon noted that survey respondents often will say yes to a \"one-off question\" about whether they support something and that answer can change once they have to choose among options, such as in his organization’s survey.", "\"The answer is that Democrats are divided on whether or not they want to build on the ACA or whether they want to do Medicare for All,\" he said.", "Congressional support and another context", "Horwitt also made the point that it wasn’t clear in Biden’s statement which group of people he was referencing.", "\"I recall hearing the statement in real-time, but in looking now at just the statement from Biden below, it is unclear to me if he is talking about elected Democrats or Democratic voters when he references the \"vast majority,\" Horwitt wrote via email.", "While the Biden campaign did direct us to public opinion polls, they also pointed out that the Senate and House Medicare for All bills are \"only sponsored by a fraction of the members of the respective Democratic caucuses that would be needed to secure passage.\"", "The Senate Medicare for All bill, introduced by Sen. Bernie Sanders, has 14 co-sponsors, while the House’s Medicare for All bill, introduced by Rep. Pramila Jayapal, has 118 co-sponsors. (There are currently 233 Democrats in the House and 45 Democrats plus two independents in the Senate.)", "Our ruling", "During the recent presidential primary debates, Biden said: \"The fact is that right now the vast majority of Democrats do not support Medicare for All.\" Based on a cursory review of polls, this statement appears off-base. After all, most polls find that when Democrats are simply asked if they support Medicare for All, they answer \"yes.\"", "However, when those same polls dig deeper into this support by asking about the favorability of other Democratic-favored health policies -- Medicare for All, the public option or expansions of the Affordable Care Act -- or if such a Medicare for All program should replace private insurance, this support becomes weaker. The polls do seem to suggest support among Democrats for the moderate reforms Biden backs. Still, the evidence is lacking to support Biden’s claim that a \"vast majority\" of Democrats oppose Medicare for All.", "For these reasons, we rate this statement Mostly False.", "Email exchange with Joe Biden for President campaign staff, Nov. 25, 2019.", "KFF, \"Health Tracking Poll -- January 2019: The Public on Next Steps for the ACA and Proposals to Expand Coverage,\" Jan. 23, 2019.", "KFF, \"Health Tracking Poll -- November 2019: Health Care in the 2020 Election, Medicare-for-all, and the State of the ACA,\" Nov. 20, 2019.", "Telephone interview with Ashley Kirzinger, associate director for public opinion and survey research, KFF, Nov. 25, 2019.", "Hart Research Associates, \"NBC News/Wall Street Journal Survey: September 2019,\" Oct. 1, 2019.", "Email interview with Jeff Horwitt, senior vice president, Hart Research Associates, Nov. 25, 2019.", "KFF, \"Health Tracking Poll -- September 2019: Health Care Policy in Congress and on the Campaign Trail,\" Sept. 12, 2019.", "CNN, \"Black Democrats Prefer the Public Option to ‘Medicare for All’,\" July 27, 2019.", "SSRS, \"CNN Politics Democrats and Health Care June 2019 Poll,\" July 1, 2019.", "Telephone interview with Robert Blendon, Richard L. Menschel professor and senior associate dean for Policy Translation and Leadership Development, Harvard T.H. Chan School of Public Health, Nov. 25, 2019.", "The Commonwealth Fund, The New York Times, Harvard T.H. Chan School of Public Health, \"Americans’ Values and Beliefs About National Health Insurance Reform,\" October 2019.", "S. 1129 - \"Medicare for All Act of 2019,\" sponsored by Sen. Bernard Sanders, 2019-20.", "H.R. 1384 - \"Medicare for All Act of 2019,\" sponsored by Rep. Pramila Jayapal, 2019-20.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]