["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "State Rep. Chris Taylor says Wisconsin's prison population has expanded as openings for correctional officers has increased in the last eight years.", "Wisconsin’s prison system has been in the headlines, from problems at the Lincoln Hills School for Boys, the state’s juvenile facility, to an incident in which a Department of Corrections sergeant exposed the names of confidential informants at the prison in Redgranite.", "The agency’s troubles have attracted plenty of comment from state lawmakers, including State Rep. Chris Taylor, D-Madison, who tossed in some numbers in a May 21, 2019, tweet.", "\"Our corrections system didn’t become a mess overnight. It is a result of the last 8 years of neglect where we saw the prison population expand and vacancy rates for correctional officers go from 2.9% to 15.2%.\"", "Is Taylor correct that Wisconsin has seen an expanded prison population -- and more openings for correctional officers -- over the past eight years?", "Digging into the numbers", "As with other criticism from Democrats, there is no coincidence to the eight-year marking point -- that mirrors the time Republicans had total control in Madison.", "Let’s start with the prison population, and a May 2019 report from the Legislative Audit Bureau. The nonpartisan audit bureau noted the prison population declined from 2009 to 2011 (from 22,672 to 21,941), but has grown since then.", "As the report notes, \"the inmate population grew from 21,941 in 2011 to 23,675 in 2018, or by 7.9 percent.\"", "So, Taylor is on track with the prison population", "What about correctional officer vacancies?", "According to the May 2019 audit bureau report, the turnover rate for correctional officers increased from 17.8 percent in fiscal year 2013-’14 to 26.1 percent in fiscal year 2017-’18.", "\"We found that employee turnover for adult corrections increased from 18.6 percent in fiscal year 2013-’14 to 24.0 percent in fiscal year 2017-’18,\" the report said. \"The turnover rate for correctional officers increased the most, growing from 17.8 percent to 26.1 percent and varied substantially among institutions.\"", "That’s fine for what it is, but Taylor’s claim was for an eight-year period.", "For those numbers, we turned to data from the state Department of Corrections.", "The department’s data on correctional officer and sergeant vacancies (excluding Wisconsin Correctional Center System sites) from 2011 to 2019 shows steady increases, except for a dip in 2017, in vacant positions:", "2011 -- 2.87%", "2012 -- 5.49%", "2013 -- 6.43%", "2014 -- 6.46%", "2015 -- 7.62%", "2016 -- 11.25%", "2017 -- 10.97%", "2018 -- 12.36%", "2019 -- 15.27% (through May 11, 2019)", "So, Taylor is on target on that part of the claim as well.", "What’s behind the numbers?", "Corrections officials have said the state’s low unemployment rate makes it hard to hire and keep workers. As a result, overtime continues to increase.", "According to a May 2, 2019,  Milwaukee Journal Sentinel report, state agencies spent $80.9 million on overtime in 2018, with most of it — nearly $50 million — going to Department of Corrections workers.", "Daniel Meehan, a retired sergeant at Waupun Correctional Institution, blamed the worker shortage and rising overtime on Act 10, the 2011 law that dramatically curtailed collective bargaining for most public employees. Raising wages won't fix the staffing problem on its own, he told the Journal Sentinel.", "\"In corrections, the job is undesirable,\" said Meehan, who worked for the Department of Corrections from 1981 to 2015. \"Nobody wants to do it anymore. Nobody’s applying for the job, and the ones that do, quit.\"", "What’s ahead?", "On May 2, 2019, Gov. Tony Evers’ administration announced temporary raises of $5 an hour to workers at six prisons in hopes of curbing long-running staff shortages at those institutions.", "Until at least June 2020, officers and sergeants will get additional pay for shifts at Columbia, Dodge, Green Bay, Taycheedah and Waupun correctional institutions. The bonus will also be paid to workers at Lincoln Hills.", "These institutions will now pay new workers $21.65 an hour — 30% more than the $16.65 an hour paid to those starting at most Wisconsin prisons. Veteran employees at the six institutions will also get pay boosts of $5 an hour -- an increase of more than $10,000 a year.", "The move was criticized by some since it leaves out officers and sergeants at more than a dozen other prisons and raised concerns that staff shortages at some institutions would widen if workers decided to transfer to the prisons that are paying more.", "Meanwhile, under a plan adopted May 22, 2019, by Republicans on the Legislature's budget committee, starting wages for Wisconsin prison guards would go up by more than 14% over two years — from $16.65 an hour to $19 an hour. More senior officers would also get raises of $2.35 an hour by 2021. Most other state employees would get 2% raises in each of the next two years, as Evers recommended.", "Our ruling", "Taylor claimed \"We saw the prison population expand and vacancy rates for correctional officers go from 2.9% to 15.2%\" over the last eight years.", "The Legislative Audit Bureau said the adult inmate population has increased in the last eight years, from 21,941 in 2011 to 23,675 in 2018, or by 7.9%. And Corrections Department numbers show she is correct about the staffing vacancies as well.", "We rate the claim True.", "Milwaukee Journal Sentinel \"A prison sergeant put rat images next to the names of informants on a list of inmates. Death threats followed, Feb. 1, 2019.", "Wisconsin State Journal \"Department of Corrections chief to step down,\" May 24, 2018.", "Milwaukee Journal Sentinel \"Scott Walker’s corrections secretary is departing amid rising prison costs and a criminal investigation of Lincoln Hills School,\"May 23, 2018.", "Twitter State Rep. Chris Taylor May 21, 2019.", "Legislative Audit Bureau, \"Adult Corrections Expenditures,\" May 2019.", "Milwaukee Journal Sentinel \"Overtime at Wisconsin prisons continues to soar, topping $50 million in 2018,\" Jan. 11, 2019.", "Milwaukee Journal Sentinel \"Gov. Tony Evers’ administration gives $5-an-hour raises to officers at six Wisconsin prisons,\" May 2, 2019.", "Milwaukee Journal Sentinel \"Overtime for state workers tops $80 million, with some Wisconsin employees more than doubling their pay,\" April 26, 2019.", "Department of Corrections Division of Adult Institutions correctional officer and sergeant vacancies 2011 to 2019.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]