["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "As Democratic leaders call on Vice President Mike Pence to invoke the 25th Amendment to remove President Donald Trump, some people are speculating about how that power could be wielded in future administrations. And one wild theory is spreading on social media: that the incoming vice president will oust President-elect Joe Biden and tap Pence to replace her.", "\"I heard a rumor @KamalaHarris is planning on pulling the 25th Amendment on @JoeBiden the minute he is sworn in, and then appointing @MikePence as her Vice-President,\" read one Facebook post. \"Is this true?\"", "It was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "We reached out to former Senate candidate Shiva Ayyadurai, who wrote the Facebook post. Ayyadurai — who lost in the Massachusetts Republican primary — did not immediately respond to our email about the claim.", "We also did not hear back from the Biden-Harris campaign.", "But there is no evidence to substantiate this theory.", "A little background:", "The 25th Amendment says that if the vice president and a majority of the Cabinet declare that the president can no longer carry out his duties, the vice president would become the acting president.", "In October, following Trump’s diagnosis with COVID-19, House Speaker Nancy Pelosi introduced a bill to establish a commission that could be tasked with determining if a president is no longer fit for office in accordance with the 25th Amendment. Soon after, Trump tweeted without evidence that Pelosi was \"looking at the 25th Amendment in order to replace Joe Biden with Kamala Harris.\" There was no factual basis for that claim either.", "Now that the amendment is in the news again, Biden and Harris have not commented on calls to use it to remove Trump.", "\"President-elect Biden and Vice President-elect Harris are focused on their duty — preparing to take office on Jan. 20 — and will leave it to Vice President Pence, the cabinet and the Congress to act as they see fit,\" Andrew Bates, a spokesperson for the Biden transition, told the New York Times.", "We’ve previously fact-checked other unfounded allegations that hinge on the fears of some conservatives that Biden is a \"Trojan Horse\" for a Harris presidency. Some social media posts have included the inaccurate claim that Pelosi would automatically become Harris’ vice president.", "And we find no credible evidence to suggest that there is any discussion of Harris seeking to replace Biden once sworn in. It’s especially unfathomable that Harris, a Democrat, would nominate Pence, a Republican, as her vice president if she replaced Biden. If that were to happen, and Harris were then to leave the office of the president, she would effectively hand over power to the other party — Pence would become the new president.", "The claim that Harris plans to oust Biden and appoint Pence as her vice president is False.", "This fact check is available at IFCN’s 2020 US Elections #Chatbot on WhatsApp. Click here, for more.", "Facebook post, Jan. 7, 2021", "PolitiFact, Using the 25th Amendment or impeaching Trump: Could they happen? Jan. 7, 2021", "PolitiFact, Pelosi wouldn’t automatically become vice president if Biden stepped down, Sept. 16, 2020", "PolitiFact, If a President Biden left office, Nancy Pelosi would not become vice president, Oct. 10, 2020", "PolitiFact, House Democrats’ new bill on the 25th Amendment, explained, Oct. 9, 2020", "The New York Times, Pressure on Trump intensifies as resignations roil end of his term, Jan. 8, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]