["About this rating", "On 25 December 2017, a mysterious web site bearing a Soviet Union domain name (chronicle.su) published an article which appeared to report that WikiLeaks had released a large set of so-called \"Deep State Files,\" containing some of the Central Intelligence Agency's most classified secrets:", "Early Christmas morning, Julian Assange announced the release of 700 Terabytes in what’s being called the ‘Deep State Files’. Exclusive early analysis granted to Chronicle.su by Wikileaks reveals the Deep State Files are the entirety of the CIA’s most classified and restricted database, detailing everything from extensive work in manipulating and controlling Russian elections to Bill Clinton providing nuclear assistance to Kim Jong Il in 2009.", "Wikileaks founder and spokesperson Julian Assange told followers this knowledge would “change the world,” and may be the “biggest story in history.” Assange’s Twitter account was banned, and following this an alternate account was suspended.", "The hashtag #DeepStateFiles quickly spread on Twitter, referencing a popular conspiracy theory about a covert Illuminati-like shadow government known collectively in some circles as the \"Deep State\":", "Why was JA offline earlier? Did @JulianAssange promise a Christmas present? Early this morning he delivered. First look at #DeepStateFiles at chronicle.su over 700TB of data detailing the past admin. and pay for play at the #ClintonFoundation soon online https://t.co/q1BBgs7mNm", "— Mike Fletcher (@mfletch001) December 26, 2017", "However, the claim could only be traced back to a single source (Chronicle.su); the official WikiLeaks account tweeted nothing about this purported major release. A phony account (with a handle misspelling \"WikiLeaks\" as \"wikileiks\") shared the claim, but its Twitter bio labeled it a parody:", "Thanks to @BarrettBrown_'s Pursuance Project and the #DeepStateFiles they released we now know the truth about The Clinton Foundation", "— WikiLeaks (@wikileiks) December 26, 2017", "Chronicle.su's \"About\" page didn't state the site was fake news per se, but it provides every indication that its content was purely for entertainment purposes:", "Sadly, chronicle.su is not of this earth. After crash landing in an asteroid December 30th, 1976, the alien husks of Chronicle editors rapidly adapted to Earth climates and bacterial flora. They are able to survive naturally in the wild and reproduce freely.", "Here at chronicle.su, we take a liberal stance on drug abuse and theft of intellectual property, but that does not mean we are liberal because liberals are faggots and I ain’t no steer-boatin’ queer!", "A sidebar on the site boasts a number of hoaxes and utter fictions, including \"Papa John’s Pizza announces Watermelon Pizza,\" \"Researchers close to discovering ‘miracle’ new life-destroying opiate,\" and \"Trump, Netanyahu: Israel set to become 51st state.\"", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]