["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Pope Francis canceled a few engagements after he was seen coughing and sneezing during an Ash Wednesday mass.", "The Vatican has denied the stories, saying the pope has a “slight illness.”", "Pope Francis recently canceled some engagements after he was seen coughing and sneezing during an Ash Wednesday mass in Rome.", "The rare cancellations came as the coronavirus outbreak in Italy has infected more than 1,600 people, mostly in the northern region, and has people questioning whether the pope himself has contracted the virus.", "One YouTube video takes the rumor further by stating that the Vatican confirmed \"Pope Francis and two aides\" tested positive for the coronavirus.", "This isn’t true. There has been no official confirmation that the 83-year-old Catholic leader, or any of his aides, tested positive for the virus.", "The video was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "We could find no credible sources that say the pope — who lost part of a lung to an illness as a young man — was tested for the current coronavirus, or that he tested positive. The Vatican has repeatedly denied the claims and described his condition as a \"slight illness\" without giving more details.", "Vatican spokesman Matteo Bruni dismissed the coronavirus speculation, telling journalists that there’s \"no evidence that would lead to diagnosing anything but a mild indisposition.\"", "The pope appeared at the Vatican Apostolic Palace window on March 1 to address thousands in St Peter’s Square in his first public appearance in days.", "We rate this Pants on Fire!", "YouTube, Vatican Confirms Pope Francis And Two Aides Test Positive For Coronavirus, Feb. 29, 2020", "Associated Press, Coughing pope cancels participating in Lenten retreat, March 1, 2020", "Vatican News, Pope postpones official audiences but continues meetings at Santa Marta, Feb. 28, 2020", "Reuters, Pope makes first public appearance following illness, March 1, 2020", "Rappler.com, FALSE: Vatican confirms Pope Francis 'tested positive' for coronavirus, March 2, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]