["About this rating", "On Sept. 13, 2019, U.S. Rep. Ilhan Omar, D-Minn., was at an event to celebrate black women in Congress as part of CBC (Congressional Black Caucus) Week. At one point during the night, Omar and other attendees were filmed dancing. This video was shared by Adam Green, the co-founder of the group Bold Progressives, and was then retweeted by Omar herself:", "We couldn’t celebrate #breakingconcreteceilings without jamming to my hometown girl @lizzo ? https://t.co/zAXsGTkeeR", "— Ilhan Omar (@IlhanMN) September 14, 2019", "This rather innocuous video became the focus of online outrage a few days later when Twitter user Terrence K. Williams falsely claimed that it showed Rep. Ilhan Omar partying on the anniversary of 9/11:", "This inaccurate claim was then promoted by President Trump. The commander in chief tweeted the video, as well as Williams' false claim that it showed Omar partying on 9/11, with the message: \"Ilhan Omar, a member of AOC Plus 3, will win us the Great State of Minnesota. The new face of the Democrat Party.\"", "This video was not filmed on the anniversary of 9/11.", "This video was actually taken on September 13, 2019. Bold Progressives, the group co-founded by Adam Green, the person who took the video, also posted on Twitter that this video was taken on the 13th:", "Our co-founder @AdamGreen posted this video from a CBC event on Sept 13, and @IlhanMN retweeted it. Today @realDonaldTrump tweeted that she \"partied on the anniversary of 9/11.\" This is an abhorrent lie that endangers a Member of Congress. Twitter must remove Trump's Tweet now. https://t.co/zzeb1dXTzc", "— BoldProgressives.org (@BoldProgressive) September 18, 2019", "This video was filmed at the nonprofit venue the Culture House in Washington D.C. The morning after the event, the Culture House posted several photographs of Omar and other representatives:", "When Members of Congress connect during #CBC2019 in honor & support of #Black: Women, Businesses, Organizations, Arts & Culture, it makes for an Amazing Historical Experience filled w/ Energy, Emotion & Inspiration. cc: @AyannaPressley @IlhanMN @LaurenUnderwood @ianeyecan #RT pic.twitter.com/WnIGTcKnp2", "— Culture House DC (@CultureHouseDC) September 14, 2019", "Several other videos and photographs from this night can also be found on Twitter. Ilhan Omar's spokesperson confirmed that the video was filmed on Friday, Sept. 13: \"Friday night is correct. It was filmed at a CBC event we hosted to celebrate black women in Congress.\"", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]