["About this rating", "An image supposedly showing Kim Kardashian wearing mirrored sunglasses at a poker table is frequently shared on social media along with disparaging comments about the reality star's perceived intelligence. One common caption, for instance, is, \"Whenever you feel like a moron, just remember that Kim Kardashian played poker with mirrored sunglasses.\"", "This is a genuine photograph of the reality television star wearing reflective sunglasses at a poker table. However, this fashion choice isn't as moronic as the meme would suggest.", "The photograph was taken in July 2018 at the first annual \"If Only\" Texas Hold'em charity poker tournament at The Forum in Inglewood, Calif. While we haven't been able to source this specific photograph, we did find a number of other images showing Kardashian wearing the same glasses at this event.", "While this image is genuine, it doesn't document a particularly unusual or \"moronic\" choice of eye wear. Sunglasses are actually quite common around the poker table. We searched through Getty Images and found photographs of professional poker players such as Phil Laak, Scott Fischman, Iwan Jones, Chip Jett, Chris Moneymaker, and Qui Nguyen wearing similarly reflective eye wear.", "Here's an image of World Series of Poker Europe champion Phil Laak wearing reflective glasses at the poker table:", "Wearing reflective sunglasses during a poker tournament may seem moronic to casual viewers (wouldn't the other opponents be able to see their cards?), but tournament players rarely hold their cards in a position that would result in their hands' being displayed on the reflective lenses of their glasses. Most Texas Hold'em players don't even even lift their cards up off the table, opting instead to just bend up an edge for a sneak peek:", "The image of Kardashian wearing mirrored sunglasses while playing poker is indeed real. However, it's not nearly as stupid as presented in this meme.", "TMZ.   \"Kim Kardashian West, Kris Jenner Wheelin' and Deelin' Cards for Massive Charity Event.\"     10 July 2018.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]