["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Merit raises for assistant district attorneys in Wisconsin disappeared for a decade. But across-the-board raises didn't.", "In campaigning for state attorney general, state Rep. Jon Richards made a claim that made us wonder how prosecutors in district attorney’s offices across Wisconsin have been getting by.", "In a video released June 16, 2014, the Milwaukee Democrat stated:", "\"Last year, I was involved with an effort to to help prosecutors get their first pay raise in more than 10 years.\"", "No raises for more than a decade?", "No.", "But let us explain.", "The background", "The main job of the state's locally elected district attorneys and the assistants they hire is to prosecute felony and misdemeanor crimes, as well as well juvenile cases, in circuit court. Wisconsin has 72 counties but 71 district attorneys, as one DA serves both Menominee and Shawano counties.", "The assistant district attorneys were county employees until 1990, when a change in state law made them state employees and allowed them to collectively bargain for wages.", "The pay for the assistants has been a concern for years. A University of Wisconsin-Madison study in 2011 that called for raises found that dating back 2005, annual turnover among assistant district attorneys exceeded 18 percent.", "Richards’ evidence", "We asked Richards campaign spokesman Sachin Chheda for evidence to back the claim that Richards helped get prosecutors their first pay raise in more than 10 years. He suggested we contact David Feiss, a Milwaukee County assistant district attorney and president of the Association of State Prosecutors, the statewide union for assistant DAs.", "Feiss told us it would be wrong to say the state’s prosecutors have not received any pay raises in more than a decade.", "Indeed, contracts that the union negotiated with the state provided a number of across-the-board raises, as the UW-Madison study noted:", "Year pay raise effective", "Amount of raise", "2004", "1 percent, plus 10 cents/hour, plus $250 lump sum", "2005", "2 percent", "2006", "2 percent", "2007", "April: 2.25 percent; July: 2 percent plus $1.25/hour", "2008", "1 percent", "So, how can Richards claim there were no raises?", "Feiss pointed out to us that the contract covering 2003-’05, unlike previous contracts, contained no provision for merit pay raises and that subsequent contracts have not, either.", "In other words, assistant district attorneys couldn’t advance in pay beyond the across-the-board raises.", "That changed after the Legislature in 2012 created a new merit pay structure, which was implemented as part of the 2013-’15 state budget. As Richards noted, he helped lead that effort.", "The new pay progression plan consists of 18 hourly salary steps, from $49,429 on the low end to $119,471 at the top. Each step is worth $4,120.", "Effective in July 2013, prosecutors were moved up in pay by one step. And going forward, based on merit, they can get a raise of one step or more each year, although the total annual raise cannot exceed 10 percent.", "Our rating", "Richards said that in 2013, he \"was involved with an effort to to help prosecutors get their first pay raise in more than 10 years.\"", "Since a merit pay system was eliminated in 2003, assistant district attorneys could not get merit raises or \"step\" raises -- to a higher place on the pay scale -- until a new merit and step-pay system was put in place in 2013, with Richards’ help. But prior to that, they received across-the-board raises for five consecutive years, from 2004 through 2008.", "We rate Richards’ statement False.", "To comment on this item, go to the Milwaukee Journal Sentinel’s web page.", "YouTube, Jon Richards \"Tough\" campaign video, June 16, 2014", "Interview, Jon Richards campaign spokesman Sachin Chheda, July 17, 2014", "Milwaukee Journal Sentinel, \"Bills propose pay progression scale for assistant district attorneys,\" Jan. 18, 2012", "University of Wisconsin-Masison Robert M. LaFollette School of Public Affairs, \"Public Safety and Assistant District Attorney Staffing in Wisconsin,\" Oct. 24, 2011", "Interview, Association of State Prosecutors president and Milwaukee County Assistant District Attorney David Feiss, July 18, 2014", "Wisconsin 2013-’15 state budget, District Attorneys section", "Wisconsin Office of State Employment Relations, 2005-’07 assistant district attorneys contract, 2005-’07", "Wisconsin Office of State Employment Relations, 2007-’09 assistant district attorneys contract, 2007-'09", "Wisconsin Legislature, 2011 Wisconsin Act 238 (adopted April 6, 2012)", "Email interview, University of Wisconsin professor emeritus of public affairs and political science Dennis Dresang, July 22, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]