["By Robert Farley and D'Angelo Gore", "Posted on February 18, 2020", "It is customary for presidents to invite guests to the State of the Union address to provide anecdotal evidence that supports the president’s policies. But it turns out President Donald Trump’s speech included misleading descriptions of two such guests.", "We didn’t write about either of these guests in our fact-check wrap-up of the Feb. 4 State of the Union. But in the days after the speech, investigations by the Philadelphia Inquirer and Associated Press exposed the disconnect between the president’s rhetoric and the facts.", "Making his pitch for school choice, Trump introduced the American public to Janiyah Davis, a fourth grader from Philadelphia.", "“For too long, countless American children have been trapped in failing government schools,” Trump said. “To rescue these students, 18 states have created school choice in the form of Opportunity Scholarships. The programs are so popular that tens of thousands of students remain on a waiting list.”", "One of those on the waiting list, Trump said, is Janiyah.", "“Janiyah’s mom, Stephanie, is a single parent,” Trump said. “She would do anything to give her daughter a better future. But last year, that future was put further out of reach when Pennsylvania’s governor vetoed legislation to expand school choice to 50,000 children.”", "(It’s true that last June, Pennsylvania Gov. Tom Wolf vetoed a bill that would have nearly doubled the state’s Educational Improvement Tax Credit program, adding $100 million in credits to businesses that donate to scholarships for students to pay for private schools. But as the Philadelphia Inquirer reported, Wolf in 2018 signed a budget with a more modest $25 million increase for the program.)", "Trump said he was “pleased to inform” Janiyah that her “long wait is over,” and that “an Opportunity Scholarship has become available, it’s going to you, and you will soon be heading to the school of your choice.”", "Trump then called on Congress to pass the Education Freedom Scholarships and Opportunities Act, which would provide $5 billion in federal tax credits to individuals and businesses that donate to scholarship programs that offset the cost of private-school tuition and other educational expenses.", "The following day, the Department of Education announced that Education Secretary Betsy DeVos would personally donate a scholarship to Janiyah.", "Speaking at the North Carolina Opportunity Now Summit three days after the State of the Union, Trump again cited Janiyah as just one example of “countless American children” who are “trapped in poorly performing schools.”", "Trump again claimed Janiyah was “on the waitlist for a school choice Education Freedom Scholarship in Pennsylvania, along with 50,000 other Pennsylvania students.”", "But as the Philadelphia Inquirer discovered, Janiyah was not on the waitlist for a private school scholarship — she was already enrolled in “one of the city’s most sought-after charter schools.” According to the Inquirer, Janiyah this school year enrolled at Math, Science and Technology Community Charter School III, a brand-new, independently run but government-funded charter school. MaST III, which is overseen by a nonprofit foundation, is the newest member of the MaST Community Charter School network that got 6,500 applications for 100 seats next year, the Inquirer reported.", "We called MaST III to confirm Janiyah was enrolled but have not received a response. However, the Washington Post also verified her attendance with John F. Swoyer III, the chief executive of the MaST Community Charter School network.", "MaST III is too new to garner a ranking, but other schools in the MaST network can hardly be lumped in with the “poorly performing schools” that Trump described. On its website, MaST boasts that it was once chosen as the top charter school in the state by niche.com, and it is highly rated in Pennsylvania by U.S. News & World Report.", "A Philadelphia Inquirer story last August about MaST’s two new schools, including the one Janiyah now attends, states: “Set on lushly landscaped, amenity-packed campuses, they might be better described as total educational environments.” MaST III took over the former headquarters of a Fortune 500 company and “comes with walking paths, a pond and an arboretum’s worth of mature trees.” The article notes that MaST is “among the best-rated schools in Philadelphia.”", "“I don’t view MaST as a school you want to get out of at all. I view it as a great opportunity,” Janiyah’s mother, Stephanie Davis, told the Philadelphia Inquirer.", "She told the Inquirer that her daughter attended a private Christian school for first through third grades. She said her daughter got a partial scholarship toward the $5,200 tuition for elementary students, but that it was still a financial struggle. She said Janiyah transferred to MaST III when she was accepted there last summer.", "According to the Inquirer, Janiyah was chosen to attend the State of the Union after someone from the White House called the Christian school she formerly attended and inquired about students with financial need who might be eligible for scholarships.", "Janiyah’s mother said she and her daughter are weighing whether the girl will stay at MaST, return to the Christian school or go to another school.", "Trump has long been an advocate of school choice, and charter schools are a part of that vision. Some Democrats have argued that charter schools take money away from public schools. Sen. Elizabeth Warren, for example, does not propose cutting funding for nonprofit charter schools like MaST, but according to her campaign, “she believes we should not put public dollars behind a further expansion of charters until they are subject to the same accountability requirements as public schools.”", "Regardless, the school Janiyah attends is independently run by a nonprofit board, but it is also government-funded. So there is no cost for her to attend. She may wish to attend a private school, but given MaST’s performance and its highly sought-after status, it’s misleading to hold Janiyah up as an example of a student “trapped in poorly performing schools.”", "In his speech, Trump also applauded a formerly homeless veteran who he misleadingly suggested was aided in turning his life around by a provision in the Tax Cuts and Jobs Act that became law in December 2017.", "“Opportunity Zones are helping Americans like Army veteran Tony Rankins from Cincinnati, Ohio,” said Trump, referring to the federal tax benefits that the law provides for making qualifying investments in any of the more than 8,700 designated “economically distressed” communities in the U.S. “After struggling with drug addiction, Tony lost his job, his house, and his family. He was homeless. But then Tony found a construction company that invests in opportunity zones. He is now a top tradesman, drug-free, reunited with his family, and he is here tonight.”", "It’s true that Rankins works for R Investments, a Colorado-based real estate investment company that says it uses “‘Opportunity Zone’ legislation to maximize long term financial results for our partners.” However, as the Associated Press reported last week, Rankins has not yet worked at one of the company’s job sites that benefits from the tax breaks that Trump highlighted.", "Associated Press, Feb. 13: Rankins, who indeed moved out of his car and into an apartment since landing a job refurbishing a Nashville hotel two years ago, doesn’t work at a site taking advantage of the breaks and never has done so. In fact, he started that job four months before the Treasury Department published its final list of neighborhoods eligible for the breaks. And the hotel where he worked couldn’t benefit even now because it’s an area that didn’t make the cut.", "Gina Milano, the chief operating officer of R Investments, which first hired Rankins to do construction work on that hotel in Nashville, Tennessee, in 2018, confirmed to FactCheck.org in an interview that Rankins has not worked at a property that uses the opportunity zone tax incentives that Trump signed into law.", "The property where Rankins currently works is located in an opportunity zone in Cincinnati, she said, but the company is not receiving the tax breaks for it. And the property that Rankins previously worked on in Nashville — the one where his life transformation began — didn’t receive them either, she told us.", "Milano did say that Rankins will soon be going to work at another one of the company’s properties in Cincinnati that does benefit from the tax breaks. That facility is in the process of being converted into a training school for future construction workers.", "But Rankins won’t start working there for another “30 to 45 days,” she said.", "According to the AP, the CEO of R Investments, Travis Steffens, said that property is currently the company’s only building that is tapping the opportunity zones program.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]