["It is a favored line among Republican candidates to charge their Democratic opponents with cutting Medicare. U.S. Rep. Connie Mack IV, R-Fort Myers, leveled the attack at least four times in the first half hour of Wednesday’s Florida U.S. Senate debate.\n\nMack said incumbent Sen. Bill Nelson \"voted to cut $700 billion out of Medicare to pay for Obamacare.\"\n\nPolitiFact has addressed this claim many times, in many ways, in many states.\n\nObamacare refers to the Affordable Care Act. It does not literally cut funding from the Medicare program’s budget. Rather, the health care law instituted a number of changes to try to bring down future health care costs in the program. We should note that the Republican plan championed by GOP vice presidential nominee Paul Ryan also trims Medicare spending by almost exactly the same amount.\n   \nThe spending reductions fall largely on insurance companies and hospitals, not beneficiaries. The law made significant reductions to Medicare Advantage, a subset of Medicare plans run by private insurers. Medicare Advantage was started under President George W. Bush, and the idea was that competition among the private insurers would reduce costs. But the plans have actually cost more than traditional Medicare. So the health care law scales back the payments to private insurers.\n   \nHospitals, too, will be paid less if they have too many re-admissions, or if they fail to meet other new benchmarks for patient care.\n     \nThe overall Medicare budget is projected to go up for the foreseeable future, even with the health care law’s cost-saving measures. The law tries to limit the program’s growth, though, making it less than it would have been without the law, but not reducing its overall budget.\n     \n $716 billion\n         \nThe Congressional Budget Office, the nonpartisan analytic arm of Congress, looked at the years 2013 to 2022 and determined the health care law would reduce Medicare outlays by $716 billion.\n         \nObama and fellow Democrats say the intention is to protect beneficiaries' coverage while forcing health care providers to become more efficient. One impact of the law is it extends the solvency of the Medicare Trust Fund by eight years to 2024.   \n\nThere is a connection between the Medicare cost savings and the health care law. At the time the health care law was being finalized, Democrats said it was important that the new law not add to the deficit. So the reductions in Medicare spending were counted against the health care law’s new spending.\n   \nSome of the new spending goes toward Medicare recipients. It increases coverage for prescription drugs and offers preventive care at no cost to the patient.\n     \nMore significantly, though, the law moves to cover the uninsured, by giving them tax credits to buy private insurance. It also expands Medicaid, the state insurance program for the poor. The savings from Medicare offset that spending.\n     \nThe health law also imposes new taxes, primarily on the wealthy and on the health care industry. That, too, offsets the new spending.\n\n Our ruling\n\nMack said Nelson voted to cut $700 billion out of Medicare, to pay for Obamacare.\n\nMedicare spending increases under Obamacare, but over 10 years, it rises more slowly that it would without the law. The money comes from reducing payments to insurance companies and hospitals.\n\nPart of the savings go to reduce prescription drug payments for Medicare recipients, as well as to provide free preventive care.\n\nOverall, the lower spending extends the solvency of Medicare by eight years.\n\nWe rate the statement Mostly False.", "PolitiFact, Paul Ryan said President Obama \"funneled\" $716 billion out of Medicare \"at the expense of the elderly.\", August 29, 2012\n\nPolitiFact, Romney says Obama cut $716 billion from Medicare, October 3, 2012\n\nPolitiFact, Clinton says Ryan attacked Obama for cuts reflected in Ryan’s own budget, September 6, 2012\n\nPolitiFact, R.I. congressional candidate Michael Riley says President Obama \"cut $716 billion from Medicare, August 29, 2012\n\nPolitFact, Jim Renacci says Betty Sutton, Democrats gutted Medicare by $741 billion to pay for Obamacare, August 24, 2012\n\nCongressional Budget Office, CBO's Analysis of the Major Health Care Legislation Enacted in March 2010, March 30, 2011\n               \nCongressional Budget Office, H.R. 2, Repealing the Job-Killing Health Care Law Act, February 18, 2011\n               \nCongressional Budget Office, The Long-Term Budgetary Impact of Paths for Federal Revenues and Spending Specified by Chairman Ryan, March 20, 2012\n\nThe Kaiser Family Foundation, Health Reform and Medicare: Overview of Key Provisions, July 2010", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]