["There aren’t many issues that can bring the American Civil Liberties Union and the tea party together, but there is one matter that has them and others on the same side.", "A coalition of organizations -- they call themselves Georgians for Forfeiture Reform -- recently held a news conference at the Georgia Capitol to plead for changes to the state’s civil forfeiture laws. How bad are the laws?", "\"Georgia’s civil forfeiture laws are among the worst in the country and the very worst in the South,\" Americans for Prosperity Georgia spokesman Joel Aaron Foster said in a press release beforehand.", "Lee McGrath, legislative counsel for the Institute for Justice, a Virginia-based organization that has taken a close look at the issue, repeated the talking point at the news conference.", "PolitiFact Georgia wondered if this claim is correct, or is this another example of some groups exaggerating the significance of a problem?", "Critics say some law enforcement officers unfairly keep money seized from motorists who are investigated for drug trafficking and other offenses and eventually cleared. One man spent $12,000 in legal fees to recover $43,000 police took from him when he was pulled over in South Georgia, the institute noted.", "The coalition wants the Georgia Legislature to pass House Bill 1, which would put law enforcement and prosecutors under greater scrutiny over how they use cash and property seized in criminal investigations. Supporters want Georgia’s forfeiture laws to be patterned after the rules in North Carolina, in which a jury can consider seizing property only after a conviction, and only if it was used for a crime.", "The legislation, sponsored by House Judiciary Committee Chairman Wendell Willard, R-Sandy Springs, received committee approval in early February. Its co-sponsors include House Minority Leader Stacey Abrams, D-Atlanta. The bill has yet to come up for a vote in the House of Representatives.", "Some law enforcement leaders, such as Gwinnett County District Attorney Danny Porter, support the legislation after initial reluctance to do so. Others, such as the Georgia Sheriffs’ Association, think Georgia laws are fine and have said no changes are necessary.", "To be clear, PolitiFact Georgia is not making a judgment call on whether Georgia has the worst forfeiture laws around. Instead, our goal is to see whether the claim is based on valid reports and research about Georgia’s forfeiture laws.", "Lawmakers worked out what they hope is a compromise to get the bill passed shortly after The Atlanta Journal-Constitution published several reports last year that called into question how forfeiture funds are used. The newspaper found Fulton County District Attorney Paul Howard spent thousands of dollars of forfeited funds on galas, sports tickets, staff parties and elaborate home security. Last year, Douglas County District Attorney David McDade was accused of using his forfeiture account to give side jobs and government cars to favored employees.", "Current state law requires agencies to file reports on their forfeiture activity with a state-run website each year, but the AJC found that few complied and that those who did gave little information. The new proposal would standardize the process and require more disclosure.", "The Institute for Justice released a report last year on forfeiture laws and found similar issues concerning the state’s disclosure process. A random sample of 20 law enforcement agencies found only two were providing annual reports, the institute found. Other agencies were submitting reports omitting key details.", "\"Reports from police departments in Atlanta, Dunwoody, Marietta and LaGrange, for example, provide only dollar amounts but no descriptions of the properties taken,\" the institute wrote in its study.", "The study did not contain responses from those departments to the concerns outlined in the report. Dunwoody police Chief Billy Grogan said the department complied with all reporting requirements.", "Georgia’s grade on the quality of its forfeiture laws put it on the dishonor roll. D-.", "Thank God for Michigan, Texas, Virginia and West Virginia. They received the same grade, the lowest in the nation.", "Another study by a three-person team of researchers on state forfeiture laws showed some of what critics such as the Institute for Justice say is troubling about Georgia’s forfeiture laws. For example, Georgia puts property owners in the position of providing the burden of proof to reclaim their property.", "The study, though, does not rank which states have the best or the worst laws.", "So where does this leave us?", "To sum up, Georgians for Forfeiture Reform argues the Peach State has some of the worst civil forfeiture laws in the nation and the worst in the South.", "The claim is based on a recent report by one of the groups lobbying for legislation they believe will be more equitable to Georgians. It does rank Georgia at the bottom nationally, with a few other states. Another report highlights what critics say are some of Georgia’s flaws. Unfortunately, there’s little independent research on how states fare on the topic. The claim is also based on an interpretation of those laws. With these caveats, we rate this claim Mostly True.", "Georgians for Forfeiture Reform news conference, Feb. 20, 2014.", "The Atlanta Journal-Constitution, \"Forfeiture bill clears first hurdle,\" Feb. 6, 2014.", "Email from Dunwoody police Chief Billy Grogan, March 3, 2014.", "Georgians for Forfeiture Reform website.", "Georgia House Bill 1.", "Institute for Justice report on Georgia’s forfeiture laws, January 2013.", "Institute for Justice state-by-state rankings on forfeiture laws.", "Journal of Criminal Justice, \"Civil asset forfeiture, equitable sharing, and policing for proﬁt in the United States,\" 2011.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]