["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Florida Gov. Rick Scott, left, and president and CEO of Garda World Stephan Cretier, laugh during a news conference at the International Economic Forum of the Americas in Montreal, June 8, 2011.", "Fresh off a five-day trade mission to Canada, Florida Gov. Rick Scott was eager to drop a few tidbits about the country's relationship with the Sunshine State.", "In a news conference with the Capitol press corps on June 16, 2011, Scott showed off his Florida-Canada knowledge, claiming that:", "• \"Almost 10 percent of Canadians came to visit Florida last year.\"", "• And, \"they buy 7.4 percent of our homes in the state.\"", "Interesting claims, eh? But true?", "The number of Canadians visiting Florida each year is collected by Visit Florida, the state's official tourism marketing corporation. Visit Florida bases its data on credit card information and statistics supplied the Canadian government. The agency found that about 3.05 million Canadians visited Florida in 2010. That's about 9 percent of the country's total population of about 34 million.", "The Toronto Star noted in a recent story -- based on the Visit Florida data -- that the Canadian boost to Florida's tourism happened even as oil from the Deepwater Horizon disaster threatened Gulf of Mexico beaches.", "So Scott is right about the tourists. But what about Canadian homeowners?", "Scott's press office directed us to a 2010 study on Florida's international home buyers. The study is researched by the National Association of Realtors, which creates an annual report on the country's housing market and additional reports for states with a high rate of sales to foreign buyers. The national group takes a survey of Florida members each year, and that includes a question about foreign clients.", "Florida has the strongest international home sales market in the country. In 2010, foreign clients were responsible for 22 percent of existing home purchases in the state, according to the study.", "\"Florida has consistently been the No. 1 destination among foreign buyers,\" said Lawrence Yun, a National Association of Realtors economist.", "And Canadians are a big part of that distinction. They out-bought all international buyers in 2010, accounting for 36 percent of Florida's foreign sales in 2010. United Kingdom residents are the next-best buyers at 15 percent.", "Sure, residents of the Great White North love the state's beaches and toasty climate. What's more, Yun said, is that these slices of paradise don't cost nearly as much as they used to, and the Canadian dollar is stronger than its weakened U.S. counterpart. There's greater consumer confidence among Canadians, which is not a bad thing for Florida.", "\"It's absolutely helpful,\" Yun said. \"Anytime the market is down, one way to help alleviate the pain or help the healing process is for buyers to come into the market and absorb the inventory.\"", "We wanted to find the percentage of Canadians who bought homes in Florida in 2010. So we multiplied 0.22 (portion of Florida home sales to foreign buyers in 2010) by 0.36 (Canada's share of international sales among foreign buyers) to get 0.0792. That's 7.92 percent.", "Scott's office did not specify how he arrived at 7.4 percent, but he's close enough.", "He's right that there's a clear Canadian infatuation with Florida. As one Canadian-turned-Floridian-real-estate-agent joked in a National Public Radio report on the housing phenomenon, \"If there ever was an 11th (Canadian) province, it probably would be Florida.\"", "Scott has his Canada trivia down cold, and we were unable to find any statistics that contradict him. We rate his claim True.", "St. Petersburg Times/Miami Herald video of Scott's June 16, 2011 press conference", "Interview with Lawrence Yun, National Association of Realtors economist, June 17, 2011", "\"Canadian tourists boost Florida's economy,\" Toronto Star, Feb. 23, 2011", "CIA's World Factbook entry on Canada", "\"In Fla., it's a great time for Canadian homebuyers,\" National Public Radio", "E-mail interview Scott spokesman Lane Wright, June 17, 2011", "Interview with Marla Martin, Florida Association of Realtors spokeswoman, June 17, 2011", "\"Profile of International Home Buyers in Florida,\" National Association of Realtors' 2010 report", "\"Gov. Scott visits Canada on quest to lure jobs to Florida,\" St. Petersburg Times/Miami Herald, June 7, 2011", "E-mail interview with Dia Kuykendall, Visit Florida public affairs manager, June 21, 2011", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]