["About this rating", "An image graphic supposedly documenting the various misdeeds of the \"Pelosi Crime Family\" -- including perjury, securities fraud, and simply being rich -- was circulated on social media in January 2019. We've examined each of the accusations leveled within against House Speaker Nancy Pelosi, her husband, her father, her brother, and her son individually and found them to be largely overstated, misrepresented, or based on unreliable information:", "Was Nancy Pelosi's father, Thomas D'Alesandro, Jr., a constant companion of Benjamin \"Benny Tratta\" Magliano?", "Status: UNPROVEN", "The facts: This claim is a verbatim reproduction of the introductory paragraph of a June 2015 blog post published on the Typepad blog \"Bitterqueen\" by Phillip Crawford, Jr., the author of the 2015 book The Mafia and the Gay, which was reportedly based on FBI files obtained pursuant to the Freedom of Information Act (FOIA).", "Crawford wrote that Peter Galiano, a boxer who was caught up in a draft-dodging scheme in the 1940s, told federal agents in 1947 that D'Alesandro was a \"constant companion\" of the Boston mobster. When the FBI examined these associations in 1961, however, before D'Alesandro received a presidential appointment to the Federal Renegotiation Board, Galiano said that his statements were based on rumor and hearsay and that he couldn't recall where he had come across that information:", "1947: Peter C. Galiano, Baltimore, Maryland, advised that Thomas D'Alesandro was a constant companion of John Cataneo, Benjamin Magliano, also known as Benny Trotta, and [redacted], who were described as \"local big-time gamblers.\" Mr. Galiano stated that these individuals had worked hard for Thomas D'Alesandro's re-election to Congress and in his campaign at that time to become Mayor of Baltimore.", "Peter C. Galiano, Baltimore, Maryland, advised during the current investigation that his previous statements were based only on rumor and hearsay. He stated that he could not recall who gave him this information or whether or not there was any truth to the allegations. He further explained that he was never well acquainted with any of the men he had mentioned and had no personal knowledge of their affairs.", "Galiano wasn't the only person to accuse D'Alesandro of having ties to the Boston mob, but those allegations were never officially corroborated and they never resulted in any charges being brought against D'Alesandro. In fact, D'Alesandro was appointed to the Federal Renegotiation Board by President John F. Kennedy in 1961 despite an FBI investigation into those alleged associations.", "Does Nancy Pelosi own Goat Hill Pizza, a restaurant suspected of harboring trafficking?", "Status: FALSE", "The Facts: Nancy Pelosi does not own a pizza parlor, and Goat Hill Pizza is not suspected of harboring child trafficking by any law enforcement agencies.", "This claim first started circulating in 2016 as part of a larger nonsensical and repeatedly debunked conspiracy theory known as \"Pizzagate,\" in which online trolls asserted that innocuous words such as \"pizza\" and \"cheese\" were actually code words referring to child sex trafficking. Although this conspiracy theory was largely focused on the Washington, D.C,. pizza parlor \"Comet Ping Pong,\" Pelosi was also accused of running her own pedophilia ring back in San Francisco out of Goat Hill Pizza.", "Why? Because a single document from 2004 listed \"Philip@GoatHill.com\" as the email address for Nancy Pelosi. While conspiracy theorists may contend that this tidbit of information is somehow proof that a high-profile politician was running a pedophilia ring out of the basement of a pizza parlor, a much more plausible (and far less sensational) explanation is evident: it was a filing error.", "Philip DeAndrade co-founded Goat Hill Pizza in the 1970s, but by 1987 he was working on Nancy Pelosi's staff. It's likely that DeAndrade accidentally put his own email address, instead of Pelosi's, into a form. Regardless, one spurious appearance of an email address can in no way be construed as proof that Pelosi owns a pizza parlor. Furthermore, the only persons who have suspected this pizza parlor of facilitating child trafficking are online conspiracy theorists and not genuine law enforcement agencies.", "Did Nancy Pelosi hold a secret fundraiser for Islamist and Hamas-linked groups?", "Status: MIXTURE", "The Facts: Despite the wording suggesting that Pelosi hosted a \"secret fundraiser\" to for Islamist- and Hamas-linked groups, this claim refers to a fundraiser held for the Democratic Congressional Campaign Committee. The “Islamist and Hamas-linked groups” portion of the claim is largely based on the fact that Nihad Awad, the co-founder of the Council on American Islamic Relations (CAIR), attended the fundraiser.", "A number of other Muslim groups were also reportedly in attendance at the fundraiser, along with Keith Ellison, the first Muslim to be elected to the U.S. Congress.", "The Daily Caller was among the first to draw attention to Awad's attendance at this fundraiser:", "Democratic leader Rep. Nancy Pelosi headlined a high-dollar fundraiser in May that was attended by U.S.-based Islamist groups and individuals linked by the U.S. government to the Hamas jihad group and to the Egypt-based Muslim Brotherhood movement.", "The donors at the undisclosed May 16 event included Nihad Awad, the co-founder of the Council on American Islamic Relations, according to data provided by the nonpartisan Investigative Project on Terrorism.", "The CAIR group was named an unindicted conspirator in a 2007 trial of a Hamas money-smuggling group.", "While it's true that CAIR was named as an unindicted co-conspirator during the 2007 case of the Holy Land Foundation (HLF), an Islamic charity eventually convicted of funding Islamic militant groups, CAIR was not charged with any criminal activity in connection with that case. Furthermore, CAIR was one of nearly 250 organizations who were given the \"unindicted co-conspirator\" label during the HLF case:", "CAIR is an aggressive Muslim civil liberties organization, modeled on the Anti Defamation League, that has made it a target for criticism. It was indeed named as an “unindicted co-conspirator or joint venturer” in the Holy Land Foundation case -- an Islamic charity that in 2008 was convicted of funding Islamic militant groups. But CAIR was not alone in that designation; nearly 250 other organizations and individuals were also named.", "The federal government said the organizations were included on the list in order to produce evidence at the trial, but the district court and a federal appeals court later ruled that it had been a mistake to make the list public.", "The New York Times also reported that \"unindicted co-conspirators\" on this list were not charged with any crimes:", "Technically, the prosecution can introduce statements made by any individual or organization named as an unindicted co-conspirator without such statements being dismissed as hearsay. Those on the list have not been charged with anything, but they are concerned that the label of unindicted co-conspirator will forever taint them, particularly if the Holy Land group is convicted, and that they will have no legal recourse.", "CAIR, of course, also denied having links to any terrorist organizations.", "So Pelosi and other Democrats held a Democratic fundraiser in 2012 that was attended by a number of leaders from various Muslim groups. While some critics may label groups such as CAIR as \"Hamas-linked,\" that label is disputed.", "Was Nancy Pelosi's son, Paul Pelosi, Jr., charged with securities fraud?", "Status: MOSTLY FALSE", "The Facts: In July 2014, the U.S. Securities and Exchange Commission (SEC) announced they were bringing fraud charges against four individuals involved with the company Natural Blue Resources Inc. Although Paul Pelosi, Jr. did work for that company, he was not one of the individuals charged with securities fraud by the SEC, who didn't even mention Pelosi Jr.'s name when they first announced the charges:", "The Securities and Exchange Commission today announced fraud charges against four individuals and a microcap company for concealing from investors that two lawbreakers ran the company.", "According to the SEC’s orders instituting administrative proceedings, the mission of Natural Blue Resources Inc. was to create, acquire, or otherwise invest in environmentally-friendly companies, including an initiative to locate, purify, and sell water recovered from underground aquifers in New Mexico and other areas with depleting water resources. What investors didn’t know was that two individuals with prior law violations -- James E. Cohen and Joseph Corazzi -- secretly controlled the operational and management decisions of Natural Blue while calling themselves outside “consultants.”", "This arrangement enabled them to be de facto officers of Natural Blue and personally profit from the company without disclosing their past brushes with the law to investors. Cohen, who lives in Windermere, Fla., was previously incarcerated for financial fraud. Corazzi, who resides in Albuquerque, N.M., was previously charged with violating federal securities laws and permanently barred from acting as an officer or director of a public company ...", "The other two individuals charged in the case are Toney Anaya and Erik Perry, who were former chief executive officers at Natural Blue. The SEC’s orders find that they misled investors by failing to disclose that Cohen and Corazzi were running the company in spite of their criminal or disciplinary histories.", "Subsequent SEC filings listed Paul Pelosi, Jr. as President and Board member of Natural Blue from 24 August 2009 to 10 January 2010. So Nancy Pelosi's son was involved with a company that was charged with securities fraud years later, he was never personally charged with a crime.", "Was Nancy Pelosi's brother, Franklin D. Roosevelt D'Alesandro, charged with lying during a rape trial?", "Status: MIXTURE", "The Facts: Nancy Pelosi's brother, Franklin D. Roosevelt D'Alesandro, was charged with perjury during a rape trial in the 1950s. However, he was eventually acquitted of those charges.", "In 1953, D'Alesandro and 13 other youths went on trial in Baltimore for \"moral charges\" involving two young girls, aged 11 and 14. D'Alesandro, who was 20 at the time and was charged with statutory rape, testified that he had never seen the victims before. Although he was eventually acquitted of the rape charges (he was the only defendant to be acquitted during the trials), he was later charged with perjury.", "The Denton Journal reported at the time that \"The perjury charge resulted from that trial. The state contended D'Alesandro lied in denying he had ever seen the girls before, or had been in a car with three other youths who testified at their trials he was with them.\"", "Just as with the rape charges, however, D'Alesandro was eventually acquitted of the perjury charges:", "A jury of four women and eight men deliberated 6 hour and 16 minutes here last night before acquitting Franklin Roosevelt D'Alesandro, 21-year-old son of Baltimore's mayor, of a perjury charge. The \"not guilty\" verdict, delivered in a loud voice by Mrs. Stella B. Hughes, jury foreman, to a tension-taught crowd in Wicomico County Circuit Court, ended a 5-day trial.", "Young D'Alesandro, calm and poised throughout the long hours of testimony and argument and seemingly endless wait on the verdict, was jubilant when he heard the decision. After receiving a kiss on the hand from his fiancee and hugs and kisses from his crying mother, D'Alesandro planted a kiss on the cheek of Joseph Sherbow, former Baltimore Circuit Court judge, who headed the defense staff. It was Sherbow who successfully defended young D'Alesandro on a statutory rape charge in Baltimore last November when he was the only one of 16 defendents to be acquitted in a series of morals trials resulting from sex charges brought by two young girl cousins ..", "\"In order to acquit this defendant,\" Asst. State's Atty. J Harold Grady said. \"You must be convinced these eight witness who appeared before you entered into a conspiracy and made up their story out of whole cloth.\"", "The defense countered that the only evidence of contraindications came from a \"parade of trash.\" Chief witness for the defense Mary Ann Jankowski, 20-year-old petite blonde fiancee of the defendant. She testified that at the time of the alleged sex offenses last July, young D'Alessandro spent every evening with her and her parents.", "Although it's possible that D'Alessandro's political power had something to do with his acquittal (whether directly or indirectly), the fact of the matter is that he was found not guilty of any crimes.", "Nancy Pelosi's husband Paul has a net worth of over $200 million?", "Status: UNPROVEN", "The Facts: Nancy Pelosi's husband Paul is indeed a successful businessman and investor, but the claim that he has a net worth of $202 million (which has nothing to do with criminal activity) appears to be based on a misreading of a 2015 article published by the National Review. The conservative publication reported at the time that Pelosi (not specifically her husband) listed assets worth between $43.4 million and $202 million on her 2014 financial disclosure forms:", "Though financial-disclosure forms list only ranges of assets and liabilities, Pelosi listed between $42.4 million and $199.5 million in assets in 2013, which was enough for Bloomberg Business to deem her the richest member of House leadership from either party. By 2014, she and her husband, investment banker Paul Pelosi, were doing even better: She reported between $43.4 million and $202 million in assets.", "The \"Pelosi Crime Family\" meme refers to the highest possible figure within a very broad range and incorrectly refers to this number as Pelosi's net worth. However, the figure actually states the estimated value of Pelosi's assets and doesn't offset it with other financial aspects such as debt:", "[T]he financial disclosures don’t just show substantial assets -- the Pelosis have gone into lots of debt, too. Pelosi and her husband are currently paying mortgages on seven properties, totaling between approximately $9.8 million and $46.5 million in 2014, likely accruing big tax savings in the process. The couple also opened home-equity lines of credit on four of these properties, adding between approximately $1.7 million and $6.5 million to their liabilities.", "A 2015 Politico article reported Pelosi's net worth at around $30 million.", "Sherman, Jake.   \"Boehner's Condo, Pelosi's Vineyard: A Peek at Leaders' Wealth.\"\r\n    Politico.   15 June 2015.", "Denton Journal.   \"Wicomic Jury Acquits D'Alesandro of Perjury.\"\r\n    28 May 1954.", "Rogers, Brooke   \"Nancy Pelosi’s Life in the 0.1 Percent.\"\r\n    The National Review.   1 July 2015.", "Munro, Neil.   \"Pelosi Holds Secret Fundraiser with Islamists, Hamas-Linked Groups.\"\r\n    The Daily Caller.   2 November 2012.", "The News.   \"Youths Trial Underway In Baltimore.\"\r\n    30 October 1953.", "SEC.gov.   \"SEC Announces Charges in Scheme to Secretly Enable Lawbreakers to Run Microcap Company.\"\r\n    16 July 2014.", "SEC.gov.   \"SEC Announces Charges in Scheme to Secretly Enable Lawbreakers to Run Microcap Company.\"\r\n    16 July 2014.", "Kessler, Glenn.   \"The King Hearings: Is CAIR a 'Terrorist Organization?'\"\r\n    The Washington Post.   10 March 2011.", "Lindsey, Robert.   \"20 Years After a 'Summer of Love,' Haight-Ashbury Looks Back.\"\r\n    The New York Times.   2 July 1987.", "Aischm Gergor.   \"Dissecting the #PizzaGate Conspiracy Theories.\"\r\n    The New York Times.   10 December 2016.", "Crawford, Phillip.   \"FBI Files: Congresswoman Nancy Pelosi's Father Thomas D'Alesandro Jr. Was 'Constant Companion' of Notorious Mobster Benjamin Magliano.\"\r\n    BitterQueen.   4 July 2015.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]