["Comments Joe Biden made about busing students to integrate schools that first surfaced in 2019 are again being shared on Facebook, this time in an image of a post from a website supportive of President Donald Trump.", "The headline says: \"1977: Biden said integrating black students would turn schools into ‘a jungle… a racial jungle.’\"", "There’s a photo of the presumptive Democratic presidential nominee and this quote attributed to him: \"I don’t want my children to grow up in a jungle, a racial jungle.\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The quote is close to something Biden said, but the Facebook post is missing context..", "First, he wasn’t speaking broadly about integrating Black and white Americans. He was talking about busing to integrate public schools. The post on the pro-Trump site cites a July 2019 tweet from New York Times reporter Sheryl Gay Stolberg, who said that a University of Southern California law professor had spotted this quote from Biden:", "\"Unless we do something about this, my children are going to grow up in a jungle, the jungle being a racial jungle with tensions built so high that it is going to explode at some point. We have got to make some move on this.\"", "Stolberg put that comment in context, tweeting that Biden \"warns that unless there is ‘orderly integration’ (he favored housing, not busing), ‘My children are going to grow up in a jungle, the jungle being a racial jungle.’\" She linked to a story she wrote with her colleague Astead Herndon titled: \"How Joe Biden became the Democrats’ anti-busing crusader.", "Then-Sen. Biden was speaking in a 1977 congressional hearing on busing schoolchildren and opposed federally mandated busing. (His \"racial jungle\" comment is on page 251 of the hearing transcript.)", "Addressing Jack Greenberg, director-counsel for the NAACP Legal Defense and Educational Fund, Biden said: \"We have a fundamental disagreement, you and I, I suspect, as to what is needed to insure that we do have orderly integration of society. I am not just talking about education but all of society.\"", "Biden went on to reference a \"racial jungle\" and then said that \"pushing busing in a way in which it goes beyond the constitutional mandates is like throwing a rock through the civil rights window. I think it has repercussions that are extensive in terms of the ultimate objective of seeing that we get integrated neighborhoods, of seeing that we eventually eliminate job discrimination, of seeing that we change housing patterns, of seeing alteration of tax structure.\"", "A year earlier, in 1976, Biden introduced legislation to prevent the Justice Department from pursuing desegregation cases that could result in court-ordered busing, the New York Times reported.", "\"I oppose busing, to the chagrin of some of my liberal colleagues,\" he said at the time. He also supported several bills that year designed to stop federal judges from issuing busing orders, according to the Times.", "Biden never opposed voluntary busing, according to the Times. But in their investigation into Biden’s history with busing, Herndon and Stolberg describe how the former vice president’s opposition to court-ordered busing \"was far more sweeping than he has led voters to believe.\"", "As a young senator, Biden emerged as the Democratic Party’s \"leading anti-busing crusader,\" the story says, \"a position that put him in league with Southern segregationists, at odds with liberal Republicans and helped change the dynamic of the Senate, turning even some leaders in his own party against busing as a desegregation tool.\"", "Biden argued that housing integration was a better way to desegregate public schools though it would take much longer to implement than a busing plan, the story says.", "In 1974, as \"anti-busing fervor\" led to crowds throwing bricks and rocks at buses with Black children, the story says, Biden said he had become \"more and more disenchanted with busing as a remedy.\"", "In 1975, he objected to the federal government requiring desegregation without a court order, saying that it would lead to white flight and racial unrest, the story says.", "In 1976, the Times reported, Biden introduced legislation to prevent the Justice Department from pursuing desegregation cases that could result in court-ordered busing, \"alarming lawyers in its Civil Rights Division.\"", "During a Democratic presidential debate last year, Sen. Kamala Harris, D-Calif., challenged Biden on his busing position. Biden has since said that he has always favored \"using federal authority to overcome state-initiated segregation\" and \"never, never, never ever opposed voluntary busing.\" But in fact, few districts were voluntarily desegregating schools through busing, which is why courts stepped in.", "Biden’s current positions include plans to close racial wealth and income gaps, reduce racial disparities in health and education, and enact reforms to the criminal justice system.", "RELATED: The Democratic debate resurrected controversy over busing. But is it an issue today?", "Our ruling", "The Facebook post says that in 1977, Biden said integrating black students would turn schools into ‘a jungle… a racial jungle.’\"", "That’s not quite right. In 1977, Biden, who opposed court-ordered busing to integrate public schools, said: \"Unless we do something about this, my children are going to grow up in a jungle, the jungle being a racial jungle with tensions built so high that it is going to explode at some point.\"", "He advocated for \"orderly integration,\" specifically integrating housing, and he supported many other aspects of desegregation and civil rights. But, as the New York Times reported, Biden also pushed an \"anti-busing agenda into the early 1980s.\"", "We rate this Facebook post Half True.", "Facebook post, June 23, 2020", "Teamp Trump USA, 1977: Biden said integrating black students would turn schools into ‘A jungle… A racial jungle,’ May 23, 2020", "Sheryl Gay Stolberg tweet, July 15, 2019", "The New York Times, How Joe Biden became the Democrats’ Anti-busing crusader, July 15, 2019", "Business Insider, Joe Biden worried in 1977 that certain de-segregation policies would cause his children to grow up ‘in a racial jungle,’ July 15, 2019", "The New York Times, A brief history of Joe Biden and school busing, July 15, 2019", "U.S. Judiciary Committee hearing transcript, Busing of Schoolchildren, June 15 and 16 and July 21 and 22, 1977", "Politico, Biden supports push in Congress to end 1970s-era school busing restriction, July 12, 2019", "PolitiFact, Joe Biden oversimplifies his school busing record in Miami debate, June 28, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]