["By Brooks Jackson", "Posted on November 15, 2018", "The Republican National Committee and others have taken to claiming that the number of job openings exceeds the number of job seekers for the first time “in history,” a sweeping claim that is without factual support, and likely false.", "It’s true that the number of unfilled job openings is now greater than the number of unemployed people for the first time on record, but records only go back 18 years. Despite what some GOP spinmeisters would have you believe, “history” didn’t start in December of 2000.", "That’s when the Bureau of Labor Statistics began its Job Openings and Labor Turnover Survey. And BLS says, “Prior to JOLTS, there was no economic indicator of the unmet demand for labor with which to assess the presence or extent of labor shortages in the United States. ”", "Make no mistake, it’s remarkable when job openings exceed the number of jobless, as happened back in March, and several times since. And we noted that at the top of our July 11 update of “Trump’s Numbers.”", "But that fact has evolved into an economic fairy tale as Republicans have made progressively more sweeping boasts about it.", "A week after our report, on July 18, President Donald Trump declared at a White House event, “Job openings exceed the number of unemployed people in our country for the first time in recorded history.”", "Trump didn’t mention that “recorded” history only goes back 18 years in this case. His use of the word “recorded” is a good example of a “weasel word” — a qualifier that sucks the meaning out of a phrase in the way that weasels supposedly suck the contents out of an egg.", "But one week later, on July 26, Trump stood by at an Iowa event while Republican Rep. Rod Blum dropped that qualifier and said flatly, “So the first time — the first time, my friends, in our country’s history, we have more job openings — more job openings than we have workers to fill them. First time in our country’s history.”", "And more recently, on Oct. 31, Trump stood by again while his daughter and adviser Ivanka Trump also dropped the qualifier once more and said, “And for the first time in history, we have more vacant jobs than we have unemployed workers to fill them.”", "There’s no data to support that claim, and good reason to think it is false. During the Korean War, for example, the unemployment rate was at or below the current 3.7 percent for all of 1951, 1952 and the first 11 months of 1953. It reached 2.5 percent in May and June 1953.", "So we know there was a smaller share of people seeking work then than now. Could that be true if there were not plenty of unfilled job openings as well? We don’t think so.", "Even earlier, during World War II, the demand for wartime workers drew women into the workforce in previously unimagined numbers, and into previously all-male jobs. “Rosie the Riveter” might well have been as skeptical of Ivanka Trump’s claim as we are.", "And what of the booming economy of the “Roaring 20s,” when by some estimates unemployment dropped to 2.9 percent, much lower than today?", "Yet this GOP talking point lives on, as in this Nov. 13 mis-tweet from the Republican National Committee, grandly claiming that job openings exceed job seekers “for the first time in our nation’s history.” It’s unsupported, and probably false.", "“Our nation currently boasts more than seven million open jobs — more than the entire population of the state of Massachusetts. For the first time in our nation’s history, there is more than one job opening for every American who’s looking for work.” –@senatemajldr", "— GOP (@GOP) November 13, 2018", "If Republicans wish to be factual when boasting about the economy, they should stick to saying job openings exceed job seekers for the first time “on record,” and drop the grand claims about “history.”", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]