["Part of the May 31, 2012 gubernatorial recall debate focused on an ongoing John Doe criminal investigation into Republican Gov. Scott Walker’s time as Milwaukee County executive.\n\nWalker has created a criminal defense fund to pay attorneys but has maintained he is not a target of the secret probe, which is being conducted by the Milwaukee County district attorney’s office. The probe has led to criminal charges against three former Walker aides, an appointee and a major campaign contributor.\n\nWalker’s challenger in the June 5, 2012 election, Democrat and Milwaukee Mayor Tom Barrett, alluded to the charges when he said: \"I have a police department that arrests felons. He (Walker) has a practice of hiring them.\"\n \nTo be sure, felony charges are among those pending, but none involving Walker aides or the appointee has yet resulted in a felony conviction.\n\nA few minutes later Barrett fired again:\n\n\"I just want to say I’ve been in public life for 28 years,\" said Barrett, who served in the state Legislature and Congress before becoming Milwaukee mayor in 2004, \"and no one on my staff has ever been charged with a crime, and I’ve never had a criminal defense fund.\"\n\nA quick Google search, however, found a Milwaukee Journal Sentinel news article reporting that Joseph N. Cantu, a receptionist in Barrett’s mayoral office, was charged in May 2010 with suffocating his ex-girlfriend.\n\n\"These are shocking and serious charges,\" Patrick Curley, Barrett's chief of staff, said at the time.\n\nCourt records show Cantu was charged with two felonies and a misdemeanor, but pleaded guilty to three misdemeanors: disorderly conduct and two counts of battery. He was sentenced to two years of probation and 90 days in jail.\n\nWe were not able to do a complete search of all his staffers in all his past offices, but this alone contradicts the claim.\n\nBarrett campaign spokesman Phil Walzak told the Journal Sentinel there is a big difference between an office receptionist being charged with a crime outside of work and the job-related charges faced by Walker aides in the Doe probe.\n\nHowever, in making the claim, Barrett made no such distinction.\n\nOur rating\n\nBarrett said flatly \"no one on my staff has ever been charged with a crime.\" His receptionist was charged in 2010 with battery and was convicted.\n\nWe rate Barrett’s statement False.", "(You can comment on this item on the Journal Sentinel website.)", "WISN.com, Scott Walker-Tom Barrett debate (at 6:05 and 10:00), May 31, 2012\n\nEmail interview, Scott Walker campaign spokeswoman Ciara Matthews, June 1, 2012\n\nWisconsin Circuit Court Access, Joseph N. Cantu court records\n\nMilwaukee Journal Sentinel, \"Walker’s office stonewalled DA inquiry, record shows,\" May 31, 2012\n\nMilwaukee Journal Sentinel, \"Mayor’s reception charged in domestic violence incident,\" May 24, 2010\n\nMilwaukee Journal Sentinel, \"More on Barrett’s statement about aides and crimes,\" June 1, 2012", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]