["By Robert Farley", "Posted on July 22, 2016", "Donald Trump doubled down on his baseless insinuation that a photograph published by the National Enquirer shows Ted Cruz’s father with “crazy Lee Harvey Oswald having breakfast.”", "A day after accepting the Republican presidential nomination, Trump touted the national tabloid as a credible source worthy of a Pulitzer Prize, and said the newspaper would not have run the photo if it was “wrong.” Moreover, Trump said, the Cruz camp “never denied” that it was Rafael Cruz in the photo with the man who assassinated President John F. Kennedy.", "That’s all nonsense.", "As we wrote on May 3, the thinly sourced story hangs largely on comments from an expert who told the paper that a photo of an unidentified man handing out pro-Fidel Castro leaflets with Oswald has “more similarity than dissimilarity” with a passport photo of Cruz’s father, Rafael.", "The photo expert, Mitch Goldstone, president and CEO of ScanMyPhotos, a California-based digitizing photo service, was quoted in the Enquirer story — “Ted Cruz Father Linked to JFK Assassination!” — as saying, “[I]t looks to be the same person and I can say as much with a high degree of confidence.”", "Note the parsing of words. He wasn’t saying with a high degree of certainty that it is Rafael Cruz. He’s saying with a high degree of certainty that it “looks to be the same person.”", "Goldstone told us in a phone interview that he never claimed the man in the picture with Oswald was definitely Rafael Cruz, and he called Trump’s unqualified assertion that it is Cruz “stupid.” Goldstone said he compared, by eye, the photo of the unidentified man in the picture with Oswald with a passport photo of a young Rafael Cruz, and concluded “They look pretty close.”", "That’s the thin reed upon which this story hangs.", "Nonetheless, Trump proclaimed in a May 3 interview on “Fox and Friends” that Cruz’s “father was with Lee Harvey Oswald prior to Oswald’s being, you know, shot! I mean, the whole thing is ridiculous … And nobody even brings it up. I mean, they don’t even talk about that, that was reported and nobody talks about it. But I think it’s horrible, I think it’s absolutely horrible, that a man can go and do that, what he’s saying there.”", "Trump later added, “I mean what was he doing with Lee Harvey Oswald, shortly before the death – before the shooting? It’s horrible.”", "The day after his controversial convention speech, Cruz said those comments by Trump played a role in his decision not to endorse Trump.", "“I am not in the habit of supporting people who attack my wife and who attack my father,” Cruz said.", "The day after his convention speech, in remarks to supporters in Cleveland, Trump fired back at Cruz, saying, “I don’t want his endorsement. If he gives it, I will not accept it.” Trump then launched into a defense of an unflattering image of Cruz’s wife that Trump retweeted,  as well as his comments about Cruz’s father.", "“All I did is point out the fact that on the cover of the National Enquirer, there’s a picture of him [Rafael Cruz] and crazy Lee Harvey Oswald having breakfast,” Trump said. “I had nothing to do with it. This was a magazine that frankly in many respects, should be very respected. They got O.J. They got Edwards. They got this. I mean, if that was the New York Times, they would have gotten Pulitzer prizes for their reporting.”", "Although Trump said the photo showed the two “having breakfast,” the picture in question actually shows Oswald distributing pro-Castro literature in New Orleans in August 1963, a few months prior to Kennedy’s assassination in Dallas. According to the Miami Herald, another man in the picture was never identified by the Warren Commission, whose investigation concluded Kennedy was assassinated by Oswald and that Oswald acted alone.", "In his post-convention remarks, Trump said the whole issue “had nothing to do with me, except I might have pointed it out.” No “might” about it. Trump did “point it out” on national TV, and he definitively proclaimed the man in the picture to be Rafael Cruz, even though the text of the National Enquirer story doesn’t go quite that far.", "Trump went on to say that neither Cruz nor anyone in his camp ever denied that it was Rafael Cruz in the photo.", "“Now, Ted never denied that it was his father,” Trump said in his post-convention remarks, adding later, “But they never denied. Did anybody ever deny that it was the father? They’re not saying, ‘Oh, that’s not really my father.’ It’s little hard to do. It looks like him.”", "In fact, they have.", "“This is another garbage story in a tabloid full of garbage,” Communications Director Alice Stewart told McClatchy. “The story is false; that is not Rafael in the picture.”", "“It’s ludicrous, it’s ludicrous,” Rafael Cruz told ABC News on May 3. “I was never in New Orleans at that time.”", "Ted Cruz dismissed the Enquirer story as “idiotic” and called Trump a “pathological liar” who is “utterly amoral” and a “bully.”", "“Donald Trump alleges that my dad was involved in the assassinating JFK,” Cruz said. “Now, let’s be clear, this is nuts. This is not a responsible position. This is just kooky.”", "As for Trump’s claim that the unidentified man in the photo with Oswald “looks like” Rafael Cruz, experts told us not to put much stock in that kind of assessment.", "Anil Jain, a computer scientist and expert on facial recognition and biometric identification at Michigan State University, told us the images are of a poor quality, black and white, and grainy, and that “It would be very difficult, even for a photo expert, to extract facial attributes.” Any conclusion about similarities is subjective, he said.", "So to sum up: despite Trump’s claim to the contrary, the Cruz campaign categorically denied that it is Rafael Cruz in the photo. And Ted Cruz called the Enquirer story “nuts.” And there is still no evidence — at all — that the man in the photo with Oswald is Rafael Cruz.", "https://www.sharethefacts.co/share/9a194e4c-4486-4024-8e6d-d94124b8932f", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]