["The photo was published in this Facebook post on June 20, 2019. It has been shared more than 300 times.", "The post's caption says: “Planned by CM Modi, inaugurated by PM Modi, Jamnagar-Junagadh highway bridge collapsed within 3 months of inauguration!!”", "PM Modi refers to Indian Prime Minister Narendra Modi, who was Chief Minister (CM) of Gujarat from 2001 to 2014 before becoming India's prime minister.", "Jamnagar and Junagadh are two cities in the western Indian state of Gujarat and the Jamnagar-Junagarh highway connects them by road.", "Below is a screenshot of the Facebook post:", "The same photo and claim was also shared elsewhere on Facebook, for example here and here, and the West Bengal unit of India’s opposition Indian National Congress party also shared the photo on its Facebook page here with a similar claim.", "The claim is false; satellite images show the bridge has been operational for over a decade and local officials said it was never inaugurated by Prime Minister Modi.", "A Google keyword search found multiple local media reports in Gujarati language containing similar images of the collapsed bridge, for example, here, here and here.", "Local television channel TV9 Gujarati published this report on June 19, 2019 about the bridge collapse.", "The Gujurati headline translates to English as: “Years-old bridge on the Jamnagar-Junagadh Highway suddenly collapsed, but no casualties caused.”", "The report also contains a video of the collapsed bridge. A screenshot of the video corresponds with the collapsed bridge shown in the misleading Facebooks posts.", "Below is a comparison screenshot of the video published on TV9 Gujarati website (R) and photo posted in the Facebook post (L) with a similar portion highlighted in blue:", "Using location details from the multiple media reports, AFP found satellite images of the bridge using mapping tool Google Earth Pro.", "Below is the most recent satellite image of the bridge, taken in November 2018:", "The oldest available satellite image of the bridge is dated October 26, 2009:", "Local Sub-divisional magistrate, GK Miyani, told AFP by phone on June 24, 2019: “The bridge was around 50 years old and collapsed due to heavy vehicular movement on the busy Jamnagar-Junagadh Highway.\"", "\"PM Modi has not visited the area recently, so there is no question of him inaugurating the bridge here,” he added.", "Indian fact check website Boom Live debunked the same misleading Facebook posts in this report.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]