["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Is the United States really obligated to be the world’s bodyguard?", "Speaking on Meet the Press on June 5, Libertarian presidential candidate Gary Johnson said that the United States is already committed — without congressional approval — to protecting the borders of 69 other countries (about one-third of the world).", "\"We've got treaties with apparently 69 countries where we are obligated to defend their borders. And these were treaties that were executive treaties, not authorized by Congress,\" Johnson said.", "Johnson’s claim itself isn’t new. He made the claim on CNN’s New Day on May 31 and Donald Trump tweeted the same claim May 29. Trump has also made the United States’ role protecting other countries a talking point this election, leaving open the possibility of disbanding the North Atlantic Treaty Organization if other countries fail to contribute their fair share.", "We wanted to look closer into Johnson’s claim about the United States’ current obligations to other nations. The statement warrants examination on multiple grounds:", "1. The number of countries involved through formal treaties;", "2. Whether Congress had a say in the treaties;", "3. Are these provisions actually used?", "We reached out to the Johnson campaign but did not get a response back.", "United States treaties", "A paper published by Tufts University professor Michael Beckley in 2015, The Myth of Entangling Alliances, contains Johnson’s 69-country figure. In his analysis, Beckley counts the Organization of American States, NATO and various other treaties as collective defense arrangements.", "We found that other sources include fewer countries. The State Department only counts 54.", "We analyzed all of the treaties Beckley cites and compared it to U.S. Department of State records.", "The Charter of The Organization of American States created the OAS — an organization that aims for regional solidarity in the Americas — and was approved by the Senate in 1951. The OAS Charter treaty pledges the United States to support 33 countries through collective security provisions in Articles 28 and 29, according to Beckley.", "Those countries include — Antigua & Barbuda, Argentina, the Bahamas, Barbados, Belize, Bolivia, Brazil, Chile, Colombia, Costa Rica, Cuba, Dominica, the Dominican Republic, Ecuador, El Salvador, Grenada, Guatemala, Guyana, Haití, Honduras, Jamaica, Mexico, Nicaragua, Panama, Paraguay, Perú, St. Kitts & Nevis, St. Lucia, St. Vincent, Suriname, Trinidad & Tobago, Uruguay and Venezuela.", "Beckley’s analysis also includes 28 countries as part of NATO, which was created by the North Atlantic Treaty and approved by the Senate on July 21, 1949. Article V of the NAT provides for collective defense.", "In that list, Beckley includes — Albania, Belgium, Bulgaria, Canada, Croatia, the Czech Republic, Denmark, Estonia, France, Greece, Hungary, Iceland, Italy, Latvia, Lithuania, Luxembourg, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Turkey, United Kingdom, West Germany and Germany.", "Those two agreements count for 61 of the 69 countries Johnson cited. Both were approved by the Senate, but more on that later.", "Next, Beckley cites the Australia, New Zealand, United States Security Treaty of 1951, which was also approved by the Senate on March 20, 1952.", "That makes countries 62 and 63.", "Beckley also includes Japan as country 64 through a bilateral U.S.-Japan treaty (approved by the Senate on March 20, 1952), South Korea (65) through a mutual defense treaty (approved by the Senate on January 26, 1954), and the Philippines (66) through a mutual defense treaty (approved by the Senate on March 20, 1952).", "He also cites a bilateral defense agreement with Pakistan (67) on March 5, 1959. According to Dennis Kux in his book on U.S.-Pakistan relations, this was an \"executive agreement\" — a different type of treaty not sent to the Senate for approval. Pakistan has since accused the United States of not honoring the agreement, Kux wrote.", "Israel (68) and Taiwan (69) are also on Beckley’s list. He includes Israel because he claims the United States has a \"de facto\" agreement to defend it (not a formal treaty). The Taiwan Relations Act, passed by Congress in 1979, requires the United States to provide defense assistance to Taiwan.", "Adding all of these up gets to the 69 figure Johnson used on Meet The Press.", "The official Department of State website, however, has a different number of collective defense arrangements — only 54 countries. The State Department excludes West Germany, Pakistan, Israel and Taiwan from Beckley’s list and also adds Thailand due to the Southeast Asia Collective Defense Treaty — which created the Southeast Asia Treaty Organization and was approved by the Senate on Feb. 1, 1955.", "The main difference, however, is that the State Department does not include all the countries in the OAS Charter. Rather, it only includes members of the affiliated Inter-American Treaty of International Assistance (Rio Treaty), a collective defense treaty with fewer members than the OAS Charter.", "Julian Ku, Maurice A. Deane distinguished professor of constitutional law at Hofstra University, agreed with the State Department’s assessment. Ku did note, however, that these determinations have not been actively discussed since the Cuban Missile Crisis in the 1960s.", "\"The OAS Charter is not what we would call a mutual defense treaty,\" he said. \"It is not a treaty obligation to defend every member of the OAS Charter.\"", "Beckley told PolitiFact he used all the OAS countries primarily for methodological reasons.", "There’s another wrinkle to this count. Some countries the State Department included as part of the Rio Treaty — Bolivia, Ecuador, Nicaragua and Venezuela — have recently denounced the treaty. Cuba has also announced it will not be rejoining the OAS, making its status within the Rio Treaty unclear. Lastly, SEATO — containing Thailand — disbanded in 1977.", "Add it all up and what do you get?", "It’s reasonable to say the United States has obligations to defend anywhere from around 48 countries to close to 70.", "Did Congress have a say?", "The second part of Johnson’s claim — that all were \"executive treaties\" without congressional approval — does not stand up to scrutiny. The Senate approved all of the pertinent treaties through its \"Advice and Consent\" procedure under Article II, section 2 of the Constitution (with the exception of the Pakistan 1959 agreement).", "Michael Ramsey, an international law professor at the University of San Diego, told PolitiFact that Johnson could be considered \"technically correct\" because the House of Representatives does not consider the issue. Nonetheless, Ramsey explained, Johnson’s claim is misleading because nothing \"improper\" was done.", "\"The Constitution expressly provides that treaties are to be approved by two-thirds of the Senate (and not the House),\" he wrote. \"Thus there is nothing improper occurring here, and it is not the case that these agreements are being done on executive authority alone.\"", "Beckley told PolitiFact that many treaties require action consistent with each nation’s constitution, such that Congress would still have a say before an actual intervention.", "Relevance", "Johnson’s phrasing of \"defend their borders\" could be misleading as well, making it seem that the United States has a more general and ongoing policy than it does. Just how strong an \"obligation\" the United States has is also questionable, experts said.", "The treaties in question only require other member states to get involved if one country is attacked, which is rare.", "\"Look at those countries. Very few are under threat of attack,\" wrote Douglas Gibler, a professor of political science at the University of Alabama, in an email.", "In addition, Beckley noted that the treaties do not require the United States to take immediate action and that the treaties often do not specify what such action would look like. The Rio Treaty, for example, provides \"no State shall be required to use armed force without its consent.\"", "\"The OAS Charter doesn’t say the U.S. has to go in guns blazing to defend its allies to the death everytime someone comes under attack,\" Beckley said. \"The language is super vague with a lot of loopholes in it, so when Johnson says that the U.S. has an ironclad obligation to protect the country that’s more than a bit of a stretch.\"", "Ku noted as well that neither the OAS Treaty or the Rio Treaty have been actively invoked since the 1960s.", "Our ruling", "Gary Johnson claimed that the United States is obligated to \"defend the borders\" of 69 countries by treaties, and that Congress did not have a say in the matter.", "Johnson’s reference to \"69 countries\" is in the ballpark. However, he fails to include in his statement the nuance regarding how much action the United States would actually be compelled to take under these treaties, according to experts. Johnson is also wrong to say that Congress had not considered any of these treaties, because the Senate considered all but one pursuant to its constitutional powers.", "We rate this claim Mostly False.", "https://www.sharethefacts.co/share/9fc80cb6-ce8d-4630-93a7-2af99cff41fa", "The Washington Post, \"Map: The U.S.  is bound by treaties to defend a quarter of humanity,\" May 30, 2015", "International Security, \"The Myth of Entangling Alliances,\" Spring 2015", "Foreign Policy, \"Senators Slam NATO ‘Free-Riders’ in Closed-Door Meeting With Secretary General,\" April 6, 2016", "The Hill, \"Trump’s NATO criticism wins positive reviews,\" April 6, 2016", "PolitiFact, \"Donald Trump wants to pull the U.S. out of NATO, Hillary Clinton says,\" April 1, 2016", "Meet the Press, \"Transcript,\" June 5, 2015", "United States Senate, \"Treaties\"", "Donald Trump’s personal Twitter account, May 28, 2016", "Email Interview, Douglas Gibler, professor of political science, University of Alabama, June 6, 2016", "Email Interview, Michael Ramsey, professor of law, University of San Diego, June 6, 2016", "Phone Interview, Michael Beckley, professor of political science, Tufts University, June 6, 2016", "Phone Interview, Julian Ku, Maurice A. Deane distinguished professor of constitutional law, Hofstra University, June 7, 2016", "Organization of American States, \"Charter of the Organization of American States (A-41)\"", "Organization of American States, \"B-29: Inter-American Treaty of Reciprocal Assistance (Rio Treaty)\"", "Organization of American States, \"A-41: Charter of the Organization of American States\"", "United Nations, \"Charter of the Organization of American States\"", "Organization of American States, \"Inter-American Treaty of Reciprocal Assistance\"", "North Atlantic Treaty Organization \"The North Atlantic Treaty,\" March 21, 2016", "The New York Times, NATO 50th Anniversary,\" 1999", "Yale Law School, \"Security Treaty Between the United States, Australia, and New Zealand (ANZUS); September 1, 1951\"", "Yale Law School, \"Security Treaty Between the United States and Japan; September 8, 1951\"", "Yale Law School, \"Mutual Defense Treaty Between the United States and the Republic of Korea; October 1, 1953\"", "Yale Law School, \"Southeast Asia  Collective Defense Treaty (Manila Pact); September 8, 1954\"", "Library of Congress, \"Reciprocal Assistance (Rio Treaty)\"", "Yale Law School, \"Mutual Defense Treaty Between The United States and The Republic of The Philippines; August 30, 1951\"", "American Institute in Taiwan, \"Taiwan Relations Act\"", "New Day, \"Gary Johnson: Why you should vote Libertarian,\" May 31, 2016", "Dennis Kux, \"The United States and Pakistan, 1947-2000: Disenchanted Allies,\" June 2001.", "Department of State, \"U.S. Collective Defense Arrangements\"", "Office of the Historian, \"Southeast Asia Treaty Organization (SEATO), 1954\"", "BBC News, \"Cuba will never rejoin OAS over Venezuela row, says Castro,\" June 5, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]