["Irfan Khan, former district president of National Students’ Union of India (NSUI), the student wing of Congress, posted a video of a man breaking down into tears as his cycle rickshaw is seized by cops. The viral video is superimposed with Bengali text. Khan posted it claiming, “The law of this country is only for poor peoples..!” This video, with watermark ‘Page: JONY’, has over 50,000 views and over 2,000 retweets. (archived link)", "The Law of this country is only for poor peoples..! 😭 pic.twitter.com/qygZQZWfKW", "— Irfan khan (@irfankhan_nsui) October 9, 2020", "This video is viral on Twitter and Facebook.", "Images of the same man were tweeted by actor Ajaz Khan. But he did not specify where the pictures were shot. “Extremely touching scene – He is perhaps saying, sir what did you get by snatching my daily bread that I earned and not begged for. (बहुत ही मार्मिक दृश्य – शायद यह कहना चाह रहा हो की क्या मिला साहब मेरी रोजी रोटी छीन के खुद कमाता था कोई भीख थोड़े मांगता था.)” – read his tweet gaining over 3,500 retweets. (archived link)", "We noticed that several people pointed out that the video is from Bangladesh while others assumed it’s from India.", "This slideshow requires JavaScript.", "A reporter in the video is holding a mic of Bangladesh-based Jamuna TV.", "Keeping this in mind we performed a keyword search on Google and found October 9 reports by Asianet Bangla, Dhaka Tribune, Business Standard Bangla, and Times Now.", "This slideshow requires JavaScript.", "As per the reports, the rickshaw puller is Fazlur Rahman whose newly-purchased electric rikshaw was seized by Dhaka South City Corporation (DSCC) during an eviction drive on October 5. He had bought the rickshaw with a loan after losing his job due to the COVID-19 economic slowdown.", "During the eviction, two more rickshaw drivers lost their vehicles. DSCC had launched an operation to evict battery-powered rickshaws in the Jigatala area. As per Times Now, Facebook user Sakib Rahman posted a video of Rahman which got viral. Bangladeshi politician and lawyer Ahsan Bhuiyan saw the video and helped him get new rickshaws. Alt News found a Facebook post by Bhuiyan where he shared a photograph of Rahman and a screenshot of an article by BDNews24.", "আমরা চাইলেই বদলে দিতে পারি। নতুন রিক্সা অর্ডার দিয়ে বাসায় যাচ্ছি। পরশু ডেলিভারি।", "Posted by Ahsan Bhuiyan on Tuesday, 6 October 2020", "The images posted by Ajaz Khan were published by Bangladesh-based BDNews24. A video and images of a rickshaw driver from Bangladesh have gone viral in India thus giving the impression that his vehicle was seized in West Bengal as people can be heard speaking in Bengali.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "Trigger Warning: Sexual Violence A distressing video of a girl forced to take her clothes…", "A clip featuring Pakistan men’s Cricket team captain Babar Azam is viral on social media…", "A 13-second clip featuring Bollywood actor Shah Rukh Khan is being shared on social media…", "Union minister of information and broadcasting Anurag Thakur on September 26 announced Waheeda Rehman as…"]