["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "In this image made from video provided by theOct26thDriving campaign, which has been authenticated based on its contents and other AP reporting, a Saudi woman drives a vehicle in Riyadh, Saudi Arabia, Saturday, Oct. 26, 2013. (AP file)", "The comments about Islam from comedian, social critic and cable talk show host Bill Maher continue to stir reactions across the TV dial and across the political spectrum. Maher has said that when Muslim nations suppress political rights and deny freedoms to women, homosexuals and minorities, they are fair game for harsh criticism.", "The verbal fracas centers on whether Maher and others paint Islamic countries with too broad a brush.", "American comic Dean Obeidallah argued that Maher went too far.", "\"You can criticize Muslims,\" Obeidallah said on MSNBC’s The Ed Show on Oct. 6. \"It’s about doing it responsibly. Don't pick and choose and cherry-pick facts to define us by our worst examples. ... Like Saudi Arabia, women can't drive. That’s outrageous.\"", "But, Obeidallah said, \"that's the only Muslim country out of 47 Muslim-majority countries that does that.\"", "We thought we’d run that number down.", "We asked Obeidallah and he said not only is it accurate within the Muslim world, but Saudi Arabia might be the only country worldwide that doesn’t let women drive. He pointed to an NPR story that said the oil-rich nation holds that dubious distinction, although it clarified \"while there is no law formally banning female drivers, the government does not give them licenses.\"", "Some Saudi women have gotten behind the wheel and driven in plain sight to challenge the country’s policy.", "We went through a list of Muslim-majority nations and from everything we found, Obeidallah is correct about Saudi Arabia’s unique status. Another country that blocked women from driving did not show up. (For the record, our list had 51 nations, not 47. And there's another list that has 49. But we won't quibble over that.)", "John Esposito is a leading expert on Islam and a professor of International Affairs and Islamic Studies at Georgetown University. We asked him if Saudi Arabia was the sole Muslim nation with this policy regarding women.", "\"Yes,\" Esposito said.", "Even within Saudi Arabia’s religious community, you can find arguments on both sides of the issue.", "On the website Islam Question and Answer, the justification of the prohibition lies in the Koran. The site operates under the Saudi Sheikh Muhammad Saalih al-Munajjid.", "\"It is well known that (driving) leads to evil consequences which are well known to those who promote it, such as being alone with a non-mahram (marriageable) woman, unveiling, reckless mixing with men, and committing haraam (sinful) actions because of which these things were forbidden.\"", "But Islam Today, another website under the auspices of a different Saudi religious leader, Sheikh `Abd al-Wahhâb al-Turayrî, reaches a different conclusion.", "\"There is nothing in Islamic Law that prohibits a woman from driving an automobile,\" according to the website. \"In Saudi Arabia, the state considers it to be in the best interests of the people to enact laws restricting driving for certain sectors of the population, and that it falls within the state’s jurisdiction to do so. The law in Saudi Arabia that prevents women from driving is considered one of these laws. It is therefore not to be understood as an Islamic teaching.\"", "Obeidallah clearly subscribes to the second view.", "\"There is zero basis in the Koran to ban women from driving, or we would see some other Muslims country doing it,\" Obeidallah said. \"It's not a Muslim thing, it's a Saudi thing!\"", "Our ruling", "Obeidallah said Saudi Arabia is the only Muslim-majority nation that doesn’t allow women to drive. According to our research and independent sources, that is correct.", "We rate the claim True.", "MSNBC, The Ed Show, Oct. 6, 2014", "NPR, Saudi Women Go For A Spin In Latest Challenge To Driving Ban, Oct. 24, 2013", "Center for the Education of Women - University of Michigan, Muslim-Majority Countries Comprising the Islamic World", "Pew Research Center, World’s Muslim population more widespread than you might think, June 7, 2013", "Islam Question and Answer, Does the ruling on driving a car vary from one country to another?", "Islam Today, Women driving automobiles", "Email interview, Dean Obeidallah, Oct. 7, 2014", "Email interview, John Esposito, professor of International Affairs and Islamic Studies,  Georgetown University, Oct. 7, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]