["By Saranac Hale Spencer", "Posted on June 15, 2018", "Q: Did a Muslim waitress refuse to seat 27 Christians?", "A: No. That claim is completely made up. The restaurant where it supposedly happened doesn’t even exist.", "Religious freedom was back in the news this month when the U.S. Supreme Court decided a case brought against a Colorado baker who refused to make a wedding cake for a gay couple because of his religion.", "Since then, at least one dubious site has reposted a made-up story riffing on the subject of religious liberty.", "A site called forfreedomworld.com posted a story with the headline: “Muslim Waitress Refuses To Seat 27-Person Church Group Because ‘Religious Freedom.'” It was shared on Facebook, where users flagged it as potentially false. It is.", "The story was originally posted in January on a site called America’s Last Line of Defense, which describes its content as satire meant to provoke conservatives.", "Before being published on forfreedomworld.com on June 12, the story had been copied in previous months by at least half–a–dozen other sites, none of which has a satire disclaimer. One site actually claims to share stories that show “the truth about Islam,” and another has a domain name that sounds like the reputable Time magazine, but is full of click-bait stories and registered to an owner in Albania.", "Even on sites that don’t have a disclaimer saying that the story is satire, there are some details that show it’s made up.", "For example, the story claims that the incident happened at a Waffle House in “Arnbur,” Michigan. But there is no municipality in the state called “Arnbur,” according to the U.S. Census. However, the name does sound similar to Ann Arbor, which is home to the University of Michigan. Also, there are no Waffle House restaurants in Michigan.", "Similarly, the story says that the group of Christians who were refused service were from the “St. Pleasant Allegorical Church of the Divine,” but there is no such church listed among the more than 33,000 tax-exempt nonprofits in Michigan, according to the Internal Revenue Service. Plus, there is no “St. Pleasant” recognized by the Roman Catholic Church.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk false stories shared on the social media network.", "Masterpiece Cakeshop v. Colorado Civil Rights Commission. No. 16–111. Supreme Court of the U.S. 4 Jun 2018.", "“Muslim Waitress Refuses To Seat 27-Person Church Group Because ‘Religious Freedom.’” Forfreedomworld.com. 12 Jun 2018.", "United States Census. American Fact Finder — Michigan. Accessed 14 Jun 2018.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]