["Bollywood actor Deepika Padukone expressed solidarity with students injured on the intervening night of January 5-6 during violence at Jawaharlal Nehru University (JNU). Padukone’s visit to the campus irked a section of individuals who, since last night, made #BoycottChhapaak one of the top trends on Twitter. ‘Chhapaak’ is Padukone’s upcoming film inspired by the life of acid attack survivor Laxmi Aggarwal who was attacked by 32-year-old Naeem Khan in 2005.", "In the latest round of backlash, a section of the media has claimed that the movie portrays Khan as ‘Rajesh’.", "Based on an IMDB link which identifies the screen name of one cast members as ‘Rajesh’, Swarajya published an article claiming, “the accused is said to have been named ‘Rajesh’ in Deepika’s movie.”", "Update: News18 published an article on January 8 titled, “Deepika Padukone’s Chhapaak Trends on Twitter Over ‘Change’ in Acid Attacker’s Name.”", "India TV and The Quint republished an IANS feed and Jansatta published an independent report alleging the same.", "India TV anchor Sushant Sinha repeated the claim during a broadcast on Deepika Padukone’s visit to JNU.", "On January 9, News18 added a new ‘twist’ to the story based on a tweet by advocate Ishkaran Singh Bhandari. The media outlet claimed that the makers of the film ‘rectified their error’ and changed the name of the villain after social media criticism.", "Opindia’s Nupur Sharma tweeted, “If secularism means changing “Nadeem” to “Rajesh”, set secularism on fire.”", "Latestly and News Nation published similar reports.", "BJP Haryana IT cell head Arun Yadav tweeted a photograph of Aggarwal and wrote, “This is Laxmi Aggarwal. Chhapaak is based on her. In 2005, a man named Nadeem Khan threw acid on her in Delhi’s Khan Market. To keep the fabric of secularism intact, our Bollywood has named Nadeem ‘Rajesh’ in the film. #NameItLikeBollywood“", "[Translated from: ये लक्ष्मी अग्रवाल हैं,इन्हीं के ऊपर बनी है फ़िल्म छपाक। लक्ष्मी के ऊपर सन 2005 में दिल्ली के खान मार्केट में नदीम खान नाम के एक लड़के ने ऐसिड फेंका था।हमारे बॉलीवुड ने सेक्युलर फ़ैब्रिक इंटैक्ट रखने के उद्देश्य से फ़िल्म में नदीम का नाम राजेश रख दिया है.. #NameItLikeBollywood]", "National media in-charge of J&K BJP youth wing BJYM Rohit Chahal alleged the same. “जिस लक्ष्मी अग्रवाल पर दीपिका की फिल्म बनी है, असल जींदगी में उसपर एसिड फेंकने वाले का नाम नदीम खान था। लेकिन दीपिका की फ़िल्म में एसिड फेंकने वाले का नाम राजेश रख दिया गया है। रशीद, रईस या रहमान जैसा कुछ क्यों नहीं?? #ShameOnBollywood,” he tweeted.", "Advocate Ishkaran Singh Bhandari tweeted, “If a different name is used & especially a name typically used by different religions will send a Legal Notice.”", "Referring to Bhadari’s tweet, BJP MP Subramanian Swamy wrote, “…if they have changed name of accused from Muslim in real life to a Hindu name. That is defamation.”", "Alt News contacted Newslaundry co-founder Abhinandan Sekhri who had attended the screening of ‘Chhapaak’ in Delhi. “I watched the special screening of the movie which was organised for acid attack survivors, and the claim on social media that the accused is portrayed as belonging to the Hindu community is false. The person who is convicted is presented as belonging to the Muslim community, and so are his relatives, with one of them shown in a Burkha,” he said.", "Sekhri also called-out Swarajya’s erroneous report on Twitter.", "Shocking (or maybe not) that such demonstrable misinformation is carried. I watched the screening last night & can tell you with certainty the religion of attacker has not changed. Film has remained accurate to the case. Opinidia ko bachane ke chakkar mein khud Opindia ban gaye.. https://t.co/Jxc0ZCEDzJ", "— Abhinandan Sekhri (@AbhinandanSekhr) January 8, 2020", "According to PTI journalist Radhika Sharma’s report, “In the Meghna Gulzar directed film, there is no mention of any Nadeem or Naeem Khan. Moreover, Rajesh is the name of Malti’s boyfriend.”", "#Chhapaak trends on Twitter – and no its screen villain is neither ‘Nadeem’ nor ‘Rajesh’.", "Unlike the #FakeNews peddlers, I was fortunate to watch a special screening of the film last evening.", "Here goes, my report for @PTI_News. https://t.co/HhNIEjRDya", "— Radhika Sharma (@KhayalaBibi) January 8, 2020", "“The screening was organised by NCW. The person convicted for the acid attack is known as Bashir Khan urf Babboo in the film, whereas Rajesh is the name of the boyfriend of the acid attack survivor, Malti,” Sharma informed Alt News. The journalist covered the movie’s screening for PTI.", "A Times Now broadcast also debunked the false claim.", "The usual suspects Prashant Patel Umrao, Shefali Vaidya, author Ravi Rai, Anuj Bajpai and @Nationalist_Om suggested that the Muslim identity of Laxmi Aggarwal’s perpetrator has been whitewashed in ‘Chhapaak’.", "Sonam Mahajan whose tweet drew over 7,000 retweets at the time of writing this article wrote, “If crime has no religion, then why does Bollywood feel the need to change the religion of perpetrators even in biopics?” Mahajan was one of the earliest to float the false claim.", "Rohit Jaiswal who identifies himself as a ‘film critic’ questioned, “If Acid attacker name was Naeem Khan then the same name should have been used in film as well… Ye Rajesh kya hai??”", "One Monica (@TrulyMonica), who terms herself an ‘ex-journalist’ on Twitter, also circulated the false claim.", "Vikas Pandey (@MODIfiedvikas) tweeted “I knew this” and claimed that the attacker’s name was changed to ‘Rajesh’. He later took down the tweet.", "It is noteworthy Swarjaya later updated its report with the correct information, although clarification on its tweet – “The main accused in Lakshmi’s acid case was Naeem Khan but he is said to have been named “Rajesh” in Deepika’s movie” – is yet to be provided.", "Furthermore, Free Press Journal carried a misleading report titled, “#NameItLikeBollywood trends after Deepika’s ‘Chhapaak’ ‘changes’ acid attacker’s name from Nadeem Khan to Rajesh”. The article clarifies the misinformation only in the concluding paragraph.", "‘Chhapaak’ is set to release on January 10, 2020, and the claim that movie whitewashes the Muslim identity of the attacker who threw acid on Laxmi Aggarwal, by portraying him as a Hindu, was found to be false.", "[Update: Swarajya deleted its tweet after this report was published. Vikas Pandey’s tweet and erroneous reposts published by News18, Inda TV and Jansatta have been added to the fact-check.]", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]