["About this rating", "Donald Trump donated Play-Doh brand modeling clay to Louisiana flood victims.", "Play-Doh was only one example of many items he donated to flood victims.", "Example: [Collected via Twitter, August 2016]", "Origins: On 19 August 2016, Republican presidential nominee Donald Trump traveled to Louisiana to survey property damaged by recent flood waters. While Louisiana Governor John Bel Edwards warned Trump that this visit should not be turned into a campaign photo-op, the news media managed to snap at least one photograph of Trump unloading a box of Play-Doh brand modeling clay from a truck at the Church International in St. Amant.", "The picture was widely spread on social media and gave many the impression that Trump had donated nothing but Play-Doh to help those who had lost homes to the floods in Louisiana:", "The GOP nominee did not at the time issue a press release detailing what items he donated, nor how those donations were funded. (Were these personal donations? Did he collect items from supporters? Did the campaign pay for them?) Regardless, although Trump did donate Play-Doh modeling clay to flood victims in Louisiana, that was not his only donation to those in need, as a video of his helping to unload a truck clearly shows that the donations included much more than just Play-Doh:", "Play-Doh, diapers, baby formula, various toys, cleaning supplies and socks can be seen in the above-displayed video. A CNN report also noted that Trump had donated blankets and school supplies.", "In addition to questioning the contents of Trump's donation, some were skeptical that the candidate had donated anything at all, claiming that Trump merely helped to unload a truck of supplies donated by another organization. However, CNN and The Creole, the latter an online news source for Ascension Parish in Louisiana, reported that Trump himself had \"donated\" an 18-wheeler full of supplies:", "Trump spent approximately 20-25 minutes inside the command center and asked a lot of questions, according to [St. Amant Fire Chief James E.] LeBlanc. He also donated a 18-wheeler full of supplies and expressed concern for residents, damage to homes, how much water was in the area and if any assistance had been given by the federal government.", "A church spokesperson also confirmed that the supplies were donated by Donald Trump:", "We are responding to your email inquiring about the video showing Donald Trump unloading supplies at our church. These supplies were donated by Donald Trump.", "Although a specific list of donated items was not available, the candidate clearly assisted in providing more than just Play-Doh to the people of Louisiana.", "In August 2017, interest in this item was re-ignited amid debate about the President Trump's response to Houston flood victims following Hurricane Harvey.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]