["During an interview on Fox News, former Vice President Dick Cheney argued that the Army is unready to take on emerging threats like the forces of the Islamic State group. (File/Getty)", "There is no question that the Pentagon is spending millions of dollars in the effort to destroy the forces of the Islamic State group. By one estimate, fielding 2,000 troops in Iraq and maintaining a moderate level of airstrikes could cost between $200 million and $320 million per month.", "Former Vice President Dick Cheney warned that the military might not be up to the task that lies ahead.", "\"The threat is increasing, and our capacity to deal with it is decreasing,\" Cheney said Sept. 24 on Fox News’ Hannity. \"Because of what's happening to the U.S. military, the massive reductions in the budget, (and) the fact that we have four combat-ready brigades out of 40 in the U.S. Army.\"", "The next day, Col. Lawrence Wilkerson, a former chief of staff to Secretary of State Colin Powell, said on MSNBC that Cheney’s figures weren’t correct. We decided to take a closer look at Cheney’s claim about the number of combat-ready brigades, largely because it can be difficult to quantify what qualifies as a \"massive\" budget cut.", "While you might think that a tally of combat-ready brigades is a simple number to find, it is not. The initial response we got from Army public affairs staff was, \"a unit's state of readiness is not publicly releasable information.\"", "That said, in June, Col. Dan Williams, a senior planner for the Army’s Force Command, was interviewed on the status of a plan to increase the number of combat-ready brigades to seven by the end of the summer.", "\"The concept, as originally briefed, was implemented, and we’re already there, but we also expanded it,\" Williams told the Air Force Times. \"As funds have become available, we’ve been able to expand and get a more robust capability.\"", "A member of the Army public affairs staff confirmed that at the time of that interview, the Army indeed had seven combat-ready brigades and that the situation had improved since then.", "\"Funding was restored, which allowed the Army to move away from budget prioritization and return to its normal readiness model,\" the spokesman said.", "The operational unit for the Army is a Brigade Combat Team, about 2,500 to 4,000 soldiers who bring a blend of fighting power and support functions that allow the brigade to operate on its own. For the Army, consistent training is a key piece of the puzzle to make sure that everyone in a team knows how to work together.", "In March 2013, sequestration -- the automatic budget cuts that kicked in when Congress failed to agree on a deficit reduction plan -- disrupted the Army’s training program.", "But in December of that year, Congress gave the Pentagon sequestration relief, hiking its budget by more than $22 billion in fiscal year 2014 and more than $9 billion in 2015. In the words of an Army public affairs staffer, that move \"allowed the Army to buy back readiness. We haven't had to cancel any Combat Training Center rotations this year. So, readiness is stable.\"", "There might be some wrinkles in this picture. In March, Army vice chief of staff Gen. John Campbell told the Senate Armed Services Committee that not every unit has had the time to do all the training the Army would like. Campbell said some teams come into the Combat Training Center \"at a low level of proficiency and cannot maximize this training event.\"", "But that seems like a nuance that doesn’t detract from the conclusion that the Army has at least seven combat-ready brigades, and maybe more, available for contingencies.", "That means Cheney is off the mark in his claim.", "Definition of 'combat-ready' doesn't matter", "As we researched this claim, we came across the particular way the Army uses the term \"combat-ready.\" Technically, \"combat-ready\" excludes brigades that are already deployed. That means that even more troops are likely trained and prepared to fight than Cheney is letting on. (Cheney didn't return our requests for comment.)", "\"If a unit is deployed, it's not ready,\" said Russell Rumbaugh, a senior associate at the Stimson Center, a think tank that focuses on broader defense issues. \"Including if it's in Korea staring down the North Korean Army. Many people would probably call that a ready brigade. But since its not available for deployment elsewhere, the Army doesn’t consider it ready.\"", "The Army told PunditFact it has a total of 38 Combat Brigade Teams and of those, four are currently deployed.", "Col. Leonard Wong, a research professor at the Army War College, said in a pragmatic sense, a brigade’s deployment status might not be so critical.", "\"The Army deployed brigades from Korea into Iraq, so I don't think that being forward-deployed means that the unit is not combat-ready,\" Wong said. \"Actually, it doesn't make sense for a forward-deployed unit to not be combat-ready. A unit needs the right type of equipment, leaders, personnel, and training to be combat-ready.\"", "One final note: While Congress granted the defense department additional money, Army leaders express concern that readiness will suffer if new funds aren’t allocated in 2016 and beyond.", "Our ruling", "Cheney said that the Army has only four combat-ready brigades out of 40.", "While we don't have precise numbers, Army staff said there were seven combat-ready brigades in June, and that the situation has improved since then. Overall, there are 38 brigades not 40 as Cheney said.", "Making some allowance for shifting numbers, we rate the claim Mostly False.", "Fox News, Hannity, Sept. 24, 2014", "Center for Strategic and Budgetary Assessments, Estimating the Cost of Operations Against ISIL, Sept. 29, 2014", "Congressional Budget Office, Defense budget", "Congressional Budget Office, Long-term implications of the future years defense program, November 2013", "U.S. Senate Armed Services Committee, Statement of Gen. John Campbell - Army vice chief of staff, March 26, 2014", "U.S. Navy Institute News, SECDEF Hagel: Budget Deal ‘Step in the Right Direction’ But ‘Tough Decisions’ on Horizon, Dec. 19, 2013", "Air Force Times, Army's new plan: Active and Guard brigade team-ups, June 24, 2014", "MSNBC, The Ed Show, Sept. 25, 2014", "Email interview, Leonard Wong, research professor, U.S. Army War College, Sept. 29, 2014", "Email interview, Matthew Bourke, public affairs officer, Office of the Chief of Public Affairs, U.S. Army Media Relations Division, Oct. 1, 2014", "Email interview, Reuben Maestas, public affairs officer, Army Force Command, Oct. 3, 2014", "Email interview, Russell Rumbaugh, senior associate, Stimson Center, Sept. 25, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]