["About this rating", "Whether one ascribes \"ghostly intervention\" stories to God or to earthly ties so strong they empower the deceased to reach back from the grave, this legend type is hugely popular because it confirms one's personal belief system (i.e., that God is all powerful and will engineer a miracle to save an innocent, or that the love of a parent will overpower death itself if the child is in danger).", "One afternoon, a couple was traveling on the road when all of a sudden at a far distance they saw a woman in the middle of the road asking them to stop.", "The wife told her husband to keep on driving because it might be too dangerous, but the husband decided to pass by slowly so he wouldn't stay with the doubt on his mind of what might have happened and the chances of anyone being hurt. As they got closer, they noticed a woman with cuts and bruises on her face as well as on her arms. They then decide to stop and see if they could be of any help.", "The cut and bruised woman was begging for help telling them that she had been in a car accident and that her husband and son, a new born baby, were still inside the car which was in a deep ditch. She told them that the husband was already dead but that her baby seemed to still be alive.", "The husband that was traveling decided to get down and try to rescue the baby and he asked the hurt woman to stay with his wife inside the their car. When he got down he noticed two people in the front seats of the car but he didn't pay any importance to it and took out the baby quickly and got up to take the baby to it's mother. When he got up, he didn't see the mother anywhere so he asked his wife where she had gone. She told him that the woman followed him back to the crashed car.", "When the man decided to go look for the woman, he noticed that clearly the two people in the front seats were dead; a woman and a man with both their seatbelts on. When he looked closer, he noticed that it was the exact same woman that was begging them for help in the beginning.", "Do you think that it was a miracle of God?", "The Baby now lives with family members and he will live to tell the story.", "If you believe in the Almighty and that miracles like these can truly happen, send this to your friends. If you don't send it, nothing will happen, only that the some people won't be able to know of the greatness of the Lord.", "Comfort is also found in legends of this ilk due to the implied promise that parental protection will outlast the lives of the caregivers themselves, and that Mother and Father will still always be there in times of need. For folks desperately trying to come to terms with the loss (or projected loss) of a parent, this reassurance is most welcome.", "A drunk man in an Oldsmobile,\nthey said, had run the light\nthat caused the six-car pileup\non 109 that night.", "When broken bodies lay about\n and blood was everywhere,\nthe sirens screamed out elegies\nfor death was in the air.", "A mother, trapped inside her car,\nwas heard above the noise;\nher plaintive plea near split the air:\n\"Oh, God, please spare my boys!\"", "She fought to loose her pinioned hands;\nshe struggled to get free,\nbut mangled metal held her fast\nin grim captivity.", "Her frightened eyes then focused\non where the back seat once had been,\nbut all she saw was broken glass and\ntwo children's seats crushed in.", "Her twins were nowhere to be seen;\nshe did not hear them cry,\nand then she prayed they'd been thrown free,\n\"Oh, God, don't let them die!\"", "Then firemen came and cut her loose,\nbut when they searched the back,\nthey found therein no little boys,\nbut the seat belts were intact.", "They thought the woman had gone mad\nand was traveling alone,\nbut when they turned to question her,\nthey discovered she was gone.", "Policemen saw her running wild\nand screaming above the noise\nin beseeching supplication,\nPlease help me find my boys!", "They're four years old and wear blue shirts;\ntheir jeans are blue to match.\"\nOne cop spoke up, \"They're in my car,\nand they don't have a scratch.", "They said their daddy put them there\nand gave them each a cone,\nthen told them both to wait for Mom\nto come and take them home.", "I've searched the area high and low,\nbut I can't find their dad.\nHe must have fled the scene,\nI guess, and that is very bad.\"", "The mother hugged the twins and said,\nwhile wiping at a tear,\n\"He could not flee the scene,\nyou see, for he's been dead a year.\"", "The cop just looked confused and asked,\n\"Now, how can that be true?\"\nThe boys said, \"Mommy, Daddy came\nand left a kiss for you.", "He told us not to worry\nand that you would be all right,\nand then he put us in this car with\nthe pretty, flashing light.", "We wanted him to stay with us,\nbecause we miss him so,\nbut Mommy, he just hugged us tight\nand said he had to go.", "He said someday we'd understand\nand told us not to fuss,\nand he said to tell you, Mommy,\nhe's watching over us.\"", "The mother knew without a doubt\nthat what they spoke was true,\nfor she recalled their dad's last words,\n\"I will watch over you.\"", "The firemen's notes could not explain\nthe twisted, mangled car,\nand how the three of them escaped\nwithout a single scar.", "But on the cop's report was scribed,\nin print so very fine,\nAn angel walked the beat tonight\non Highway 109.", "By Ruth Gillis\nCopyright © 1999 Ruth Gillis\nRuth's House of Poetry", "In the world of folklore, ghosts have been fetching help for the still living almost since time began. Observe this example harvested by Brunvand from an 1981 newspaper:", "There is a story going about town that is worthy of attention. The only question is whether it is true, and to what extent. The other day, somewhere on Sergievskaya Street, or near it, a priest carrying the holy sacraments came to a certain apartment after mass. A young man answered the door.", "\"I was asked to come here and give the sacraments to a sick man,\" said the priest.", "\"You must have made a mistake. Nobody lives here except me.\"", "\"No, a lady came up to me today and gave me this very address and asked me to give the sacraments to the man who lives here.\"", "The young apartment dweller was perplexed.", "\"Why look, that is the very woman who asked me to come,\" said the priest, pointing to a woman's portrait hanging on the wall.", "\"That is the portrait of my dead mother.\"", "Awe, fear, terror seized hold of the young man. Under the impression of all this he took communion.", "That evening he lay dead.", "Such is the story.", "Versions of the story quoted immediately above were part of oral lore at least as far back as 1890 in at least three countries (Russia, England and Canada). The \"summoned help\" is either a doctor or a member of the clergy. Such tales of loved ones fetching help and only afterwards being identified as deceased via their being identified through their portraits continue to circulate:", "There came a frantic knock\nAt the doctor's office door,\nA knock, more urgent than\nhe had ever heard before.", "\"Come in, Come in,\"\nthe impatient doctor said,\n\"Come in, Come in,\nbefore you wake the dead.\"", "In walked a frightened little girl,\na child no more than nine,\nIt was plain for all to see,\nshe had troubles on her mind.", "\"Oh doctor, I beg you,\nplease come with me,\nMy mother is surely dying,\nshe's as sick as she can be.\"", "\"I don't make house calls,\nbring your mother here,\"\n\"But she's too sick,\nso you must come or she will die I fear.\"", "The doctor, touched by her devotion,\ndecided he would go,\nShe said he would be blessed,\nmore than he could know.", "She led him to her house\nwhere her mother lay in bed,\nHer mother was so very sick\nshe couldn't raise her head.", "But her eyes cried out for help\nand help her the doctor did,\nShe would have died that very night\nhad it not been for her kid.", "The doctor got her fever down\nand she lived through the night,\nAnd morning  brought the doctor signs,\nthat she would be all right.", "The doctor said he had to leave\nbut would return again by two,\nAnd later he came back to check,\njust like he said he'd do.", "The mother praised the doctor\nfor all the things he'd done,\nHe told her she would have died,\nwere it not for her little one.", "\"How proud you must be\nof your wonderful little girl,\nIt was her pleading that made me come,\nshe is really quite a pearl!", "\"But doctor, my daughter died\nover three years ago,\nIs the picture on the wall\nof the little girl you know?\"", "The doctors legs went limp\nfor the picture on the wall,\nWas the same little girl\nfor whom he'd made this call.", "The doctor stood motionless,\nfor quite a little while,\nAnd then his solemn face,\nwas broken by his smile.", "He was thinking of that frantic knock\nheard at his office door,\nAnd of the beautiful little angel\nthat had walked across his floor.", "These days, we tend to envision crises worthy of summoning ghostly parents back to do their duty as involving life-threatening physical danger to the child, so in modern tellings of this legend, the parent returns to direct rescuers to a trapped youngster who might otherwise be overlooked or to scoop up the injured tot herself and bring it to a doctor or nearby hospital. But in older versions, the crisis that would kickstart a deceased parent to intervene was spiritual, not physical. In the example quoted above, the ghost mom fetches help not to save the life of her child, but its soul.", "Popular culture is replete with examples of this legend type, some involving parents and their endangered offspring, some involving spouses (the 1990 film Ghost fleshed out this folktale to make a full-length movie of it), and some involving friends (such as in the 1978 Stephen King novel and 1994 mini-series The Stand when Nick appears to Tom in a dream to direct him to the right medicine to save Stu, who is dying).", "Brunvand, Jan Harold.   Too Good To Be True\r\n    New York: W. W. Norton, 1999.    ISBN 0-393-04734-2   (pp. 239-242).", "Brunvand, Jan Harold.   The Truth Never Stands in the Way of a Good Story\r\n    Urbana and Chicago: University of Illinois Press, 2000.   (pp. 123-136).", "Brunvand, Jan Harold.   The Vanishing Hitchhiker\r\n    New York: W. W. Norton, 1981.   ISBN 0-393-95169-3   (pp. 34-35).", "The Big Book of Urban Legends\r\n    New York: Paradox Press, 1994.   ISBN 1-56389-165-4   (p. 70).", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]