["The border dispute between India and China led to speculations on social media after reports of one officer and two soldiers killed on the Indian side came to light on June 16. As per the latest update, 20 Indian soldiers are feared dead. According to a report in Al Jazeera, Indian officials claimed, “Chinese soldiers crossed the boundary at three different points, erecting tents and guard posts and ignoring verbal warnings to leave.” However, the Foreign Ministry of China blamed Indian troops for crossing the border line twice on Monday (June 15), “provoking and attacking Chinese personnel, resulting in serious physical confrontation between border forces on the two sides.”", "After the news of the death of an Indian officer and two soldiers was reported, several media outlets and journalists from the country were quick to claim that five Chinese troops lost their lives in the violent face-off.", "Aaj Tak’s Rohit Sardana and Sweta Singh reported five deaths and 11 casualties on the Chinese side. Sardana credited the information to China-based Global Times.", "Aaj Tak also broadcast a show where the numbers were shown.", "ABP’s Rubika Liyaquat and India Today’s Shiv Aroor also shared the purported information, ascribing it to Global Times reporters Wang Wenwen and Hu Xijin. Aroor later took down his tweet.", "Times Now and News18 ran broadcasts on the ‘news’.", "Casualties in clash across LAC, 1st time in 45 years. 3 Indian braves martyred, but India hits back with venom as 5 Chinese soldiers were killed. Several more injured in clash.", "Athar with more details. pic.twitter.com/XaoK5GYPFt", "— TIMES NOW (@TimesNow) June 16, 2020", "भारत चीन के टकराव पर @News18India का कहना है कि भारत के 3 और चीन के 5 सैनिकों की मौत। #NLprimetime pic.twitter.com/XCl5eTx8ln", "— Atul Chaurasia (@BeechBazar) June 16, 2020", "Global Times reporter Wang Wewen had indeed tweeted that the People’s Liberation Army (PLA) lost five soldiers and 11 others were injured.", "Reports say 5 PLA soldiers were killed and 11 were injured at LAC China-India border yesterday.", "— Wang Wenwen (@WenwenWang1127) June 16, 2020", "Wenwen cited her source as ‘News Line IFE’.", "Here is the source. https://t.co/Ahy3m4rxmB", "— Wang Wenwen (@WenwenWang1127) June 16, 2020", "As it turned out, News Line IFE is an Indian account and Wenwen later retracted her tweet. She also tagged India Today and wrote, “It is unprofessional for Indian media to say this is official news from the Chinese side.”", "I cited an Indian source of @NewsLineIFE about a physical clash at LAC China-India border yesterday. No confirmation from the official Chinese source regarding casualties yet. It is unprofessional for Indian media to say this is official news from the Chinese side. @IndiaToday pic.twitter.com/OIGBKq61Gn", "— Wang Wenwen (@WenwenWang1127) June 16, 2020", "Global Times reported that the channel has not released the exact number of Chinese casualties from its official accounts.", "The official Global Times accounts have NEVER reported the exact casualties on the Chinese side. The Global Times CANNOT confirm the number at the moment.", "— Global Times (@globaltimesnews) June 16, 2020", "Editor-in-Chief of Global Times Hu Xijin who was also cited as a source for the number of casualties on the Chinese side tweeted that the Chinese government did not release the number of PLA casualties.", "Chinese side didn’t release number of PLA casualties in clash with Indian soldiers. My understanding is the Chinese side doesn’t want people of the two countries to compare the casualties number so to avoid stoking public mood. This is goodwill from Beijing.", "— Hu Xijin 胡锡进 (@HuXijin_GT) June 16, 2020", "It is noteworthy that Xijin had not put out an exact number of casualties in his earlier tweet as well, which was shared by several Indian users and journalists. He wrote, “Based on what I know, Chinese side also suffered casualties in the Galwan Valley physical clash.”", "Therefore, a piece of unverified information tweeted by a journalist with China-based Global Times was used to claim that five Chinese soldiers were killed in the border dispute. This was shared after the news of three Indian troops who lost their lives was reported. However, quite ironically, the source of this ‘news’ was an Indian account and the unverified information was amplified by Indian media and journalists. As of this writing, 20 Indian soldiers are feared dead. ANI quoted “sources” claiming that the Chinese army suffered 43 casualties, including dead and injured, however, neither the Indian army nor the Chinese government has made any official statement regarding casualties on the Chinese side.", "[Update: Aaj Tak’s broadcast carrying the misinformation was added to the report on June 17, 2020.]", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]