["About this rating", "The 13 February 2016 death of Supreme Court Justice Antonin Scalia prompted a number of debates and rumors, mostly about who would fill his seat.", "Just hours after news broke of his death, the subject was raised at a pre-scheduled Republican debate. Murmurs from some candidates that the appointment should be stalled until the end of President Obama's term quickly turned into partisan bickering about election-year appointments.", "One of the rumors around Scalia's death and replacement was the above item. It stated that Article III, Section IV of the United States Constitution mandated \"the Founding Fathers wrote 'the President may not nominate a candidate for the Supreme Court if the vacancy shall occur in the year leading up to an election, when the candidate be a 'lame duck' ... [i]n thy cases, the voters shall select their nominee with their pick of the next president.\"", "Before even double checking, we could spot a number of red flags that stood out in the quoted text. First was that an elected president would never have been described as a \"candidate,\" a term used to describe politicians seeking office and not an incumbent. Also, the terminology \"lame duck\" had a distinctly anachronistic feel to it. A 2009 Denver Post column suggested that the modern phrase didn't exist while the Founding Fathers lived:", "In the American political sense, \"lame duck\" was first used in 1863 in reference to \"broken-down politicians,\" and the first president to be called a lame duck was Calvin Coolidge.", "However, it's not necessary to research the history of the phrase \"lame duck\" to figure out whether or not there's any truth to this claim, because there is no Article III, Section IV to the United States Constitution.  Other articles do have sections numbered four and higher, but Article III has only three sections.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]