["Talk show host Ellen DeGeneres has become a frequent target of child sex-trafficking conspiracy theories. We’ve previously debunked claims connecting her to such crimes, including one that she is on house arrest. Now an image of the celebrity comedian is being shared on social media with the suggestion that it supports these unfounded claims.", "\"Ellen you are going down,\" reads the text above a photo of her hugging a child. One post sharing the image says: \"Now I know Ellen don’t got kids. The boat looks nice tho. Epstein island I suppose.\"", "It uses the hashtag #PizzaGate, a reference to the false conspiracy theory that a Washington D.C. pizzeria was the front for a child sex-trafficking ring.", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "DeGeneres’ wife, the actress Portia de Rossi, posted the photo on Instagram on Jan. 3, 2016, when they were on vacation in Saint Barthelemy, celebrating New Year’s Eve on DeGeneres’ yacht. The caption says: \"Eva does Ed’s hair #stbarths.\"", "Ed is de Rossi’s nickname for DeGeneres, who is wearing a pink bow in the picture. Eva is the couple’s niece. In a 2015 episode of \"The Ellen DeGeneres Show,\" DeGeneres played a clip of Eva and their other niece Perry singing while riding in the car.", "Other photos de Rossi posted from the trip show the couple smiling for a selfie and DeGeneres riding on a watercraft with her mother.", "What these photos don’t prove: that DeGeneres is connected to a baseless conspiracy theory about child sex-trafficking, or that she was on the island of the late financier and sex offender Jeffrey Epstein.", "We rate this post Pants on Fire.", "Facebook post, July 21, 2020", "PolitiFact, Bogus conspiracy about Obama, others wearing house arrest monitors spreads online, June 18, 2020", "PolitiFact, How the Wayfair child sex-trafficking conspiracy theory went viral, July 15, 2020", "PolitiFact, How Pizzagate went from fake news to a real problem for a D.C. business, Dec. 5, 2016", "Instagram post, Jan. 3, 2016", "Vanity Fair, Harry Styles and Kendall Jenner spending New Year’s on Ellen’s yacht doesn’t mean they’re dating, Jan. 5, 2016", "Vogue, Ellen DeGeneres takes Paris: Inside the comedian and designer’s whirlwind European vacation, Oct. 21, 2014", "The Ellen DeGeneres Show, These are Portia and my nieces Eva and Perry! Clearly they are talented geniuses, March 18, 2015", "Instagram post, Jan. 3, 2016", "Instagram post, Jan. 3, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]