["Donald Trump won enough electoral votes on Election Day to become president. But he and his staff have been trying to make clear that they didn’t just win — they say they steamrolled Hillary Clinton.", "\"We had a massive landslide victory, as you know, in the Electoral College,\" Trump told Chris Wallace on the Dec. 11 edition of Fox News Sunday.", "That echoed earlier comments by the Trump transition team and a tweet by campaign manager Kellyanne Conway (\"306. Landslide. Blowout. Historic\"). We previously rated False the statement by Reince Priebus, Trump’s soon-to-be White House chief of staff, that Trump’s victory was \"an electoral landslide.\"", "So what about Trump’s own assertion that \"we had a massive landslide victory ... in the Electoral College\"? (Trump’s transition office did not respond to an inquiry.)", "The claim remains well short on evidence", "Here is a chart showing the percentage of electoral votes won by every presidential winner since George Washington (who was the only president to win every single electoral vote). It’s drawn from research by John J. Pitney Jr., a Claremont McKenna College political scientist.", "Trump’s victory is marked in red. He won 56.88 percent of the available electoral votes.", "This chart makes it clear that Trump’s percentage doesn’t rank near the top. In fact, it ranks near the bottom, belonging somewhere between the lowest one-fourth and the lowest one-fifth of all Electoral College victories in history.", "\"If your share of the electoral vote ranks behind Martin Van Buren's, then you did not win in a landslide,\" Pitney told PolitiFact.", "If you think that comparing elections 200-plus years ago to today is problematic, the math also shows that Trump’s share of the Electoral College vote is low by recent standards.", "Since the end of World War II, Trump’s percentage of the Electoral College vote is lower than 12 previous results (1948, 1952, 1956, 1964, 1972, 1980, 1984, 1988, 1992, 1996, 2008 and 2012). By contrast, Trump’s electoral vote haul was bigger than only five elections in the post-World War II era (1960, 1968, 1976, 2000 and 2004). So Trump ranks in the bottom one-third by this metric.", "\"If Trump’s election was a landslide, then the word ‘landslide’ has no meaning,\" said University of Denver political scientist Seth Masket.", "The popular-vote discrepancy in favor of Hillary Clinton further dampens Trump’s claim.", "As of Dec. 12, with a dwindling number of votes remaining to be counted, Clinton is winning the popular vote by 2.84 million votes, or 2.1 percentage points.", "While there have been four previous occasions when a presidential candidate lost the Electoral College vote while winning the popular vote, Clinton’s margin of victory is notably large.", "Measured by raw votes, Clinton’s margin is currently more than five times bigger than Al Gore’s 2000 popular vote victory.", "Losing the popular vote \"takes the shine off any Electoral College victory,\" political scientist Barry Burden, director of the Elections Research Center at the University of Wisconsin-Madison, told PolitiFact Wisconsin.", "Pitney of Claremont McKenna said he’s mystified about why the Trump camp is trying to make such a weak argument in the place of ones that would hold more water.", "\"If they had just described the outcome as a ‘dramatic upset victory,’ nobody could reasonably disagree,\" Pitney said.", "Our ruling", "Trump said, \"We had a massive landslide victory, as you know, in the Electoral College.\"", "Trump won, but to call it a \"massive landslide\" in the Electoral College is not accurate by any reasonable definition. While Trump surpassed the required 270 electoral votes with room to spare, his margin ranks no better than the bottom quarter of Electoral College showings in American history, and no better than the bottom one-third of the showings since the end of World War II.", "Trump’s claim is inaccurate, so we rate it False.", "Donald Trump, interview with Fox News Sunday, Dec. 11, 2016", "Kellyanne Conway, tweet, Nov. 28, 2016", "John J. Pitney Jr., \"Trump's Victory Ranks 46 of 58 in Electoral College Share,\" Nov. 28, 2016", "PolitiFact Wisconsin, \"Despite losing popular vote, Donald Trump won in 'electoral landslide,' GOP's Reince Priebus says,\" Nov. 21, 2016", "David Wasserman, \"2016 Presidential Vote Tracker,\" accessed Dec. 12, 2016", "Dave Leip, Atlas of U.S. Presidential Elections, accessed Dec. 4, 2016", "NPR, \"Fact Check: Trump Falsely Claims A 'Massive Landslide Victory,' \" Dec. 11, 2016", "Washington Post Fix Blog, \"There’s no problem with the size of Donald Trump’s mandate, believe me,\" Dec. 12, 2016", "Time magazine, \"Donald Trump’s Transition Team Dismisses Report on Russian Interference in U.S. Election,\" Dec. 10, 2016", "Email interview with Jordan Ellenberg, mathematician at the University of Wisconsin, Dec. 12, 2016", "Email interview with Seth Masket, University of Denver political scientist, Dec. 12, 2016", "Email interview with John J. Pitney Jr., Claremont McKenna College political scientist, Dec. 12, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]