["It is one of the most controversial gun control policies: A ban on assault weapons and large capacity magazines that allow shooters to keep firing longer without reloading.", "While defining what is and isn’t an assault weapon is hard, singling out the broad class of firearms the term conveys is not. Following the mass shootings in El Paso, Texas, and Dayton, Ohio, former President Bill Clinton invoked the ban that passed on his watch.", "\"How many more people have to die before we reinstate the assault weapons ban and the limit on high-capacity magazines and pass universal background checks?\" Clinton tweeted Aug. 5. \"After they passed in 1994, there was a big drop in mass shooting deaths. When the ban expired, they rose again. We must act now.\"", "How many more people have to die before we reinstate the assault weapons ban & the limit on high-capacity magazines & pass universal background checks? After they passed in 1994, there was a big drop in mass shooting deaths. When the ban expired, they rose again. We must act now.", "Clinton touched back on the trend in an op-ed for Time on Aug. 8. So we wanted to check it out.", "We’ve dug into the general question of the impact of the 1994 law before. This is the first time we examine its specific tie to mass shooting deaths, and whether the death toll rose after the ban ended. (Clinton’s tweet assumes that the presence or absence of the ban changed the number of mass shooting deaths. Proving cause and effect is a heavy lift.)", "The topic is riddled with tough data challenges. The law banned only certain types of semi-automatic firearms along with magazines holding more than 10 rounds of ammunition. Should rampages using other kinds of assault-style weapons count? Plus, mass shootings happen much less frequently than other gun crimes, which puts any scientific analysis at a disadvantage.", "That said, the evidence shows that mass shooting deaths rose in the years after the ban. The drop during the ban is less clear cut. The impact of the law is debated, but some researchers say that data and logic show that limits on large capacity magazines and assault weapons help reduce fatalities.", "The 1994 law barred the \"manufacture, transfer, and possession\" of about 118 firearm models and all magazines holding over 10 rounds. People who owned such weaponry could keep it. When the ban took effect, there were roughly 1 million assault weapons in private hands. An estimated 25 million weapons were equipped with large capacity magazines.", "The ban expired in 2004.", "In a key 2004 study commissioned by the U.S. Justice Department, researcher Christopher Koper wrote, \"The ban’s exemption of millions of pre-ban assault weapons and large capacity magazines ensured that the effects of the law would occur only gradually.\"", "\"Should it be renewed, the ban’s effects on gun violence are likely to be small at best and perhaps too small for reliable measurement,\" Koper wrote.", "Clinton’s office cited a 2019 study from New York University’s School of Medicine. A group led by epidemiologist Charles DiMaggio homed in on mass shooting deaths. (Other research has tracked the number of times mass shootings happened, which is not the same thing.)", "Researchers define mass shootings in different ways. Following the FBI’s definition, DiMaggio’s group looked at incidents where at least four people died.", "In raw numbers, they found that mass shooting deaths fell during the years of the ban, and rose afterwards. DiMaggio shared his data.", "\"During the ban period, there were fewer bodies,\" DiMaggio said.", "The death toll from mass shootings went from 4.8 per year during the ban years to 23.8 per year afterwards.", "Many factors drive gun deaths. To help account for those, DiMaggio’s team put mass shooting deaths in terms of the total number of firearm homicides. Viewed that way, they found that between 1994 and 2004, the yearly rate fell by 7-9 people per 10,000 firearm homicides.", "There’s room for debate over what happened to death rates, in contrast to raw numbers, before and during the ban.", "\"There is some evidence they actually declined — or at least didn’t continue to increase during the period of the ban,\" DiMaggio said.", "Epidemiologists speak in terms of risk; that is, the odds of something bad happening. DiMaggio’s study concluded that mass shooting deaths were 70% less likely during the ban.", "On the key policy question of whether the ban drove the decline, DiMaggio urges caution.", "\"It is pretty much impossible to prove cause and effect,\" he said.", "That’s the consensus among a number of researchers. Philip Cook at Duke University said the death toll is real, but complicated.", "\"Violence rates were quite volatile during that period generally for reasons that had nothing to do with gun regulation,\" Cook said. \"That doesn’t mean that the ban was ineffective — only that we don’t know and probably cannot determine the answer given that the outcome of interest (mass shootings) is so rare.\"", "The drop of 15 mass shooting deaths from before the ban to during it is a slender difference on which to base firm conclusions.", "Economist Rosanna Smart at RAND, a consulting nonprofit research group, agreed that mass shootings rose after the ban ended, but noted, \"I don’t think (DiMaggio’s) methods are well-suited for determining the causal impact of the assault weapons ban.\"", "In a 2018 article, Smart reviewed two studies on the impact of the ban. She said strictly in terms of statistical methods, the results were \"inconclusive.\" Although one report did find that state-level bans were effective at reducing mass shooting death rates.", "The debate over the value of a ban on assault weapons and large capacity magazines often includes Christopher Koper at George Mason University. Koper wrote the 2004 study that gave both sides in the gun control debate material to lean on.", "Recently, Koper has spent more time assessing the role of large capacity magazines that hold more than 10 rounds.", "In an article, Koper wrote that more than the semiautomatic weapons themselves, the latest data ties the larger magazines to a rising death toll.", "\"Considering that mass shootings with high capacity semiautomatics are considerably more lethal and injurious than other mass shootings, it is reasonable to argue that the federal ban could have prevented some of the recent increase in persons killed and injured in mass shootings had it remained in place,\" Koper wrote in an article to be published in a few months.", "Democrats introduced a legislation to block people from buying large capacity magazines.", "Semiautomatic rifles account for a small percentage of deaths, but there are a lot of them. According to the industry trade group National Shooting Sports Foundation, yearly sales averaged about 200,000 during the years of the ban. In the eight years after the ban ended, sales averaged about 700,000 a year.", "Clinton urged lawmakers to reinstate a ban on assault weapons and high capacity magazines. \"After they passed in 1994, there was a big drop in mass shooting deaths. When the ban expired, they rose again,\" he said.", "Clinton spoke too strongly about the drop. In simple numbers, mass shooting deaths fell during the ban years —15 deaths over the course of the decade. But statistically, that number is too small to allow strong conclusions. Even the author of the report Clinton relied on said the death rate might have declined —or levelled off.", "The rise after the ban expired is supported by the evidence, although definitions of mass shootings will vary.", "The role of the ban remains unclear, but Clinton’s statement did not specifically say that the ban was the key factor.", "Clinton exaggerated the decline but was right about the rise. We rate this claim Half True.", "Bill Clinton, tweet, Aug. 5, 2019", "Journal of Trauma and Acute Care Surgery, Changes in US mass shooting deaths associated with the 1994-2004 federal assault weapons ban: Analysis of open-source data, January 2019", "RAND, Effects of Bans on the Sale of Assault Weapons and High-Capacity Magazines on Mass Shootings, March 2, 2018", "University of Pennsylvania, Updated Assessment of the Federal Assault Weapons Ban: Impacts on Gun Markets and Gun Violence, 1994-2003, July 2004", "National Shooting Sports Foundation, Firearms production in the United States, 2015", "Southern Illinois Law Journal, 'Assault Weapon' Myths, April 29, 2019", "Los Angeles Times, Op-Ed: The assault weapons ban didn’t work. A new version won’t, either, March 1, 2018", "ProPublica, Fact-Checking Feinstein on the Assault Weapons Ban, Sept. 24, 2014", "PolitiFact, Dianne Feinstein says one of five law enforcement officers killed are killed by assault weapons, Jan. 29, 2013", "PolitiFact, Did mass shootings increase 200 percent since assault weapons ban expired?, Feb. 23, 2018", "Washington Post, It’s time to bring back the assault weapons ban, gun violence experts say, Feb. 15, 2018", "Interview, Charles DiMaggio, professor, Department of Surgery, Division of Trauma and Critical Care Surgery, New York University School of Medicine, Aug. 7, 2019", "Email exchange, Christopher Koper, associate professor, Department of Criminology, Law & Society, George Mason University, Aug. 7, 2019", "Email exchange, Philip Cook, professor of public policy, Duke University, Aug. 6, 2019", "Email exchange, Rosanna Smart, associate economist, RAND, Aug. 6, 2019", "Email exchange, Office of Bill Clinton, Aug. 6, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]