["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Editor’s note: On Oct. 7, 2013, we rated this statement True. Several readers cited additional information we hadn’t considered, so we have issued a new rating.", "Since losing to Democrat Tammy Baldwin in a U.S. Senate race in 2012, former Republican Wisconsin governor and U.S. health and human services secretary Tommy Thompson has put energy into getting the nation into better shape.", "Thompson -- who, at 70, showed during the campaign he could do 50 push-ups -- gave a speech in Madison on Sept. 25, 2013, about obesity in America.", "In an interview the same day with WISC-TV (Channel 3) in Madison, Thompson made a claim that might surprise those us who push our love handles out of the way to make sure we don’t miss a belt loop.", "After Thompson stated that \"we are not very healthy in America,\" one of his interviewers said, \"Well, in Wisconsin, it’s a particular battle. We’re always battling. We’re one of the fattest states in the country.\"", "Thompson responded by saying:", "\"Yes, we are (battling),\" he said. \"But you know something, but you look at the statistics, and across the board, and Wisconsin is not as obese as the national average is. The national average, 35.7 percent of the population is obese. In Wisconsin, it's closer to 26 percent.", "\"So, one out of four, versus one out of three. That’s still not very good, but the truth of the matter is, we’re healthier. But we have to do a better job, in Wisconsin as well as across the country.\"", "Beer-bellied Wisconsin has less-than-average obesity?", "What’s \"obese?\"", "We went to the CDC, a corner tavern, to check on Thompson’s claim.", "Just kidding.", "CDC, of course, is short for the U.S. Centers for Disease Control and Prevention. It defines obesity as something less than you might imagine.", "Height and weight are used to calculate a body mass index. Your BMI determines whether you’re considered obese. An adult, male or female, who is 5-feet-9 and 203 pounds or more is considered obese.", "The CDC notes that although BMI is correlated with body fat, BMI doesn’t actually measure body fat. So, some people, such as athletes, may have a body mass index that identifies them as overweight even though they do not have excess body fat.", "At the same time, obesity is associated with heart disease, stroke, type 2 diabetes and certain types of cancer.", "Now, that Uncle Sam has us feeling unduly chubby, let’s check Thompson’s claim against the statistics.", "Apples and oranges", "On a national level, CDC calculates obesity rates by weighing and measuring a sampling of the population.", "The most recent figures are from a January 2012 report. In 2009-2010, an estimated 35.7 percent of U.S. adults were obese.", "No estimates using measurements are done for the various states.", "Conversely, at the state level, height and weight are self-reported by Americans who participate in phone surveys conducted by state health departments. This type of study can produce lower-than-reality obesity rates, according to CDC, because some people overstate their height and understate their weight.", "Indeed, in the phone surveys, no state had an obesity rate above the 35.7 percent found in the national survey in which people were actually measured.", "The CDC told us that, given the different methodologies, comparing the two studies would be like comparing apples to oranges.", "The latest state data available when Thompson made his statement was for 2012. Based on the responses in the phone survey, 29.7 percent of Wisconsin residents were rated obese. Nationwide, the figure was 28.1 percent.", "So, Wisconsin’s obesity rate was slightly higher than the national rate in the telephone survey study. That gives a very different impression that what Thompson said.", "Meanwhile, here’s how Wisconsin's 29.7 percent obesity rate in the phone survey compared with neighboring states: Michigan (31.1 percent), Iowa (30.4 percent), Illinois (28.1 percent) and Minnesota (25.7 percent).", "Our rating", "Thompson said: \"Wisconsin is not as obese as the national average is. The national average, 35.7 percent of the population is obese. In Wisconsin, it's closer to 26 percent.\"", "In one study, 35.7 percent of American adults were estimated to be obese. In another study, which used a different methodology, the rate was 28.1 percent, slightly below Wisconsin’s 29.7 percent.", "The percentages cited by Thompson contain an element of truth, but the conclusion he drew isn’t valid because the two studies can’t be compared, so we rate his statement Mostly False.", "Youtube, WISC-TV interview (quote at 2:40) of Tommy Thompson, Sept. 25, 2013", "U.S. Centers for Disease Control and Prevention, adult obesity page", "U.S. Centers for Disease Control and Prevention, \"Prevalence of obesity in the United States, 2009-2010,\" January 2012", "Trust for America’s Health and Robert Wood Johnson Foundation, \"F As in Fat -- How Obesity Threatens America’s Future, 2013,\" August 2013", "Interview and email interview, Trust for America’s Health communications manager Albert Lang, Oct. 1, 2013", "Email interview, U.S. Centers for Disease Prevention and Control senior press officer Karen Hunter, Oct. 17, 2013", "U.S. Centers for Disease Prevention and Control, \"Overweight and obesity (BMI) -- 2012\"", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]