["About this rating", "Amazon has said that some \"misheard\" Alexa commands can result in a laughter response from the device.", "It does not appear that the devices are widely malfunctioning or that the \"laugh glitch\" is completely unprompted and unexplained.", "How many Alexa owners have witnessed the issue.", "In March 2018, a spate of news articles appeared, reporting that Amazon Alexa units are suddenly and without provocation playing a \"creepy laugh\" noise — sometimes scaring owners in the middle of the night.", "The claim appeared to have been started on 22 February 2018 with a video on Twitter of Alexa's purported \"creepy laugh\":", "So Alexa decided to laugh randomly while I was in the kitchen. Freaked @SnootyJuicer and I out. I thought a kid was laughing behind me. pic.twitter.com/6dblzkiQHp", "— CaptHandlebar (@CaptHandlebar) February 23, 2018", "The rumor grew to encompass claims that Amazon was perplexed as to the nature of the glitch and is unable to address it:", "AI takeover? Alexa is laughing seemingly at random and Amazon doesn't know why. https://t.co/KFsdcDhrO6", "— Jennifer Epstein (@jeneps) March 7, 2018", "Technology outlets and other sites covering the Alexa glitch referenced a statement from Amazon, but did not quote the response in full, making it difficult to know precisely what the retailer said about the issue:", "... users with Alexa-enabled devices have reported hearing strange, unprompted laughter. Amazon responded to the creepiness today in a statement to The Verge, saying, “We’re aware of this and working to fix it.”", "... Amazon said its planned fix will involve disabling the phrase, “Alexa, laugh,” and changing the command to “Alexa, can you laugh?” The company says the latter phrase is “less likely to have false positives,” or in other words the Alexa software is likely to mistake common words and phrases that sound similar to the one that makes Alexa start laughing. “We are also changing Alexa’s response from simply laughter to ‘Sure, I can laugh,’ followed by laughter,” an Amazon spokesperson said.", "Additional articles referenced subsequent requests for Alexa to turn on the lights, which depending on enunciation and dialect can sound like a command to \"laugh\":", "Amazon said in a statement that it’s aware of the issue and on rare occasion, Echo speakers can mistakenly hear “Alexa, laugh.” Basically, the speaker is hard of hearing.", "The company intends to fix the problem by changing the wake phrase to a less-demanding “Alexa, can you laugh?” which it claims will result in less false positives.", "“We are also changing Alexa’s response from simply laughter to ‘Sure, I can laugh,’ followed by laughter,” an Amazon spokesperson told Bloomberg.", "We contacted an Amazon representative to ask about the Alexa glitch, but it seemed that reports of \"random\" creepy laughing stemmed mostly from misinterpreted requests to turn on a \"lamp\" or lights. Amazon confirmed to several outlets that it will be adding extra steps to trigger the \"laugh\" function.", "Griffin, Andrew.   \"Amazon Admits That Alexa Is Making Terrifying Laughing Sounds And Promises To Make It Stop.\"\r\n    Independent.   8 March 2018.", "Liao, Shannon.   \"Amazon Has A Fix For Alexa’s Creepy Laughs.\"\r\n    The Verge.   7 March 2018.", "Tracey, Philip.   \"Amazon Alexa Is Making Creepy Sounds—And It’s Scaring The Heck Out Of People (Updated).\"\r\n    The Daily Dot.   6 March 2018.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]