["By Eugene Kiely, Lori Robertson, Robert Farley and D'Angelo Gore", "Posted on March 1, 2021", "In his first public speech since leaving office, former President Donald Trump delighted his audience at the Conservative Political Action Conference with numerous false and misleading claims, many of them criticisms of his successor.", "Trump spoke on Feb. 28 in Orlando at the conclusion of the conference. We include here a sampling of his inaccurate claims.", "The former president made wildly off-target claims about Biden’s immigration policies.", "For sure, Biden has reversed many of Trump’s immigration policies. But the new president did not “cancel border security,” trigger record numbers of illegal border crossings and stop deportation of murderers, gang members and sex offenders, as Trump claimed.", "Trump, Feb. 28: Joe Biden has triggered a massive flood of illegal immigration into our country, the likes of which we have never seen before. … So they’re all coming because of promises and foolish words.", "There has been an increase in the number of people caught crossing the border illegally, but Trump is wrong to say it has been “the likes of which we have never seen before.”", "In January, there were 75,198 southwest border apprehensions — a 6% increase from the prior month, according to U.S. Customs and Border Protection. In a Feb. 9 interview, Deputy Border Patrol Chief Raul Ortiz estimated that the numbers were still rising in February with about 3,000 migrants a day, as the Wall Street Journal reported in a Feb. 10 article on the increasing numbers.", "The CBP does not have February statistics available, but at 3,000 a day that would be 84,000 apprehensions — which is far short of the record high, contrary to Trump’s claim. There were more than 200,000 border apprehensions in February 2000, for example, in a decade when annual totals often topped 1 million.", "Trump also misrepresented Biden’s enforcement and removal policy, falsely referring at one point to “Biden’s decision to cancel border security.”", "Trump, Feb. 28: He has effectively ordered a shutdown of ICE, halting virtually all deportations, everyone, murderers, everybody, no more. Let’s not deport people.", "“ICE has not been shut down. Instead, the Biden administration has put into place priorities to focus ICE enforcement efforts,” Sarah Pierce, an analyst at the Migration Policy Institute, told us, referring to U.S. Immigration and Customs Enforcement. “These priorities include noncitizens with serious criminal records.”", "Here’s what happned: On Biden’s first day in office, Acting Homeland Security Secretary David Pekoske issued “a 100-day pause on certain removals to enable focusing the Department’s [enforcement] resources where they are most needed.” Pekoske’s memo also set interim priorities for enforcement, directing immigration officials to focus on national security and public safety threats as well as those apprehended entering the U.S. illegally after Nov. 1.", "The 100-day pause included exceptions — allowing for the deportation of those suspected of terrorism and those whose “removal is required by law.” The 100-day pause, however, was quickly blocked by U.S. District Judge Drew Tipton’s temporary restraining order, allowing deportation proceedings to continue, Pierce said.", "In a Feb. 2 letter to the homeland security secretary, dozens of law professors and legal experts wrote that immigration officials “continue to engage in enforcement activities, including deportations, that appear at odds with the policies issued.” The letter argued that the Biden administration had the authority to halt deportations, despite the court ruling.", "On Feb. 18, Tae D. Johnson, the acting director of ICE, issued interim guidance for enforcement and removals until the department completes its review and the secretary issues new guidelines.", "The interim guidelines placed priorities on deporting those who pose a public safety or national security threat – including active gang members, suspected terrorists and those “convicted of an aggravated felony” as defined by section 101(a)(43) of the Immigration and Nationality Act. Those felonies include: murder, rape, drug trafficking, firearm trafficking and any “crime of violence” that results in a prison sentence of at least one year.", "The memo “does not eliminate immigration enforcement,” Jennifer Minear, president of the American Immigration Lawyers Association, said in a statement at the time.", "“Prioritizing enforcement doesn’t mean disregarding it,” Minear said. “Despite what some critics may claim, this memo does not block immigration enforcement, but rather makes very clear that ICE officers retain discretion and that no one is completely off limits from apprehension, detention, or removal.”", "We won’t know the impact of Biden’s immigration policies on enforcement or deportation for quite some time, at least until permanent policies are put into effect. But Trump distorts the interim policies when he says Biden “effectively ordered a shutdown of ICE” and halted deportations of murderers and “virtually all deportations.”", "Trump also twisted the facts when he suggested children being held in immigration detention facilities are getting a better education than U.S. students during the pandemic.", "Trump, Feb. 28: The Biden administration is actually bragging about the classroom education they are providing to migrant children on the border. While at the same time, millions of American children are having their futures destroyed by Joe Biden’s anti-science school closures. Think of it. We’re educating students on the border, but our own people, children of our citizens, citizens themselves are not getting the education that they deserve.", "Trump’s statement about Biden’s “anti-science school closures” is wrong. All decisions about whether to open or close U.S. schools during the pandemic are made at the state and local levels, not by the federal government. Biden has been criticized for not providing financial incentives to encourage school reopenings, but he cannot force schools to reopen and neither could Trump when he was president.", "Trump also exaggerated when he said that the U.S. isn’t educating “our own people” in classrooms. As we wrote, nearly two of three U.S. students — an estimated 66.1% of K-12 students — attend schools that offer either traditional in-person instruction every day or hybrid instruction. The rest are learning via virtual classrooms.", "As for teaching migrant children in detention facilities, Biden is merely following federal law — as past administrations have done, although the Trump administration was criticized for failing to provide adequate schooling.", "“While the children are in federal detention centers, officials must provide shelter, food, and schooling, but leaders in some of the nation’s largest states and school districts question whether the education needs of the children are being met,” Education Week wrote in 2018 when Trump was president.", "The Biden administration last month opened the first center for children who crossed the border illegally without parents or a legal guardian. But the teachers are not in the classroom with the students. “While youth attend class in a physical classroom, for the time being, teachers are providing live, virtual instruction – like many schools during the COVID-19 pandemic,” according to a Department of Health and Human Services press release on the Texas facility.", "Trump falsely blamed Democratic policies for an increase in gas prices since the election. The jump is due to a rise in crude oil prices, which has nothing to do with the Biden administration, experts say.", "As we’ve written before, presidents, of both parties, often get blame or credit for changes in gas prices, but the reality is they have little influence. (Trump may have had a tad more, given his uncharacteristic involvement in oil matters, experts told us back in 2018.)", "In his speech, Trump claimed Democrats would cause an “energy disaster” in the U.S., going on to falsely suggest the Texas power outages in February were due to wind power. He mentioned “the windmill calamity that we’re witnessing in Texas,” but, as we’ve written, the outages were largely due to a sharp decline in energy from fossil fuels and nuclear power plants, according to Texas power grid operators.", "After critcizing wind energy as “bad for the environment,” Trump turned to gas prices. “Under the radical Democrat policies, the price of gasoline has already surged 30% since the election. And we’ll go to $5, $6, $7 and even higher,” he said.", "Trump starts the clock at the November election. Weekly gas prices have gone up 25% from $2.112 the week ending Nov. 2 to $2.633 for the week ending Feb. 22, the most recent figure from the Energy Information Administration before Trump spoke. It’s unclear why Democrats would be responsible for gas prices while Trump was still president, and two days before Trump left office, the weekly price was $2.379.", "But regardless, experts say the recent increase is due to the market, not who is in the White House — as well as that cold winter weather that affected Texas.", "Tom Kloza, the global head of energy analysis and a co-founder of the Oil Price Information Service, told us that so far under Biden, the “normal machinations of oil markets” have affected gas prices.", "Most of the hike in prices at the pump “can easily be ascribed to crude oil prices going up,” Kloza said. The price per barrel was in the $40s in November and now tops $60. But nothing Biden has done in his short time as president has affected crude prices, he said.", "Why have crude prices jumped? Kloza points to “money flow” as investors buy oil as a commodity. Another issue was a surprise cut in output by Saudi Arabia, announced in January. But later this week, when the OPEC Plus countries meet, Kloza said it’s likely Saudi Arabia will increase output. “So there’s going to be more supply.”", "Jeanette McGee, a spokeswoman for AAA, told us the higher crude oil prices were “driven by market optimism of the vaccine.” And recent increases are due to the impact of winter weather.", "“The recent spikes (the last 2 weeks) are a direct result of the winter storm that hit Texas and took 26 refineries offline. Until refineries operations are back on track, we expect prices to continue increasing this month with the national average hitting at least $2.80/gallon,” McGee said.", "In a Feb. 25 post, AAA said prices should stabilize: “As refineries restart and resume normal operations, supply is expected to increase in impacted areas and should bring stability to pump prices.”", "Kloza, too, said he expects gas prices to peak at about $2.80.", "The Biden administration clearly has different energy policies than the Trump administration. For instance, on his first day in office, Biden ordered a review of fuel economy standards that Trump had instituted in rolling back standards set by then-President Barack Obama. That means gas mileage could improve. But Kloza noted such a change is a slow process.", "Trump repeated an old, misleading claim about the number of jobs created by the Keystone XL pipeline project. He said that Biden canceled the project, “destroying not the 8,000 or the 9,000 or the 11,000 jobs that you hear. But 42,000 great paying jobs on just about day one, right?”", "As we wrote last month, Terry Cunha, a spokesman for TC Energy, the company behind the pipeline, told us that 1,000 unionized jobs would be lost in the subsequent weeks due to Biden’s Jan. 20 cancellation of a March 2019 permit for the pipeline, which was supposed to run from Alberta, Canada, to Nebraska.", "Even those 1,000 jobs were temporary construction jobs. “The project was prepared to hire 11,000 union workers during the construction of the project,” Cunha said.", "As for Trump’s 42,000 figure, the comes from a 2014 estimate from the State Department, which gave that figure for direct jobs, indirect jobs from suppliers and “induced” jobs, created by the workers and suppliers spending money. But the number of permanent jobs, the State Department said, would be significantly lower. It estimated the project “would generate approximately 50 jobs during operations,” including 15 temporary contractors.", "In touting the rapid production of COVID-19 vaccines, Trump baselessly claimed this couldn’t have happened under any other administration. “What has taken place over the last year under our administration would have taken any other president at least five years. And we got it done in nine months.”", "When he made the claim several months ago, he said it would’ve taken two or three years under the last administration. But as we wrote then, there’s no support for Trump’s claim.", "He went on to accurately desribe the key idea behind Operation Warp Speed: to pay companies to start manufacturing a vaccine before it’s approved so it can be distributed more quickly. Trump called it “a calculated bet or a calculated risk.” But that same strategy was used in 2009 for the H1N1 influenza vaccine.", "The COVID-19 pandemic involves a much larger effort, but there’s no reason to think a different administration wouldn’t have done the same. In fact, other countries took the same approach.", "“All the major vaccine development efforts around the world are trying to do the same thing right now, and the major concept is doing the manufacturing before you do the trials,” Dr. Nicole Lurie, a former assistant secretary for preparedness and response during the Obama administration, told us several months before any vaccine got approval in the U.S.", "Lurie also noted that the previous work and investments in science enabled the fast work on COVID-19 vaccines. “What the success is really due to is the success of science,” she said.", "As we’ve written, the technology behind the authorized COVID-19 vaccines has been studied for many years, and a focus on rapid vaccine methods was recommended by a presidential advisory group after the H1N1 pandemic.", "Trump repeated many of the misleading and outright false claims about alleged voter fraud in the 2020 election that he made in the months after the election.", "He repeated unsupported claims about dead people and “illegal aliens” voting; he talked about “corrupt mail-in voting”; he advanced allegations of widespread “cheating”; and he made wild and unsubstantiated accusations about “tens of millions of ballots … indiscriminately pouring in from all over the country.” None of that is accurate.", "Here we’ll dispatch with one of the more outrageous of his election fraud claims: that there were more votes than voters in Detroit and in Pennsylvania.", "Trump, Feb. 28: You take a look at the votes. When you have more votes than you have people, that’s a problem, right? Is that a problem? We have a little problem adjusting in Detroit. We seem to have more votes than we have people, a lot more votes, an election-changing number. We’re not talking about a number where you catch. … No, these are election-changing numbers. In Pennsylvania, they had hundreds of thousands of more votes than they had people voting. What’s that all about? What’s that all about? Cheating, they say. Yeah, I’d say so.", "Let’s start with the claim about Detroit. We’ve heard this from Trump before. In a video he posted to social media on Dec. 2 — which he billed as perhaps “the most important speech I’ve ever made” — Trump similarly claimed that in Detroit “there were more votes than there were voters.”", "Nearly 50% of the city’s 504,714 registered voters cast a ballot, according to the city’s unofficial election results. And 94% of them voted for Biden.", "As we wrote back in early December, Trump appears to be talking about a minor issue with out-of-balance precincts. In Detroit, the number of ballots cast versus the number of voters checked into polling precincts differed by a mere 357, Mayor Mike Duggan said on Nov. 18. Such discrepancies, which aren’t unique to this election, can occur through a scanner error or if a voter who checks in decides not to vote or spoils a ballot, meaning they ask to void the ballot and re-do their vote.", "Trump called the amount of such votes an “election-changing number,” but as we say, the number was 357. He lost the state by more than 150,000 votes.", "Trump made the similarly bogus claim that in Pennsylvania, “they had hundreds of thousands of more votes than they had people voting.” We debunked a similar claim from Trump in his Jan. 6 speech at the “Save America” rally that preceded the storming of the Capitol.", "The claim is “based on incomplete and inaccurate data,” according to the Pennsylvania Department of State.", "The claim originated with a group of Republican legislators in Pennsylvania who compared the total ballots reported as being cast with data contained in the Department of State’s Statewide Uniform Registry of Electors, or SURE, system. But data in the SURE system was incomplete at the time because some counties had not yet finished entering voter histories.", "“At the time of the legislators’ release, these counties included Philadelphia, Allegheny, Butler and Cambria, which would account for a significant number of voters, and other provisional voter histories in a number of other counties are also not yet complete,” the statement from the Pennsylvania Department of State said.", "Arguing that Republicans need to fight back on free speech issues, Trump said Republicans have allowed Democrats to “attack our businesses, and we don’t attack their businesses.”", "Trump, Feb. 28: We’re smarter than they are. We’re tougher than they are. For some reason, we just don’t. We don’t get it done. We let them attack our businesses, and we don’t attack their businesses. I believe your numbers are bigger than their numbers, but you’re nicer than they are. You’re not as vicious as they are.", "But Trump is no stranger to attacking businesses.", "Last August, Trump called for a boycott of Goodyear tires after a photo circulated on social media of what was purported to be a diversity training slide that noted that MAGA attire was inappropriate for the workplace.", "On Aug. 19, Trump tweeted, “Don’t buy GOODYEAR TIRES – They announced a BAN ON MAGA HATS. Get better tires for far less! (This is what the Radical Left Democrats do. Two can play the same game, and we have to start playing it now!).”", "The company later issued a statement saying the image did not come from the corporate office and that as part of the company’s zero tolerance policy for harassment or discrimination, “we ask that associates refrain from workplace expressions in support of political campaigning for any candidate or political party.”", "In August 2018, Trump tweeted support for those who planned to boycott Harley Davidson after the company announced it was moving its production of motorcycles for the European Union to its overseas facilities to avoid tariffs imposed there in retaliation for U.S. tariffs imposed by Trump.", "“Many @harleydavidson owners plan to boycott the company if manufacturing moves overseas. Great! Most other companies are coming in our direction, including Harley competitors. A really bad move! U.S. will soon have a level playing field, or better,” Trump tweeted on Aug. 12.", "On the campaign trail in 2015, Trump frequently vowed he was “never eating another Oreo again” because its parent company is “closing a factory in Chicago and they’re moving to Mexico.” As we wrote, some Oreo production moved to Mexico, but a downsized Chicago plant remained. And there were still three plants in the U.S. making Oreos.", "In July, CNN ran a list of 30 instances in which Trump “has explicitly advocated cancellations, boycotts and firings.” Similarly, in July 2019, Business Insider listed 21 instances in which Trump had targeted companies “with calls for boycotts, threats of taxes and other ominous warnings.”", "Trump repeated a familiar false talking point that his administration “built the strongest economy in the history of the world,” which he said allowed the U.S. to withstand the brunt of the coronavirus pandemic.", "“It was so great for everybody of all backgrounds that even after the China virus, we are leading the world. Nobody’s even close,” he said.", "The U.S. economy under Trump wasn’t even the best in U.S. history.", "As we’ve written before, Trump’s best year in real (inflation-adjusted) gross domestic product growth was a 3% increase in 2018. GDP growth has been higher 17 times since 1981, including most recently under then-President Barack Obama in 2015.", "Furthermore, while the U.S. economy is projected to have contracted by a smaller percentage (3.4%) than several countries with advanced economies in 2020, according to the International Monetary Fund, it is not the world leader in recovering from the pandemic-caused global recession.", "As Fortune magazine reported in January, GDP in China — where the SARS-CoV-2 virus first emerged  — is estimated to have grown by 6.5% in the fourth quarter of last year, “propelling it to a stronger than expected full-year expansion of 2.3% and making it the only major [economy] to avoid contraction.”", "Fortune also noted that “economists expect China’s GDP will expand 8.2%” in 2021, “continuing to outpace global peers, even as other large economies begin to recover with vaccines being rolled out.”", "Editor’s Note: FactCheck.org does not accept advertising. We rely on grants and individual donations from people like you. Please consider a donation. Credit card donations may be made through our “Donate” page. If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, 202 S. 36th St., Philadelphia, PA 19104.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]