["A video of a woman praising the Hindu scripture Bhagavad Gita and Hindu deity Krishna is circulating with the claim that she is New Zealand Prime Minister Jacinda Ardern. The video was shared on social media after Janmashtami i.e., August 12. Facebook user Rajendran Pillai SN posted it on August 13 (archive).", "Jacinda Kate Laurell Ardern is a New Zealand politician who has served as the 40th prime minister of New Zealand. Please listen to her for what she is telling about Bhagwan Shri Krishna and Bhagavad Gita. Jay Shri Krishna 🙏🙏🌷🌷🙏🙏", "Posted by Rajendran Pillai SN on Thursday, 13 August 2020", "The same was shared on Twitter.", "Namaste, 🙏#Janmashtami is an annual festival in India and believers of Sanatana Dharma world over to celebrate the birth of Lord Krishna, 8th Avatar of God.", "Listen to what the honorable Prime Minister of New Zealand Smt. @jacindaardern has to say about Life and Krishna.", "Jay pic.twitter.com/vv1MYhTIeV", "— 𝙅𝙖𝙮𝙖𝙥𝙧𝙖𝙠𝙖𝙨𝙝 𝙈𝙤𝙝𝙖𝙣 @ 🔟 🦂 🌠 ⚡ 🐯 (@jay2406) August 14, 2020", "Alt News has also received several fact-check requests for the video.", "The woman in the video is not New Zealand Prime Minister Jacinda Ardern, but American Hindu member of the US Congress Tulsi Gabbard. She had tweeted the video for Janmashtami on August 11 and wished everyone for the festival.", "To all celebrating around the world, I want to wish you a very Happy Janmashtami! May we always be blessed with remembrance of Sri Krishna, His unconditional love, and His transcendental appearance in this world. Jai Sri Krishna! #HappyJanmashtami #KrishnaJanmashtami pic.twitter.com/gh69gw5Xe4", "— Tulsi Gabbard 🌺 (@TulsiGabbard) August 11, 2020", "Gabbard had also shared the video on Facebook, Instagram and YouTube.", "The clip, therefore, is falsely circulating in the name of Prime Minister Jacinda Ardern who was hailed for making New Zealand COVID-19 free. It is noteworthy that after Arden’s government recorded no new cases of community transmission for over 100 days, the country saw a second wave of the virus outbreak. Elections in the country, scheduled for September 19, have been delayed for four weeks. Earlier, a video of Ardern visiting a Hindu temple ahead of polls was shared with the false claim that she visited the temple after the country was declared COVID free.", "Donate Now", "Kinjal Parmar holds a Bachelor of Science in Microbiology. However, her keen interest in journalism, drove her to pursue journalism from the Indian Institute of Mass Communication. At Alt News since 2019, she focuses on authentication of information which includes visual verification, media misreports, examining mis/disinformation across social media. She is the lead video producer at Alt News and manages social media accounts for the organization.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]