["The online report was published here on May 27, 2019.", "Below is a screenshot of the online report:", "The Tagalog language headline translates to English as: “Pastor Apollo Quiboloy Dead After he was shot by a member of KAPA”.", "The text in the inset photo at the right translates to English, says: “PASTOR WHO WAS SHOT”.", "Quiboloy is the founder of “Kingdom of Jesus Christ The Name Above Every Name”, a Filipino religious organization. Here is his biography on his official website.", "He was named Duterte’s spiritual adviser in 2016, according to Mike Abe, Quiboloy's spokesman for that year. \"That happened in 2016, after the president won,\" he told AFP in a phone call on July 10, 2019. Here is a CNN Philippines report published on May 23, 2016, about Quiboloy's position.", "KAPA is a religious organization which Duterte ordered should be shut down in June 2019 for allegedly operating an investment scam.", "The misleading online article contained a YouTube link to this local news report by GMA about the 2018 killing of a different pastor, Carlito Bulloron.", "The article was shared multiple times on Facebook, including here and here with a similar claim.", "The claim is false; Pastor Quiboloy has appeared in public since the claim was published.", "On June 30, 2019, Quiboloy spoke at the Kingdom Of Jesus Christ Cathedral in the southern city of Davao.", "Below is the video embedded in his Facebook post:", "Quiboloy also appeared in this YouTube livestream on July 7, 2019, at an event for the Kingdom of Jesus Christ in the northern province of Isabela.", "He appears in the video below from the two hour 15 minutes mark.", "Quiboloy also interviewed Duterte on July 16 in the southern city of Davao. The interview was livestreamed on Facebook; it is embedded below.", "Duterte’s spokesman Salvador Panelo told AFP the interview happened on July 16.", "In response to a text message on July 17 asking whether Duterte had been interviewed by Quiboloy on July 16, Panelo replied by text: \"Yes\".", "The misleading online article has been shared 380 times according to data from social media monitoring tool Crowdtangle.", "Below is a screenshot of the Crowdtangle data:", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]