["By Saranac Hale Spencer", "Posted on July 15, 2020", "A viral video falsely labeled “Registered Republican Not Allowed to Vote!” suggests that Republicans were kept from voting in Louisiana’s recent primary. The person featured in the video — which has been viewed millions of times — was actually registered as a Democrat, so she couldn’t vote in the closed Republican primary.", "Louisiana held its presidential primary on July 11. Two days later, a popular conservative Facebook page posted a video claiming that a registered Republican there wasn’t allowed to vote.", "The video is labeled: “Registered Republican Not Allowed to Vote!” It has been viewed more than 4 million times so far.", "But the woman featured was actually registered as a Democrat.", "Holly Sanders, who made the video of herself after leaving her polling place in Lafayette Parish, said in the recording, “I just went to vote and I got inside and I couldn’t vote for my party.”", "She went on to say, “I am registered as a Republican, I know damn well I am, and, for some reason, I’m now Democrat today. And I cannot vote unless I vote Democrat.”", "But voter registration records list her as a Democrat. Sanders first registered in 1997, Charlene Menard, registrar of voters in Lafayette Parish, said in a phone interview with FactCheck.org. Sanders’ most recent registration was done online in 2015, which requires voters to select their preferred party affiliation, Menard said.", "In the video, Sanders addressed her registration as a Democrat, saying, “Somewhere along the way something got messed up.” She gestured with air quotes. “Yeah. Got messed up, alright.”", "The video prompted tens of thousands of comments, many expressing sentiments like this: “Cheating is the only way these Democrat Demons can win.”", "When we reached her by phone, though, Sanders said, “Am I saying I was switched? No. All I’m saying is go check yourself.” She didn’t answer direct questions about her party registration, but she said several times that she would encourage other voters to check their party affiliation before the November presidential election.", "Referring to the popularity of her video after it was picked up by conservative commentator David J. Harris Jr.’s Facebook page, Sanders said, “I’m suddenly this face of America… otherwise I’d take it down.”", "Sanders couldn’t remember how often she had voted or if she’d ever voted in a primary election before this one, but she said that she wasn’t very political until President Donald Trump became a candidate.", "In the video, Sanders is wearing a hat that says, “Yes, I’m a Trump girl — get over it” and she ends the recording with, “Go Trump!”", "Menard said that her office received complaints similar to Sanders’ on primary day, estimating that there were about 200 calls from voters who wanted to change their party affiliation.", "“Louisiana, in the olden days, was a Democrat state,” Menard said. “Along the way, people started changing, but didn’t change their voter registration.”", "And, in Louisiana, the two major parties hold closed presidential primaries, meaning that only those who are members of the party can vote to elect the party’s candidate for president.", "So, that’s why Sanders wasn’t able to vote in the Republican primary — she wasn’t a member of the Republican Party.", "All other primaries and elections in Louisiana are open to participation regardless of party affiliation.", "As for the results of the Louisiana Republican primary, Trump won his party’s support with 96% of the vote, according to the Louisiana Secretary of State’s office. Former Massachusetts Gov. William Weld finished a distant second with 2% of the vote.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "Menard, Charlene. Registrar of voters, Lafayette Parish, Louisiana. Telephone interview. 13 Jul 2020.", "Voter registration, Holly Sanders. Lafayette Parish. 29 Jul 2015.", "Louisiana Secretary of State. Presidential Preference Primary and State and Local Party Elections. Accessed 13 Jul 2020.", "Sanders, Holly. Creator, Facebook video. Telephone interview. 13 Jul 2020.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]