["The photo, which has been shared more than 1,000 times since it was posted here February 4, 2019, purports to show Duterte and Kim eating chicken at Jollibee, the biggest fast food chain in the Philippines, which has branches worldwide.", "Below is a screenshot of the post:", "The post’s caption, when translated to English, says: “To the animals who are Yellows and are saying President Duterte is dead…Here he is eating at Jollibee with the leader of North Korea who is Kim Jong Un…Maybe you want them to shoot you, you sons of bitches!!!”", "“Yellows” is a reference to supporters of the Liberal party, the main opposition political party in the Philippines.", "On February 3, Duterte dismissed rumours he was dead with a Facebook video, according to media reports.", "A reverse image search of the photographs used in the misleading Facebook posts traced them back to media coverage of the impersonators' recent outing in Hong Kong, for example this BBC report headlined \"In pictures: Rodrigo Duterte and Kim Jong-un impersonators cause a stir\".", "The report is about Howard X and Cresencio Extreme, impersonators of Kim Jong Un and Duterte respectively, who visited Hong Kong February 3.", "The photo used in the misleading post which claims to show Duterte and Kim at Jollibee was actually taken by the European Press Photo Agency on February 3, 2019 in Hong Kong.", "Here is a screenshot of the photo from the EPA website:", "An AFP report on the two impersonators in Hong Kong can be seen here.", "Below is an AFP video report on the two impersonators in Hong Kong, clearly showing it is the same two men as appear in the misleading Facebook post's photographs:", "Comments like the one below indicate that some Facebook users believed the misleading posts’ claims.", "When translated to English, this says: “Hahaha, son of a bitch, how can they say he is dead when he is devouring chicken, son of a bitch who said that news bury him alive hahaha”.", "The post has been shared more than 1,000 times by Facebook groups which support Duterte.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]