["About this rating", "An image purportedly showing Gareth Southgate, the manager of England's football team, wearing a waistcoat with the words \"It's coming home\" repeatedly patterned across it started circulating on social media during the 2018 FIFA World Cup international football tournament:", "\"It's Coming Home\" is a reference to the song \"Three Lions,\" which has become the anthem of England's football team. Although Southgate is most likely a fan of his club's unofficial slogan, he did not have the song's lyrics scrawled across his waistcoat:", "Edwards' attire during the World Cup has drawn a fair amount of media attention, with The Guardian reporting that Marks & Spencer, the official suit supplier to the England team, saw a 35% increase in waistcoat sales thanks to the \"Gareth Southgate effect.\" The clothing company even announced a national \"Waistcoat Day\" in an attempt to bring the team luck during the quarter finals:", "M&S (Official Tailor to the England team) has been proud to see Gareth Southgate sporting his M&S waistcoat on the sidelines for all four of England's games. And in a term many have coined the ‘Southgate Effect', waistcoats have been flying off the shelves of M&S stores and into the online baskets on M&S.com. Sales of all M&S waistcoats have gone up by 35%. With 57 waistcoats available at M&S, starting from £19.50, there’s a waistcoat for everyone to show their support this Saturday.", "David Binns, Head of Menswear Buying at M&S said, “England have reached the quarter finals, and frankly, we could not be more excited. With some saying THE waistcoat has been bringing the team extra luck we thought how better to mark the big game than launching National Waistcoat Day. Best of luck to the team – we hope they bring it home!”", "Needless to say, plenty of images of Southgate in his signature waistcoat are available, and none of those genuine photographs features the words \"It's Coming Home\" visible on his clothing.", "Here's a photograph of Gareth Southgate, as well as a close up look at his navy blue waistcoat, in which the words \"It's Coming Home\" are nowhere to be found:", "Belam, Martin.   \"Waistcoat Sales Up as Gareth Southgate Sets Trend at World Cup.\"\r\n    The Guardian.   1 July 2018.", "Kelly, Ryan.   \"Three Lions: England Song Lyrics, Meaning & 'Football's Coming Home' Anthem Profile.\"\r\n    Goal.com.   6 July 2018.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]