["About this rating", "A photograph captures members of the New York State Senate sitting during a recitation of the Pledge of Allegiance.", "The image depicts a protest rather than an ordinary occurrence, and it took place in a state legislature and not the U.S. Congress.", "In August 2016, outrage swept across the internet over NFL quarterback Colin Kaepernick's refusal to stand during the playing of the U.S. national anthem. As commentators debated the merits of Kaepernick's protest against police violence and structural oppression, a photograph appeared purportedly showing members of the U.S. government seated during the Pledge of Allegiance in support of Kaepernick's stance:", "Y'all are mad at an athlete? This is your government!", "The photograph was taken on 23 June 2009 by Associated Press photographer Tim Roske, and it shows New York state senators sitting in protest during a recitation of the Pledge of Allegiance.", "The New York state senate was controlled by Democrats by a 32-30 margin at the beginning of the summer that year, but Republicans managed to take control of the chamber on 8 June 2009 when they persuaded two Democrats to switch sides and thus reversed control of the senate. The remaining Democrats protested, and for more than a month the senate was at a standstill:", "Democrats turned out the lights and left. They took the keys to the chambers. Republicans held a session and stood to say the Pledge of Allegiance; Democrats, including Dave Valesky, of Oneida, refused to stand.", "Things got worse. A week after the coup, Monserrate slipped back to the Democratic fold, and a monthlong standoff ensued while the Senate was deadlocked 31-31. No business was conducted. Bills remained locked in a drawer. The deadlock became national news.", "So although the photograph is real, it captured an unusual interval of protest rather than something that occurs on a regular basis:", "Coin, Glenn.   \"Syracuse-Area Lawmakers Who Are Seeking Re-Election Played Key Roles in 2009 Senate Coup.\"\r\n    Syracuse.com.   21 October 2010.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]