["About this rating", "A \"Trump Defeats COVID-19\" commemorative coin can be purchased from WhiteHouseGiftShop.com.", "WhiteHouseGiftShop.com is not the official gift shop of the White House, and these commemorative coins were not officially sanctioned by the United States government.", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "In October 2020, shortly after U.S. President Donald Trump tested positive for COVID-19, a rumor started circulating on social media that the White House gift shop was selling a \"Trump Defeats COVID-19\" commemorative coin:", "WhiteHouseGiftShop.com is selling a \"Trump Defeats COVID-19\" commemorative coin. However, this website is not the official gift shop of the White House, the government does not dictate what this business sells, and the Trump administration does not make a profit from its sales.", "This isn't the first time this misleadingly named gift shop has caused confusion online. In April 2020, a similar rumor went viral after social media users claimed that the United States government was selling \"Coronavirus Task Force\" coins at its gift shop. Again, while the coins were real, the website selling them was not officially affiliated with the government.", "The website's owner, Anthony Giannini, told us at the time that the White House Gift Shop \"is not affiliated with The White House, nor is The White House involved in any of our decisions, products, or operations.\"", "While this website does not have any current ties to the government, it does have a long (and somewhat convoluted) history that can reportedly be traced back to the 1950s when U.S. President Truman set up a gift shop in the basement of the White House:", "While it traces its history to a 1950 authorization by President Harry Truman, the headquarters of the White House Gift Shop has been in Lititz since 2012. It’s operated by Lititz (Pennsylvania) resident Anthony Giannini with his wife, Helen.", "“It’s very weird and very cool,” Giannini says of the shop’s curious history and its current location.", "After a failed assassination attempt of Truman in 1950 left one member of White House Police dead, Truman authorized a fund to benefit the family of the slain officer and the others who were injured in the attack by two Puerto Rican nationalists.", "When the White House Police became the Secret Service, the Truman-authorized fund became the Secret Service Uniformed Division Benefit Fund.", "The fund was replenished from the sale of items from a gift shop originally set up in the basement of the White House but eventually relocated to the nearby executive mansion.", "While Giannini was granted a trademark to use the name \"White House Gift Shop,\" this business has not been officially affiliated with the government since at least 2012.", "Umble, Chad.   \"From 1600 Pennsylvania Ave. to Warwick Center: How the White House Gift Shop wound up in Lititz.\"\r\n    Lancaster Online.   27 May 2019.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]