["By Sydney Schaedel", "Posted on June 6, 2017", "Q: Did a potential nominee for “chief scientist” at the U.S. Department of Agriculture call scientists “dumb, regular people” who “think dinosaurs actually existed and the Earth is somehow getting warmer”?", "A: No. That’s a bogus quote in a fake story by a “News/Satire” website.", "Sam Clovis, who President Donald Trump is reportedly planning to nominate as the Department of Agriculture’s “chief scientist,” did not call scientists “dumb, regular people.” That quote, and others, were attributed to Clovis in a satirical news story.", "Facebook users flagged a version of the bogus story published on USPoln.com with the headline “Trump’s Top Scientist Pick: ‘Scientists Are Just Dumb Regular People That Think Dinosaurs Existed and The Earth Is Getting Warmer.'” The article includes fake quotes that Clovis purportedly made in an interview with “KYXL Radio,” which is also not real.", "Clovis, a former Trump campaign co-chair and policy adviser, is currently a senior White House adviser within the USDA. However, his expected nomination to serve as the undersecretary of the agency’s Research, Education and Economics division is controversial.", "While Clovis served in the U.S. Air Force, earned a doctorate in public administration, taught economics and public policy at Morningside College, and hosted a conservative talk radio show in Iowa, he lacks an extensive background in science. Critics argue that makes him unqualified for the undersecretary position known as the USDA’s “chief scientist.”", "In the story on USPoln.com, Clovis is quoted saying that he is “proud” that he doesn’t have a scientific background, and was “disappointed” with his USDA assignment because he doesn’t “agree with anything these people are trying to do.” Clovis, the story alleges, also called scientists “narrow-minded” and “dumb, regular people with limited vision.”", "But he didn’t really say that. USPoln calls itself a “News/Satire” website and says on its “about us” page that its content “may include information from sources that may or may not be reliable and facts that don’t necessarily exist” and “these articles should be considered satirical and any and all quotes attributed to actual people complete and total baloney.”", "As we often see with fake news stories, the one on USPoln was lifted from another unreliable website. In this case, it’s an exact copy of a May 14 story posted on Politicops.com, which falls under Newslo’s umbrella of websites. We’ve written about Newslo stories several times before, as they regularly feature fabricated quotes.", "Newslo, like USPoln, calls itself a “hybrid News/Satire platform.” But, unlike USPoln, stories posted on Newslo affiliated websites have “fact-buttons” that highlight the sections of its articles that usually come from legitimate news articles.", "In this case, the first paragraph of the satirical story, which describes the “chief scientist” position and Clovis’ background, was mostly taken from the opening of a ProPublica article titled “Trump’s Expected Pick for Top USDA Scientist Is Not a Scientist.”", "ProPublica, May 12: The USDA’s research section studies everything from climate change to nutrition. Under the 2008 Farm Bill, its leader is supposed to serve as the agency’s “chief scientist” and be chosen “from among distinguished scientists with specialized or significant experience in agricultural research, education, and economics.”", "But Sam Clovis — who, according to sources with knowledge of the appointment and members of the agriculture trade press, is President Trump’s pick to oversee the section — appears to have no such credentials.", "Clovis has never taken a graduate course in science and is openly skeptical of climate change. While he has a doctorate in public administration and was a tenured professor of business and public policy at Morningside College for 10 years, he has published almost no academic work.", "Clovis is better known for hosting a conservative talk radio show in his native Iowa and, after mounting an unsuccessful run for Senate in 2014, becoming a fiery pro-Trump advocate on television.", "The rest of the Newslo story was totally made up.", "Clovis is “openly skeptical of climate change,” as ProPublica reported. In a 2014 interview with Iowa Public Radio, Clovis, then a Republican U.S. Senate candidate, was asked if he believed “that climate-warming trends over the past century are very likely due to human activities.” He described himself as “a skeptic.”", "“I have looked at the science and I have enough of a science background to know when I’m being boofed,” Clovis said in the interview. “And a lot of the science is junk science. It’s not proven; I don’t think there’s any substantive information available to me that doesn’t raise as many questions as it does answers. So I’m a skeptic.”", "But Clovis didn’t say, as the fake story said, scientists are “dumb, regular people with limited vision who think dinosaurs actually existed and the earth is somehow getting warmer.”", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to help identify and label viral fake news stories flagged by readers on the social media network.", "Harvey, Chelsea, and Eilperin, Juliet. “Trump’s expected choice for USDA science job lacks hard-science background.” Washington Post. 13 May 2017.", "Huseman, Jessica. “Trump’s Expected Pick for Top USDA Scientist Is Not a Scientist.” ProPublica. 12 May 2017.", "Heller, Marc. “Possible Trump pick for USDA science post draws darts.” EENews.net. 15 May 2017.", "USPoln. “Trump’s Top Scientist Pick: ‘Scientists Are Just Dumb Regular People That Think Dinosaurs Existed And The Earth Is Getting Warmer.‘” Accessed 5 Jun 2017.", "Nebbe, Charity, and Perkins, Katherine. “Candidate Profile: Sam Clovis.” Iowa Public Radio. 27 May 2014.", "USPoln. “About Us.” Accessed 5 June 2017.", "Newslo. “Trump’s Top Scientist Pick: ‘Scientists Are Just Dumb Regular People That Think Dinosaurs Existed And The Earth Is Getting Warmer.” 14 May 2017, accessed 5 Jun 2017.", "Schaedel, Sydney. “A Fake Tom Price Quote.” FactCheck.org. 23 Mar 2017.", "Gore, D’Angelo. “A Fake Mike Pence Quote.” FactCheck.org. 21 Dec 2016.", "Newslo. “About Us.” Accessed 5 June 2017.", "FactCheck.org Rating:", "Read More", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]