["About this rating", "On Dec. 7, 2020, Florida Department of Law Enforcement agents executed a search warrant at the Tallahassee home of Rebekah Jones, and confiscated some of her electronic devices as part of an investigation into an alleged unauthorized use of the state department of health's internal messaging service.", "However, police did not forcibly or suddenly enter Jones' home. She opened the door to the agents after refusing to grant them entry for 20 minutes, according to state officials.", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "In December 2020, national and local news outlets reported that Florida police had \"raided\" the home of Rebekah Jones, a former Florida Department of Health employee who was fired from her position as an environmental health program consultant in May 2020, under controversial circumstances.", "On Dec. 7, 2020, CNN reported that:", "Florida police raided the home of a former state coronavirus data scientist on Monday, escalating a feud between the state government and a data expert who has accused officials of trying to cover up the extent of the pandemic. The Florida Department of Law Enforcement executed a search warrant Monday morning at the home of data scientist Rebekah Jones, who was fired by the state Department of Health in May. The agency is investigating whether Jones accessed a state government messaging system without authorization to urge employees to speak out about coronavirus deaths, according to an affidavit by an agent working on the case.", "Similar articles were published by CBS News, Yahoo! News, the Tallahassee Democrat and The Miami Herald. Those reports were largely accurate, but the description of the incident as a \"raid\" tended to exaggerate the apparent level of force and surprise involved in the actions of state law enforcement agents.", "On Dec. 7, Jones herself tweeted about the incident, posting a short video of the moment Florida Department of Law Enforcement (FDLE) agents entered her home in Tallahassee.", "On Twitter, she wrote that the agents entered her home at around 8:30 a.m., serving a search warrant based on a complaint by the state department of health, then took her electronic devices and \"pointed a gun in my face\" and \"pointed guns at my kids.\"", "Jones added that Florida Governor Ron DeSantis had \"sent the gestapo\" (secret state police), and said the search was \"what happens to scientists who do their job honestly,\" and \"what happens to people who speak truth to power.\" Speaking to The Miami Herald, Jones added that an agent or agents had pointed a gun \"at my two-year-old’s face.\"", "In an interview with CNN's Chris Cuomo, Jones said the search was a \"very thinly-veiled attempt [by] the governor to intimidate scientists and get back at me, while trying to get to my sources...\"", "Jones has insisted that she was fired in May 2020 because she refused to manipulate COVID-19-related data, while The Associated Press reported that she had made repeated, unauthorized public comments about Florida's COVID-19 data collection methods. In July, a spokesperson for the department of health provided the following statement to Snopes, explaining that Jones had been fired for an alleged \"repeated course of insubordination\":", "Rebekah Jones’ duties were to display data obtained by the Department’s epidemiological staff. The team that created the graphics on the dashboard, which was made up by multiple people, received data that was provided by subject matter experts, including Senior Epidemiologists, Surveillance Epidemiologists, and a Senior Database Analyst.", "Rebekah Jones exhibited a repeated course of insubordination during her time with the Department, including her unilateral decisions to modify the Department’s COVID-19 dashboard without input or approval from the epidemiological team or her supervisors. The blatant disrespect for the professionals who were working around the clock to provide the important information for the COVID-19 website was harmful to the team.", "Accuracy and transparency are always indispensable, especially during an unprecedented public health emergency such as COVID-19.  Having someone disruptive cannot be tolerated during this public pandemic, which led the Department to determine that it was best to terminate her employment.", "Since her dismissal, Jones has set up Florida Covid Action, an alternative provider of COVID-19-related data in the state of Florida.", "Although several headlines referred to a purported \"raid\" on Jones' home, a term that connotes a sudden and forced entry, the video posted by Jones herself clearly shows that she opened the door for the agents. In a statement, the FDLE said:", "\"Agents knocked and called Ms. Jones both announcing the search warrant and encouraging her to cooperate.  Ms. Jones refused to come to the door for 20 minutes and hung-up [sic] on agents. After several attempts, Ms. Jones allowed agents inside.\"", "Furthermore, while Jones claimed FDLE agents had pointed guns at her, her husband, and her children, the video footage she posted does not support those claims. The footage shows agents bearing firearms, and at least momentarily, pointing them up the stairs while ordering Jones' husband to come downstairs. The footage does not show the agents pointing guns at or \"in the face\" of anyone. Snopes asked Jones if she had additional video footage that might support those particular claims. In response, Jones claimed \"the video shows\" that her husband and children were at the top of the stairs. In reality, neither her husband nor her children are shown in the footage at all.", "For its part, the FDLE said in its statement that \"At no time were weapons pointed at anyone in the home.\" On Dec. 10, after this fact check was originally published, the FDLE published 30 minutes of body-worn camera footage from one of its agents, during the execution of the search warrant.", "That footage vindicates the claim that, for around 20 minutes, Jones failed to answer the door to agents. It also supports the assertion that no officer pointed a weapon at Jones, although the footage does not show any interactions with Jones' family members inside the house so the question of whether officers pointed weapons directly at her husband or children remains unproven.", "The search of Jones's home, and the confiscation of several electronic devices, came as the result of an investigation into an alleged incident on Nov. 10, 2020. According to an affidavit signed by FDLE Special Agent Noel Pratts, an unidentified person or persons gained unauthorized access to an internal department of health online messaging service, and sent the following message to hundreds of departmental staff at 2:20 p.m.:", "\"It's time to speak up before another 17,000 people are dead. You know this is wrong. You don't have to be part of this. Be a hero. Speak out before it's too late.\"", "According to Pratts' affidavit — which was originally published by The Miami Herald and can be viewed in full here — a check of the technical logs for the internal messaging service revealed that the message sent at 2:20 p.m. was sent from an internet protocol (IP) address located at Jones' place of residence.", "The affidavit stipulates that the search was warranted because probable cause existed that the person or persons operating from that IP address at that time had, through their actions, violated Chapter 815.06(2)(a) of the Florida statutes, which states that:", "(2) A person commits an offense against users of computers, computer systems, computer networks, or electronic devices if he or she willfully, knowingly, and without authorization or exceeding authorization:", "(a) Accesses or causes to be accessed any computer, computer system, computer network, or electronic device with knowledge that such access is unauthorized or the manner of use exceeds authorization.", "The penalty for that offense, which is a third-degree felony, is a prison sentence of up to five years, andor r a fine of up to $5,000.", "In her CNN interview, Jones denied having sent the message in question, or gaining unauthorized access to the department of health's internal messaging service. Snopes asked Jones if she could explain the significant discrepancy between her denial of involvement, and the FDLE's conclusion that the unauthorized message was sent from her home.", "In response, Jones said the department of health provided the FDLE with the IP address in question, and the FDLE then \"found out who the IP address belonged to,\" but she claimed that \"nowhere in the affidavit does it state that the police tied the IP address to the message.\"", "But that is inaccurate. On page three of his affidavit, Pratts specifically noted that the IP address in question \"sent the group text on November 10, 2020, at 1420 hours\" — that is, the \"Be a hero\" message.", "Jones additionally told Snopes that charges had not yet been filed against her as of Dec. 8, 2020. However, on Jan. 16, 2021, after this fact check was originally published, Jones appears to have turned herself into police on foot of an arrest warrant. On Twitter, she wrote that \"the state has issued a warrant for my arrest,\" and said \"To protect my family from continued police violence, and to show that I'm ready to fight whatever they throw at me, I'm turning myself into police in Florida Sunday night [Jan. 17, 2021].\"", "NPR reported that Jones had been booked into the Leon County Detention Facility in Tallahassee, Florida, on Jan. 17. A Leon County Sheriff's Office booking report for that day does not list Jones among the detainees, but does contain an entry that strongly appears to be related to her case.", "The charges were listed as \"PROPERTY CRIMES — ACCESS COMPUTER ELECTRONIC DEVICE WO AUTHORITY\" and the photograph was omitted from the entry under a public records exemption that relates to \"former civilian personnel\" — both of which suggest the listing is related to Jones, and that she had indeed turned herself in to police on Jan. 17, 2021.", "[Updated] Dec. 11, 2020: Added a link to, and description of, the body-worn camera footage of the search warrant execution, published by the FDLE on Dec. 10, 2020.", "[Updated] Jan. 19, 2020: Added reference to Jones' turning herself in to police in Florida on Jan. 17, 2021.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]