["Sadhvi Pragya, accused in the 2008 Malegaon blasts case, will be contesting the ongoing Lok Sabha election on a BJP ticket. News of Pragya’s nomination from Bhopal, MP had sparked a furore. On social media, several netizens hit out at the BJP for nominating a terror accused.", "One of them was actor Swara Bhaskar, who lashed out at the ruling party, referring to Pragya as ‘Malegaon terror accused’ and ‘potential terrorist’. Quote-tweeting her, journalist and executive editor with Network 18, Amish Devgan tweeted that Pragya has been acquitted by the court.", "She is acquitted from court which was false narrative of Hindu terrorism now you don’t trust judiciary also ? हिंदू कभी अक्रांता नहीं रहे इतिहास गवाह है ।टाइम पास के लिए कुछ भी न लिखे । फिर आप पड़ोसी देश में superStar बन जातें हैं । https://t.co/RhG0xogkH3", "— Amish Devgan (@AMISHDEVGAN) April 17, 2019", "Devgan’s tweet has been retweeted over 5000 times and ‘liked’ over 13000 times since he posted it on April 17. Apart from Devgan, several prominent pro-BJP handles have tweeted saying Sadhvi Pragya has been acquitted in the Malegaon blasts case.", "Kanhaiya is ‘innocent’ until proven guilty but Sadhvi Pragya, who has been acquitted in the Malegaon blast case, is still an ‘accused’. Is vibrator battery down?? pic.twitter.com/LvpzO5dCvk", "— Chowkidar Saffronista (@MsKaushik_) April 17, 2019", "The above tweet has been retweeted over 900 times so far. Other prominent handles which made the same assertion include RituRathaur and desimojito.", "Liberals who signed petititons for terrorists Yakub Menon & Kasab r having severe meltdown ovr BJP giving ticket to Sadhvi pragya Fact that she was kept in jail for 8yrs without evn a chargesheet,was given 4th degree torture,that she is acquitted by court means nothing to them!", "— Ritu (सत्यसाधक)🇮🇳 (@RituRathaur) April 17, 2019", "An acquittal means a judgement which absolves an individual accused of a crime. The person in question is declared not guilty via a judgement. While the same could be challenged in a higher court (if the verdict has been delivered by a lower court), an acquittal is essentially an affirmation of non-guilt. In the case of Sadhvi Pragya, it may be noted there has been no acquittal.", "Sadhvi Pragya is currently out on bail. She was granted bail on health grounds. According to the bail order given by a Bombay High Court bench headed by Justices Shalini Phansalkar Joshi and Ranjit More, Sadhavi Pragya was given bail because she was “suffering from breast cancer” and was “cannot even walk without support”.", "The trial of Sadhvi Pragya and others, accused in the 2008 Malegaon blasts case, is still underway. Pragya has been charged under various sections of the Unlawful Activities (Prevention) Act. In December 2017, a special NIA court had ruled that Sadhvi Pragya, Lt. Col Prashant Purohit and six others be charged under the UAPA.", "The Unlawful Activities (Prevention) Act, is “An Act to provide for the more effective prevention of certain unlawful activities of individuals and associations [and for dealing with terrorist activities] and for matters connected therewith.” It was promulgated in 1967 and has been amended many times since then.", "The court had however dropped the draconian Maharashtra Control of Organised Crime Act (MCOCA) against the accused. It may be noted that dropping of the MCOCA charges cannot be confused with an acquittal in any case as it specifically means that the person is absolved of the charges. Pragya’s role came under the scanner after the motorcycle used in the blast was reportedly registered in her name. According to the charge sheet filed by Maharastra’s Anti Terrorist Squad (ATS), Pragya was part of most meetings of the radical activists from 2006, who had planned to attacks Muslim-majority areas. She also allegedly took charge of finding men to execute the attacks.", "The fact of the matter is that Sadhvi Pragya has NOT been acquitted by the court over her alleged role in the 2008 Malegaon blasts case. The assertions made in this regard by pro-BJP social media users and some prominent figures are patently false.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]