["The photo was published here on a Facebook post on February 15, 2021.", "The Hindi caption translates to English as: “In solidarity with Indian farmers, the farmers came out with tractors protesting in Berlin city, Germany. No tear gas, no water cannons, this is democracy.”", "Tens of thousands of farmers from northern India have been protesting against the new agricultural laws near the capital Delhi since November 2020.", "The photos were also shared alongside similar claims here and here on Facebook; and here and here on Twitter.", "The claim, however, is false.", "A reverse image search on Google found the original photo published here by American news agency Associated Press in a report about farmers’ protest in Berlin on November 26, 2019 against the German government’s agricultural policies.", "Below is a screenshot of the Associated Press photo by Michael Sohn:", "“Farmers have parked their tractors on a road close to the Victory Column in Berlin, Germany, Tuesday, Nov. 26, 2019. Some thousands farmers are expected in the German capital for a protest rally against the German and European agriculture policy. (AP Photo/Michael Sohn),” the photo caption reads.", "Below is a screenshot of the image used in the misleading posts (L) and the Associated Press image (R)", "AFP also reported about the farmers’ protests in Berlin in 2019.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]