["The video was published on Facebook here on December 1, 2020. It has been viewed more than 400 times.", "The one-minute video shows big waves hitting an embankment. Text on the screen states: ”Penang 2nd bridge at 6.00pm yesterday”. The claim is also repeated in the Facebook post’s caption.", "A combination of a high tide and heavy rains have caused flooding in parts of the Malaysian state of Penang, reported The Star, a Malaysian newspaper, here on November 29, 2020.", "The video has also been shared alongside a similar claim here, here and here on Facebook.", "The video has garnered more than 5,300 views after it was shared here on YouTube. The title reads: “Penang Bridge Tsunami”.", "The claim, however, is false.", "A reverse image search using keyframes from the video, extracted with digital verification tool InVID-WeVerify, found the same video was posted on YouTube here on August 24, 2017.", "The YouTube video is titled: “Minicoy Eastern Jetty ROUGH SEAS.”", "The Eastern Jetty is located at Minicoy Island, which is part of the tropical archipelago of Lakshadweep in southwestern India.", "Below is a screenshot comparison of the video from the misleading post on Facebook (L) and the YouTube video published in 2017 (R):", "A picture tagged at the location of the Eastern Jetty on Minicoy Island on Google Maps corresponds with the video.", "This December 1, 2020, Twitter thread from the official account of the Penang Second Bridge, also known as the Sultan Abdul Halim Muadzam Shah Bridge, refuted the claim in the misleading posts.", "Translated from Malaysian to English, the tweets partly read: “FALSE VIDEO: Recently, there has been a video showing big waves hitting part of the structure of Sultan Abdul Halim Mu’adzam Shah Bridge, JSAHMS (Penang Second Bridge).", "“The Second Bridge Sdn Bhd (JKSB), as the concessionaire of JSAHMS, denies the authenticity of the video and it does not occur in the JSAHMS area.", "“The same video started to spread on social media in 2018 and the Penang Island City Council has insisted that the video titled ‘Penang 2nd bridge at 6.00 pm yesterday’ is not at all true.”", "The Penang Island City Council also posted a similar denial on October 15, 2018, on its official Facebook page here.", "This is what the Penang Second Bridge looks like.", "AFP has earlier debunked a different false claim, that the video shows a tsunami in the US state of Alaska.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]