["The claim started circulating on April 13, 2020, in an article published by Ugandan daily tabloid Red Pepper. The story was titled \"World Bank Applauds Tanzania on Anti Corona Policy Response, Warns African Countries Copying Western Anti-COVID19 Policies in Report\".", "It alleges that the World Bank \"commended Tanzania as one of the best examples for its strategic approaches that considers the best of its political economy and well-being of the society\", in the latest version of its biannual Africa's Pulse report.", "Red Pepper’s article attracted over 5,000 interactions on Facebook, according to the social media monitoring tool CrowdTangle.", "On April 14, 2020, two Tanzanian newspapers -- Tanzania Perspective and the Times Observer -- printed articles headlined “World Bank applauds Tanzania on anti COVID-19 policy” and “WB applauds JPM on COVID-19 response”, respectively. JPM refers to Tanzanian President John Pombe Magufuli.", "The articles, which also made reference to the Africa’s Pulse report, claimed Tanzania was recognised for implementing unique policies to cushion the economy instead of copy-pasting what countries in the West were doing.", "The claim has also been shared in Facebook posts here and here.", "While countries across Africa have taken stringent measures to fight COVID-19  such as curfews and partial or full lockdowns, Tanzania has  taken a lighter approach.", "While schools have been closed and sports events scraped, Tanzania’s president has encouraged gathering in places of worship, as reported by AFP.", "“This is (the) time to build our faith and continue praying to God and not depending on face masks. Don't stop going to churches and mosques for prayers. I'm sure this is just a change of wind and it will go like others have gone,\" Magufuli said last month during a church service in Dodoma. He later reiterated this message during a Good Friday address.", "As Magufuli continues to encourage citizens to go on with most of their normal activities to sustain the economy, opposition leaders have criticised him for not taking a stricter stance in curbing the global pandemic.", "Did the World Bank applaud Tanzania’s policies?", "AFP reviewed the World Bank’s Africa’s Pulse report and did not find any specific praise for Tanzania’s COVID-19 response.", "Africa’s Pulse is a biannual publication containing an analysis of the near-term macroeconomic outlook for the region.", "In a statement, the World Bank unequivocally denied singling out Tanzania’s policy in its assessment of the economic impact of COVID-19 and policy responses in Sub-Saharan Africa.", "“Our attention has been drawn to news articles currently circulating in Tanzania and on various other websites regarding the World Bank’s recent economic update for Sub-Saharan Africa. On Thursday, April 9, the World Bank launched Africa’s Pulse, its regional economic update, in which the institution highlighted the significant impacts of the COVID-19 crisis on the region’s economy and on the welfare of citizens, and offered recommendations on the appropriate actions that governments may need to consider,” the statement said.", "“In this report, the World Bank does not make specific mention or assessment of Tanzania’s COVID-19 response.”", "The report recommends that African countries should customise their COVID-19 responses to fit the structural features of their economies. For instance, it warns that actions such as strict confinement might not work effectively in economies that heavily rely on the informal sector -- where the majority of the population needs to work every day to sustain their livelihoods.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]