["About this rating", "In July 2018, an image purportedly showing a woman named Fatima Hemminger began circulating on social media, along with the claim that she had just become the first Muslim Major General in the United States Air Force (USAF). Some iterations of the rumor presented the image as if Hemminger had appeared on the cover of Newsweek magazine:", "Major General Fatima Hemminger, commander of the Twelfth Air Force, United States Air Force. Fatima is the first female commander of the Twelfth Air Force, which is an air combat wing of the branch. She is also the first Muslim major general in the USAF, as well as the highest ranking hijabi Muslim within the Air Force.", "This image was often shared with comments from viewers who were inspired to see a Muslim woman achieve such a high rank in the United States military, but it's not a photograph of a woman who is named Fatima Hemminger and/or who is a Muslim and a Major General in the U.S. Air Force.", "These images, as well as the accompanying backstory about \"Fatima Hemminger,\" were both created by Deviant Art user \"CascadianPatriot\" in 2009 and filed under the \"Digital Art\" and \"Photomanipulation\" tags. Although it's cut off in the version seen above, this original fake Newsweek cover also predicted that Kathleen Sebelius, who served as the U.S. Secretary of Health and Human Services from 2009 until 2014, would be president in 2017.", "Although Fatima Hemminger is a fictional creation, these images of her are based on a photograph of a real female USAF Major General, Linda Hemminger:", "Maj. Gen. Linda S. Hemminger is mobilization assistant to the Deputy Surgeon General, Headquarters U.S. Air Force, Bolling Air Force Base, D.C.", "The general is a native of Pierre, S.D., and entered the Air Force in October 1975 by direct commission. In June 1978, she made a direct transfer from active duty to the Air Force Reserve. In 1985, she received her master's degree in nursing from the University of Nebraska Medical Center, Omaha. She has served as unit commander, chief nurse, staff development officer, flight nurse, family practice nurse practitioner, intensive care nurse and obstetrical clinical nurse.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]