["About this rating", "Rumors are surging in the wake of George Floyd's death and resulting protests against police violence and racial injustice in the United States. Stay informed. Read our special coverage, contribute to support our mission, and submit any tips or claims you see here.", "On the night of Nov. 24, 2014, a grand jury in St. Louis County — after hearing more than 5,000 pages of testimony from 60 witnesses — found insufficient probable cause to indict Darren Wilson, a white police officer, in the Aug. 9 shooting death of Michael Brown, an unarmed 18-year-old black man, in Ferguson, Missouri.", "That grand jury decision, like the shooting that preceded it, sparked protests in and around Ferguson, some of which were violent.", "Nearly six years later on May 25, 2020, the death of George Floyd, a 46-year-old black man, while in custody of a white Minneapolis police officer named Derek Chauvin touched off protests in that city that spread across the U.S. and into European cities. As the waves of protests and rioting over Floyd's death swept America, President Donald Trump was heavily criticized for displaying a lack of effective leadership when dealing with the crisis, including sheltering in a bunker as protesters gathered outside the White House.", "Amid the backdrop of the Floyd protests, social media users began circulating a purported tweet posted by Trump in 2014 in which he criticized \"weak leadership in Washington\" and asserted that readers could expect \"Ferguson type riots and looting in other places\":", "This was in fact a real tweet from Trump, issued just after the grand jury decision in the Brown case and still viewable in the timeline of the president's Twitter account:", "Trump posted other tweets about the Brown protests at the time, declaring that the rest of the world would \"laugh at us and our president over the riots in Ferguson\" and pondering what \"all of our friends and enemies throughout the world are saying about the U.S. as they watch the Ferguson riot\":", "Peralta, Eyder and Krishnadev Calamur.   \"Ferguson Documents: How the Grand Jury Reached a Decision.\"\r\n    NPR.   25 November 2014.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]