["Wisconsin Assembly Minority Leader Gordon Hintz, a Democrat, is crying foul over a Republican proposal to move Wisconsin's presidential primary, which would improve the chances of a conservative Supreme Court justice. Micheal Sears / Journal Sentinel.", "In the wake of the November 2018 midterm election, in which Democrats wrested the governor’s office from Republicans, the political divide in Wisconsin continues.", "Republicans are proposing to move Wisconsin's presidential primary in 2020, which would improve the chances of conservative Supreme Court Justice Daniel Kelly retaining his seat. Kelly was appointed to the seat by soon-to-be-former Gov. Scott Walker.", "Assembly Minority Leader Gordon Hintz, D-Oshkosh, is crying foul -- and hypocrisy.", "\"One year ago, (Republicans) would not fill seats vacated for people who went to the administration because of the cost of those elections,\" said Hintz, in a Nov. 18, 2018, interview on WISN-TV’s \"UpFront with Mike Gousha.\" \"Now, they’re talking about changing the rules to add additional elections that will cost millions of dollars of taxpayer expense.\"", "Let’s take a look at both parts of Hintz’s claim.", "Legislative elections", "Walker did initially decline to call special elections after two GOP lawmakers stepped down in December 2017 to join his administration.", "At the time, Walker argued for leaving the seats open until the regularly scheduled Nov. 6, 2018, election. Democrats countered it was not fair to leave residents of those districts without representation for that long, noting the law requires elections to be held promptly.", "Walker himself cited cost as a factor, speaking to reporters in Pewaukee:", "\"It’s just a waste of taxpayers’ money. The Legislature would be adjourned before a special election was held so (candidates would) ... have to be running for the fall election for a state legislative seat at the same time there would be a special election for a seat that wouldn’t get to vote on anything until after the fall election anyway.\"", "The seats had belonged to former state Sen. Frank Lasee of De Pere and former state Rep. Keith Ripp of Lodi. The two Republicans stepped down in December 2017 to join Walker's administration.", "Voters in those areas took Walker to court with the help of a group headed by Eric Holder, the first attorney general under Democratic President Barack Obama.", "On March 22, 2018, Dane County Circuit Judge Josann Reynolds held Walker had a duty under state law to hold special elections. A second Dane County judge denied a delay. So did an appellate judge. Ultimately, Walker and the GOP dropped the matter instead of taking it to the state Supreme Court, and the elections were held.", "So, Walker and Republicans did describe scheduling the elections as a waste of money, though they also cited other reasons. Chiefly, that the Legislature would be adjourned before a special election was held.", "Presidential election", "Now to the second part of Hintz’s claim -- that Republicans are now \"talking about changing the rules to add additional elections that will cost millions of dollars of taxpayer expense.\"", "On Nov. 15, 2018, the Milwaukee Journal Sentinel reported Republicans are considering using the lame-duck session -- while they still hold the governor’s office -- to help keep a conservative on the state Supreme Court and give GOP lawmakers greater control of two state boards.", "Republicans have been concerned about the 2020 state Supreme Court race because it is scheduled to be held alongside Wisconsin's presidential primary — when Democratic turnout is expected to far outpace Republican turnout, since Democrats will be deciding who will challenge President Donald Trump.", "A turnout imbalance could spell trouble for Kelly, whom Walker appointed in 2016.", "Republican legislative leaders, the Journal Sentinel reported, are looking at moving the 2020 presidential primary from April, possibly to March of that year. The GOP plan would require voters to go to the polls three times in the spring of 2020 — likely in February, March and April.", "Holding the extra election would indeed cost millions.", "Nearly 30 of Wisconsin's 72 county clerks have come out against the proposal, noting -- among other issues -- the statewide cost of holding a standard spring election is around $7 million.", "Hintz’s statement was a bit off, however, in that he said the GOP was considering holding multiple extra elections. Only one is being considered.", "Our rating", "Hintz said, \"One year ago, (Republicans) would not fill seats vacated for people who went to the administration because of the cost of those elections. Now, they’re talking about changing the rules to add additional elections that will cost millions of dollars of taxpayer expense.\"", "Hintz is generally on target:", "Republicans did cite cost as one factor -- among several -- when they initially planned to hold off on calling special elections to fill seats vacated by Walker appointees.", "And they are considering adding a single -- not multiple -- additional election in 2020, which by one estimate could cost taxpayers about $7 million.", "We rate the claim Mostly True.", "UpFront with Mike Gousha   Nov. 18, 2018    at 2:10 mark", "Milwaukee Journal Sentinel \"Clerks give thumbs down to Republican plan to move 2020 presidential primary,\" Nov. 20, 2018.", "Associated Press \"GOP lawmakers Frank Lasee and Keith Ripp resign to take jobs in Gov. Scott Walker’s administration,\" Dec. 29, 2017.", "Milwaukee Journal Sentinel \"Eric Holder’s group sues Wisconsin Gov. Scott Walker over not calling special elections,\" Feb. 26, 2018.", "Milwaukee Journal Sentinel \"Judge denies delay to Wisconsin Gov. Scott Walker in calling two special elections,\" March 28, 2018.", "Milwaukee Journal Sentinel \"Democrats pick up long-held GOP seat, Republicans hold on to another in special elections,\" June 13, 2018.", "Milwaukee Journal Sentinel \"Judge denies delay to Wisconsin Gov. Scott Walker in calling two special elections,\" March 28, 2018.", "Milwaukee Journal Sentinel \"Democrats pick up long-held GOP seat, Republicans hold on to another in special elections,\"June 12, 2018.", "Milwaukee Journal Sentinel, \"Gov. Scott Walker abandons court fight to hold of special elections after appellate judge rules against him,\"", "Milwaukee Journal Sentinel, \"Scott Walker, lawmakers consider helping conservative justice before Tony Evers becomes governor,\"  Nov. 15, 2018.", "WSAU, County clerks react to GOP plans for special Spring election for Supreme Court seat,\" Nov. 23, 2018.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]