["By Jessica McDonald", "Posted on May 19, 2020", "At a White House meeting with fellow Republicans, President Donald Trump said, without evidence, that the coronavirus “is going to go away without a vaccine.” While it’s impossible to predict the future, experts say it’s unlikely that the virus will simply go away.", "His son Eric went even further in a May 16 interview, claiming that coronavirus “will magically all of a sudden go away” after the November election.", "“It is completely fanciful and not evidence-based to state that SARS-CoV-2 will ‘go away’ without a vaccine,” said Marc Lipsitch, an epidemiologist at the Harvard T.H. Chan School of Public Health, referring to the full name of the coronavirus that causes COVID-19. “There is no basis for this statement.”", "“It is a theoretical possibility that the virus could go away permanently with a large uncontrolled epidemic everywhere in the world, leading to depletion of susceptible people and permanent immunity,” Lipsitch added in an email.", "But, he said, that series of events would be “exceedingly unlikely,” since no human coronavirus is known to elicit permanent immunity, and because countries will maintain a pool of people susceptible to the virus for a long time, allowing for reintroductions of the virus.", "To state that the virus will go away without a vaccine is “baseless,” Lipsitch said, and to consider it as one of the top scenarios for policy planning is “foolish.”", "In an interview on “Fox News Sunday,” Tom Inglesby, director of the Center for Health Security at the Johns Hopkins Bloomberg School of Public Health, also objected to Trump’s claim that the virus would “go away” without a vaccine.", "“No, this virus isn’t going to go away,” he said. “Hopefully, over time, we’ll learn to live with it and we’ll be able to reduce the risk of transmission. But it’s going to stay as a background problem in the country and around the world until we have a vaccine.”", "Barry Bloom, an immunologist and global health expert at Harvard, also told us he did not think the virus would go away without a vaccine.", "Trump’s comments came during a May 8 meeting at the White House with Republican members of Congress in response to a reporter’s question about how necessary a vaccine is to resolving the pandemic.", "Trump, May 8: Well, I feel about vaccines like I feel about tests. This is going to go away without a vaccine. It’s going to go away, and it’s — we’re not going to see it again, hopefully, after a period of time. You may have some — some flare-ups and I guess, you know, I would expect that. Sometime in the fall, you’ll have flare-ups maybe. Maybe not. But according to what a lot of people say, you probably will. We’ll be able to put them out. You may have some flare-ups next year, but eventually, it’s going to be gone. I mean, it’s going to be gone.", "You know, there are some viruses and flus that came, and they went for a vaccine, they never found the vaccine, and they’ve disappeared. They’ve never shown up again. They got — they die too, like everything else. They die too.", "When asked for evidence for his position in a follow-up question, Trump said he relied “on what doctors say,” adding, “They say it’s going to go — that doesn’t mean this year, it doesn’t mean it’s going to be gone, frankly, by the fall or after the fall. But eventually, it’s going to go away. The question is will we need a vaccine? At some point, it will probably go away by itself. If we had a vaccine, that would be very helpful. I’d be very happy to have a vaccine.”", "The White House did not respond to our requests for support for the statement or for clarification on what the president meant by “go away.” But back in February, Trump made a similar claim, suggesting that because of warmer weather, the coronavirus would “go away” in April — a prediction that, as we explained, was highly uncertain even at the time, and did not come to pass.", "And in an interview with Fox News host Jeanine Pirro on May 16, the president’s son Eric Trump used similar language to make the groundless claim that the coronavirus is a Democratic ploy to keep his father from doing arena-style campaigning. “You watch, they’ll milk it every single day between now and Nov. 3,” the younger Trump said of Democrats. “And guess what? After Nov. 3, coronavirus will magically all of a sudden go away and disappear and everybody will be able to reopen.”", "While the president is right that the pandemic will eventually wane, scientists do not anticipate a speedy retreat — and even with a vaccine, there is a chance the virus will continue to stick around.", "“Viruses do not do anything magically,” said Lipsitch. “All scientific evidence and reasoning indicates that SARS-CoV-2 will be spreading in large parts of the human population for months or years to come, in the absence of widespread use of an effective vaccine.”", "Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases and a prominent member of the coronavirus task force, has said that it will take a vaccine to allow society to let up on all of its mitigation efforts.", "“It’s not going to be over to the point of our being able to not do any mitigation until we have a scientifically sound, safe and effective vaccine,” he said in an April 16 television interview on Fox News’ “The Ingraham Angle.”", "And Fauci pushed back when host Laura Ingraham suggested, as Trump later did, that this virus might “disappear” the way SARS did.", "“Anything could, Laura, but I have to tell you, the degree of efficiency, of transmissibility of this is really unprecedented in anything that I’ve seen,” he said. “It’s an extraordinarily efficient virus in transmitting from one person to another. Those kinds of viruses don’t just disappear.”", "In Senate testimony on May 12, Fauci again said of the virus disappearing, “That is just not going to happen,” adding that even if there is better control of the virus in the summer, “it is likely that there will be virus somewhere on this planet that will eventually get back to us.”", "Fauci also previously cautioned that while conditions in the U.S. would improve, there could be an ongoing risk.", "“[I]f you want to get to pre-coronavirus, you know, that might not ever happen in the sense of the fact that the threat is there,” he said in an April 6 task force briefing. “But I believe, with the therapies that will be coming online, and with the fact that I feel confident that over a period of time we will get a good vaccine, that we will never have to get back to where we are right back now.”", "The World Health Organization, too, has said that while a vaccine is humanity’s best chance of getting rid of the virus, even then, there is no guarantee that the virus will go completely away.", "“I think it’s important to put this on the table,” said Michael Ryan, the executive director of the WHO’s Health Emergencies Programme, in a May 13 press conference. “This virus may become just another endemic virus in our communities and this virus may never go away.”", "“I don’t think anyone can predict when or if this disease will disappear. We do have one great hope,” Ryan continued. “If we do find a highly effective vaccine that we can distribute to everyone who needs it in the world, we may have a shot at eliminating this virus. But that vaccine will have to be highly effective, it will have to be made available to everyone and we will have to use it.”", "Ryan noted that the world has failed to eliminate other viral diseases, such as measles, even with readily available, effective vaccines.", "“There are no promises in this and there are no dates,” he said, adding that there was a possibility COVID-19 might “settle into a long-term problem.”", "How the COVID-19 pandemic will unfold can’t be known, but some scientists have attempted to model how the virus will spread under different assumptions to understand what the possibilities might be.", "Lipsitch was part of a team at Harvard that created a model of SARS-CoV-2 transmission in temperate regions of the world, factoring in different levels of seasonality, immunity and cross-immunity to two common cold coronaviruses, OC43 and HKU1.", "Publishing in the journal Science in mid-April, the team found that repeated wintertime outbreaks “will probably occur,” and even if the virus might appear to go away, “a resurgence in contagion could be possible as late as 2024.”", "In many of the team’s simulations, SARS-CoV-2 continues to circulate long-term. If immunity to the virus lasts a bit less than a year — on par with the common cold coronaviruses — then the coronavirus might return annually. A longer, two-year period of immunity pushes the virus’s reappearance into a biennial or more sporadic pattern.", "In the unlikely case that immunity is permanent, then the virus could disappear for five or more years, the study found. But even in cases in which the virus might seem to die out, SARS-CoV-2 could make a comeback several years later.", "These scenarios do not factor in any mitigation measures, but other modeling from the group suggests that one-time lockdowns won’t be enough to control the virus.", "“We found that one-time social distancing measures are likely to be insufficient to maintain the incidence of SARS-COV-2 within the limits of critical care capacity in the United States,” said co-author Stephen Kissler, a postdoctoral research fellow at Harvard, in a press call. “And so what seems could be necessary in the absence of other sorts of treatments are intermittent social distancing periods.”", "While the team does not endorse any particular strategy, the basic idea with intermittent social distancing would be to try to space out the number of infections enough so that the health care system never gets overloaded, but that over time, immunity to the virus builds.", "If approximately 50-67% of a given population were to become infected and develop immunity, then that could provide so-called community or herd immunity, preventing spread to those who still remain susceptible — and causing outbreaks to eventually peter out.", "This type of slow-build immunity approach is one way that the pandemic could end without a vaccine, Annelies Wilder-Smith, a professor at the London School of Hygiene and Tropical Medicine, told us. (The other involves a highly unlikely global containment effort, involving a simultaneous Wuhan-level lockdown in every country.)", "But it would take a long time, she said — perhaps two to four years — and, as we’ve established, would not necessarily bring a true end to the virus.", "Work by others also suggests the virus will be around for the long haul. In an April 30 report released by the University of Minnesota’s Center for Infectious Disease Research and Policy, researchers outlined three possible scenarios, based on what is known about SARS-CoV-2 and past experience with epidemics.", "In the first so-called “peaks and valleys” scenario, the first wave of infection would be followed by a series of well-defined waves that gradually diminish in 2021.", "In a second scenario, the virus returns in the fall or winter with a vengeance — akin to what happened with the 1918 influenza pandemic — producing a much larger wave of infections than the current one, followed up by smaller subsequent waves.", "In the third “slow burn” scenario, infections would continue at a lower level after the first surge, but wouldn’t follow a clear wave pattern.", "Regardless of the scenario the pandemic follows, the report cautions that “we must be prepared for at least another 18 to 24 months of significant COVID-19 activity, with hot spots popping up periodically in diverse geographic areas.”", "And the report notes that the virus may not go away, even if the pandemic resolves.", "“As the pandemic wanes, it is likely that SARS-CoV-2 will continue to circulate in the human population and will synchronize to a seasonal pattern with diminished severity over time,” similar to what has happened with past pandemic influenza viruses and the more mild human coronaviruses that cause colds.", "Indeed, although Trump suggested that viruses disappear, never to return, without vaccines, that’s not actually what happens in most cases.", "“I’m hard pressed to think of any viruses that ‘disappeared’ on their own,” Columbia epidemiologist Stephen Morse told us. “Once they gain a foothold, most viruses are hard to eliminate, especially respiratory viruses. Influenza – flu — doesn’t go away, it just keeps coming back in new guises.”", "Far from disappearing, even after all the waves of a pandemic conclude, pandemic influenza viruses return as seasonal influenza viruses.", "“They settle down and evolve, a key surface protein (the hemagglutinin, H) mutating to get past our immune systems,” said Morse, allowing “the new variant to reinfect, even people already immune from having had the pandemic.”", "Versions of the H1N1 influenza strain that caused the 2009 pandemic, for example, continue to circulate. The Centers for Disease Control and Prevention estimates that the virus led to at least 100 million illnesses and 75,000 deaths between 2009 and 2018 in the U.S. alone — and that is with a vaccine that became available in October 2009 and is estimated to have prevented up to 1.5 million clinical cases.", "In fact, Morse said every seasonal flu the world knows is the descendant of a pandemic virus.", "The common cold coronaviruses that infect humans today are also examples of viruses that never disappeared. These viruses are thought to have emerged from animals in the past, the most recent one around 1890, according to a genetic analysis of OC43. Although still speculative, the authors of that study think it’s possible that OC43 may have been responsible for the 1889-1890 pandemic when it crossed over into humans from cows.", "These coronaviruses do not mutate to the extent that influenza does, Morse said. But immunity to the viruses is short-lived, so the viruses are able to reinfect people after a period of time and also tend to exhibit a seasonal pattern.", "There is the example of the SARS, or severe acute respiratory syndrome, virus, which led to an outbreak in 2003 that was successfully contained. Other than a few lingering cases and a couple mishaps in a lab in 2004, the virus has not returned — although there is still the risk the virus could reemerge if humans interact with animals harboring the virus.", "But that virus never spread as widely as SARS-CoV-2, infecting only about 8,000 people in fewer than 30 countries. In contrast, as of May 19, there have been more than 4.6 million COVID-19 cases in 188 countries, according to the Johns Hopkins COVID-19 tracker.", "SARS-CoV-1, Morse said, was not as transmissible as its successor, and the bulk of the transmission was in health care settings. “Once the affected facilities implemented rigorous infection control,” he said, “they could control SARS in the facility and it eventually stopped.”", "What will ultimately happen with SARS-CoV-2 is unknown, as the trajectory, Morse said, will depend “on the virus, on how we behave, and on our immune systems.”", "But there is little precedent for a virus that has spread so efficiently to “go away,” as the president claimed.", "Morse said that long-term, there isn’t enough evidence to know whether the coronavirus will follow the path of a seasonal flu virus — mutating and periodically reinfecting — or that of a seasonal coronavirus, periodically reinfecting after a while, and usually causing a milder disease.", "“Whatever the scenario,” he said, “it’s likely we’ll be dealing with it, and its consequences, for some time to come.”", "Editor’s Note: FactCheck.org does not accept advertising. We rely on grants and individual donations from people like you. Please consider a donation. Credit card donations may be made through our “Donate” page. If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, 202 S. 36th St., Philadelphia, PA 19104.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]