["By Angelo Fichera", "Posted on December 13, 2018", "A long-circulating meme spreads a quote falsely attributed to House Minority Leader Nancy Pelosi about President Donald Trump’s proposed border wall.", "In the Oval Office this week, a heated (and fact-challenged) exchange unfolded between President Donald Trump and Democratic congressional leaders — Sen. Chuck Schumer and Rep. Nancy Pelosi — over funding for Trump’s proposed border wall.", "Meanwhile, on social media, a quote about the wall falsely attributed to Pelosi made the rounds yet again.", "“Building a Wall will violate the rights of millions of illegals,” reads the purported quote, featured in a meme shared in numerous Facebook posts. The meme doubles down by adding: “Yes, she actually said that.”", "There’s no evidence to support that claim. We could find no record of Pelosi ever making that statement, which has circulated for months — despite previous fact-checking efforts by Snopes, PolitiFact and the Weekly Standard.", "Pelosi has indeed bristled at Trump’s demand for a border wall, including in the Oval Office meeting Tuesday. It’s a posture she’s long maintained.", "“The Democrats do not support the wall,” Pelosi said in a 2017 NBC interview. She called the wall “immoral, expensive, unwise” — a sentiment she echoed at a recent news conference.", "“We, most of us, speaking for myself, consider the wall immoral, ineffective and expensive,” she said at her Dec. 6 press conference.", "But there is no evidence Pelosi — who appears likely to return to the role of House speaker when Democrats assume control of the chamber in January — said it would “violate the rights of millions of illegals.”", "Trump has insisted that the government’s next funding package should include $5 billion for the wall.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on the social media network.", "“Transcript of Pelosi Weekly Press Conference Today.” Transcript. Office of Rep. Nancy Pelosi. 6 Dec 2018.", "Farley, Robert, et. al. “FactChecking the Trump-Pelosi-Schumer Scuffle.” FactCheck.org. 11 Dec 2018.", "Koenig, Kailani. “Nancy Pelosi: Border Wall Is ‘Immoral, Expensive, Unwise.'” NBC News. 23 Apr 2017.", "Daly, Matthew. “Pelosi takes hard line on paying for Trump’s border wall.” Associated Press. 6 Dec 2018.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]