["About this rating", "Since March 2017, many Internet users have encountered a tragic story of a fiery car crash that claimed the lives of seven people, killing two women along with their five children as their husbands valiantly tried to rescue them:", "Two mothers and Five children died in a fiery wreck in Hernando County today, while two injured fathers had to be held back from the flames trying to save their families, officials said.", "The two men were airlifted to a nearby hospital for burns they sustained while trying to save their families.", "The two men were later identified as Carter Anderson, 35, and Nathan Mcconaghy, 47. The identities of their wives and children weren’t released. The ages of the children were 1, 3, 6, 8 and 12 years old, according.", "The minivan carrying the two families collided with a black BMW and stopped on the far right shoulder of the freeway, still partially in the travel lane. The minivan was then rear-ended by a big rig, pushed into a ravine and caught fire.", "Two Patrol officers saw the van catch fire, and both husbands, who were able to escape, ran up to the officers, pleading for help.", "“Words can’t describe what that was like when we arrived on scene,” Officer Dan Williams said. “It was very horrific seeing them trying to get their families out, us trying to help get their families out. Like I said, the van went up in flames very, very quickly.”", "Williams and his partner tried to help the fathers rescue their loved ones, even using a fire extinguisher, but to no avail. They eventually had to hold the men back from the van.", "Both fathers suffered severe burns to their hands and faces.", "It was unclear what caused the initial crash with the BMW. The investigation was ongoing.", "We can't say that an automobile accident of this nature has never occurred anywhere at any time (the text somewhat mimics an account of a June 2016 crash that killed six people in California), but in this particular case the same essentially fictional story has been spread online, with identical details, utilizing multiple domains and varying geographic locales.", "First of all, this article's headline is always presented as \"2 moms, 5 kids killed in car crash in [name] County,\" where \"[name]\" is a varying roster of counties across the U.S., such as Schuyler County, Sangamon County, Suwannee County, Hernando County, Van Buren County, and Merced County. A simple Google search reveals some of the many areas in which the very same tragedy is reported to have taken place:", "These articles have been spread under a variety of domain names — including county911.info, countynewsroom.info, newsrooms.info, and xcounty.info — that appear to have no function other than propagating iterations of this one article.", "All of these domains were registered by the same person in Tbilisi, Georgia, and have no obvious purpose outside the spreading of questionable (i.e., porn) advertisements and possibly related malware.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]