["IAS officer Nidhi Choudhari has triggered a massive row ever since her tweet on Mahatma Gandhi went viral. Congress and AAP leaders expressed shock, NCP leader, Jitendra Awhad called for her immediate suspension and Sharad Pawar wrote to Maharashtra Chief Minister demanding ‘exemplary action’ against her. She has been issued a show-cause notice as well as transferred. Choudhari had tweeted, “What an exceptional celebration of 150th birth anniversary year is going on. High time we remove his face from our currency, his statues from across the world, rename institutions, roads named after him! That would be a real tribute from all of us. Thank you Godse for 30-1-1948.” The tweet has now been deleted.", "Chaudhary had posted her controversial tweet on May 17, one day after BJP MP, Pragya Thakur called Gandhi’s assassin, Godse, a “desh bhakt” (patriot). As per Choudhari’s clarification, her tweet was sarcastic and misunderstood by people. “I bow before him [Gandhi] with deepest regard & will do till last breath,” she wrote.", "I have deleted my tweet of 17.05.2019 w.r.t. GandhiJi because some people misunderstood it If only they had followed my timeline since 2011 they would’ve understood that I would NEVER even dream of insulting GandhiJi I bow before him with deepest regard & will do till last breath pic.twitter.com/CSjaKHF9BJ", "— Nidhi Choudhari🕉☪️✝️☸️ (@nidhichoudhari) May 31, 2019", "If one were to read through the complete thread, it is evident that Choudhari’s tweet was indeed sarcastic.", "Choudhari’s Twitter timeline is also a testament to the fact she is a devout follower of Gandhi.", "In April, she had tweeted about Gandhi’s ‘My Experiments with Truth’ being one of her favourite books. In another tweet from 2018, she thanked Gandhi for giving meaning to the principles of truth and non-violence.", "I have known no distinction between relatives & strangers, countrymen & foreigners, white & coloured, Hindus & Indians of other faiths, whether Mussalmans, Paris, Christians or Jews I may say that my heart is incapable of making any such distinctions#GandhiJi#TuesdayMorning pic.twitter.com/SDzEFEtBKh", "— Nidhi Choudhari🕉☪️✝️☸️ (@nidhichoudhari) April 9, 2019", "ThankU Mahatma for giving truth & non-violence a meaning that no dictionary can actually explain ThankU for enriching the spiritual fabric of India & her millions of people Bless us with a heart full of love, forgiveness & peace#Gandhiji #BapuAt150 #MahatmaGandhi #GandhiJayanti pic.twitter.com/Fpbmc6OqXh", "— Nidhi Choudhari🕉☪️✝️☸️ (@nidhichoudhari) October 2, 2018", "In several other tweets, the IAS officer had posted Gandhi’s quotes. “Gandhi Ji inspires me daily and I keep posting his quotes very regularly… His tweets are needed more today than any other time,” was her reply to a person who asked her why she was sharing so many of his quotes.", "GandhiJi inspires me daily and I keep posting his quotes very regularly… His values are needed more today than any other time..", "— Nidhi Choudhari🕉☪️✝️☸️ (@nidhichoudhari) April 9, 2019", "In conversation with Alt News, Choudhari reiterated that her tweet was sarcastic in nature. “I have been dragged into this controversy unnecessarily because my tweet on Gandhiji posted on May 17 was pure sarcasm and written with deep grief as clear from the weeping emoji in the tweet. It has been misinterpreted as an insult because some people didn’t understand the real meaning. I have deleted that tweet once I realised that people are reading it wrong. I, however, have explained in great detail on Twitter that I post about Gandhiji very frequently and have never insulted The Mahatma. In fact, I am deeply saddened by the unfolding of events.”", "However, the mainstream media has either ignored Choudhari’s clarification or only mentioned it briefly, keeping the focus on her misinterpreted tweet and the reactions it generated.", "ANI reported Awhad’s statement demanding action against Nidhi Chaudhary for her “derogatory” tweet without carrying her clarification.", "NCP leader Jitendra Awhad in Mumbai: We demand immediate suspension of IAS officer Nidhi Choudhari for her derogatory tweet against Mahatma Gandhi. She gloried Nathuram Godse, this should not be tolerated. (pic of tweet by IAS Nidhi Choudhari on May17,she later deleted the tweet) pic.twitter.com/Ir2lMldQmW", "— ANI (@ANI) June 1, 2019", "Several media outlets added to the outrage by headlines like “woman IAS officer insults Gandhi, hails Godse, wants Bapu pictures from notes”. Many others carried her clarification deep into the reports, with the titles misleading worded with terms such as “anti-Gandhi” and “derogatory”.", "The misleading reportage was also picked up politicians like Deputy Chief Minister of Delhi Manish Sisodia and Congress MLA Randeep Surjewala.", "The incident highlights the perils of social media, where statements can often be taken out of context. Nidhi Choudhari’s tweet was taken at face value as there was no way for a reader to comprehend that it was meant to be sarcastic without going through her timeline to understand her actual views on Gandhi. The outrage has unfortunately continued even after her clarification, with the media helping little to clear the doubts.", "Donate Now", "Follow @free_thinker", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]