["The photo collage was published here on Twitter on October 2, 2020. It has been retweeted more than 320 times.", "The first image shows a clean body of water. The text superimposed on the image reads: “Vanuatu”.", "The second image shows a polluted waterway with text that reads: “Jakarta, Indonesia”.", "The Indonesian language tweet translates to English as: “The difference between two rivers in 2 countries, namely Vanuatu and Indonesia\n\t1. Vanuatu \n\t2. Indonesia", "“This describes the behaviour of their people.”", "The photo collage was also been shared on Facebook here and here with a similar claim.", "The claim is false.", "First image", "A Google reverse image followed by subsequent keyword searches found the first image actually shows a resort in Vanuatu, published on the website for hotel chain Holiday Inn here.", "The photo’s title reads: “Holiday Inn Resort Vanuatu”. The description says: “Holiday Inn Resort Vanuatu boasts 148 guest accommodation rooms including three unique Family Suites including themed Family Suites and unique Overwater Villas [with dedicated Villas for families and exclusive Villas for couples with direct access into the tranquil lagoon].”", "Below is a screenshot comparison of the first image in the misleading post (L) and the Holiday Inn photo (R):", "The photo matches with this Google user's image tagged at the resort's location on Google Maps dated April 2017.", "Second image", "A reverse image search followed by keyword searches on Google found the second picture is an EPA photo of Manila, taken on March 1, 2009.", "The photo’s title reads: “A Filipino girl living on shanties walks along a polluted creek in Manila.”", "The caption reads: “A polluted creek covered with trash in Manila, Philippines on 01 March 2009. The Department of Environment and Natural Resources reported in 2008 that the Philippines hosts 50 major polluted rivers, with a majority of pollutants coming from domestic waste.”", "Below is a screenshot comparison of the second picture in the misleading post (L) and the EPA photo (R):", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]