["About this rating", "The halal food shelf in Minneapolis is funded by private donations entirely; a 2014 request for seed money from the county was denied.", "In 2014, Fartun Weli, the founder and executive director of the non-profit organization Isuroon, tried to get Hennepin County, Minnesota, to provide $150,000 in seed money to help launch a halal food pantry.  Her goal was primarily to feed struggling Muslim immigrants who adhere to religious dietary customs.  Ultimately, the request was denied and Weli secured funding through charitable donations to get the food shelf up and running.", "These facts have not stopped at least one web site from re-circulating the two-year-old story for maximum outrage potential. According to a 26 August 2016 story on the web site Fresh News USA, Muslims are \"demanding\" halal food:", "A group of Muslim women in Minnesota are demanding that the state change its food stamp policies to require a low-price, halal (acceptable under Sharia Law) food shelf.", "This proposed policy change would end up costing taxpayers more than $150,000! That’s right, these Muslims want YOU to pay more so that they can live comfortably off of government ‘handouts!’", "To the contrary, the issue has been resolved. On 14 June 2016, local news outlet SouthWestJournal reported that Weli opened the charity, with funding from University of Minnesota’s Center for Urban and Regional Affairs and the Seward Co-op.", "Further, both Weli and the county commissioner's office confirm that no government money is or was ever used to operate the food bank. At the time Weli made her initial request, the county had one standing operation (a \"legacy\" contract) but otherwise was not and is not in \"the business\" of funding or in any way partnering with charitable food banks, Brian Shekleton, principal aide for Hennepin County Commissioner Peter McLaughlin, told us:", "There was a request to fund a halal food shelf, and it has not passed by the county board.", "Shekleton provided video recording of the 11 December 2014 meeting which shows county commissioners voting the request down, with the item being taken up at the 2:33:45-minute mark and being voted down by a margin of 3 to 4.", "City officials in Minneapolis also confirmed the municipality does not fund food pantry operations. Food shelves, also known as food banks, are generally operated by charities.", "Weli also confirmed that in the end, the food shelf was opened and stands on 34th and Nicollet in Minneapolis, with seed funding coming from Seward, a local food co-op. In an 18 December 2014 post, Seward discussed its partnership with Isuroon:", "Here's the main problem according to Fartun and Isuroon: No food shelves in Minneapolis offer halal foods.", "Isuroon's mission is to create such a food shelf, but securing funding has been difficult: The non-profit needs $150,000 just to start work. When Isuroon came to Seward Co-op to apply as a SEED recipient, Fartun told us that a donation from the co-op's SEED program would not only help the \"bottom line,\" it would help to legitimize Isuroon as a viable non-profit, too. Seward's December donation will probably be the largest and primary funding for Isuroon's food shelf to date.", "Weli said that the food bank's presence has inspired a groundswell of hate, including death threats. But she said her organization is trying to do the opposite of what the sites quoted above are claiming — she wants to get people off welfare and other forms of government aid.  She told us:", "You have to address food insecurity to help people go to school and make sure their kids are fed. We’re not interested in keeping people on welfare. We receive no government funding, this is a community-funded organization.", "According to its web site, Weli's organization is committed to women's issues as they relate to helping Somali immigrants adjust to life in the United States.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]