["By Saranac Hale Spencer", "Posted on October 3, 2018", "Q: Did Nancy Pelosi say, “I am disgusted with ‘President’ Trump allowing people to keep more of the money they earn”?", "A: No. That was a made-up tweet that has been circulating since December 2017.", "A fake tweet generator called Tweeterino shut down in June, but the parody tweets created at that site still litter the web.", "One of them, attributed to House Democratic Leader Nancy Pelosi, has recently been circulating on Facebook without any indication that it didn’t actually come from the congresswoman.", "The phony tweet says: “I am disgusted with ‘President’ Trump allowing people to keep more of the money they earn. It is this type of wide spread theft of public resources that keeps America from being great ‘Mr. President’.”", "The fake tweet dates to Dec. 20, 2017, the day that Congress passed tax changes championed by President Donald Trump.", "It’s true that Pelosi had opposed the tax bill, repeatedly referring to it as the “#GOPTaxScam” on Twitter. But she did not tweet the statement attributed to her in the fake tweet.", "Those remarks originated on Tweeterino, a site that removed itself from the internet with this explanation:", "Tweeterino: Tweeterino was created with the objective of enabling people to create parody content. We provided a tool for parody and comedy, and that was it.", "However, even though it was obvious that the tweets were fake with the “Fake” watermarks and labels all over the place, some fake tweets ended up travelling the internet, making waves and fooling some people. This usually happened when the “Fake” watermark on the tweet image was removed. Of course, we were not OK with this.", "We do not believe our website was responsible for promoting misinformation. People with the bad intention of creating a fake story will continue to do so. But not everyone shares that opinion, and that had caused our website maintenance to become an increasingly difficult battle.", "For that reason we have closed the website.", "But the fake Pelosi tweet is still circulating online and is available for download on at least one meme sharing website.", "And, keep in mind, even though Tweeterino shut down, other tweet generating sites are still available. So, be aware that genuine tweets typically link back to Twitter when you click on them. If that doesn’t happen, it may be a fake tweet.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on the social media network.", "Tweeterino. “I am disgusted with ‘ President’ Trump allowing people to keep more of the money they earn.  It is this type of wide spread theft of public resources that keeps America from being great ‘ Mr. President’.” 20 Dec 2017.", "U.S. House of Representatives. “H.R.1 – An Act to provide for reconciliation pursuant to titles II and V of the concurrent resolution on the budget for fiscal year 2018.” Passed 20 Dec 2017.", "Tweeterino. Farewell message. Accessed 2 Oct 2018.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]