["A fake story that claimed President Barack Obama was installing a pricey statue of himself in the White House before he left office has gone bust under a smidge of scrutiny.", "\"Obama orders life-sized bronze statue of himself to be permanently installed in White House,\" read headlines across several websites in January. The latest version we saw was on Jan. 18, 2017, two days before Donald Trump’s inauguration, but there were many other examples.", "The story was flagged by Facebook as being potentially fabricated, as part of Facebook’s effort to limit the impact of fake news on readers’ news feeds.", "In the posts, Obama is quoted as praising his own record and saying he commissioned the $200,000 bronze statue (repeatedly spelled \"statute,\" as in a law or rule) to preserve his legacy. He wanted the statue \"permanently erected in the entryway of the White House,\" the article asserted.", "Some versions included the image above, purportedly of the statue standing watch in the Oval Office.", "Clearly, the article is contrived. We could find no credible mention of an Obama statue being put in or near the front door of the White House.", "The source of this false account is a Dec. 31, 2016, post on EmpireNews.net. The website says it is \"intended for entertainment purposes only,\" and that its content can’t be reproduced without consent.", "We didn’t hear back from the website when we asked whether permission had been granted to any other outlets.", "There is a real Obama statue, and it is actually bronze. But it’s not anywhere in the White House.", "It’s along the \"avenue of heroes\" near Puerto Rico’s Capitol building in San Juan, where the statue was installed in 2012. Every president who has visited Puerto Rico gets a statue there; Obama took a trip to the commonwealth in 2011.", "The image currently on the original EmpireNews.net post is a photo from the Flickr account of a photographer named Paul Sableman, and is dated Jan. 8, 2013.", "But even the background is not the Oval Office. It’s really a photo from the U.K.’s Mirror of a replica created by a Longview, Texas, man named Ron Wade.", "Wade reportedly spent $250,000 to build a facsimile of the Oval Office at 80 percent scale. The composite doesn’t even feature Obama’s decor — the absence of his chunky mica coffee table was the giveaway.", "While EmpireNews.net labels itself a joke website in a disclaimer, there’s no evidence of that in the faux story. That’s doubly true when other sites then share the story. The addition of the composite image made from misappropriated photographs only heightens the deceit.", "We’ve chiseled out the details to cast our own decision. We rate this headline Pants On Fire!", "https://www.sharethefacts.co/share/91a0ecb0-36fd-4b9d-bcdc-02dabfffc498", "Success-Street.com, \"WOW: Obama Orders Life-Sized Bronze Statute of Himself To Be Permanently Installed in White House,\" Jan. 18, 2017", "EmpireNews.net, \"Obama Orders Life-Sized Bronze Statute of Himself To Be Permanently Installed in White House,\" Dec. 31, 2016", "CNN, \"Obama makes a quick political visit to Puerto Rico,\" June 14, 2011", "San Diego Union-Tribune, photo of Obama statue, Feb. 20, 2012", "Houston Chronicle, \"President-obsessed Texan Ron Wade has an Oval Office in his own home,\" March 15, 2012", "Flickr.com, photo of Obama statue, Jan. 8, 2013", "Mirror, \"US White House fan builds £150,000 replica of Oval Office in his own home,\" Nov. 12, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]