["Donald Trump is \"too dangerous\" to have access to the nuclear codes, Hillary Clinton emphasizes in a new ad.", "The ad features soundbites from pundits voicing concern about whether Trump is ready for the responsibilities of the presidency. Speakers include Michael Hayden, former CIA director under George W. Bush; Max Boot, a conservative foreign policy analyst; and Charles Krauthammer, a conservative columnist. (All have criticized Trump on some occasions.)", "One clip features Gillian Turner, who worked at the White House National Security Council under George W. Bush and Barack Obama, talking on Fox News.", "Trump \"has been talking about the option of using a nuclear weapon against our Western European allies,\" the ad shows Turner saying.", "We wanted to fact-check whether the Clinton campaign accurately portrayed Trump’s comments about nuclear weapons and western Europe. In our view, even though Turner made the statement, it was the Clinton campaign’s decision to pull the clip and advance its \"unfit\" argument.", "Is Clinton’s campaign correct in saying Trump has considered using nuclear weapons against America’s western European allies?", "Not exactly.", "What Trump has said", "The comment in question stems from an MSNBC town hall interview in March. Trump was asked by host Chris Matthews if he might use nuclear weapons.", "Trump: \"I’d be the last one to use the nuclear weapons, because that’s sort of like the end of the ballgame.\"", "Matthews: \"So, can you take it off the table now? Can you tell the Middle East we are not using the nuclear weapon on anybody?\"", "Trump: \"I would never say that. I would never take any of my cards off the table.\"", "Matthews: \"How about Europe? We won’t use it in Europe.\"", "Trump: \"I’m not going to take it off the table for anybody.\"", "Matthews: \"You might use it in Europe?\"", "Trump: \"No. I don’t think so, but — I am not taking cards off the table. I’m not going to use nukes, but I’m not taking cards off the table.\"", "In the same breath, Trump said he would not use nuclear weapons, but he went on to say he wouldn't take it off the table for \"anybody,\" include Europe.", "He stuck by this phrasing in another interview on The O’Reilly Factor when Eric Bolling asked the same question.", "\"Europe’s a big place,\" he said. \"I’m not going to take cards off the the table. We have nuclear capability. Now, our capability is going down rapidly because of what we're doing. It's in bad shape. The equipment is not properly maintained. There are all lot of talk about that. And that's a bad thing, not a good thing.The last person to use nuclear would be Donald Trump. That’s the way I feel. I think it’s a horrible thing. The thought of it is horrible, but I don’t want to take anything off the table.\"", "In these two interviews, each held within a day of one another, Trump’s position on nuclear weapons overall and in Europe is convoluted. Yes, he hates the idea, but he doesn’t want to take the option off the table.", "Experts weigh in", "Experts we spoke to said Trump’s comments were a departure from previous rhetoric because they’re imprecise, but they noted his refusal to \"take options off the table\" is vaguely in line with U.S. policy.", "Daryl Kimball, executive director of the Arms Control Association, referred to the 2010 Nuclear Posture Review Report, which focuses on preventing nuclear proliferation,", "\"Indeed, as long as nuclear weapons exist, the United States will sustain safe, secure, and effective nuclear forces,\" reads the report. \"These nuclear forces will continue to play an essential role in deterring potential adversaries and reassuring allies and partners around the world.\"", "Point being, there are some instances where the United States does not rule out using nuclear weapons, he said, which is why Trump’s \"cards on the table\" policy is somewhat in line with U.S. policy.", "Jim Walsh, an international security and research associate at the Massachusetts Institute of Technology, said he’s \"seen nothing\" suggesting Trump would use nuclear weapons against America’s European allies.", "\"What Trump may be trying to say is actually consistent with traditional U.S. doctrine, that is, we are prepared to use (nuclear weapons) to counter a Russian/Soviet invasion of Western Europe with conventional forces,\" Walsh, who is not a fan of Trump, said. \"That's a NATO commitment.\"", "The usual rhetoric -- that America would use nuclear weapons against Soviets to protect our allies -- is in line with what previous presidents have said, said Richard Nephew, a research scholar and program director for economic statecraft, sanctions and energy markets at Columbia University. It should be noted that Nephew said he is \"repelled by Trump and his rhetoric, including around nuclear weapons.\"", "\"Previous presidents have spoken about the use of nuclear weapons to threaten the Soviets and others that might attack our allies,\" Nephew said. \"They have talked about battlefield uses only in an extreme crisis and rarely spoken about tactical nuclear weapons at all (which would be what a normal president would be referring to: using nuclear weapons to attack enemy forces invading our Allies).\"", "After speaking to experts, we can conclude that Trump’s comments are vague, but do not translate directly into using weapons against our European allies. We reached out to Gillian Turner to hear how she feels about being used in the ad, but we didn’t hear back from her.", "Our ruling", "A Clinton campaign ad claims Trump has talked about the option of using nuclear weapons against America’s western European allies.", "Experts said his comments on nuclear weapons are imprecise, but they interpreted his comments as vaguely aligned with U.S. policy, at least in the sense that America does not rule out using weapons to protect allies.", "Trump never explicitly talked about using nuclear weapons against America’s allies in Europe -- but that he he is just leaving the option open.", "The claim has an element of truth but is misleading, so we rate it Mostly False.", "https://www.sharethefacts.co/share/6046bf15-c408-418b-a780-1b5220f04bca", "MSNBC, \"Donald Trump won't take nuclear weapons off the table,\" March 30, 2016", "Youtube, \"FULL | Donald Trump interview on The O'Reilly Factor 3/31/16,\" March 31, 2016", "Youtube, \"Unfit,\" Aug. 2, 2016", "Youtube, \"Which candidates are prepared to face nuclear threats?\" April 1, 2016", "Email interview, Josh Schwerin, spokesman, Hillary for America campaign, Aug. 10, 2016", "Email interview, Jim Walsh, research associate at the Massachusetts Institute of Technology’s Security Studies Program, Aug. 11, 2016", "Email interview with Daryl Kimball, executive director of the Arms Control Association, Aug. 11, 2016", "Email interview, Richard Nephew, program director at the Center on Global Energy Policy, Aug. 11, 2016", "United States Department of Defense, 2010 Nuclear Posture Review Report, April 2010", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]