["The video was published in this Twitter post on June 26, 2019 where it has been viewed more than 899,000 times.", "The post’s caption states: “BREAKING: Demonstrators hang sign from Trump Tower in Las Vegas, protesting the Trump administration's undocumented immigrant detention centers, unsafe and unsanitary conditions.”", "Below is a screenshot of the misleading tweet:", "The video purports to shows the Trump International Hotel Las Vegas, which is owned by US President Donald Trump's Trump Organization.", "Some migrant detention centres in the US have made international headlines following reports of detained migrant children staying in unsanitary conditions. Here is an AFP report published on July 8, 2019, on the issue.", "United States Congresswoman Alexandria Ocasio-Cortez has described the centres as \"concentration camps\", for example here on Instagram on June 22, 2019, and here in a July 2, 2019 tweet.", "The footage of the banner on the Trump hotel has been shared on Facebook here, here, and here, and a screenshot of the video was shared on Instagram here.", "But the video has been doctored to include the banner.", "Twitter user @paulleeticks told AFP via Twitter direct message on July 7, 2019, that he filmed the original video and edited it to include the banner.", "\"Yeah I edited it and shot the original vid,\" he told AFP.", "AFP found a similar video of the same hotel with a different doctored banner on the same account for Twitter user @paulleeticks.", "That video appeared here on Twitter on March 16, 2019. The clip shows a similar yellow banner but with different text: “has a little mushroom dick”, written on it.", "That video has been shared thousands of times here and here on Twitter.", "Below is a screenshot comparison of the two videos from Twitter user @paulleeticks:", "The banners in both videos have “Greenpeace” written at the bottom right corner.", "Greenpeace tweeted here on June 26, 2019, a denial of its involvement in the “protest”, saying “this video is fake”.", "While this video is fake, the Trump administration’s inhumane detention centers are, tragically, very real.\n\n\t\tHere is a list of organizations mobilizing to help https://t.co/JBVYra8CJu https://t.co/6VnfmeVDob", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]