["About this rating", "A favorite subject of World News Daily Report (WNDR), a well-known \"satire\" site that has a long history of publishing junk news articles, involves fictional stories about people placing odd items inside body cavities. Over the years they've published stories about a man's getting his head stuck in a woman's vagina, a terrorist's attempting to smuggle a grenade in his anus, a babysitter's stealing a baby by concealing it inside of her vagina, and a McDonald's employee's pilfering 80 pounds of frozen chicken McNuggets by hiding them in his anal cavity.", "WNDR added a new entry into their body cavity category on 20 September 2018, when they posted a junk news item reporting that a woman was suing Samsung for $1.8 million after she got her cellphone stuck in her vagina:", "An Albuquerque woman is suing Samsung for $1.8 million after she necessitated medical attention after inserting her cell phone inside her vagina and was unable to retrieve it for 96 hours.", "Salma Briant, 39, claims her medical bills at the University of New Mexico Hospital amount to $1,168,000 and that she has suffered from severe psychological distress because of the whole ordeal.", "Briant said she first inserted the cell phone inside her vagina as a dare from one of her friends but quickly realized that the phone would not come out.", "This was not a genuine news item but just another piece of junk news from WNDR, whose disclaimer notes that the site's content is \"satirical\" and \"fictional.\"", "The photograph included with the story does not show a woman named Salma Briant but rather Kiersten Pyke, who filed a lawsuit against actor Tom Sizemore alleging that he had molested her when she was 11 years old:", "A Utah woman filed a lawsuit against Tom Sizemore for allegedly groping her when she was 11. The alleged incident took place in 2003, when the two were working together on the film \"Born Killers.\" Kiersten Pyke, 26, says she is standing up for other child actors.", "Pyke spoke for the first time Monday at her attorney's office in Salt Lake City about six months after her allegations against Sizemore surfaced. Pyke said her dreams of having an acting career evaporated after the 2003 incident during production of the \"Born Killers\" movie, leaving her with post-traumatic stress and drug and alcohol addiction that have plagued her life.", "World News Daily Report.   \"Woman Sues Samsung for $1.8 After Cell Phone Gets Stuck Inside Her Vagina.\"\r\n    20 September 2018.", "CBS News.   \"Tom Sizemore Sued for Allegedly Groping Child in 2003.\"\r\n    8 May 2018.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]