["About this rating", "Several state legislatures have proposed bills that would increase the criminal penalties associated with protest activity.", "Many of the proposed bills were never passed or made into law.", "On 23 January 2017, The Intercept published a story offering a run-down of legislative bills proposed by various state lawmakers that would increase the potential criminal penalties to be applied persons arrested while protesting:", "I reported that such efforts were afoot in five states: In Minnesota, Washington state, Michigan, and Iowa, Republican lawmakers have proposed an array of anti-protesting laws that center on stiffening penalties for demonstrators who block traffic; in North Dakota, conservatives are even pushing a bill that would allow motorists to run over and kill protesters so long as the collision was accidental. Similarly, Republicans in Indiana prompted uproar over a proposed law that would instruct police to use “any means necessary” to clear protesters off a roadway.", "[R]eaders alerted me to two additional anti-protesting bills, both introduced by Republicans, that are pending in Virginia and Colorado. This brings the number of states that have in recent weeks floated such proposals to at least eight.", "The article's lead-in suggested that proposals for the more severe laws were related to large demonstrations that took place around the country on 20 January and 21 January 2017, the days of and after President Donald Trump's inauguration. However, the laws had started wending their way through state legislatures well before President Trump was sworn in to office. Many of the the proposals instead seemed to have been in response to protests related to the Black Lives Matter movement and Dakota Access Pipeline construction.", "In Indiana, State Sen. Jim Tomes proposed a bill (SB 285) that would require public officials to dispatch police within 15 minutes of reported \"mass traffic obstructions\" with instructions to clear them by \"any means necessary\":", "A responsible public official shall, not later than fifteen (15) minutes after first learning that a mass traffic obstruction exists in the official's jurisdiction, dispatch all available law enforcement officers to the mass traffic obstruction with directions to use any means necessary to clear the roads of the persons unlawfully obstructing vehicular traffic.", "Tomes said that the bill was offered in response to protests in the summer of 2016 in which demonstrators blocked thoroughfares. The bill's inclusion of the phrase \"by any means necessary\" has caused alarm among critics who believe that \"any means\" could include (unnecessary) physical harm or excessive force:", "Sen. Karen Tallian, a Democrat, was concerned with the phrase, \"any means necessary,\" and that the bill does not make a distinction between those who have requested a permit and those that are spontaneous.", "She showed pictures of a Russian tank driving into Czechoslovakia in 1968 and other pictures of Civil Rights Protests in the U.S., as examples of excessive force.", "\"I know that you don’t mean that, but when you say by 'any means necessary,' we have history here of what that means,\" Tallian said. \"And surely you don’t mean that.\"", "Tomes said the definition of \"any means necessary\" would be up to authorities.", "The bill failed to move through the Indiana state legislature.", "In North Dakota, HB 1203 lifts liability from drivers who accidentally hit protesters who are in roadways. The bill was introduced amid demonstrations at Standing Rock against the Dakota Access Pipeline:", "“It’s shifting the burden of proof from the motor vehicle driver to the pedestrian,” said Rep. Keith Kempenich, R-Bowman, who admitted the bill is in response to the Dakota Access Pipeline protests in southern Morton County.", "He said a response, in the form of House Bill 1203, was needed after groups of protesters blocked or gathered close to roadways and caused problems as motorists tried to drive by.", "Although that bill died in session, North Dakota passed four other laws that expanded punishment for protesters, according to the ACLU. The new laws include criminalizing \"protests on private property where the notice against trespassing is 'clear from the circumstances,'\" punishing those who wear masks while committing a crime to avoid recognition on both public and private property, increasing penalties for \"riot\"-related offenses and allowing the state attorney general to \"respond to a large protest by appointing out-of-state law enforcement officers as 'ad-hoc special agents.'\"", "In protest of the police shooting death of a black motorist Philando Castile, about 300 protesters blocked Interstate 94 in St. Paul for hours in July 2016. While the penalty for obstructing traffic in Minnesota is currently light, lawmakers there sought to make the punishment more severe with HF 55:", "Representative Kathy Lohmer says the growing number of freeway protests are a threat to public safety, not only to police, but drivers and protesters too.", "“You need to obey the laws of the freeway,” said Lohmer, a Republican from Stillwater. “They are there for a purpose. Freeways are not really public spaces, like parks and places like that. You need a license to drive on the freeway. You can’t walk on the freeway.”", "Lohmer’s bill beefs up penalties for obstructing highways, including entrance and exit ramps. Right now, it’s a misdemeanor carrying fines up to $1,000 and 90 days in jail.", "The bill would make it a gross misdemeanor, carrying fines up to $3,000 and a year in jail.", "This bill, along with others that would have both stiffened penalties for protesters who block traffic and held demonstrators responsible for policing costs if they were convicted of unlawful assembly or nuisance charges, failed to advance.", "A bill in Virginia that would have ratcheted up penalties for protesters who remained at the scene of an unlawful assembly after being told to leave was defeated by state lawmakers, and a Washington state bill that would have labeled protesters \"economic terrorists\" has little chance of passing, The Intercept noted.", "On 23 January 2017, Iowa lawmakers introduced a bill that, if passed, would have mean protesters who blocked highways could be charged with felonies carrying penalties of five years in prison:", "People who intentionally block traffic on Iowa highways could be charged with a felony punishable by up to five years in prison under an Iowa Senate bill co-sponsored by nine Republican lawmakers.", "Senate File 111 has been introduced in response to an incident in November when more than 100 protesters blocked Interstate Highway 80 in Iowa City, said Sen. Jake Chapman, R-Adel, the bill's lead sponsor. The activists shut down eastbound traffic for about 30 minutes, protesting the election of Donald Trump as president, before they were either removed by law enforcement officers or left on their own.", "That bill never advanced and neither did two others meant to expand punishment for blocking traffic during a protest and stiffening penalties for \"incitement of a riot,\" per the ACLU.", "In Colorado, a bill that would have raised the severity of criminal charges for tampering with oil and gas production equipment from a misdemeanor to a felony also died, while in Michigan, the Republican-led state House introduced an anti-picketing bill. (The Intercept reported the latter has been shelved.)", "A deluge of bills set on criminalizing protest-related activity may appear to be a broad effort to crack down on free speech, but at least some of the proposals seem to be local responses by lawmakers to constituents and businesses who opposed protests that swept across the country in 2016. It is important to note that many of the bills failed in their respective state governments and were never made law.", "Lange, Kaitlin.   \"Sen. Tomes' Protester Bill Met with Criticism.\"\r\nEvansville Courier and Press.   18 January 2017.", "Smith, Nick.   \"Motorist Liability Introduced in Response to Pipeline Protests.\"\r\nBismarck Tribune.   11 January 2017.", "Kessler, Pat.   \"New Bill Would Make Freeway Protesting Serious Crime.\"\r\nWCCO-TV.   12 January 2017.", "Capital News Service.   \"Senate Rejects Bill Targeting Protesters Who Remain at Scene.\"\r\n23 January 2017.", "Charis-Carlson, Jeff.   \"Kaufmann Won't Introduce 'Suck It Up, Buttercup' Bill.\"\r\nIowa City Press-Citizen.   6 January 2017.", "Petroski, William, and Brianne Pfannenstiel.   \"Iowa Bill: 5 years in Prison for Highway Protesters.\"\r\nThe Des Moines Register.   23 January 2017.", "Gray, Kathleen.   \"GOP House Approves Big Fines for 'Mass Picketing.'\"\r\nDetroit Free Press.   7 December 2016.", "Woodman, Spencer.   \"Lawmakers in Eight States Have Proposed Laws Criminalizing Peaceful Protest.\"\r\nThe Intercept.   23 January 2017.", "Woodman, Spencer.   \"Republican Lawmakers in Five States Propose Bills to Criminalize Peaceful Protest.\"\r\nThe Intercept.   19 January 2017.", "Article updated to reflect the status of various proposed legislation.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]