["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The National Republican Senatorial Committee tapped into a big fear in a Jan. 9 press release.", "The committee said cities and towns could be facing financial upheaval because of the often-derided employer mandate of the Patient Protection and Affordable Care Act, also known as Obamacare. That provision requires that employers with more than 50 workers to provide health coverage to those putting in at least 30 hours a week.", "\"Seventy-seven percent of Georgia's fire departments are volunteer, and it is unfair and unfortunate that those firefighters and the communities they protect are the latest Obamacare victims,\" Brook Hougesen, the committee’s press secretary, said in the statement.", "PolitiFact Georgia wondered whether the NRSC had accurately sounded the alarm on yet another problem with the Obamacare rollout. Or was the claim all wet?", "When we started checking into the statement, it became apparent that people from the local firehouse to the halls of Congress were concerned.", "Joe O’Conor, Peachtree City’s fire chief, said his city’s full-time employees have an excellent benefits package that could not be replicated for its volunteer firefighters.", "\"Our annual budget could not possibly allow us to extend comparable health care benefits to part-time and volunteer firefighters,\" he said.", "Peachtree City Fire and Rescue runs with a blend of full-time, part-time and volunteer firefighters and EMT/paramedics. The volunteers receive a nominal stipend so they don’t have to pull from the family budget to cover costs such as gas, child care or food while they are at the fire station, O’Conor said.", "It’s much the same across Georgia, where 77 percent to 78 percent of firefighters are volunteers, said Glenn Allen, a spokesman for state Insurance and Fire Safety Commissioner Ralph T. Hudgens. In addition to small stipends, some local governments have workers’ compensation coverage for volunteer firefighters in case of injury at a fire scene or when the firefighters are in transit. But none is paid a salary. \"That’s why they’re called volunteers,\" Allen said.", "The NRSC statement warned that Obamacare requirements, if forced upon volunteer fire departments, could, among other things, \"result in higher taxes on Georgia families or penalties for the departments, many of which are already struggling financially.\" The committee cites an Associated Press report that says volunteer firefighters could be affected by the law.", "\"Obamacare has been a disaster, and now volunteer firefighers and the communities that rely on them are the latest victims of this terrible law,\" Hougesen said.", "The committee, which brags that it is \"the only national organization solely devoted to electing Republicans to the U.S. Senate,\" also took a swipe in its statement at Michelle Nunn, the best-known Democrat in Georgia’s U.S. Senate race. The NRSC accused her of being \"adamantly loyal\" to the new health care law and \"prioritizing politics ahead of Georgia’s first responders.\"", "But a day after the NRSC released its statement, Mark Mazur, the U.S. Treasury Department’s assistant secretary for tax policy, appeared to put the matter to rest.", "He wrote in a blog that the final regulations under Obamacare are going to include an exemption for volunteer emergency workers.", "Mazur’s blog seemed to ease minds in the fire services community. William Metcalf, president and chairman of the board of the International Association of Fire Chiefs, put out a statement, calling it  \"an important victory for America's fire and emergency services.\"", "The NRSC’s Hougesen defended the committee’s press release, saying it came out \"a full day before Treasury announced its rule on the exemption for volunteer workers such as firemen.\"", "\"So when we said what we said, volunteer firefighters were still in danger,\" she said.", "But were they really in danger?", "Members of Congress had already gone to the Treasury Department and the Internal Revenue Service last year, advocating for an exemption for volunteer firefighters.", "U.S. Rep. Lou Barletta, R-Pa., also introduced legislation that would write an exemption for firefighters into law. His bill had 90 co-sponsors and bipartisan support.", "Our ruling", "The National Republican Senatorial Committee said that volunteer firefighters and communities they serve in Georgia and elsewhere could be devastated by Obamacare.", "But fixes to the problem were already under way. Those regulatory fixes, which are set to be put in place by 2015, seem to satisfy the volunteer firefighters in question.", "At minimum, it was premature for the National Republican Senatorial Committee to declare that firefighters and the communities they protect are \"the latest Obamacare victims.\"", "We rate the NRC's statement Half True.", "Press release from the National Republican Senatorial Committee, \"Nunn Puts ObamaCare Above All: Volunteer Firefighters Latest Victim,\" Jan. 9", "Phone interview and email follow-ups with Glenn Allen, spokesman, Georgia Department of Insurance, Jan. 10", "Interview via email with Joe O’Conor, fire chief, Peachtree City Fire & Rescue, Jan. 10", "U.S. Fire Administration Website,", "Interview via email with Brook Hougesen, press secretary, National Republican Senatorial Committee, Jan. 14", "Michelle Nunn, Democratic candidate for U.S. Senate, in interview on MSNBC, Oct. 14,", "Political Insider Oct. 24, 2013, Michelle Nunn calls for delay of Obamacare mandate,", "H.R. 3685: Protecting Volunteer Firefighters and Emergency Responders Act,", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]