["About this rating", "The internet's obsession with Representative-elect Alexandria Ocasio-Cortez in the latter part of 2018 was exemplified by a meme reflecting an off-hand remark she made during a speech about environmentally-friendly jobs:", "Although it's true that Ocasio-Cortez, who represents the New York boroughs of the Bronx and Queens in the U.S. House of Representatives as of January 2019, did say those words during a speech, the remark was offered without context.", "As documented by New York public radio station WNYC, Ocasio-Cortez made the comment during a 3 December 2018 televised town hall event in which she discussed her desire to see a \"Green New Deal\" -- an initiative she said would generate jobs by tackling climate change:", "Representative-elect Alexandria Ocasio-Cortez is pitching a \"Green New Deal\" that she says would overhaul U.S. energy use, reduce carbon emissions and create new jobs.", "\"We can put so many people to work,\" Ocasio-Cortez told an audience at a televised town hall Monday night. \"We need to refit so many pipes. We need to re-lay roads. We need to rebuild schools. We need to invent technology that's never even been invented yet.\"", "Although the sentence seems awkwardly worded when considered alone, its meaning in the context of discussing the creation of jobs through the pioneering of new, environmentally-friendly technologies was reasonably clear.", "A number of quotes have been misleadingly attributed to Ocasio-Cortez, so it's understandable why readers questioned whether or not she had made this particular statement. In early December 2018, remarks made by President Donald Trump about his having a \"very good brain\" were tied to her via a meme. In August 2018, another meme falsely suggested that Ocasio-Cortez made a statement revealing she didn't know the difference between billions and trillions.", "At 29, Ocasio-Cortez is the youngest woman in U.S. history to be elected to Congress. She's an outspoken progressive who comes from a working class background, and perhaps because of these differences she's often the target of belittling rhetoric -- from a spate of articles mocking her inability to afford rent in Washington, D.C., to critiquing her clothing choices.", "WNYC.   \"Alexandria Ocasio-Cortez Pitches a 'Green New Deal' to Tackle Climate Change.\"\r\n    4 December 2018.", "Hess, Abigail.   \"29-Year-Old Alexandria Ocasio-Cortez Is Poised to Become the Youngest Woman in Congress.\"\r\n    CNBC.   6 November 2018.", "Rosenberg, Eli.   \"Alexandria Ocasio-Cortez Wore Clothing, A Journalist Tweeted a Photo, And the Internet Pounced.\"\r\n    The Washington Post.   15 November 2018.", "Da Silva, Chantal.   \"Alexandria Ocasio-Cortez's Most Popular Twitter Takedowns and Comebacks.\"\r\n    Newsweek.   10 December 2018.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]