["An article from the website ‘republicofbuzz.com’ is being widely shared on social media. It claims that a 13-year-old girl Deeba was gang-raped by a Hindu mob in northeast Delhi’s Jafrabad.", "Among those who shared the link is a spokesperson of Telangana-based political party MBT, Amjed Ullah Khan.", "Below is an excerpt from the article:", "“The charged Hindu mob stormed into her residential colony, torching homes and rounding up Muslims. She took an opportunity to escape, Deeba says, members of the mob chased Deeba through out the streets as she was on the run, slogging through alleys in the dark, crying and shouting for help but to her misery, she was finally caught by the Hindus who then took her to an abandon cottage nearby.”", "Link 👇", "http://republicofbuzz.com/hindu-mobs-gang-raped-13-year-old-muslim-girl-in-jaffrabad-delhi/", "Posted by Md Irfan Baaghi on Sunday, 1 March 2020", "A Google search with key phrases from the article does not lead to any results. This acts as the first clue that the news might be manufactured. A subsequent reverse-image search of the girl’s photograph from the article redirects to random links from 2018. Below is a screenshot of a January 28, 2018, post on Facebook page ‘We are all GIRL’s আমরা সবাই মেয়ে’.", "Speaking with Alt News, SHO Jafrabad clarified that no such incident has been reported in the area. “This is fake news. Had such an incident occurred, it would have come to our attention,” he said.", "A quick rummage through ‘Republic of Buzz’ reveals that it is a shoddy website that often promotes misinformation targeting India. Earlier this month, India Today had debunked an article on the website which used pornographic images to manufacture a story about rape by Indian soldiers. The website, in fact, routinely shares such distasteful articles. One of its most popular pieces is ‘77% Hindu women cheat due to small penises of their Hindu partners’.", "The ‘page transparency’ details of the website’s Facebook page reveals that it is managed by six individuals from Pakistan.", "The original Twitter handle of republicofbuzz.com was suspended and it now functions under @buzzrepublic. A Pakistani user Muhammad Tariq Kahut had welcomed the handle in 2018 and congratulated ‘@FKahut‘ – an account which is suspended.", "The handle @FKahut belonged to Pakistani user Fahad Kahut who describes himself as a ‘filmmaker’ and now runs his handle under the username @KahutFahad. Another Twitter conversation between Muhammad Tariq Kahut and Fahad Kahut reveal that they are father-son. Below, Muhammed says “seriously thinking of launching a YouTube channel…told by son @KahutFahad to be ready for this…under the banner of #RepublicOfBuzz”.", "A scroll through Kahut’s Facebook page shows that he is associated with ‘Republic of Buzz’.", "The Facebook page of ‘Republic of Buzz’ also routinely shares his posts.", "Suffice to say, ‘Republic of Buzz’ was started to run anti-India propaganda. Their YouTube channel is replete with videos that spew hate against India as a country.", "The claim that a 13-year-old Muslim girl was gang-raped by a Hindu mob in Jafrabad was manufactured by a fake news and propaganda website from Pakistan.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]