["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Conspiracies linking the Clintons to various deaths are longstanding and unsubstantiated. We’ve debunked a number of them.", "The novel coronavirus has killed thousands globally and a growing number of people in the United States.", "In some corners of the internet, every crisis traces back to Bill and Hillary Clinton. No matter how many times fact-checkers swat down hoaxes faulting them for murders and other mischief, there’s always another conspiracy floating around, or so it seems.", "This time, a Facebook post suggests that the political family is responsible for more deaths than the novel coronavirus that’s infected more than 153,000 people worldwide.", "\"Coronavirus — 22. Clintons — 39,\" said an image posted to Facebook on March 9, 2020. The post doesn’t specify that the numbers are in reference to alleged death tolls, but comments from the original poster and other social media users make the connection clear.", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "In reality, there’s no proof that the Clintons have a \"body count\" or have killed people who have damaging information on them, as hoaxes about the Clintons routinely allege.", "These conspiracies are not new. In a 1998 fact-check of a bogus hit list that purported to name dozens of people the Clintons had killed, Snopes wrote that similar rumors had been spreading for decades. Since our start in 2007, we’ve also seen numerous Clinton-related conspiracies.", "We’ve debunked claims alleging the Clintons were behind the celebrity deaths of everyone from Kate Spade to Anthony Bourdain to Kobe Bryant to Paul Walker. We’ve also quashed numerous baseless rumors about the Clintons orchestrating the murders of political leaders and enemies.", "Recently, we debunked a Wisconsin state lawmaker’s false claim that \"more people have died from knowing Hillary\" than the novel coronavirus.", "As of March 15, COVID-19 had killed 5,735 people globally and 41 people in the United States, according to the World Health Organization and the Centers for Disease Control and Protection. More recent news reports have the U.S. death toll topping 70 people as of March 16.", "As of March 9 — the date the Facebook post went up — COVID-19 had killed 3,809 people globally and 11 people in the U.S., according to the WHO and the CDC. But those numbers were lagging, as some news reports from March 8 had the U.S. number up to 22 people.", "Regardless of where the coronavirus death toll sits, there’s no credible evidence to substantiate the claim that the Clintons are behind the deaths of 39 people.", "We rate this post Pants on Fire!", "Facebook post, March 9, 2020", "World Health Organization, \"Coronavirus disease 2019 (COVID-19) Situation Report – 55,\" March 15, 2020", "World Health Organization, \"Coronavirus disease 2019 (COVID-19) Situation Report – 49,\" March 9, 2020", "Centers for Disease Control and Prevention via Internet Archive, \"Coronavirus Disease 2019 (COVID-19) in the U.S.,\" March 16, 2020", "Centers for Disease Control and Prevention via Internet Archive, \"Coronavirus Disease 2019 (COVID-19) in the U.S.,\" March 9, 2020", "CBS News, \"Coronavirus shutdowns spread across U.S. as death toll tops 70,\" March 16, 2020", "The New York Times, \"In U.S., Cases of Coronavirus Cross 500, and Deaths Rise to 22,\" March 8, 2020", "Snopes, \"Clinton Body Bags,\" Jan. 24, 1998", "PolitiFact, \"Legislator’s \"joke\": More people died from knowing Hillary Clinton than coronavirus,\" March 7, 2020", "PolitiFact, \"Conspiracy theory tries to connect Clintons to Kate Spade’s death,\" Feb. 18, 2020", "PolitiFact, \"No evidence to support Paul Walker-Clinton conspiracy theory,\" Feb. 10, 2020", "PolitiFact, \"No, Kobe Bryant didn’t tweet about having dirt on Hillary Clinton before his helicopter crashed,\" Jan. 27, 2020", "PolitiFact, \"No evidence tying union president, jail guards and Bill and Hillary Clinton to Jeffrey Epstein death,\" Jan. 14, 2020", "PolitiFact, \"Another Clinton body count hoax — this one starring JFK Jr. — is wrong,\" Nov. 8, 2019", "PolitiFact, \"Decades-old conspiracy theories about Vince Foster and the Clintons are still wrong,\" Nov. 8, 2019", "PolitiFact, \"No evidence to support this Clinton body count hoax,\" Aug. 27, 2019", "PolitiFact, \"There’s no evidence that the Clintons were involved in Jeffrey Epstein’s death,\" Aug. 12, 2019", "PolitiFact, \"Facebook post shares photo of actor and claims he is Chelsea Clinton's 'dead bodyguard,'\" March 1, 2019", "PolitiFact, \"No, a doctor was not murdered after criticizing the Clinton Foundation,\" Oct. 22, 2018", "PolitiFact, \"Misleading headline connects Clinton, Abedin to New York woman's death,\" July 19, 2019", "PolitiFact, \"No evidence woman who died in home explosion was to testify against Clintons,\" July 18, 2018", "PolitiFact, \"Clickbait headline wrongly blames Clintons for Anthony Bourdain's death,\" June 12, 2018", "PolitiFact, \"Internet hoax claims that investigators working for Trey Gowdy were found dead,\" March 29, 2018", "PolitiFact, \"Fake headline says Donna Brazile knows Seth Rich was murdered by Clintons,\" Nov. 15, 2017", "PolitiFact, \"Pete Olson said Bill Clinton basically told Loretta Lynch 'we killed Vince Foster,'\" July 5, 2017", "PolitiFact, \"Blogger falsely ties death of U.N. official to Clintons,\" June 30, 2017", "PolitiFact, \"Saga of bodies found in barrels on Clinton property is fake news,\" June 26, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]