["By D'Angelo Gore", "Posted on February 26, 2019", "In declaring a national emergency at the southern border, President Donald Trump spoke of an “invasion” by “all types of criminals and gangs.” He suggested that the media “take a look at our federal prison population” and “see how many of them, percentage-wise, are illegal aliens.”", "But it’s misleading to look only at the federal prison population, since state prisons and local jails house approximately 90 percent of the total U.S. incarcerated population.", "We looked at the available data for the entire prison population.", "About 17 percent of individuals in the custody of the Federal Bureau of Prisons and the U.S. Marshals Service were confirmed to be in the U.S. illegally, according to federal data as of Dec. 31, 2017. But less than 6 percent of inmates at the federal, state and local level in 2016 were in the U.S. illegally, according to one independent estimate based on Census Bureau data.", "Besides, the percentage of all noncitizens in federal prison is inflated by the number of individuals charged with or convicted of committing federal immigration crimes.", "An immigration violation, such as unlawful entry or reentry into the U.S., was the primary offense for 29 percent of the “known or suspected” noncitizens in BOP custody, according to government data as of the end of 2017. Of the confirmed noncitizens in USMS custody at the time, 56 percent were charged with a primary offense related to immigration.", "Trump’s statement about federal prisons came during the Feb. 15 press conference in which he declared a national emergency at the U.S. border with Mexico.", "CNN’s chief White House correspondent, Jim Acosta, told Trump that “a lot of crime data out there” show “undocumented immigrants committing crime at lower levels than native-born Americans.” (We have written that numerous studies have found that immigrants, regardless of legal status, don’t commit crimes at a higher rate than nonimmigrants, and that higher concentrations of immigrants don’t lead to higher rates of violent crime.)", "But Trump rejected those facts and advised Acosta to “take a look at our federal prison population.”", "Here’s their exchange, in full:", "Acosta, Feb. 15: Thank you, Mr. President. I wonder if you could comment on this disconnect that we seem to have in this country, where you are presenting information about what’s happening at the border — calling it an “invasion,” talking about women with duct tape over their mouths, and so on — and yet there’s a lot of reporting out there, there’s a lot of crime data out there, there’s a lot of Department of Homeland Security data out there that shows border crossings at a near-record low —", "Trump: That’s because of us. But it’s still —", "Acosta: — that shows undocumented immigrants committing crime at lower levels —", "Trump: Excuse me. It’s still massive numbers of crossings.", "Acosta: — that shows undocumented criminals — or undocumented immigrants committing crime at lower levels than native-born Americans. What do you say —", "Trump: You don’t really believe that stat, do you? Do you really believe that stat?", "Acosta: What do you — well, let me ask you this —", "Trump: Take a look at our federal prisons.", "Acosta: I believe in facts and statistics and data, but —", "Trump: Okay? Any more? Quick, let’s go.", "Acosta: Let me just ask you this: What do you say to your critics who say that you are creating a national emergency, that you’re concocting a national emergency here in order to get your wall because you couldn’t get it through other ways?", "Trump: I ask the Angel Moms: What do you think? Do you think I’m creating something?", "Ask these incredible women, who lost their daughters and their sons. Okay?", "Participant: This is real.", "Trump: Because your question is a very political question because you have an agenda. You’re CNN. You’re fake news. You have an agenda. The numbers that you gave are wrong.", "Take a look at our federal prison population. See how many of them, percentage-wise, are illegal aliens. Just see. Go ahead and see.", "This wasn’t the first time Trump mentioned the percentage of federal prisoners in the U.S. illegally. On Jan. 12, he tweeted, “23% of Federal inmates are illegal immigrants.”", "That figure is exaggerated — and misleading — according to available data.", "On Jan. 25, 2017, Trump signed an executive order requiring the attorney general and secretary of the Department of Homeland Security to “collect relevant data and provide quarterly reports” on the immigration status of all noncitizens incarcerated under the supervision of the Federal Bureau of Prisons, incarcerated as federal pretrial detainees under the supervision of the U.S. Marshals Service, and those incarcerated in state prisons and local detention centers.", "The first report, for the fourth quarter of fiscal year 2017, was published in December 2017. The second report, for the first quarter of fiscal 2018, was published in June 2018.", "The latter report says that, as of Dec. 30, 2017, about 21 percent, or 38,132, of the 183,058 total individuals in BOP custody were either “known or suspected” to be “aliens,” or noncitizens. But just 13 percent of BOP inmates were confirmed to have unlawful status, including 23,826 individuals who were subject to a final removal order or were in removal proceedings. On top of that, 11,698 were still being investigated to determine their status, and the other 2,608 either had lawful status or had been granted relief from deportation.", "In addition, the report includes a breakdown of the individuals in the custody of the Marshals Service, which houses and transports all federal prisoners from the time they enter federal custody until they are either acquitted or convicted and placed in BOP custody.", "Of the 53,141 total individuals in USMS custody at the end of 2017, 19,688, or 37 percent, were confirmed to be noncitizens, and 15,418, or 29 percent, of the total USMS population were known to be in the country illegally. The report says that the immigration status of an additional 3,838 individuals was still being investigated, while the other 432 either immigrated legally or were the recipients of relief from removal.", "So, combined, about 17 percent of all of the individuals in the custody of BOP and USMS were confirmed to be living in the U.S. illegally, as of Dec. 31, 2017, the data show.", "Still, it’s misleading, as Trump did, to focus on just the federal prison population when the overwhelming majority of inmates are incarcerated in state prisons and local jails.", "The Justice Department acknowledged the limitations of its most recent incarceration report in a press release, saying: “This report does not include data on the alien populations in state prisons and local jails because state and local facilities do not routinely provide DHS or DOJ with comprehensive information about their inmates and detainees — which account for approximately 90 percent of the total U.S. incarcerated population.”", "The latest data from the Bureau of Justice Statistics suggest that, as of Dec. 31, 2016, non-U.S. citizens made up almost 5.5 percent of the estimated 1.5 million prisoners under the jurisdiction of state and federal correctional authorities. But that figure is also problematic, as the BJS notes, because “five states — California, Nevada, New Hampshire, North Dakota, and Oregon — did not report counts and some states likely provided undercounts, in part because the definition of non-U.S. citizen varied across states.”", "It also does not include the number of noncitizens held in private prison facilities or local jails under the jurisdiction of state correctional authorities. Plus, the BJS report doesn’t say how many noncitizen prisoners in federal, state and local custody had legal status or not.", "At the end of 2016, the total incarcerated population, including federal, state and local prisoners, was around 2.16 million, according to another BJS estimate.", "The latest DOJ/DHS quarterly report says those departments “are continuing to develop and establish methodologies and procedures that will allow them to collect, estimate, and analyze accurate data regarding the impact of aliens on public safety and criminal justice at the state and local levels.” But there is at least one national estimate already.", "Alex Nowrasteh, a senior immigration policy analyst at the Cato Institute’s Center for Global Liberty and Prosperity, and Michelangelo Landgrave, a doctoral student in political science at the University of California, Riverside, produced what they said is the first nationwide estimate of incarceration rates by immigration status in federal, state and local correctional facilities. Their first policy brief on the topic, which was based on the Census Bureau’s American Community Survey data on inmates between the ages of 18 and 54, was published in March 2017. An updated version of that brief was published in June 2018.", "Their most recent brief says, “an estimated 1,955,951 native-born Americans, 117,994 illegal immigrants, and 43,618 legal immigrants were incarcerated in 2016.” That would mean that less than 6 percent of all incarcerated persons were in the U.S. illegally.", "In addition, Nowrasteh and Landgrave concluded that immigrants in the country, both legally and illegally, are less likely to be incarcerated than U.S.-born citizens.", "“The incarceration rate for native-born Americans was 1,521 per 100,000, 800 per 100,000 for illegal immigrants, and 325 per 100,000 for legal immigrants in 2016,” their brief says. “Illegal immigrants are 47 percent less likely to be incarcerated than natives. Legal immigrants are 78 percent less likely to be incarcerated than natives. If native-born Americans were incarcerated at the same rate as illegal immigrants, about 930,000 fewer natives would be incarcerated. Conversely, if natives were incarcerated at the same rate as legal immigrants, about 1.5 million fewer natives would be in adult correctional facilities.”", "Furthermore, looking at just the percentage of federal inmates who are in the country illegally doesn’t provide any insight into why those individuals are incarcerated.", "For many of the noncitizens in federal custody, an immigration violation is the most serious offense they have been charged with or convicted of committing. (Close to half, or 45 percent, of the 151,460 federal arrests in fiscal year 2016 were for immigration-related offenses, according to the most recent data from the Bureau of Justice Statistics.)", "In fact, the last DOJ/DHS report said that “approximately 29 percent (10,912) of known or suspected aliens in BOP custody had committed immigration offenses (such as illegal reentry after deportation or human trafficking) as their primary offense.” That was second to drug trafficking or other drug-related offenses, which was the primary offense of 46 percent of the known or suspected noncitizens in BOP custody. Another 8 percent were categorized under “other,” which “is composed primarily of individuals awaiting trial.” The most common primary offenses associated with the “other” category were drug trafficking-related and immigration offenses.", "After that, the report said about 4 percent committed fraud as their primary offense, another 4 percent committed weapons offenses (including firearms offenses), 3 percent committed racketeering and continuing criminal enterprise offenses (including murder for hire), and 2 percent committed obscene materials offenses (such as production or distribution of child pornography) or other sex offenses.", "“Other primary offenses committed by smaller numbers of known or suspected aliens in BOP custody included kidnapping, murder, larceny, terrorism, escape, bribery and extortion, rape, and other offenses,” the report said.", "As for those in USMS custody, approximately 56 percent were in custody for a primary offense related to immigration, while around 24 percent were being detained for drug-related offenses.", "“Other primary offenses,” the report says, “included violations of conditions of supervision (974 individuals, approximately five percent of aliens in USMS custody), property offenses (889 individuals, approximately five percent of aliens in USMS custody), weapons offenses, and violent offenses (391 and 378 individuals, respectively, each approximately two percent of aliens in USMS custody).” Material witnesses accounted for another 4 percent of those in USMS custody, the report says.", "So, removing the immigration offenders, assuming they had committed no other crimes, would lower the percentage of noncitizens in federal prison.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]