["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "In this Wednesday, April 8, 2020 file photo people chat and drink outside a bar in Stockholm, Sweden. Sweden is pursuing relatively liberal policies to fight the coronavirus pandemic, even though there has been a sharp spike in deaths. (AP)", "Graham, who wants to see America reopen quickly,  claims the COVID-19 infection rate in Sweden, which has no forced shutdown, is lower than in Italy, Spain and the United Kingdom.", "Sweden’s known infection rate is lower. But the epidemiologist credited with developing Sweden’s COVID-19 strategy said infection rate is not a reliable indicator of how a country is doing.", "While cheering President Donald Trump’s ideas for \"opening up America\" amid COVID-19, the Rev. Franklin Graham suggested on Facebook that Trump’s \"enemies and the liberal media\" want a prolonged national shutdown in order to prevent Trump from being re-elected.", "The Christian minister and son of Billy Graham, the late evangelist, also made a claim about Sweden and its contrarian approach to combating the coronavirus. \"I read yesterday that Sweden had not shut down, but their people were following social distancing and other protocols with the government stressing personal responsibility, and their infection rate still remains lower than the UK’s, Italy’s and Spain’s,\" Graham wrote in an April 17 post on Facebook.", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.) After PolitiFact published a rating on this statement April 24, Graham edited his original Facebook post to remove reference to the infection rate.", "Data support Graham’s claim about infection rates. But the epidemiologist credited with developing Sweden’s COVID-19 strategy said infection rate is not a reliable indicator of how a country is doing.", "Sweden has a population of 10 million people, nearly nine out of 10 of whom live in urban areas; about 20% of residents were born abroad.", "In contrast to most of the United States, Sweden has imposed no lockdown and no quarantines, although groups of larger than 50 people are banned. With elementary schools, bars, restaurants and businesses still open, though with social distancing and other safety measures encouraged, what’s happening in Sweden seems like something closer to life as most Americans remember it.", "The idea in Sweden is to essentially pursue herd immunity — let the virus spread as slowly as possible while sheltering the elderly and the vulnerable until much of the population becomes naturally immune or a vaccine becomes available.", "We didn’t get replies when we asked for information from two North Carolina-based organizations led by Graham, the Billy Graham Evangelistic Association and the international relief organization Samaritan's Purse.", "We found infection-rate figures from Our World in Data. That research organization is funded by philanthropists Bill and Melinda Gates and is led by Max Roser, who is director of the Oxford Martin Programme on Global Development at the University of Oxford.", "Here are the total number of confirmed COVID-19 cases per 1 million people as of April 17, the day of Graham’s post:", "Spain: 3,910.1", "Italy: 2,794.18", "United States: 2,028.17", "United Kingdom: 1,518.62", "Sweden: 1,241.67", "So, Sweden’s known rate of infections is lower than the other countries Graham mentioned (and lower than the U.S. rate, as well).", "We’ll note that Our World in Data figures for April 17 show that the death rate — the ratio of confirmed deaths to confirmed cases — in Sweden was slightly higher than Spain’s, though lower than the other countries Graham cites.", "United Kingdom: 13.32%", "Italy: 13.12%", "Sweden: 10.63%", "Spain: 10.46%", "United States: 4.96%", "Sweden’s death rate was much higher, however, than the three countries that border it: Denmark: 4.67%; Finland: 2.23%; Norway: 2%.", "Experts urge caution on reading too much into the infection-rate figures that Graham alludes to.", "Testing has been focused on health care workers and people whose cases who are serious enough to end up in the hospital, so we don’t know the number of people infected who suffer mild or no symptoms, wrote Paul Franks, a genetic epidemiology professor at Lund University in Sweden and an adjunct professor at Harvard’s Chan School of Public Health.", "\"The existing data suggest that the infection rates are probably much higher in Stockholm than in London and a little higher across Sweden than across the UK,\" he told PolitiFact.", "Indeed, Anders Tegnell, the epidemiologist who is credited with developing Sweden’s COVID-19 strategy, says infection rate is not a good measure of how a country is doing.", "\"The recorded infection rate depends hugely on the number of tests performed and what indications for testing that are used,\" Tegnell, the director of the Swedish Public Health Agency, told PolitiFact. \"In other words, an unreliable measure.\"", "Asked if Sweden’s strategy has been effective, Tegnell told us: \"Partly, to the extent that the health system managed the challenge and that there are always free beds. Not so well in protecting the elderly.\"", "As we were preparing this fact-check, there were reports that confirmed infections in Sweden were rising sharply. For example, according to The Guardian, Sweden reported 812 new confirmed cases of coronavirus on April 24, the highest number of new cases in the country yet reported.", "At the same time, if Swedish studies are accurate, infections and deaths in Stockholm, where more than half of the country’s COVID-19 deaths have occurred, should \"drop substantially in the coming weeks,\" Franks wrote on April 23.", "Urging that the reopening of the United States not be delayed, Graham said the COVID-19 infection rate in Sweden, which has no forced lockdown, is lower than in Italy, Spain and the United Kingdom.", "Infection rates are lower, but that’s not necessarily a telling metric. Experts, including the epidemiologist credited with devising Sweden’s no-lockdown strategy, said there are other reasons, including a lack of testing, not to read too much into infection rates as a measure of how well a country is responding to the virus. Sweden’s death rates, for example, are higher than some of its peers.", "For a statement that is partially accurate but leaves out important information, our rating is Half True.", "UPDATE, April 27, 2020: This story has been updated to reflect that Graham edited his original April 17 Facebook post to remove reference to Sweden's COVID-19 infection rate following the April 24 publication of this fact-check.", "Facebook, Franklin Graham post, April 17, 2020", "Wall Street Journal, \"Inside Sweden’s Radically Different Approach to the Coronavirus,\" March 30, 2020", "Our World in Data, \"Total number of confirmed COVID-19 cases per million people,\" April 17, 2020", "Our World in Data, \"Case fatality rate of the ongoing COVID-19 pandemic,\" April 17, 2020", "Email, Dr. Wilbur Chen, infectious disease physician-scientist at the University of Maryland, April 24, 2020", "The Daily Signal, \"In Sweden, There’s No COVID-19 Lockdown. Here Are 4 Things to Know,\" April 14, 2020", "The Guardian, \"Sweden reports its highest number of new cases yet,\" April 24, 2020", "ABC News, \"What life is really like in Sweden amid the coronavirus pandemic: Reporter's notebook,\" April 22, 2020", "The Hill, \"Sweden could reach 'herd immunity' in weeks, top doctor says,\" April 22, 2020", "Project Syndicate, \"The Grim Truth About the ‘Swedish Model,’\" April 17, 2020", "Email, Kaiser Family Foundation senior vice president and director of global health & HIV policy Jennifer Kates, April 17, 2020", "The Conversation, \"Coronavirus: are we underestimating how many people have had it? Sweden thinks so,\" April 23, 2020", "Business Insider, \"Today's country-by-country coronavirus stats: The US and UK are stuck on a plateau and it looks like bad times ahead for Canada and Sweden,\" April 24, 2020", "Nature, \"‘Closing borders is ridiculous’: the epidemiologist behind Sweden’s controversial coronavirus strategy,\" April 21, 2020", "Email, epidemiologist Anders Tegnell, director of the Swedish Public Health Agency, April 24, 2020", "Email, Paul Franks, a genetic epidemiology professor at Lund University in Sweden and an adjunct professor at Harvard’s Chan School of Public Health, April 24, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]