["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Democratic presidential candidate Hillary Clinton speaks Oct. 7, 2015, during a campaign stop in Council Bluffs, Iowa. (AP Photo/Nati Harnik)", "At the first Democratic debate of the 2016 presidential race, former Secretary of State Hillary Clinton criticized opponent Sen. Bernie Sanders, I-Vt., for supporting a 2005 law that shields the gun industry from certain lawsuits.", "Clinton voted against this law when she was a senator, and she has lambasted it several times on the campaign trail this month.", "\"Probably one of the most egregious, wrong, pieces of legislation that ever passed the Congress when it comes to this issue is to protect gun sellers and gun makers from liability,\" she said in Iowa Oct. 7. \"They are the only business in America that is wholly protected from any kind of liability. They can sell a gun to someone they know they shouldn't, and they won't be sued. There will be no consequences.\"", "Is Clinton right? Are gun makers and dealers \"wholly protected\" against any kind of lawsuit, and do no other industries have similar immunities? Short answer: No. The gun industry is susceptible to some lawsuits, and there are federal laws restricting liability for a number of other types of businesses.", "As support, Clinton’s staff sent us a public health journal article that argues the gun industry’s \"broad immunity\" against litigation inhibits safe manufacturing and distribution of firearms, though it does not directly address her claim.", "Exceptions", "The law at issue is the Protection of Lawful Commerce in Arms Act, which was signed into law by President George W. Bush and seen as a victory for gun rights advocates. The purpose of the law is to protect gun dealers and manufacturers from lawsuits when their products are misused. For example, if a person buys a gun legally and then uses the gun to intentionally kill someone, the gun dealer and manufacturer cannot be held liable for the crime under the law.", "While opponents argue that the law stops some victims from having their day in court, supporters say the law protects gun dealers and manufacturers from frivolous and expensive legal proceedings. In any case, Clinton goes too far in saying the gun industry is \"wholly protected from any kind of liability.\"", "The law lists several situations that are not protected from liability. It does not protect gun dealers who transfer a gun knowing it would be used for criminal purposes, nor those who knowingly break state or federal law if the violation results in harm. Gun manufacturers can also be sued if the gun, when used properly, causes injury because the product is defective.", "\"The statement is incorrect insofar as it suggests that gun makers are totally free from liability,\" said Adam Winkler, a law professor at the University of California Los Angeles who specializes in gun law.", "Some opponents of the law argue that the liability protection is so broad and ambiguous, and the exceptions so narrow, that some legitimate lawsuits won’t have a chance to appear in court. But this is different from saying the gun industry is wholly immune to all lawsuits.", "Clinton also said the gun industry is the \"only\" business in America with this total liability protection. We know that it doesn’t have total protection, but do other sectors have something similar?", "Not the only one", "The act \"is not the first federal law to grant a particular industry immunity from tort liability,\" said Timothy Lytton, a law professor at Georgia State University, who edited a book on gun industry litigation.", "Possibly the most analogous rule -- in that it protects a specific group of potential defendants from a specific liability theory -- is one that offers some immunity to online service providers, said John Goldberg, a law professor at Harvard University and an expert in tort law, in an email to PolitiFact. Section 230 of the Communications Decency Act blocks victims of online defamation from suing service providers (like Comcast) and content providers (like YouTube) for failing to monitor or remove defamatory posts uploaded by customers.", "In a prior interview with NPR, Goldberg called the gun industry law particularly \"aggressive\" in terms of the liability protections granted.", "Most of the experts we surveyed also mentioned a vaccine manufacturer liability law passed in the 1980s. Under the law, victims of injuries that they say were caused by defective vaccines are not allowed to sue vaccine manufacturers. This differs from the gun legislation, however, because it established the Vaccine Injury Compensation Program, through which alleged victims can make a claim and receive compensation.", "\"By contrast, (the Protection of Lawful Commerce in Arms Act) simply prohibits certain kinds of tort claims against the gun industry without providing plaintiffs any alternative means of pursuing their claims,\" Lytton said.", "There’s also some liability protection in the medical devices and airline industries, noted Walter Olson, senior fellow at the libertarian Cato Institute and expert in tort law. For example,the 1994 General Aviation Revitalization Act said small aircraft manufacturers cannot be sued for accidents involving aircraft more than 18 years old.", "\"It’s not at all unique to the gun industry. It’s a version (of liability law) Congress developed for an industry that was under very heavy attack,\" Olson said, referring to the slew of litigation against gun sellers and makers that prompted Congress to pass the law.", "Our ruling", "Clinton said the gun industry is \"the only business in America that is wholly protected from any kind of liability.\"", "Clinton is talking about a law that says the gun industry is protected from liability in certain instances, but the law also specifies several situations in which the gun industry is susceptible to lawsuits.", "Further, Congress has passed a number of laws that protect a variety of business sectors from lawsuits in certain situations, so the situation is not unique to the gun industry.", "We rate Clinton’s claim False.", "Clinton town hall in Iowa, Oct. 7, 2015", "GovTrack, S. 397 (109th): Protection of Lawful Commerce in Arms Act, Oct. 26, 2005", "Congressional Research Service, \"The Protection of Lawful Commerce in Arms Act: An Overview of Limiting Tort Liability of Gun Manufacturers,\" Dec. 20, 2012", "CQ, Bill Analysis -- S. 397, Oct. 18, 2005", "Suing the Gun Industry: A Battle at the Crossroads of Gun Control & Mass Torts, \"Afterword,\" 2006", "American Journal of Public Health, \"Availability of Litigation as a Public Health Tool for Firearm Injury Prevention: Comparison of Guns, Vaccines, and Motor Vehicles,\" November 2007", "NPR, \"Are Gun-Makers 'Totally Free Of Liability For Their Behavior'?\" Oct. 6, 2015", "The Atlantic, \"One Quick Answer to Sandy Hook? Repeal the 2005 Arms Act,\" Dec. 18. 2012", "Cato at Liberty, \"Bernie Was Right, and Hillary Wrong, on Gun-Lawsuit Bill,\" Oct. 14, 2015", "New York Times, \"Congress Passes New Legal Shield for Gun Industry,\" Oct. 21, 2005", "Email interview, Clinton spokesman Josh Schwerin, Oct. 7, 2015", "Email and phone interview, Timothy Lytton, Georgia State University law professor, Oct. 15, 2015", "Email interview, John Goldberg, Harvard law professor, Oct. 15, 2015", "Phone interview, Walter Olson, Cato Institute senior fellow, Oct. 14, 2015", "Email interview, Adam Winkler, UCLA law professor, Oct. 15, 2015", "Email interview, Anthony Sebok, Cardozo Law professor, Oct. 14, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]