["The Facebook photo -- you can see an archived version here -- shows a screenshot of the image sent on WhatsApp, accompanied by a forwarded message in Afrikaans that reads: “These billboards have been put up in Zimbabwe!! Send it to everyone you know all over the world and make it known everywhere!! This is after all what BLF, EFF without shame and the ANC are preaching!!”.", "The billboard photographed includes the logo of South Africa’s ruling African National Congress (ANC) party and tells people: “Vote ANC”. The image seen in the centre is a promotional illustration for “War of the Flea”, a 2011 film about farm killings in South Africa.", "The ANC logo appears in brighter colours than the rest of the image, which is the first sign that it has been doctored.", "In fact, a reverse image search on Google leads to another version of the photo -- taken at the same location, showing cars and pedestrians in exactly the same positions. But this time, the billboard bears a message about rape in Finland.", "The US fact-checking website Snopes exposed this version of the image as doctored back in 2016.", "Like the South African version, the fake Finnish billboard also sought to imply that a political party was promoting a dangerous policy -- in this case, Finland’s green party, Vihreät.", "Notice that in this version the image has been altered to make the woman white.", "The Finnish version of the billboard appeared online as early as 2008, according to search results on TinEye, a reverse image search engine.", "But what did the billboard actually say before it was doctored?", "A further Google reverse image search of the Finnish version leads to another photo of the billboard featuring cars and pedestrians in exactly the same positions. Like the Finnish version, the text at the top still reads “RAPE RAPE RAPE” but the rest of the text makes clear that the billboard is part of a campaign designed to help rape victims. “Seek free treatment immediately,” it reads.", "In place of the Finnish political party logo, there’s the logo for the Belgian branch of medical charity Médecins Sans Frontières (Doctors Without Borders). The billboard gives the names of three clinics around Monrovia, the capital of Liberia, where rape victims can seek treatment. Clara Town is the name of a slum in the city while New Kru Town is a suburb to the northwest. Island Hospital is located on the city’s Bushrod Island.", "So far we’ve been unable to track down the exact date and location where the original photo was taken, and we’ve reached out to MSF Belgium for more information.", "What we do know is that MSF Belgium were running an awareness campaign in Liberia that featured billboards of this design as early as 2006-7 -- before the Finnish version of the image hit the internet in 2008.", "In this United Nations report dated December 2006-February 2007, you can see an MSF Belgium billboard featuring a different image of a man attacking a women. But the text is identical -- including the message directing rape victims to the same three Monrovia health clinics.", "The charity’s Activity Report 2009 details the work MSF was carrying out around that time with women and victims of sexual violence in Liberia, with reference to the clinics in Clara Town, New Kru Town and Island Town.", "Liberia suffered two brutal civil wars from 1989 to 1997 and from 1999 to 2003. Many women and girls were raped during the conflicts, and sexual violence remains a major problem in the country.", "The fake version of the billboard which has been circulating in South Africa, meanwhile, touches on one of the most sensitive issues in the country’s post-apartheid history: the overwhelmingly white ownership of farmland.", "Violence against farmers and farm workers is a hotly contested topic in South Africa that often makes international headlines. In this AFP fact-check, we debunked one particular Facebook post which claimed to show photographs of a farm murder.", "Last August the South African government also accused US President Donald Trump of fuelling racial tensions after he tweeted that farmers were being forced off their land, as reported by AFP here.", "As the countdown to South Africa’s elections ticks closer on May 8, political parties are voicing their stances on land redistribution. The far-left Economic Freedom Fighters (EFF) party has pushed for radical land redistribution, a policy which has now been broadly adopted by the ruling ANC -- see AFP’s article on this subject here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]