["About this rating", "The Obama administration was unable to secure the release of one American who was still being held by North Korea in 2018.", "Two of the men being held by North Korea in 2018 were arrested during Donald Trump's presidency.", "On 2 May 2018, President Donald Trump posted a message to the social media platform Twitter in which he claimed that the previous administration of President Barack Obama was unable to secure the release of three American hostages held in North Korea:", "As everybody is aware, the past Administration has long been asking for three hostages to be released from a North Korean Labor camp, but to no avail. Stay tuned!", "— Donald J. Trump (@realDonaldTrump) May 3, 2018", "The three American men being held by the authoritarian state are Tony Kim, Kim Hak-song and Kim Dong-chul. Tony Kim and Kim Hak-song were both taken into custody in 2017, after Trump had taken office. Both were teachers at Pyongyang University of Science and Technology.", "According to the North Korean state-run news agency KCNA, Tony Kim was taken into custody on 22 April 2017. Kim Hak-song was detained on 6 May 2017, according to the same news agency. The third prisoner, Kim Dong-chul, has been held since 2015 — the only one of the three who was arrested during Obama's presidency. Trump's inaccurate tweet was quickly swatted down by CNN reporter Brian Stelter:", "2 of the 3 Americans were detained in 2017, when Trump was president, so the Obama jab makes no sense. Another case of Trump disrespecting his base -- assuming people won't know the facts or won't care https://t.co/6oD6PT1x25", "— Brian Stelter (@brianstelter) May 3, 2018", "The potential for the men's release comes amid conciliatory moves by North Korea that have included a historic summit with its neighbor to the south and vowing to end its nuclear program.", "Qiu, Linda.   \"Trump Says Obama Administration Failed to Free Three American Hostages Held in North Korea.\"\r\n    The New York Times.   3 May 2018.", "Park, Ju-min.    \"North Korea Says American Was Detained for 'Attempted Subversion.'\"\r\n  Reuters.    2 May 2017.", "Park, Ju-min. \"North Korea Detains Another American Citizen, KCNA Reports.\"\r\n  Reuters. 7 May 2017.", "Schwarz, Tim, et al.   \"Exclusive: North Korea Reveals Alleged U.S. Prisoner to CNN in Pyongyang.\"\r\n    CNN.    11 January 2016.", "Kurtz, Jason.    \"'He Was on His Deathbed When He Came Home to Us' - Otto Warmbier's Father.\"\r\n     CNN.    27 September 2017.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]