["On April 22, news poured in from some quarters that Congress President Rahul Gandhi had admitted before the Supreme Court that he had ‘lied’ over the Rafale deal. It was also reported that Gandhi had apologised to the apex court over his comment ‘Chowkidar Chor Hai’. Soon, screenshots of television news reports regarding the same began circulating, and were shared widely on social media.", "The above post is by the Facebook page Modinama. It has been shared a whopping 46,000 times already. This is merely one of several pro-BJP pages which has shared this information, that Rahul Gandhi had apologised to the Supreme Court ‘with folded hands’. These included Phir Ek Baar Modi Sarkar whose post has been shared over 15000 times, Friends of BJP, (over 5600 shares), Politics Solitics (over 2100 shares) and We Support Amit Shah (almost 7000 shares). Apart from screenshots of news channels, the information has also been shared in the form of an infographic, and has been circulated on WhatsApp as well.", "The same was reiterated by Union Finance Minister Arun Jaitley, who tweeted a one minute video of himself with the words, “The credibility of Rahul Gandhi’s statements has been destroyed after his apology” (translation).", "आज राहुल गांधी के बयानों की विश्वसनीयता उनके माफ़ी माँगने के साथ समाप्त ही हो गयी l pic.twitter.com/xY5eOlP5jp", "— Chowkidar Arun Jaitley (@arunjaitley) April 22, 2019", "While the broadcast news reports relating to the development were on point, the presentation of the same was misleading. For instance, Republic TV tweeted that “Rahul Gandhi has admitted that he lied on the ‘Chowkidar Chor Hain’ comment vis-a-vis the Prime Minister”.", "#CongAdmitsJhoot | Big embarrassment for the Congress as their President Rahul Gandhi has admitted that he lied on the ‘Chowkidar Chor Hain’ comment vis-a-vis the Prime Minister. What impact do you think this will have politically? pic.twitter.com/bc5N8Ql27x", "— Republic (@republic) April 22, 2019", "Senior news anchor Bhupendra Choubey was among those who tweeted that Rahul Gandhi had filed an affidavit in the Supreme Court expressing ‘regret’ over his remark.", "Bang in the middle of election campaign, @RahulGandhi files affidavit in SC expressing ” regret ” for calling @narendramodi ” chowkidar chor hai “. Now watch how this be picked up today. Big moment in election campaign today", "— bhupendra chaubey (@bhupendrachaube) April 22, 2019", "Hindi news anchor Amish Devgan too tweeted an infographic, and also conducted a prime time show on the channel News18 Hindi.", "#MegaPublicDebate Tonight #RahulSaysSorry राहुल की माफ़ी, पलटेगी 2019 की बाज़ी? चौकीदार नहीं है चोर – राहुल का झूठा शोर #AarPaar शाम 6.57 बजे pic.twitter.com/HhQZI0vFTQ", "— Amish Devgan (@AMISHDEVGAN) April 22, 2019", "Rahul Gandhi had responded via an affidavit, to a petition filed in the Supreme Court by BJP leader Meenakshi Lekhi. On April 10, 2019, the Congress president while addressing the media had said, “Supreme Court has said chowkidar ne chori ki hai”. The video of the same is posted below. The relevant portion is from 3:05 to 3:18 minutes.", "Over this statement of Rahul Gandhi, Lekhi had filed a Criminal Court of Contempt against him for allegedly attributing his own views as the observation of the apex court.", "Filed a Criminal Court of Contempt against serial offender Rahul Gandhi. He attributed his own statements as Court’s verdict. Misrepresenting and lowering the dignity of the SC. Vilifying the Constitutional authorities!", "— Chowkidar Meenakashi Lekhi (@M_Lekhi) April 12, 2019", "Alt News accessed the affidavit which was filed by Rahul Gandhi in the Supreme Court in response to a petition by BJP leader Meenakshi Lekhi. Lekhi had filed a petition in the apex court over Gandhi’s remark in relation to the Rafale deal, wherein he had attributed the words ‘Chowkidar Chor Hai’ to the Supreme Court. Gandhi’s expression of regret was with regard to his having falsely attributed these words to the court. It may be noted that the petition was with regard to ascribing his (Gandhi’s) own statement as the observation of the Supreme Court, and not about his statement per se.", "Rahul Gandhi’s expression of regret to the Supreme Court was in the context of the Congress President having falsely ascribed the term ‘Chowkidar Chor Hai’ to the top court. The affidavit says, “It is unfortunate that this slogan got intermingled with my comments on and references to the Apex court’s order dated 15.04.2019. My statement was made in the heat of political campaigning. It has been used (and misused) by my political opponents to project that I had deliberately and intentionally suggested that this court had said Chowkidar Chor Hai! Nothing could be farther from my mind. It is also clear that no court would ever do that and hence the unfortunate references (for which I express regret) to the court order and to the political slogan in juxtaposition the same breath in the heat of political campaigning ought not to be construed as suggesting that the court had given any finding or conclusion on that issue.”", "In point 9 of the affidavit, it is mentioned that “The said statements were made by the answering Respondent in Hindi in a rhetorical flourish in the heat of the moment. It was during a political campaign without a readable copy of the Supreme Court order being available on its website and, therefore, without the answering Respondent having seen or read the order and relying upon electronic and social media reportage and the version of workers and activists surrounding the Respondent.”", "It may however be noted that Rahul Gandhi has NOT apologised to the Supreme Court for having made allegations against the government with regard to the Rafale agreement. The affidavit states,", "“The answering Respondent would take this opportunity to reaffirm his stand and belief and that of his party that the Rafale deal is a tainted transaction and a gross and brazen abuse of executive power and a leading example of the corruption of the BJP Government led by Prime Minister Modi, which deserves to be investigated thoroughly by a Joint Parliamentary Committee and proceeded against thereafter.”", "In the latest development, the Supreme Court has issued a contempt notice to Rahul Gandhi over his remarks. The matter will be heard on April 30.", "In conclusion, the claim that Rahul Gandhi has apologised to the Supreme Court is true, only to the extent that he has expressed regret for having falsely attributed his view as the observation of the Supreme Court i.e. ‘Chowkidar Chor Hai’. Gandhi again reiterated his stand, tweeting with the hashtag #ChowkidarChorHai, after it was claimed that he had apologised.", "23 मई को जनता की अदालत में फैसला होकर रहेगा कि कमलछाप चौकीदार ही चोर है।", "न्याय होकर रहेगा।", "गरीबों से लूटकर अमीर मित्रों को लाभ देने वाले चौकीदार को सज़ा मिलेगी। #ChowkidarChorHai", "— Rahul Gandhi (@RahulGandhi) April 22, 2019", "Mr. Gandhi has not expressed regret over his allegations of corruption in the deal. However, the misleading manner in which some sections of the media reported this development, was taken advantage of by pro-BJP supporters to falsely portray the Congress president as apologetic over the allegations against the government in general.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]