["About this rating", "The Jiftip product does exist and appears to be for sale.", "There is scant evidence that anyone (including teenagers) is buying the product.", "Odd new inventions and commercial products are a frequent source of attention-grabbing news headlines, especially if they stretch credibility. That was the case in 2017, when news outlets around the world reported on Jiftip, an adhesive band designed to offer men an alternative to condoms during sex.", "In August 2017, Inked published an article with the headline \"Teens seal their penis holes closed to avoid using condoms!\"  At some point after this, probably thanks to the headline of the Inked article, the rumor mutated from an adhesive product into do-it-yourself territory, prompting a flurry of concerned e-mails to us:", "Apparently teens are now super glue-ing their urethras shut to avoid using condoms. I hope this is fake!", "I saw an article on Facebook that was so outrageous I feel it had to be wrong. It states that teens are gluing their penises shut to avoid using condoms.", "TEENS SEAL THEIR PENIS HOLES CLOSED TO AVOID USING CONDOMS!", "In August 2016, the Hong Kong-registered Sumina Global Limited registered \"Jiftip\" as a trademark in the United States. Some 18 months earlier, a businessman named Momo Sumina — whose LinkedIn profile lists him as Sumina Global's marketing director — applied for a United States patent for \"seminal and urinary fluid emission arresting devices, systems, and methods of using the same.\"", "This was a new version of his 2014 application for an invention that Sumina billed as \"Urethra Shield — Alternative to the Male Condom\":", "In the 2016 patent application, Sumina wrote:", "A fluid emission arresting device is provided. In some embodiments, the fluid emission arresting device may comprise: a barrier layer made of a flexible material which may comprise a generally planar exterior surface and a generally planar interior surface.", "An adhesive layer may be applied to the interior surface of the barrier layer and may be configured to attach to the glans of the penis to position the barrier layer over the urethra opening to block fluid from exiting the urethra opening. In further embodiments, once the device is attached to the penis over the urethra opening, the barrier layer may prevent fluid from exiting the urethra so that the urethra may function as a fluid reservoir.", "United States Patent Office records suggest that the patent application has not been granted as of June 2018.  In 2017, Sumina Global posted a short instructional video on how the adhesive device is purported to work:", "﻿", "The Jiftip web site features a shopping cart, where users can — at least in theory — purchase three Jiftip strips for $9, or ten for $24. Before completing an order, customers must agree to the following terms and conditions:", "While the web site now features repeated emphatic disclaimers about the safety (or otherwise) of using Jiftip (calling it a \"backup for your pullout\") the makers of the product previously made bold claims about the safety of using the adhesive to have sex without a condom, variously promoting Jiftip with the slogans \"Bareback sex without the worry\" and \"feeling and freedom of raw sex is safe now.\"", "Sumina, in his original 2014 patent application, billed his invention as an \"alternative to the male condom.\" The Jiftip web site now stresses the opposite: \"Is Jiftip a condom alternative? NO! It's a sexual pleasure enhancement device.\"", "The device certainly exists, as the detailed patent application and instructional videos make clear, and the online store embedded in the Jiftip web site would also suggest that the product is for sale. However, we could find no evidence, beyond the web site itself, of anyone actually having bought a pack of the adhesives.", "Despite the fact that Jiftip is such a novelty and has prompted global headlines and giggling coverage on countless radio talk shows, we were unable to find a single Facebook or Twitter post or photo by a member of the public who had decided to experiment with the widely-publicized product or signed up as a beta tester, nor have we found any product reviews written by journalists or published on consumer web sites. The product is not available for purchase on Amazon, eBay, or Google.", "The Jiftip web site itself features two comments from men who present themselves as having either used or ordered the product. We asked the makers of Jiftip for some figures relating to sales and beta-testing signups, as well as possible plans for future retail marketing, but we did not receive a response in time for publication.", "While Jiftip does exist, the prevalence of its usage appears to have been greatly exaggerated in some news reports, and there is absolutely no evidence that \"teens\" are opting for it at all, much less at a higher rate than their older counterparts, which is probably a good thing.", "Tanner, Claudia.  \"Sticker That Seals the Penis Shut Before Sex Will Not Protect Against STIs or Unwanted Pregnancy Like a Condom, Experts Warn.\"\r\n  Daily Mail.  2 August 2017.", "Rivas, Anthony.  \"We Need to Talk About This Sticker for Your Dick.\"\r\n  Buzzfeed.  4 August 2017.", "Zickl, Danielle.  \"Should You Seal Your Penis Shut With This Insane Sticker Instead of Using Condoms?\"\r\n  Men's Health.  2 August 2017.", "Harrison, George.  \"New Product Lets Men Seal Their Penises Shut to Prevent Pregnancy.\"\r\n  News.com.au./The Sun.  3 August 2017.", "Wickman, Dan.  \"Teens Seal Their Penis Holes Closed to Avoid Using Condoms!\"\r\n  Inked.  17 August 2017.", "Sumina, Momo.  \"Patent Application No. 14/712,621 -- Seminal and Urinary Fluid Emission Arresting Devices, Systems, and Methods of Using the Same.\"\r\n  U.S. Patent and Trademark Office.  14 May 2015.", "Basu, Joy.  \"Sex Crazed Men Gluing Their Willie Shut for Pleasure Slammed by Top Docs.\"\r\n  Daily Star.  8 April 2018.", "Buchanan, Sarah.  \"You Won't Believe What Men Are Doing to Their Penises Before Sex.\"\r\n  Daily Star.  1 August 2017.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]