["On March 22, Emily Jones, 7, was killed by a stab wound to the neck at the hands of a woman wielding a knife who leapt from a park bench in Queen's Park in the town of Bolton, in Greater Manchester, England, while the girl, accompanied by her parents, rode by on her scooter, according to The Bolton News and other media.", "The attacker, identified as a 30-year-old woman, was apprehended by a bystander as she tried to flee the scene.", "A posting on Facebook by user Adrian Parker and others claims that Emily was decapitated and that the perpetrator was a Somalian migrant. The post, often a meme, says the \"murder\" has been covered up by the mainstream media.", "The allegations also appear on Reddit and on Twitter.", "The Facebook post shows a formal, close-up photo of Emily, with braided blond hair, looking directly at the camera with a smile. The apparent family photo was also used widely by the media in the coverage of the case.", "In the Facebook posting, a statement is printed below the photo that says: \"I was decapitated infront (sic) of my parents at the park by a Somalian migrant. The media covered up my MURDER My name was Emily Jones;\"", "There is no evidence that the girl was decapitated nor that her attacker is a Somalia migrant. Nor is there evidence that the media covered up any aspect of the case.", "The Greater Manchester Police issued a statement on the incident:", "\"Shortly before 2.35 pm on Sunday, March 22, 2020, police were called to Queen's Park in Bolton following reports that a child had been stabbed. Emergency services attended and found that a young girl — who has since been formally identified as seven-year-old Emily Jones — had been attacked by a woman with a knife. Emily sadly passed away a short while later despite the best efforts of her family and medical responders. The 30-year-old woman arrested at the scene on suspicion of murder was assessed by specialist medical staff and detained under the Mental Health Act. She remains in a highly secure facility.\"", "Coverage of the attack was carried widely by, among others, the BBC, The Times, The Evening Standard, the Daily Telegraph, the Daily Mail, The Sun,  The Guardian as well as local papers The Manchester Evening News, the Lancashire Post.", "The news coverage mainly draws upon comments by the local police and the victim's parents, as well as details from a preliminary inquest.", "None of the reports states  the girl was decapitated, referring instead to wounds to her neck. Some reports suggest local responders tried to treat her at the scene and that she died later, an indication that she had not been decapitated.", "In its statement on the sequence of events following the attack, the Greater Manchester Police said Emily died \"a short while later despite the best efforts of her family and medical responders.\"", "The formal inquest into the girl's death was opened April 1. According to the Evening News coverage of the inquest, a postmortem revealed that she died as a result of an \"incised wound\" of the neck.", "According to ACEPNow, the official voice of emergency medicine from the American College of Emergency Physicians, \"A cut or incised wound is produced by a sharp edge and is usually longer than it is deep.\" That definition would not be consistent with decapitation.", "The attacker was uniformly described as a 30-year-old woman. Under British media law, the suspect cannot be identified, nor her background or citizenship status released, nor any other identifying information, until she is formally charged.", "\"The nature of the attack is something that has to be determined in open court and disclosing the nationality of the women risks identifying her, which we cannot do when she has only been arrested,\" Jonathan Bell, press officer for the Greater Manchester Police, told USA TODAY.", "Assistant Chief Constable Russ Jackson described the attack as totally unprovoked, according to the Lancashire Post.", "\"A 30-year-old woman who was not known to the family was detained by a member of the public and then arrested by the police,\" Jackson said. \"She is currently in custody for murder, and it is expected she will be interviewed by detectives later.\"", "He said officers were attempting to understand a motive for the \"completely random and brutal attack.\"", "He added: \"We understand that the woman has some history of mental illness and we are working to understand if this played any part in her motive.\"", "According to The Guardian, Jackson also said at one point: “I want to stress that this is not an end to the criminal investigation; we will consider the evidence and consult with the Crown Prosecution Service and if appropriate we will be seeking criminal charges.”", "The claim that the suspect is a Somali migrant appears in the Facebook posting and subsequent discussion groups, but without any sourcing.", "Katie Hopkins, a combative British commentator and 2007 contestant on the British version of \"The Apprentice,\" says in a column addressed to Emily's mother, that the girl's \"life ended in one blow by a Somali woman, a stranger to you and to this land.\"", "\"We are not supposed to talk, either, about the Somali killer who hides behind her color and her mental health,\" she writes.", "Hopkins, who came under fire for a 2015 column in The Sun calling migrants \"cockroaches,\" does not offer any evidence tying the killing to a Somali. USA TODAY reached out to Hopkins for comment, clarification or further information on the case but she declined to respond in time for publication.", "One discussion group claims that the two key elements — the purported Somali connection and decapitation — did appear in an early news account online, but were removed. There is no evidence to back up that claim.", "The formal inquest is scheduled to reconvene July 3.", "The claims of a decapitation and a media cover-up are wholly false, while the claim the attack was carried out by a Somalia immigrant is unproven. Therefore, we rate this claim as PARTLY FALSE.", "There is no evidence indicating the girl was decapitated and events at the time show that she was only gravely wounded. There is no evidence regarding the identity of the attacker, nor is there evidence the media has tried to cover up the purported decapitation or the identity of the assailant.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook."]