["The image was published on Twitter here on July 29, 2020. It shows the front page of a Yomiuri Shimbun edition and includes a WeChat watermark at the bottom right.", "The first paragraph of the post’s simplified Chinese-caption reads in English: “In the early morning of July 29, Japan's ‘Yomiuri Shimbun’ revealed a shocking secret. Trump had secretly planned to bomb ‘Huangyan Island’ on July 12.”", "Huangyan Island, also known as Scarborough Shoal, is an island in the South China Sea.", "The post circulated amid heightened tensions between the US and China over a number of issues including the South China Sea, as reported here by AFP.", "The image of the Yomiuri Shimbun newspaper was also shared alongside similar claims here and here on Twitter, here and here on Weibo, and in various articles here, here and here.", "The claim, however, is false.", "At the top right side of the front page, the newspaper is dated in both Japanese and Chinese: “December 9, Showa 16”.", "Showa 16 is a year in the Japanese calendar that corresponds to the year 1941 on the Gregorian calendar.", "Below is a screenshot of the image with the date circled in red:", "A reverse image and keyword search also found a complete digital version of the newspaper front page published here on the official Yomiuri Shimbun website.", "The Japanese caption below the picture translates as:  \"Declaration of war published in Yomiuri Shimbun on December 9, 1941\"", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]