["By Robert Farley", "Posted on October 8, 2020", "Less than a week after being hospitalized due to COVID-19, President Donald Trump now says, “I don’t think I’m contagious at all.” But according to medical experts and Centers for Disease Control and Prevention guidelines, the president may very well still be contagious and ought to be isolated.", "In a phone interview with Maria Bartiromo of Fox Business on the morning of Oct. 8, Trump said he was feeling good and looking forward to resuming campaign rallies.", "“I think I’m better to a point where I’d love to do a rally tonight, I wanted to do one last night, but I think I’m better to a point that I feel better than I did you know, I jokingly said 20 years ago, I feel perfect,” Trump said. “There’s nothing wrong. I had a case, I got it knocked out.”", "“I don’t think I’m contagious at all,” Trump added. “Well, first of all, if I’m at a rally I’d stand by myself very far away from everybody, whether I was or not. But I still wouldn’t go to rally if I was contagious.”", "Trump may not think he is contagious, but according to the CDC “persons with mild to moderate COVID-19 remain infectious no longer than 10 days after symptom onset.” People with more severe illness may be infectious longer than that.", "The CDC recommends that, “For most persons with COVID-19 illness, isolation and precautions can generally be discontinued 10 days after symptom onset and resolution of fever for at least 24 hours, without the use of fever-reducing medications, and with improvement of other symptoms.”", "Trump announced very early Oct. 2 on Twitter that he had tested positive for the virus. In a press conference later that morning, White House Chief of Staff Mark Meadows told reporters that the president was experiencing “mild symptoms.” Later in the day, the White House announced Trump would go to Walter Reed National Military Medical Center, where he spent three days getting treatment before being discharged back to the White House on Oct. 5.", "In an Oct. 7 memo, Trump’s physician, Dr. Sean Conley, said the president has “now been fever-free for more than 4 days, symptom-free for over 24 hours, and has not needed or received any supplemental oxygen since initial hospitalization.”", "Still, Trump’s statement that he no longer believed he was contagious came just seven days after he first began to experience symptoms. In an interview on MSNBC, Dr. Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases, said the president’s pronouncement was premature.", "“Well, you know the general guideline from the CDC says that 10 days from the onset of symptoms, that you can essentially consider someone noninfectious,” Fauci said. “You can definitively show that by another one of the recommendations that had been made about two negative PCR tests, 24 hours apart. So if the president goes 10 days without symptoms and they do the test that we were talking about, then you could make the assumption, based on good science, that he is not infected. But you just have to wait and make sure you go through those particular benchmarks that are delineated in the CDC guidelines.”", "In a press call on Oct. 7, the day before Trump said he thought he was no longer infectious, Dr. Roger Shapiro, associate professor of immunology and infectious diseases at the Harvard T.H. Chan School of Public Health, said that patients with “mild or even moderate disease” may be “rendered non-infectious in about 10 days just by natural course of the illness and immune control that would be expected for most individuals.”", "“However,” he said, “people with more severe disease can remain infectious for 20 days or even longer.”", "There is “a real possibility” Trump fits in that latter category, Shapiro said, “and it might be made even greater by the fact that President Trump received steroids.” Steroids, he added, can be “very helpful in reducing mortality, especially late in the illness,” but “we don’t yet know the effect that they may have in terms of prolonging the shedding of virus.”", "On Oct. 4, Conley said that Trump had experienced “two episodes of transient drops in his oxygen saturation,” indicating Trump’s lungs may be compromised. As a result, the president began to take dexamethasone, a steroid drug.", "“It really depends on how severe his COVID is,” Shapiro said. “And that is a matter of some debate right now. … It is unclear whether he is in a more moderate category or whether he really tipped over towards a severe disease, which would be suggested by the fact that he received the dexamethasone for his illness.”", "“So I think it’s still is a real unknown as to whether or not, President Trump will be shedding virus in the middle of next week,” Shapiro said.", "Dr. Leana Wen, a former Baltimore health commissioner, told CNBC the president’s comments are “truly unbelievable” and the fact that he is considering holding a rally is “mind blowing.”", "“Just less than a week ago, the president was in a hospital being treated for severe illness,” said Wen, an emergency physician and public health professor at George Washington University. “It’s very likely that he’s still shedding virus right now.”", "Dr. Syra Madad, senior director of the systemwide special pathogens program at New York City Health + Hospitals, told CNBC the president ought to isolate for at least 10 days, per the evidence-based CDC guidance.", "“If [Trump’s] not going to isolate for that full period when he may be infectious, then, as a doctor, why would we tell other people to do the same,” Madad said. “Why should they listen to us when the president of the United States isn’t abiding by his own public health measures?”", "Editor’s Note: Please consider a donation to FactCheck.org. We do not accept advertising. We rely on grants and individual donations from people like you. Credit card donations may be made through our “Donate” page. If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, 202 S. 36th St., Philadelphia, PA 19104.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here for more.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]