["This link from April 4, 2017 has been shared on Facebook 3,227 times and details a story about how a German tourist surprised doctors at a Western Cape hospital by giving birth to three puppies.", "The article appears on the official website of a DJ based in South Africa, which links to a Twitter account with more than 70,000 followers and Facebook account with over 40,000 followers.", "It is not clear what animal is in the photo. A Google reverse search of the image shows articles from Malaysia in April 2016 - about a goat born with human-like features. The Malaysian Veterinary Department did not immediately respond to confirm the pictured animal was tested by them.", "A google search of the headline leads to an article from February 25, 2016 that reads: “Woman Gives Birth To Puppies After Admitting To Sex With Family Dog”, supposedly in Utah, United States.", "It was posted on Empire News a site that carries a disclaimer for the content it posts: “Empire News is intended for entertainment purposes only.”", "The same text as on the DJ's website is picked up and posted with a video on YouTube with more than 29,000 views. That shows images of silicone dolls in the form of characters from James Cameron's Avatar movie and resembling those found on this website.", "It is impossible for a woman to give birth to a dog.", "“All animals carry DNA which is the genetic instructions which inform development, growth and functioning of the body. The DNA code is unique to every species,” explained Tabitha Haw, lecturer and genetic counsellor at the University of Witwatersrand in Johannesburg.", "“As both the human mother and father have human DNA code, they will have a human baby.  They are not able to produce a different species of animal such as dog or goat because they do not carry the DNA code for dog or goat in their egg/sperm.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]