["About this rating", "On 19 May 2018, a photograph of renowned action movie star Jet Li went viral online purporting to show the martial arts expert in \"frail\" physical condition:", "So, apparently, Jet Li is suffering from \"hyperthyroidism and spinal problems\" and this is him now ❤️?: pic.twitter.com/Ss0W2EL96D", "— simón (@StxNaty) May 19, 2018", "The photograph caused an outpouring of concern for Li, who has a large international fan base, but the Beijing-born actor's manager said Li is in good health and the image was taken in particularly unflattering light. Li is also 55 years old, and the natural graying of hair associated with age coupled with glaring sunlight could have created an optical illusion making him appear to have aged rapidly.", "Although we have no medical doctors on staff who can diagnose a person by viewing a single photograph, we found no evidence that Li's health is in a downward spiral other than the fact he is abiding by the same rules regarding the passage of time as everyone else.", "Li's Los Angeles-based manager, Steve Chasman, attempted to dispel concern, telling the Washington Post that the actor (whose real name is Li Lianjie) has a chronic condition, but he is otherwise well:", "He has hyperthyroidism that he’s been dealing with for almost 10 years. It’s nothing life-threatening and he’s dealing with it.", "Speaking to USA Today, Chasman said LI is in \"great shape\" and the photograph, which was taken in Tibet, is being blown out of proportion:", "It’s one picture and people are making these interpretations from it. If you took a picture me at the wrong angle and wrong time of the day, I could look frail as well.", "Perhaps adding to the illusion that Li has aged more rapidly than expected is the fact he now wears his hair shaved as opposed to the thick shock of hair seen in many of his movies. He also has taken to wearing round-rimmed glasses. According images and videos posted to his social media accounts, Li started sporting a bald head in 2017:", "Introducing #GSD to the world is my happiest moment in 2017, it was my pleasure to teach some basic #wushu steps to ambassadors from various countries. #jetli @jetli_com pic.twitter.com/kC8AKC4jkG", "— Jet Li 李连杰 (@jetli_official) January 24, 2018", "Although some news reports fretted that Li hasn't been seen on the big screen in recent years, he has simply has not been in the English-language arena. Instead, Li has been busy making Chinese-language films and television shows. He starred in and produced the action short film Gong Shou Dao in November 2017, playing the part of an old monk:", "Some took to social media in his defense, pointing out that aside from expected aging, Li looks like his old self:", "Hot take: Jet Li is focused on his charity work and is no longer working in front of the camera, so he’s not dyeing/augmenting his hair, or stuffing himself with HGH like other action stars his age. His injuries have taken a toll, but zoom in; he looks like a content 55-year-old. pic.twitter.com/CcYy39Eozs", "— Phil Nobile Jr. (@PhilNobileJr) May 22, 2018", "In early 2017, Li told fans he wanted to focus more of his efforts on humanitarianism through his nonprofit, the One Foundation, and his company Taiji Zen. Sporting his current look with a bald head and thick round glasses, he wished fans a happy New Year in 2018:", "Li announced in 2013 that he has hyperthyroidism, a condition that causes the thyroid gland to overproduce hormones. About one in 100 Americans have the condition, which can be treated with medication. A lifelong practitioner of martial arts who acts in movies full of dangerous stunts, Li has also had several serious injuries. Reports of ailments and injuries forcing Li off movie sets have floated around in news reports for more than a decade.", "We reached out to Chasman but have not received a response. Chasman has distributed a grinning photograph of the actor to the news media (absent glaring sunlight) that he said better represents Li's physical condition.", "Wong, Herman. \"A Viral Photo Has Jet Li Fans Worried About His Health. The Actor’s Manager Responds.\"\r\n  The Washington Post. 22 May 2018.", "Alexander, Bryan. \"'Jet Is Completely Fine': Jet Li's Manager Denies 'Expendables' Star Is in Poor Health.\"\r\n  USA Today. 21 May 2018.", "Alladin, Unus. \"Is This the Same Jet Li We All Know? Martial Arts Legend Battles Illness and Injuries as Fans Express Shock.\"\r\n  South China Morning Post. 19 May 2018.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]