["About this rating", "In July 2016, a rumor began circulating on social media claiming that the agribusiness giant Monsanto corporation had purchased or merged with Whole Foods Market organic grocery chain  Claims of that nature were not new in mid-2016, but blog posts published then reinvigorated social media rumors about a purchase or merger involving Monsanto and Whole Foods. An undated blog post published by Healthy Holistic Living asserted in a headline that \"Whole Foods Join[ed] Monsanto,\" linking to a 28 June 2016 Food Democracy article that utilized the same language (in part).", "Owing to the frequent truncation of titles on social media, many users were exposed only to partial headlines, leading to widespread misinterpretation and inferences that Monsanto and Whole Foods had merged. However, the Food Democracy article pertained to a dispute over a legislative bill that would allow the labeling of genetically modified foods (GMOs) to be effected through the use of Quick Response (QR) codes, not to a corporate merger:", "[Food] companies, including Whole Foods, Smucker’s and Organic Valley, among others, have historically funded major public relations and advertising campaigns to promote themselves as “organic” brands. Now, some national leaders are criticizing these companies for “selling out” the GMO labeling movement, public health, and the environment, and urging the public to fight back.", "“Make no mistake, these self-proclaimed organic companies, including Whole Foods, Smucker’s Stonyfield and Organic Valley have just joined with Monsanto and sold out the ability for parents to know what they are feeding their children,” said Dave Murphy, Executive Director of Food Democracy Now!.", "Murphy continued, “Monsanto and Whole Foods’ new fake labeling bill would not only preempt Vermont’s bill this week, but all provisions of the bill are OPTIONAL — the bill’s language is so poorly written that it would actually not include 85% of the current GMOs on the market, including Roundup Ready GMOs owned by Monsanto that are sprayed with the weedkiller glyphosate, which the World Health Organization declared a “probable carcinogen” linked to cancer in lab animals and humans last year.”", "The underlying controversy over labeling of GMO-derived food products was widely discussed on alternative health web sites and blogs but received little news coverage. On 6 July 2016, political news outlet The Hill reported on a disturbance that had occurred that day during a GMO labeling vote involving the Organic Consumers Association (OCA):", "Members of the Organic Consumers Association threw money from the Senate gallery onto the floor to protest a vote on a bill to block states from issuing mandatory labeling laws for foods that contain genetically modified organisms (GMOs).", "The protesters yelled \"Monsanto Money\" and \"Sen. Stabenow, listen to the people, not Monsanto\" while $2,000 fell to the floor.", "The disturbance came during a procedural vote to advance the bill in the Senate. In an email to The Hill, U.S. Capitol Police spokeswoman Eva Malecki said four people were arrested for the disturbance in the Senate gallery and are being charged with unlawfully demonstrating, a misdemeanor.", "The legislation, authored by Sen. Debbie Stabenow (D-Mich.) and Sen. Pat Roberts (R-Kan.), allows food producers to use QR codes, or a form of barcode, that consumers scan with smartphones to find out if a product contains GMOs. The codes would come in place of a label that the product was “produced with genetic engineering” — something now required by state laws in Vermont, Maine, Connecticut and Alaska.", "Opponents have nicknamed the bill, and others like it, the DARK, or Denying Americans the Right to Know, Act.", "The Organic Consumers Association said the money is to highlight the fact that senators who received money from Monsanto and other agribusinesses are voting against the 9 out of 10 people in America who support GMO labels.", "“When Congress moves to crush the will of 9 out of 10 Americans because they need companies like Monsanto to fund their campaigns, you know our democracy is in real trouble,” Alexis Baden-Mayer, the group’s political director who participated in the action, said in a statement. “The corporate lobbyists are totally corrupt.”", "On 1 July 2016, Whole Foods co-CEO Walter Robb published a blog post \"clarifying\" earlier comments he made about GMO labeling at a June 2016 conference in Aspen, and those remarks ostensibly fomented the rumors about a Monsanto/Whole Foods merger. In that statement, Robb denied he or Whole Foods had ever supported only QR code-based labeling of genetically modified products:", "I’ve been receiving questions about comments I made during a panel discussion at the Aspen Ideas Festival when I was asked about GMO legislation. I truly appreciate all of the feedback and want to provide clarification and context so that there’s no misunderstanding about Whole Foods Market’s position on GMO labeling.", "My comment about Senator Stabenow “doing an incredible thing” with the bill was an acknowledgement that garnering bipartisan support on mandating any amount of GMO transparency represents significant progress over the DARK Act, which would have prevented mandatory labeling of GMOs at the state or national level. While the Stabenow-Roberts bill and the Vermont bill both aim to make it easier for consumers to identify GMO ingredients for consumers — a good thing at the fundamental level—no piece of legislation is perfect.", "I ended my response by reiterating that regardless of how GMO legislation may unfold, Whole Foods Market remains committed to working with our supplier partners to provide transparency in our U.S. and Canadian stores in 2018 and that our policy goes beyond what’s being proposed at the state or national level.", "Whole Foods Market has supported all state-level GMO labeling initiatives where we have stores with the hope that any bills that pass will lead to national legislation. We’ve long-supported the idea of a national policy requiring mandatory GMO labeling because it would help accelerate change in the marketplace and provide transparency for all customers nationwide. That said, our position has always been to support mandatory labeling of GMO foods through clear, on-package language, not QR codes or 1-800 numbers, which is our primary concern with the Stabenow-Roberts bill as currently written.", "We believe that in order to be truly transparent, food labels needs three things: a real standard (organic, for example), a third party verification and a reasonable label claim that’s easy for a customer to understand. It’s not just up to food companies to provide this though. Consumer demand plays a critical role in accelerating these changes.", "By 7 July 2016, the majority of comments published by users to Whole Foods' Facebook page pertained to rumors about a Monsanto/Whole Foods merger. Representatives for Whole Foods alternately linked to Robb's 2016 blog post and a 2 February 2012 Whole Foods article addressing and refuting earlier claims of the same nature:", "Stop the insanity! I help with customer inquiries here at Whole Foods Market and we’ve been hearing some wild, off-base stories from folks around the country lately.", "For brevity’s sake, I’m going to list them here in hopes of dispelling these rumors.", "Rumor No. 1: Whole Foods Market has been bought by Monsanto. No! What crazy talk! We’ve never had any affiliation with that company. We are publicly traded; our majority shareholders are listed in documents filed with the SEC and, I promise, Monsanto is not on the list and never has been.", "Rumor No. 2: Whole Foods Market made a secret deal with Monsanto to support the deregulation of GMO crops like alfalfa. Again, no way! This ridiculous rumor started over a year ago in January 2011 because of the Organic Consumer Association’s (OCA) misleading article titled “Whole Foods Caves to Monsanto.”", "You see, Whole Foods Market and others in the organic food industry met with the US Secretary of Agriculture in support of farmers’ rights to grow Non-GMO crops.", "Because we did not take the exact hard-line stance that the OCA did, they accused us of “being in bed with Monsanto,” and the rumor developed from there. Whole Foods Market has no ties to Monsanto and did not have any interaction with the company concerning this or any other issue. For a good description of what really happened, here’s a solid Washington Post story.", "You can also read our blog response from last year.", "Rumor No. 3: Whole Foods Market recently decided to start selling food with GMOs. Wrong again! As long as GMO crops have been in this country, GMOs have been in the US food supply. The most effective action we can take now is to label the food that DOESN’T include GMOs. That’s why we’ve enrolled our 365 Everyday Value and 365 Organic product line in the Non-GMO Project Verification Program, and have encouraged our branded vendors to do the same — and many, many have.", "Letton, Libba.   \"GMO/Monsanto Buyout Rumors Untrue.\"\r\n    Whole Story: The Official Whole Foods Market Blog.   2 February 2012.", "Robb, Walter.   \"Clarifying My Comments on GMO Legislation.\"\r\n    Whole Story: The Official Whole Foods Market Blog.   1 July 2016.", "Wheeler, Lydia.   \"Group Drops $2,000 on Senate Floor to Protest GMO Bill.\"\r\n    The Hill.   6 July 2016.", "Food Democracy Now!.   \"Whole Foods Joins Monsanto Try to Kill GMO Labeling in America.\"\r\n    28 June 2016.", "Healthy Holistic Living.   \"Whole Foods Joins Monsanto Try to Kill GMO Labeling in America Learn.\"\r\n    Undated.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]