["In recent weeks, crime rates and drug problems in Manchester, the state’s largest city, have  come to the fore in New Hampshire’s race for governor.", "That’s no surprise, as one of the Republican candidates is Manchester Mayor Ted Gatsas.", "On the campaign trail, Gatsas often talks about making Manchester a safer city and fighting the ongoing heroin crisis.", "Executive Councilor and fellow Republican Chris Sununu targeted Gatsas’ record on crime.", "\"Ted Gatsas has let down Manchester: rising crime, higher taxes, the heroin crisis,\" Sununu said in an ad titled \"Fresh Leadership.\"", "As Sununu spoke, a statistic flashed on screen: \"Manchester’s crime rate has increased by 19 percent.\"", "We decided to see if crime in the Queen City has increased that much under Gatsas’ tenure.", "Sununu’s staff cited a WMUR article as evidence of a rising crime rate.", "Data from the Manchester Police Department showed that from 2008 to 2015, \"Part 1\" crimes, the most serious crimes, rose by 19 percent. Part 1 crimes include violent crimes such as homicide, forcible rape, robbery, aggravated assault, as well as property crimes such as burglary, larceny/theft, motor vehicle theft and arson.", "In his ad, Sununu lays the blame at Gatsas’ feet. It’s important to note that Gatsas took the mayor’s office in 2010, after the crime trend cited by Sununu started.", "To see the bigger picture, we analyzed the FBI’s Uniform Crime Statistics for Manchester in five year increments from 2000 to 2015.", "The data shows an overall 17 percent increase in crime rates in Manchester, however, the biggest spike occurred from 2005 to 2010, before Gatsas took office.", "After Gatsas became mayor, crime went up about 9 percent, far less than Sununu’s statistic.", "Looking at year-over-year statistics while Gatsas has been mayor shows crime rising and falling in alternate years, rather than increasing steadily throughout.", "Crime rose the most dramatically in 2010 and 2012, when it shot up by 12 percent and 11 percent, respectively. Years 2011 saw a decrease of 8 percent while 2013 saw a decrease of 6 percent.", "Manchester police Chief Nick Willard also challenged Sununu’s claim and said crime has actually been going down in Manchester this year.", "Statistics released by the department show a 22 percent drop in property crimes between 2015 and 2016, which has driven the overall crime rate down 27 percent so far this year (the rates of violent crime have stayed on par with last year). Of course, the year isn’t over, so that number is subject to change.", "Manchester police attribute this drop to a new computer model they’ve implemented that allows them to predict where a crime is likely to occur. Using a crime-mapping program, the computer model analyzes where crimes have occurred in the past to predict where they might occur again.", "Willard said that program combined with more community policing and beefed up patrols has so far helped drop the city’s crime rate to drop this year.", "It’s important to note that economic factors and demographics have a greater influence over crime rates than a city’s elected leader. A chief executive can have some influence over crime rates through police funding, and Gatsas has been a law enforcement backer.", "Our ruling", "Chris Sununu says crime is ‘rising’ in Manchester and has gone up 19 percent under Mayor Ted Gatsas.", "Sununu didn’t specify a time range for his claim about crime in the state’s largest city. But looking at recent crime stats from the Manchester Police Department shows crime did increase by 19 percent from 2008 to 2015.", "However, Gatsas wasn’t in office that whole time and more recent data shows crime in the Queen City to be dropping or holding steady. It’s also dubious to link a crime rate, for good or ill, to any specific administration.", "On balance, we rate it Half True.", "Union Leader, Manchester chief credits computer modeling for dip in crime, March 30, 2016", "WMUR, Major crimes down in Manchester; new computer tool credited, March 29, 2016", "FBI, Crime in the United States", "PunditFact, Is NYC mayor de Blasio responsible for uptick in murders and more subway delays?, March 23, 2015", "PolitiFact Nevada, Ad blaming Cortez Masto for crime upticks as AG too narrow, misleads on blame, Aug. 10, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]