["At a town hall with CEOs, President Donald Trump said his administration will be able to get rid of 90 to 95 percent of regulations \"and still have the same kind of protection.\"", "\"We want safety and we want environmental protection,\" Trump said April 4. \"I've won awards on environmental protection. I'm a big believer, believe it or not. But we want that kind of protection. We want clean air and we want clean water, but we shouldn’t have to get the approvals from 16 different agencies for almost the same thing.\"", "Many readers asked us to look into Trump’s statement about his environmental awards.", "It’s something he’s said before. At a 2015 campaign rally in Iowa, even as Trump scoffed at environmental regulations -- as in \"a snail, or turtle or snake or something\" that blocked projects -- he said his environmental bona fides were sound.", "\"I’m a big believer in clean air and clean water,\" he said Dec. 11, 2015. \"I have gotten so many awards for the environment.\"", "While Trump might have talked about \"many awards\" in Iowa, here, we’re simply looking for at least two. The White House pointed to the two it knows about.", "A New Jersey golf course", "In 2007, one of Trump’s golf courses got an award. The Metropolitan Golf Association gave its first annual environmental award to the Bedminster New Jersey Trump National Golf Course. How much credit did Trump get?", "Some. The man who accepted the award on behalf of the golf course, Greg Nicoll, got his moment in the sun, too.", "The association’s announcement said Nicoll \"has been an environmental leader among Met Area clubs. Through the leadership of Donald J. Trump, Nicoll has implemented an environmental strategy that has resulted in the preservation of a dedicated 45 acre grassland bird habitat on the property, as well as intensive erosion control and stream stabilization management plan.\"", "So it wasn’t a personal prize for Trump, but the golfing club certainly gave him a thumbs up.", "Trump did get personal recognition in the second award on the White House’s list. (Hat tip to the Washington Post Fact-checker.)", "Forest land in New York", "It seems 2007 was a good year for Trump and the environment. That year, the Friends of Westchester County Parks gave Trump its inaugural Green Space Award for donating over 400 acres to the state park system. The group’s treasurer, Chris Frawley, said, \"It is with heartfelt gratitude that we honor Mr. Trump for his vision and commitment to preservation of open space.\"", "Interestingly, there’s a golf connection here, too, and a backstory of Trump’s experience with environmental permitting.", "Trump had bought land in Yorktown, about 35 miles north of Manhattan, with plans to turn forest and meadows into a 155-acre golf course. He spent four years trying to win approval, but hit delays due mainly to wetlands on the property and its proximity to a drinking water reservoir. Golf courses use a bevy of chemicals to maintain the turf essential to the game.", "Jim Tierney, an assistant state attorney general overseeing New York City's watershed, told the New York Times that Trump’s golf course in Yorktown would have been within a mile or so of the New Croton Reservoir, an unfiltered drinking water source for 900,000 city and county residents.", "''Once something gets into the drinking water, it doesn't get filtered out,'' Tierney told the newspaper. ''It comes out of the faucet.''", "In 2002, Trump pulled the plug on the project. In a letter announcing his decision, as reported by the New York Post, Trump told the Yorktown supervisor, \"You have done a terrible disservice to your constituents who have sadly lost out on a tremendous opportunity.\"", "The town said it was still working to resolve issues with Trump when he withdrew his plans. Trump saw it differently.", "''I think the approval process in Westchester is even more difficult than the approval process in Manhattan,'' Trump told the New York Times. ''But in a perverse way, they've done me a favor because the land has gotten more valuable.''", "Trump’s letter said he could make more money selling the land to home builders than developing it for golf. Ultimately, after a few years, he decided to donate the land. The state created the Donald J. Trump State Park, and Trump got his award.", "There’s a coda to that: In 2010, budget cuts led the state to say it would no longer maintain the park lands. Trump said \"If they’re going to close it, I’ll take the land back,\" according to news reports. He didn’t take further action.", "It's worth noting that these two awards were not from major environmental groups such as the Sierra Club or the Environmental Defense Fund. They were from local groups for specific projects.", "Our ruling", "Trump said that he has won awards for environmental protection. The White House pointed to two that include his name. One thanked him personally for donating over 400 acres of undeveloped land to the New York State Park System. The other recognized the environmental stewardship of a Trump golf course in New Jersey operated by a well known manager, and cited Trump’s leadership in general terms.", "So Trump can firmly claim one personal award and one where his role and the accorded honor are more diffuse.", "By definition, two is plural, but the personal recognition of Trump is thin for the second one. We rate this claim Half True.", "White House, Remarks by President Trump and Vice President Pence at CEO Town Hall on Unleashing American Business, April 4, 2017", "Metropolitan Golf Association, Trump National Bedminster is recipient of first annual MGA  club environmental award, March 22, 2007", "The Free Library, Trump, Spano honored by parks group, 2007", "New York Times, Trump Drops Plans to Develop 2 Golf Courses North of the City, FEb. 14, 2002", "New York Post, Trump dumps courses, Feb. 14, 2002", "New York Times, Trump State Park Fired. Trump Displeased., March 3, 2010", "Washington Post, Trump’s unsupported claim he has ‘received awards on the environment’, Jan. 24, 2017", "Washington Post, Trump may be mean, but he’s definitely not green, April 15, 2016", "C-SPAN, Presidential Candidate Donald Trump Rally in Des Moines, Iowa, Dec. 11, 2015", "Email interview, Steven Cheung, assistant communications director, White House, April 5, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]