["About this rating", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "In July 2020, as America's total of confirmed coronavirus cases surpassed 3.3 million, U.S. President Donald Trump criticized the advice of public health experts on how to safely reopen the country's K-12 school system during the pandemic, and campaigned in full force for in-person classes to resume nationwide.", "The push by the Republican president included threats to withhold federal funding to school systems that did not agree with his approach (see the July 8, 2020, tweet here), unsubstantiated claims that state Democrats had political motivations to keep schools closed ahead of the November 2020 election, and several media appearances in which he and ally Betsy DeVos, the secretary of education, emphasized how opening K-12 classrooms would jump-start the country's distressed economy.", "And during that parade of public events, critics of the country's top education official and the president claimed that DeVos had nonchalantly stated the cost of young American's lives should schools fully reopen during the pandemic. Facebook statuses and tweets went viral among educators, parents and activists, stating:", "It's unclear from where, exactly, the claim originated. And first, to measure its legitimacy, we did some back-of-the-napkin math. According to the National Center for Education Statistics, the federal government prepared for 56.6 million K-12 students in fall 2019 (50.8 million in public schools and 5.8 million in private education). That means 11,320 — not 14,740 — is .02% of the country's student population.", "Apart from the statement's inaccuracy, our analysis of DeVos' public appearances found no evidence to show she made the comment. We deemed several speeches at the White House, as well as televised interviews on CNN's \"State of the Union\" and \"Fox News Sunday\" on July 12, 2020, as the likely sources of inspiration for the rumor, considering the timing and content of those events. In the first of those appearances, which took place on July 7, 2020, for instance, DeVos said:", "It’s clear our nation’s schools must fully reopen and fully operate this school year.  Anything short of that robs students, not to mention taxpayers, of their futures — and their futures represent our nation’s future. So it’s not a question of 'if'; it’s just a question of 'how.'", "The following day, after a meeting of the White House coronavirus task force, she made similar remarks, and praised several school systems for their quick transition to remote learning in the early weeks of the outbreak, including New York City's Success Academy Charter Schools and Miami-Dade County Public Schools. Simultaneously, she claimed, other local school districts were \"doing next to nothing\" to teach students during the unprecedented rules against in-classroom learning.", "Three days later, DeVos addressed CNN's audience via an interview on why she believed schools should fully reopen in the fall, even though the country's daily spike in COVID-19 cases was on the rise and did not show signs of a decline. There, DeVos mostly re-emphasized talking points she made during the White House briefings and downplayed the health risks to students should schools fully reopen, essentially affirming the underlying sentiment to critics' claim about the projected death toll. DeVos stated, referring to \"data\" that she did not define:", "There's nothing in the data that would suggest that kids being back in school is, is dangerous to them — in fact, it's more a matter of their health and well-being that they be back in school.", "In both the CNN and Fox News interviews, DeVos pointed to research that suggests children are less likely to suffer severe symptoms due to COVID-19 compared to adults.", "While people of any age with certain underlying conditions are at higher risk of serious illnesses should they catch COVID-19, children are more likely than adults to have mild illnesses, and patients over the age of 18 may have different symptoms than youth, per the Centers for Disease Control and Prevention (CDC).", "According to a study of U.S. children infected with COVID-19 between February and April 2020 by the CDC, for instance, the youth population made up less than 2% of the country's cases, totaling 150,000. Additionally, three COVID-19 patients under the age of 18 died during that time frame, compared to roughly 5,450 fatal cases among adults. The study stated:", "[Relatively] few children with COVID-19 are hospitalized, and fewer children than adults experience fever, cough, or shortness of breath. ... Social distancing and everyday preventive behaviors remain important for all age groups because patients with less serious illness and those without symptoms likely play an important role in disease transmission.", "In other words, the CDC says: \"If children meet in groups, it can put everyone at risk. Children can pass this virus onto others who have an increased risk of severe illness from COVID-19.\"", "DeVos said school systems should consider those recommendations on a case-by-case basis, and urged local leaders to consider \"granular data\" that depicts COVID-19's impact on their community, specifically.", "However, at no point during the broadcast interviews or the previously-mentioned White House speeches in July 2020 did the education secretary make the alleged statement about a percentage of students dying as a result of COVID-19 when schools fully reopen. Additionally, there was no evidence that she had made the statement on social media accounts, nor via press releases, around the time the claim went viral. For those reasons, we rate this claim \"False.\"", "U.S. Department of Education.   Press Releases.\r\n   Accessed 13 July 2020.", "Aivalis, Christo.   \"Data Bash GRILLS Betsy DeVos Over Trump Plan to FORCE Kids Back to Unsafe Schools.\"\r\n   YouTube.   12 July 2020.", "New York Times.   \"Coronavirus in the U.S.: Latest Map and Case Count.\"\r\n   The New York Times.   13 July 2020.", "CNN Politics.   \"Bash Questions DeVos: Why Do You Not Have Guidance?\"\r\n   Accessed 13 July 2020.", "Binkley, Collin.   \"Trump Pushes State, Local Leaders to Reopen Schools in Fall.\"\r\n   The Associated Press.   7 July 2020.", "Seewer, John.   \"'Moving Target': Schools Deal with New Plans, Trump Demands.\"\r\n   The Associated Press.   12 July 2020.", "Tanner, Lindsey.   \"Virus Spread, Not Politics Should Guide Schools, Doctors Say.\"\r\n   The Associated Press.   12 July 2020.", "CDC.   \"Coronavirus Disease 2019 in Children — United States, February 12–April 2, 2020.\"\r\n   Accessed 13 July 2020.", "Mayo Clinic.   \"COVID-19 (coronavirus) in Babies and Children.\"\r\n   Accessed 13 July 2020.", "White House.   \"Press Briefing by Vice President Pence and Members of the Coronavirus Task Force.\"\r\n  8 July 2020.", "National Center for Education Statistics.   \"Back to School Statistics.\"\r\n   Accessed 13 July 2020.", "John Hopkins University and Medicine.   \"Mortality Analyses.\"\r\n   Accessed 13 July 2020.", "Correction [16 July 2020]: A paragraph comparing the \".02%\" figure cited in the meme with the actual U.S. case fatality rate has been removed because the comparison was not apt.", "Jessica Lee is Snopes' Senior Assignments Editor with expertise in investigative storytelling, media literacy advocacy and digital audience engagement.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]