["The claim was shared in this Facebook post on November 28, 2020.", "It reads in part: \"BASKETBALL IS ALLOWED / PROVIDED ONLY PLAYERS OF THE SAME VILLAGE SHALL PARTICIPATE IN THE SAME / EXECUTIVE ORDER NO. 83 / 13 NOVEMBER 2020\".", "Sports events were prohibited in the Philippines as part of the government measures to curb coronavirus infections, according to this April 2020 statement.", "In May 2020, the government eased restrictions on non-contact sports, but retained prohibitions on basketball and other contact sports, the state-run Philippine News Agency reported here.", "In July 2020, the government allowed professional basketball players to resume training, PNA reported here.", "An identical graphic that claimed the government had already allowed basketball games in the country was also shared in Facebook posts here, here, here, here and here.", "The claim is misleading; the graphic shows a local government issuance and does not apply to the entire country.", "Combined reverse image and keyword searches on Google found the graphic was shared in this November 13, 2020 Facebook post by the youth council in Baybay City in central Philippines.", "The Facebook post links to this local issuance -- Executive Order No. 83 -- “placing the city of Baybay under modified general community quarantine and prescribing measures and protocols against Covid-19”.", "Below is a screenshot comparison of the graphic in the misleading posts (L) and the graphic in the Facebook post by the Baybay City youth council (R):", "In response to the misleading posts, Philippine health undersecretary Dr. Maria Rosario Vergeire told AFP the claim was not true.", "“Only professional games were allowed by (the Inter-Agency Task Force on Emerging Infectious Diseases),” she said in a Viber message on December 2, 2020.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]