["About this rating", "In early October 2012, stories emerged in the British media reporting that two portly men, one of whom was a former rugby player, were kicked out of an all-you-can-eat buffet for taking the establishment up on its offer and actually eating all they possibly could:", "George Dalmon, a former rugby player, and his friend Andy Miles were banned from all-you-can-eat restaurant, Gobi, In Brighton, after the manager branded them \"a couple of pigs\".", "The men would each eat five bowls of stir-fry during their regular meals at the Mongolian barbecue, which invites guests to create their own dishes from the buffet.", "But Mr Dalmon, 26, said the restaurant should honour its promotion. He said: \"They've only got small bowls and you can't get enough in there so we always go back for more.", "\"We've been eating there for a couple of years then suddenly the owner came to our table in front of all the customers and went absolutely mental. He said we were a couple of pigs and we were banned for life. I couldn't believe it.\"", "The two gamely posed for photographs holding their presumably empty bellies and extending their hands in bowl shapes as if to ask for more in \"Oliver Twist\" fashion.", "As Cracked.com pointed out in a March 2017 round-up of \"ironic\" stories \"swallowed whole\" by the public, there are two sides to the story, and it's unclear if the men were really kicked out of the restaurant for the amount they ate or for bad manners — or for a combination of factors. We sent a message to co-owner Peter Westgate, but haven't heard back. According to Dalmon, who we contacted via Facebook messenger, the restaurant has closed due to \"bad press.\"", "The BBC spoke to Westgate in 2012, who said Dalmon and Miles were barred from the restaurant because they created a disturbance with their voraciousness:", "Like when the shark shuts its eyes before it feeds, they're like that. They just get to the buffet and whatever happens they just pile it in.", "They muck the buffet up for everyone, they push and shuffle people from the barbecue area and it's pretty sad really, because you can eat all you like over five-and-a-half hours — it's not an issue, you don't need to rush.", "Dalmon rejects that account. He told us:", "He was basically saying we were like sharks at feeding time or to a feeding frenzy which I thought was quite funny. But no, it wasn't the case at all. We didn't go in there like a bunch of piranhas and start throwing food everywhere, that wasn't the case. Basically what it was, they were obviously trying to save money and cut costs which I don't understand. What's the point in having a business running an all-you-can-eat restaurant if you're worried about people eating into your profits? Don't do it if you can't afford it. He [the co-owner, Peter Westgate] was always watching what you were taking and things like that.", "As a result of the GOBi restaurant saga, Dalmon landed a show with Channel 4 called the \"2,000,000 Calorie Buffet,\" a comedic challenge in which he is invited to restaurants to \"see if I can beat them or they can beat me.\" He told us he's now in talks about taking the show international.", "Getting ejected from an all-you-can-eat buffet for eating all one can eat is a common comedic trope, one that formed plot of an episode of the long-running animated series The Simpsons, among others. It was also the subject of a viral (but fake) news story from 2016, in which a fictional 51-year-old welfare recipient spent seven hours eating up to 70 pounds of food at a Golden Corral restaurant in Massachusetts, and then supposedly sued the chain after they gave him the boot.", "Breeding, Jonathan.   \"5 B.S. ‘Ironic’ News Stories the Public Swallowed Whole.\"\r\n    Cracked.   23 March 2017.", "The Telegraph.   \"Pair Banned From All-You-Can-Eat Restaurant for Eating Too Much.\"\r\n    2 October 2012.", "BBC News.   \"Brighton All-You-Can Eat Restaurant Bans Two 'Greedy' Diners.\"\r\n    3 October 2012.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]