["Statues of George Washington, such as this one in Boston, mark the role he played in the founding of the country, but for some, his slave-owning past gets overlooked. ( Flickr via Creative Commons license)", "With the debate over Confederate statues roiling the country, Georgia Republican gubernatorial candidate Brian Kemp suggested a similar controversy is brewing over the founding fathers.", "\"You've seen it in the news — the radical left in our country, stinging from their 2016 election losses, has become increasingly desperate and unhinged,\" he wrote in an Aug. 23 fundraising email. \"They want nothing more than to push their snowflake agenda on the entire nation, and our conservative Georgia values are under attack like never before. Now they're even calling for the removal of George Washington and Thomas Jefferson statues in the name of political correctness! Friend, I know you agree we can't allow the radical left to win in Georgia and force their liberal agenda down our throats.\"", "For us fact-checkers, the key question is whether there is a cry to get rid of statues of Washington and Jefferson.", "We found that a few people have said that, but whether there’s much of a drive is less certain.", "Between emailing the Kemp campaign and our own searches, we came up with some key instances.", "The clearest example came from Angela Rye, a CNN commentator and former Congressional Black Caucus director.", "\"George Washington was a slave owner,\" Rye said on CNN on Aug. 17. \"We need to call slave owners out for what they are. Whether we think they were protecting American freedom or not. He wasn’t protecting my freedom. I wasn’t someone — my ancestors weren’t deemed human beings to him. To me, I don’t care if it’s a George Washington statue or a Thomas Jefferson statue or a Robert E. Lee statue, they all need to come down.\"", "An equally clear call for taking down a statue of Washington came from James Dukes, pastor of Liberation Christian Center in Chicago.", "After President Donald Trump asked rhetorically if statues of Washington and Jefferson were next on the list for removal after Confederate leaders, Dukes took up the idea. He asked Mayor Rahm Emanuel to take down an equestrian statue of George Washington in the city’s South Side and rename the park where it stands.", "\"It represents on one hand, a hero to some, a forefather, a revolutionary,\" Dukes said Aug. 16. \"But then for us of African-American descent, it represents a person who owned 317 slaves.\"", "The prominent civil rights activist Al Sharpton also entered the fray, but the circumstances left it unclear whether this is something he might pursue further.", "Sharpton appeared on PBS’ Charlie Rose to talk about the violence in Charlottesville, Va. Rose asked Sharpton if the Jefferson Memorial should be taken down.", "\"My great-grandfather was a slave owned by the family that Strom Thurmond was one of them,\" Sharpton said Aug. 14. \"So this is personal. This is not some kind of removed discussion for us. Our families were victims of this. Certainly, it ought to be removed.\"", "But Sharpton then continued, saying he didn’t want his tax dollars going to maintain a building that honors a man with \"that kind of background.\" He said there are private museums for that. That left open the option to keep the memorial in place and fund it privately. As far as we can tell, Sharpton has not brought up the issue again.", "There are instances where people expressed dismay at the slave-owning pasts of Washington and Jefferson, but they didn’t call for removing statues. We mention them because some have put them in the same bucket as the previous examples.", "Wilbert Cooper, a senior editor at the news service Vice, wrote Aug. 17 that if there were ever a serious push to to blow up Mount Rushmore, \"I suspect I'd be onboard.\"", "\"As long as we allow those men to be cults of personality who exist beyond reproach, we're never going to be able to see them for all of their good and all of their evil,\" Cooper wrote.", "A number of University of Virginia student organizations issued a list of demands to keep the history of slavery front and center on campus. The list included that \"the statue of Jefferson serves as an emblem of white supremacy and should be re-contextualized with a plaque to include that history.\"", "At some point over the weekend of Aug. 19, the Jefferson statue on the University of Virginia campus was splashed with red paint.", "We have two clear cases of African-Americans saying statues of Washington should come down, and one case involving the Jefferson Memorial.", "For context, we compared this to the interest in removing Confederate statues. As an approximate measure, we turned to the Nexis database of articles in major newspapers.", "Between Aug. 11 and Aug. 22 (the day before Kemp’s email), there were 2,113 articles that mentioned removing Confederate statues, but made no mention of George Washington or Thomas Jefferson.", "In the same period, 183 articles mentioned removing Washington or Jefferson statues. This included Trump’s own reference to people seeking to take down those statues.", "Roughly speaking, the removal of Confederate statues is at least 11 times more commonly mentioned than taking down statues of Washington or Jefferson.", "Kemp said there are calls for the removal of statues of Washington and Jefferson.", "We found two instances where two people unambiguously called for those statues to come down, plus another instance where an interviewer’s question elicited a mixed reply that included the words \"certainly it ought to be removed.\"", "Beyond those examples, there is scant evidence of a broader movement to take down statues of Washington and Jefferson, especially not along the lines of the push against Confederate monuments.", "The statement is partially accurate but leaves out important details. We rate this claim Half True.", "Brian Kemp for Governor, campaign email, Aug. 23, 2017", "Fox News Insider, CNN's Angela Rye Calls for Washington, Jefferson Monuments to Come Down, Aug. 17, 2017", "Mediaite, CNN’s Angela Rye: Statues of Washington, Jefferson and Lee ‘All Need to Come Down’, Aug. 17, 2017", "Daily Wire, Al Sharpton Threatens Jefferson Memorial: An 'Insult To My Family', Aug. 17, 2017", "Federalist, Here’s A List Of All The Monuments Liberals Want To Tear Down So Far, Aug. 17, 2017", "Vice, Let's Get Rid of Mount Rushmore, Aug. 17, 2017", "CBS Chicago, Pastor Wants Presidents’ Names Removed From Washington, Jackson Parks Over Ties To Slavery, Aug. 16, 2017", "Charlie Rose, A conversation about race and violence in Charlottesville with Reverend Al Sharpton and historian Jon Meacham, Aug. 14, 2017", "Campus Reform, UVA students: Jefferson statue 'an emblem of white supremacy', Aug. 23, 2017", "Washington Times, Chicago pastor urges mayor to remove George Washington statue, rename park over slavery, Aug. 16, 2017", "Boston Globe, If Lee goes, will Washington and Jefferson follow?, Aug. 21, 2017", "Email interview, Ryan Mahoney, spokesman, Brian Kemp for Governor, Aug. 25, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]