["“Watch a Dominion Representative at Gwinnett County Election Central, responsible for tabulating ballots and certifying results, download data to a USB from the Election Management Server, plug it into a laptop, manipulate the data, then palm the USB,” reads the December 1 tweet sharing the video from an account with more than 330,000 followers.", "“He downloads data from the Election Management Server onto a USB, inserts it into the external laptop, manipulates ballot scans in the file explorer, ejects the usb, palms it, distracts the people nearby, then suspiciously walks out of the room,” the Twitter thread continued.", "The Gateway Pundit, a website that describes itself as politically conservative and has been fact-checked by AFP for false claims about the election, amplified the claim in an article shared more than 1,000 times on Facebook, according to social media monitoring tool CrowdTangle.", "The claim was also shared on Facebook here.", "Dominion Voting Systems specializes in election technologies, and provides the machines and software that millions of Americans use to vote.", "Gwinnett County communications director Joe Sorenson told AFP by phone that the video shows “a Dominion technician producing a data report on the server and saving the report to a Dominion USB thumb drive and then using a laptop to filter requested information… nothing that was going on there is illegal or improper.”", "The room in the video, called Election Central, is “for public viewing, so it is completely covered in windows,” and people monitoring with cell phones outside could see everything that’s going on.", "Sorenson explained that pulling data in this way is typical and standard. Since “the Dominion servers are not equipped with Excel and counties are not authorized to install any hardware or software on these systems,” to run reports, the counties need to move the data from the servers to analyze.", "“This is our first year of doing elections with the Dominion software, but even with the prior system,” moving data to a computer with a thumb drive was typical, and the only way to create data reports, he said.", "The resulting data report does not contain election result information, but rather the number of ballots batches scanned and the amount of batches flagged for adjudication, Sorenson clarified in an email.", "Since the November 3 election, Dominion has been targeted with fraud allegations, for which no compelling evidence has been provided, and which the company has categorically denied.", "President Donald Trump has repeatedly spread this misinformation, falsely claiming he, rather than Joe Biden, won the election.", "Gabriel Sterling, the Georgia secretary of state’s voting system implementation manager and a Republican, addressed the claim about ballot data mismanagement in Gwinnett County at a December 1 press conference, saying the man in the video was just doing his job.", "“A 20-something tech in Gwinnett County today has death threats and a noose put out saying he should be hung for treason because he was transferring a report on batches from an EMS [election management system] to a county computer so he could read it. It. Has. To. Stop.”", "Sterling, voice emotional, said Trump’s rhetoric was dangerous, stoking potential violence against officials. “Someone’s going to get hurt. Someone’s going to get shot. Someone’s going to get killed. It’s not right.”", "Georgia Secretary of State Brad Raffensperger also urged Trump to tone down his rhetoric.", "“Even after this office request that President Trump try and quell the violent rhetoric being borne out of his continuing claims of winning the states where he obviously lost, he tweeted out: ‘Expose the massive voter fraud in Georgia,’” Raffensperger, a Republican, said.", "“This is exactly the kind of language that is at the base of a growing threat environment for election workers who are simply doing their jobs,” he said.", "Chris Krebs, former head of the Department of Homeland Security’s Cybersecurity and Infrastructure Security Agency, who was fired by Trump after debunking election misinformation, said unfounded fraud claims are “actively undermining democracy.”", "“How the heck are we gonna recruit election workers and election administration officials going forward if they think they’re gonna get death threats online and in person… It has to stop. We have to let the professionals do their jobs.”", "Trump has repeatedly alleged there was election fraud in Georgia but has presented no evidence to back up his claim, and a recount confirmed that Biden won the southern state by some 10,000 votes.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]