["It wasn’t until a mass shooting left 22 people dead in El Paso in August that former U.S. Rep. Beto O’Rourke said he \"truly understood how critical this moment is and the real consequence and cost of Donald Trump.\"", "When another shooting suspect killed seven people in Odessa, Texas, later that month, Facebook users tried to tie the Democratic presidential candidate to O’Rourke.", "\"BREAKING NEWS,\" reads what looks like a screenshot of a tweet. \"The Odessa Shooter, a Democrat Socialist who had a Beto sticker on his truck. Oh, did I mention that he had (a) criminal record and did not have a legal weapon. Also, he was not a member of the @NRA. Hay @BetoORourke, is it still Trump’s fault?\"", "This post, which was published on Facebook on Sept. 3, was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The tweet is wrong: It’s not true that the Odessa shooting suspect had a sticker on his truck supporting O’Rourke.", "It’s a conspiracy theory, and one that was promoted by Trump campaign surrogate Anthony Shaffer, according to the Washington Post.", "\"Shaffer, who has promoted baseless claims about the 2012 attacks in Benghazi, Libya, and clashed with the U.S. military and intelligence communities over his allegations of an intelligence failure before the attacks of Sept. 11, 2001, took to Twitter after the shooting to assail Democrats for calling for new restrictions for firearms,\" the Post reported. \"In one post, he said the gunman was a supporter of O’Rourke, tagging the Democrat, and retweeting a post from an account with the handle @suemo54 and the name ‘Sue Moore.’\"", "That tweet was similar to the one that appeared on Facebook, and Shaffer stood by his own tweet, saying \"that’s not what I’ve seen from people\" when he was informed that his claim had no basis in fact, according to the story.", "The Twitter account that appears to have \"hatched the conspiracy theory about O’Rourke,\" the Post reported, \"identifies its owner as a 72-year-old retiree living in Mesa, Ariz.\"", "A spokesman for the Texas Department of Public Safety told the newspaper there was no indication the suspected shooter was linked to O’Rourke. A co-founder of a firm called VineSight, which uses artificial intelligence to track misinformation, said the post \"appears to have been amplified mainly by bot accounts,\" the story says.", "O’Rourke’s campaign manager, Jen O’Malley Dillon, tweeted the Washington Post story on Sept. 3 and wrote: \"This weekend, a right wing bot network spread the completely false rumor that the Odessa shooter had a Beto sticker on his car.\"", "And it was a car, not a truck, the suspected shooter was driving when state troopers stopped him before the shooting spree — a gold-colored sedan.", "We rate this Facebook post False.", "Facebook post, Sept. 3, 2019", "The New York Times, El Paso shooting suspect’s manifesto echoes Trump’s language, Aug. 4, 2019", "Politico, Beto O’Rourke says El Paso shooting ‘consequence’ of Trump, Aug. 18, 2019", "Joel Fischer tweet, Sept. 1, 2019", "The Washington Post, After latest shooting, Trump pushes Facebook ads ‘straight from the NRA playbook,’ Sept. 3, 2019", "Jen O’Malley Dillon tweet, Sept. 3, 2019", "The Washington Post, Texas gunman who killed 7 was fired from job on day of rampage, Sept. 2, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]