["About this rating", "Pouring dish soap down drains with heated water can help with minor and common clogs.", "However, some clogs will need the assistance of a licensed plumber. Additionally, pouring water that is too hot down drains can potentially crack toilets and damage plumbing.", "Online advertisements that lead to lengthy slideshow-style stories and endless \"next page\" clicks are perhaps not the most reliable source of information. For example, one advertisement we previously reported on said to \"pour vinegar on bread and leave it in your garage.\" Readers who clicked the advertisement were led to a story with 92 pages. While the ad may have meant to say \"garbage,\" none of the 92 pages contained information about pouring vinegar on bread.", "In December 2020, advertisements about pouring dish soap down drains appeared on a number of news websites. One advertisement we found said that \"pouring dish soap in the toilet is a trick to remember\":", "Another said to \"pour dish soap in your bath tub at night, here's why\":", "One of the advertisements led to a story on the BetterBe.co website. \"Unclog your toilet\" appeared on page 20:", "Clogged toilets are the worst! But with just a little dish soap, you can solve the problem of your backed-up lavatory. Rather than going at your porcelain throne with a plunger, simply pour half a cup of dish soap into the toilet.", "Allow the dish soap to sit in the toilet for roughly 15-20 minutes. Then use a hot bucket of water to flush the refuse down the drain. Thanks to the dish soap, your pipes should be free from all the yucky debris that first caused the clog.", "We were unable to find the same trick for bath tubs on the BetterBe.co website, although another website placed the exact same photo at #20. It said: \"Save your back while you put dish soap and a broom to work cleaning your bathtub. The same soap that cuts grease on your dishes will tackle soap scum and mildew in the bathroom.\"", "It is true that dish soap such as Dawn and other popular brands can help fix common and minor drain clogs. Several recipes to unclog drains also mention vinegar and baking soda, but for the purpose of this fact check rating we'll be concentrating mostly on dish soap.", "The San Francisco Chronicle published a recipe to unclog a toilet using dish soap. It included tips about using water heated up to a low or medium temperature on a stove. The basic idea was to pour half a cup of dish soap into the toilet, and then pour hot water (not boiling) into the toilet 10 minutes later. The Chronicle said to call a plumber if the clog remains after 30 minutes.", "The website named for home improvement extraordinaire Bob Vila also recommended dish soap to unclog drains. BobVila.com published that dish soap acts \"as a lubricant,\" greasing \"the clog in the toilet drain to get everything moving again.\"", "A viral video with millions of views shows the dish soap trick for a toilet, as does a not-so-viral video from the licensed plumbers at 1-Tom-Plumber in Cincinnati, Ohio:", "In the YouTube video description, it said: \"This trick will only work if your kitchen sink is partially clogged. If your kitchen sink is completely clogged, we recommend going to our YouTube channel and watching our video, 'How To Unclog Your Kitchen Sink With Vinegar & Baking Soda.'\"", "One tip we saw mentioned in several guides and videos was to not use boiling water in plumbing. It could crack a toilet or damage piping. The licensed team with Gilmore Heating, Air, and Solar in Sacramento, California, warned: \"Do not pour boiling water down your sink or toilet.\"", "In recent years, DIYers looking to find a green alternative to chemical products have suggested pouring a potful of boiling water into a clogged sink or toilet to clear a clog. While it’s probably okay to dump boiling water in the sink when your pipes are clear, a clog will trap the water in the pipe. This can melt PVC piping and pipe seals, causing serious damage.", "In addition, using boiling water to clear a clogged toilet can melt the wax ring around the toilet, or even crack the porcelain bowl, leading to a pricey trip to your favorite hardware store.", "The also widely suggested solution of pouring baking soda into a drain, followed by vinegar, isn’t nearly as problematic, as vinegar isn’t very acidic. In fact, it may clear very mild clogs. However, this likely won’t accomplish much with more severe clogs, as all the fizzing reaction does is shift around whatever is clogging the pipe.", "Snopes debunks a wide range of content, and online advertisements are no exception. Misleading ads often lead to obscure websites that host lengthy slideshow articles with lots of pages. It's called advertising \"arbitrage.\" The advertiser's goal is to make more money on ads displayed on the slideshow's pages than it cost to show the initial ad that lured them to it. Feel free to submit ads to us, and be sure to include a screenshot of the ad and the link to where the ad leads.", "Jordan Liles is a Senior Reporter who has been with Snopes since 2016.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]