["This Facebook post, published on February 9, 2019, and since shared 29,000 times, claims that workers employed by Banerjee attacked a group of Hindus at a rally for India’s ruling Bharatiya Janata Party (BJP).", "The post's caption says: \"In Kolkata, Mamata Banerjee’s goons attacked Hindu brothers. BJP needs to win in 2019.\"", "Banerjee is a member of the Trinamool Congress (TMC) party, which holds power in West Bengal. General elections are set to take place in India by May 2019.", "GRAPHIC IMAGES", "Show", "Hide", "Other online posts carrying the same three images have made the same claim, for example here on Twitter.", "In fact the pictures were taken at two different protests – one demonstration on November 2, 2018 in the city of Lucknow in Uttar Pradesh state (around 900 km from Kolkata) and another at a school near Kolkata following sexual assault allegations in October 2018.", "The largest image in the misleading Facebook post, of a young man with his face and chest covered in blood, is overlaid with white text.", "The text contains a copyright symbol and the name \"Ashutosh Tripathi\", as shown in the screenshots below:", "GRAPHIC IMAGES", "Show", "Hide", "AFP contacted Ashutosh Tripathi, a photographer who sells pictures to Indian media outlets including Times Now.", "Tripathi said he had taken the photos at the top and bottom-left of the misleading Facebook post.", "He said: \"I shot two of the pictures that are being misused as fake images. These images were from teachers' protests in Lucknow in 2018 and were tweeted by many politicians and journalists as well to condemn the incident. These definitely do not belong to any clashes in Kolkata as claimed by fake posts.\"", "Tripathi posted the original image of the young man here on his own Facebook page on November 2, 2018.", "The photographer's images appeared in local media reports on the Lucknow protests, for example here and here. They were also posted in this November 2, 2018 tweet by Times Now journalist Prashant Kumar, and in this November 3, 2018 tweet by Indian opposition leader Rahul Gandhi.", "In this video report on the Lucknow protests by Indian news channel Mirror Now, dated November 3, 2018, green gates with a distinctive cross structure can be seen.", "These gates are also visible in Tripathi’s picture of the young man, as highlighted in this composite image:", "GRAPHIC IMAGES", "Show", "Hide", "The third picture, in the bottom-right corner of the misleading Facebook post, shows a young girl wearing a white scarf bleeding from her forehead.", "A reverse image search found that the image appeared in this local media report on clashes at a school near Kolkata following sexual assault allegations, dated October 9, 2018", "It was also published in this report by Bengali news site AnandaBazaar.com, dated October 10, 2018, on the same clashes at the school.", "Neither report mentioned Hindus or Mamata Banerjee.", "Part of the AnandaBazaar.com report says: \"In a prominent school in South Kolkata, a teacher was accused of molesting a seven-year-old following which a ruckus ensued.", "\"Students along with their guardians were present in large numbers protesting and demanding the accused be handed over to them. Following this, police officials visited the spot and arrested the accused teacher.\"", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]