["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "For U.S. Sen. Robert Menendez, Latino voters made history this month as the decisive force behind President Barack Obama winning the popular vote over Republican candidate Mitt Romney.\n\nAbout a week after the election, the Democratic senator claimed the race marked the first time when the popular vote was decided by Latino voters. Going forward, Republicans must face the growing electoral power of the Latino community, according to Menendez.\n\n\"For the first time in history, the share of the national popular vote margin is smaller than the Latino vote margin,\" Menendez said at a Nov. 14 event hosted by the liberal Center for American Progress Action Fund.\n\nThe senator is correct that Latino voters in 2012 made the difference in securing Obama’s popular vote victory. But Menendez’s claim about this scenario occurring \"for the first time in history\" needs clarification.\n\nLatino voters also delivered more than enough votes to make Vice President Al Gore the popular vote winner in 2000. But unlike Gore, Obama won both the popular vote and received enough electoral votes to win the election.\n\nThat means this year’s election marks the first time when Latino voters played a decisive role in electing the president, according to the founders of Latino Decisions, a Seattle, Wash.-based polling research firm.\n\nThe firm’s research has been widely cited by numerous media organizations, including the Washington Post and the Wall Street Journal.\n\nThe senator’s claim is based on a recent study by Latino Decisions, in which it analyzed the results of a nationwide poll of Latinos conducted in the days leading up to the election.\n\nBased on that poll, Latino Decisions estimated that Latinos gave Obama a net gain of 5.4 percent of all popular votes. Since Obama won the overall popular vote by about 2.8 percent, Latino voters put Obama over the finish line, according to Gary Segura, a political science professor and co-founder of Latino Decisions.\n\nApplying the same methodology to exit polling data used by the Associated Press and major U.S. newspapers and television networks, PolitiFact New Jersey reached a similar conclusion.\n\nBut a similar scenario occurred in 2000, when Gore won the popular vote by a smaller margin than the net gain he received from Latino voters, according to exit polling data compiled by The New York Times.\n\nYet since Gore didn’t get enough electoral votes to win the presidency, 2012 marks the first year when Latino voters played a decisive role in a presidential election, according to Segura and Matt Barreto, also a political science professor and co-founder of Latino Decisions.\n\nBarreto told us in an e-mail that Menendez’s comments \"are based entirely on our research, and the spirit of the comments were that Latinos ‘made a difference’ in the national election results for the first time ever -- that is accurate since Gore lost the EC (electoral college) vote.\"\n\nKerri Talbot, Menendez’s chief counsel, echoed Barreto’s argument, saying the point of Menendez’s speech was that 2012 \"was the first time Latinos made a difference in the national election.\"\n\n\"I understand your point about the 2000 election popular vote but the Latino vote was not decisive in that election given that Gore lost in the electoral college,\" Talbot said in an e-mail.\n\nOur ruling\n\nAbout a week after Obama won re-election, Menendez claimed: \"For the first time in history, the share of the national popular vote margin is smaller than the Latino vote margin.\"\n\nThe senator’s correct that Latino voters put Obama over the top in winning the popular vote, according to both a Latino Decisions poll and exit polling data. But Menendez should have been clearer about the historic nature of the Latino vote in 2012.\n\nThe 2000 election was the first time when Latino voters delivered more than enough votes for a popular vote victory, but this year’s election marks the first time when Latinos were decisive in electing the overall winner, according to the founders of Latino Decisions.\n\nWe rate the statement Mostly True.", "To comment on this ruling, go to NJ.com.", "Center for American Progress Action Fund, Sen. Robert Menendez and Pollster Matt Barreto on the 2012 Latino Vote and the Future of Immigration Reform, Nov. 14, 2012\n\nLatino Decisions, Obama wins 75% of Latino vote, marks historic Latino influence in presidential election, Nov. 7, 2012\n\nImpreMedia/Latino Decisions, 2012 Latino Election Eve Poll, Nov. 7, 2012\n\nE-mail interview with Tricia Enright, spokeswoman for U.S. Sen. Robert Menendez, Nov. 20-21, 2012\n\nE-mail interview with Matt Barreto, founding principal of Latino Decisions and associate professor of political science at the University of Washington, Nov. 20-21, 2012\n\nE-mail interview with Gary Segura, founding principal of Latino Decisions and political science professor at Stanford University, Nov. 20-21, 2012\n\nThe New York Times, Elections Results 2008: Exit Polls, accessed Nov. 20, 2012\n\nThe New York Times, Election 2012: President Exit Polls, accessed Nov. 20, 2012\n\nEdison Research, Edison Successfully Conducts The 2012 National Election Exit Polls, Nov. 10, 2012\n\nEdison Research, 2008 National Election Data, accessed Nov. 20, 2012\n\nEdison Research, Election 2004 Exit Poll Results, Nov. 3, 2004\n\nPew Hispanic Center, Latino Voters in the 2012 Election, Nov. 7, 2012\n\nPew Hispanic Center, The Hispanic Vote in the 2008 Election, Nov. 5, 2008\n\nThe New York Times, A Record Latino Turnout, Solidly Backing Obama, Nov. 7, 2012\n\nE-mail interview with Kerri Talbot, chief counsel to U.S. Sen. Robert Menendez, Nov. 21, 2012\n\nThe Washington Post, New poll: President Obama, Tim Kaine up big among Virginia Latinos, Oct. 15, 2012\n\nThe Wall Street Journal, Gingrich Takes Risk With Immigration Stance, Nov. 25, 2011", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]