["About this rating", "More than one critic of U.S. President Donald Trump has observed that Trump seemingly “has a tweet for everything.” That is, whatever the situation today might be, one can find an old Trump tweet about it — or something similar — and more often than not, that tweet will be a criticism of how someone else dealt with that situation.", "That phenomenon came into play again in July 2020, when various news outlets reported that a new Trump administration directive might force many foreign students attending American colleges and universities to return to, or remain in, their home countries:", "A directive by the Trump administration that would strip international college students of their U.S. visas if their coursework was entirely online prompted widespread confusion as students scrambled to clarify their statuses and universities reassessed their fall reopening policies amid the coronavirus pandemic.", "The effect may be to dramatically reduce the number of international students enrolling in the fall. Together with delays in processing visas as a result of the pandemic, immigrant advocates say the new rules, which must still be finalized, might discourage many overseas students from attending American universities, where they often pay full tuition.", "Such changes could put foreign students’ visas, known as F-1 visas, at risk under the new rules. International students whose universities are not planning in-person classes — which is currently the case at schools including the University of Southern California and Harvard — would be required to return to their home countries if they are already in the United States. Those overseas would not be granted permission to enter the country to take online coursework here.", "Many commenters on social media were quick to share a tweet purportedly posted by Trump years earlier, in which he declared that \"When foreigners attend our great colleges & want to stay in the U.S., they should not be thrown out of our country\":", "This was a genuine Trump tweet from August 18, 2015, as seen above. On that same date, Trump also seemingly tweeted his support for policies encouraging foreign students to come the U.S. and establish careers here:", "But as The New York Times noted, by July 2020 — with the coronavirus pandemic looming large as the primary political issue during a presidential election year — foreign students appeared to have become a pawn in a re-election campaign:", "The White House measure [to strip international college students of their U.S. visas] was seen as an effort to pressure universities into reopening their gates and abandoning the cautious approaches that many have announced they would adopt to reduce Covid-19 transmission.", "Although higher education officials saw the move by the Trump administration as an attempt to force their hands on reopening, which President Trump has pushed for, the directive also holds appeal to groups that favor reducing legal immigration to the United States.", "Jordan, Miriam.   \"Trump Visa Rules Seen as Way to Pressure Colleges on Reopening.\"\r\n    The New York Times.   7 July 2020.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]