["About this rating", "On 19 March 2016, satire web site Empire News reported that a family had been killed by neglecting to close their car's sunroof before going through a carwash:", "DARWIN, Mississippi – A family of three died yesterday after inadvertently leaving their sunroof open when going through an automated carwash. Mary and Roger Jones, both 32, and their daughter, Julie, 11, were all killed after the car filled with water.", "“It’s a tragic, horrible thing,” said carwash owner Joe Goldsmith. “Thing is, we have signs everywhere reminding people to close their windows. The water comes fast and furious, and it’s dangerous to have windows open. This is the first time in my 40 years as a carwash owner that something like this has happened, though.”", "This story is a fabrication. Empire News is a purveyor of fake and satirical news.  Its \"About/Disclaimer\" page reads:", "Empire News is intended for entertainment purposes only. Our website and social media content uses only fictional names, except in cases of public figure and celebrity parody or satirization. Any other use of real names is accidental and coincidental.", "It would be very difficult to drown in a carwash, even if the sunroof was inadvertently left open.  According to a 2002 report by the International Carwash Association, even the most enthusiastic washer only uses about 110 gallons over the course of several minutes, but the average water consumption is around 43 gallons per vehicle — about as much water as a very small bathtub. That, plus the fact that there is no Darwin in Mississippi (although there is a \"Darling\") makes this story unequivocally false.", "Other stories that have originated from Empire News include Facebook spying on gun owners for Homeland Security; that food stamp recipients would be awarded free cars; and that the food stamp program would be discontinued entirely.", "Brooke Binkowski is a former editor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]