["Photographs of a leopard and a cow are viral on social media. A Twitter user Janmajit Shankar Sinha (@janmajit007) shared the pictures and wrote a heartwarming story.", "The story shared with the images claims that the cow and the leopard cuddle at night. This was recently found out in Assam. The complete story reads, “In Assam a person bought a cow. During night he heard the dogs barking, it happened for successive nights; so he got CCTV installed. He was surprised to see that a leopard visited every night and sat near the cow. On inquiring from the previous owner, he got to know that the mother of this leopard was killed when the cub was only 20 days old. The cow fed him her milk and saved his life. The cub was left off in the jungle as it grew up. But, the fully grown leopard comes every night and still spends time with the cow, whom it considers as his mother.”", "His tweet was quote-tweeted by former J&K Chief Minister Omar Abdullah.", "The post has been shared by several individual users on Facebook.", "If only some Humans could learn from this….", "This took place in Assam. A man bought a cow from the neighboring village…", "Posted by Robindro Sharma on Saturday, 6 June 2020", "The pictures were also shared on the occasion of Mothers’s Day in May. The post below has nearly 9,000 shares.", "MOTHER’S DAY These are pictures of a village in Assam (India). A man bought the cow from a neighboring village and…", "Posted by John Helios on Tuesday, 12 May 2020", "A keyword search on Google led us to an article on the website onforest.com where the same images of a higher resolution are available. The article claims that the strange incident took place in Antoli village in Vadodara district, Gujarat in 2002.", "Journalist Shyam Parekh had covered the incident in 2002 for The Times of India. The story does not match social media claims. Viral messages allege that the cow used to nurse the leopard when it was young, which is why it came to meet her. However, The Times of India quoted Conservator of forests, Vadodara, H S Singh saying, “Sometimes animal behaviour can get modified. In this case, probably because the leopard which has passed the sub-adult stage, lives in a rural area and not strictly a wild environment.” Speaking with Alt News, Shyam Parekh informed that several people had expressed disbelief when they heard the story at the time. “We asked a wildlife photographer to click pictures of the animals to corroborate the story. The incident did happen 18 years ago in Gujarat,” he said.", "An almost two-decade-old incident from Gujarat was revived on social media with a false, elaborate story and the claim that this happened in Assam.", "[Update: Tweets sharing the story in July 2020 were added to the report on July 11, 2020.]", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "Trigger Warning: Sexual Violence A distressing video of a girl forced to take her clothes…", "A clip featuring Pakistan men’s Cricket team captain Babar Azam is viral on social media…", "A 13-second clip featuring Bollywood actor Shah Rukh Khan is being shared on social media…", "Union minister of information and broadcasting Anurag Thakur on September 26 announced Waheeda Rehman as…"]