["The image was posted on Facebook here on June 15, 2020. It has been shared more than 400 times.", "The Facebook post's caption states: “Aboriginal people in Australia did NOT automatically gain citizenship in 1948 - this is what really happened.”", "The post includes a purported copy of a “General Certificate of Exemption” that appears to be issued under the “Aborigines Protection Act 1909-1943, Section 18c”.", "The purported certificate, which was described as “your chance to be free of the Aborigines Protection Act and live like a white man”, includes three special conditions:", "“Speaking in native language - Prohibited\n\tEngaging in Dance, rituals native customs - Prohibited”\n\tAssociating with fellow indigenous people (including family) - Prohibited”", "The image was also shared on Facebook here alongside a similar claim.", "The claim, however, is misleading; the image is not a genuine \"Certificate of Exemption\".", "TV advertisement", "A keyword search on Google found this certificate, which included almost identical wording to the text in the misleading posts. It also appeared to be signed on the same date.", "The logo of Australian public broadcaster SBS can be seen in the bottom left-hand corner of the image.", "“The SBS advertisement for First Australians which depicted a certificate of exemption did not contain an original document,” an SBS spokesperson told AFP in an email dated June 24. “The content in the certificate, including sub-headings, is based on information provided in the documentary series First Australians and provided by the producers of the documentary series.”", "The original advertisement for SBS’s 2008 series First Australians was published in The Sydney Morning Herald’s Good Weekend magazine, according to Australian public broadcaster ABC.", "AFP obtained a copy of the ad from the State Library of New South Wales’s print media archive. The SBS ad, as seen in the screenshot below, was published in the October 25, 2008, issue of Good Weekend.", "Exemption certificate", "Both the image in the misleading posts and the SBS ad referenced section 18c of an Aborigines Protection Act 1909-1943.", "A keyword search found this Aborigines Protection Act 1909 under the New South Wales legislation. It is described as the “first piece of legislation that dealt specifically with Aboriginal people” in the state.", "The act provided legal powers to the Aborigines Protection Board, which was established in the 1880s to manage Aboriginal reserves and the welfare of the Aboriginal people living in New South Wales at the time.", "While the 1909 act did not mention a certificate, its 1943 amendment did.", "Section 18c of the Aborigines Protection (Amendment) Act 1943 created a certificate that would allow an Aboriginal person to apply to the Aborigines Welfare Board to be free from the provisions of the act.", "Below is a screenshot of Aborigines Protection (Amendment) Act 1943’s section 18c with information about the certificate highlighted in yellow by AFP:", "Various versions of the certificate of exemption issued by the New South Wales government under the 1943 act can be viewed here, here and here.", "Neither the 1943 act nor the exemption certificates from New South Wales mentioned any prohibitions on Aboriginal people’s rights to speak their native languages, associate with other Indigenous Australians, and/or engage in their customs, as listed in the misleading posts.", "Government records", "The image in the misleading posts indicated that the “certificate” was issued by Commonwealth of Australia.", "The National Archives of Australia (NAA), a government agency responsible for managing Australian Government records, told AFP in a June 24 email they could not locate any certificates of exemption issued by Australia’s federal government.", "Katherine Ellinghaus, a La Trobe University associate professor of history who conducted research on Australia’s Aboriginal exemption policies, told AFP that while no official certificates were issued like in New South Wales, policies that allowed Aborignial people to be exempted from the corresponding legislation were in place in the Northern Territory, as well as the states of Queensland, South Australia and Western Australia.", "“They more or less ended in 1967 when a referendum shifted the responsibility for Aboriginal affairs from the states/territories to the federal government,” she added.", "According to Ellinghaus, there is no record of exemption policies in the Australian Capital Territory and the states of Victoria and Tasmania, the rest of Australia’s six states and two territories.", "Upon reviewing the “special conditions” noted in the misleading posts, Ellinghaus said: “Nowhere on the certificates, or in the legislation, [does it say] that people should not speak their language, or talk about their Aboriginality or practice their culture or avoid family.”", "Aboriginal experience", "However, while the “special conditions” section on the Certificate of Exemption referenced in the misleading posts are not real, they are an accurate representation of how Australia’s exemption policies damaged indigenous communities, Ellinghaus said.", "“It was the application process and ongoing surveillance that  prohibited people from speaking their language, engaging in cultural activities and associating with non-exempt people,” she said. “There is no doubt that exemption policies caused a traumatic loss of identity, culture and land and had a very real impact on people's lives and families through generations.\"", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]