["About this rating", "The FY 2016 omnibus appropriations bill repealed existing regulations requiring meat to be labeled by country of origin.", "It is not true that all meat is now unlabeled, or that the bill prevents country of origin labeling.", "On 28 December 2015 David \"Avocado\" Wolfe (a social media personality and alternative medicine product promoter) published a Facebook post, the text of which read:", "IT'S OFFICIAL\nCOUNTRY OF ORIGIN LABELING HAS ENDED\nHOUSE: 300-121 (PASSED)\nSENATE: SLIPPED INTO SPENDING BILL\nPRESIDENT: SIGNED INTO LAW\n[Photo of meat]\nNOW YOU WILL NOT KNOW WHICH COUNTRY\nYOUR MEAT COMES FROM\nHAPPY HOLIDAYS AMERICA!", "Both these memes pertained to Country of Origin Labeling (COOL), effective in the United States following the Farm Security and Rural Investment Act of 2002, and contained a mixture of true, false, and misleading information.", "H.R. 2393 was introduced in the U.S. House of Representatives, and a summary of the proposed legislation explained that the bill would repeal some (but not all) country of origin labeling requirements for meat:", "H.R. 2393 would repeal existing requirements for retailers of beef, pork, and chicken to inform customers at the final point of sale of the country of origin of those products. The repeal would not affect existing requirements for country-of-origin labeling for lamb, venison, goat meat, perishable agricultural commodities, peanuts, farm-raised and wild fish, ginseng, pecans, and macadamia nuts.", "The meme maintained that after passing the House the bill moved on to the Senate, where it was \"slipped\" into a spending bill. That assertion was misleading, as agricultural regulations are commonly attached to budget bills. (A Google search reveals myriad examples of this legislative process over the years.)", "The repealed provisions hadn't been in place all that long. While some had roots in the above-linked 2002 Farm Bill, many only dated to 2009:", "On January 15, 2009, the U.S. Department of Agriculture’s Agricultural Marketing Service published a final rule, which became effective on March 16, 2009 (U.S. Department of Agriculture, Agricultural Marketing Service, 2009b). Commodities covered in this MCOOL final rule include muscle cuts of beef, chicken, pork, and several other species and products (Link, 2009). Processed meat products, meat purchased at restaurants, and certain commodity meats (e.g., turkey) are exempt from MCOOL (U.S. Department of Agriculture, Agricultural Marketing Service, 2009a). Examples of the MCOOL labels now appearing on covered meat products include “Product of the U.S.;” “Product of Canada;” and “Product of the U.S., Canada, Mexico.”", "Neither meme explained why COOL provisions were repealed to begin with. A Food Safety News article from 21 December 2015 titled \"USDA Ends COOL Enforcement With President’s Signature on Omnibus Bill\" reported that the bill was intended to address broader trade concerns:", "Congress included COOL repeal in the $1.4 trillion omnibus spending bill after the World Trade Organization (WTO) ruled Canada and Mexico could begin imposing more than $1 billion in tariffs on U.S. products to punish it for the harm the labeling requirements were doing to them.", "On 18 December 2015, the United States Department of Agriculture (USDA) issued a press release titled \"Statement from Agriculture Secretary Tom Vilsack on the Country of Origin Labeling Requirements for Beef and Pork,\" which confirmed the effects of the bill:", "Agriculture Secretary Tom Vilsack today released the following statement regarding the language in the omnibus bill repealing the country of origin labeling requirements for beef and pork products.", "\"The omnibus bill repealed the country of origin labeling (COOL) requirements for muscle cuts of beef and pork, and ground beef and pork. Effective immediately, USDA is not enforcing the COOL requirements for muscle cut and ground beef and pork outlined in the January 2009 and May 2013 final rules.\"", "USDA will be amending the COOL regulations as expeditiously as possible to reflect the repeal of the beef and pork provisions. In addition, all imported and domestic meat will continue to be subject to rigorous inspections by USDA to ensure food safety.", "As Vilsack's statement explained, the previous country of origin labeling regulations were of debatable value to consumers. Regardless of a meat's country of origin, all meat sold inside the United States is subject to the same USDA regulations and standards as before.", "In short, it is true that mandatory COOL labeling was officially repealed in the U.S. in late December 2015, but those revised labeling requirements applied only to some meats and had no effect on the required certifications for meat sold in the U.S. (whatever its source). Attachment of the bill to omnibus spending legislation wasn't sneaky, as USDA provisions are generally passed as part of budget bills for upcoming fiscal years.  Finally, nothing about the COOL repeal prevents manufacturers from labeling meat: those vendors who wish to do so are free to label their meats without penalty.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]