["About this rating", "In April 2018 a screenshot of a post circulated on social media, claiming that Parent's Choice brand diapers (sold at WalMart and secondary retailers) caused chemical burns:", "Overall, the basic claim is not new or unique to Parent's Choice diapers. Early internet warnings made the same false or unproven claims about Huggies and Pampers products. In this case, the original poster's name was cropped out, and the post did not indicate how the chemical burn (purportedly diagnosed by a nameless pediatrician) was connected to the brand of diapers used and not some other irritant, such as laundry detergent or soap:", "This is what happened to Gunner's leg after trying the parents choice pull ups. His pediatrician did confirm that he had a chemical burn. Please don't buy these pull ups!!!", "Every one please share thus post so that parents can be warned", "We were unable to find any type of recall, warning, or other information from the brand or consumer groups indicating that Parent's Choice diapers or pull-ups were associated with chemical burns or a risk of skin reaction.", "Anecdotal reports of diaper-related chemical burns circulate for nearly every brand of diapers and wipes. The original post appears to have already been either removed or restricted, and it did not appear in a Facebook search. Neither was the date of the original post available, only the copy posted by the Facebook page \"Smoove Element\" in February 2016.", "As noted on an earlier page involving similar claims:", "Children can and do develop severe cases of diaper rash and symptoms resembling chemical burns for a variety of reasons independent of what type or brand of diaper they use. To assume that an observed rash or burn in a diaper-wearing toddler must be directly and solely related to the brand of diaper worn without reproducible confirmatory evidence is an example of the post hoc ergo propter hoc logical fallacy.", "As well, to believe that a particular brand of disposable diaper poses a general danger of severely burning children in its ordinary use requires the additional beliefs that major companies who have been in the disposable diaper business for many years have suddenly unleashed new varieties of those products on the market without conducting the minimal testing necessary to uncover such issues, that the source of the reported hazard is obvious despite the fact that in-depth testing by government regulatory issues can’t uncover it, and that this looming danger threatens all children who wear a particular brand of disposable diaper even though only a relative handful of the millions of consumers who use the brand have reported such issues.", "A much more logical belief is that such cases, while real, are coincidental or only indirectly related to the brand of diaper used. Children may receive rashes and burns from other external sources unknown to their parents, such as exposure to caustic substances. Children may experience severe allergic reactions to something they’ve been exposed to (inside or outsider of their diapers). Children may develop cases of diaper rash so severe that they resemble chemical burns just as a matter of course and not because of the brand of diaper they’re wearing. Other contributory factors may also come into play that produce rash or burn-like effects in only a small number of cases, such as unrealized interactions with other household products (e.g., bleaches or cleaning agents), the content of a child’s excretions, children being left with unchanged diapers for far too long, or children experiencing some other type of medical issue that creates or exacerbates symptoms.", "Likewise, confirmation bias is strong in such cases. People report and pay attention to only those cases that fit the suspected pattern, while ignoring cases of parents who report the same symptoms even though their children don’t wear the identified type or brand of diapers, or parents who use the identified type or brand of diaper with no problems.", "We contacted Parent's Choice to ask whether they had any information about reports of chemical burns associated with the products, or if there had been any recalls involving the brand. A spokesperson told us that although the recirculation of the Facebook post led to an increased level of concern and calls, there did not appear to be a rise in reported \"chemical burns\" associated with any Parent's Choice diaper or wipes and no recalls had been issued.", "Boyle, Matthew.   \"Wal-Mart Spent A Year Remaking Diapers.\"\r\n    Bloomberg.   27 September 2017.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]