["Twitter user Gaurav Pradhan, who has often been found sharing misinformation on social media, tweeted on January 10 that The New York Times said that Prime Minister Narendra Modi has caused such damage to Pakistan that it’s akin to the losses suffered in war. His tweet read – “मोदी #पाकिस्तान को इतना नुकसान पहुंचा चुका है जितना एक युद्ध में पहुँचा सकता है – न्यूयॉर्क टाइम्स”", "The identical claim has also been circulated on Facebook. From a page Modi Mania, it received over 700 likes and more than 500 shares. A few other pages and individual users have also shared the claim.", "However, its dispersion was much higher on Twitter, circulated by many followed by railway minister Piyush Goyal’s office (1, 2, 3, 4, 5).", "Alt News found that the claim attributed to The New York Times (NYT) was viral on Twitter since January 9. One Viren Agarwal was the first one to share this information at 9:45 am.", "However, similar claims with altered narratives have been floating on social media since 2015. While one suggests that India will suffer more if it goes to war with Pakistan, the other claim propagates that both the countries will suffer if they go to war. Both the assertions have been attributed to the American newspaper.", "We found that Dainik Bhaskar had carried a report in 2015 claiming that NYT said that India has more to lose if a war erupts with Pakistan.", "Pakistan-based The Express Tribune also carried out a report titled – ‘India has more to lose if another war erupts with Pakistan: NYT editorial‘. This report had hyperlinked the NYT article where the statement was mentioned.", "In a 2015 editorial piece, The New York Times wrote about how violence in Kashmir has failed to curb, posing serious threats to the nuclear-armed adversaries, therefore, there is a need for restraint. The news organisation talked about the deadly attack on an Indian police station in Punjab after PM Modi’s meeting with his Pakistani counterpart former prime minister Nawaz Sharif.", "NYT wrote that “Mr Modi’s wish to strike back is understandable after many years of Indian restraint,” however, India has most to lose if another war erupts. This was because India is “considerably stronger and more successful than Pakistan.”", "Therefore, NYT’s opinion had nothing to do with Prime Minister Modi causing so much damage to Pakistan that it could be compared to a war-like situation. The news organisation merely penned an article on the need for restraint in Kashmir as war would prove more harmful for India because it is a more successful country than its neighbour.", "The New York Times’s globally recognised credibility was appropriated to give a false narrative a sense of truthfulness. The media outlet’s name has been used in the past as well to portray Prime Minister Modi as a strong and fearsome world leader.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]