["Stacey Abrams, the Democratic nominee for Georgia governor, answers questions Friday, Sept. 21, 2018, during an appearance at a conference of the Georgia Economic Developers Association in Savannah, Ga. (AP Photo/Russ Bynum)", "With Democrat Stacey Abrams in a deadlocked race with Republican Brian Kemp for Georgia governor, some of her opponents are casting doubt on her loyalty to the southern state.", "\"Stacey Abrams burning the flag of the state she seeks,\" reads a Oct. 21 post shared on Facebook. \"Do we really want someone who would desecrate the flag of our beloved Georgia in our Governor’s mansion? I don’t think so. This should disqualify her from consideration by anyone who loves Georgia.\"", "This story was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The post shows what appears to be a black-and-white newspaper photo of four people. \"Burning Georgia’s ‘racist past’ is how Lawrence Jeffries (right) described the flag-burning Sunday at the capitol,\" the caption says. \"From left are Ina Solomon, Jeffrey Harris and Stacy Abrams.\"", "The woman identified as Abrams is standing in the background with her arms crossed, though her face is obscured. The post also includes an apparent news article clipping with the headline: \"AUC students burn state flag in protest at Capitol.\" The story describes 10 students from the Atlanta University Center—members of its Students for African American Empowerment student group—who wanted the Confederate symbol removed from the state flag.", "Speakers said that \"the Georgia flag symbolizes a brutal time in the history of African Americans, and they demanded that the Legislature restore the original Georgia flag: the state seal superimposed on a field of blue,\" the story says. \"The current state flag — the Confederate battle flag alongside the state seal — was adopted in 1956 by defiant Georgia lawmakers who were angered by court-ordered integration.\"", "The Atlanta Journal-Constitution has claimed the article and photo as its own; they appeared in the newspaper in June 1992. (Abrams’s name is misspelled in the story.)", "Another story that ran in the paper that month identifies Abrams as one of three students who helped lead the Atlanta University Center’s protests after the Rodney King verdict. She was an 18-year-old freshman who was working on a congressional campaign, according to the article. The story also quotes Abrams and her father, a United Methodist minister named Robert Abrams.", "\"‘Stacey is not going to stop what she’s doing because of other people,’ Mr. Abrams said, just days after his daughter received abusive phone calls because she helped lead the rally where Georgia’s flag was burned.\"", "\"It’s been unsettling,\" Stacey Abrams is quoted as saying. \"I got a call from one woman who said her family died in the Civil War, and the flag was a symbol of Southern heritage. She said if black people didn’t like the flag, get the hell out. It’s really strange to have someone call your house, ask for you by name, and call you a nigger. I’m used to stuff like that. When I was in the 10th grade, I had a police escort because my dad spoke out against the KKK. But I have to tell my parents what we’re [SAAE] going to do beforehand. I told them we were going to a demonstration, and we were going to have a rally. I kind of left out the flag burning part.\"", "In a statement sent to PolitiFact from Abigail Collazo, director of strategic communications for Abrams’s campaign, the spokesperson describes Georgia at a crossroads during the candidate’s college years. The state was \"struggling with how to overcome racially divisive issues, including symbols of the Confederacy, the sharpest of which was inclusion of the confederate symbol in the Georgia state flag,\" the statement says. \"Stacey was involved with a permitted, peaceful protest against the Confederate emblem in the flag. This conversation was sweeping across Georgia as numerous organizations, prominent leaders, and students engaged in the ultimately successful effort to change the flag.\"", "While it’s true that Abrams was at a protest where Georgia’s state flag was burned, context matters. It wasn’t the flag that the state flies today, because the Confederate symbol that Abrams was protesting has been removed.", "We rate this statement Half True.", "Facebook post, Oct. 21, 2018", "The New York Times, \"Stacey Abrams’s burning of Georgia flag with Confederate symbol surfaces on eve of debate,\" Oct. 22, 2018", "The Atlanta Journal-Constitution, \"Never again the same AUC protesters find lives taking new direction since King verdict,\" June 27, 1992", "The Atlanta Journal-Constitution, \"Abrams defends flag-burning protest of Confederate symbol in 1992,\" Oct. 23, 2018", "Email correspondence with the Abrams campaign, Oct. 25, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]