["About this rating", "In May 2019, a set of images supposedly showing the Palestine \"National Cultural Center\" before and after it was destroyed by Israel Defense Forces (IDF) went viral on social media, along with the claim that the IDF had also destroyed the National Palestine Library and the Azhar Library:", "Many social media users presented these images as if they were recent, even comparing them to the fire that had broken out at Notre Dame Cathedral a few weeks prior:", "The photographs used in this meme were real, but they were not taken recently, and the accompanying information was inaccurate or misleading.", "These photographs show the Said al-Mishal Centre (not the \"National Cultural Center\") in Gaza that was destroyed during an air strike on 9 August 2018 at the end of a \"round of escalation\" between the militant group Hamas and the IDF. Here's how the Meir Amit Intelligence and Terrorism Information Center summed up the events that eventually led to the Centre's destruction:", "On August 8 and 9, 2018, there was a fifth round of escalation between Hamas and the IDF. Hamas and the other terrorist organizations fired about 180 rockets and mortar shells at Israeli territory. The IDF responded with extensive attacks on Hamas’ infrastructure and assets. During and between the rounds of escalation (end of May to August 9, 2018), more than 610 rockets and mortar shells were fired from the Gaza Strip at Israeli territory. At the same time, contacts have been held to reach an agreement between the sides, mediated by Egypt and the UN envoy to the Middle East, so far without result.", "The Israeli military maintained that the Said al-Mishal Centre was targeted because it was being \"used by the Hamas terror organisation’s interior security forces for military purposes.\" But Sameer al-Mishal, director general of the Centre, disputed this assertion, and the Palestinian Performing Arts Network released a statement claiming that the IDF was attacking the culture of Palestine: “The centre was a symbol of Palestinian cultural heritage and was purposefully targeted by the Israeli occupation because art and culture reinforce and strengthen Palestinian national and cultural identity.\"", "While we were able to find a number of reports concerning the destruction of the Said al-Mishal Centre in August 2018, as well as several images showing the aftermath of that attack (including the image featured on the right-hand side of this meme), our search for news reports about the destruction of the Palestine National Library were less successful.", "The claim that Israel destroyed the \"Palestine National Library\" likely refers to a July 2018 bombing at a Hamas training facility in Gaza. YnetNews reported that the five-story, unfinished building, which sat on a network of tunnels, had originally been planned as a national library:", "The Hamas training facility in Gaza that the IAF attacked on Saturday was meant to be the \"Palestinian national library,\" the IDF said.", "The facility, located next to the Sheikh Zayed mosque, is an unfinished and abandoned five-story building in the al-Shati refugee camp, which was meant to be used for public or government services for the Palestinians, or at the very least for housing.", "Instead, the IDF said it has been used for years as an urban warfare training facility for Hamas, and in recent months Hamas has also been using it to drill survival in the tunnels.", "A tunnel was dug under the building, which connects to Hamas's massive underground tunnel network in the strip.", "While this building may have been intended at one time to house a \"Palestinian National Library,\" the edifice apparently never operated in this function.", "Again, it's unclear exactly what facility this meme is referring to as the \"Azhar\" library. Our best guess is that it is referencing the Al-Azhar University - Gaza (AUG). Library of Faculty of Agriculture:", "While that library is still standing as of this writing, one of its branches was severely damaged by \"Israeli aggression on the Gaza Strip in 2009\":", "Library of Faculty of Agriculture:", "It contains a huge collection of materials in Agricultural and Animal Sciences essential for students in the Faculty of Agriculture. Al Azhar University - Gaza (AUG) has the only faculty specialized in Agriculture in the Gaza Strip.", "However, the library was severely damaged during the Israeli aggression on the Gaza Strip in 2009. The total destruction of the library forced the university administration to join what was left from it in the central library in a hall named Faculty of Agriculture hall.", "We were unable to find many additional details about this attack. A contemporary article from the New Humanitarian didn't mention the library specifically, but it did report that Al-Azhar University - Gaza was damaged during an attack in 2009, and that thousands of students were unable to return to school due to \"issues related to war\":", "Al-Azhar, Gaza’s second largest university, generally seen as pro-Fatah (the political faction associated with Mahmoud Abbas in the West Bank) was hit on the same day.", "“Three thousand of the 20,000 registered students could not return this semester due to issues related to the war,” said public relations officer at Al-Azhar University Sameh Hassanin, who also said there had been a 20 percent increase in the number of students unable to afford fees since the offensive ended.", "There is also a library at Al-Azhar University in Cairo, Egypt, but we found no reports concerning the destruction of that library.", "Zitun, Yoav.   \"The 'National Library' That Turned Into a Training Facility.\"\r\n    YnetNews.   15 July 2018.", "Kennedy, Rachel.   \"Israeli Airstrikes Flatten Cultural Centre in Gaza Strip as Hamas Seeks Truce.\"\r\n    EuroNews.   10 August 2018.", "The Meir Amit Intelligence and Terrorism Information Center.   \"The Fifth Round of Escalation Between Israel and Hamas, August 8-9, 2018.\"\r\n    9 August 2018.", "Balousha, Hazem; Holmes, Oliver.   \"'Our Memories Have Vanished:' The Palestinian Theatre Destroyed in a Bomb Strike.\"\r\n    The Guardian.   22 August 2018.", "Update [3 June 2019]: Added information concerning a branch of the Al-Azhar University - Gaza (AUG) that was severely damaged in 2009.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]