["With attacks on Syria being debated in Washington, public opinion stands clearly opposed to a military strike. A new CNN/ORC poll shows about 60 percent of Americans think Congress should refuse to authorize the use of force. Even as an offer of Syrian chemical weapons destruction takes shape, the White House is lobbying hard to sway undecided lawmakers, hoping that classified briefings will nudge them into going against the views of their constituents.", "Political strategist Karl Rove gave the administration a bit of ammunition as it tries to win support for a resolution. The public’s views are flexible, he said.", "\"Before President Obama acted in Libya in 2011, the American people were opposed to military action by 35 to 60,\" Rove said on Fox News Sunday. \"After he took action, they were in support of it 54 to 43.\"", "Rove’s point? \"The American people do have an animus against any kind of action, but if you take action, and you’re successful, they applaud it,\" he said.", "We went back to the record to check whether at the end of the day, public opinion can change direction so completely and so quickly.", "Rove’s office told us that if anything, Rove’s claim understated the swing in public opinion back in 2011. Three days before Tomahawk missiles struck Libyan air defenses, a Fox News poll showed just 25 percent of the people in favor when asked \"Do you favor or oppose the U.S. military getting involved with the situation in Libya?\" Those against stood at 65 percent.", "That was in mid-March 2011. By the end of August, a CNN/ORC poll showed 54 percent said they favored the U.S. military action in Libya, while 43 percent were against it.", "The timeline", "It helps to get a sense of what was going on in Libya when these polls were taken. As this timeline  shows, the international community quickly rallied to the cause of the protesters who sought to overthrow Libyan leader Moammar Gadhafi, but the conflict lasted through most of the year.", "February 2011 -- Popular protests begin, prompting a violent government crackdown. By the end of the month, the UN Security Council had issued a statement condemning the Libyan regime, imposed sanctions and referred Gadhafi to the International Criminal Court for crimes against humanity.", "March 17, 2011 -- The UN Security Council approves a no-fly zone and the use of all necessary measures to protect civilians.", "March 19, 2011 -- British, French and American forces move to enforce the no-fly zone, starting with missile attacks to destroy Libyan air defenses.", "March 24, 2011 -- NATO takes command of the mission to enforce the no-fly zone.", "April - August 2011 -- Air strikes continue. Special forces from Britain, France, Jordan and Qatar aid the rebels on the ground.", "August 20, 2011 -- Rebel and Gadhafi loyalists battle in Tripoli.", "October 20, 2011 -- Rebels capture and kill Gadhafi.", "Opinions shift, questions matter", "The earliest poll we found came from the Pew Research Center. Taken around March 13, it showed a clear distaste for the military options. A slight majority favored economic and diplomatic sanctions, but nearly 70 percent opposed arming the rebels, 77 percent opposed bombing Libyan air defenses, and 82 percent opposed sending ground troops.", "This was very much in line with the Fox News poll.", "As soon as the missiles were launched, public opinion changed. On March 20,  pollsters from CBS News posed this question: \"As you may know, the U.S. military and other countries have begun cruise missile and air strikes in Libya in order to protect civilians from attacks by Gadhafi's forces. Do you approve or disapprove of the U.S. and other countries taking this military action in Libya?\"", "Nearly 70 percent of respondents said they approved.", "But slightly different questions revealed a more closely divided public. Polls at the end of March from Pew Research Center and NBC News/Wall Street Journal asked simply if people thought military engagement was the right or wrong decision.", "The question did not mention protecting civilians, and support dropped. Both polls found that half the people thought it was the right choice. About 40 percent thought it was the wrong decision and about 10 percent didn’t know.", "At the very end, in early November 2011, after Gadhafi was dead and a transitional government took over, CBS News asked if the United States had done the right thing by getting involved militarily. Only 37 percent thought the country had done the right thing. Nearly half said America never should have gotten involved. This was well before the attacks on the American diplomatic post in Benghazi, which happened nearly a year later, in 2012.", "Our ruling", "Rove said there was a major swing in public opinion from before military action in Libya began to after. In varying degrees, we found polling results that support that conclusion.  In general, once the missiles fly, the public tends to take a more favorable view of military engagement.", "However, some polls found only a modest shift, and much depended on how the question was asked. Overall, the public remained closely divided on the American role in Libya.", "We rate the claim Mostly True.", "Fox News, Fox News Sunday, Sept. 8, 2013", "Email interview with Kristin Davison, spokesperson, Karl Rove, Sept. 9, 2013", "CNN, CNN poll: Public against Syria strike resolution, Sept. 9, 2013", "BBC, Libya timeline", "CNN, A timeline of the conflict in Libya, Aug. 24, 2011", "Gallup, Americans approve of military action against Libya, 47% to 37%, March 22, 2011", "Gallup, Americans resist a major U.S. role in Libya, March 29, 2013", "Pollingreport.com, Libya", "Gallup, U.S. Support for action in Syria is low vs. past conflicts, Sept. 6, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]