["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Missouri Republican Sen. Roy Blunt has been on a mission to expand access to mental health and behavioral health patients. He believes it should be treated the same way as physical health.", "Blunt spoke recently in Springfield about the importance of the Excellence in Mental Health Act, which he first introduced in 2014.", "\"After visiting community health centers and certified community behavioral health clinics across Missouri, I’m proud to see firsthand how our state is leading the country when it comes to improving services for mental and behavioral health. Innovation is happening right here,\" Blunt said Oct. 13.", "Access is improving, but has Missouri become the leader in championing this cause?", "Steps taken", "We reached out to Blunt’s office, which referred us to a press release from Missouri Coalition for Community Behavioral Healthcare.", "Download PDF", "Missouri was one of the eight states initially selected to participate in the pilot program of the Excellence in Mental Health Act. This is a demonstration program that would implement a Medicaid prospective payment system for community behavioral health services.", "Being one of the few selected for this pilot program already puts Missouri ahead in the nationwide effort to improve mental and behavioral health services.", "Debra Walker, director of the Office of Public and Legislative Affairs for the Missouri Department of Mental Health, agrees with Blunt. She believes Missouri has become a national leader in the expansion of mental and behavioral health services, pointing to many of the new initiatives taking place in the state.", "Others shared this view.", "\"Sen. Blunt has truly been an asset in representing the state of Missouri in areas relating to mental health services and has historically been a strong advocate for our most vulnerable population,\" said Denise Mills, vice president of corporate relations for Burrell Behavioral Health.", "Brent McGinty, president of the Missouri Coalition, agrees, stating that Missouri is paving the way in \"whole-person\" health.", "\"Our health care home program is leading the nation in results around cost reduction and physical health improvement among the 25,000 Missourians we serve,\" McGinty said.", "As a representative of all of the Missouri Certified Community Behavioral Health Centers, McGinty said Missouri is currently working with law enforcement and developing a statewide system to better address behavioral health crises.", "\"It’s hard to really say which state, if any, is leading the country for providing services for mental and behavioral health,\" said Ronald Honberg, senior policy advisor for the National Alliance on Mental Illness. Honberg points out that there is no system in place for measuring this.", "\"It’s fair to say that Missouri has been innovative,\" said Honberg, pointing to Senator Blunt and Joe Parks as champions in the cause in improving coordination between mental and behavioral health. Parks is the Medicaid director for the Missouri Department of Social Services and a member of the National Council for Behavioral Health.", "Some of the innovative work Missouri has been doing is with Emergency Departments and Mental Health First Aid, which are considered cutting edge across the country.", "Future of mental and behavioral health", "Currently there are no statistics to show where Missouri stands in improving services for mental and behavioral health as part of the Certified Community Behavioral Health Clinic demonstration, but measures are to be reported to the federal government according to McGinty, president of the Missouri Coalition.", "\"Under the Certified Community Behavioral Health Clinic demonstration, sponsored by Senator Blunt, we will finally start reporting to the federal government real behavioral health measures,\" McGinty said.", "Recently, Sens. Blunt and Debbie Stabenow, D-Michigan, along with Reps. Leonard Lance, R-New Jersey, and Doris Matsui, D-California, announced this would be expanded to 11 more states. With the inclusion of more states it will more likely create distinctions in who is and is not leading the nation in regard to improving services for mental and behavioral health.", "As of now, Missouri is implementing new measures to address whole-person care. Some of these initiatives include a partnership for Hope Waiver for Developmental Disabilities and the construction of a new, state-of-the-art, high security facility at Fulton State Hospital.", "\"The state that actually is moving ahead fastest, gets the most done, where access and quality are both being addressed, the state that not only comes to my mind but everyone in the field’s mind, is Missouri,\" said Linda Rosenberg, CEO of the National Council for Behavioral Health in a 2016 press release.", "Our ruling", "Blunt said Missouri \"is leading the country when it comes to improving services for mental and behavioral health.\"", "Under the demonstration program sponsored by Blunt, Missouri will start reporting real behavioral health measures to the federal government. The reports will include information regarding time between request for treatment and treatment, hospital follow-up and medication adherence.", "Experts agree that Missouri has started several new initiatives to improve and innovate when it comes to services for mental and behavioral health.", "We rate this claim Mostly True.", "Email Interview, Katie Boyd, Communications Director for Senator Roy Blunt, October 30,2017", "Email Interview, Brent McGinty, President of the Missouri Coalition, November 1, 2017", "Email Interview, Denise Mills, Vice President of Corporate Relations, November 1, 2017", "Email Interview, Debra Walker, Director for the Office of Public and Legislative Affair for the Missouri Department of Mental Health, October 26, 2017", "https://www.mentalhealthfirstaid.org/", "Facebook post, https://www.facebook.com/SenatorBlunt/, October 13, 2017", "https://dmh.mo.gov/mentalillness/mohealthhomes.html", "https://dmh.mo.gov/CertifiedCommunityBehavioralHealthClinics.htm", "https://dmh.mo.gov/dd/progs/waiver/partnership.html", "https://fultonrebuild.mo.gov/", "https://www.missouricit.org/", "https://dmh.mo.gov/mentalillness/progs/liaisons.html", "https://dmh.mo.gov/mentalillness/provider/EmergencyRoomEnhancement.htm", "http://mhfamissouri.org/", "http://fox2now.com/2017/10/10/blunt-wants-to-expand-access-to-mental-health-care/?platform=hootsuite", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]