["About this rating", "On 1 April 2014, the  Boston Beer Company's Samuel Adams brand released a video reporting that they had created HeliYum, a beer infused with helium:", "While devoting ourselves to the 'Noble' pursuit of perfecting the flavor of Noble Hops we've been exploring Noble Gasses as well.", "Lightened from heavier gases like CO2, HeliYum takes advantages of the properties of helium — one of the noble gases — for a truly remarkable brew. Helium's unique index of refraction creates brilliant clarity while providing an incredibly light mouth feel. Since Helium is an odorless gas, it doesn't compete with the natural aromas of the ingredients. From a freshness perspective, helium doesn't oxidize which allows for a much longer shelf life.", "In concept this announcement mimicked a 1994 humor piece about a brand of Japanese beer supposedly infused with hydrogen, and Samuel Adams eventually revealed that their \"Helium Beer\" didn't in fact exist and the video was just an April Fool's Day joke.  However beer testers Alex and Ralf from the Die BierProbierer podcast revived the joke the following year by claiming that they had gotten their hands on a bottle of the fictional beer:", "We test: HeliYUM of the Samuel Adams Brewery in Boston", "Last year the Samuel Adams brewery in Boston published as April Fool's a video about an alleged helium beer, which leads as a \"side effect\" for a typical helium voice when one drinks it.", "We had the good fortune to come to a bottle of this limited special edition.", "While Alex & Ralf noted that their video was also an April Fool's Day joke (notice the date), subsequent postings of the video did not include the humorous disclaimer, leading many viewers puzzled over whether the pair was discussing a genuine beer product.", "Samuel Adams and Alex & Ralf weren't the only ones to create videos showing the effects of helium beer. Both the Berkshire Brewing Company and the Stone Brewing Company also produced their own versions of helium beer promotions (which were similarly released in conjunction with April Fool's Day).", "For those who are nonetheless eagerly anticipating the arrival of such a product, the sad fact is that helium is one of the least soluble of gases and will probably never be infused into beer:", "Helium is about 700 times less soluble in water as compared to carbon dioxide. It is one of the least soluble gases in water, and only about 0.0016 g of Helium would get dissolved in a litre of beer while, at the same conditions, 2.5 g of carbon dioxide is usually present in a litre of beer. This dissolved carbon dioxide is what releases slowly and creates the fizz. No slow fizz can be done with helium. Undissolved helium in beer would coalesce into one or two big bubbles and ... ploop, it would go out as soon as the seal was broken.", "Even if Helium was forced into the beer and sealed in a beer can, it would be useless. As soon as the seal would break, all the meaningful amount of helium present inside, undissolved, under pressure, would come out so quickly (due to less viscous beer) that it would bring out a lot of beer with it. It would create a mess. And you wouldn’t be able to even bring the can near your face by the time the whole gas goes away.", "Had carbon dioxide been used for the same purpose, the gas would, like it normally does, come out steadily. It would make the bubbles last.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]