["The video was uploaded here on Twitter on March 20, 2021. It has been viewed more than 21,000 times.", "The footage appears to show a crowd looking up at a TV screen, where US President Joe Biden is seen walking up the steps to board Air Force One. He trips and stumbles, apparently whipping the crowd into a frenzied celebration.", "The words “Fox News HQ” and “Hannity” can be seen superimposed onto the crowd.", "The tweet is captioned in Chinese: “US people welcomed JB's fall”, alongside a laughing emoji.", "Joe Biden lost his footing and tripped several times on March 19, 2021, while walking up the steps to Air Force One outside Washington.", "The video appearing to show a crowd cheering Biden’s fall was also shared here and here on Twitter.", "Some users appeared to be misled by the video.", "“This is absolutely uncivilized manner.  Anyone who is pleased to see a person stumbling will stumble in the worst way. Get civilized, folks!” one comment read.", "“The US people really disrespect their great president! What is freedom? This is freedom. I don't like you, and I can express it freely! I’m jealous!” another wrote in Chinese.", "However, the footage is not genuine; it has been doctored from a meme.", "Google reverse image searches using key frames extracted from the video found this similar footage published on June 17, 2016, by the YouTube channel of UK radio station Heart West Country.", "The footage is headlined: “Fans at Ashton Gate Stadium, Bristol, celebrate England winner against Wales at Euro 2016”. According to the description, the video shows football fans watching England striker Daniel Sturridge’s goal, securing England’s win against Wales.", "Below is a screenshot comparison of the misleading Twitter video (L) and the 2016 video by Heart West Country (R):", "Pub crowd reaction meme", "Reverse image searches reveal the footage has been widely circulating online over the past years in a meme, where the TV screen showing the football match is replaced with various other scenarios, such as here, here and here.", "A same scene captured from Ashton Gate Stadium has been uploaded on Google Maps here.", "AFP has also debunked another video doctored from the same 2016 footage here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]