["By Angelo Fichera", "Posted on April 17, 2019", "A website cites an erroneous tweet, innuendo and unrelated events to falsely suggest there were “Muslim ties” to the Notre Dame fire.", "The devastating fire that ravaged the famed Notre Dame Cathedral in Paris on April 15 prompted unsubstantiated rumors online about who or what was to blame.", "By Tuesday, for example, the website of former Fox News commentator Kevin Jackson had zeroed in on a whole group of people, running a headline that reads: “Muslim Ties to Notre Dame Fire.”", "We could find no credible sources to support the incendiary suggestion that Muslims were responsible.", "The French government said in a press release Tuesday the cause of the fire remained unknown, and Paris public prosecutor Remy Heitz told reporters that investigators were currently eyeing it as an accident.", "The article on Jackson’s site, however, advances the unsupported idea of a “Muslim attack” through paragraphs of innuendo, not fact.", "“Was this a true accident? Or is someone trying to send Christians a message?” the article on theblacksphere.net reads. “Many people speculate this is a Muslim attack on Christianity. In 2016, a car parked outside Notre Dame was discovered. It contained full gas tanks and documents written in Arabic. Therefore, authorities were well-aware of the threats posed against Notre Dame.”", "But there is no evidence tying that 2016 episode with this week’s fire, as some news outlets worked to make clear. The U.K.’s Telegraph, which covered the 2016 incident at the time, affixed an update to its story indicating: “This story is from 2016 and unrelated to the fire at Notre-Dame on April 15 2019.”", "Theblacksphere.net, which makes a passing reference to the Sept. 11 terrorist attacks in the U.S., further attempts to support its narrative by citing a now-deleted tweet from Christopher Hale, a self-described “Tennessee politico” who unsuccessfully ran for Congress in the Democratic primary last year and who worked on faith outreach for former President Barack Obama.", "“A Jesuit friend in Paris who works in #NotreDame told me cathedral staff said the fire was intentionally set,” the tweet said. In a subsequent tweet — omitted by the story — Hale acknowledged that his friend had “zero evidence” and that it was an “unsubstantiated rumor.”", "In a phone interview with FactCheck.org, Hale called the tweet “hearsay” and “a horrible mistake.” He said he deleted it after about 10 minutes.", "“It became clear it was becoming weaponized by Islamophobic forces,” he said. “The worst parts of the internet were using it for nefarious means.”", "Other websites, including InfoWars, also used the tweet to claim the fire was “deliberately” set. They all referred to Hale as a “TIME columnist,” although Hale told us he writes occasional opinion pieces for the magazine and other outlets.", "And while theblacksphere.net story says that “Hale isn’t the only one to believe this fire has Muslim ties,” Hale pointed out that his tweets never made any mention of any supposed Muslim connection to the fire.", "Hale declined to discuss his friend who provided the initial, unsubstantiated rumor, but he said: “Neither he or I think it was anything but an accident.”", "Theblacksphere.net story also links to a grainy video on Facebook purporting to show “WHAT LOOKS LIKE A MUSLIM ON THE LEDGE,” at the cathedral. But, as the French newspaper Libération‘s fact-checking arm, CheckNews, found, clearer video from CNBC shows that the individual in the video was actually a firefighter.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on the social media network.", "Hale, Christopher. Phone interview with FactCheck.org. 16 Apr 2019.", "“Incendie de Notre-Dame de Paris : un drame terrible pour toute la nation.” Press release, Government of France. 16 Apr 2019.", "Samuel, Henry. “Gas tanks and Arabic documents found in unmarked car by Paris’ Notre-Dame cathedral spark terror fears.” The Telegraph. 8 Sep 2016.", "“Paris prosecutor – accident seen as likely cause of Notre Dame fire.” Reuters. 16 Apr 2019.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]