["About this rating", "On 17 May 2016, the Facebook page \"Star Trek Rocks My World\" (among others) published an image of Star Trek: The Next Generation star Patrick Stewart along with the following quote from him about the 1999 spoof film Galaxy Quest superimposed upon it:", "I had originally not wanted to see [Galaxy Quest] because I heard that it was making fun of Star Trek and then Jonathan Frakes rang me up and said ‘You must not miss this movie! See it on a Saturday night in a full theatre.’ And I did and of course I found it was brilliant. Brilliant.", "No one laughed louder or longer in the cinema than I did, but the idea that the ship was saved and all of our heroes in that movie were saved simply by the fact that there were fans who did understand the scientific principles on which the ship worked was absolutely wonderful. And it was both funny and also touching in that it paid tribute to the dedication of these fans.", "Fandom page members were quite fond of Stewart's sentiment, and the image macro garnered thousands of shares among fans of Star Trek and sci-fi in general. However, some viewers questioned whether the fanservice aspect of the comment was too amusing to be authentic.", "However, an archive of the BBC's web site from 30 October 2002 does indeed attribute these words to an interview with Patrick Stewart:", "Similar remarks made by Stewart about Galaxy Quest are captured in an archived London Times article from November 2007:", "Best of all, [Stewart] loves the movie Galaxy Quest, a sublime Star Trek spoof. “Jonathan told me to see it. I said I didn’t want to see the piss taken out of me by Alan Rickman and the rest. He told me to see it in Santa Monica on a Saturday night. I did, and it was perfect, fantastic, one of my all-time favourites. They got it exactly right — that’s how it was, and the ending was right at the heart of the spirit of Star Trek.”", "So the quotation is a genuine one, albeit one that was also some fourteen years old at the time of its May 2016 circulation.", "Appleyard, Brian.   \"Patrick Stewart: Keep On Trekkin'.\"\r\n    The Sunday Times.   4 November 2007.", "BBC2/BBCOnline.   \"Interviews: Patrick Stewart.\"\r\n    (Undated.)", "The Questarian.   \"Trek Talks: Galaxy Quest.\"\r\n    (Undated.)", "TVTropes.   \"Fanservice.\"\r\n    (Undated.)", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]