["By Rem Rieder", "Posted on April 14, 2020", "The Democratic super PAC Priorities USA Action has been running an ad falsely suggesting President Donald Trump called the coronavirus outbreak a “hoax.”", "At the beginning, the ad splices together two quotes to have Trump saying, “The coronavirus, this is their new hoax.” It is obvious in listening to the ad that he said, “The coronavirus,” and, “this is their new hoax,” at different times. His voice sounds quite different in the two segments.", "But on the screen, “The coronavirus, this is their new hoax” appears as a single sentence.", "Trump did use the word “hoax” but his full comments, and subsequent explanation, make clear he was talking about Democratic attacks on his administration’s handling of the outbreak, not the virus itself.", "On April 13, the Trump campaign sued WJFW-NBC of Rhinelander, Wisconsin, for defamation for running the ad, which has been running in some version in swing states almost continually since March 24, according to Advertising Analytics, at a cost so far of about $2.5 million.", "A 15-second version of the ad also appears online as part of a digital ad campaign.", "After Priorities USA Action launched its $6 million ad campaign on television stations in the swing states of Florida, Michigan, Minnesota, Pennsylvania and Wisconsin in late March, the Trump campaign warned the stations not to run the ads to “avoid costly and time consuming litigation.”", "In addition to the misleading “hoax” segment, the ad features a series of statements in which Trump downplayed the risk of the coronavirus outbreak. These quotes are accurate.", "As we have reported, the “hoax” kerfuffle began at a Trump rally in South Carolina on Feb. 28. At one point Trump said, “And this is their new hoax.” But he did so in the context of assailing Democrats for trying to politicize what the Democrats saw as his administration’s shortcomings in combating the crisis.", "Trump, Feb. 28: Now the Democrats are politicizing the coronavirus, you know that right? Coronavirus, they’re politicizing it. We did one of the great jobs. You say, “How’s President Trump doing?” They go, “Oh, not good, not good.” They have no clue. They don’t have any clue. They can’t even count their votes in Iowa. They can’t even count. No, they can’t. They can’t count their votes.", "One of my people came up to me and said, “Mr. President, they tried to beat you on Russia, Russia, Russia.” That didn’t work out too well. They couldn’t do it. They tried the impeachment hoax. That was on a perfect conversation. They tried anything. They tried it over and over. They’d been doing it since you got in. It’s all turning. They lost. It’s all turning. Think of it. Think of it. And this is their new hoax.", "The president, who often dismissed special counsel Robert Mueller’s Russia investigation and his impeachment as hoaxes, portrayed the Democrats’ criticism of his coronavirus policy as a continuation of a campaign to bring him down. Later in the rally, he referred to the coronavirus criticism as the Democrats’ “single talking point.”", "“A virus starts in China, bleeds its way into various countries all around the world, doesn’t spread widely at all in the United States because of the early actions that myself and my administration took against a lot of other wishes and the Democrats’ single talking point, and you see it, is that it’s Donald Trump’s fault, right? It’s Donald Trump’s fault,” he said. “No, just things that happened.”", "Democratic presidential candidates were quick to pounce on Trump’s “hoax” remark. Former Vice President Joe Biden described the president’s comments as “absolutely bizarre.”", "The following day, at a press conference, Trump reiterated that he used the term “hoax” in connection to the Democrats’ attacks.", "Reporter, Feb. 29: You were down in Charleston last night, using the word “hoax” when talking about Democrats. Somebody now is dead from this. Do you regret that kind of talk?", "Trump: No, no, no. “Hoax” referring to the action that they take to try and pin this on somebody, because we’ve done such a good job. The hoax is on them, not — I’m not talking about what’s happening here; I’m talking what they’re doing. That’s the hoax. That’s just a continuation of the hoax, whether it’s the impeachment hoax or the “Russia, Russia, Russia” hoax. This is what I’m talking about. Certainly not referring to this. How could anybody refer to this? This is very serious stuff.", "But the way they refer to it — because these people have done such an incredible job, and I don’t like it when they are criticizing these people. And that’s the hoax. That’s what I’m talking about.", "The rest of the Priorities USA Action ad consists of statements by Trump dismissing the threat of the novel coronavirus. As we have written, Trump made a series of such statements from Jan. 22 to March 10, and as recently as March 24 likened the disease’s impact to that of the flu or automobile accidents.", "The ad has Trump saying, “We have it totally under control. It’s one person coming in from China.” That’s what Trump told CNBC in an interview from the World Economic Forum in Davos, Switzerland, on Jan. 22.", "The ad continues with Trump saying, “One day — it’s like a miracle — it will disappear.” That’s what Trump told a gathering of African American leaders at a meeting on Feb. 27.", "The next quote is, “When you have 15 people and within a couple of days is going to be down to close to zero.” Trump said this at a press conference on Feb. 26.", "“We really think we’ve done a great job in keeping it down to a minimum.” Trump said that at the same press conference.", "The ad also quotes Trump: “I like this stuff. I really get it. People are surprised that I understand it.” Trump said this, referring to medical issues, during a visit to the Centers for Disease Control and Prevention on March 6.", "And finally, the ad quotes Trump saying, “No, I don’t take responsibility at all.” That’s what the president said at a press conference on March 13 when asked if he took responsibility for the federal government’s lag in testing for the coronavirus.", "So the overwhelming bulk of the ad is on target. But the beginning is deceptive.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]