["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Texas’ attorney general, Greg Abbott, has his facts wrong on the voting process, U.S. Rep. Eddie Bernice Johnson said in an opinion column published Aug. 8, 2013, in the Fort Worth Star-Telegram.", "For example, \"Abbott advocates the use of voter ID laws, allegedly to stop voter fraud,\" the Dallas Democrat wrote. \"Studies have shown that voter fraud is non-existent in Texas.\"", "\"Non-existent\" is pretty strong; we don’t have to look any farther than our own reporting to know that statement isn’t entirely accurate. But how prevalent is voter fraud in Texas?", "Johnson spokesman Cameron Trimble told us by phone and email that the column should have said \"virtually\" non-existent. He sent us web links to research and news stories that described nationwide voter fraud as rare. None of the materials analyzed fraud in Texas specifically, and we found only one mention of a Texas case -- the 2006 conviction of a Pecos woman who filled out and mailed absentee ballots for others.", "Trimble’s sources mostly referred to voter fraud -- deception committed by individual voters, such as voting more than once, impersonating a voter or voting despite ineligibility -- rather than overall election fraud, which encompasses actions by others, such as election officials or campaign workers, who break election laws in ways that could include intimidating voters, publishing misinformation about polling places or possessing ballots not their own.", "We dipped into that distinction in an April 2012 fact-check that rated as Half True a claim from Abbott that he had secured 50 convictions for election fraud. Abbott’s basis was his office’s records on 2002-12 prosecutions for alleged election code violations.", "For this fact-check, we asked Abbott’s office for an updated list. County district attorneys and the Texas secretary of state’s elections division usually refer allegations of election code violations to the attorney general. We also called the secretary’s office and several district attorney offices around the state, but found no specific information about how many violations were reported or prosecuted.", "Abbott spokeswoman Lauren Bean emailed us records showing that from August 2002 through September 2012, the office received 616 allegations of election-code violations and recorded 78 election-code prosecutions.", "By our count, 46 of the prosecutions ended with a conviction, guilty plea, no-contest plea or guilty plea as part of deferred adjudication. Of those, 18 cases appeared to involve fraud committed by individual voters: 12 cases with ineligible voters, five cases of voter impersonation and one case of voting more than once.", "So, by our reading of the attorney general’s records, 18 instances of voter fraud have been confirmed in Texas since 2002.", "In 2012, the News21 investigative project headquartered at Arizona State University’s journalism school compiled a database that showed 104 Texas cases of alleged election fraud among 2,068 nationwide since 2000.", "The News21 students, who published their results online Aug. 12, 2012, gathered allegations through public information requests, news accounts and court records. According to the project’s website, they included all cases \"that had reached some level of official action: That is, someone was charged, an investigation was opened, a specific accusation was made against a named person.\"", "News21 determined that 37 of the 104 Texas allegations were made against voters. Most of the cases were still pending at the time the students published their project in 2012, but 15 had resulted in a guilty plea or conviction, according to the database.", "Our ruling", "Johnson said, \"Studies have shown that voter fraud is non-existent in Texas.\"", "She did not provide, nor did we find, studies showing such fraud to be non-existent. To the contrary, Abbott’s records show 18 convictions, no-contest pleas or guilty pleas on voter fraud charges from 2002 through 2012. That’s not a lot of fraud, by any means, but it still evidently occurred.", "Johnson might have meant to say \"virtually non-existent,\" but the Truth-O-Meter holds individuals accountable for what they actually say. We rate this statement as False.", "------------------------------------------------------------------------------------------", "FALSE – The statement is not accurate.", "Click here for more on the six PolitiFact ratings and how we select facts to check.", "U.S. Rep. Eddie Bernice Johnson, opinion column in the Fort Worth Star-Telegram, Aug. 8, 2013", "Telephone and email interviews, excerpted, with Cameron Trimble, director of media operations for Johnson, Sept. 6-12, 2013", "Texas Attorney General’s Office chart, \"Election code referrals… August 2002-Present,\" Sept. 9, 2013", "Texas Attorney General’s Office chart, \"Election code referrals… Charges pending resolution,\" Aug. 22, 2013", "Texas Attorney General’s Office chart, \"Election code referrals… Prosecutions resolved,\" Aug. 22, 2013", "News21 investigative project, \"Who Can Vote?,\" and database, Aug. 12, 2012", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]