["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Gubernatorial campaign commercials have been digging up each candidate’s past for months, but now Gov. Rick Scott and Charlie Crist are pretty much calling each other criminals.", "The Republican Party of Florida, working on Scott’s behalf, had a Fort Lauderdale investor say in a TV ad that he was \"swindled\" by Crist. The man had invested with Scott Rothstein, who was later convicted of a Ponzi scheme. We rated that Pants on Fire!, because Crist had nothing to do with the plot to defraud investors.", "Now Crist is going after Scott’s past as the CEO of hospital chain Columbia/HCA, which in 1997 was busted by the federal government for bilking Medicare. Crist referred to the Rothstein attack in a Sept. 19, 2014, commercial, saying Scott lied to voters \"4,000 times,\" the number of times the Rothstein ad had aired on Florida TV stations.", "\"We shouldn’t be surprised,\" the narrator said. \"Scott pled the Fifth 75 times to avoid jail for Medicare fraud.\"", "That’s referring to a deposition Scott gave in 2000 for an unrelated civil case. To further muddy the waters, the commercial shows footage from a deposition for yet another unrelated case in 1995.", "This attack should sound familiar, because it came up in the 2010 campaign, when Scott’s Republican primary opponent Bill McCollum said Scott \"barely escaped imprisonment,\" which we rated False. PolitiFact Florida wanted to revisit this angle and see if Scott, who was never charged with wrongdoing in the federal fraud case, gave vague testimony to avoid time in the cooler.", "The Columbia/HCA case", "We’ve been over this many, many times before, so let’s explain the history as quickly as possible.", "Scott began what eventually became Columbia/HCA in 1987, buying and merging hospitals until his publicly traded company became the nation’s largest health care chain. At its peak, the company boasted more than 340 hospitals, 135 surgery centers and 550 home health locations in 37 states and two foreign countries.", "Scott’s reputation as a hard-nosed businessman came from a cutthroat corporate environment, in which the most productive managers were rewarded and the least were fired. Some employees speculated it was that culture that led to unscrupulous behavior, such as padding bills, charging Medicare for procedures that were more lucrative than what was actually performed, and giving doctors kickbacks in exchange for patient referrals.", "Whether Scott knew about such practices is unknown, although he apparently signed off on reports that raised concerns about things happening within the chain. Jerre Frazier, a company attorney told the Miami Herald in 2010 that Scott said the company wasn’t doing anything differently than other chains in the health care industry.", "Whistle-blowers exposed the fraud, helping federal investigators gather enough evidence to raid the company’s offices and hospitals in 1997. Scott was pressured to resign in July of that year, taking a $5.1 million cash severance and an additional  $300 million in stocks and options with him. (Five other top executives also resigned.) Scott has said it was because he wanted to fight the charges while the board wanted to settle, which they did in 2000 and 2002, for a total of $1.7 billion in fines and penalties.", "Scott was never charged with a crime. His boilerplate response to the incident is that he wasn’t even questioned by investigators, although ABC’s World News Tonight reported in 1997 he was \"considered a prime target of the investigation.\"", "That’s not unusual, legal experts told PolitiFact, because replacing a CEO is often a first step a company makes to show the government it means business about cleaning up its wayward methods. Whether that’s exactly what happened in Scott’s case, we can’t say.", "Scott has addressed the case plenty, however. In a 2010 debate he called the deposition a \"fishing expedition\" he refused to participate in. He told the Tampa Bay Times that same year that he was partly culpable.", "\"There's no question that mistakes were made and as CEO, I have to accept responsibility for those mistakes,\" he said. \"I was focused on lowering costs and making the hospitals more efficient. I could have had more internal and external controls. I learned hard lessons, and I've taken that lesson and it's helped me become a better business person and a better leader.\"", "Think about the clink", "The company agreed to plead guilty to at least 14 corporate felonies, which don’t involve jail time but did factor into the fines. Four Florida-based Columbia/HCA executives were indicted. Two were convicted of defrauding Medicare and sentenced to prison, but those verdicts were later overturned. One was acquitted, and a jury couldn’t reach a verdict on the last.", "Does that mean Scott faced jail at all? In pleading the Fifth Amendment, it certainly seems like a possibility, former federal prosecutor Ryan O’Quinn told us. That’s because the only legal reason to use your Fifth Amendment right in court is if you think your answer would incriminate you.", "The deposition in which Scott pleaded the Fifth 75 times was part of a civil case by Nevada Communications Corp., which alleged that Columbia/HCA breached the terms of a communications contract. Scott gave the deposition at his offices in Stamford, Conn., on July 27, 2000, months before the settlement with the federal government.", "Scott lawyer Steven Steinbach explained the strategy thusly: \"Unfortunately because of the pendency of a number of criminal investigations relating to Columbia around the country, he's going to follow my advice, out of prudence, to assert his constitutional privilege against giving testimony against himself.\"", "While pleading the Fifth in a criminal case can’t be used as an admission of guilt, it’s just fine to assume that in a civil case.", "For example, the 11th Circuit Court of Appeals in July 2014 upheld a $67 million judgment against TD Bank for a group of investors bilked by imprisoned attorney Scott Rothstein, who has factored heavily into campaign commercials between Scott and Crist. In that ruling, the judge said jurors could infer former TD Bank South Florida regional VP Frank Spinosa knew about or participated in Rothstein’s scheme when he invoked the Fifth 193 times. Spinosa has not been charged with a crime and was no longer a bank employee, but was likely avoiding self-incrimination, or possibly as a favor to TD Bank, the ruling said.", "Scott wasn’t facing a jury, but we’re trying to establish whether one could infer guilt for invoking the Fifth Amendment. In fact, there’s no other reason to think otherwise, because by the letter of the law, Scott must have thought he would incriminate himself if he answered truthfully.", "\"Given the adverse consequences of an assertion of the Fifth Amendment in a civil deposition, an executive must have a significant concern that their response could contribute to their criminal prosecution,\" O’Quinn said. \"A frivolous assertion of the Fifth Amendment would be an unethical act.\"", "So if Scott was avoiding incriminating himself and other executives were actually convicted and sentenced to prison (albeit later overturned), does that mean Scott faced jail? That’s conjecture, but he certainly could have faced federal charges, which could have resulted in time in prison.", "There is a possibility some in the FBI regretted the decision to not go after Scott. \"After Columbia/HCA, I realized people, individual corporate officers, had to be held accountable for the actions of their companies,'' former Tampa FBI agent Joe Ford said in a book about the Columbia/HCA case. \"Instead of just giving us (the government) money, people need to go to jail. I learn from my mistakes and this was my first big one.''", "Our ruling", "Crist said Scott \"pled the Fifth 75 times to avoid jail for Medicare fraud.\"", "If you haven’t heard by now, Scott did invoke his Fifth Amendment rights 75 times in a deposition to avoid discussing a Medicare fraud case. But Crist’s ad is pushing the envelope to say he did it to avoid jail.", "No one went to prison for the Medicare fraud debacle, nor did Scott actually face the rigors of a grand jury or even federal investigators. The commercial seems to imply Scott was in the thick of the raids, when he was actually sent packing as soon as it became apparent the company faced a major punishment for defrauding the U.S. government.", "It’s impossible to say if Scott would have gone to jail if he had answered those deposition questions, but experts say he was certainly avoiding possible legal trouble by asserting the Fifth Amendment. We rate the statement Half True.", "Correction, Oct. 3, 2014, 2:30 p.m.: This version clarifies the context in which Scott asserted his Fifth Amendment right. The change does not affect the ruling.", "Charlie Crist via YouTube, \"4,000 Lies,\" Sept. 19, 2014", "Los Angeles Times, \"Judge Unseals FBI Papers on Columbia / HCA,\" Oct. 7, 1997", "PolitiFact Florida, \"Rick Scott, former health care CEO, barely escaped prison, GOP opponent claims,\" May 21, 2010", "PolitiFact Florida, \"With Rick Scott leading in polls, opponents pull out 'fraud' line,\" June 10, 2010", "PolitiFact Florida, \"Group's ad attacks Rick Scott over history as Columbia/HCA CEO,\" June 15, 2010", "Tampa Bay Times, \"Columbia/HCA reports warned Rick Scott of potential legal problems,\" Sept. 18, 2010", "PolitiFact Florida, \"Fraud allegations dominate new Democrat ad attacking Rick Scott,\" Oct. 12, 2010", "South Florida Business Journal, \"Former TD Bank VP Spinosa takes Fifth at trial,\" Nov. 10, 2011", "Tampa Bay Times, \"Democrats again target Rick Scott's silence under oath,\" June 9, 2014", "PolitiFact Florida, \"Rick Scott took the 5th Amendment 75 times, Democratic party ad says,\" June 17, 2014", "South Florida Business Journal, \"Court affirms $67M judgment against TD Bank in Rothstein Ponzi scheme,\" July 29, 2014", "Republican Party of Florida via YouTube, \"Swindled,\" Sept. 9, 2014", "Miami Herald, \"Charlie Crist releases ‘4,000 lies’ ad against Rick Scott over Ponzi-scheme spot,\" Sept. 19, 201", "PolitiFact Florida, \"In ad to promote Rick Scott, Rothstein investor says he was 'swindled' by Charlie Crist,\" Sept. 22, 2014", "ABC News, World News Tonight transcript, Aug. 18, 1997, accessed Sept. 23, 2014 via Nexis", "Miami Herald, \"Rick Scott and his role in Columbia/HCA scandal,\" June 27, 2010, accessed Sept. 23, 2014 via Nexis", "Miami Herald, \"Taking the Fifth -- 75 times -- an achievement,\" Sept. 21, 2010, accessed Sept. 23, 2014 via Nexis", "Interview with Dan Gelber, attorney and former Democratic state legislator, Sept. 23-24, 2014", "Interview with Ryan O’Quinn, attorney and former federal prosecutor, Sept. 24, 2014", "Interview with Greg Blair, Rick Scott campaign spokesperson, Sept. 24, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]