["“इस छुट्टियों में कश्मीर मत जाओ कश्मीर के युवक टूरिस्ट गाड़ियों पर पत्थर बरसाते हुए” (This vacation don’t go to Kashmir. Kashmiri youth pelting stones at tourists’ cars – translated). This message is currently circulating on social media along with a video showing rioters attacking cars on a street. It has been claimed that the incident occurred in Kashmir when a group of youth began pelting stones at cars of tourists visiting the valley on vacation.", "The video has been widely shared on Facebook by both individual users and pages. Identical text has been used multiple times by numerous individual users, suggesting that the video may be circulating on WhatsApp too.", "This is the same video which Alt News had earlier debunked in an article published on May 29. We broke up the video into individual frames with InVid software for videos, and reverse searched the image via Google. A video demonstration of the fact-check can be seen below. We found that the incident in question had occurred at Birsstrasse in Basel, Switzerland on May 19, 2018 after supporters of the Basel and Lucerne football clubs came to blows.", "Two of the Facebook pages – Dongi AAP and Jammu Mission – that have circulated the video have a combined membership of nearly 2 lakh people and more than 5,000 individuals have shared the video only from these two pages.", "The video was earlier shared on social media with different claims. One version states that the incident had occurred in Birmingham, U.K when members of the Muslim community resorted to vandalism as they wanted to ‘eat on the roads’, in a reference to the practice of breaking fast during Ramadan.", "Violence in Birmingham during Ramazaan!!! They want to close the road to eat on the roads…. Total Nonsense… This is not in some district of UP, but in United Kingdom, UK, London. A suburb in UK, Birmingham, where the muslim community is slowly becoming majority.#Birmingham pic.twitter.com/UVEBDRpljY", "— 🇮🇳Sandeep Singh🇮🇳 (@sandeepfromvns) June 4, 2018", "According to another version, this video has been shared by a YouTube channel RedeBrasil.NET with the claim that this vandalism took place in Brazil. It was also shared along with a set of gruesome images which falsely claimed that a gang of 15-20 people are on an abduction and killing spree in Jharkhand, Odisha and Bihar, attacking vehicles under the cover of darkness.", "Now, yet another context has been imagined for this video and shared widely with the objective of inciting suspicion and hatred among communities. This not only points to a pattern in which fake news is floated on social media but also shows that how thousands are still in the dark about the origin of the video. This is further exacerbated by the fact that such misinformation primarily relies on impulse and needs only a click to be shared further.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "Trigger Warning: Sexual Violence A distressing video of a girl forced to take her clothes…", "A clip featuring Pakistan men’s Cricket team captain Babar Azam is viral on social media…", "A 13-second clip featuring Bollywood actor Shah Rukh Khan is being shared on social media…", "Union minister of information and broadcasting Anurag Thakur on September 26 announced Waheeda Rehman as…"]