["By Robert Farley", "Posted on November 3, 2020", "A bogus post on Instagram purports to be from an Erie County, Pennsylvania, poll worker who claimed he threw out over 100 pro-Trump ballots. The chair of the Erie County Board of Elections says the man “does not work in any way with Erie County or have any part of Erie County’s election process.”", "The Erie County Elections and Voting office in Pennsylvania was inundated with calls on Election Day about an Instagram post purporting to be from a county poll worker who claims he threw out “over a hundred ballots” for Trump that morning.", "The post from a person claiming to be Sebastian Machado states, “Been working at a poll station in Erie county, PA all morning. A lot of people have already voted today:) I’ve thrown out over a hundred ballots for trump already!! Pennsylvania gonna turn blue in 2020!!”", "The bogus claim was amplified on Twitter and in Facebook posts by those sharing the Instagram post.", "But the post was later discredited by Erie County Board of Elections Chair Carl J. Anderson III, who issued a statement calling it false.", "“Erie County has checked into the unfortunate claim being shared across social media by someone saying they are working as part of the Erie County Board of Elections and throwing out ballots,” Anderson stated. “The person making the statements does not work in any way with Erie County or have any part of Erie County’s election process. In fact, the individual is not a registered voter and is not believed to be a resident of Erie County, Pa.”", "“Erie County Board of Elections takes the integrity of the election process very seriously, and we are proud that the people working on behalf of the voters in Erie County do so in a nonpartisan, fair and unified fashion for the betterment of our community,” Anderson continued. “I have spoken with [Erie County] Sheriff [John] Loomis to verify if this person is a resident. Because this is now part of an ongoing investigation to pursue potential criminal charges, no further statement will be made on this matter.”", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here for more.", "Erie County, Pennsylvania, official website. “Chair of Election Board issues statement following false election claims on social media.” 3 Nov 2020.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]