["Chances are, you or someone you know has gotten a surprise medical bill. One in six Americans have received these unexpected and often high charges after getting medical care from a doctor or hospital that isn’t in their insurance network.", "It’s become a hot-button issue in Congress, and high-profile legislation has been introduced in both the House and Senate to make the medical providers and insurers address the billing question and take the consumers out of the dispute.  That means doctor specialty groups, hospitals and insurers are among the stakeholders that could be financially affected by the outcome.", "The effort has caught the attention of Physicians for Fair Coverage, a coalition formed by large companies — firms such as US Acute Care Solutions, U.S. Anesthesia Partners and US Radiology Specialists — that serve as corporate umbrellas for medical practices. The group is running a $1.2 million national commercial about these congressional efforts. It first aired in mid-July.", "The ad issued a warning: \"What Congress is considering would cut money that vulnerable patients rely on the most. That means seniors, children and Americans who rely on Medicaid would be hurt.\"", "We wondered: Will any of the surprise billing proposals being debated in Congress really affect Medicaid and these patients — \"shredding the safety net,\" as the ad claims? So we dug in.", "We reached out to Physicians for Fair Coverage (PFC) to find out the basis for this claim, but the phone number listed on their website no longer worked. Several emails and a direct message on Twitter later, we connected with Forbes Tate Partners, the public relations firm that produced the ad. We were then referred to Megan Taylor, a spokeswoman for PFC.", "\"When we talk about the safety-net, we’re talking about the health care system that the uninsured and underinsured rely on — like emergency departments, where two-thirds of the acute care is provided to uninsured Americans and where half of the acute care provided to Medicaid and Children’s Health Insurance Program patients is delivered,\" Taylor wrote in an email.", "To be sure, studies have shown that ERs see a large share of vulnerable patients. But independent experts we spoke with still didn’t follow the ad’s logic.", "\"I’d like to think that I’m fairly well-informed about surprise billing legislation, but I’m struggling to understand what argument they are even trying to make here,\" Benedic Ippolito, a research fellow at the American Enterprise Institute who has testified before a Senate committee on this issue, wrote in an email.", "Focusing on the real trouble spot", "The surprise medical bill legislation is an effort to help consumers who generally mistakenly thought they were getting health services covered by their insurers but instead find themselves dealing with an out-of-network provider.", "The insurance often covers a small portion of services, and the patient is on the hook for the rest. It’s called a \"balance bill.\" That happens, for example, when people seek care at an in-network hospital but the doctor treating them doesn’t accept their insurance. The consumer can be responsible for paying the entire bill.", "Most surprise bills come from specialty physicians — such as anesthesiologists, radiologists and emergency room doctors — like those in the practices represented by Physicians for Fair Coverage.", "There are two major solutions on the table in the congressional legislation: arbitration, which would send the insurers and health care providers through an independent review to determine a fair price, and benchmarking. The ad doesn’t explicitly say so, but it’s referring to benchmarking.", "Under this approach, when a doctor sees an out-of-network patient, the patient’s health plan pays the doctor the median of what other doctors in the area are paid for the procedure.", "The ad paints a grim picture — complete with photos of children, families and even older patients in wheelchairs — of what will happen if Congress adopts benchmarking. It suggests insurance companies will offer doctors artificially low in-network rates, which, in turn, will bring down out-of-network rates. Those low rates will make it hard for doctors and hospitals to make up for uncompensated care or low payment rates from Medicaid and Medicare patients. The concern is that this will make it difficult for emergency rooms and rural hospitals to operate and force them to close.", "Taylor pointed to California’s 2017 law that set up a statewide benchmarking system as Exhibit A.", "\"By setting a guaranteed benchmark rate at the median in-network rate, it means that insurers can push doctors out of their network, by cancelling contracts or demanding artificially low rates, in order to make the benchmark rate the default. In California, where a benchmark rate has been implemented, doctors report that insurance companies are already doing this and that Californians’ premiums are rising,\" she wrote in an email.", "She also cited a letter from the California Medical Association about this state law that reiterated how it is affecting patients’ access to care.", "So we turned to Anthony York, the director of communications for the California Medical Association, to ask about how the law was affecting the supply of doctors. He said at least nine medical facilities in the state have no anesthesiologists that are in network for some local health plans.", "For instance, he added, a search on Anthem Blue Cross, Blue Shield of California, United Healthcare and Health Net shows no contracted anesthesiologists within 30 miles of Children’s Hospital of Orange County.", "But Loren Adler, associate director of the USC-Brookings Schaeffer Initiative for Health Policy, wrote in an email that there is not enough data yet from California to say whether insurance companies are kicking doctors out of networks. He said networks are often in flux as insurers and providers wrestle about payment rates or other contract issues.", "\"Despite what the medical association is saying, we don’t have any evidence on this question one way or the other,\" Adler said. \"Of course there are anecdotes of contract cancellations, but contracts change over frequently.\"", "How does Medicaid fit into this?", "One thing needs to be clear: No piece of surprise bill legislation is cutting the federal funding for Medicaid or Medicare. The text of the House bill doesn’t even mention either program; the Senate bill mentions them only in the course of data collection or cost studies.", "\"No one on Medicaid would be affected one way or the other by any of the surprise billing proposals on the table,\" noted Adler.", "So how can the commercial claim that either one is \"shredding\" the safety net? It goes back to Taylor’s view that the safety net includes having access to an emergency room. This point brings up a broader issue raised by the ad: that ERs would close if physicians were paid the median in-network rate for out-of-network services.", "And that drew skepticism from Adler, who pointed out that many factors are responsible for emergency physician shortages or rural hospital closures. Letting doctors send large bills to patients, he said, won’t keep ailing hospitals open.", "\"That’s a completely illogical and contradictory set of claims they’re making,\" he wrote.", "Both he and Ippolito think the link to ER closures is overblown.", "Ippolito called the commercial a \"vague scare tactic.\" He acknowledged that problems do exist with rural hospital closures and emergency room staffing, but he said solving those problems should be separate from dealing with surprise bills.", "\"Policymakers should solve surprise billing in the best way they can,\" he wrote, adding that concerns about access to care should be \"dealt with directly.\"", "Our ruling", "Physicians for Fair Coverage claims in this commercial that Congress is considering a surprise billing solution that would \"cut money that vulnerable patients rely on.\"", "This, in itself, is inaccurate. Neither of the proposed pieces of legislation would cut money to any programs, specifically Medicaid, CHIP or Medicare.", "There is also scant evidence that these proposals would trigger emergency room closures. The group claims the consequences of this proposal would ultimately lead to ER closures. But experts say their evidence is anecdotal at best.", "This claim raises serious health system alarms — reduced access to care, higher premium costs and even shuttered emergency rooms — without logically supporting these concerns.", "We rate it as False.", "Physicians for Fair Coverage TV Commercial, \"Stop Surprise Medical Bills. Save the Safety Net,\" first aired July 14.", "Email and telephone interviews with Benedic Ippolito, American Enterprise Institute research fellow, July 22 and July 24.", "Email interviews with Loren Adler, associate director of the USC-Brookings Schaeffer Initiative for Health Policy, July 24 and July 29.", "Telephone interviews with Megan Taylor, a spokeswoman from the public relations firm Forbes Tate Partners, July 25, and email correspondence July 25-26.", "Letter to Congress from the California Medical Association, July 22.", "H.R. 3630 No Surprises Act, accessed July 29.", "S. 1895 Lower Health Care Costs Act, accessed July 29.", "Kaiser Health News, \"Surprise Medical Bill Legislation Takes A Step Forward, But Will It Lead To A Step Back?\"", "July 17 New York State Health Foundation Issue Brief: New York’s Efforts to Reform Surprise Medical Billing, Feb. 2019.", "Email Correspondence with Anthony York, director of communications for the California Medical Association, Aug. 1 and 2.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]