["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "State Sen. Leticia Van de Putte praised gubernatorial candidate Bill White, a fellow Democrat, for his efforts to get dropouts back into classrooms during a speech last month to her party's convention in Corpus Christi.", "He \"went door to door in Houston luring and asking those dropouts to come back to school,\" she said June 25. \"Those programs were so successful that almost every city in our state has replicated what Bill White started.\"", "We wondered whether the former mayor of Houston's education initiative had really become so widespread.", "In response to our inquiry, Van de Putte's office pointed us to the website for Expectation Graduation, a program that White and his wife, Andrea, helped create in 2004 -- his first year as Houston mayor -- to reduce dropout rates. Part of the program's strategy is an annual Reach Out to Dropouts walk during which volunteers visit the homes of students who have not come back to school and encourage them to return.", "Linda Clarke, who served as White's director of education and special projects when he was mayor, said one goal of the walk is to help kids deal with the issues that keep them out of school, such as finding child care for teen mothers.", "The first walk was held in the Houston school district in 2004, and Clarke said Bill White has participated in each one. Mark Cueva, assistant to the deputy chief of staff in the office of Houston Mayor Annise Parker, said the walks first went statewide in 2008, when other major cities in Texas -- excluding Austin -- and their respective school districts held their own versions: Corpus Christi, Dallas, El Paso, Fort Worth and San Antonio.", "Five small cities in the Houston area also participated: Baytown, Galena Park, Richmond, Rosenberg, and Stafford. Last year, Midland joined the group, as did eight additional small cities near Houston. That brings the total number of Texas cities to 20.", "According to the Texas Almanac online, which is maintained by the Texas State Historical Association, the state has about 1,200 incorporated cities. So, less than 2 percent of the state's cities are replicators of the White-founded outreach program.", "On Tuesday, the White campaign released a Web video highlighting White's involvement with the Reach Out to Dropouts walk and its spread to big cities across the state. The campaign video also says that the Reach Out to Dropouts walk has brought more than 8,000 students back to school in Houston. Clarke said that number is a cumulative total based on reports by participating Houston-area school districts.", "When we asked Clarke, who is on the board of the nonprofit group that runs Expectation Graduation, about Van de Putte's statement that \"almost every city in our state\" has replicated the Reach Out program, she questioned the broad sweep of that assertion, and said her organization has always been clear about the number of cities participating.", "Van de Putte's press secretary, Kathryn Freeman, told us that the senator had gone off her prepared remarks during that part of the speech, which \"simply stated that the program was so successful it was replicated across Texas.\" However, based on the expansion of the walk in the past two years, Freeman argued that the senator's \"larger point is true, that Bill White began a program to try and address the dropout crisis in Houston that was successful and therefore replicated.\"", "We agree. Although Van de Putte clearly overstated the expansion of the Reach Out to Dropouts walk, it has been duplicated in most of the biggest cities in the state. We rate her claim Half True.", "State Sen. Leticia Van de Putte, speech to Texas Democratic Party convention, June 25, 2010", "Bill White for Texas, \"Perry markets existing law as 'new plan' on dropout crisis,\" July 20, 2010", "Bill White for Texas, \"Reach Out to Dropouts\" video", "City of Houston's website, \"Education Initiatives: Reach Out to Dropouts\"", "E-mail correspondence with Kathryn Freeman, press secretary for state Sen. Leticia Van de Putte, July 9, 2010", "E-mail correspondence with Mark Cueva, assistant to the deputy chief of staff in the office of Houston Mayor Annise Parker, July 20, 2010", "Interview with Linda Clarke, who served as director of education and special projects under Houston Mayor Bill White, July 20, 2010", "Expectation Graduation website, \"About Us\" page, accessed July 21, 2010", "Reach Out to Dropouts walk participants, 2008", "Reach Out to Dropouts walk participants, 2009", "Texas State Historical Association, Texas Almanac online, \"Facts\" page, accessed July 20, 2010", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]