["A video widely shared on social media shows a man voting for the BSP but the EVM machine registers a vote for the BJP. It is being claimed that the incident occurred during the recent polling in Meerut. “*वोट डाल रहे है बसपा को पर जा रही है भाजपा को Inquiry कराओ सबको शेयर करो सबको फैला दो जल्दी जल्दी ये अभी का ही है मेरठ के (Voting for BSP but it’s getting registered to BJP. An inquiry should be conducted, share this to everyone and make it viral. This recently happened in Meerut.),” is the caption used to share the clip.", "*वोट डाल रहे है बसपा को पर जा रही है भाजपा को Inquiry कराओ सबको शेयर करो सबको फैला दो जल्दी जल्दी ये अभी का ही है मेरठ के*", "Posted by Harvinder Rehal on Wednesday, 17 April 2019", "The video is viral on Facebook.", "Upon searching for the clip on Youtube, with the keywords ‘EVM registers vote for BJP’, the first link in the results was a 2017 broadcast by NDTV. The man pressing the BSP’s button on the EVM was identical in both videos, which confirmed that NDTV was reporting the same incident depicted in the viral video.", "According to NDTV, the alleged EVM malfunction took place during the 2017 Uttar Pradesh civic polls – “Fresh allegations of Electronic Voting Machines or EVMs fraud favouring the BJP have emerged in Uttar Pradesh during the first phase of civic polls. Some voters have alleged the EVMs were registering votes only for the BJP irrespective of which button was pressed. Similar allegations had been made after the BJP’s massive victory in the UP assembly polls earlier this year. The Election Commission has denied any fraud back then and has said this time too that the allegations are wrong. “", "Several other news organisation – Firstpost, News18, Newsclick – had also reported the incident.", "Alt News also found tweets from the time that shared the same video.", "यूपी निकाय चुनाव: मेरठ (रशीद नगर)- ईवीएम में बटन हाथी का दबाया तो लाइट भाजपा व नोटा की जली #EVMTempering #EVMSCam pic.twitter.com/uNC70KIH7o", "— Bahujan4India (@Bahujan4India) November 22, 2017", "Earlier, a 2018 video of Sangh workers conducting a meeting in a polling booth was viral in the context of the ongoing Lok Sabha polls.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]