["On March 6, Twitter user @__Paali__ shared a photo of an elderly woman and claimed she is Parkash Kaur, the sister of freedom fighter Bhagat Singh. The user stated that no politicians had offered their condolences following her recent demise. More than 3,500 handles retweeted this post at the time of writing. (Archive link)", "शहीद #भगतसिंह की 96 वर्षीय छोटी बहन प्रकाश कौर हमारे बीच आज नही रहीं, किसी नेता राजनेता ने शोक व्यक्त नहीं किया", "आइये हम आज़ादी के परवाने की बहन को श्रद्धांजलि अर्पित करें 💐💐 pic.twitter.com/DYeLKGjBT3", "— 𝓟𝓪𝓵𝓲 (@__Paali__) March 6, 2021", "The claim is also viral on Facebook.", "We noticed that several users took to the comments to clarify that Parkash Kaur actually died in 2014. According to a September 29, 2014 story in The Times of India, Kaur lived in Canada with her son, Rupinder Singh Malhi. She died on September 28 (EST) in Canada. This happened to be the same date as her brother Bhagat Singh’s birthday.", "This photo previously went viral in 2020. Boomlive, NewsMobile and a few other media outlets fact-checked it last year.", "Alt News found the viral image on RWABhagidari blog, where it was uploaded by BS Vohra on September 28, 2013. This was cropped and circulated in its current form.", "Aikam TV interviewed Parkash Kaur in June 2012, as seen in a video uploaded to their YouTube channel. She had already become quite frail at this point and was unable to speak.", "Apart from this, the post suggests that no leader expressed their condolences on the death of Prakash Kaur. However, this claim is also false. Congress leader Captain Amarinder Singh had issued a condolence tweet.", "I express grief & sorrow at the death of Bibi Prakash Kaur, sister of Shaheed #BhagatSingh. I also pay profound homage to the departed soul.", "— Capt.Amarinder Singh (@capt_amarinder) September 30, 2014", "Donate Now", "A journalist and a dilettante person who always strives to learn new skills and meeting new people. Either sketching or working.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]