["Demonstrators outside Buffalo City Hall in June 2015. (Derek Gee/Buffalo News)", "New York State’s minimum wage has been climbing above the federal wage requirement since 2013. The state’s increases were supposed to stop when the minimum wage hit $9 an hour last year. But then Gov. Andrew M. Cuomo struck a deal with state lawmakers in March to raise it to $15 an hour over the next several years.", "The higher minimum wage is bad for businesses, which already struggle with taxes and regulations, said New York State Conservative Party Chairman Michael R. Long.", "The state is \"already showing signs of various companies picking up and leaving,\" Long said.", "When asked about his claim, Long said he was not referring to any particular company.", "\"All someone needs to do is look at upstate,\" Long said.", "So is Long right? Are some businesses leaving New York because of the higher minimum wage?", "What’s the minimum wage?", "The state’s hourly minimum wage has risen from $7.25 - still the federal level - to $9 since 2013.", "Tipped workers, like those in the restaurant and hospitality industries, also saw a minimum wage increase in the last year. They used to make around $5 an hour without tips. They are now paid $6.80 to $7.65, depending on the industry and tips earned.", "Starting at the end of this year, a new set of minimum wage increases will be phased in across the state.", "• New York City will reach $15 by the end of 2018. Small businesses in New York City have until the end of 2019.", "• Westchester County and Long Island will reach $15 an hour in  2021.", "• Upstate New York will reach $12.50 by the end of 2020. The Department of Labor will then determine the wage increase each year until the region hits $15.", "Wages for tipped workers will increase at a different rate.", "Starting in 2019, the governor can pause the increase if it appears to cause more harm than good.", "Companies moving out of New York", "When we spoke to Long about his claim, he said he did not have any particular company in mind.", "We also reached out to business groups, including two chambers of commerce across the state's southern border, to see if they knew of any business that had moved or plan to move because of the state's rising minimum wage. They were able to provide examples of businesses that closed, but could not point to a company that moved out of state because of the wage increase. We also could not find any reports of businesses relocating because of the wage increase.", "Some suggested minimum wage was a factor in Verizon's decision to relocate jobs from two call centers in New York, but a representative from Verizon said the state's wage was not a factor in the move.", "Impact on business", "We found a handful of small business owners who said that minimum wage increases – or the prospect of more increases – were a factor in the failure of their businesses. There is no way to prove that, but restaurants and other small business often operate with little margin for error. Anything that increases costs – higher rents, more expensive food or other costs, higher wages – can hurt their businesses.", "Bob and Ron’s Fish Fry in Albany County closed in April after the new wage increase became law. The restaurant posted on its Facebook page that rising costs sunk it.", "\"Mainly the economy, high cost of seafood, demand,\" the business wrote in a post on the social media site, \"And to be honest there is no way we could pay the high minimum wage that is coming and mandatory 3 months paid sick leave- this state is going in the wrong direction for small businesses- that's the main reasons.\"", "When the Del Rio Diner in Brooklyn closed in July, it also cited the higher wage.", "\"The minimum wage, that’s what broke the camel’s back. It killed us,\" Larry Georgeton, the diner’s co-owner, told Brooklyn Daily.", "Not only restaurants complained. A family-owned Ramada Hotel in Buffalo closed in July. The owner told The Buffalo News that higher wages and stricter regulations influenced their decision.", "\"It has been difficult to compete with all the new properties being built in Western New York, along with all the new proposed increases in wages and state regulations,\" Richard A. DiVita Jr., the hotel’s chief operating officer, told the newspaper.", "The owner of a restaurant that closed in East Aurora after 14 years of business also placed blame on the state’s rising minimum wage.", "The businesses also faced challenges outside of the minimum wage including the cost of resources and more competition.", "Our ruling", "Long, the state’s Conservative Party chairman, said New York State is \"already showing signs of various companies picking up and leaving\" because of the new minimum-wage legislation.", "We found a handful of businesses that cited the higher minimum wage as a factor for closing. But we couldn't find any companies that relocated out of New York State because of the wage increase.", "We rate this claim as Mostly False.", "Capital Tonight interview with Michael R. Long, Oct. 14, 2016, Accessed Oct. 17, 2016", "Phone interview with Conservative Party Chairman Michael R. Long", "Email interview with Mike Durant, State Director of the National Federation of Independent Business in New York", "Email interview with Greg Biryla from Unshackle Upstate", "Email conversation with Zack Hutchins from the NYS Business Council", "Phone interview with Sheila Webster from the Chautauqua County Chamber of Commerce", "Phone interview with Brendan O’Bryan from the Greater Binghamton Chamber of Commerce", "Phone conversation with Carolyn Price from the Upstate New York Towns Association", "Message from Kim Ancin from Verizon", "History of the minimum wage in New York, NYS Dept. of Labor, Accessed Oct. 10, 2016", "Minimum wage increase for tipped workers, NYS Dept. of Labor, Accessed Oct. 10, 2016", "Press release from the NYS Business Council on this year’s minimum wage deal, March 31, 2016, Accessed Oct. 10, 2016", "Governor Cuomo Signs $15 Minimum Wage Plan and 12 Week Paid Family Leave Policy into Law, April 4, 2016, Accessed Oct. 10, 2016", "Schedule of future minimum wage increases in New York, NYS Dept. of Labor, Accessed Oct. 10, 2016", "Facebook post by Bob and Ron’s Fish Fry, April 15, 2016, Accessed Oct. 10, 2016", "Dine and dashed: Brooklyn’s 24-hour greasy spoons are toast, insiders say, July 21, 2016, Accessed Oct. 10, 2016", "Ramada Hotel near UB closing in September, The Buffalo News, July 21, 2016, Accessed Oct. 10, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]