["About this rating", "An image comparing the flag of Antifa, a group that derives its name from their anti-fascist activities, and a swastika-bearing flag of Nazi-era Germany has made its way around conservative blogs and web sites since at least 2017. The visual comparison, which has also worked its way into the Qanon conspiracy theory, is commonly shared with the caption: \"Does the new Antifa flag remind you of anything?\":", "The bottom image does not actually picture the state flag of Germany during the era of Nazi rule, but rather the Reichskriegsflagge, a war ensign used by the German armed forces from 1933 to 1945.  More important, the top image does not show an Antifa flag, but rather a digitally manipulated version of a flag used by the National Front, a far-right, fascist political party in the United Kingdom.", "The original photograph was taken from a January 2016 demonstration in Dover which, ironically, featured a clash between far-right demonstrators and anti-fascists. In other words, members of Antifa were protesting against the group represented by this flag when the picture was snapped:", "Three people were arrested amid violent scenes as groups demonstrating against immigration clashed with anti-racism protesters in Dover.", "Smoke bombs were let off and bricks thrown as police turned out in force to oversee hundreds of far-right demonstrators marching through town.", "They clashed with anti-fascist demonstrators, leaving five people with minor injuries.", "Here's a look at the original image (left) and the doctored Antifa flag image (right):", "The scene can be glimpsed around the 1:05 mark of this video from the 2016 protests in Dover:", "A variation of this meme featured another version of the \"New Antifa Flag\":", "Again, however, this is not a banner  we've found any genuine Antifa groups to be using in earnest. This design was actually created by Deviant Artist \"Linumhortulanus\" as a means of denigrating the anti-fascist group:", "After hearing about the terrible revolts of far-left extremists in Hamburg (this year's location of the G-20 summit) I felt like I had to make them a new ... and more appropriate flag! It's inspired by the national socialist war ensign of Germany. It's supposed to symbolize that the extremism of far-left organizations like the ANTIFA is the same ... or rather ... as harmful as the extremism of far-right movements ...", "I think that far-left extremism is a big danger for the people of Germany. I made this to remind everyone that organizations like the ANTIFA are just as harmful and violent as neonazi gangs.", "Antifa consists of a loose network of like-minded groups but has no central organizing body. As such, it's difficult to determine if anything that could fairly be called an \"official\" Antifa flag exists. The group does, however, commonly use variations of the following logo:", "BBC News.   \"Far-Right and Anti-Racism Protesters Clash in Dover.\"\r\n    30 January 2016.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]