["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Sen. Tim Kaine and Republican challenger Corey Stewart shake hands at the end of the Virginia Bar Association debate in Hot Springs, Va., on July 21, 2018. (AP/Steve Helber)", "During a recent campaign debate, Sen. Tim Kaine took aim at Republican Corey Stewart’s support for former Senate candidate Roy Moore, who lost an Alabama special election after facing multiple allegations of sexual misconduct.", "\"In December of 2017, the Prince William board of supervisors had a meeting ... you skipped that meeting to go campaign in Alabama for Roy Moore to be a U.S. senator,\" Kaine said at the July 21 debate, noting that the meeting covered topics such as zoning and the opioid crisis.", "Several minutes later, after Stewart dodged Kaine’s original question, Kaine added: \"You haven't disavowed Roy Moore's name yet.\"", "Stewart, the at-large chair of Prince William County’s board of supervisors, has battled frequent criticism for his history with the far right. He has since renounced some activists with whom he previously associated, but he has not been shy about supporting estranged figures in his party, so we decided to see whether Kaine’s claim checked out.", "On Dec. 12, 2017, the Prince William County board of supervisors met to consider, among other things, an increase in spending on the county’s substance-abuse treatment programs.", "Stewart was not present at that meeting. He was on the campaign trail in Alabama with Moore, carrying out a plan he announced two days earlier in a news release, according to local reports.", "Stewart also detailed his visit to Alabama in a Facebook live video. He said he planned to fly to Atlanta, and drive a rental car to Montgomery in order to show support for Moore, who he said was a fellow \"anti-establishment, pro-Trump candidate.\"", "\"If you’re wondering, why am I going down to Alabama, why is it important, and that is because we’re all in this together, folks, we’re all in this together,\" Stewart said. \"It is the establishment Republicans who are together colluding with Democrats, with liberals, and they’re trying to take out every single anti-establishment, pro-Trump candidate.\"", "\"I’m going down there to support him,\" Stewart added. \"Next year, when the establishment comes after me … I’m hoping, of course, that I will get his help as well.\"", "Stewart later tweeted a photo taken at the Moore rally in Alabama. \"With @UofAlabama students at the @MooreSenate rally! #MAGA #DrainTheSwamp,\" he wrote.", "With @UofAlabama students at the @MooreSenate rally! #MAGA #DrainTheSwamp pic.twitter.com/BIfDIF5syG", "Most conservatives severed ties with Moore, but Stewart supported him even as accusations surfaced detailing his sexual misconduct with teenagers. \"I am not going to cut and run from a good man like Judge Roy Moore,\" he said in a Facebook live video.", "Ian Sams, communications director for the Kaine campaign, pointed to multiple occasions when Stewart defended Moore or explained his belief that Moore should have been presumed innocent until proven guilty because the accusations were decades-old.", "In a post-debate interview with PBS NewsHour anchor Judy Woodruff, who moderated the debate, Stewart refused to condemn Moore. \"I do believe (Moore) when he said he didn’t do that,\" Stewart said.", "\"I thought that he was treated unfairly,\" Stewart added. \"I don’t think it’s right that 40 years after something supposedly happened, somebody comes out and says that you do something, and then, instead of them having to prove that you did it, it was left upon him to try to prove that he didn’t do it.\"", "Stewart campaign spokesman Noel Fritsch acknowledged Stewart’s continued support for Moore in an email. \"Corey never claimed to have disavowed Moore,\" he wrote. \"To claim so would be false.\"", "Kaine said Stewart skipped a Prince William County board of supervisors meeting to campaign for Moore.", "Stewart missed a Dec. 12, 2017, meeting at which the board of supervisors voted on a proposal to boost funding for programs meant to cope with the opioid crisis. Instead, he attended a rally for Moore in Alabama because he said it was important to support an \"anti-establishment, pro-Trump candidate.\"", "Stewart has not disavowed Moore and refused to do so in an interview after the debate.", "We rate Kaine’s statement True.", "PBS NewsHour on YouTube, \"WATCH LIVE: Tim Kaine and Corey Stewart meet for first U.S. Senate debate in Virginia,\" July 21, 2018", "Prince William County, Virginia, Board of Supervisors Meeting, December 12, 2017", "Corey Stewart on Twitter, December 12, 2017", "Corey Stewart on Facebook, December 10, 2017", "Corey Stewart on Facebook, November 13, 2017", "PBS NewsHour on YouTube, \"Corey Stewart explains his support of Roy Moore after the first U.S. Senate debate in Virginia,\" July 23, 2018", "Prince William Times, \"Corey Stewart heading to Alabama to campaign for Judge Roy Moore,\" December 10, 2017", "Richmond Times-Dispatch, \"Corey Stewart heads to Alabama to campaign for Senate candidate Roy Moore,\" December 10, 2017", "Inside NOVA, \"Supervisors reject $200K proposal for opioid treatment in Prince William,\" December 14, 2017", "The Washington Post, \"Outspoken Republican Corey Stewart defends Senate candidate Roy Moore,\" November 12, 2017", "Email interview with Ian Sams, communications director for the Kaine campaign, July 23, 2018", "Email interview with Noel Fritsch, spokesman for the Stewart campaign, July 24, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]