["About this rating", "In February 2021, a letter supposedly written by conservative radio host Rush Limbaugh to thank former U.S. President Donald Trump for his work went viral on social media. The letter begins:", "“My days on earth are numbered but before I fade away, there is something important I need to say. It may not be important to anyone else; but it’s important to me. Win, lose or fraud...President Trump, I just want to say thank you for the last four years.”", "However, this letter,  which goes onto thank Trump for \"making it cool to be an American again,\" for getting the country out from \"under China's thumb,\" and for building the \"strongest economies we've ever experienced in my lifetime,\" was not penned by Limbaugh.", "This letter did not originate on any of Limbaugh's social media accounts. We also could not find it on his website Rushlimbaugh.com.", "As is often the case, it appears that this letter was circulating online before Limbaugh's name was attached to it. The earliest iteration we could find was posted to Facebook in late November 2020. The letter was likely circulating before this date, however, as it talks about the 2020 election as a coming event, not a past one. In either case, the postings that we found in November and early December were attributed to an unknown third party. Additionally, these early versions did not start with a sentence saying that \"my days on earth are numbered ...\" It seems that this sentence, as well as Limbaugh's name, were subsequently added to this letter to make it more impactful.", "In short, Limbaugh did not write this letter. A spokesperson for Premiere Networks, which syndicates The Rush Limbaugh Show, told Reuters: “These are not Rush Limbaugh’s words.”", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]