["The video was viewed more than 10,000 times and shared more than 600 times after it was published in this Facebook post on April 9, 2020.", "The three-minute eight-second video shows US President Donald Trump sitting next to First Lady Melania Trump, Vice President Mike Pence and his wife Karen Pence.", "Below is a screenshot of the misleading post:", "The post’s Indonesian-language caption translates to English as: “Holy God Almighty..", "“The White House asked for an imam/Islamic scholar to pray so [they are] kept away from the corona outbreak. From this, their heart actually acknowledge that Islam is a true religion. And may Allah give them the guidance to Islam...”", "The white text across the bottom of the video reads: “Praise be to Allah. The first time in history the US President and Senate opened a meeting with the KORAN.”", "As of April 16, 2020, the novel coronavirus disease, or COVID-19, has killed at least 26,000 people in the US and infected more than 632,000 others, according to this data from US Centers for Disease Control and Prevention (CDC).", "The video has been viewed more than 100,000 times after it was posted here on Facebook and here on YouTube with a similar claim about a Koran recitation at the US Senate, with comments about the COVID-19 outbreak.", "It also has been watched more than 270,000 times after it was shared on Facebook here, here and here, with similar claims and comments in Arabic.", "The same clip was also shared here on March 25, 2020, with an English-language claim that it shows Trump and Pence listening to a Koran recitation at a US Senate meeting during the coronavirus pandemic.", "These claims are false; the video shows Trump attending an interfaith prayer service at a church in Washington, DC, after his inauguration as US president in 2017.", "A Google reverse image search using a keyframe generated by InVID-WeVerify, a video verification tool, and subsequent keyword searches, found this video published on the Facebook page for ABC News on January 21, 2017.", "The video's title, which is almost an hour and 21 minutes in length, reads: “Trump, Pence Attend National Prayer Service”.", "The video caption states: “President Donald Trump and Vice President Mike Pence attend the National Prayer Service at the Washington National Cathedral—an inaugural tradition that dates back to George Washington.”", "The Koran recitation starts at the 36-minute four-second mark of the video.", "Below is a screenshot comparison of the clip in the misleading post (L) and the ABC News video (R):", "Trump was inaugurated as the 45th US president on January 20, 2017, one day before the interfaith prayer event.", "US broadcast channel C-span also reported on the event on January 21, 2017, here, saying: “President Donald Trump and Vice President Mike Pence and their families attended the 58th Presidential Inauguration National Prayer Service at the National Cathedral in Washington, D.C. The interfaith service traditionally held the morning after the inauguration featured prayers and readings from religious leaders of many faiths, along with musical performances. The service marked the end of the official inaugural schedule.”", "The Washington National Cathedral lists the January 21, 2017, event here on its website, while the full schedule of the event can be read here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]