["“Those were Jackie Kennedy’s crabapple tree’s. Many of those rose bushes were from ALL the First Ladies of America, going all the way back to Ellen Louise Wilson in 1913,” said a tweet that was shared as a screenshot on Facebook.", "The tweet featured photos of the White House Rose Garden before and after the latest redesign. Other social media posts accuse the first lady of removing cherry trees or of gutting former first lady Jackie Kennedy’s garden tribute to her husband John F. Kennedy, murdered in 1963.", "However, a landscape architect for the project rejected the claims.", "“There is just so much being said that is so ill-informed that it’s hard to even begin to address it,” Perry Guillot, who heads one of the two landscape architecture firms contracted for the project, told AFP by phone.", "The new design of the White House Rose Garden was revealed to the press on August 22, 2020, just two days before the start of the Republican National Convention. President Trump closed it on August 27 with a speech on the South Lawn, directly across from the garden, a noted break from past conventions that Democrats said raised ethical questions.", "The garden’s redesign was formally announced on July 27, 2020. “Decades of use and necessary changes made to support the modern presidency have taken a toll on the garden,” the press release said.", "The last major work on the garden took place in 1962 during the Kennedy presidency, and gave the blueprint for the garden’s current presentation. That was one year prior to John F. Kennedy’s assassination in Dallas, which rules out claims that the garden was a tribute to the late president.", "“There were no cherry trees,” Guillot said. Claims that “cherry blossom trees” were removed may have resulted from people misidentifying the crabapple trees that were present and whose white blossom looks similar to cherry trees.", "The White House Rose Garden Landscape Report, which outlines and explains the recent redesign, lists all 11 tree species in the garden, which does not feature cherry trees.", "The same list shows each time a tree was replaced and under whose administration. While the crabapple trees were first planted in 1962 under Jackie Kennedy, they were replaced under presidents George W. Bush, Barack Obama, and Donald Trump, before being removed in 2020.", "“This is all in keeping with the life of gardens, in which a design is retained while plant materials must be renewed,” the report says.", "It is true that the crabapples were removed. “There are two parterres and it was decided not to reinstall the crabapples in the parterres at this time,” Guillot said, adding this was done to give the garden a more robust collection of roses in those beds.", "“While the inclusion of crabapples in the Garden dates to 1962, the current trees do not necessarily themselves contribute to the Rose Garden’s list of character defining features,” the report explains, adding that some crabapples have been removed by the creator of the garden’s modern iteration, landscape architect Rachel Mellon, in order to provide more direct sun to roses growing below.", "The roses themselves, although paramount to the garden’s aesthetic, were not planted by all first ladies since 1913, nor are the ones from that era still in present today.", "“There was not a rose in that garden older than 10 years old,” Guillot said.", "“Nothing was done in a rushed manner,” he said, unhappy with online criticism.", "“Everything was very well studied and deliberated before changes were made,” by the committee for the preservation of the White House, which featured 10 external advisors from the horticulture and landscaping fields.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]