["December 19 witnessed nationwide protests against the Citizenship Amendment Act (CAA). People across the country took to the streets while the police in most states denied permission for protest and imposed Section 144. Among the protesters in Bengaluru, Karnataka was historian Ramachandra Guha who, with several others, was detained by the police. A video of the police detaining Guha is widely circulating on social media. However, some circulated it with the claim that a cop threatened to punch him.", "Congress MP Shashi Tharoor tweeted, “Is this cop threatening to hit ⁦@Ram_Guha with his fist? “", "Is this cop threatening to hit ⁦@Ram_Guha⁩ with his fist? It’s bad enough to arrest a senior historian exercising his democratic right to protest. But to do so with the threat of force is disgraceful & the cop deserves stern disciplinary action. Does the Home Minister care? pic.twitter.com/ogjD47pgsd", "— Shashi Tharoor (@ShashiTharoor) December 19, 2019", "Journalist Faye DSouza tweeted along similar lines, “The police man made a fist….. #Bangalore.“", "In fact, several other journalists claimed the same – Rituparna Chatterjee, Rupa Subramanya, Saikat Datta and Amol Rajan.", "DMK’s IT-wing deputy secretary Isai tweeted, “The police in the right about to fist punch @Ram_Guha.“", "The police in the right about to fist punch @Ram_Guha #CAA_NRC has come to this juncture! #BJPburningIndia pic.twitter.com/Ak2fJuP6vY", "— இசை (@isai_) December 19, 2019", "Another user Md Asif Khan and historian William Dalrymple made similar assertions.", "Alt News analysed the viral video and found that the claim that a policeman threatened to punch historian Ramachandra Guha during anti-CAA protests is false. While it appears that the cop was making a fist when the video is watched at normal speed, a slowed-down version of the video reveals that he was reaching for the breast pocket on his uniform.", "The clip below is 16x times slower than the original.", "Furthermore, a screengrab of the exact moment when the cop raises his arm clearly shows that he was touching his breast pocket. Here, we can also see that his fingers are not forming a fist.", "Therefore, while the video of policemen detaining Ramachandra Guha gives the visual perception that a cop made a fist at the moment of detaining him, in reality the policeman was reaching for the breast pocket on his uniform.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]