["Democratic presidential candidate former Vice President Joe Biden speaks at McGregor Industries in Dunmore, Pa., Thursday, July 9, 2020. (AP Photo/Matt Slocum)", "The controversial drilling technique known as hydraulic fracturing, or fracking, has long been a flashpoint in Pennsylvania politics. On a Trump campaign call last week, U.S. Rep. Mike Kelly took aim at Joe Biden’s vision for the sector.", "\"If Joe Biden really cared about Pennsylvania, why would he propose killing over 600,000 jobs supported by fracking?\" said Kelly, a Republican congressman from Butler County, in northwest Pennsylvania.", "We wondered whether Kelly accurately described Biden’s position on fracking, which has lifted the economy in southwest Pennsylvania but also sickened some residents who live near the wells that extract natural gas from miles beneath the earth’s surface.", "Biden wants to block the federal government from issuing new permits for drilling on public land, but he has not called for banning fracking outright. He also would allow existing fracking operations to continue.", "His official position hasn’t changed, but it became muddled when Biden, now the presumptive Democratic presidential nominee, misspoke during a March debate with Bernie Sanders, his last opponent standing in the race for the nomination.", "Here’s an excerpt of their exchange:", "\"I’m talking about stopping fracking as soon as we possibly can,\" Sanders said. \"I’m talking about telling the fossil fuel industry that they are going to stop destroying this planet — no ifs, buts and maybes about it.\"", "\"So am I,\" Biden replied.", "\"Well, I’m not sure your proposal does that,\" Sanders said.", "\"No more — no new fracking,\" Biden said.", "Biden seemed to be saying he wanted to ban fracking entirely – a sharp departure from his official position.", "And the former vice president’s critics pounced.", "Republican operatives quickly cut a short video of Biden’s remarks to use as a cudgel in races against moderate House Democrats, The Washington Post reported. And Sanders supporters accused Biden of misleading voters about his policy, which wouldn’t ban fracking outright, like Sanders wanted to.", "The Biden campaign retracted his remarks the night of the debate, but that hasn’t stopped conservative media outlets from inaccurately reporting that Biden supports a total ban on fracking. The misstep is now being used against Biden in battleground states like Pennsylvania.", "Meanwhile, the statistic Kelly mentioned on the campaign call – the 600,000 Pennsylvania jobs supported by fracking that he says Biden wants to eliminate – comes from a 2019 report by the U.S. Chamber of Commerce’s Global Energy Institute. It estimates that 609,000 jobs connected to fracking would be eliminated across the state by 2025 if fracking were banned.", "The figure has popped up in several recent emails from Trump Victory, a political group led jointly by the Trump campaign and the Republican National Committee, and it flashes across the screen at the end of a television ad released last month by America First Action, a Republican super PAC that supports President Donald Trump’s reelection. The 30-second spot has appeared in several Pennsylvania media markets, according to the ad tracking firm Advertising Analytics.", "However, only 21,000 of the jobs the report says are set to disappear over the next five years are positions directly within the fracking industry. The others comprise companies that do business with the industry or benefit from it indirectly, and the report doesn’t specify which jobs would be at risk. It also hypothesizes that a ban on fracking would mean higher energy costs for American families and that with less disposable income to spend in their communities, local businesses would struggle and ultimately shed jobs. The report says the 609,000 jobs figure is calculated using economic modeling software that \"tracks monetary transactions within the economy between different industries, the government, and households,\" but it offers no other explanation of the math.", "A recent U.S. Bureau of Labor Statistics report shows that 20,146 people are currently employed in Pennsylvania’s oil and natural gas industry.", "Kelly did not immediately respond to a request for comment.", "Kelly said Biden proposed \"killing over 600,000 jobs supported by fracking.\"", "Biden does not support an outright fracking ban, even though he spoke inaccurately about his stance on the debate stage in March. In addition, the 600,000-job figure comes from a report published by an organization that opposes limits on fracking and failed to fully explain how it calculated its projections on job losses", "We rate Kelly’s statement False.", "The Philadelphia Inquirer, \"A fight over fracking at a Pennsylvania steel mill is forcing a reckoning among Democrats,\" March 17, 2020", "The Philadelphia Inquirer, \"Pennsylvania’s attorney general releases scathing grand jury report on fracking industry, state regulators,\" June 25, 2020", "Biden for President, \"Climate: Joe’s Plan for a Clean Energy Revolution and Environmental Justice\" accessed July 20, 2020", "The Houston Chronicle, \"Did Joe Biden just pledge to ban fracking in debate against Bernie Sanders?\" March 16, 2020", "The Washington Post, \"Fact-checking the Biden fracking fracas,\" March 19, 2020", "Axios, \"Clearing up the Biden-Bernie fracking tussle at the debate,\" March 16, 2020", "The Washington Free Beacon, \"Biden Promises ‘No More Drilling’ Under His Presidency,\" March 15, 2020", "U.S. Chamber of Commerce Global Energy Institute, \"What is hydraulic-fracturing was banned? The economic benefits of the shale revolution and the consequences of ending it,\" 2019", "The Hill, \"Kimberly Guilfoyle to lead joint Trump, RNC fundraising committee,\" Jan. 15, 2020", "Politics PA, \"Pro-Trump PAC Hits Biden on Fracking and Coal,\" June 9, 2020", "U.S. Bureau of Labor Statistics, \"Shale gas production and labor market trends in the U.S. Marcellus–Utica region over the last decade,\" August 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]