["About this rating", "Only U.S. citizens and immigrants with Social Security Numbers (SSN) are eligible for stimulus checks from the federal government's COVID-19 economic relief package. The legislation's guidelines exclude the remainder of the country's immigrant population from receiving the one-time payments — and, in effect, their spouses won't get the money either if the couple filed a joint tax return (and are not in the military).", "However, married couples who filed joint tax returns and consist of a U.S. citizen and an immigrant who has a SSN are eligible for the checks. Additionally, spouses who are U.S. citizens and filed single tax returns — regardless of the partner's immigration status — qualify for the payments.", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "In the weeks that followed the U.S. federal government's March 2020 approval of a $2.2 trillion stimulus package — the Coronavirus Aid, Relief, and Economic Security (CARES) Act — to jumpstart a pandemic-broken economy, journalists and economists combed through the legislation's 247-page PDF document outlining who would receive the financial help.", "Early news reports on the bill had highlighted its funding boosts to help newly unemployed Americans, small businesses facing diminished profits, health care facilities on the frontlines of fighting the COVID-19 coronavirus disease, and qualifying taxpayers by giving them one-time checks of about $1,200 (or more depending on how they filed taxes and their number of children). Then, in mid-April, more headlines focused on the intricacies of the multi-faceted policy package — including the claim that U.S. citizens married to immigrants wouldn't qualify for the one-time payments like other taxpayers.", "The implication was that if spouses of immigrants had different marriages, they'd be richer with the federal government's help. Numerous readers contacted Snopes to investigate the truth behind the claim.", "For our examination, we first looked at where the claim originated. On April 20, the Los Angeles Times published a news story headlined, \"These U.S. citizens won't get coronavirus stimulus checks — because their spouses are immigrants,\" featuring stories of four couples, each of which includes an immigrant and will not be receiving the payments, as well as commentary from immigrant-rights advocates. The following day, CBS News published a story that cited the LA Times' reporting. Then, on April 22, Yahoo!'s lifestyle section republished an article from the so-called ScaryMommy website, a self-proclaimed source of \"entertainment and information for millennial moms online.\" The post included editorialized phrasing, such as:", "\"They just hate immigrants, and now, by default, American citizens who associate with them,\" the Scary Mommy post read, referring to the federal administration under U.S. President Donald Trump. \"The government is leaving those people (and their families) out of help, and it’s heartbreaking.\"", "A rush of tweets, some lacking important context, followed. Among sharers of the LA Times story was U.S. Sen. Claire Celsi, a Democrat from Iowa, who said on Twitter:", "Responding to her tweet, however, one user wrote: \"I'm an immigrant. My wife is a US citizen. We got $2,400 as a direct deposit on April 15th. This is no less misleading than posting 'immigrants commit crimes.' It's technically true, but there is no causal link.\"", "Cue this fact check on who is and isn't eligible for the stimulus checks, called “Economic Impact Payments,” based on 2019 or 2018 tax returns. For those who are eligible, the CARES Act authorized the federal government to send:", "Additionally, for single tax filers with higher annual salaries — but less than $99,000 — the federal government is reducing the payments by $5 for each $100 above the $75,000 threshold (similar math goes for payments to families).", "But to qualify, a recipient must be a \"U.S. citizen, permanent resident or qualifying resident alien\" under guidelines established by the Internal Revenue Service. The latter two categorizations cover foreign-born residents who have obtained green cards to prove their legal status to work and live in the country and Social Security Numbers (SSN). The provision in the CARES Act outlining the payments states:", "That means immigrants who do not have legal status are excluded from the stimulus payments, even if they have work visas or use an Individual Taxpayer Identification Number (which the IRS issues to workers without SSN) to pay annual taxes. Additionally, if they file joint tax returns with their spouses, both parties are ineligible for the checks; the CARES Act's provisions require both parties on a couple's return to have SSN and will not accept joint returns with one or more Individual Taxpayer ID numbers. (Different standards apply to military couples, however: \"If either spouse is a member of the U.S. Armed Forces at any time during the taxable year, then only one spouse needs to have a valid SSN,\" according to the IRS.)", "According to the Migration Policy Institute, a nonpartisan research center, roughly 1.2 million immigrants without green cards are married to a U.S. citizen. Of that amount, the spouses who are U.S. citizens and filed single tax returns — regardless of their partner's immigration status — qualify to receive an individualized payment amount based on their income.", "Given that significant caveat, as well as the fact that immigrants with green cards are eligible for the checks, we rate this claim a \"Mixture\" of true and false — U.S. citizens who filed joint tax returns with spouses who are immigrants without Social Security Numbers won't receive the payments, but spouses to immigrants with legal status will.", "H.R.748 — CARES Act.   “All Actions H.R.748 — 116th Congress (2019-2020)”.\r\n   Congress.gov.   Accessed 20 April 2020.", "Marfice, Christina.   \"U.S. Citizens Married To Immigrants Are Blocked From Getting Stimulus Checks\".\r\n   Yahoo!life.   22 April 2020.", "Marfice, Christina.   \"U.S. Citizens Married To Immigrants Are Blocked From Getting Stimulus Checks\".\r\n   ScaryMommy.   22 April 2020.", "Jarvie, Jenny.   \"These U.S. citizens won't get coronavirus stimulus checks — because their spouses are immigrants\".\r\n   Los Angeles Times.   20 April 2020.", "Internal Revenue Service.   \"Economic Impact Payment Information Center\".\r\n   Accessed 24 April 2020.", "Migration Policy Institute.   \"Profile of the Unauthorized Population: United States\".\r\n   Accessed 24 April 2020.", "Jessica Lee is Snopes' Senior Assignments Editor with expertise in investigative storytelling, media literacy advocacy and digital audience engagement.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]