["About this rating", "In February 2017, a video was widely circulated online purportedly showing a woman named Acesha Bright committing a murder.  As depicted in the video, Bright enters a residence unannounced, finds her partner taking a bath with another man, and hurls a plugged-in electrical appliance into the tub, presumably electrocuting him:", "Social media viewers pointed to an arrest report for an \"Acesha A. Bright\" as evidence that the video depicted a real murder:", "Although a woman named Acesha Bright was arrested on 11 February 2017 for murder, she is not the woman seen in this video:", "In addition to the optical differences, the viral video contains a clue that the event it depicts was staged.  The video contains a watermark for \"Dominic Low,\" who has posted several realistic videos to Facebook, many of which feature women getting revenge on unfaithful lovers. The same woman (wearing the same dress) is featured in at least one other of these videos:", "In addition to using the same actress, Low also employed the same location in a prior video (notice the painting on the wall that appears in both):", "Furthermore, the earliest version of the viral video purportedly showing Acesha Bright's homicide was posted along with a caption stating that it occurred on Valentine's Day (\"Fried Ass and a glass of Wine...Hell of a Vday !!! credit Dominic Low\"), three days after the real Bright's arrest on 11 February 2017.", "The original postings of the video also did not identify the scornful woman who fried her love as Acesha Bright (or anyone else). While we have not been able to positively identify the woman in the videos, social media users have pointed to \"Opal Culton,\" an actress from Las Vegas who is also Facebook friends with Dominic Low.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]