["About this rating", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "In late March and early April 2020, a hoax spread globally via text message, social media posts, and direct messaging that warned people, \"As of tomorrow, do not leave home for bread for anything, because the worst begins,\" regarding the ongoing COVID-19 coronavirus disease pandemic.", "The wording of the hoax varied slightly depending on where in the world it was being shared, but for the most part the text claimed that its advice was sourced from a \"worker\" with the United Kingdom's National Health Service (NHS).\n\nIn some versions the opening line read: \"Warning for all citizens.\"\n\nOne Snopes reader reported seeing a version that claimed to come from the University of California, Davis.", "All of these text warnings should be met with skepticism.", "When slightly different versions of the same post are attributed to different sources, it's usually a hint that a rumor has evolved as it was passed from user to user. (We've fact-checked many throughout the COVID-19 pandemic so far.)", "But other details led us to doubt the veracity of this message.", "First, the message claims \"the peak\" of novel coronavirus infections will hit between March 27 and April 7, but there is no such universal peak date reported. Various regions are estimated to experience peak caseload at different times, depending on a number of factors, such as when outbreaks in the area first manifested and whether social-distancing measures were in place.", "Second, public health leaders worldwide, including the NHS, have instructed people to stay at home and practice social distancing in order to slow the spread of the deadly coronavirus. If you or someone you live with have symptoms, the NHS says you should self-isolate and not leave your home, even to buy food. However, for everyone else, they advise that essential trips out of the home should be kept to a minimum.", "All of the National Health Service's advice for coping with the COVID-19 pandemic can be found here.", "This isn't the first time a viral hoax exploited public fears over COVID-19 and falsely warned that it might soon be impossible to leave one's home even to purchase basic necessities.", "Glanz, James, et al. \"Where America Didn’t Stay Home Even as the Virus Spread.\"\r\n  The New York Times. 2 April 2020.", "Glanz, James, et al. \"Coronavirus Could Overwhelm U.S. Without Urgent Action, Estimates Say.\"\r\n  The New York Times. 20 March 2020.", "National Health Service. \"Advice for Everyone.\"", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]