["About this rating", "On Feb. 3, 2021, a video appearing to show a large section of Britain's White Cliffs of Dover break off and fall into the English Channel went viral.", "The footage, confirmed by several news reports, is real. The photographer, David Waterfield, was walking at the Samphire Hoe nature reserve and later described the impressive moment to the British outlet ITV:", "David Waterfield had ... stopped to take pictures of his dog when there was \"a loud bang\" followed by \"a large amount of cliff\" breaking off into the water. …", "\"I've lived down this neck of the woods for nearly all of my life, right next to the most famous cliffs in the world. You hear about it, you see the remnants of [cliff falls], but to actually see it in person it was really quite impressive.\"", "Mr Waterfield captured the entire fall on his phone -- but said getting it on film was \"sheer beginners luck.\"", "According to Voice of America, the section of cliff fell after weeks of heavy rain and winds that potentially weakened the cliffs. While it may take luck to witness such an event on human time scales, on geologic time scales such occurrences are to be expected. Steep sea cliffs like the White Cliffs of Dover are constantly subject to erosion through myriad processes.", "Scientists estimate that the erosion of the cliffs has sped up in the past 150 years, from a rate of about 2 to 6 centimeters per year to a current range of 22 to 32 centimeters per year. The authors of the 2016 study that came up with that rate suggested the increased erosion \"is the result of thinning of cliff-front beaches, exacerbated by regional storminess and anthropogenic modification of the coast.\" This erosion does not need to occur in small, centimeter chunks. Sometimes these averages are driven by a large loss of material shed in dramatic and rare (on human time scales) events like the one captured by Waterfeield.", "Because the footage is reported to be authentic and is scientifically consistent with the geomorphological processes at places like the White Cliffs, we rate this claim \"True.\"", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]