["“Every party informed that petrol-diesel prices have risen. But why is it that only the Bharatiya Janata Party (BJP) informed that the population of Rohingyas and Bangladeshis in India has increased to 11 crores? (पेट्रोल-डीजल बढ़ा सभी पार्टी ने बताया लेकिन रोहिंग्या एवम् बांग्लादेशी भारत में 11 करोड़ हो गये, सिर्फ BJP ने बताया, क्यों?)—read a tweet by @GAURAVBJP4INDIA who is followed by BJP Delhi leader Kapil Mishra.", "The same message is viral on Twitter. It is also widely circulating on Facebook.", "This slideshow requires JavaScript.", "“Petrol-diesel prices have risen a little and all opposition parties are protesting. Rohingyas have increased to 11 crores but everyone is quiet,” read a post shared by Facebook page I Support Narendra Modi shared on September 10, 2018. It had been liked over 28,000 times and shared over 21,000 times before it was taken down. I Support Narendra Modi has over 1.5 crore followers and is run by Vikas Pandey whose social media presence is evidence of his closeness with several BJP leaders including PM Modi.", "The viral claim was initially circulated by a Facebook page that goes by the name Social Tamasha. At the time of writing this article, its share count was 3,000.", "रोहिंग्या पर सब चुप है, आखिर क्यों ?", "Posted by Social Tamasha on Saturday, 8 September 2018", "Facebook pages and groups – I Support Zee News, Rohit Sardana and Sudhir Chaudhary Fan Club, भा.ज.पा : Mission 2019, BJP Social Media, NAMO Again In 2019 में अपने 100 मित्रों को जोड़ें, Vote 4 BJP and several others – also made the assertion but left out the word “Rohingya”. They implied that eight crore “Bangladeshis” are currently residing in India. Their posts have a combined share count of nearly 11,000.", "There are two assertions that need to be authenticated here—first, there 11 crore Rohingyas residing in India and second, eight crore Rohingyas and Bangladeshis currently refuged in the country.", "Rohingyas", "The Rohingyas are an Indo-Aryan population concentrated mainly in the Rakhine state of Myanmar. Rohingyas, who are majorly Muslims in a Buddhist majority country, face persecution in their own land. Their statelessness has forced them to flee to neighbouring countries of Bangladesh and India.", "According to a 2017 report by The Indian Express, which was republished by United Nations High Commissioner for Refugees (UNHCR), approximately 14,000 Rohingya refugees in India are spread across six locations—Jammu, Nuh in Haryana’s Mewat district, Delhi, Hyderabad, Jaipur and Chennai—and 11,000 of them have been given Refugee Status certificates by the Indian government.", "Later in 2017, Union Minister of State for Home Affairs Kiren Rijju informed the Parliament that the Rohingya population in India was 40,000 and that the country would make efforts to deport them all. He had further added that this number also included the 16,000 Rohingyas who were registered with the UN as refugees.", "Last year in January, the Indian government deported a Rohingya family of five to Myanmar where they will “most certainly face human rights violation and imprisonment”, reported Al Jazeera. The UNHRC had sought a clarification from India over the deportation of Rohingyas. In October 2018, seven Rohingya men were forcibly repatriated from the country.", "While the exact number of Rohingya migrants in India is difficult to ascertain, the figure cannot be as high as 11 crores as Myanmar itself has a total population of around 5.3 crores and its internally displaced Rohingya population is around 10 lakh.", "Moreover, Border Security Force (BSF) director-general K.K. Sharma, said earlier in September 2018 that there has not been any “large-scale influx of Myanmar-based migrants into India” in recent times.", "Bangladeshis", "After Bangladesh’s 1971 war for independence, millions of Bengalis tried to escape persecution by the Pakistani army. An article published in The New York Times in 1971 said that tens and thousands of Bangladeshi people, most of whom were Hindus, migrated to India. Back then, the Indian government estimated the influx to be around six to seven million.", "“With no real data available for the numbers, politicians in India still insist that illegal immigrants from Bangladesh are taking away their jobs,” according to a report in BBC from February 2020. In 2004, then Minister of State for Home Affairs Sriprakash Jaiswal claimed in the parliament that there were 12 million illegal Bangladeshis in India. He later retracted his comments. In 2016, the then Minister of State for Home Affairs Kiren Rijiju asserted that India houses 20 million illegal Bangladeshi immigrants. However, he did not provide any source.", "According to the 2020 International Migration Report released by the United Nations, Bangladesh had the largest number of stateless persons in the world which is approximately 906,000. Therefore, the number of refugees in India cannot be in crores.", "As part of border security talks between India and Bangladesh in September 2018, a delegation of Border Guard Bangladesh (BGB) said that the country has not intercepted crossers in recent times. “There is no large-scale infiltration or migration of people from Bangladesh into India as residents of that country now enjoy a very good life and the few who cross-over do so due to old cultural and family ties,” said BGB delegate Maj Gen Md Shafeenul Islam, as reported by Livemint.", "Total number of refugees from all countries residing in India", "The UN International Migration Report from 2017 stated that the total number of refugees from all countries residing in India is 5.2 million (52 lakh). This takes into account anyone living in a country different from their own, including refugees and economic migrants.", "This figure has not undergone a drastic change as per the 2020 UN report. In fact, India has the most number of migrants living abroad.", "It is noteworthy that the Indian government excluded 19 lakh people from Assam’s final list of citizens, most of whom were Muslims. While the Chief Minister assured that these people would be given a fair chance to prove their citizenship, popular sentiment regarded them as “illegal” Bangladeshi migrants. The government is yet to ascertain the identity of these people who are, as of now, not illegal.", "Suffice to say, posts suggesting that India has 8-11 crore Rohingya and/or Bangladeshi refugees are unsubstantiated. Moreover, it is ludicrous to ascertain that nearly 9% of the Indian population are illegal migrants.", "Misinformation regarding refugees in India is commonplace on social media. Their numbers are often inflated to generate panic and fear-mongering. With unverified figures floating across portals, it is pertinent to be aware of the number of migrants seeking asylum in the country. In the age of the internet, hard knowledge often takes a backseat by rumours and half-baked information which are twisted to suit a motivated narrative.", "[This article was updated on September 9, 2020.]", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]