["About this rating", "Despite the fact that film actor Pierce Brosnan was alive, online advertisers paid to display advertisements that claimed his \"final net worth left his family in tears.\" The ads appeared like this:", "The misleading advertisements had displayed on websites since at least 2018. It was unclear how long advertisers paid for the ads to run.", "Readers who clicked the Pierce Brosnan ads were led to a seemingly endless slideshow story with the headline: \"The Net Worth Of These Celebrities Will Blow You Away.\" Readers who clicked \"Next Page\" dozens of times discovered by the end that Brosnan didn't even appear in the story.", "This is referred to as advertising \"arbitrage.\" The goal in \"arbitrage\" is to make more money on ads displayed on the many pages in the \"net worth\" slideshow story than it cost to place the initial \"left his family in tears\" ad in the first place.", "In 2019, YouTuber Simon Whistler published a video about the \"Pierce Brosnan's Net Worth Left His Family in Tears\" advertisements, featuring it in his \"Bullshit Report.\"", "In the video, he noted that the late actor Robin Williams had also been the subject of similar ads:", "Pierce Brosnan wasn't even in this list. Robin Williams at least was in the list. Pierce Brosnan's just not in there. We don't even know what he's worth, but apparently it left his family in tears. It didn't. I bet he's also worth an absolute ton of money. $18 million. I'm going to give this a bullshit score of \"fckng\" 100, because it's just not true.", "Brosnan was perhaps best known for his work as James Bond 007 in \"GoldenEye,\" as well as \"Mamma Mia!\" and \"Mrs. Doubtfire.\" Also known for his work as 007 was Sean Connery, whose name was also used in similar net worth online advertisements. We also previously reported on similar misleading ads for Jaleel White, Richard Gere, Chuck Norris, Clint Eastwood, and Alex Trebek.", "Snopes debunks a wide range of content, and online advertisements are no exception. Misleading ads often lead to obscure websites that host lengthy slideshow articles with lots of pages. It's called advertising \"arbitrage.\" The advertiser's goal is to make more money on ads displayed on the slideshow's pages than it cost to show the initial ad that lured them to it. Feel free to submit ads to us, and be sure to include a screenshot of the ad and the link to where the ad leads.", "Jordan Liles is a Senior Reporter who has been with Snopes since 2016.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]