["About this rating", "Thomas Edison was described by educators as “addled” and spent only a few months in a formal classroom before being taken out of school and educated by his mother.", "Edison's mother received no such letter, and no evidence supports the claim that she lied to her son about his performance in the classroom to protect his feelings.", "Renowned American inventor Thomas Edison was famously homeschooled by his mother, who was a teacher by training. Young Edison's troubles with a formal classroom setting, as well as his affection for his mother are well documented.", "Edison's early life is succinctly described in the National Park Service's biography of him:", "Thomas Alva Edison was born on February 11, 1847 in Milan, Ohio; the seventh and last child of Samuel and Nancy Edison. When Edison was seven his family moved to Port Huron, Michigan. Edison lived here until he struck out on his own at the age of sixteen. Edison had very little formal education as a child, attending school only for a few months. He was taught reading, writing, and arithmetic by his mother, but was always a very curious child and taught himself much by reading on his own. This belief in self-improvement remained throughout his life.", "According to a U.S. Library of Congress biography of Edison, he was indeed labeled \"addled\" by a school administrator, an event that led his mother to remove him from school, but this information was not conveyed to her in a letter nor was it hidden by her from young Thomas:", "Edison was a poor student. When a schoolmaster called Edison \"addled,\" his furious mother took him out of the school and proceeded to teach him at home. Edison said many years later, \"My mother was the making of me. She was so true, so sure of me, and I felt I had someone to live for, someone I must not disappoint.\" At an early age, he showed a fascination for mechanical things and for chemical experiments.", "Based on fictitious combinations of various actual slivers of truth, a number of heartwarming tales about the decision to homeschool Edison and his ability to overcome early educational struggles have been spun for a century. On November 19, 2016, the Facebook page \"Love What Really Matters\" became the latest to follow in that tradition, posting a video based on the text from a >reddit post. The video's script reads as follows:", "One day, as a small child, Thomas Edison came home from school and gave a paper to his mother. He said to her \"Mom, my teacher gave this paper to me and told me only you are to read it. What does it say?\"", "Her eyes welled with tears as she read the letter out loud to her child ...", "\"Your son is a genius. This school is too small for him and doesn't have good enough teachers to train him. Please teach him yourself.\"", "Many years after Edison's mother had died, he became one of the greatest inventors of the century.", "One day he was going through a closet and he found the folded letter that his old teacher wrote his Mother that day. He opened it ...", "The message written on the letter was \"Your son is mentally deficient. We cannot let him attend our school anymore. He is expelled.\"", "Edison became emotional reading it and then wrote in his diary:", "\"Thomas A. Edison was a mentally deficient child whose mother turned him into the genius of the Century.\"", "A positive word of encouragement can help change anyone's destiny.", "The veracity of this version of events, however, is belied by the actual account given by Thomas Edison himself in a rare interview to a long-extinct newspaper and literary journal called T.P's Weekly published on 29 November 1907. This interview is the earliest documented account of Edison's leaving formal schooling and is therefore likely to be the source of the historical fiction regarding his early education:", "One day I overheard the teacher tell the inspector that I was \"addled\" and it would not be worthwhile keeping me in school any longer. I was so hurt by this last straw that I burst out crying and went home and told my mother about it. Then I found out what a good thing a good mother is. She came out as my strong defender. Mother love was aroused, mother pride wounded to the quick. She brought me back to the school and angrily told the teacher that he didn't know what he was talking about, that I had more brains than he himself, and a lot more talk like that. In fact, she was the most enthusiastic champion a boy ever had, and I determined right then that I would be worthy of her and show her that her confidence was not misplaced.", "As Edison's first-person account stated, no letter to his mother was involved in these events, and Edison was never kept out of the loop for the sake of sparing his already hurt feelings. One of the most prolific and ingenious inventors of all time, Thomas Edison would be homeschooled until he set out on his own at the age of sixteen, openly grateful for his mother's support and education throughout his life.", "nps.gov.   \"Edison Biography; National Historical Park New Jersey.\"\r\n    Accessed 1 December 2016.", "Library of Congress.   \"Inventing Entertainment: The Early Motion Pictures and Sound Recordings of the Edison Companies.\"\r\n    Accessed 1 December 2016.", "T.P.’s Weekly.   \"The Wizard of Electricity.\"\r\n    29 November 1907   (p. 695).", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]