["About this rating", "racist with little understanding of the world outside the USA — we have a current example: a claim that Bush asked of Brazilian president Fernando Henrique Cardoso, \"Do you have blacks, too?\", before his national security advisor helpfully stepped in to bail him out of an extremely embarrassing situation:", "Example:[Der Spiegel, 2001]", "It was Condoleezza Rice, national security advisor, who helped her boss out of the embarassing situation. During a conversation between the two presidents, George W. Bush, 55, (USA) and Fernando Henrique Cardoso, 71, (Brazil), Bush bewildered his colleague with the question \"Do you have blacks, too?\"Rice, 47, noticing how astonished the Brazilian was, saved the day by telling Bush \"Mr. President, Brazil probably has more blacks than the USA. Some say it's the Country with the most blacks outside Africa.\" Later, the Brazilian president Cardoso said: regarding Latin America, Bush was still in his \"learning phase\".", "This item originated with an article entitled \"An Overwhelming Ignorance\" published in the Brazilian newspaper Estado de Sao Paulo on 28 April 2002, and it gained wider prominence after it was picked up in the 19 May 2002 issue of the German news magazine Der Spiegel (an English translation is provided on gwbush.com).", "Is it true? Bush and Cardoso did meet in the Oval Office back in November 2001 to discuss terrorism-related issues (a meeting that was attended by national security advisor Condoleezza Rice), and they held a trade meeting at the White House on 30 March 2001. But this single-source item is woefully short of specifics, such as which meeting this quote supposedly came from, in what context Bush posed his question, or who reported what Bush purportedly asked. (Many readers have inferred that information about Bush's embarrassing question came from President Cardoso himself because this item has been coupled with Cardoso's statement about Bush's still being in a \"learning phase\" regarding Latin America, but Cardoso was not referring to this item when he made that statement.)", "Considering that this news wasn't reported until five to thirteen months after the event, we have to wonder whether the person reporting it was actually present for the occasion. (Indeed, the literal English text of Bush's question as printed in Estado de Sao Paulo — \"Do you have blacks, also?\" — bears the marks of non-English speakers who typically write 'also' where English speakers more commonly use 'too.') As it turns out, the Estado de Sao Paulo article was authored by Fernando Pedreira, and as the Washington Post noted:", "Pedreira is very close to Cardoso, who had named him the country's ambassador to UNESCO. Meanwhile, Cardoso is said to have mentioned his chats with Bush while he was on a weekend with some close friends recently in Rio.", "This items sounds like, at best, a second-hand account recounted months after the fact, one which to many seems a little too perfectly ironic in that, of all the people present at the meeting, it has Condoleezza Rice intervening and fixing up Bush's embarrassing inquiry (a black woman with superior knowledge coming to the aid of a \"racist\" white man in trouble). It's also more than a bit reminiscent of a joke told about Vice-President Dan Quayle in 1989: that Quayle said, \"I was recently on a tour of Latin America, and the only regret I have was that I didn't study Latin harder in school so I could converse with those people.\" (The essence of the joke was soon put into Quayle's mouth when it quickly mutated into a claim that he actually had said those words, and the joke has been widely cited as a \"real\" quote ever since).", "Of course, it's also possible that Bush did speak the words attributed to him but that he intended them to carry a different meaning than the commonly-assumed one (especially since Bush is not known for being a particularly good extemporaneous speaker, and the situation was likely complicated by the fact that most of his audience was probably not native English-speaking). He might have meant, for example: \"Do you have [problems with racism involving] blacks [in Brazil], too?\" (That may be a bit of a stretch, but the point is to illustrate that short quotes offered out of context can often be presented in a way that implies a meaning quite different than the intended one.)", "So, what this issues boils down to is a non-specific, single-source item, one which the Washington Post has the White House dismissing as \"total crap.\" Lacking anything more to go by, we have to leave this one in the \"undetermined\" column.", "Pedreira, Fernando.   \"A Retumbante Ignorância.\"\r\n    Estado de S. Paulo.   28 April 2002.", "The Washington Post.   \"What Did He Say and When Did He Say It?\"\r\n    5 June 2002.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]