["About this rating", "The treatment of military veterans in wider society is a common source of concern (and sometimes outrage) in the United States, particularly on social networks — where news stories, anecdotes, and memes describing unfair or disrespectful treatment of veterans provoke sympathy and anger and often spread widely.", "On 10 August 2018, the Facebook page for the \"America's Last Line of Defense\" website, a notorious producer of fake content, posted a meme which featured a fabricated case of this sort, proclaiming that \"HOMELESS MEDAL OF HONOR WINNER, DUANE DEVANE WAS HIT BY A CAR AND WAS TAKEN TO AN ATLANTA HOSPITAL. HE WAS NOT TREATED AND WAS DRAGGED OUT BECAUSE HE LACKED INSURANCE. HE DIED LATER THAT NIGHT\":", "In reality, the man shown in the photograph within the meme is Billy Ray Harris, who was the subject of news reports throughout the world in 2013 after a woman named Sarah Darling accidentally dropped her diamond engagement ring into a cup being held by Harris, who was homeless at the time and living on the streets of Kansas City, Missouri.", "Although Harris considered pawning the ring, he did not and instead returned it to Darling a few days later. In response, Darling and her fiancé set up an online crowd-funder for Harris, which raised in excess of $190,000 and allowed him to buy a house and a car:", "﻿", "No-one by the name of \"Duane Devane\" has ever received the Medal of Honor, according to a list published by the the U.S. Army Center of Military History. In fact, \"Duane DeVane\" is the name of a character from the 2006 video game \"Grand Theft Auto: Vice City Stories.\"", "Despite being fabricated, the \"Duane Devane\" meme still misled some Facebook users who came across it, as the many earnest criticisms and comments under the original post made clear.", "\"America's Last Line of Defense\" is a junk news site that publishes false information to engage in political trolling, under the guise of proffering \"satire.\"", "Usborne, David.   \"Luck Changes for Billy Ray Harris, The Homeless Man Who Returned an Engagement Ring Dropped Into His Beggar's Cup.\"\r\n     The Independent.   25 March 2013.", "Marcus, Lilit.   \"Man Who Returned Ring No Longer Homeless: 'I Feel Human Now.'\"\r\n    Today.   14 October 2016.", "U.S. Army Center of Military History.  \"Medal of Honor Recipients.\"\r\n  U.S. Army Center of Military History.  12 June 2018.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]