["The photo was published in this Facebook post by a Pakistan-based Facebook page on December 24, 2019. It has been shared over 40 times.", "The post’s caption states: “A Soviet Red Army soldier breastfeed an orphaned German baby who lost the parents in World War 2.....”", "Below is a screenshot of the misleading Facebook post:", "The same photo was also shared hundreds of times after being published alongside similar claims on Facebook here and here.", "It was also shared on Twitter here.", "The claim is false; the picture was published here on 35PHOTO, a photography blog, in 2014 and was part of a photo series by Russian photographer Natalia Zakonova.", "The Russian-language caption translates to English as: “Dedicated to the 70th anniversary of the Great Victory! Natalya Zakonova. Russian Federation (Saint Petersburg).”", "Below is a screenshot of the photo published on the blog:", "The photo was uploaded on August 25, 2014, according to the page's timestamp.", "The image in the misleading posts was also debunked on Twitter here by Fake History Hunter.", "“Staged photo taken by photographer Natalia Zakonova in 2014, not 1944,\" the tweet reads. \"Not sure where the story comes from about the German orphan.\"", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]