["“Trudeau Bought His Mother A Car Using WE Charity Funds,” claims the headline of an article from August 8, 2020 shared on conservative-leaning Facebook groups as well as on Twitter.", "The body of the article itself is only four lines long, and specifies that the car was a red Mercedes S-class.", "According to the article and memes derived from it, Trudeau defended the purchase on Twitter by saying that “it was a business expense so that his mother could get to and from speaking events with a driver.”", "However, the article’s content is fabricated. The website that spread it, conservativemovement.ca, provides a link to an identical article from July 16, 2020 on Fried.news as a source.", "The Fried.news team claimed authorship of the story in an email, and directed AFP to this disclaimer page acknowledging that “All articles” contained on the website “and on its social media accounts, however similar to real events, are fictitious.“", "The prime minister’s office told AFP by email that the story was not true.", "A search for the words “it was a business expense” on Trudeau’s Twitter account shows no results. A keyword search for the quote attributed to Trudeau only shows results associated with the Fried.news article.", "Justin Trudeau’s mother, Margaret, was implicated in the so-called WE Scandal, but not because of a car.", "As Canadian parliamentarians and an ethics commissioner began to inspect the Trudeau family’s ties to WE Charity, an organization dedicated to youth education and international development, it emerged that Margaret Trudeau had allegedly been paid Can$250,000 for speeches at 28 events between 2016 and 2020.", "Fried.news is a roughly six-month-old website that, according to its “About” page, was created by “two friends” aiming “to expose hypocrisy on both sides of the aisle.”", "“We are proud Canadians,” it says. However, the Facebook page associated with the website is run by one person in Canada, and one in Italy.", "Only in a separate “Disclaimer” page does the website divulge its allegedly satirical purpose, although the tone and genre of its content makes this ambiguous to readers.", "The website that made the article become viral, conservativemovement.ca, was created in late-July 2020 by Ontario-based artist Ray Liyaga, according to a domain name search.", "Contacted by AFP, Liyaga did not wish to comment.", "The website mainly provides news praising the Conservative Party of Canada (CPC) or that is damaging to Justin Trudeau’s Liberal party. The site uses CPC’s official logo and colors.", "“This site is not associated with the Conservative Party, and we’ve been in touch with the administrator of the site to have our branding and logos removed,” CPC spokesperson Cory Hann told AFP by email.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]