["About this rating", "In February 2018 the right-wing blog Your News Wire published a story blaming California Gov. Jerry Brown for a forced exodus of sex offenders from his state's penal system.", "According to the story:", "Over 10,000 sex offenders including convicted pedophiles and rapists are set to be released to the streets in the near future thanks to Governor Jerry Brown and the ruling of a Superior Court Judge in Sacramento who say crimes such as \"intimately touching an unlawfully restrained person\" or \"raping a drugged or unconscious victim\" are not violent crimes.", "The story was based on a ruling by Sacramento County Superior Court Judge Allen Sumner on 8 February 2018 concerning the implications of Proposition 57, which was passed in a November 2016 vote.", "The measure — which Brown supported — went into effect on 1 July 2017, and allowed the bill, which went into effect on 1 July 2017, allowed for the California Department of Corrections and Rehabilitation (CDCR) to set parole consideration standards for certain non-violent offenders. However, inmates who were required to register as sex offenders, according to section 290 of the California Penal Code, are barred from being part of this process.", "Sumner issued a preliminary order to CDCR requiring the agency to implement a more stringent definition for \"nonviolent offenders.\" His decision hinged in part on a discrepancy between section 290 and section 667.5 of the same penal code, which covers non-violent offenses. He wrote:", "The [state] Legislature has listed rape of a drugged, intoxicated or unconscious victim, sex trafficking of a minor, and lewd acts with a child who is 14 or 15 as registrable sex offenses under section 290. But the Legislature has not listed these as \"violent\" felonies in section 667.5. It thus appears the opponents assumed the term \"nonviolent\" in Proposition 57 was defined by reference to the \"violent\" felonies listed in section 667.5. If so, it would not apply to registerable sex offenses not listed in section 667.5.", "Sumner also found that CDCR applied an \"overbroad\" standard because under its guidelines, prior registration as a sex offender would disqualify an inmate seeking a parole review for a conviction stemming from a non-violent offense such as tax evasion.", "The lawsuit challenging the measure was filed by Alliance for Constitutional Sex Offense Laws. The group's president, attorney Janice Bellucci, has said that Sumner's ruling could lead to 10,000 inmates becoming eligible to go through the process to gain an early parole.", "Contrary to the blog's story, a CDCR spokesperson told us that it does not anticipate any sex offenders being \"released to the streets\" any time soon. The agency spokesperson told us that it plans to appeal the decision:", "In the meantime, none of these offenders (as defined by PC 290, or sex offenders) will be released or even be considered for the nonviolent parole process under Proposition 57, and the regulations for Proposition 57 stand as they have been drafted.", "According to a CDCR release, 1,877 inmates were released in October 2017 after amassing credits for good conduct that were applied toward an early release date.", "Brown continued to support Prop 57 in a letter to the San Diego Union-Tribune, accusing the newspaper's editorial board of engaging in \"shameless fear-mongering\" following Sumner's ruling.", "\"Proposition 57 vests broad discretion in the secretary of corrections and the Parole Board to protect our community and fashion a rational system of punishment and rehabilitation,\" Brown wrote. \"This is a job for dedicated and experienced professionals, not cynical politicians. Yes, we can make our system better, and we will.\"", "California Department of Corrections and Rehabilitation. \"Proposition 57: The Public Safety and Rehabilitation Act of 2016 Frequently Asked Questions.\"", "Thompson, Dan. \"Judge: California Must Consider Early Parole for Sex Offenders.\"\r\n    Associated Press, accessed via kqed.org. 10 February 2018.", "San Diego Union-Tribune. \"Gov. Jerry Brown Defends Prop. 57, Rips 'Shameless Fear-Mongering.'\"\r\n13 February 2018.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]