["The article was published on pro-Biafran website Jamyco.com on April 3, 2020. It has since been shared more than 6,000 times in numerous Facebook posts, including this one, according to data provided by the social network.", "The online report, which is riddled with grammatical errors, is headlined: “Breaking: Atiku Abubakar Order his Bank to pay 10k to all Nigerians with BVN”. BVN refers to Bank Verification Number, a unique 11-digit identity assigned to bank customers in Nigeria.", "“He said this while answering questions from newsmen on his son’s health status, who tested positive to coronavirus,” the article claims.", "Atiku Abubakar - who served as Nigeria’s vice president from 1999 to 2007 - announced last month that one of his sons had tested positive for COVID-19. More than 370 people have tested positive for the disease in Nigeria as of April 14, 2020.", "The outbreak has prompted Africa's most populous country to lock down its largest city Lagos, neighbouring Ogun State and the capital Abuja.", "My son has tested positive to coronavirus. @NCDCGov has been duly informed, and he has been moved to Gwagwalada Specialist Teaching Hospital in Abuja for treatment and management. I will appreciate it if you have him in your prayers. Stay safe, coronavirus is real. -AA", "The article quotes Abubakar’s spokesman Paul Ibe as having allegedly said that banks would carry out the documentation of the poorest and most vulnerable Nigerians who have records of low income and then disburse money to them.", "Using the social media monitoring tool CrowdTangle, AFP found that the link to the viral article was widely shared on Facebook and Twitter. We’ve archived some of the posts here, here, and here.", "However, the claim is false. Ibe has dismissed both the allegation and the statement accredited to him. “This is fake news,” he told AFP in a Twitter message. “It is not the first time a contrived news report targeting the former Vice President is being published.”", "“His Excellency Atiku Abubakar never said anything like that. I did not speak to this media organisation. Indeed it is unknown to me.”", "The website Jamyco has a history of publishing falsehoods, some of which have been debunked by fact-checking organisations including Africa Check here and here.  No major Nigerian media reported on the purported payout, because Atiku did not make such an offer, neither was there any evidence to support the claim.", "However, Abubakar did pledge to donate 50 million naira ($130,000) to a coronavirus relief fund  in late March, while also calling on the government to distribute at least 10,000 naira to each Nigerian household.", "\"To this end, Priam Group pledges N50 million on my behalf as my humble contribution to a relief Fund that will form part of the stimulus package.\" https://t.co/uTjCt6DRID", "The relief payout allegation is among several similar false claims that have circulated on social media in Nigeria. AFP has debunked some here and here.", "More than half of the Nigeria's workforce are in the informal sector and largely depend on daily earnings. President Muhammadu Buhari has faced criticism that current lockdown support measures only target 3.6 million households of the 200-million-population in Africa’s largest economy.", "This means we will support an additional one million homes with our social investment programs.\n\n\t\tA technical committee is working on this and will submit a report to me by the end of this week.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]