["Accusations of voting machine malfunctions persist against manufacturer Dominion Voting Systems, despite audits of 2020 presidential election ballots that were processed through its machines that found no evidence of tampering.", "A claim posted to the Facebook page of Jeremy Herrell suggests Dominion Voting Systems' fraud capabilities are featured in the user manual for the machines. Herrell, whose stage name is \"The Hip Hop Patriot,\" is a musician and podcaster who supports President Donald Trump, according to a profile page on Anchor.fm.", "\"BREAKING! The Dominion Voting machines have the ability to create ballots!\" says the Dec. 12 post, which includes pages allegedly copied from the manual.", "The post also states Dominion Voting machines can be hacked and can count test ballots as legitimate results. Test ballots with votes for former Vice President Joe Biden could have been counted while entire batches of votes for Trump could have been purged, the claim states.", "\"Oh, and here is the link to their manual,\" the claim states. The link leads to a May 2019 version of the user guide for the Democracy Suite Image Cast Central, one of five machines manufactured by Dominion Voting.", "Herrell's post appears to recap a Dec. 12 article from Gateway Pundit, a far-right news and opinion website.", "The article — headlined \"BREAKING EXCLUSIVE: Dominion Voting Machines Have the Ability to Create Ballots!\" — contains a tweet from Kyle Becker, an independent journalist, according to his Twitter bio.", "\"More concerning information on Automated Test Decks that every knowledgeable voter should be familiar with,\" Becker tweeted. \"This information & assessments can be taken directly from reading the voting system company's own user's manuals. #FWIW\"", "Becker was retweeting a Nov. 10 post by Twitter user DataDude316, an open source intelligence investigator, according to a Twitter bio.", "\"IMPORTANT: This is not evidence of fraud. It is evidence of potential vulnerability. It is possible none of these features were used nefariously. There should be an audit though to make sure,\" DataDude316 warned in the tweet, which included several of the same questions as Herrell's post and the same user manual pages.", "USA TODAY reached out to Herrell and Gateway Pundit for comment.", "More:Fact check: Hugo Chávez's family does not own Dominion Voting Systems", "A spokesperson for Dominion Voting Systems told USA TODAY that ballots can be printed out by its Ballot Marking Devices after a voter makes selections and reviews them. Ballots also are created for auditing, the spokesperson said.", "The screenshots in the post describe Logic & Accuracy Testing operations that can be performed with the Democracy Suite voting machine model, which the spokesperson confirmed.", "Item No. 4 under the Logic & Accuracy Testing section of the manual — which is circled in the screenshots — describes the Automated Test Deck application: \"This application, available from Dominion Voting, can automatically generate the appropriate test decks and expected results totals.\"", "\"Using the election project database, a deck of vote-marked ballots is randomly generated to provide the highest assurance of system accuracy,\" according to the company's website.", "Regarding this testing phase for voting machines, the Dominion spokesperson said that prior to elections, machines are tested publicly, a process that is typically observed by representatives from political parties.", "There is no indication from the machine manual that test ballots are counted with regular ballots submitted on Election Day. In fact, the system is purged of test results once the testing phase is finished, complete with a \"zero report\" to confirm purging, according to instruction No. 10 in Logic & Accuracy Testing. Per instruction No. 12, the tested equipment then should be secured until Election Day. Both of these instructions were included as a screenshot in the above social media posts.", "\"Once the testing is complete, the equipment must be securely stored so that it is safe from unauthorized access or use,\" the manual states.", "More:Fact check: Dominion voting machines didn't delete votes from Trump, switch them to Biden", "So, test ballots could not have changed the ballot count for either candidate, nor did Dominion Voting machines delete official votes for Trump or switch votes to Biden, according to USA TODAY.", "Other circled items in the screenshots of manual pages are instructions for discarding a batch of ballots.", "\"In some cases, a user may want to discard a batch,\" the instructions read. \"An example of such a situation is when a batch is accidentally scanned twice, or when the quality of the batch is brought into question.\"", "Herrell's Facebook posts states batches of votes for Trump could have been discarded using this method.", "The allegation is similar to claims leveled against Dominion Voting Systems by Sidney Powell, a lawyer for the Trump campaign, according to a Dec. 17 demand letter sent to Powell from Dominion Voting's attorneys \"regarding her baseless and false accusations about the company.\"", "The letter included a statement Powell made during a Dec. 13 interview with The Epoch Times where she accused Dominion Voting of \"injecting massive quantities of votes\" into a made-up system and running counterfeit ballots through the system to increase the appearance of ballots for one candidate over another.", "Attorneys representing Dominion Voting have sent a notice to The Epoch Times, among other media outlets, with instructions to preserve all documents in its possession related to Dominion — including any communications with Powell — on Dec. 18.On Jan. 8, Dominion sued Powell for defamation.", "\"They trashed votes. They had this thing called an adjudication system, where they could program the computer — even by their own manual they explain this — they can program the computer to reject ballots for any number of reasons,\" Powell said, according to The Epoch Times.", "More:Fact check: False claim that electronic voting software companies Dominion and Smartmatic have closed", "During a Nov. 19 press conference, Powell made several unfounded claims against Dominion. They include voting manipulation, \"weighing\" votes in Biden's favor and disposing of Trump votes, according to the letter.", "Dominion Voting Systems has stated that allegations made by Powell are false.", "\"Despite repeated counts and audits, there is no evidence of any kind that any voting system deleted, lost, or changed votes in Georgia, or in any of the other 28 states that use Dominion devices,\" the company wrote. \"Certifications and audits have instead shown the accuracy, transparency, and reliability of Dominion's systems.\"", "John Poulos, president and CEO of Dominion Voting, denied any allegations of fraud on the part of his company in a Nov. 30 opinion piece in The Wall Street Journal.", "\"Dominion voting machines do one thing: accurately tabulate votes from county-verified voters using a durable paper ballot controlled and secured by local elections officials,\" Poulos wrote.", "Further, the 2020 election was deemed \"the most secure in American history,\" according to the Department of Homeland Security's Cybersecurity and Infrastructure Security Agency and the National Association of State Election Directors, USA TODAY reported.", "We rate the claim that Dominion Voting’s machine manuals outline fraud capabilities is PARTLY FALSE, based on our research. The claim does not address a litany of debunked accusations against the company or a caution from the original social media post that a Dominion Voting machine manual is not evidence of fraud. It is true that Dominion Voting machines create ballots, for testing, audits and after a voter has voted and approves the ballot creation. But assertions that machines can be hacked, votes were dumped and test ballots can be counted are false. The federal government and election experts discovered no election fraud on the part of Dominion Voting Systems or its voting machines.", "Contributing: The Associated Press", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]