["A claim posted to Facebook days after riots broke out at the U.S. Capitol building falsely stated that President Donald Trump invoked the Insurrection Act.", "\"The Insurrection Act has been signed, arrests are being made and everything we’ve talked about for months is happening. This is not a drill,\" the Jan. 10 post says.", "The poster does not elaborate on what had been \"talked about for months.\"", "The claim is one of many spreading in conservative social media circles that insist the president invoked the Insurrection Act after a melee at the Capitol building left five people dead.", "Thousands of Trump supporters protested a Jan. 6 special session in Congress to certify President-elect Joe Biden as the winner of the 2020 election. The riots at the Capitol happened shortly after a rally hosted by the president, USA TODAY reported.", "Dozens were arrested and charged with various offenses following the violence. More than 30 others have been arrested since Jan. 7, according to USA TODAY.", "In a video posted to BitChute on Jan. 10 and shared on Facebook, user \"wil paranormal\" said that Trump signed the Insurrection Act ahead of Congress' intent to hold a second impeachment vote. USA TODAY reported the president was impeached in the House on Jan. 13.", "BitChute, a video hosting service, has become \"a recruiting ground for extremists,\" according to the Anti-Defamation League. The site was launched in 2017 by Ray Vahey, The Washington Times reported in 2019.", "USA TODAY reached out to the Facebook poster for comment.", "The Insurrection Act of 1807 authorizes the president to dispatch the military or federalize the National Guard in states that cannot control insurrections or defy federal law, according to USA TODAY.", "More:Fact check: National Guard was activated most often during the Civil Rights Era", "Invocation of the act is reserved for when \"things are really bad,\" William Banks, a Syracuse University College of Law Board of Advisors Distinguished Professor, told USA TODAY.", "The act is an \"exception\" to the background principle that the military may not be involved in civilian affairs. It involves a public proclamation, not a clandestine signing, according to Banks.", "There are no proclamations referencing the Insurrection Act dated after Jan. 6 on the official White House website.", "The act was used most often during the civil rights era to protect Black schoolchildren during desegregation and subdue riots. President George H.W. Bush was the last president to invoke the act during the Los Angeles riots sparked by the 1992 acquittal of four police officers who beat Rodney King.", "Trump considered invoking the Insurrection Act last summer to help quell nationwide protests in the wake of George Floyd's death in Minneapolis police custody, according to USA TODAY.", "More:Fact check: Trump sent federal officers to cities without approval from locals", "Days before the riots, lawmakers were briefed on the possibility that the president might invoke the act in the event of violence amid peaceful demonstrations on Jan. 6, according to a Jan. 10 BuzzFeed News report.", "Phil Mendelson, chair of the District of Columbia city council, said the council had \"every reason to suspect there would be some sort of trouble.\"", "“Our concern was that it would be fomented by the president who would say: ‘Look, there’s rioting and chaos — we need to take over the police department and bring in the National Guard,’” Mendelson said, according to BuzzFeed.", "More:Fact check: Pelosi's conference room laptop was not taken by Special Forces during Capitol riot", "Despite concerns from D.C. officials, Banks and Thaddeus Hoffmeister, a law professor at the University of Dayton, told USA TODAY that there was no need for Trump to invoke the Insurrection Act during the events on Jan. 6 because the federal government controls federal police forces as well as D.C.'s National Guard.", "However, House and Senate officials turned down former Capitol Police Chief Steven Sund's request that the National Guard be placed on standby, according to USA TODAY.", "Trump ultimately did not to invoke the act on Jan. 6.", "On Jan. 7, the president publicly acknowledged the beginning of a new administration on Jan. 20 and vowed to focus on a \"smooth, orderly and seamless transition of power,\" USA TODAY reported.", "\"Tempers must be cooled and calm restored,” Trump said.", "We rate this claim FALSE, based on our research. Trump has not invoked the Insurrection Act, despite claims on social media saying he would do as much. In a public statement, the president said he will focus on a smooth transition of power to the Biden administration.", "Contributing: The Associated Press", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook."]