["By Saranac Hale Spencer", "Posted on June 8, 2020", "Video clips of President Donald Trump pretending to choke while saying “I can’t breathe” have been circulating with the misleading suggestion that he was mocking George Floyd. The videos pre-date Floyd’s death and show the president mocking his political rivals — not Floyd.", "President Donald Trump has said of several political rivals that they “choked.” He then puts his hand to his throat and says, “I can’t breathe, I can’t breathe.”", "He’s done this at rallies since 2016, referencing Mitt Romney, Michael Bloomberg (twice), and Amy Klobuchar.", "But after George Floyd died in Minneapolis police custody May 25 saying, “I can’t breathe,” video clips of the president making this statement have been spreading on social media.", "Some versions neglect to include the date of the video clip or explain the context, while others more overtly imply that Trump is referring to George Floyd.", "None of the clips show the president talking about Floyd.", "Most of them show a Feb. 20 rally in Colorado Springs, Colorado, which took place the night after a Democratic primary debate. At one point, Trump said of former New York City Mayor Michael Bloomberg, “Look, Bloomberg made a fool out of himself last night. He choked. He’s another one, he’s going, ‘I can’t breathe, I can’t breathe.'”", "But the only part of the video that is shown in the clips is when the president says, “I can’t breathe, I can’t breathe,” and feigns choking.", "The words, “I can’t breathe,” have been a rallying cry at protests against police brutality since Eric Garner said them before dying in police custody in New York City in 2014.", "And Trump’s use of the phrase has been noted before.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "Factbase Video. “Speech: Donald Trump in Rome, NY – April 12, 2016.” YouTube. 12 Apr 2016.", "President Trump Campaign Rally in Colorado Springs, Colorado. C-SPAN. 20 Feb 2020.", "President Trump Campaign Rally in Las Vegas. C-SPAN. 21 Feb 2020.", "Lore, Diane. “Trump invokes Eric Garner’s last words in criticism of Mitt Romney.” SILive.com. 13 Apr 2016.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]