["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A Border Patrol agent at the fence along the border between the United States and Mexico on the outskirts of Nogales, Ariz., on Sept. 22, 2016. (Tomas Munita/New York Times)", "President Donald Trump says the country is continuing to make \"historic progress\" to curb the flow of illegal immigration along the southern border.", "\"We inherited a full-fledged border crisis. It was a disaster,\" Trump said in his weekly radio address April 7. \"Yet, with quick and bold steps, we have so far exceeded even the most bullish predictions for the progress we could make in so short a period of time. Last month, we saw a 64 percent reduction in illegal immigration on our southern border.\"", "It wasn’t the first time Trump claimed he inherited a mess, or that he’s turned things around at the border. He’s recently emphasized statistics to show decreases in illegal immigration. In March, he said illegal immigration was down 61 percent since Election Day (Mostly True) and down 40 percent since his first month in office (Mostly True).", "Is Trump’s story getting even better?", "What we found is that Trump is changing how he's doing the counting in a way that emphasizes progress.", "The ‘64 percent reduction’", "To get to the 64 percent reduction, Trump isn’t looking at the decrease from February 2017 to March 2017, as he did when he talked about the decrease between January and February.", "Instead, he’s looking at the year-over-year reduction (March 2016 vs. March 2017), the White House told us.", "U.S. Customs and Border Protection data show that in March 2017 border patrol made 12,193 apprehensions at the southwest border. In March 2016, there were 33,316 apprehensions. That’s a 63.4 percent decrease year-over-year. Add in people who were deemed inadmissable to the country and you reach 64 percent.", "But if you looked at the decrease from February 2017 to March 2017, as Trump did last month, the drop would not have been as dramatic.", "From February 2017 to March 2017, border patrol apprehensions dropped about 35 percent, not 64 percent.", "Point being, Trump picked the number that showed the biggest decrease, when last month he calculated the figure a different way. Importantly, a listener to Trump's weekly radio address would have no way of knowing Trump changed his measuring stick.", "Aside from the specific numbers, Trump’s rhetoric and tough immigration stance can be credited for the decreases, experts have told us. But they caution against making early conclusions about the effect Trump’s policies have had. Changes on the ground usually take longer to materialize, experts said.", "Oh, Canada?", "While data backs Trump’s claim of decreases at the U.S.-Mexico border, the northern border has actually seen an increase in illegal immigration.", "\"As we increasingly secure the southern border, won't that put more pressure on the northern border and other ports of entry?\" Sen. John Hoeven, R-N.D., asked John Kelly, Department of Homeland Security secretary, during an April 5 Senate committee hearing on border security and public safety.", "Kelly said security concerns were not at the same level in the northern border as they are in the southern border. But that sector also needs attention, he said.", "\"We obviously need to watch it, one of the things the Canadians recently did was to allow ... Mexicans to travel to Canada without visas and we're seeing a little bit of increase in Mexicans coming illegally into the United States from the north,\" Kelly said.", "(Since Dec. 1, 2016 Mexicans do not need a visa to visit Canada.)", "In all fiscal year 2016, there were 2,283 border patrol apprehensions at the northern border, compared to 408,870 at the southern border.", "Our ruling", "Trump said, \"Last month, we saw a 64 percent reduction in illegal immigration on our southern border.\"", "It depends on how you define last month.", "The White House said Trump was speaking about year-over-year changes, from March 2016 to March 2017. Border patrol apprehensions declined 63.4 percent during that time.", "But if you looked at the decrease from February 2017 to March 2017, as Trump did just a month earlier, the decrease was about 35 percent.", "That difference would be lost on a listener. We rate Trump’s statement Half True.", "The White House, President Donald J. Trump’s Weekly Address, April 7, 2017", "U.S. Customs and Border Protection, Southwest Border Migration, last pusblished April 5, 2017", "U.S. Customs and Border Protection, Border patrol apprehension data FY2010-2016", "Department of Homeland Security, Executive Orders on Protecting the Homeland, implementation memos, Feb. 20, 2017", "CQ, Transcript: Senate Homeland Security and Governmental Affairs Committee Holds Hearing on Border Security and Public Safety, April 5, 2017", "Justin Trudeau, Canada's Prime Minister's website, Canada to lift visa requirements for Mexico, June 28, 2016", "PolitiFact, Did Donald Trump inherit 'a mess' from Barack Obama?, Feb. 17, 2017", "PolitiFact, Trump says illegal immigration at southern border is down 61 percent since Election Day, March 22, 2017", "PolitiFact, Donald Trump trumpets 40 percent decrease in illegal border crossings. Is he right?, March 14, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]