["A WhatsApp message has gone viral. It claims that 52 cases have been registered by Dadar cybercrime police against WhatsApp group administrators for sharing misleading forwards. The message credits the information to “Ravi Nayak, principal secretary at the Ministry of Home Affairs.”", "The viral text reads, “Beware of the following reason. 52 group admins are now at dadar cyber crime police station. For having misleading fowards in the group. My old building group admins are seating there A case is being registered against every admin. U will get bail at police station but have to fight in criminal court with a jail term from 1 to 5 years. No explanation accepted as Admin I did not see it or did not knew the authenticity, or did not knew it was forwarded. So kindly bear it. information All honorable members of the group are informed that right now any post related to Corona virus has been declared a punishable offense by the Central Government, only a government agency can post on Corona. In case of wrong post or message, action will be taken against the members of the entire group including the group administrator by registering a lawsuit under the IT Act, so keep in mind be safe! Ravi Nayak, Principal Secretary, Ministry of Home Affairs, Government of India”", "Alt News has received several requests to fact-check these messages on WhatsApp (+91 76000 11160) and on our official Android application.", "The website of the Ministry of Home Affairs does not list an official by the name ‘Ravi Nayak’. Moreover, the designation mentioned in the viral text, ‘Principal Secretary’, is not listed either. The Home Ministry has a ‘Home Secretary’ who is the administrative head of the department.", "Alt News spoke to a police officer at Dadar police station, Mumbai, who said that no one has been arrested for circulating misleading forwards on WhatsApp groups.", "However, on March 30 Mumbai Mirror reported that JJ Marg police arrested a 24-year-old man from the Pathanwadi area in Mohammad Ali Road who had circulated a fake message on WhatsApp claiming that the army has been called in to enforce the lockdown in certain areas of South Mumbai. Times of India and Hindustan Times also covered this incident. We were unable to find any other reports of arrests or any arrests made in Dadar.", "Therefore the viral WhatsApp forward promotes false claims. Earlier, an audio clip falsely claimed that 59 confirmed coronavirus cases were reported in Nagpur. In this case, Nagpur police arrested three individuals for circulating the misleading audiotape.", "Note: The number of positive cases of the novel coronavirus in India exceeds 5,000 and more than 150 deaths have so far been reported. The government has imposed a complete restriction on movement apart from essential services to tackle the pandemic. Globally, more than 14 lakh confirmed cases and over 80,000 deaths have been reported. There is a sense of panic among citizens, causing them to fall for a variety of online misinformation – misleading images and videos rousing fear or medical misinformation promoting pseudoscience and invalid treatments. While your intentions may be pure, misinformation, spread especially during a pandemic, can take lives. We request our readers to practice caution and not forward unverified messages on WhatsApp and other social media platforms.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "Trigger Warning: Sexual Violence A distressing video of a girl forced to take her clothes…", "A clip featuring Pakistan men’s Cricket team captain Babar Azam is viral on social media…", "A 13-second clip featuring Bollywood actor Shah Rukh Khan is being shared on social media…", "Union minister of information and broadcasting Anurag Thakur on September 26 announced Waheeda Rehman as…"]