["About this rating", "In mid-March 2018, readers began to ask whether it was true that Toys R Us locations had stopped accepting gift cards as a form of payment as of 11 March 2018:", "is it true toy retailer, Toys R Us is no longer accepting gift cards after 3/11/18?", "Many linked to a 10 March 2018 Scotsman.com article about a similar situation, but it focused on Toys R Us locations specifically in the United Kingdom:", "Toys R Us have said on their website: “Gift cards and vouchers will be honoured until Sunday, 11 March [2018]. There are no refunds for cash value on any gift cards.", "“But customers are encouraged to redeem such vouchers as soon as possible as stores may be subject to closure without notice.”", "News about UK-based locations proved confusing to some readers, and the gift card announcement coincided with matters related to Toys R Us' fiscal solvency in the United States. A post shared to shopping site SlickDeals in March 2018 posited that those in possession of Toys R Us gift cards ought to use them sooner rather than later:", "Multiple reports are out there that TRU is going into liquidation bankruptcy next week. If you have gift cards, they'll be trash the moment they announce, most likely. Use those cards this weekend if you don't want them to be worthless. Hold onto receipts if they manage to avoid liquidation, you can just return the items if you didn't have anything much you wanted right now. If not, at least you got something for your paper.", "Also remember to check your rewards total and use those points/certificates as well!", "The post referenced a 9 March 2018 CNNMoney article about the closure of UK-based Toys R Us locations, and the state of the retailer's finances in the United States.", "On 13 March 2018, CNBC cited reports of a liquidation plan in progress:", "Toys R Us, the iconic U.S. retailer, is in the process of drafting the court motion for its liquidation plan, a source familiar with the situation told CNBC on [13 March 2018].", "The retailer could file as soon as the end of [14 March 2018], making the motion official. It will then begin to wind down the storied toy retailer, after more than half a century in business.", "A liquidation will most likely result in the closing of all of Toys R Us' 800 stores in the U.S.", "As of midday on 14 March 2018 the web site ToysRUs.com still accepted gift cards as payment, and the site offered customers the option of purchasing physical or virtual versions at checkout:", "Although articles speculated that Toys R Us gift cards might soon become worthless in the United States, and UK outlets have stopped accepting them, no definitive information about their future is yet available.", "In response to our inquiry, a representative for Toys R Us replied:", "Thanks for asking! Please know that we are not going out of business, but we are making changes to the number of stores we have. In the meantime, our stores are operating as usual and you can also continue to shop online at https://www.toysrus.com and https://www.babiesrus.com.", "Additionally, our customer registry, credit, warranty and loyalty programs will continue as normal. We will also continue to sell and accept gift cards as always.", "On 15 March 2018, a representative for Toys R Us said the chain planned to honor gift cards for a 30-day period. However, the Better Business Bureau advised consumers to use the cards \"sooner rather than later.\"", "Bomey, Nathan.   \"Toys 'R' Us Gift Cards Are Good For The Next 30 Days.\"\r\n    USA Today.   15 March 2018.", "Goldman, David.   \"Toys 'R' Us To Close All Of Its UK Stores.\"\r\n    CNNMoney.   14 March 2018.", "Hirsch, Lauren.   \"Toys R Us Prepares Plan To Liquidate Its Business.\"\r\n    CNBC.   13 March 2018.", "Jackson, Russell.   \"Toys R Us Gift Cards No Longer Being Accepted In Stores.\"\r\n    The Scotsman.   10 March 2018,", "LaMonica, Paul.   \"Toys 'R' Us Could Go Out Of Business. That's Bad News For Lego And Barbie.\"\r\n    CNNMoney.   9 March 2018,", "Peterson, Hayley.   \"Toys R Us Gift Cards Could Be Useless In A Matter Of Weeks.\"\r\n    Business Insider.   13 March 2018,", "ToysRUs.com.   \"Gift Cards.\"\r\n    Accessed 14 March 2018.", "Updated 15 March 2018, 9:46 A.M.: Added a statement from a Toys R Us representative.", "Updated 16 March 2018, 1:39 P.M.: Added confirmation of 30-day expiry made by company representative.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]