["About this rating", "Obama said the opposite of what is alleged. The full context of his remarks shows that he was describing an \"older\" and \"alternative\" vision of power that threatens America's traditional values.", "Since as early as June of 2014, a video has circulated online in which President Barack Obama seemed to speak of ordinary citizens' basic rights in a cavalier and disdainful manner. In the 19-second clip, President Obama appeared to say the following:", "And for the international order that we have worked for generations to build. Ordinary men and women are too small-minded to govern their own affairs, that order and progress can only come when individuals surrender their rights to an all-powerful sovereign.", "The speech in question was given in Brussels, Belgium, lending credibility to the notion Obama revealed his true beliefs on governance before a more sympathetic European audience, and the comment subsequently slipped past the radar of American news media sources.", "No audio clues immediately challenged the clip's veracity, but one major red flag was a video cutaway: Between the first and second portions of the short statement, the camera panned out over the audience before centering back on Obama's face, indicating different portions of something had been spliced together.", "President Obama did deliver a speech in Brussels on 26 March 2014 (\"Remarks by the President in Address to European Youth\") from which those words were taken, but the quote presented in the video splices together two entirely separate portions of the address. What Obama actually said was a bit different in the proper context, and the excerpted phrasing below is highlighted (full video; full transcript):", "Leaders and dignitaries of the European Union; representatives of our NATO Alliance; distinguished guests: We meet here at a moment of testing for Europe and the United States, and for the international order that we have worked for generations to build.", "Throughout human history, societies have grappled with fundamental questions of how to organize themselves, the proper relationship between the individual and the state, the best means to resolve inevitable conflicts between states. And it was here in Europe, through centuries of struggle — through war and Enlightenment, repression and revolution — that a particular set of ideals began to emerge: The belief that through conscience and free will, each of us has the right to live as we choose. The belief that power is derived from the consent of the governed, and that laws and institutions should be established to protect that understanding. And those ideas eventually inspired a band of colonialists across an ocean, and they wrote them into the founding documents that still guide America today, including the simple truth that all men — and women — are created equal.", "But those ideals have also been tested — here in Europe and around the world. Those ideals have often been threatened by an older, more traditional view of power. This alternative vision argues that ordinary men and women are too small-minded to govern their own affairs, that order and progress can only come when individuals surrender their rights to an all-powerful sovereign. Often, this alternative vision roots itself in the notion that by virtue of race or faith or ethnicity, some are inherently superior to others, and that individual identity must be defined by \"us\" versus \"them,\" or that national greatness must flow not by what a people stand for, but by what they are against.", "Considered in their full context, President Obama's mentions of ordinary men and women being \"too small-minded to govern their own affairs,\" and order and progress being possible only \"when individuals surrender their rights to an all-powerful sovereign,\" are references to what he describes as an old, undesirable form of power, not an expression of President Obama's viewpoint about how things are or should be in the world today.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]