["About this rating", "Editor's note: Fire experts warn that a plastic bottle containing any liquid -- including, but not limited to, hand sanitizer -- left in a car and exposed to direct sunlight can potentially focus sunlight into a beam hot enough to start a fire. The following article deals specifically with the specific claim that hand sanitizer will \"spontaneously combust\" if left in a hot car.", "In April 2020, a series of photographs started to circulate on WhatsApp and Telegram that supposedly showed the aftermath of a car fire caused by an unattended bottle of hand sanitizer.", "These posts, many of which were written in Portuguese, urged people to be cautious about leaving hand sanitizer in their cars because, they claimed, it can spontaneously combust.", "A month or so after these posts went viral in Brazil, a similar rumor started to circulate on English-language pages. In addition to being spread by anonymous social media users, these warnings also made their way onto the pages of a real fire departments. The Western Lakes Fire District of Wisconsin (WLFD) in Wisconsin, for instance, shared the following post to its Facebook page on May 21:", "Soon after, a number of news outlets picked up on this story and ran articles about how a fire department was warning people not to leave hand sanitizer in their cars. Although WLFD truly did post the above-displayed warning, the department later removed the post for stirring confusion.", "For starters, the picture has not been officially linked to a fire caused by a bottle of hand sanitizer exploding into flame. A number of experts have also weighed in to say that while hand sanitizer does contain alcohol and is flammable, it would require a tremendous amount of heat for spontaneous combustion. Although this sort of fire may be technically possible (more on that later), we've yet to see any official reports about a car fire starting this way. Lastly, the WLFD did state that a fire could be started via \"magnification of light through the bottle,\" but this is true for any plastic bottle and has little to do with its contents.", "WLFD deleted its original hand sanitizer warning and replaced it with the following message:", "Our goal in the WLFD is to provide timely, accurate, and educational information while responding to the needs of our customers. It’s become clear that a recent post about hand sanitizer was taken in many different directions from our original goal. We want to take the opportunity to clear up some misunderstandings and assure our position is understood.", "While we never made the claim that the photo utilized was from our district or from an exploding container of hand sanitizer, it has become clear that that inference and speculation made is seem as though it was. It was to illustrate a door fire resulting from contact with open flame which was the center of our post.", "Our message was intended to center on preventing fire or injury from the use of hand sanitizer. It also regarded the past history of issues stemming from clear bottles being stored in vehicles. These bottles typically store bottled water or as of late; hand sanitizer. While infrequent, there have been cases in the recent past were reflecting light placed through a clear bottle was able to focus onto a combustible surface and cause a fire. This has primarily been through water bottles but since hand sanitizer is often stored in the same vessel we wanted to pass it along for your safety. The principle is identical and obviously an additional issue would occur if it happened in the presence of an alcohol based product.", "The open flame comment was to remind people that when hand sanitizer is wet on any surface it will ignite when exposed to flame. With the recent increase in utilization of this product we wanted to remind our customers that it’s important not to allow this to occur. Many people have been sequestered in their homes and with an upcoming holiday accompanied with nice weather we knew grilling, fire pits, and other enjoyments would be in place. While we never referenced grilling in one’s vehicle, we did center on smoking and wanted to assure that the correlation was made illustrating that is also an open flame. We didn’t want anyone injured exercising good hygiene practices and then unintentionally coming in contact with open flame. Video representation of this happening is included for our fans to watch.", "We simply want our customers to be happy healthy and well and most importantly enjoy the time they have together with family and friends. Our message quickly came became misconstrued and we wanted to assure that we made it right.", "We apologize for any confusion and wish you an enjoyable holiday weekend.", "Judging from the amount of mail Snopes received, many people were still confused about what dangers may lurk in bottles of hand sanitizer. So let's take a closer look at the questions this viral post sparked.", "Many hand sanitizers contain alcohol, and these alcohol-based hand sanitizers (ABHS) are flammable. The Federal Aviation Administration wrote in a 2010 report:", "As expected, hand sanitizer is flammable and can easily be ignited with a common grill lighter when poured into a pan. It tends to burn relatively cool, compared to fuel, plastic, or cellulose fires with peak flame temperatures between 500° and 1000°F. The observed temperatures above the flame were higher for the liquid hand sanitizer compared to the gel.", "Hand sanitizers also give off vapors, and these vapors are also flammable.", "The Centers for Disease Control and Prevention (CDC) writes:", "ABHS contains ethyl alcohol, which readily evaporates at room temperature into an ignitable vapor, and is considered a flammable liquid. Although the incidence of fires related to ABHS is very low, it is vital that ABHS is stored safely and that bulk dispensers are installed and maintained correctly.", "One of the major fears that people had after encountering this rumor on social media was that their hand sanitizer was going to \"spontaneously combust\" if left too long in a hot car. We won't say that this is impossible, but we will say that it is extremely unlikely.", "According to the National Fire Protection Association (NFPA), hand sanitizer would have to be exposed to extreme heats (over 700 degrees Fahrenheit) in order to spontaneously combust.", "Spontaneous ignition, on the other hand, involves a substance self-heating to a point where it ignites, without the need for any outside ignition source like a flame. Hand sanitizer is not subject to self-heating and would require temperatures to reach over 700 degrees Fahrenheit to spontaneously ignite, according to Guy Colonna, director of Technical Services at NFPA.", "Those sort of temperatures just aren't going to be seen inside of a parked car (so long as that car is parked on Earth). A 2018 study published in the journal Temperature found that the average temperature in a parked car on a 95-degree day was about 116 degrees. Specific parts of the car, such as the dashboard, climbed closer to 160 degrees, but that is still far from the 700 degrees needed for spontaneous combustion.", "The NFPA continued:", "\"Spontaneous ignition would be an ignition source independent of a flame or a spark, [and] it requires a material that is reactive to do what's called self-heat,\" Colonna says in a new video interview on the topic (above). \"Internally, it undergoes a reaction and changes its properties, and when changing its properties, it releases lots of heat energy. Hand sanitizer, the alcohol [in it], is a material not inclined to do that. ... The ignition temperature of the alcohols are going to be something in excess of 700 degrees Fahrenheit.\"", "In other words, while hand sanitizer gives off ignitable vapors at roughly room temperature or above, that vapor-air mixture still needs to be exposed to very high temperatures to ignite. A flame can do it. A hot car can't.", "This claim has more to do with the magnification properties of plastic bottles than it does with the contents of said bottles. In fact, in 2017, a similar warning was circulated on social media that said leaving a water bottle in your car on a hot day could result in a fire.", "Live Science wrote:", "Leaving a water bottle sitting in your car sounds benign enough. But on a hot, summer day, the plastic can act as a lens, focusing light into a high-energy beam that's intense enough to burn material like car-seat upholstery.", "[...]", "\"The water bottle is acting like a lens that's focusing the light coming through the window,\" Odile Madden, a materials scientist at the Getty Conservation Institute in Los Angeles, told Live Science.", "Light consists of numerous photons, which are subatomic particles that travel in a straight line, Madden said. Eyeglass and microscope lenses direct the photons so they converge on a point. \"You can use that to see something better, get it in focus. Or, you can focus a lot of light onto a very small point and concentrate all that energy, and that can cause melting and burning,\" Madden explained.", "Although it is technically possible for a fire to start in this manner, again, it is very unlikely. The sun, the bottle, and a flammable source would all have to be in perfect alignment on a rather hot day to ignite a fire.", "In June 2020, Illinois' Waukegan Fire Department reported that a small bottle of hand sanitizer had started a car fire. The organization later amended their statement to clarify that the fire was started in the manner described above — a plastic bottle focusing direct sunlight into beam hot enough to start a fire — so its cause was unrelated to the substance in the bottle.", "The claim that hand sanitizer was causing car fires first gained traction in Brazil in April 2020 via social media posts on WhatsApp. This spurred the country's Corpo de Bombeiros de Campo Grande (Campo Grande Fire Department) to issue a warning about the potential dangers of leaving hand sanitizer in a hot car. However, the fire department admitted that it had yet to see any fires caused in such a manner. Likewise, we have yet to uncover any confirmed reports about hand sanitizer causing a fire while left in a parked car on a hot day.", "However, many hand sanitizers are still flammable and do pose some risks. Alcohol-based hand sanitizers should not be used near open flames, and people storing large amounts of hand sanitizer should adhere to the National Fire Protection Association's Flammable and Combustible Liquids code.", "Although keeping a small bottle of hand sanitizer in your car won't result in spontaneous combustion, cautious drivers may want to store their hand sanitizer (and any other liquids kept in plastic bottles) out of direct sunlight in their glove boxes or center consoles.", "Wojciechowski, Charlie.   \"Waukegan Firefighters Warn Public After Hand Sanitizer Causes Car to Catch Fire.\"\r\n    NBC 5 Chicago.   19 June 2020.", "Felix, Leonardo.   \"Deixar Alcool Em Gel No Console Exposto ao Sol Faz o Carro Pegar Fogo?\"\r\n    Quatro Rodas.   20 April 2020.", "Geggel, Laura.   \"How Long Does It Take a Parked Car to Reach Deadly Hot Temperatures?\"\r\n    Live Science.   24 May 2018.", "Sparks, Hannah.   \"Fire department warning: Hand sanitizer could explode in your car this summer.\"\r\n    New York Post.   22 May 2020.", "Cavage, William.   \"Flammability Test of Alcohol-Based Hand Sanitizer.\"\r\n    Federal Aviation Adminstration.   August 2010.", "National Fire Protection Association.   \"Can Hand Sanitizer Spontaneously Ignite In a Hot Car?\"\r\n    22 May 2020.", "Rezende, Graziela.   \"'Esquecer Alcool no Carro Tem Risco Real de Combustão,' Alerta Coronel dos Bombeiros em Campo Grande.\"\r\n    Globo 1.   23 April 2020.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]