["“Just In : AAP will contest 2019 election alone”, tweeted Times How on August 9, 2018. It quoted Delhi Chief Minister Arvind Kejriwal as saying, “After results, we will give outside support to Mahagathbandhan. Our party was formed to fight corruption, if we merge with crooks before elections, nobody will vote us, so after winning seats, we will join them.”", "Just In : AAP will contest 2019 election alone. After results, we will give outside support to Mahagathbandhan. Our party was formed to fight corruption, if we merge with crooks before elections, nobody will vote us, so after winning seats, we will join them.", "– Arvind Kejriwal pic.twitter.com/Mxu1tyErWb", "— TIMES HOW (@TiimesHow) August 9, 2018", "The statement per se may sound incredulous but to the non-discerning eye viewing the tweet, it may seem valid. It is precisely this propensity to gloss over details which has, time and again, hoodwinked many into believing that Times How is somehow Times Now. The latest victim is the website Janta Ka Reporter, which published an article on August 10, 2018 on the basis of this satirical tweet.", "The website reported that “A news flash by Times Now quoted Kejriwal as saying, “AAP will contest 2019 election alone. After results, we will give outside support to Mahagathbandhan. Our party was formed to fight corruption, if we merge with crooks before elections, nobody will vote us, so after winning seats, we will join them.”", "Janta Ka Reporter has apologised for the error and updated the article with the message, “The earlier version of our story carried a tweet from a parody account. We’ve removed the tweet and apologise for the error”. The original article has been archived and can be accessed here.", "2. In February this year, Aaj Tak had broadcast an evening show debating a tweet by Times How over a fatwa against actress Priya Prakash Varrier. The tweet by Times How carried a quote by Mahmud Qadri which was construed as a real quote, on the basis of which a special show was broadcast.", "3. In yet another instance, Madhu Kishwar tweeted a quote ascribed to Congress leader Kapil Sibal, once again by the satire handle.", "Times How replicates the logo of the channel to make it seem original. The channel’s tagline, ‘Action begins here’ has been replaced with ‘Satisfaction begins here’. These subtle variations and the optical illusion that is created gets the better of many an acute observer at times.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]