["“बंगाल कि मुख्यमंत्री ममता बनर्जी बंगाल में हिंदुओ का घर खाली करवा रही है वो इस वीडियो में जरा देखिये” (In Bengal, WB CM Mamata Banerjee is making Hindus vacate their homes. Please see this video- translation).", "With the above message, a video has been shared on social media platforms. It is two minutes, thirty seconds long, and begins with a woman describing her plight as she was forced to vacate her house. The video then shows another woman who walks around the place, explaining how it was attacked and set on fire. Later on in the video, she accuses the police of being complicit in the violence. The video is a report by BBC Hindi.", "“बंगाल कि मुख्यमंत्री ममता बनर्जी बंगाल में हिंदुओ का घर खाली करवा रही है वो इस वीडियो में जरा देखिये”…👇😡😡😡", "Posted by भगवा शेरनी on Wednesday, May 8, 2019", "The above post by a page Bhagwa Sherni has been viewed more than 167,000 times and shared over 7500 times since it was posted on May 7. The video has been shared by several individual users on Facebook and Twitter. The claim here along with the video is that members of the Hindu community are being forced to vacate their homes in West Bengal. WB CM Mamata Banerjee has been blamed directly in the viral message, holding her directly responsible for the arbitrary harassment narrated in the video.", "The video shared so aggessively on social media platforms, alleging discrimination of Hindus at the hands of the TMC government, is NOT recent. It is more than a year old, and pertains to the communal violence which rocked Asansol in West Bengal during Ram Navami in March 2018. At least five people were killed in the flare-up.", "The ground report by BBC Hindi was published on YouTube on April 2, 2018 and has been posted below.", "Communal clashes had broken out in March 2018 in Asansol, when Ram Navami processions in Raniganj had turned violent. Five people were killed in the violence, and dozens of vehicles and homes were set ablaze. According to a ground report by Scroll published in April 2018, those affected by the violence said the police was late in arriving at the scene. The report states:", "“A close look at the incidents of violence and conversations with people who were witness to them – including those who organised or participated in the processions – shows that the police and administration were late in responding to the rioting and in their attempts to arrest its spread. Many of them told Scroll.in that it took the police several hours to arrive at the trouble spots, despite several of these places being located within minutes of police stations. They also accused the police of not deploying sufficient personnel in areas that had seen clashes during Ram Navami celebrations in the past.”", "A video of a ground report from Asansol, West Bengal in 2018 was falsely shared as a recent incident of harassment and intimidation of the Hindu community at the behest of the TMC led state government. West Bengal is in the cross-hairs of misinformation as the nation heads towards the final phase of polling.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]