["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The headline flew around the conservative blogosphere: \"Obama Declares November National Muslim Appreciation Month.\"", "The fact that it came from a website, National Report, known for Onion-like satire, didn’t stop some bloggers from reporting it as news.", "The piece was packed with fake details designed to press anti-Muslim buttons: President Barack Obama held a news conference to make his declaration. He said Muslims \"are not all bad. In fact, most of them are good.\"", "His announcement was hailed by a \"member of the Muslim Brotherhood’s Freedom and Justice Party.\" He said he would work with Congress to make it easier for Muslims to earn U.S. citizenship.", "\"Mr. Matei of the Muslim Brotherhood assured me they want to come to this country to help us, not harm us,\" he was reported to say.", "Following other attempts to paint Obama as a Muslim -- such as this one that we rated Pants on Fire -- the National Report’s gambit worked.", "\"How dare Obama declare November, the month when we give thanks to God for our blessings and great nation, National Muslim Appreciation Month!\" wrote a blogger for Tea Party Nation.", "The PolitiFact inbox saw email after email with links to such stories from readers who got it from outraged friends.", "Urban-legend debunker Snopes.com quickly confirmed that it originated with National Report.", "The headline was utterly invented, and the event was entirely fabricated.", "While we didn’t hear back from the White House, we found no evidence of any such proclamation at the White House website.", "We also asked Ibrahim Hooper, spokesman for the Council on American-Islamic Relations.", "\"I’m fairly certain they haven’t. Otherwise, I would have heard about it,\" he said.", "Obama regularly commemorates Muslim holidays alongside Christian and Jewish ones. He’s proclaimed a Jewish American Heritage Month, a National Day of Prayer and a Religious Freedom Day, noting, \"We are a nation of Christians and Muslims, Jews and Hindus, Sikhs and non-believers.\"", "He has declared heritage months for Irish-Americans, Asian-Americans, Caribbean-Americans and Hispanics. He has proclaimed a month for appreciation of African-American music. But nothing about Muslims.", "As for Obama’s purported proclamation, the Tea Party Nation blogger posted an update to her outrage: \"Just found out this article was a hoax. They sure fooled me. However, my comments still stand if O should ever do such a thing.\"", "Our ruling", "Bloggers posted a claim that the president had declared November \"National Muslim Appreciation Month.\" He hasn’t — the claim was based on a piece of Internet satire. We rate the claim Pants on Fire.", "National Report, \"Obama Declares November National Muslim Appreciation Month,\" Sept. 27, 2013", "Your Daily Dose of Conservatism, \"Obama Declares November National Muslim Appreciation Month,\" Sept. 27, 2013", "Tea Party Nation, \"Obama Declares November Muslim Appreciation Month,\" Sept. 28, 2013", "MinutemanNews.com, \"Obama Declares November National Muslim Appreciation Month,\" Sept. 28, 2013", "White House, \"Proclamations,\" Sept. 30, 2013", "White House, \"Statement by the President on the Occasion of Ramadan,\" July 8, 2013", "White House, \"Statement by the President on the Occasion of Eid al-Fitr,\" Aug. 7, 2013", "White House, \"President Obama's Rosh Hashanah Greeting,\" Sept. 13, 2012", "White House, \"Statement by the President on Easter Weekend,\" March 29, 2013", "White House, \"Presidential Proclamation -- Religious Freedom Day,\" Jan. 16, 2013", "White House, \"Presidential Proclamation -- National Day of Prayer, 2013,\" May 1, 2013", "White House, \"Presidential Proclamation -- Prayer for Peace, Memorial Day, 2013,\" May 24, 2013", "White House, \"Presidential Proclamation -- Jewish American Heritage Month, 2013,\" April 30, 2013", "White House, \"Presidential Proclamation -- Asian American and Pacific Islander Heritage Month,\" 2013,\" April 30, 2013", "White House, \"Presidential Proclamation -- Irish-American Heritage Month, 2013,\" Feb. 28, 2013", "White House, \"Presidential Proclamation -- National Hispanic Heritage Month, 2013,\" Sept. 13, 2013", "White House, \"Presidential Proclamation -- African-American Music Appreciation Month,\" 2013,\" May 31, 2013", "White House, \"Presidential Proclamation -- National Caribbean-American Heritage Month, 2013,\" May 31, 2013", "District of Columbia Mayor’s Office, \"Mayor Gray Wishes District’s Muslims a Blessed Ramadan,\" July 8, 2013", "Council on American-Islamic Relations, \"D.C. Mayor Vincent C. Gary issues proclamation honoring October as America’s Islamic Heritage Month,\" Oct. 1, 2013, via Facebook", "America's Islamic Heritage Museum, District of Columbia Mayor Vincent Gray's proclamation of Islamic Heritage Month, Sept. 29, 2012, via Facebook", "America's Islamic Heritage Museum, accessed Oct. 2, 2013", "Snopes, \"November Surprise,\" Sept. 28, 2013", "Email interview with Doxie McCoy, senior communications manager for Mayor Vincent Gray, Aug. 3, 2013", "Interview with Ibrahim Hooper, national communications director, Council on American-Islamic Relations, Oct. 3, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]