["About this rating", "A phenomenon know as \"like-farming\" refers to unscrupulous online activity in which fraudsters post salacious material in order to generate as many likes, shares, and comments as possible. As the popularity of these posts and pages grows, so do the opportunities to scam social media users. For instance, a fraudster may edit a post to include a malware link or request personal information — or, if the audience has grown large enough, change the page's focus entirely and start selling spammy products.", "In January 2020, the popular grocery chain Aldi was used in one such scam. A fraudulent post from a page resembling the official Aldi USA Facebook page promised everyone who shared or commented on it the chance to win a year's worth of free groceries:", "This post did not originate with the official Aldi Facebook page, and the grocery chain is not giving away a year of free groceries to any Facebook fans who like, comment, or share this post.", "For starters, the post does not appear on the official Aldi USA Facebook page, nor on any of the store's other social media pages. We also checked the grocery chain's website for any mention of a grocery giveaway, but this too-good-to-be-true deal is not listed among Aldi's specials.", "Lastly, this fraudulent Facebook post follows the same script of dozens of other like-farming scams: It makes a big promise (a year of free groceries) in order to entice readers, then makes a simple request (to comment or share) to ensure that this post reaches a larger audience. The post is also light on specifics (11 pm in what time zone? And what Sunday?) and originated on a page unaffiliated with the grocery chain.", "Here's how the Better Business Bureau described like-farming scams:", "What Exactly is Like-Farming?", "Like-farming on Facebook is a technique in which scammers create an eye-catching post designed to get many likes and shares. Posts often give people emotional reasons to click, like, and share, such as adorable animals, sick children, or political messages. For example, some posts claim that Facebook will donate money for every comment or share. As more people like and share the post, it appears in more news feeds, giving the post a much wider audience.", "Why Do Scammers “Farm” for Likes?", "As with many scams, like-farming has several different aims. When scammers ask you to “register” in order to win a free iPad or a free flight, this is a way to steal your personal information. Other versions can be more complex. Often, the post itself is initially harmless – albeit completely fictional. But when the scammer collects enough likes and shares, they will edit the post and add something malicious. That’s often a link to a website that downloads malware to your machine. Other times, once scammers reach their target number of likes, they strip the page’s original content and use it to promote spammy products. They may also resell the page on the black market. These buyers can use it to spam followers or harvest the information Facebook provides.", "This is not the first time that Aldi has been used for this type of scam. In 2015 (and again in 2019), a scam post offering free Aldi coupons was circulated on social media.", "We reached out to Aldi for more details and will update this article if more information becomes available.", "Better Business Bureau.   \"Like-Farming: A Facebook Scam Still Going Strong.\"     27 February 2018.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]