["About this rating", "A viral list purportedly cataloging the NFL's history on freedom of speech issues has been bouncing around the internet since at least September 2017:", "So tell me again How The NFL supports Freedom of Speech..........Here are some fun facts about the hypocrites over at the NFL.", "In 2012 the NFL had an issue with Tim Tebow kneeling for each game to pray, they also had an issue with Tebow wearing John 3:16 as part of his blackout to avoid glare and made him take it off.", "In 2013 the NFL fined Brandon Marshall for wearing green cleats to raise awareness for people with mental health disorders.", "In 2014 Robert Griffin III (RG3) entered a post-game press conference wearing a shirt that said: \"Know Jesus Know Peace\" but was forced to turn it inside out by an NFL uniform inspector before speaking at the podium.", "In 2015 DeAngelo Williams was fined for wearing \"Find the Cure\" eye black for breast cancer awareness.", "In 2015 William Gay was fined for wearing purple cleats to raise awareness for domestic violence. (not that the NFL has a domestic violence problem...)", "In 2016 the NFL prevented the Dallas Cowboys from wearing a decal on their helmet in honor of 5 Dallas Police officers killed in the line of duty.", "In 2016 the NFL threatened to fine players who wanted to wear cleats to commemorate the 15th anniversary of 9/11.", "So tell me again how the NFL supports free speech and expression?", "We have not been able to determine the author of this list. It is frequently shared as a block of text on online forums, and has also been printed in the \"letters to the editor\" sections of various newspapers:", "The list first started circulating in the wake of a league-wide demonstration on 24 September 2017, when more than 200 fooball players, coaches, and owners knelt or locked arms on the field in response to remarks made by President Donald Trump about peaceful protests by players during the U.S. national anthem:", "NFL players responded in full force Sunday after President Trump repeatedly called for swift punishment against those who chose to protest by not standing during the national anthem.", "Demonstrations spread throughout the league as many players broke out of their routine by joining the protests or engaging in team-wide displays of unity. The Associated Press estimated 204 players elected to either kneel or sit during the anthem.", "Outlets such as the New York Post published op-eds arguing that the NFL has a double standard when it comes to freedom of speech issues as they seemingly supported these player's rights to protest but had previously fined players for voicing support of other causes. An article in the conservative Daily Wire blog entitled, \"NFL's Free Speech: Kneeling For The Anthem Is Fine, But Fighting Breast Cancer And Domestic Violence? Shut Up\" even mentioned several of the items that would be later included on this list:", "The NFL has one heck of a double standard when it comes to free speech, as was abundantly illustrated on Sunday. The league had no problem with players showing disrespect for the American flag and national anthem by kneeling during the playing of the anthem, but there have been numerous instances in which the league has fined players for using their free speech to publicize worthy causes such as Mental Health Awareness week, fighting breast cancer or targeting domestic violence.", "(It should be noted here that although the NFL briefly showed support in 2017 for the players protesting police brutality and social injustice during the National Anthem, the league announced that players would be required to stand if they are on the field during the National Anthem in 2018.)", "However, a major flaw in the argument is that every item on the \"NFL's Free Speech History\" list deals with a violation of the league's unusually strict strict uniform policy, while the kneeling protests during the National Anthem do not.", "Regardless, here are the facts behind the items on this viral list.", "In 2012, the NFL had an issue with Tim Tebow kneeling for each game to pray and wearing Bible verse messages.", "Mixture. Although kneeling before football games has become associated with a form of protest, that wasn't the case when Tim Tebow was an active member of the National Football League. Tebow, like many NFL players, would frequently kneel in prayer before games or after big plays. We found no record of the NFL having any issues with Tebow's kneeling, and as it was a common occurrence among players across the league, we doubt that they ever did.", "The league did prevent Tebow from wearing \"John 3:16\" on his eye black, but the league wasn't specifically singling out the quarterback or his religious beliefs. The league has a longstanding rule against modifying uniforms and prohibits players from marking themselves with personal statements:", "“The NFL is looked upon as the highest level of sport and we want our players to look professional in every aspect of their game, including the uniform,” NFL spokesman Brian McCarthy said. ”... The players understand the rationale behind it. Where you draw the line would come into play in some instances. A player may feel that, ‘I should be able to shout out to my friend or my family,’ vs. not allowing some other player to do so. We have this policy and it’s widely understood.”", "The rule covers the helmet, jersey, pants, shoes, tape, wristbands, and headbands. No writing on any part of the body. Before each game uniform reps - former NFL players - prowl the sidelines looking for violators. When the teams go back into the locker room before the game starts, they are given a list of players who are in violation of the rule.", "The NFL rulebook contains more than five pages of conditions, and it has been criticized by a number of outlets for being unnecessarily strict. Regardless, the NFL does not allow players to convey personal messages via any part of their uniforms:", "Throughout the period on game-day that a player is visible to the stadium and television audience (including in pregame warm-ups, in the bench area, and during postgame interviews in the locker room or on the field), players are prohibited from wearing, displaying, or otherwise conveying personal messages either in writing or illustration, unless such message has been approved in advance by the League office", "In October 2013, the NFL fined Brandon Marshall for wearing green cleats to raise awareness for people with mental health disorders.", "True. Former Chicago Bears wide receiver Brandon Marshall was fined $10,500 by the NFL for violating its uniform policy after he wore green shoes during a game against the New York Giants:", "Chicago Bears wide receiver Brandon Marshall says he has been fined $10,500 by the NFL for wearing green football shoes in the Oct. 10 game against the New York Giants.", "Marshall had said before last Thursday's game he was wearing the shoes to attract attention to Mental Health Awareness Week. Marshall has been treated for a personality disorder in the past.", "Marshall posted the league letter informing him of the fine on Twitter and wrote: \"Football is my platform not my purpose. This fine is nothing compared to the conversation started & awareness raised.\"", "Marshall was fined again (this time for $15,000) later that season for wearing orange cleats.", "In 2014, Robert Griffin III entered a post-game press conference wearing a shirt that said: \"Know Jesus Know Peace\" but was forced to turn it inside out before speaking at the podium.", "Mixture. There was an incident in 2014, but the list misreports what actually happened. As mentioned, the NFL has a very strict uniform policy that not only covers what the players wear on the field, but also what they wear during pre- and post-game activities. When Griffin entered this post-game conference in September 2014 he was wearing a shirt which read \"Know Jesus Know Peace.\" However, he turned this shirt inside out before he reached the podium.", "A number of outlets reported at the time that the NFL had \"forced\" him to turn his shirt inside out. The story was even further exaggerated by outlets who argued that this incident showed that the NFL was anti-religion. Both of these assertions, however, are incorrect. A Redskins spokesperson at the time said that Griffin did it voluntarily to avoid a potential fine.", "Although this shirt may have violated the league's rules on personal messages, the Washington Post noted that the shirt also contained an unapproved logo. Griffin, who had previously been fined twice by the NFL for wearing a non-approved logo on game days, would have normally changed into his post-game (and league-approved) attire before the press conference, but the quarterback was dealing with an injury at the time and decided to wear an informal (and not approved) outfit to the conference:", "As usual, Griffin had brought an outfit of dress clothes to the stadium to wear to his postgame news conference. But because he had just spent a few hours getting his ankle put back together and getting treatment on that injury, the quarterback never put on his outfit of dress clothes. Instead, he used his crutches to hobble into the media room while still wearing that T-shirt.", "Of course, the T-shirt in question happened to have a message: Know Jesus Know Peace/No Jesus No Peace. The shirt comes from Christian clothier Not of This World — the company’s logo, with a halo and a cross, is seen right after the final E — and it obviously reflects Griffin’s strongly held Christian viewpoints.", "Griffin, though, has been twice fined by the NFL for wearing non-approved logos or clothing on game days. He was fined $10,000 for wearing an Adidas shirt to his news conference after he was hurt against the Ravens in 2012, and he was fined another $10,000 by the NFL for wearing an Adidas logo on the field before a 2013 preseason game. So before he addressed reporters on Sunday — in his uncharacteristically informal attire — Griffin turned the Know Jesus Know Peace T-shirt inside out.", "In 2015, DeAngelo Williams was fined for wearing \"Find the Cure\" eye black for breast cancer awareness.", "True. DeAngelo Williams was another play who ran afoul of the NFL's uniform policies. In 2015, he was fined for wearing pink in support of of breast cancer awareness:", "Williams, who has lost his mother and four aunts to breast cancer, will reportedly be fined $5,787 by the league for breaking the NFL’s uniform policy.", "Williams had previously requested to wear pink shoes or wristbands throughout the season to honor the women he has lost, but was told by NFL vice president of football operations Troy Vincent that the league would not allow it.", "In 2015, William Gay was fined for wearing purple cleats to raise awareness for domestic violence.", "True. William Gay was also fined by the NFL for breaking the league's uniform policy. The Pittsburgh Steelers safety was fined $,5787 (the same amount as Williams) after he wore purple cleats:", "Pittsburgh Steelers safety William Gay has been fined $5,787 for wearing purple cleats in Week 7 in honor of Domestic Violence Awareness Month, reports NFL.com’s Aditi Kinkhabwala.", "Gay’s mother was killed in an act of domestic violence. He was fined because the purple cleats violate the NFL’s uniform code.", "In 2016, the NFL prevented Dallas Cowboys players wearing decals on their helmets to honor five Dallas police officers killed in the line of duty.", "True. As should be abundantly clear by now, the National Football League doesn't often make exceptions to its dress code policy. In fact, when news outlets reported that the league was preventing the Dallas Cowboys from wearing decals in honor of five officers killed in the line of duty, they noted that decision was \"unsurprising\":", "The Dallas Cowboys asked the NFL if the team could wear decals honoring the fallen members of the Dallas Police Department and the NFL, unsurprisingly, said no.", "When training camp opened in Oxnard, Calif., earlier this offseason, the Cowboys unveiled \"Arm in Arm\" helmet decals, designed to pay tribute to the men who lost their lives during the downtown Dallas shooting in July, while also symbolically representing the Cowboys support of the community.", "Naturally, the NFL won't let them wear the decals during the regular season.", "\"Everyone has to be uniform with the league and the other 31 teams,\" Jerry Jones said Wednesday. \"We respect their decision.\"", "In 2016, the NFL threatened to fine players who wanted to wear cleats to commemorate the 15th anniversary of 11 September 2001.", "Mostly True. The one concession the NFL has made in regards to its uniform policy involved the commemoration of the 11 September 2001 terrorist attacks. Although the league reportedly warned at least one player that altering their uniform for the attack's anniversary would result in fines, the league never actually issued them:", "The NFL won’t fine players who violated the league’s equipment policy to honor victims of the 9/11 terrorist attacks on Sunday, but that doesn’t mean the league is easing up on the uniform policy.", "Players honoring other causes will still have to open their wallets, as they have in the past.", "In other words, if Pittsburgh Steelers running back DeAngelo Williams again wears eye black with “FIND THE CURE” during Breast Care Awareness Month in honor of his mother who died from breast cancer, or teammate William Gay wears purple cleats for domestic violence awareness, or teammate Cameron Heyward wears eye black with the words “IRON HEAD\" to honor his father who died of cancer, the league likely will fine them, just as it did last season.", "Hutchinson, Bill.   \"NFL Mandates that Players on the Field Stand for National Anthem.\"\r\n    ABC News.   23 May 2018.", "NY Post.   \"What’s Up With the NFL’s Double Standard on Free Speech?\"\r\n    12 September 2016.", "Associated Press.   \"Chicago Bears' Brandon Marshall Fined $10,500 for Green Shoes.\"\r\n    16 October 2013.", "Steinberg, Dan.   \"Why Robert Griffin III Turned His ‘Know Jesus Know Peace’ T-Shirt Inside Out.\"\r\n    Washington Post.   19 September 2014.", "Campbell, Rich.   \"NFL Fines Marshall $15,000 for Orange Cleats.\"\r\n    Chicago Tribune.   13 December 2013.", "Payne, Marissa.   \"The NFL’s Uniform Rules Border on Ridiculous.\"\r\n    Washington Post.   5 August 2015.", "Ley, Tom.   \"The NFL's Uniform Policies Are Even More Tight-Assed Than You Thought.\"\r\n    Deadline.   5 August 2015.", "Ley, Tom.   \"The NFL's Uniform Policies Are Even More Tight-Assed Than You Thought.\"\r\n    Deadline.   5 August 2015.", "DiRocco, Michael.   \"The Message is Out on Eye Black in College Football and the NFL.\"\r\n    Jacksonville.com.   17 April 2010.", "Brinson, Will.   \"NFL Won't Let Cowboys Wear Decals Supporting Dallas Police in Regular Season.\"\r\n    CBS News.   11 August 2016.", "Sports Illustrated.   \"Steelers RB DeAngelo Williams Fined for Wearing ‘Find The Cure’ Eye Black.\"\r\n    28 October 2015.", "Sports Illustrated.   \"NFL Fines Gay for Cleats in Honor of Domestic Violence Awareness Month.\"\r\n    28 October 28 2015.", "Brinson, Will.   \"NFL Won't Let Cowboys Wear Decals Supporting Dallas Police in Regular Season.\"\r\n    CBS News.   11 August 2016.", "Reyes, Lorenzo.   \"No Fines For 9/11 Cleats, But NFL Players Can Expect to Pay for Other Tributes.\"\r\n    USA Today.   14 September 2016.", "Berrien, Hank.   \"NFL's Free Speech: Kneeling For The Anthem Is Fine, But Fighting Breast Cancer And Domestic Violence? Shut Up.\"\r\n    Daily Wire.   25 September 2017.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]