["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "U.S. Botanic Garden visitors marvel at the titan arum, or corpse flower, as it blooms in Washington on July 22, 2013. (Getty Images)", "U.S. Rep. David Jolly’s Senate campaign was only hours old when he began taking fire from his fellow conservatives.", "The Club for Growth, a political action committee backing Jolly’s GOP primary opponent, U.S. Rep. Ron DeSantis, said that Jolly may have only been in office for 16 months, but during that time he \"racked up a terrible record on fiscal issues.\"", "\"Jolly is so addicted to big government, he couldn’t even muster up the courage to cut spending for a national greenhouse in D.C.,\" the PAC said in a statement emailed on the afternoon of July 20, 2015, the same day Jolly announced that he would be vying for Marco Rubio’s soon-to-be-open Senate seat.", "Jolly has only been in office since March 2014, after winning a special election for the late C.W. \"Bill\" Young’s 13th congressional district seat. Given such a short tenure, we wondered what action was so wasteful it would warrant Club for Growth’s assertion that Jolly had squandered too many greenbacks on a greenhouse.", "Flower power", "It turns out that \"national greenhouse\" is actually the conservatory at the U.S. Botanic Garden, a Washington museum first envisioned by George Washington more than two centuries ago with the mission of demonstrating and promoting \"the importance of plants to the young nation,\" according to the garden.", "The garden became a reality in 1820 and has been open in its current location on the Capitol grounds since 1933. Referring to it as just a greenhouse is an understatement: The grounds include various outdoor gardens, several plant collections in the aforementioned conservatory and an amphitheater. It is devoted to the study and cultivation of all manner of plant species and is free to the public.", "In 2013, the garden featured a 250-pound beast of a plant known as the corpse flower, which rarely blooms and stinks of rotting flesh. Curious botany fans braved an hourlong wait just to see (and perhaps smell) the bloom. That’s not the kind of stuff you find next to the tomatoes and zinnias at the local nursery.", "Because of the quirk that it was established by the federal government and has long been run by the Office of Architect of the Capitol, the garden is funded through the appropriations process for the legislative branch.", "A Club for Growth spokesman told us the PAC was referring to an amendment to the fiscal year 2015 legislative branch appropriations bill. Rep. Paul Gosar, R-Ariz., proposed cutting $3.1 million slated for repairs and improvements at the Botanic Garden. Gosar said the cut would have reduced funding to 2014 levels, but the garden’s administrators had been planning some changes.", "\"Rather than making minor repairs to a few small leaks in the roof, the Architect of the Capitol is proposing to tear down the entire roof and replace it with something called a new vegetative roofing system,\" Gosar said, referring to a plan Architect of the Capitol Stephen Ayers had proposed. \"We shouldn’t be wasting precious taxpayer money on a new, state-of-the-art vegetative roofing system.\"", "Ayers had testified in March 2014 to the House Appropriations Subcommittee that money also would go to repair chips and cracks in the conservatory’s facade. Ayers said a vegetative roof -- think of a living garden on top of the conservatory instead of tar or shingles -- \"will have a longer lifespan and will reduce water runoff.\"", "South Florida Rep. Debbie Wasserman-Schultz said Gosar was merely \"trying to generate headlines by attempting to cut much-needed funding to one of the most beloved destinations in Washington, D.C.\" But on May 1, 2014, the House voted in favor of the amendment, 219-198.", "One of the 37 Republicans who voted against the amendment -- and who as a result voted to keep the garden’s higher 2015 repair budget intact -- was Jolly.", "\"It would have been penny-wise but pound-foolish to score political points by refusing to replace a failing roof on a federal building visited by almost 1 million Americans a year,\" Jolly spokeswoman Sarah Bascom told PolitiFact. \"To not replace the roof jeopardized the safety of visitors and workers, and risked even greater cost should the roof and building fall in greater repair or lead to an accident with physical injury.\"", "As it happens, after the amendment to cut the roof spending passed the House despite Jolly’s opposition, lawmakers found ways to cut other spending and were able to put the roof expenditure back in the final version of the bill. The Club for Growth didn’t mention this.", "Changes at the Botanic Garden, which last completed an extensive renovation in 2001, are not as of yet listed among the projects on the Architect of the Capitol website.", "Our ruling", "The Club for Growth said Jolly refused \"to cut spending for a national greenhouse in D.C.\"", "While \"greenhouse\" trivializes the U.S. Botanic Garden, the group is right that Jolly broke with most Republicans in voting against a 2014 amendment to cut funding for repairs to the complex’s roof and facade. We rate the claim True.", "Club for Growth, \"Is David Jolly Florida’s next Charlie Crist?,\" July 20, 2015", "NPR, \"The Big Stink: D.C.'s Corpse Flower Put On A Show,\" July 23, 2013", "U.S. House of Representatives, \"Final vote results for Roll Call 189,\" May 1, 2014", "U.S. Rep. Paul Gosar, \"House Passes Gosar Efforts to Cut Waste,\" May 1, 2014", "U.S. House of Representatives Committee on Appropriations, \"Fiscal Year 2015 Legislative Branch Appropriations Bill Approved by House,\" May 1, 2014", "Las Vegas Review-Journal, \"Washington Digest: House continues to allow lawmakers to lease autos,\" May 3, 2014", "Government Publishing Office, \"H. R. 4487,\" accessed July 21, 2015", "Congress.gov, \"H.R.4487 - Legislative Branch Appropriations Act, 2015,\" accessed July 21, 2015", "Congress.gov, \"H.R.83 - Consolidated and Further Continuing Appropriations Act, 2015,\" accessed July 22, 2015", "Congress.gov, \"S. Rept. 113-196 - Legislative Branch Appropriations, 2015,\" accessed July 22, 2015", "Washington Post, \"Botanic Garden's Second Spring,\" Nov. 30, 2001, accessed via Nexis", "CQ Congressional Testimony, \"2015 Appropriations: Legislative Branch; Committee: House Appropriations; Subcommittee: Legislative Branch,\" March 4, 2014, accessed via Nexis", "CQ House Action Reports, \"Fact Sheet No. 113-32: December 10, 2014 - FY 2015 Omnibus Appropriations,\" Dec. 11, 2014, accessed via Nexis", "Interview with Steve Burke, Club for Growth spokesman, July 20, 2015", "Interview with Kristen Bridges, Jolly spokeswoman, July 21-22, 2015", "Interview with Sarah Bascom, Jolly spokeswoman, July 21-22, 2015", "Interview with Laura Condeluci, Architect of the Capitol spokeswoman, July 23, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]