["By D'Angelo Gore", "Posted on November 27, 2019", "Sen. Elizabeth Warren misleadingly told a group of school-choice activists that her children “went to public schools,” not private ones. Warren’s campaign later clarified that her daughter attended public school, while her son mostly attended private school.", "The subject of where Warren’s children went to school came up after the Democratic presidential candidate held a campaign rally in Atlanta on Nov. 21. Warren agreed to meet afterward with a group of pro-charter school advocates who had interrupted her speech at the event by reportedly chanting, “Our voice! Our choice!”", "The group, known as the Powerful Parent Network, said members traveled from different parts of the country to Atlanta to talk to Warren, whose education plan says she wants to “stop the diversion of public dollars from traditional public schools through vouchers or tuition tax credits,” as well as “end federal funding for the expansion of charter schools” and “ban for-profit charter schools.” Warren is “wrong on education when it comes to our children,” one of the members said in a video that helped raise money to fund their trip.", "A 54-second recording from the meeting with Warren shows the same group member, Sarah Carpenter, telling the Massachusetts senator, “We’re going to have the same choice that you made for your kids because I read that your children went to private school.”", "In response, Warren said, “No, my children went to public schools.”", "But that’s misleading. Warren has two children, and one of them attended both public and private schools, her campaign has since admitted.", "“Elizabeth’s daughter went to public school. Her son went to public school until 5th grade,” the campaign explained in a statement provided to FactCheck.org. It also said: “Elizabeth wants every kid to get a great education regardless of where they live, which is why her plan makes a historic investment in our public schools. Every public school should be a great school. Her plan does not affect funding for existing non-profit charter schools, but she believes we should not put public dollars behind a further expansion of charters until they are subject to the same accountability requirements as public schools.”", "Warren’s son, Alexander, attended at least two private, college preparatory schools, according to articles from conservative outlets that wrote about her claim. We could not independently confirm which private schools he attended, and the campaign didn’t disclose them.", "The Washington Free Beacon, citing a school yearbook, reported that Warren’s son attended Kirby Hall School in Austin, Texas, at least during the 1986-1987 school year, when he was in the fifth grade. At the time, Warren was teaching at the University of Texas at Austin. There is an “Alex Warren” in Kirby’s 1987 yearbook, according to an online version of the book at classmates.com.", "Also, the Federalist reported that, at age 15, he later attended the Haverford School in Haverford, Pennsylvania, while his mother taught at the University of Pennsylvania. The Federalist said it obtained a yearbook photo of Alexander from another Haverford alumnus who attended the all-boys school at the same time he did.", "As for Warren’s daughter, Amelia, “she grew up trailing her law professor parents, attending nine public schools between kindergarten and 12th grade,” according to a 2003 article in Wharton Magazine.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]