["The video has been viewed more than 120,000 times after it was posted on Facebook on March 5, 2021.", "Its title reads: \"BREAKING NEWS TODAY MARCH 5, 2021 PRES DUTERTE GOOD NEWS MARCOS TO TAKE OFFICE LENI IMPEACH.\"", "Ferdinand “Bongbong” Marcos Jr narrowly lost the vice presidential race to Leni Robredo in 2016 as reported here by AFP. He has filed a legal case accusing her of fraud and disputing the election result.", "Robredo currently leads the political opposition to President Rodrigo Duterte’s government, a situation possible in the Philippines as voters can choose a president and vice president from separate parties.", "Duterte, an ally of the Marcos family, has previously said he would resign if Marcos Jr won the electoral protest, enabling the latter to take the presidency under constitutional succession rules.", "But in February 2021, Marcos lost the bid to overturn the election result when the Supreme Court unanimously dismissed his case.", "An identical video was also shared alongside a similar claim on Facebook here and here; and on YouTube here and here.", "However, this claim is false.", "A reverse image search of the video’s keyframes followed by keyword searches on Google, found it shows two unrelated clips that do not support the claim Marcos Jr was declared vice president in March 2021.", "The first clip was posted by the Philippine presidential communications office here on March 4, 2021.", "It shows Duterte delivering a speech during an inauguration of school buildings in Valenzuela City, where he discussed Covid-19 vaccination and reopening the economy. Duterte did not mention either Marcos or Robredo in the speech.", "The second clip was taken from a video posted on Marcos Jr’s Facebook page on February 20, 2021, where he talked about “bringing back transparency to the election system” in light of the upcoming 2022 national elections.", "Below is a set of screenshot comparisons showing frames in the misleading video (L) and their corresponding source clips (R):", "Lost electoral case", "Marcos Jr in fact lost his bid to overturn his 2016 vice presidential loss to Robredo weeks before the misleading video circulated online.", "On February 16, 2021, the Philippine Supreme Court announced it had “unanimously dismissed the entire electoral protest” because of “lack of merit.”", "Marcos Jr’s vice presidential poll case against Robredo has been the subject of persistent misinformation on Philippine social media.", "AFP has previously debunked multiple claims from allegations of electoral fraud to hoax reports that Marcos Jr had been proclaimed vice president or that he won his poll case.", "As of March 11, 2021, no reliable news report or official government announcement indicates Marcos Jr had been declared vice president of the country.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]