["About this rating", "In 1999, Donald Trump did publicly oppose plans to make mandatory the installation of sprinklers in New York City apartment buildings.", "Trump later softened his stance on the issue and voluntarily invested in sprinklers for one of his buildings.", "In April 2018, a fire in an apartment on the fiftieth floor of the Trump Tower in midtown Manhattan killed 67-year-old Todd Brassner.", "President Donald Trump tweeted about the fire only to inform his followers that it had been put out, praising fire fighters and describing the building where he has offices and a residence as \"well built.\" Trump has not publicly mentioned the death of Brassner:", "Fire at Trump Tower is out. Very confined (well built building). Firemen (and women) did a great job. THANK YOU!", "— Donald J. Trump (@realDonaldTrump) April 7, 2018", "The deadly fire prompted scrutiny of the president's own record on safety measures for apartment residents in New York, as well as claims that as an influential real estate developer during the 1990s he lobbied against a legislative measure that would have forced landlords to retrofit most larger residential buildings in the city with sprinklers.", "Trump Tower, which opened in 1983, does not have sprinklers. Emergency services were alerted to the fire at Brassner's apartment by a silent alarm, according to CNN.  On 8 April, the left-leaning Facebook page \"Proud Snowflakes\" posted a widely-shared meme which read:", "Trump Tower, where 67-year-old Todd Brassner died during a four-alarm blaze on 4/7/2018, did not have to comply with having sprinklers because Trump challenged the new rule in the 1990s and won.", "The meme accurately describes Trump's opposition to 1999 regulations on mandatory sprinkler installation, but also leaves out what appears to have been a change of mind by the future president, who later voluntarily installed the safety devices in another of his buildings despite the absence of a legal obligation.", "In 1998 and 1999, a spate of deadly apartment fires in New York City prompted then Mayor Rudy Giuliani to establish a panel to examine fire safety proposals as a matter of urgency.  In 1998, 92 out of 107 deaths caused by fires took place in buildings without sprinklers (as reported by the New York Times at the time) and inadequate inspections of sprinklers in a Brooklyn apartment led to a fire that killed three firefighters that December.", "Fire safety advocates and victims' relatives joined in appealing to New York City Council members to make sprinklers mandatory in apartment buildings, but some real estate developers — including Trump — voiced opposition to that proposed law. On 30 December 1998, the Times reported:", "Archie Spigner, the chairman of the City Council's Housing and Buildings Committee, said yesterday that he received a telephone call this week from Donald J. Trump, the real estate developer, who expressed concern about the high cost of installation and other problems that he had with sprinklers. Mr. Trump confirmed yesterday that he had ''received and placed calls'' from and to various city officials...", "...Steven Spinola, the president of the Real Estate Board of New York, an industry group, said yesterday that most fatal fires occur in two- and three-family homes, not in high-rise buildings that have fire-resistant construction. He and Mr. Trump said that in addition to being costly -- up to $4 per square foot to equip an entire building, Mr. Spinola said -- sprinklers were also prone to vandalism and mishaps, and widely disliked by tenants for esthetic reasons.", "''We believe that the code that exists in New York City basically gives us the safest buildings,'' Mr. Spinola said. ''We don't believe sprinklers are necessary to have the safest buildings.''", "However, within a few months, reports appeared that Trump had adjusted his stance slightly and in March 1999, the New York City Council passed a compromise law that required \"new residential buildings with four or more units\" to have sprinklers in every apartment and hallway, and any renovation of an existing building which cost more than half the building's value must also involve the installation of sprinklers.", "Older buildings like the Trump Tower do not fall under the scope of the regulations unless they undergo major renovations. The March 1999 law (Local Law 10-1999) also exempted buildings like the Trump World Tower, where excavation had already begun by that time:", "Donald J. Trump, one of the developers who initially fought the sprinkler law, said yesterday that he had decided to spend $3 million to install sprinklers in all 350 units of Trump World Tower, a high-rise apartment complex that he is building across from the United Nations.", "But Mr. Trump stressed that he did not believe the law would reduce fire fatalities.", "''People feel safer with sprinklers,'' he said. ''But the problem with the bill is that it doesn't address the buildings that need sprinklers the most. If you look at the fire deaths in New York, almost all of them are in one- or two-family houses.''", "The fact that Trump softened his stance on the installation of sprinklers and voluntarily invested in them for one of his buildings does not erase his earlier public opposition to them, but any discussion of his record on sprinklers in residential buildings is incomplete without mention of all these facts.", "Cummings, Julian; Gingras, Brynn.  \"There Was No Working Smoke Alarm in the Trump Tower Apartment Where Deadly Fire Started, Sources Say.\"\r\n  CNN.  10 April 2018.", "Jacobs, Andrew.  \"Man Killed in Brooklyn Fire as Panel Urges Sprinkler Law.\"\r\n  New York Times.  24 February 1999.", "Wilgoren, Jodi; Lambert, Bruce.  \"Fire Inquiry Prompts Focus on Inspections.\"\r\n  New York Times.  20 December 1998.", "Lambert, Bruce.  \"Extent of Sprinkler Law at Issue as Fire's Survivors Share Their Horror.\"\r\n New York Times.  9 January 1999.", "Barry, Dan; Cooper, Michael.  \"New Requirement for Sprinklers in Apartment Buildings is Likely.\"\r\n  New York Times.  30 December 1998.", "McCaffrey, Walter L.  \"Local Law 10-1999.\"\r\n  New York City Council.  24 March 1999.", "Herszenhorn, David M.  \"Giuliani Signs Bill on Apartment-House Sprinklers.\"\r\n  New York Times.  25 March 1999.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]