["A quote on Ayodhya-Ram Mandir issue, attributed to Congress Rajya Sabha MP Kapil Sibal, is widely circulating on social media. It says, “Kapil Sibal once said that he will die by suicide when Ram Mandir is inaugurated? (कपिल सिब्बल ने एकबार कहा था राम मंदिर निर्माण शुरू होने पर वो आत्महत्या कर लेंगे?)” Below is a tweet by a fake account created in the name of journalist Pushpendra Kulshreshtha.", "A 40 kg silver brick may be laid as the foundation stone for Ram Mandir on August 5 in a ceremony to be attended by Prime Minister Narendra Modi.", "That Sibal said he will take his own life when Ram Mandir is inaugurated is viral on social media, also shared by a parody account of Republic TV anchor Arnab Goswami.", "Another version of this claim was widely circulating last year. It said. “I will not let Ram Mandir be constructed till I’m alive – Kapil Sibal. (जब तक जिंदा हूँ, राम मंदिर नहीं बनने दूँगा – कपिल सिब्बल.)”", "Among those who shared it was Gaurav Pradhan, who is followed by PM Modi on Twitter. His tweet where he wrote, “@KapilSibalभाई ज़िंदा हो की मर गए (@KapilSibal brother are you dead or alive?)“, garnered over 3,000 retweets.", "Several other users on both Twitter and Facebook shared the same screenshot as Pradhan. The alleged quote has also been circulated sans the graphic.", "Multiple persons have shared a blog post by yogisena.wordpress.com alleging the same. The post, however, is from 2018.", "#AYODHYAVERDICT #राम_मंदिर अभी ये जिंदा है…. जब तक जिंदा हूँ, नही बनने दूंगा राम मंदिर : कपिल सिब्बल, काँग्रेस pic.twitter.com/IpAReRAyEx", "— Mritunjay Shukla (@prof_mshukla) November 10, 2019", "From the Facebook page of the organisation (Yogi Adityanath ki Sena or YogiSenaGkp), the article had received close to 2,000 shares at the time, March 15, 2018.", "The earliest version of the similar claim was discovered on Twitter — “Kapil Sibal: If triple talaq is deemed removed, I will not let Ram Mandir be constructed. (कपिल सिब्बल: अगर तीन तलाक ख़त्म हुआ तो राम मंदिर नहीं बनने दूंगा।)” This tweet was made on May 17, 2017.", "The exact quote was also shared on Facebook that same day.", "A quick Google search throws up no news reports crediting the quote to Kapil Sibal either recently or in the past. It is improbable that the media would not report such a controversial statement, had it been made by a prominent opposition leader.", "Moreover, the screenshot shared by several users redirects to a shady website digitalindiatv.com which had attributed the quote to Sibal on March 15, 2018.", "It is noteworthy that the Congress leader’s association with the Ayodhya case has been full of controversies. On December 5, 2017, Sibal’s request to defer the case till after the 2019 Lok Sabha elections was turned down by the Supreme Court. It was claimed that the politician, who is also an advocate, was representing the Sunni Warf Board on the case — an allegation Sibal had denied. The MP’s statements on the issue have been reported in the media in the past where he cannot be heard making the controversial quote attributed to him.", "Speaking with Alt News last year, Sibal termed the quote, “Mischievous, motivated, false and defamatory,” and further added, “I gave several statements after the verdict saying that we respect the verdict and the nation has to move forward, address the concerns of ordinary people.”", "Thus a false quote attributed to Congress MP Kapil Sibal on Ram Mandir has been circulating online since the past few years. The quote was revived after the SC pronounced the verdict on the Ayodhya case on November 9, 2019 and now, ahead of the temple’s inauguration.", "[This article was updated on July 21, 2020 with a fresh version of the false quote claiming Sibal said that he will die by suicide when Ram Mandir is inaugurated.]", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]