["The former second lady and wife of Democratic presidential nominee Joe Biden taught English full-time at Northern Virginia Community College while her husband was vice president, according to its Facebook page.", "But Jill Biden appears to be actively courting Latino voters. The Washington Post reported on her outreach to Hispanic leaders — including the Congressional Hispanic Caucus — to support her husband's campaign. The article also mentioned she is learning Spanish on the mobile app Babbel.", "Biden also spoke to the League of United Latin American Citizens during a virtual roundtable address. The organization confirmed that Biden guaranteed Latinos \"a place at the table\" in her husband's administration during the conversation, according to the official website.", "\"I teach a lot of immigrants, and refugees. I love their stories, I love who they are as people, and I love the fact that I can help them on their path to success,\" Biden told CBS Sunday Morning correspondent Rita Braver during an Aug. 9 interview where she expressed an interest in continuing to teach if she becomes first lady.", "Amid this, claims surfaced about Biden's desire to have all Americans learn Spanish.", "An Aug. 26 Facebook post \"quoted\" her alleged statement to the New York Post: \"All Americans Will Be Required to Learn Spanish When We Win.\" The post does not include a link to an article or an additional reference.", "USA TODAY reached out to the poster for comment.", "Fact check:National property tax isn't part of Joe Biden's plan", "The only article published under the \"Jill Biden\" tag by the New York Post prior to Aug. 26 was an Aug. 19 summary of her speech at the Democratic National Convention. There is no mention of Spanish in the article.", "More:Prominent Latinos criticize Democrats for lack of representation at DNC", "The full transcript of Biden's DNC speech contains no reference to Spanish or a proposal mandating Americans learn the language if Joe Biden is elected president.", "However, the article \"Dr. Jill Biden: 'All Americans Will Be Required to Learn Spanish When We Win,'\" on the website US Mags Press states otherwise. The article features an embedded video of Jill Biden's June 30 appearance on ABC's \"The View.\"", "\"She claims that the purpose of learning Spanish is to be competitive in the Western Hemisphere’s business and cultural arena. Obviously, this is not true,\" the article states.", "The author also accused Biden of completing \"the assimilation process to turn the United States into part of Mexico and to give free healthcare and welfare to all illegal immigrants on the backs of American taxpayers.\"", "Fact check:Biden does not say taxpayers are obligated to pay health care for immigrants", "There was no mention of the proposed language learning requirement during the nearly eight-minute interview on \"The View.\" Biden spoke about the presidential campaign and promoted her children's book on the show.", "Biden's \"spokesperson\" Arturo Tubollos also \"spoke to the press\" in Spanish, according to the article. An untranslated version of the statement is provided.", "\"Unfortunately, no one was there to translate, but Sr. Tubollos sure seemed excited about something,\" claims the author. \"If he was excited about something in Spanish then we don’t want it in America!\"", "USA TODAY confirmed Michael LaRosa is the spokesperson for Jill Biden, according to his Twitter bio. We reached out to him for comment.", "The US Mags Press article is obviously full of disinformation, but this was intentional. The website is a host for satirical \"news\" pieces.", "\"If you can seriously read this stuff and think it can be passed off as real to reasonable people, you need to go out, right now, and buy a sense of humor and a clue,\" US Mags Press stated.", "The Jill Biden article is clearly tagged \"SATIRE AND/OR CONSERVATIVE FAN FICTION\" at the top. It is also an exact copy from another satirical website, Taters Gonna Tate.", "Author Pete Strocker encouraged readers to \"Reelect Donald Trump!\" at the end of his satirical piece. The only difference between it and the US Mags Press copy is the embedded video of Biden's interview on \"The View.\" Otherwise, they are clearly labeled as satire.", "Fact check:White House didn't fire pandemic response unit when it was disbanded in 2018", "We rate this claim FALSE, based on our research. Jill Biden never said she would require Americans to learn Spanish if her husband is elected president. The notion originated on a website that promotes \"conservative fan fiction\" and other forms of satire. The author of the claim clearly identified the article as satirical. But social media posts falsely present statements from that article as fact.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook."]