["Hillary Clinton and Donald Trump have been evaluated on how their proposals will affect jobs.", "With certainty and precise counts, the Democratic presidential nominee vowed she will create jobs in Wisconsin and that the Republican nominee will kill them.", "\"The numbers say it all,\" read an Aug. 22, 2016 tweet from @HillaryforWI, one of the official Hillary Clinton campaign accounts.", "The tweet included a graphic that said Clinton \"would bring 186,740 new jobs to Wisconsin\" and \"Donald Trump would cost Wisconsin 61,050 jobs.\"", "The claim is derived from national estimates made by a well-regarded economist.", "But they are estimates, based on only somewhat-detailed policy statements from the candidates.", "And another set of estimates, albeit done with an arguably less rigorous methodology, produced very different results.", "Clinton’s evidence", "The claim is extrapolated from a July 2016 analysis of Clinton’s economic proposals and a June 2016 analysis of Trump’s proposals by Moody’s Analytics.", "The lead author on both was Mark Zandi, the economic research firm’s chief economist. Zandi is a well-respected economist, one PolitiFact has quoted as an expert in previous fact checks.", "Interestingly, both Clinton and Trump claim Zandi is on the other team. Perhaps that’s because politicians and economists on both sides of the aisle like Zandi, and because he has contributed to Democrats (including Clinton) and Republicans.", "Zandi has said he is a registered Democrat, but he told us the only time he officially worked for a candidate was when he was an economic adviser to U.S. Sen. John McCain during the Arizona Republican’s 2008 presidential campaign.", "Zandi’s two analyses project how Clinton’s and Trump’s policies would affect jobs nationwide during a first term: A gain of 10.4 million jobs under Clinton, a loss of nearly 3.5 million jobs under Trump.", "The estimates gained headlines from the Wall Street Journal, the New York Times and CNN/Money. Critics said, among other things, that Zandi underestimates the value of tax cuts.", "But, back to the claim about Wisconsin jobs.", "Clinton’s campaign told us it arrived at the Wisconsin figures cited in the tweet by distributing Zandi’s estimated total gains and losses among states in proportion to their population.", "One can’t assume that Clinton’s or Trump’s policies would have such an evenly-distributed impact on each state; indeed, for years, Wisconsin’s job growth has lagged the nation’s.", "But Zandi and economist Alan Cole of the free market-oriented Tax Foundation, which PolitiFact also quotes often, told us the extrapolation is reasonable. Zandi added that if he did a state-by-state breakdown, he would expect the numbers for Wisconsin to be roughly what Clinton stated.", "To counter Clinton’s claim, Trump’s campaign pointed us to the Tax Foundation’s January 2016 analysis of Clinton’s tax plans, which projects that nationally there would be 311,000 fewer jobs over 10 years than would be expected under current law. Meanwhile, the foundation in a September 2015 analysis of Trump’s tax plans projected 5.3 million more jobs over the same period.", "Cole agreed with Zandi that Zandi’s analyses considered more factors -- for example, spending as well as taxes -- than the Tax Foundation did. Cox also called Zandi’s analyses an honest and serious effort, but said the Tax Foundation arrived at different conclusions because it took a different approach.", "It’s also important to note that both candidates have announced new proposals since the various estimates were made, though Zandi said he doesn’t believe they would change his estimates significantly.", "Our rating", "Clinton says she \"would bring 186,740 new jobs to Wisconsin\" and \"Donald Trump would cost Wisconsin 61,050 jobs.\"", "The numbers are derived from analyses of Clinton and Trump policy proposals done by a respected economist from Moody Analytics who has supported both Democrats and Republicans.", "But the numbers are estimates, not certainties. Moreover, estimates done by the Tax Foundation using a different methodology project job gains under Trump but job losses under Clinton.", "For a statement that is partially accurate but needs additional information, our rating is Half True.", "Twitter, Hillary Clinton campaign tweet, Aug. 22, 2016", "Email, Hillary Clinton campaign spokeswoman Gillian Drummond, Aug. 23, 2016", "Email, Donald Trump campaign spokesman Michael Abboud, Aug. 25, 2016", "Moody’s Analytics, \"The Macroeconomic Consequences of Secretary Clinton’s Economic Policies,\" July 28, 2016", "Moody’s Analytics, \"The Macroeconomic Consequences of Mr. Trump’s Economic Policies,\" June 17, 2016", "PolitiFact National, \"Clinton, Trump both say Moody's economist is on the other team (Half True),\" June 24, 2016", "Interview, Moody’s Analytics chief economist Mark Zandi, Sept. 8, 2016", "Tax Foundation, \"Details and Analysis of Hillary Clinton’s Tax Proposals,\" Jan. 26, 2016", "Interview, Tax Foundation economist Alan Cole, Sept. 8, 2016", "Tax Foundation, \"Details and Analysis of Donald Trump’s Tax Plan,\" Sept. 29, 2015", "CNN/Money, \"Would Clinton's plan really create 10 million jobs?\" Aug. 17, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]