["By Eugene Kiely", "Posted on April 17, 2017", "Sen. Bernie Sanders wrongly claimed that voter turnout in 2016 was “the lowest … in 20 years.” In fact, turnout was higher than it was in 2012.", "The overall turnout was 60.2 percent in 2016, up from 58.6 percent four years earlier. In addition, the percentage of eligible voters casting ballots for president in 2016 was 59.3 percent — the third highest in the last 44 years. Only 2008 and 2004 were higher.", "Sanders, who ran unsuccessfully for the Democratic presidential nomination in 2016, and Democratic National Committee Chairman Tom Perez have launched what they are calling the “Come Together and Fight Back” tour to expand the Democratic base. The tour, which will cover eight states in six days, began April 17 in Portland, Maine.", "On CNN’s “State of the Union,” Sanders discussed the tour, which he said is “absolutely necessary … to help revitalize American democracy.”", "Sanders, April 16: So many of our people are giving up on the political process. It is very frightening. In the last presidential election, when Trump won, we had the lowest voter turnout over — in 20 years. And in the previous two years before that, in the midterm election, we had the lowest voter turnout in 70 years.", "Sanders is right about the 2014 midterm election. But he is wrong about the 2016 presidential election — which, of course, featured a highly contentious race between Donald Trump and Hillary Clinton.", "In Sanders’ defense, there were premature news reports in the days immediately following the election that said voter turnout in 2016 “dipped to nearly its lowest point in two decades,” as CNN reported on Nov. 11, 2016. But those early stories were based on incomplete voting tallies. The political blog FiveThirtyEight warned at the time that such stories were “almost certainly not true.”", "“The confusion is the result of news outlets trying to pin down voter turnout figures quickly in a system that doesn’t count millions of votes until weeks after the election,” Carl Bialik wrote for FiveThirtyEight on Nov. 15, 2016.", "Months after the election, Michael McDonald, an associate professor at the University of Florida, published data for the U.S. Elections Project that showed a little more than 138.8 million people voted in 2016 — representing 60.2 percent of the voting-eligible population. That was higher than in 2012 (58.6 percent of the voting-eligible population) and 2000 (55.3 percent), but lower than 2008 (62.2 percent) and 2004 (60.7 percent).", "Turnout can be calculated in two ways: as a percentage of the voting-eligible population (VEP) or as a percentage of the voting-age population (VAP). On his website, McDonald says the “most valid turnout rates over time and across states are calculated using voting-eligible population.” The reason is simple enough: The voting-age population includes a growing percentage of U.S. residents who are not eligible to vote — notably those who are not U.S. citizens.", "“Declining turnout rates, post-1971, are entirely explained by the increase in the ineligible population,” McDonald writes on his website. “In 1972, the non-citizen population of the United States was less than 2 percent of VAP and in 2004 it was nearly 8.5 percent of VAP.”", "McDonald told us he does not have overall turnout data prior to 2000, because “states have only recently begun reporting total ballots counted.”", "However, McDonald does have data that date to 1789 for ballots cast for the highest office — which in presidential years is for the president of the United States.", "Over the last 44 years, from 1972 to 2016, the percentage of eligible voters casting ballots for president exceeded 60 percent only twice: In 2008, when Barack Obama was elected the first black president in U.S. history, and in 2004, when President George W. Bush was reelected to a second term.", "In 2016, 59.3 percent of eligible voters cast ballots for president. That was the third highest percentage in the last 44 years, as shown in the chart below.", "In an email, McDonald said Sanders was right about low turnout in the 2014 midterm election. Turnout that year was just 36.7 percent of the voting-eligible population. “2014 was the lowest midterm turnout rate since 1942,” McDonald told us.", "But while Sanders has a point about the low level of participation in the 2014 midterm election, he’s wrong about the 2016 turnout being the lowest in 20 years.", "FactCheck.org Rating:", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]