["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "How common is it that a single mother with two children could qualify for $35,000 per year in welfare benefits and other government assistance?", "Once it became clear that Wisconsin Republican Glenn Grothman would win a U.S. House seat in the November 2014 elections, his penchant for making provocative statements gained national attention.", "So much so that, after Grothman claimed the seat held for 35 years by Tom Petri, we decided to publish an In Context article fleshing out five of his most biting sound bites. It quickly became one of our most popular items of the year.", "But while those statements were more opinion than fact, Grothman has also taken his turn on our Truth-O-Meter. He earned a True, for example, for saying a study showed that children who lived with a biological parent and the parent’s partner were 20 times more likely to be sexually abused.", "On Nov. 30, 2014, the congressman-elect made another statement that made us stop and say, \"Really?\"", "In an interview on \"Upfront with Mike Gousha,\" a statewide public affairs show on WISN-TV in Milwaukee, Grothman said welfare reform would be one of his priorities in Washington.", "Saying the first step is to educate people about benefits, he declared:", "\"A single parent with a couple kids can easily get $35,000 a year in total benefits between the healthcare and the earned income credit and the FoodShare and the low-income housing and what-have-you.\"", "Grothman went on to say that amount is a \"bribe not to work that hard or a bribe not to marry somebody with a full-time job.\"", "We wondered how easy it is for a single parent in Wisconsin to get $35,000 a year in state and federal benefits.", "Grothman’s evidence", "Grothman based his claim on a September 2012 memo from the Wisconsin Legislative Fiscal Bureau. The bureau is a well-respected nonpartisan scorekeeper of state budget matters.", "But it’s important to note this memo responded to a specific request Grothman made in his capacity as a state senator, rather than something the bureau produced on its own. Lawmakers often make requests of the bureau, but the way they tailor their requests can limit the bureau's analysis.", "Indeed, the memo was titled: \"Value of (state and federal) public assistance and student financial aid benefits and tax credits available to two hypothetical families.\"", "Both hypothetical families rented a three-bedroom apartment in West Bend (the Milwaukee suburb where Grothman then lived), had two children -- ages 3 and 7 -- and had no health insurance through an employer.", "The difference was that one hypothetical family was a single parent working part-time, earning $10,000 per year, and going to technical college full-time.", "The other example was a married couple. One parent worked full-time and the other worked part-time while attending technical college full-time. They earned $50,000 per year.", "When the Washington Post Fact Checker checked Grothman’s claim, it said Grothman based his $35,000 figure on what the memo estimated the single parent could potentially receive in two categories: public assistance and tax benefits.", "That is, more than $29,000 in public assistance --  including child care subsidies, rent assistance and food stamps -- and more than $5,000 in tax credits.", "When we spoke to Grothman, he cited different tallies from the memo.", "In addition to public assistance and tax benefits, the memo also did calculations in two more categories: student aid for the parent attending technical college and BadgerCare health care benefits.", "The grand totals for all four categories of benefits were vastly different. Roughly $47,000 for the single mother (again, public assistance being the largest category). And roughly $8,000 for the married couple (from student aid and health benefits, no public assistance).", "Although the difference between the two grand totals is about $39,000, Grothman said he claimed $35,000 just to give himself a \"cushion.\" And he said the intent of his claim was to highlight what he called the \"marriage penalty\" -- lower benefits for a married couple versus a single parent.", "Regardless of how Grothman explained the figure to the Fact Checker and to us, either way, there are problems with his characterization of the $35,000.", "Understanding the figure", "As the Fact Checker pointed out: \"It’s easy to pick and choose what would make up a person’s ‘welfare package,’ and tack a number to it. This is essentially what Grothman did\" in requesting the memo.", "The Fact Checker gave Grothman \"two Pinocchios,\" the second-lowest of their five ratings, for a claim that contains \"significant omissions and/or exaggerations.\"", "Grothman argued to us that his examples weren’t cherry picked -- that a single parent with two children is common, and so are the vast majority of benefits the single parent could receive, including child care, health care and food stamps.", "But in its memo, the fiscal bureau was careful to say \"no data exist on the number of households that may actually be receiving the combination of tax and program benefits\" listed for the hypothetical families.", "The memo added:", "\"Although the number of families who would qualify for all of the benefits described in this memorandum is unknown, it is likely to be quite small relative to the state’s overall population.\"", "One other point: Grothman made his claim in the context of reducing \"welfare\" benefits. But while some of the assistance he cites, such as food stamps, might commonly be considered to be welfare, other benefits -- including tax credits and student aid -- are not.", "Our rating", "Grothman said: \"A single parent with a couple kids can easily get $35,000 a year\" in public assistance in Wisconsin.", "On one level, Grothman is using a common example in terms of a single parent with two children, but his use of the word \"easily\" goes too far. The very analysis he cites as evidence concludes that only a small  percentage of Wisconsin residents would qualify for all of the various child care subsidies, housing aid, food stamps and tax benefits that Grothman cites.", "Our rating is Mostly False.", "To comment on this item, go to the Milwaukee Journal Sentinel website.", "WISN-TV, video of \"Upfront with Mike Gousha\" interview of U.S. Rep.-elect Glenn Grothman (quote at 5:50), Nov. 30, 2014", "Interview, U.S. Rep.-elect Glenn Grothman, Dec. 11, 2014", "Email exchange, Glenn Grothman campaign communications director Andy Post, Dec. 9, 2014", "Washington Post Fact Checker, \"Do ‘welfare’ recipients get $35,000 in benefits a year?\" Dec. 5, 2014", "Wisconsin Legislative Fiscal Bureau, memo to state Sen. Glenn Grothman, Sept. 26, 2012", "PolitiFact Wisconsin, \"Conservative Congressman-elect Glenn Grothman -- his most provocative comments, In Context,\" Nov. 17, 2014", "Cato Institute, \"Welfare: A Better Deal than Work\" August 2013", "Cato Institute, \"The work versus welfare trade off: 2013,\" published in National Review Online on Aug. 21, 2013", "Wisconsin Legislature, Sen. Glenn Grothman newsletter, 2011-'12 legislative session", "YouTube, video of MSNBC’s \"The Ed Show\" interview of U.S. Rep.-elect Glenn Grothman and U.S. Rep. Mark Pocan, aired Dec. 5, 2014", "Email interview, Wisconsin Council on Children and Families research director Jon Peacock, Dec. 11, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]