["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A patient room is shown on the hospice floor February 10, 2017 at the Tomah Veterans Affairs Medical Center in Tomah, Wis. (Mark Hoffman/Milwaukee Journal Sentinel).", "The opioid crisis has devastated communities, claimed lives and become a major campaign issue.", "In the Wisconsin U.S. Senate race, Republican challenger Leah Vukmir has slammed U.S. Sen. Tammy Baldwin, a Democrat, over an overprescription scandal at the Tomah Veterans Affairs Medical Center.", "In response, Baldwin launched her own campaign ad featuring the parents of late Marine Jason Simcakoski that claims that -- in the wake of the death -- Baldwin \"brought both parties together to help pass a law\" to \"make the VA accountable and also to stop the overprescribing of\" opioids.", "That’s what we want to look at here.", "The background", "To be sure, Baldwin’s ad sidesteps what happened in Tomah and the role she and her office played in handling information from a whistleblower.", "As we have noted in earlier items:", "Problems at the Tomah VA first made news in January 2015, when the California-based Center for Investigative Reporting exposed the overprescription of opioid drugs by the facility. Doctors had been handing out so many narcotic painkillers that some veterans had taken to calling the place \"Candy Land.\"", "Prior to that, on Aug. 29, 2014, Baldwin’s office received a report from the Department of Veterans Affairs’ Office of Inspector General following a 2½-year investigation of Tomah. Baldwin did not make the report public, though she shared it with a constituent who had complained to her about what was happening at Tomah. The report was not given to any other member of Congress at the time.", "A day later, Simcakoski died of a \"mixed use toxicity\" overdose at the Tomah VA while being treated by doctors there. Simcakoski had checked himself into the facility citing an addiction to painkillers and severe anxiety. He was prescribed 15 drugs, including anti-psychotics, tranquilizers, muscle relaxants and the opioid painkiller tramadol.", "In fact, after months of criticism about inaction on a whistleblower’s complaints about Tomah, Baldwin acknowledged her office had made mistakes, leading her to fire one staffer, demote another and dock the pay of her chief of staff.", "Vukmir has hammered Baldwin for months over the issue.", "During a September 2018 appearance on  \"Capital City Sunday\" on WKOW-TV, she said Baldwin was the only member of the Wisconsin congressional delegation \"to have a report outlining that a doctor was overprescribing opioids\" at the Tomah VA, \"later a veteran died\" and Baldwin \"covered it up.\"", "We rated Vukmir’s overall claim Mostly False.", "We found that Baldwin was the only one with the report and that she didn’t make the report public or go public with her concerns until the scandal made news. But she received the report only a day before the veteran died and -- while she did not publicize it -- an investigation by the U.S. Senate Ethics Select Committee into allegations of a coverup found the complaints lacked merit.", "Now to Baldwin’s claim", "What happened next", "In her claim, Baldwin is referring to legislation she co-authored -- the \"Jason Simcakoski Memorial and Promise Act.\" On the campaign trail, Baldwin has referred to it as \"Jason’s Law.\"", "And that’s what Baldwin’s campaign pointed to when we asked for evidence to support her claim.", "\"Jason’s Law includes multiple measures designed to hold the VA system more accountable for the care of veterans and provide stricter opioid prescription guidelines,\" said campaign spokesman Bill Neidhardt. \"Since being signed into law, Jason’s Law has helped improve the VA, where they’ve seen lower opioid prescribing rates and increased numbers of physicians who receive updated training.\"", "Now to the specifics:", "Bipartisan bill: According to a June 22, 2015 news release, Baldwin and U.S. Sen. Shelley Moore Capito, R-W.Va., introduced the initial measure. The news release shows supporters at the time included 11 other senators -- nine of them Democrats and two of them Republicans. Among the Republicans: Ron Johnson of Wisconsin.", "A July 13, 2016 report from WSAW TV and the Associated Press said Baldwin’s bill and one from U.S. Rep. Ron Kind, a Wisconsin Democrat, were included in the Comprehensive Addiction and Recovery Act, or CARA, made up of 12 bills.", "That measure passed the Senate in a 94-1 vote. On July 22, 2016, President Obama signed the package into law.", "Johnson himself referred to the measure as \"a bipartisan step.\"", "VA accountability/overprescribing: That portion of the claim is supported by a May 9, 2018 appearance by VA Deputy Under Secretary Carolyn Clancy on C-SPAN.", "In the interview, Clancy said \"we’ve seen a 47 percent decrease in the number of veterans on chronic opioids in Tomah, which is a little ahead of the national average. We’ve made great progress overall. For the proportion of patients on both a benzodiazepine and an opioid, which has a very high risk of adverse events, the decrease has been 76 percent at Tomah which is a little bit ahead of the national decrease.\"", "In April 2018, the Tomah VA became one of 18 veterans hospitals across the country involved in the \"Whole Health\" program. The program considers the physical, mental, emotional, spiritual, and environmental elements that work together to provide the best quality of life for each veteran, according to the U.S. Department of Veterans’ Affairs.", "\"We will never eradicate the need for opioids, but I think by combining it with the nontraditional therapy and taking the whole look at the veteran and veterans' needs, we will be able to manage pain and still let the veterans have a quality of life that they need,\" Victoria Brahm, director of the Tomah VA, said in an April 23, 2018 Associated Press story.", "So, on the narrow points of Baldwin’s claim, she is on target -- even as she ignores missteps by her office that could have mitigated the problems.", "Alec Zimmerman, spokesman for the Republican Party of Wisconsin, said Baldwin had left \"our state’s heroes in danger\" and that rather than taking immediate action \"was trying to save her political future.\"", "Our rating", "A Baldwin campaign ad claims she \"brought both parties together to help pass a law\" to \"make the VA accountable and also to stop the overprescribing of\" opioids.", "The action came only after the overprescription scandal made headlines -- something ignored in the ad. Likewise, the ad sidesteps key missteps by Baldwin’s own office.", "Nevertheless, the claims in this ad are narrowly drawn.", "We rate Baldwin’s claim Mostly True.", "YouTube, \"Marv and Linda,\" Sept. 26, 2018.", "Milwaukee Journal Sentinel, \"U.S. Sen. Tammy Baldwin visits Tomah VA with parents of Marine veteran Jason Simcakoski,\" July 29, 2018.", "Milwaukee Journal Sentinel, \"Bice: Tomah VA whistleblower says it would be ‘immoral’ to support Sen. Tammy Baldwin,\"", "PolitiFact Wisconsin, \"Leah Vukmir cites Tammy Baldwin inaction on Tomah VA scandal, but lacks evidence of ‘cover up,’  Oct. 3, 2018.", "WKOW-TV, Leah Vukmir interview (6:00 mark), Sept. 23, 2018", "Press release Sen. Shelley Moore Capito (R-W.Va.),  \"Capito, Baldwin Introduce Bipartisan VA Reform Legislation,\" June 22, 2015.", "WSAW/AP,  \"Congress sends opioid bill honoring Simcakoski to president,\" July 13, 2016.", "Congress.gov, \"The Comprehensive Addiction And Recovery Act Of 2016 (S.524\"), 114th Congress (2015-2016)", "C-SPAN, VA Deputy Under Secretary Dr. Carolyn Clancy,  May 9, 2018, 50.24 mark.", "Email, Baldwin campaign spokesman Bill Neidhardt, Nov. 1, 2018.", "Email, Alec Zimmerman, spokesman for the Republican Party of Wisconsin, Nov. 2, 2018.", "American Society of Addiction Medicine, \"Summary of the Comprehensive Addiction and Recovery Act.\"", "U.S. Department of Veterans Affairs,  \"Whole Health for Life.\"", "APG Media \"VA uses alternate therapies to reduce opioid use,\"  April 23, 2018.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]