["While former Vice President Joe Biden oversaw foreign policy in Ukraine, his son Hunter Biden served on the board of Burisma Holdings, the largest gas company in the fledgling democracy.", "Despite a recently concluded investigation by Senate Republicans that found no wrongdoing by the Bidens, claims to the contrary have continued to circulate on social media.", "\"VP Biden threatened to withhold 1 billion dollars from Ukraine to save his son's job,\" reads a meme posted to Facebook by Secure America Now. The meme has been shared more than 9,000 times since Oct. 18.", "Secure America Now did not respond to a request from USA TODAY for comment.", "Fact check:Joe Biden's childhood apartment later became Section 8 housing", "It's true that Joe Biden leveraged $1 billion in aid to persuade Ukraine to oust its top prosecutor, Viktor Shokin, in March 2016. But it wasn't because Shokin was investigating Burisma. It was because Shokin wasn't pursuing corruption among the country's politicians.", "As European and American diplomats pressed Ukraine to clean up its corruption, they focused on Shokin's leadership of the Prosecutor General's Office, which he took over in February 2015.", "Mike Carpenter, who served as a foreign policy adviser to the then-vice president, told USA TODAY that Shokin \"never went after any corrupt individuals at all\" and \"never prosecuted any high-profile cases of corruption.\"", "Fact check:Claims that Hunter Biden received $3.5M from Russia are unproven, lack context", "Charlie Kupchan, who was a special assistant to President Barack Obama and a senior director for European Affairs on the National Security Council, said anti-corruption efforts were \"a big part of our diplomacy\" with Ukraine, since \"it was that corruption that allowed Russia to manipulate the country politically and economically.\"", "As a result, Biden leveraged $1 billion in aid as \"a stick to move Ukraine forward,\" Kupchan said. \"He was acting alongside our European allies. Everybody was of a single mind that this prosecutor was not the right guy for the job.\"", "Daria Kaleniuk, the co-founder and executive director of the Anti Corruption Action Centre in Kyiv, Ukraine, credited Biden, the International Monetary Fund — which threatened to delay $40 billion in aid for similar reasons — and others with the prosecutor's removal.", "\"Civil society organizations in Ukraine were pressing for his resignation,\" Kaleniuk said, \"but no one would have cared if there had not been voices from outside this country calling on him to go.\"", "After Shokin left the Prosecutor General's Office, Jan Tombinski, the ambassador from the European Union to Ukraine, called it \"an opportunity to make a fresh start.\"", "\"I hope,\" Tombinski said, \"that the new Prosecutor General will ensure that the Office of the Prosecutor General becomes independent from political influence and pressure and enjoys public trust.\"", "Fact check:Joe Biden never said he would have prevented all COVID-19 deaths", "Burisma Holdings was not under scrutiny at the time Joe Biden called for Shokin to be removed, per the National Anti-Corruption Bureau of Ukraine, an independent agency that has worked closely with the FBI.", "In 2014, Shokin had investigated Burisma for money laundering and tax irregularities, per USA TODAY.", "The probe focused on 2010-12, according to the National Anti-Corruption Bureau.", "Hunter Biden — who joined the board in 2014 and served on it until early 2019 — was not the subject of the investigation.", "More:GOP-led Senate committees: Hunter Biden work in Ukraine a conflict of interest, impact 'unclear'", "The case was settled in court in 2017.", "The recent report by Senate Republicans also contained no evidence that Joe Biden had pressured Ukraine to fire its top prosecutor as a way to protect his son, according to the Associated Press.", "Andrew Bates, a spokesman for Biden, also said any suggestion of impropriety is false.", "“Investigations by the press, during impeachment, and even by two Republican-led Senate committees whose work was decried as 'not legitimate' and political by a GOP colleague, have all reached the same conclusion: that Joe Biden carried out official U.S. policy toward Ukraine and engaged in no wrongdoing,” Bates told USA TODAY.", "Fact check:In 1973, Biden said 'the two-party system' was 'good for the negro'", "Based on our research, the claim that Joe Biden threatened to withhold $1 billion from Ukraine to save his son's job is FALSE. The then-vice president leveraged aid dollars to persuade the country to oust its top prosecutor as part of anti-corruption efforts endorsed by other international players that were unrelated to his son, Hunter Biden.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]