["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A new book —\n\nThe Obama Nation\n\nby Jerome R. Corsi — attacks Barack Obama as a political extremist. Taken as a whole, the book's primary argument is that Obama is a likely communist sympathizer with ties to Islam who has skillfully hidden his true agenda as he ruthlessly pursues elected office.", "We found factual problems with Corsi's book and question its overall tone;\n\nread our extended story here.", "Corsi's description of Obama's role in Kenyan politics is filled with errors and innuendo. Corsi focuses on a 2006 trip Obama made to Africa as a U.S. senator. The visit included stops in South Africa, Kenya and Chad.", "Obama's trip came about a year before elections were scheduled in Kenya. On one side was incumbent President Mwai Kibaki; one of his main challengers was Raila Odinga.", "Corsi alleges in his book that Obama openly supported Odinga, because Obama wanted to avenge his father's tribe, the Luo, against rival tribes. Corsi also suggests that Odinga is a socialist and was part of an alliance with Muslims to expel Christians in Kenya.", "There are a number of problems here. First, we reported previously that\n\nOdinga is not a socialist\n\n. The alliance Corsi describes between Muslims and socialists seems conjecture at best. Corsi himself says his case hinges on a secret memo that he admits may or may not exist. Corsi then states that Odinga \"professes to be an Anglican Christian\" but adds that \"concerns even today continue to circulate among Kenya's Christian leaders ... that Odinga intends to pursue an undeclared radical Islamic political agenda.\" His argument here is highly speculative.", "What we can confirm is that Obama has remained neutral in Kenyan politics, and did not support Odinga during his trip. Odinga attended some of Obama's events while Obama was in Kenya, and clearly wanted to associate himself with Obama, but there is no evidence to indicate that Obama \"openly supported\" Odinga. (We previously reported on\n\na letter from missionaries\n\nthat alleged Obama contributed to Odinga's campaign; we rated it\n\nPants on Fire!\n\nwrong.)", "For this statement, we decided to scour the public record for evidence that Obama supported Odinga.\nWe looked to contemporary accounts of the 2006 trip and found a transcript from an interview Obama gave to a Kenyan newspaper that directly contradicts Corsi's allegation.", "Question: \"As you prepared to travel to Kenya you were obviously conscious of two things. One was about being drawn into local politics. The other was the high expectations of what you could do for Kenya now that you are a senator. How did you handle both?\"", "Obama: \"One of the things we try to do is meet with all parties. I met President Kibaki, I met Uhuru Kenyatta, I was with Raila Odinga. We met the government, met the opposition and met other groups such as human rights activists. What I try to do is give a consistent message on what I think U.S.-Kenya relations should be, but not to suggest somehow that I think one party is better than the other. That's for the Kenyan people to decide.\"", "Also, Obama's gave a high-profile speech the need for the country to move beyond corruption and tribal rivalries. This undercuts Corsi's theory that Obama was motivated by his Luo tribal heritage.", "\"Finally, ethnic-based tribal politics has to stop,\" Obama said in his speech at the University of Nairobi on Aug. 28, 2006. \"It is rooted in the bankrupt idea that the goal of politics or business is to funnel as much of the pie as possible to one's family, tribe, or circle with little regard for the public good. It stifles innovation and fractures the fabric of the society. Instead of opening businesses and engaging in commerce, people come to rely on patronage and payback as a means of advancing. Instead of unifying the country to move forward on solving problems, it divides neighbor from neighbor.\"", "Corsi states that Obama \"openly supported\" Raila Odinga. We found public statements from Obama during the trip saying the exact opposite. We found no other evidence to support Corsi's statement, so we rate his statement False.", "The Associated Press,\n\nObama Urges Kenyans to Oppose Corruption\n\n, Aug. 28, 2006", "BBC News,\n\nCountry Profile: Kenya", "The Daily Nation,\n\nInterview with Barack Obama\n\n, Sept. 1, 2006; premium access, accessed via Nexis; also available via\n\nProperty Kenya", "Barack Obama U.S. Senate Web site,\n\nSpeech in Kenya: \"An Honest Government, A Hopeful Future,\"\n\nAug. 28, 2006", "USA Today,\n\nObama urges Kenyans to oppose corruption, ethnic divisions in government\n\n, Aug. 28, 2006", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]