["By Angelo Fichera", "Posted on March 6, 2019", "Rep. Alexandria Ocasio-Cortez wasn’t “fired” from a hot-dog franchise for “incompetence,” despite what a popular meme says.", "A viral Facebook image serves up a fact-free claim that Rep. Alexandria Ocasio-Cortez of New York was once fired from a fast-food job for “incompetence.”", "The meme alleges that Ocasio-Cortez “was fired from ‘Hot Dog on a Stick’ in 2008 – for incompetence. And the Democrats elected her to Congress.”", "That work of fiction was published Feb. 9 on the Facebook page of a self-described satirical publication, America’s Last Line of Defense. But the meme gained traction through thousands of shares, as well as new posts, with no disclaimer of its satirical intent. The claim also surfaced on Twitter.", "Observant users who came across the meme might have deduced the obvious: that the employee shown in the photo is not Ocasio-Cortez.", "A reverse image search shows that picture is readily available on a meme-generating website, and, as Gizmodo points out, the image was posted on the photo website Flickr in 2008 with a tag for Los Angeles. Zooming into the photo shows that the woman’s name tag reads “Stephanie.”", "Also, Hot Dog on a Stick has no locations on the East Coast. Ocasio-Cortez, who grew up in New York, was attending Boston University in 2008.", "A Republican Facebook group shared an actual image of the congresswoman that further embellished on the bogus termination, claiming her attendance was “unreliable,” for example.", "The falsehood evidently caught the attention of the franchise’s parent company.", "“We actually looked into this when it first started circulating,” Kathleen Shaffer, senior director of creative and communications for the Global Franchise Group, said in an email to FactCheck.org. “According to our records, no person by the name of Alexandria Ocasio-Cortez was ever employed with Hot Dog on a Stick.”", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on the social media network.", "“About Us.” WeAreTheLLOD.com. Accessed 5 Mar 2019.", "Novak, Matt. “7 More Viral Photos That Are Totally Fake.” Gizmodo. 12 Feb 2019.", "“Participating locations.” Hot Dog on a Stick. Accessed 5 Mar 2019.", "Shaffer, Kathleen. Senior director of creative and communications, Global Franchise Group. Email sent to FactCheck.org. 5 Mar 2019.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]