["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "U.S. Sen. Ted Cruz of Texas, the Republican seeking a second term against Democratic U.S. Rep. Beto O’Rourke, portrayed O'Rourke as wildly out of step with Texas in part, Cruz said, by standing against police officers who protect communities with their lives.", "Cruz offered as backup in the pair's Sept. 21, 2018, debate at Southern Methodist University a flawed charge that O’Rourke, who represents El Paso in the House, voted against body armor for sheriffs. That's False, we’ve ruled, in that there was no such vote.", "Cruz also said O'Rourke had said he’d be open to abolishing Immigration and Customs Enforcement. We've found that claim Mostly True though O’Rourke also has said he wouldn’t eliminate the agency without another department absorbing its duties.", "Cruz said next: \"And just this week, Congressman O’Rourke described law enforcement, described police officers, as modern-day Jim Crow.\" Cruz called that descriptive--which refers to the post-Reconstruction practice of denying black Americans equal rights on all fronts--offensive. \"That is not Texas,\" Cruz said.", "O’Rourke replied in the debate: \"What Sen. Cruz said is simply untrue. I did not call police officers modern-day Jim Crow.\"", "So, did he?", "By email, Catherine Frazier of Cruz’s campaign told us Cruz was referring to O’Rourke’s reply to a question during a Sept. 19, 2018, event at Prairie View A&M University as recapped by the conservative Daily Caller. Frazier also noted a press release critical of O’Rourke’s characterization issued by the Texas Municipal Police Association.", "Facebook Live video", "To see all that O'Rourke said, we turned to the O’Rourke campaign’s Facebook Live video of the Prairie View event.", "About 58 minutes in, O’Rourke was asked a question we had trouble making out about how he’d address the needs of former slaves.", "In reply, O’Rourke referred to the discovery this year of dozens of unmarked graves in Texas’s Fort Bend County indicating, he said, that well after the Civil War, law officers would arrest African American residents for idling and petty crimes to fill out work crews for contractors, a notorious convict-leasing system, according to a Houston Chronicle news story.", "O’Rourke said such individuals were \"people who became convicts solely by dint of the color of their skin,\" he said, under a system that was \"radically unjust.\"", "O’Rourke went on:", "\"That injustice, to many more people here that I know firsthand, continues to persist today. That system of suspending somebody, solely based on the color of their skin; searching that person solely based on the color of their skin; stopping that person solely based on the color of their skin; shooting that person solely based on the color of their skin; throwing the book at that person and letting them rot behind bars solely based on the color of their skin, is why some have called this, I think it is an apt description, the new Jim Crow.\"", "He said next: \"We have written people off and written people out of the economic life of this country, their ability to participate in the future of the United States of America. We have literally drawn people out of their state House, their congressional, their state Senate districts solely based on the color of their skin.\"", "Some outside perspective: A 2010 book, \"The New Jim Crow: Mass Incarceration in the Age of Color Blindness,\" includes a chapter in which author Michelle Alexander, of late an oped columnist for the New York Times, says the imprisonment of 1 million black American men can greatly be attributed to how police and the criminal justice system handle the pursuit, detention and prosecution of black men, many times for drug crimes oft ignored when committed by white people. It adds up to discrimination that’s perfectly legal, Alexander writes, because it’s based on a person’s criminal record. \"In the system of mass incarceration,\" Alexander writes, \"a wide variety of laws, institutions, and practices--ranging from racial profiling to biased sentencing policies, political disenfranchisement, and legalized employment discrimination--trap African Americans in a virtual (and literal) cage.\"", "O'Rourke camp disputes Cruz's claim", "Chris Evans of O’Rourke’s campaign answered our inquiry with an email disputing Cruz’s conclusion that O’Rourke called law enforcement or police officers the new Jim Crow.", "Evans stressed that O’Rourke was speaking, as he said, to the \"system.\" Evans wrote: \"As Beto has done at many forums in the past, he outlined how institutionalized inequity -- in education, in economics, in health care, in the justice system, in housing, in transportation -- has been referred to as the New Jim Crow.\"", "Evans also pointed us to an August 2018 O’Rourke commentary published in the Chronicle. In it, O’Rourke describes his tour of the Harris County Jail, which he calls \"part of the world’s largest prison population. One that is disproportionately comprised of people of color, though we know that people of all races use illegal drugs at roughly the same rate. Many have called this the New Jim Crow, and for good reason.\" In the commentary, O’Rourke goes on to talk about the share of black children with a parent in the U.S. criminal justice system and he says that such results begin with a \"school-to-prison pipeline\" starting as early as kindergarten, where a black child is far more likely than a white child to be suspended or expelled, he says.", "Evans further emailed us web links to fact-checks by NBC and the Associated Press of Cruz’s debate statement, each one stating the senator oversimplified what O’Rourke had said at the university.", "Our ruling", "Cruz said O’Rourke described police as \"modern-day Jim Crow.\"", "This claim has an element of truth in that O’Rourke’s embrace of the \"new Jim Crow\" description followed his excoriation of police stops, searches and shootings he attributed to the color of a person’s skin. But O’Rourke also said such actions rank among ways the country systematically discriminates against black residents--extending, he said, to sentencing, economic opportuniy and to how lawmakers carve districts.", "We rate this claim Mostly False.", "MOSTLY FALSE – The statement contains an element of truth but ignores critical facts that would give a different impression. Click here for more on the six PolitiFact ratings and how we select facts to check.", "Fact-checks, PolitiFact Texas, \"Ted Cruz says Beto O'Rourke is 'open to abolishing ICE,'\" Aug. 6, 2018; \"PAC backing Ted Cruz falsely says Beto O'Rourke voted against body armor for border sheriffs,\" Sept. 13, 2018", "Emails (excerpted), Catherine Frazier, senior communications adviser, Ted Cruz campaign, Sept. 24, 2018", "Facebook Live video, Beto O’Rourke appearance, HBCU town hall, Prairie View A&M University, Beto O’Rourke campaign, Sept. 19, 2018 (audience member question about the 58-minute mark)", "News story, \"'They lived a hard life': New details emerge about remains found at Fort Bend ISD construction site,\"  Houston Chronicle, updated July 18, 2018 (accessed Sept. 24, 2018)", "Book, \"The New Jim Crow,\" Michelle Alexander, The New Press, 2010 (chapter 5 accessed on Google Books, Sept. 25, 2018)", "Email, Chris Evans, communications director, Beto O’Rourke campaign, Sept. 25, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]