["About this rating", "Stockpiles of some types of personal protective equipment such as N95 masks were depleted by the Obama administration’s response to the 2009 H1N1 outbreak, and had not been replenished by the time the COVID-19 outbreak began.", "The ventilator supply, specifically, was not depleted under the Obama administration, though it did fall short of what experts said would be needed in the event of a severe pandemic.", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "At the onset of the 2020 COVID-19 pandemic, U.S. President Donald Trump repeatedly claimed that he inherited a “bare” Strategic National Stockpile (SNS) that lacked an adequate supply of ventilators from the administration of former President Barack Obama, hindering Trump's ability to adequately respond to the growing number of coronavirus cases across the nation. We revisited the timeline of the pandemic and the various (and contradictory) statements issued by Trump and his administration to check the accuracy of this claim.", "The SNS is overseen by the Centers for Disease Control and Prevention (CDC), and is allocated as a resource to supplement state and local authorities in their response to public health emergencies. In addition to many state stockpiles, the federal stockpile includes medicines, supplies, and devices needed for life-saving care that are strategically located at secret warehouse locations around the country.", "According to a timeline published by the Department of Health and Human Services, the stockpile has been used at least 13 times since its 1999 creation, including during responses to the Sept. 11, 2001, terror attacks, and 2005 hurricanes Katrina and Rita.", "A mechanical ventilator is a breathing machine used to assist a patient suffering from respiratory distress, or a condition that makes it difficult for them to breathe on their own. SARS-CoV-2, the novel coronavirus responsible for the 2020 pandemic, causes COVID-19, one such respiratory condition that can make it difficult for an infected person to breathe on their own.", "A ventilator pushes warm, moist air (or air with increased oxygen) to the patient. Exhaled air flows away from the patient. NIH", "Concern over whether the U.S. had enough ventilators took center stage in early 2020 — shortly after the coronavirus outbreak was declared a pandemic by the World Health Organization on March 11. When New York Gov. Andrew Cuomo asked the federal government for additional ventilators, Trump responded by criticizing Cuomo’s handling of the pandemic, saying that the state should have stockpiled ventilators.", "During a March 26 press briefing, Trump tried to buck the blame for a shortage of ventilators, saying that he had taken over an “empty shelf.” The president reiterated the claim just over a week later, adding that the depleted stockpile he supposedly inherited impacted his administration’s ability to respond to the pandemic.", "Hey, I inherited — we, this administration — we inherited a broken system, both militarily, but we’ve rebuilt our military where we now have so much ammunition, whereas you remember a very important general said, “Sir, we have no ammunition.” They wanted to save money on ammunition.", "They didn’t want to save money because they spent money like nobody ever spent money. But you know what? We now have a great military rebuilt. And we have so much ammunition, we don’t know what to do with it. Okay? And that’s a nice feeling to have.", "But they also gave us empty cupboards. The cupboard was bare. You’ve heard the expression: “The cupboard was bare.” So we took over a stockpile where the cupboard was bare and where the testing system was broken and old. And we redid it.", "Though Trump repeatedly blamed the Obama administration for leaving behind an empty stockpile and falsely took credit for restocking the ventilator supplies, he said on more than one occasion that the U.S. had enough ventilators in the weeks following the pandemic declaration. In the April 7 press briefing, Admiral Brett Giroir, assistant secretary of HHS, said that the number of ventilators is not a “number that we give out” but said that there were thousands remaining in the stockpile. Trump quickly added that there were 9,000 breathing machines.", "In an April 8 Tweet, the White House said that it had shipped out 8,000 ventilators and had an “additional 10,000 ready to go.” An op-ed written by Vice President Mike Pence added that the SNS \"hadn’t been refilled since the H1N1 influenza outbreak in 2009, and it had only 10,000 ventilators on hand\" in March — an inadequate number given the extent of the pandemic — but that by the June 16 publication of his piece, there were more than 30,000 ventilators in the SNS and that the administration was “well on [its] way to building 100,000 ventilators in 100 days.” It appeared that the Trump administration initially recognized that the ventilator supply was inadequate to respond to the pandemic, but failed to supplement the limited inventory despite promises to do so.", "The discrepancy continued well into 2020. Some references:", "While it is true that the Trump administration had inherited a depleted supply of some personal protective equipment (PPE) like N95 respirator masks, it is not accurate to say that the stockpile was left \"bare\" or depleted of ventilators. The SNS had 16,600 ventilators “immediately available for use” at the beginning of the COVID-19 pandemic, according to a spokesperson with the Department of Health and Human Services (HHS) who spoke with FactCheck.org in June 2020:", "[T]here were 16,660 ventilators in the Strategic National Stockpile (SNS) inventory immediately available for use when the SNS began deploying ventilators in March 2020 in support of the COVID-19 response. All of these ventilators were serviced, recertified and operable. An additional 2,425 ventilators were in maintenance at that time as part of the normal and routine maintenance process. Every ventilator and resupply kit in the SNS is serviced regularly by a contracted commercial vendor to meet or exceed the manufacturer’s recommended maintenance schedule. In general, prior to March of this year, the SNS stored approximately 19,000 ventilators in its inventory for many years, and this number fluctuated on any given day depending on the number of ventilators in scheduled maintenance. … [I]n January 2017 the total number of ventilators in the SNS inventory immediately available for use would not have been much different than what the SNS had immediately available for use in March 2020.", "The spokesperson added that the stockpile would likely have held the same number of ventilators in January 2016 when Trump was inaugurated, suggesting that ventilator stock left by the Obama administration was considered adequate by HHS when Trump took office. Snopes contacted the HHS to confirm the above figures, but had not received a response at the time of publication.", "However, given the nature of the 2020 pandemic, health experts argued that ventilator inventory at the onset of the outbreak was inadequate, and the Trump administration should have immediately taken measures to increase the inventory of ventilators and other emergency medical supplies.", "As part of the COVID-19 response, the SNS deployed more than 14,500 tons of cargo to states, according to data published on Sept. 16, 2020. An HHS document submitted to the House Committee on Oversight and Reform criticized the low number of ventilators that had been distributed from the stockpile in April 2020, suggesting that the outsourced 7,920 ventilators were inadequate compared with the estimated need of 139,000 machines.", "“Now that the national stockpile has been depleted of critical equipment, it appears that the Administration is leaving states to fend for themselves, to scour the open market for these scarce supplies, and to compete with each other and federal agencies in a chaotic, free-for-all bidding war,” said committee chairwoman Rep. Carolyn Maloney in a statement.", "In late September 2020, the SNS noted that under the joint direction of the Federal Emergency Management Agency and HHS, it had deployed all remaining PPE in its inventory but for a reserve of 10% for the “critical needs of frontline healthcare workers serving in federal response efforts.” However, the specific number of ventilators distributed as of this writing is not known. In the years leading up to the COVID-19 pandemic, health experts warned that the SNS had too few ventilators to adequately respond to a large-scale outbreak.", "Although the ventilators weren't \"depleted\" when Trump came into office, there had already been warnings that there was an inadequate supply during the Obama administration. A 2016 report found that during the 2009 H1N1 pandemic, 19.6 million pieces of PPE were deployed across the country, including the disbursement of 85.1 million N95 respirators considered depleted in 2020.", "The National Institutes of Health study also published a study in January 2011 concluding that the “current ventilator supply in the United States is nowhere near sufficient to meet the projected needs of a pandemic.” An April 2015 study published in the journal, Clinical Infectious Diseases, added that the next pandemic would “likely produce a surge in patients” that would “require mechanical ventilation” caused by a severe flu pandemic, which would suggest that the U.S. would likely need up to 60,000 additional ventilators for an extreme outbreak.", "It is not known how many ventilators are in inventory in late September 2020, but the HHS said that it maintains at least $8 billion in antibiotics, vaccines, antitoxins, and antivirals, among other medications.", "Biesecker, Michael.   \"US ‘Wasted’ Months Before Preparing for Coronavirus Pandemic.\"\r\n    The Associated Press.   5 April 2020.", "\"2017-2018 Public Health Emergency Medical Countermeasures Enterprise (PHEMCE) Strategy and Implementation Plan.\"\r\n    U.S. Department of Health and Human Services.   Dec. 2017.", "Burel, Greg.   \"Evolving the Scope of the Strategic National Stockpile.\"\r\n    DomesticPreparedness.com.   27 Nov. 2019.", "Cohen, Marshall, Lybrand, Holmes, Subramaniam, Tara.   \"Fact Check: Ignoring Years of Warnings, Trump Falsely Claims ‘Nobody in their Wildest Dreams’ Predicted a Ventilator Shortage.\"\r\n    CNN.   19 March 2020.", "\"New Document Shows Inadequate Distribution of Personal Protective Equipment and Critical Medical Supplies to States.\"\r\n    House Committee on Oversight and Reform.   8 April 2020.", "\"The Obama Administration Left Trump with a ‘Stockpile with a Cupboard that was Bare.’\"\r\n    PolitiFact.   6 April 2020.", "Brown, Matthew.   “Fact Check: Did the Obama Administration Deplete the Federal Stockpile of N95 Masks.\"\r\n    USA Today.   3 April 2020.", "Farley, Robert.   “Trump’s Misleading Ventilator Counter-Punch at Cuomo.\"\r\n    FactCheck.org.   26 March 2020.", "Dale, Daniel.   “Fact Check: Trump Claimed He Was Left With ‘No Ventilators.’ His Administration Just Confirmed He Had More Than 16,000.\"\r\n    CNN.   24 June 2020.", "Gore, D’Angelo.   “Trump Inherited More Ventilators Than Have Been Distributed.\"\r\n    FactCheck.org.   22 June 2020.", "Bennet, Geoff, Gregorian, Dareh.   “Ousted HHS Official Files Whistleblower Complaint on coronavirus Response.\"\r\n    NBC News .   5 May 2020.  \r\n\r\nTimm, Jane.   “Fact Check: Trump Falsely Claims Obama Left Him ‘Nothing’ in the National Stockpile.\"\r\n    NBC News .   6 May 2020.", "Patel, Anita, et al.   “Personal Protective Equipment Supply Chain: Lessons Learned from Recent Public Health Emergency Responses.”\r\n    Health Security .   1 June 2017.", "Meltzer, Martin.   “Estimates of the Demand for Mechanical for Mechanical Ventilation in the United States During an Influenza Pandemic.”\r\n    Clinical Infectious Diseases .   10 April 2015.", "Manuell, Mary-Elise, Co, Mary, Ellison, Richard.   “Pandemic Influenza: Implications for Preparation and Delivery of Critical Care Services.”\r\n    Journal of Intensive Care Medicine .   10 Jan 2011.", "“WHO Director-General’s Opening Remarks at the Media Briefing on COVID-19.”\r\n    World Health Organization.   11 March 2020.", "“Remarks by President Trump During a Roundtable with Governors on the Reopening of America’s Small Businesses.”\r\n    The White House.   18 June 2020.", "“There Isn’t a Coronavirus ‘Second Wave.’”\r\n    The White House.   16 June 2020.", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]