["By Rem Rieder", "Posted on July 24, 2020", "During a virtual campaign event with members of the Service Employees International Union on July 22, presumptive Democratic presidential nominee Joe Biden falsely said that McDonald’s required its employees to sign noncompete contracts preventing them from going to work for other fast-food restaurants such as Burger King.", "There is no evidence to support this. McDonald’s says that is not the case. And McDonald’s discontinued a related practice, barring workers from moving from one store inside the company to another, in 2017.", "It appears Biden meant to describe that practice. But he didn’t, and he picked the wrong company to use as an example.", "Biden, July 22: McDonald’s making billions of dollars, but here’s the deal they’ve made you all sign noncompete contracts that you cannot go across town to try to get a job at Burger King. And maybe, and I’m not saying you could, but you get 10 cents an hour more. People who are hourly workers are required to sign noncompete.", "A McDonald’s spokesperson told us, “Biden was incorrect in claiming that McDonald’s hourly workers are or were required to sign noncompete agreements.”", "Orley C. Ashenfelter, a Princeton University professor and coauthor of a study on franchise contracts that focused heavily on the fast-food industry, told us that fast-food chains don’t block workers from going to work for their competitors.", "Many chains have, however, blocked employees from moving to another franchise within the same company.", "Articles on such “no-poach” agreements preventing fast-food workers from transferring inside the company point out that the rules don’t apply to leaving for another company.", "We asked the Biden campaign for evidence to support the candidate’s claim. We received nothing about noncompete contracts. Instead, we received a link to a news story about three companies — Burger King, Popeyes and Tim Hortons — in March eliminating the internal “no-poach” provisions. The Biden campaign website calls for the elimination of both noncompete and no-poaching agreements.", "“As president, Biden will work with Congress to eliminate all non-compete agreements, except the very few that are absolutely necessary to protect a narrowly defined category of trade secrets, and outright ban all no-poaching agreements,” the campaign site says.", "The “no-poach” agreements came to the fore in a Sept. 27, 2017, article in the New York Times headlined “Why Aren’t Paychecks Growing? A Burger-Joint Clause Offers a Clue.” The article cited research on the subject by two Princeton professors, Ashenfelter and Alan Krueger, who was chairman of the Council of Economic Advisers in the Obama administration. (Krueger died in 2019.)", "The professors found the practice was particularly widespread in the fast-food industry. And by preventing workers from going to another franchise inside the chain, the agreements could depress wages, they concluded.", "Most workers were unaware of the “no-poach” provision; they learned about it only if and when they tried to move to a job with another outlet in the same chain, perhaps for a pay raise. That’s because the provisions were contained in agreements between franchisees and the parent company.", "After reading the Times story, Washington state Solicitor General Noah Purcell asked state Attorney General Bob Ferguson to investigate. Ferguson did. In June, Ferguson said his efforts had impelled 237 companies over two years to sign legally binding agreements to end the practice, not just in Washington but nationally.", "McDonald’s, which had dropped the practice in 2017 after it was sued, was among the companies signing an agreement.", "A coalition of 13 states and the District of Columbia has waged a campaign to get chains to sign similar agreements.", "We asked Ashenfelter why the “no-poach” agreements were such a problem if workers could move on to other fast-food operators.", "“There is no easy answer to that,” he responded via email. “In effect competition is reduced so, in equilibrium wages must be lower. How much? As we show that depends on how many other chains there are in the labor market and how willing workers are to move.”", "Noncompete agreements are typically used in the case of higher-income workers when companies are afraid they will give secrets to competitors. Krueger told the Times in 2017, “I think it’s very hard to make the argument that noncompetitive agreements are necessary for low-educated, low-wage workers because they have trade secrets. This practice does have the potential to restrict competition and significantly influence pay.”", "The news article forwarded by the Biden campaign was about three companies agreeing earlier this year to drop “no-poach” agreements. The Biden spokesperson said in an email, “On McDonalds and other fast food restaurants, there is an ongoing effort to address this issue that didn’t end with the 2018 settlement. … The waves of recent announcements like this show that it’s still a problem.”", "That may be the case. But Biden was wrong when he singled out McDonald’s. The company does not have noncompete clauses to prevent its workers from going to work for Burger King or other fast-food chains. And it dropped the “no-poach” policy barring workers moving from one McDonald’s to another three years ago.", "Editor’s note: FactCheck.org does not accept advertising. We rely on grants and individual donations from people like you. Please consider a donation. Credit card donations may be made through our “Donate” page. If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, 202 S. 36th St., Philadelphia, PA 19104.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]