["About this rating", "A screenshot purporting to show a message posted by King Willem-Alexander of the Netherlands directed at United States President Donald Trump was picked up by the Washington Press blog on 19 June 2018:", "The Trump administration has a penchant for its dismal optics and an almost impressive ability to continue lowering the bar to previously unknown depths. This week, Trump and his tribalistic cohorts opted to punish those seeking asylum along the southern border by implementing a “zero-tolerance” policy that would call for the separation of parents and their children, an act so inhumane that it is inviting comparisons to Japanese internment camps of World War 2 and even the Holocaust.", "[...]", "But the international community has been especially outspoken in its opposition to this administration’s visibly inhumane agenda, including the purported account of Willem-Alexander Claus George Ferdinand, the King of the Netherlands, who posted a less-than-subtle threat to a president vying for his spot as one of the cruelest world leaders of this century.", "This is not genuine. Washington Press later deleted their article, but this rumor continued to spread on social media; other sites still had similar stories available as of 22 June 2018.", "The tweet actually originated from a parody account posing as the the Netherlands' king. Although it is difficult to tell simply by looking at this account's Twitter handle, the (unverified) page spells the name Willem as \"wiiiem\" instead of \"wiLLem,\" a common and effective tactic with parody accounts that makes it nearly impossible to tell the difference at first glance.", "However, when we changed the font to Courier New, it becomes much more obvious that the name was purposefully misspelled in order to better trick readers and viewers:", "This account also mentions the parodic nature of its content in the bio section (roughly translated):", "Werkend vader, echtgenoot, zoon & broer. Twittert op menig titel waaronder een parodiërende en niet politiek correcte. Zonder ministeriële verantwoordelijkheid.", "Working father, husband, son & brother. Tweets under many titles including politically incorrect parody. No ministerial responsibility.", "The King of the Netherlands did not threaten President Trump on Twitter. This message originated with a parody account posing as Willem Alexander.", "Cohen, Brian.   \"The King of the Netherlands Just Issued a Brutal Threat to Trump Over Caged Kids Atrocity.\"\r\nWashington Press.   19 June 2018.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]