["About this rating", "A negative COVID-19 result means there is a chance — but no guarantee — you will stay negative by the time of any gathering. Different states have different rules for travelers and gatherings. Travelers are often required to quarantine and/or submit negative test results, while some states restrict the numbers of people allowed to gather.", "A negative COVID-19 test does not fully “clear” you to go to a gathering. Many people can get infected after their test, receive a false negative result, or get a negative result even though they are actually infected because the virus is not detectable yet. Some states have also restricted gathering numbers regardless of test results.", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "Fears of another COVID-19 surge grew around the 2020 Christmas and New Year's holidays, as more people started traveling to see their loved ones. A similar surge occurred around Thanksgiving when numerous people traveled, got sick, and filled hospitals. Much of this surge resulted in public health officials cautioning people that it was not safe to travel or attend gatherings just because they had received a negative COVID-19 test result.", "The holiday-related COVID surge even prompted Wil Gibb, an emergency medicine doctor at Stanford, to tweet a recommendation. In response to another doctor who described how just days after receiving a negative COVID test result, a patient began to have respiratory symptoms, Gibb tweeted:", "We learned that getting a negative test does not mean that individuals are entirely “clear” to gather or travel. Doctors have pointed out that even if everyone who attends a gathering gets a COVID-19 negative test in advance, nothing is ever risk-free.", "Paige Larkin, a clinical microbiologist at NorthShore University HealthSystem in Chicago, told The New York Times that, “A negative result is a snapshot in time. It’s telling you that, at that exact second you are tested, the virus was not detected. It does not mean you’re not infected.”", "Los Angeles County Public Health Director Barbara Ferrer said, “By the time you get a negative test result, you may no longer be negative. And even if you have no symptoms, you can easily infect others.”", "People who test negative could still have the virus. The virus takes time —usually several days — to build up in a person’s body, so getting a test at any point also does not guarantee the virus will be fully detectable. It is possible that right before or after getting a test, people can spread the virus.", "Even with testing, there is still a possibility of getting a false negative result. According to one study in the Annals of Internal Medicine, even after nine days of infection, an individual still had a 21% chance of receiving a false negative result (the first day of symptoms presented a 38% chance of a false negative result). Different tests also have different success rates. The P.C.R test normally can detect the virus when it is present at low levels, but takes a few days to yield results, which means one is at risk of exposure during the time after the test. Antigen tests are faster with results and more convenient, but can also miss the virus when it is less prevalent in a person’s body.", "Furthermore, relying on testing alone to determine whether it is safe to gather affords people a false sense of security. Health experts recommend testing, quarantining for two weeks, wearing masks, and social distancing at gatherings to reduce the risk of spreading even more.", "Experts generally agree that relying solely on testing is not enough to “clear” a person for gatherings. In an informal survey of more than 600 epidemiologists by The New York Times, just 6% said that if they recently tested negative for the virus, they would be comfortable spending time indoors with others without precautions. Some 29% said they would do so if everyone also used masks and practiced social distancing. And 64% said that even if they tested negative, they would not be comfortable spending time indoors with people they didn’t already live with.", "U.S. states also have different rules surrounding travel and whether a negative test is enough to clear someone for travel between states. Some states like New Jersey expect travelers from specific states to voluntarily quarantine for 14 days, while New Mexico requires it from travelers from high-risk states. There are even more varying rules for gatherings across different states. New York, for example, restricts all gatherings at private residences to 10 people and still requires masking for individuals in settings where they cannot maintain a 6-foot distance from others. Arkansas has a similar restriction of 10-person gatherings with the exception of workplaces, places of worship, and certain outdoor spaces. Negative test results do not impact these gathering rules.", "Though a negative result does reduce some risk, health experts agree that it does not guarantee one is entirely “clear” for gatherings. States have a range of restrictions that recommend either negative results before travel, requiring or requesting quarantining, and limiting gatherings, but all these rules do not change the relative risks described by scientific experts. Since there is very little chance of one being entirely “clear” without a range of precautions, we rate this claim as “Mostly False.”", "Nur Nasreen Ibrahim is a reporter with experience working in television, international news coverage, fact checking, and creative writing.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]