["The 13-second long video was published here on Facebook on December 26, 2019.", "A post’s caption reads in English: “Muslim Using fake sikh sardar face to show that sikh are against #CAA Fake propaganda”.", "CAA refers to Citizenship Amendment Act, a new citizenship law passed by the Indian parliament on December 11, 2019. The law triggered widespread protests across the country after it granted Indian citizenship to non-Muslim nationals from Afghanistan, Bangladesh and Pakistan. Here is an AFP report about the protests.", "Below is a screenshot of the misleading Facebook post:", "The same video was shared alongside a similar claim here, here, here and here on Facebook and here, here, here and here on Twitter.", "The claim is false; the video has circulated online since at least March 2011 in reports about police apprehending a Sikh man during a protest by rural veterinary pharmacists in Mohali, Punjab.", "A keyword search on Google found the incident was reported here by SikhNet, a global Sikh community news platform, on March 31, 2011.", "“United Sikhs Files Criminal Complaint Against Punjab Police For Removal of Sikh's Turban,” the article’s headline reads.", "Below is a screenshot of the report:", "A subsequent search found a longer version of the video published here on YouTube on March 31, 2011. The video, which also includes a musical soundtrack, has been embedded below.", "Below are two comparison screenshots of the video in the misleading posts (L) and the YouTube video (R):", "The incident occurred after protesting veterinary pharmacists converged on a cricket match, English-language Indian daily newspaper The Indian Express reported here on March 29, 2011.", "Mohali police told AFP two officers who detained the Sikh man in the video were suspended over the incident.", "“Two police officials were suspended at the time. The case is closed now and the suspended police officials are back on their duties,” Head Constable Jarnail Singh told AFP by phone on December 31, 2019.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]