["When it comes to saving money in the federal budget, presidential candidates are often long on generalities and short on specifics. But libertarian candidate Gary Johnson offered a few specifics when interviewed Aug. 11 on Fox News.", "\"Bill Weld (Johnson's vice presidential candidate) and I are pledging in our first 100 days to submit a balanced budget to Congress,\" he said. \"That has to include the entitlements — reform to the entitlements, Medicaid and Medicare, ensuring that there still is a safety net. It would be reforming Social Security, not cutting Social Security, but raising the retirement age. You could have a very fair means-testing when it comes to Social Security.\"", "Then Johnson turned to military spending, saying, \"The Pentagon itself says that we could reduce U.S. bases by 20 percent, and yet there's not the political will to do that. Our heads are in the sand over all of this, while there's a fiscal crisis out there looming if we don't cut spending to go along with the equation.\"", "He repeated the point about military installations less than a minute later: \"The Pentagon itself says that we could eliminate 20 percent of U.S. bases.\"", "We wondered if Johnson's base statistic was correct. We found a more complicated situation than Johnson suggested, with cost-savings slow in coming.", "When we asked the Johnson campaign about it, they sent us links to two articles, one from Defense News, the other from Military Times. Both detail the results of a Pentagon report which looked at 251 military installations but did not recommend cutting 20 percent of them.", "Instead, the report said the bases have, in total, 22 percent more installation space and infrastructure than the military will need, based on force levels projected for 2019.", "That could mean getting rid of a lot of small bases, or a few large ones, once operations are consolidated.", "For example, the report said that, overall, the Army has a 29 percent excess in administrative space, the Marine Corps has 27 percent more base acreage than it needs, and the Air Force has 24 percent more space than required for parking Air Force Reserve and Air National Guard planes.", "Exactly where the cuts would be made and where the consolidations occur could be determined by a bipartisan commission known as the Base Realignment and Closure (BRAC) commission, which would come up with a comprehensive plan. Or the Pentagon could act on its own. In either case, such decisions are politically volatile because no member of Congress wants an installation closed in their district. The BRAC process is intended to ensure closures are made based on the merits, not on political influence.", "Two more things are important to note.", "Although the Pentagon report is saying that it has 22 percent more base capacity than it needs, that doesn't mean it wants to reduce its capacity by the full amount, which could could hamper the military's flexibility.", "A BRAC review \"is not designed to eliminate all excess,\" the report cautions. \"The focus of every BRAC round is to reduce excess where needed in balance with the need to have room for changed missions, tactics, and technology while enhancing military value and achieving recurring savings.\"", "Second, even if there was a 22 percent reduction in capacity, that wouldn't guarantee a savings of 22 percent. Historically, in the short run, the cutbacks actually cost more more than they save because of consolidation and other costs.", "The report estimates that if the military initiated a BRAC and trimmed its military base costs, it would cost an extra $7 million over six years to implement. After that, the military would be saving $2 billion annually.", "Yet those estimates need to be regarded with skepticism.", "The last BRAC was done in 2005. It closed 24 bases, changed operations in 24 others and eliminated roughly 12,000 civilian jobs. As PolitiFact reported last year, it was supposed to save $3.9 billion a year. But because it cost $35.1 billion to implement (the original estimate was $21 billion) actual savings won't begin to accrue until 2018, five years later than originally projected.", "Our ruling", "Johnson said, \"The Pentagon itself says that we could eliminate 20 percent of U.S. bases.\"", "What the Pentagon actually said was that the Defense Department has 22 percent more installation space and infrastructure than it's going to need in 2019. That's not the same as reducing the number of bases by 20 percent, as Johnson said. Past experience shows that closing bases involves upfront expenses, with savings taking some time to accrue.", "Because his statement contains some element of truth but ignores critical facts that would give a different impression, we rate it Mostly False.", "YouTube, \"Gary Johnson: eliminate corporate tax, cut military spending,\" Fox News channel, Aug. 11, 2016", "Emails, J.V. LaBeaume, Gary Johnson campaign, Aug. 12, 2016", "PolitiFact, \"Rob Wittman says 2005 BRAC round of base closings hasn't led to savings,\" May 15, 2015", "Department of Defense, \"Department of Defense Infrastructure Capacity,\" March 2016 and \"United States Department of Defense Fiscal Year 2016 Budget Request Overview,\" February 2015", "Military Times, \"The Pentagon threatened Congress: We'll close bases without you,\" April 19, 2016", "DefenseNews, \"Pentagon to Congress: We Need Base Closures,\" April 15, 2016", "Government Accountability Office, \"Military Base Realignments and closures: Estimated costs have increased while savings estimates have decreases since fiscal year 2009,\" Nov. 13, 2009 and \"Military Base Realignments and Closures: Updated costs and savings estimates from BRAC 2005,\" June 2012", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]