["A video of a whale plunging into the floor of a school gymnasium, as the kids in the audience gasp, has gone viral as another leap in technology.", "The post suggests the whale is a hologram, created by a “photographic process that produces images using the differences between two lasers”. (For a better explanation of how holograms work, watch this.)But it’s just a marketing ploy. According to Snopes, the video was created by technology startup Magic Leap in 2015 to create hype for an augmented reality product it was working on. It would let users experience “augmented reality” in a headset similar to Microsoft’s HoloLens.", "Magic Leap in 2015: Our mixed reality headset lets you fight digital space aliens and robots using real-world 3D printed weapons!\nMagic Leap in 2016: LOOK. ALL THESE KIDS ARE SEEING A WHALE IN A GYM.\nMagic Leap today (2018): This little dude can throw rocks at you. pic.twitter.com/fSOv7c6GwF", "Please complete this form to receive the HTML sharing code.", "A fact-checker has rated your Facebook or Instagram post as “false”, “altered”, “partly false” or “missing context”. This could have serious consequences. What do you do?", "Click on our guide for the steps you should follow.", "Africa Check is a partner in\nMeta's third-party fact-checking programme\nto help stop the spread of false information on social media.", "The content we rate as “false” will be downgraded on Facebook and Instagram. This means fewer people will see it.", "You can also help identify false information on Facebook. This\nguide explains how.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "For democracy to function, public figures need to be held to account for what they say. The claims they make need to be checked, openly and impartially. Africa Check is an independent, non-partisan organisation which assesses claims made in the public arena using journalistic skills and evidence drawn from the latest online tools, readers, public sources and experts, sorting fact from fiction and publishing the results.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "© 2023 - Africa Check - All rights reserved.", "We will never charge you for verified, reliable information. Help us keep it that way by supporting our work.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "Support independent fact-checking in Africa."]