["About this rating", "An extraordinary photograph of an American neo-Nazi rally re-emerged on social media in October 2018, prompting multiple inquiries from readers about its authenticity and the details surrounding it.", "A 14 October 2018 Facebook post featured a photograph of a group of people performing a Nazi salute in front of a large, upright burning swastika, with a caption warning: \"No, this is NOT a colorized photo from Nazi Germany in 1939. This is a photo taken in Draketown, Georgia, USA this last weekend. This is what I will continue to Fight against! This is not America!\":", "As indicated in the meme, this image and caption were first posted to Twitter in April 2018 by Brian Krassen, a critic of President Donald Trump and editor at the liberal web site HillReporter.com:", "No, this is NOT a colorized photo from Nazi Germany in 1939.", "This is a photo taken in Draketown, Georgia, USA this last weekend.", "This is what I will continue to Fight against! This is not America! pic.twitter.com/dMUZ5sdXGV", "— Brian Krassenstein (@krassenstein) April 23, 2018", "Although no neo-Nazi rally was held in Draketown over the weekend of 12-14 October 2018, one did take place there on Saturday 21 April, so Krassen's reference to \"this last weekend\" should be read in that light.", "The image in question does indeed capture a rally of American neo-Nazis in Draketown, Georgia, on 21 April 2018. The photograph was taken by Spencer Platt for the Getty agency and carried the following caption:", "DRAKETOWN, GA - APRIL 21: Members of the National Socialist Movement, one of the largest neo-Nazi groups in the US, hold a swastika burning after a rally on April 21, 2018 in Draketown, Georgia. Community members had opposed the rally in Newnan and came out to embrace racial unity in the small Georgia town. Fearing a repeat of the violence that broke out after Charlottesville, hundreds of police officers were stationed in the town during the rally in an attempt to keep the anti racist protesters and neo-Nazi groups separated.", "Embed from Getty Images\n\nAccording to the New York Times, around two dozen neo-Nazis were vastly outnumbered by counter-protesters during an earlier rally in the city of Newnan, around 45 miles south of Draketown, and despite some confrontations between both sides, the event passed off without the kind of violence seen at the August 2017 \"Unite the Right\" rally in Charlottesville, Virginia.", "The 2017 Charlottesville event culminated in the death of Heather Hayer, who was killed when James Alex Fields, a rally attendee with neo-Nazi sympathies, drove a car into a crowd of counter-protesters.", "Of the Newnan rally, the Times reported:", "In a speech, Jeff Schoep, who leads the National Socialist Movement and was also at the rally in Charlottesville, criticized illegal immigration, skinny jeans and the removal of Confederate monuments, adding that he was “standing on behalf of white nationalism, white patriotism and our history as American people.”", "In front of the rally participants was a smattering of reporters in a grassy area that was mostly empty. Beyond that were barricades and dozens of black-clad, helmet-wearing law enforcement officers lining the street that bordered the park. And beyond all of that, at least 100 people stood in opposition to the gathering, including some activists of the anti-fascist group known as antifa.", "The counterprotesters had been demonstrating downtown for hours before the white nationalist rally. They marched through the streets and waved signs that said “Smash white supremacy” and “Love thy neighbor,” while a helicopter pulled a banner that said “Newnan believes in love for all.”", "Fortin, Jacey.   \"Neo-Nazi Rally Draws About Two Dozen People and Upends a Small Georgia City.\" \r\n    The New York Times.   21 April 2018.", "Engel Bromwich, Jonah and Alan Blinder.   \"What We Know About James Alex Fields, Driver Charged in Charlottesville Killing.\" \r\n     The New York Times.   13 August 2017.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]