["The clip shows a police officer in a blue shirt and black trousers stomping on the neck and head of a man lying on the ground. The video bears a watermark for Nigeria Dream in the top left-hand corner.", "“Please shere it, till it gets to the IGP (sic),” reads the caption on this Facebook post with more than 8,000 shares since July 15, 2020.", "IGP stands for the Inspector General of Police, an office occupied in Nigeria by Mohammed Adamu. The police chief recently disbanded the SARS squad following protests against the tactical unit widely accused of torture, ill-treatment and extrajudicial killings, but the move has failed to stop the demonstrations.", "Sporadic clashes erupted across Lagos after the shooting of peaceful protesters, leaving at least 25 people wounded.", "Although the post does not explicitly mention that the video was shot in Nigeria, many Facebook users who shared it claimed the scene was recorded in the west African country.", "“Meanwhile, he’s a Nigerian uniformed man,” reads the caption on one of the post’s reshares. “Tell me who has the mind to do this that cannot pass for a terrorist.”", "The video has also circulated on Twitter, including in this tweet that has been shared more than 35,000 times. It was published alongside hashtags such as “#EndSARS” and “#EndPoliceBrutality” -- two of the prominent slogans related to the current protests in Nigeria.", "Police brutality is a major concern in Nigeria and the recent protests have brought international attention to the matter. However, this clip does not show a Nigerian police officer but a Kenyan one, who was detained over the assault.", "Using the InVID-WeVerify tool, AFP Fact Check ran several reverse image searches on keyframes of the video. We then found this earliest version of the same footage, which is about a minute longer with better visual quality.", "It was published on Facebook on April 6, 2018, with a caption reading: “Share widely this video to help identify the police officer who was caught in camera killing unarmed man on Londiani road off Likoni road industrial area I.”", "Using Google Maps Street View, AFP Fact Check double-checked the location of the incident, which indeed took place on Londiani Road in Nairobi’s industrial area.", "The features in the video match those on Google Maps: you can see the same brick fences with barbed wires, the same pattern of bricks on the road, and the same buildings.", "In the longer version of the clip, the man being assaulted can be heard speaking in Swahili, which is Kenya’s main language after English.", "“It is okay, boss. I’m sorry,” the man says in Swahili. When he identifies himself as “Brian Ogutu” who works in the industrial area, the police officer stomps on his head. The man then says, “I am telling you the truth”.", "He survived the assault.", "The licence plates on the two vehicles seen in the video feature black characters on yellow plates.", "Our fact checkers in Nairobi confirmed that these are typical of Kenyan licence plates, and differ from those in Nigeria.", "The vehicles’ plate numbers, “KAT 508T” and “KAK 855G”, are among a series of Kenya’s second-generation licence plates.", "When the video clip first circulated with claims that it was filmed in Nigeria, the Nigerian Police Force dismissed this as false.", "“Although the man in uniform looks like a private security guard that can be found anywhere, he is certainly not a personnel of the Nigeria Police Force,” reads a statement published on Twitter on July 13, 2020.", "In the video, the security officer was seen stamping his feet on the neck and head of a man lying helplessly on the floor. The Force condemns the act.", "Authorities in Kenya reacted to the video when it went viral there in 2018.", "In an April 2018 tweet, Kenya’s National Police Service said it had identified the officer.", "The Police officer captured on a video clip assaulting an individual has been positively identified and is being processed for disciplinary action. pic.twitter.com/iRNENNuiay", "Kenyan newspaper The Standard reported that the assault began after a friend of the man who was set upon threw a stone to scare a boy stealing metal bars, but that it instead hit a vehicle in which the policeman was riding.", "The man who was assaulted told The Standard that the officer took him into custody but that he was later released for medical attention.", "Online users taking images from Kenya out of context and claiming they show Nigeria is not uncommon.", "AFP Fact Check has debunked similar claims, including a video of Kenyan police breaking up a political rally that was passed off as showing an attack by Nigerian Islamist group Boko Haram on the convoy of Nigeria’s Borno state governor.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]