["The image was published here on Facebook on October 28, 2019. It has been shared more than 2,100 times since.", "The post's Indonesian-language caption translates to English as: “DON’T FORGET TO CLICK THUMBS UP PLEASE…", "“This child was cursed and turned into a dog-headed sheep for disobeying the parents. Make sure to type amen and share it so we are kept away from this kind of punishment.”", "Below is the screenshot of the misleading post:", "The image has been circulating in Facebook since 2017 with similar claim which can be seen here, here and here, where it has been shared more than 1,400 times.", "The claim is false; the image has circulated in reports about a baby goat that was born in Malaysia with a fetal anomaly in 2016.", "A Google reverse image followed by a keyword search found the image was previously published here on a Malaysian Facebook group called Orang Kota Tinggi on April 23, 2016.", "The post's Malaysian-language caption translates to English as: “A baby goat that was born to its mother didn’t resemble a goat as it looked like a cat with a human-like face. This happened in Felda Sungai Mas village Block 8 Kota Tinggi Johor, owned by Mr. Berahim. This kid was born on Friday at 12.00 midday.\n\tPhoto credit : Miss Nurul”.", "Kota Tinggi is the capital of Kota Tinggi District, in the Malaysian state of Johor.", "The Straits Times, an English-language newspaper based in Singapore, republished a report from Malaysian daily The Star about the baby goat on April 25, 2016 here, headlined: “Carcass of baby goat that looks like human baby handed over to the Malaysian authorities.”", "The report's first three paragraphs read: “The carcass of a baby goat, said to resemble a human baby, has been handed over to Malaysia's Veterinary Services Department.", "“The baby goat belonged to Federal Land Development Authority (Felda) settler Ibrahim Basir, who had refused offers of money from people interested in buying the carcass.", "“Instead, the 63-year-old has decided to hand it over to the department to enable it to carry out investigation on the strange-looking kid.”", "Below is the screenshot of The Straits Times report:", "Malaysian daily Harian Metro also reported on the baby goat on April 24, 2016, here.", "More than two weeks later, the Malaysian Veterinary Services Department held a press conference about the animal, saying no human DNA was found in the baby goat.", "Malaysian newspaper the New Straits Times published this report on May 13, 2016, headlined: “No human DNA found in kid with human-like features, says Vet Department.”", "The report's first four paragraphs read: “There is no human DNA found in the baby goat born with unusually human-like features, the Veterinary Services Department confirmed today.", "“Its director-general Datuk Dr Kamarudin Md Isa said the department had classified the case as congenital anomalies and such deformities had happened before, even among humans.", "“‘This is a rare occurrence, less than one percent, but it can still happen. The kid was stillborn based on tests we did on its lung,\" he told reporters during a dialogue session today.", "“He said there were various reasons on why such anomalies happen during the fetus development stage, including lack of certain nutrients or suffering from infection.”", "Malaysian state news agency Bernama’s report on the press conference can be read here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]