["A flier urging customers to remain home hangs at a turnstile as an MTA employee sanitizes surfaces at a subway station on March 20, 2020, in New York City. (AP)", "• Gillibrand’s number is backed up by a New York City comptroller’s office study that found that 53% of all “frontline” workers in the city are immigrants.", "• However, the comptroller’s definition doesn’t include government workers such as first responders and differs from the state’s definition of “essential workers.” So it is one way of analyzing the data, and other methods might produce a lower percentage.", "When President Trump announced a plan to suspend immigration to the United States, New York Sen. Kirsten Gillibrand tweeted the news with her own assessment of the decision:", "\"Immigrants make up a majority of essential workers in places like New York City,\" the Democrat wrote April 21. \"They're on the front lines of the battle against this pandemic. I stand with our immigrant communities now and always.\"", "With so much dependent on the group of people that have become known as \"essential workers,\" we wanted to look closer at Gillibrand’s statement to see if the numbers support it.", "Immigrants make up a majority of essential workers in places like New York City—they're on the front lines of the battle against this pandemic. I stand with our immigrant communities now and always. https://t.co/3KvPLoztko", "We found that while the statistics on this question are a little murky, one credible study does reinforce her assertion.", "Gillibrand’s communication’s director, Evan Lukaske, told PolitiFact that the senator was defining essential worker based on the way the New York City comptroller's office defined \"frontline workers\" in its March 26 report, \"New York City’s Frontline Workers.\"", "The comptroller’s report defined New York City’s COVID-19 \"frontline workers\" as grocery, convenience, and drug store workers; public transit workers; trucking, warehouse, and U.S. Postal Service workers; health care workers; child care, homeless, food, and family services workers; and cleaning service workers.", "On March 20, New York Gov. Andrew Cuomo, a Democrat, and the New York State Department of Economic Development issued a guidance on the term \"essential worker,\" and it listed several categories of worker who would not be covered under the categories used in the comptroller’s report, including those working at airports, certain types of manufacturing enterprises, hardware stores, funeral homes, animal shelters, and banks.", "Notably, the comptroller report’s \"frontline worker\" category includes only \"direct-service, mostly non-governmental employees,\" meaning that it doesn’t count most types of public employees. As a result, the report does not take into account police officers, firefighters, and other first responders.", "So while Lukaske said that Gillibrand \"is using ‘frontline’ and ‘essential’ as synonymous, there is a discrepancy between the two terms, and an alternate definition could end up changing the demographic profile.", "That said, the comptroller’s report provides one reasonable definition. So what does the report’s analysis show?", "According to the comptroller’s study, more than 53% of frontline workers are foreign-born, meaning they’re immigrants. Of the sectors studied, building cleaning services employs the highest share of immigrants at 70%. It is followed by health care and food and drug store workers, both at 53%.", "Other studies have backed up the broader proposition that immigrants make up a significant portion of essential workers.", "The Center for Migration Studies of New York, a think tank on international migration, has estimated that 1.8 million immigrants in New York state work in jobs the state considers \"essential businesses.\" The think tank found that foreign-born workers make up 31.5% of workers in essential businesses in New York state, despite only representing 28% of the state’s overall labor force. (It is logical that New York City’s percentage would be higher, since immigrants represent a higher share of the population in the city than in the rest of the state.)", "Nationally, immigrants make up a \"sizable\" share of essential workers in the fight against the pandemic, said Michelle Mittelstadt, director of communications for the Migration Policy Institute.", "The group estimates that 6 million immigrants are working frontline jobs in health care, food production, and transportation, and another 6 million immigrants work in industries such as food services and domestic household services.", "\"You can assume that an immigrant-rich area like New York City might have higher shares of immigrants than the U.S. average in particular occupations,\" she said.", "Meanwhile, U.S. Census Bureau data shows that immigrants represent about 45% of the total workforce in New York City. That’s in line with Gillibrand’s assertion, said Jeffrey Passel, a senior demographer with the Pew Research Center.", "Gillibrand said that \"immigrants make up a majority of essential workers in places like New York City.\"", "This number is backed up by a New York City comptroller’s office study that found that 53% of all \"frontline\" workers in the city are immigrants. However, the comptroller office’s definition, which doesn’t include government workers such as first responders and which differs from the state’s definition of \"essential workers,\" is only one way of analyzing the data, and other methods might produce a lower percentage.", "We rate the statement Mostly True.", "Kirsten Gillibrand, tweet, April 21, 2020", "New York City comptroller’s office, \"New York City’s Frontline Workers,\" March 26, 2020", "New York state, \"Governor Cuomo Issues Guidance,\" March 22, 2020", "Center for Migration Studies, \"Immigrants Comprise 31 Percent of New York Workers in Essential Businesses,\" April 21, 2020", "New York Times, \"Trump Plans to Suspend Immigration to United States,\" April 20, 2020", "Email interview with Jeffrey Passel, senior demographer with the Pew Research Center, May 6, 2020", "Email interview with Michelle Mittelstadt, director of communications for the Migration Policy Institute, May 4, 2020", "Email interview with Evan Lukaske, communications director for Kristen Gillibrand, May 7, 2020", "Email interview with Bob Warren, senior visiting fellow for the Center for Migration Studies of New York, May 7, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]