["A three-minute video of New Zealand Prime Minister Jacinda Ardern in a Hindu temple has gone viral. Several social media users on Twitter and Facebook have shared the video along with the claim, “New Zealand’s PM visited a Hindu temple after declaring the nation free from COVID-19.” (translated from Hindi text न्यूजीलैंड की PM देश कोरोना कोविड19 मुक्त घोषित करने के बाद हिंदू मंदिर गई।).", "A Twitter user @ajaykum61068972 shared the viral video drawing 100 retweets as of this writing.", "न्यूजीलैंड की PM देश को कोरोना कोविड19 से मुक्त घोषित करने के बाद हिंदू मंदिर गई।", "आैर हमारे देश के कुछ #देशद्रोहियों को #राममंदिर बनने से खतरा लग रहा है।", "सियावर रामचंद्र की जय 🙏 pic.twitter.com/if80IaueLS", "— Phenomenal Ajay (@ajaykum61068972) August 11, 2020", "It was also posted on Facebook (1,2). Cumulatively, these posts have gathered over 1,000 shares.", "Alt News received several requests to fact-check this on WhatsApp (+917600011160) and on our official Android application.", "Alt News performed a keyword search on YouTube and found that Hindustan Times posted the viral video on August 10. As per the video description, PM Ardern visited Auckland-based Radha Krishna Mandir on August 6 ahead on national elections in September. Indian envoy Muktesh Pardeshi was also present at the event.", "A keyword search on Twitter led us to reports by several Indian media outlets including Zee News.", "New Zealand PM Jacinda Ardern visits Radha Krishna Temple ahead of national elections#NewZealand #JacindaArdern #radhakrishna https://t.co/SsG5md16PV", "— Zee News English (@ZeeNewsEnglish) August 8, 2020", "Radha Krishna Mandir’s details are listed on the Auckland Indian Association’s (AIA) website. On August 8, AIA posted the images of this event on Facebook.", "AIAI Officers Team are honoured to welcome Prime Minister Jacinda Ardern and Leaders of the Labour Party", "Posted by Mahatma Gandhi Centre/Auckland Indian Association on Friday, 7 August 2020", "Similarly, Pardeshi tweeted pictures from the event at Radha Krishna Mandir.", "Some precious moments with Hon. PM of New Zealand ⁦@jacindaardern⁩ at ⁦@indiannewslink⁩ event on 6 Aug 2020. She paid a short visit to Radha Krishna Mandir and enjoyed a simple Indian vegetarian meal- Puri, Chhole and Daal. 🙏 pic.twitter.com/Adn25UE1cO", "— Muktesh Pardeshi (@MukteshPardeshi) August 8, 2020", "Thus the social media claim that New Zealand PM Ardern visited a Hindu temple after declaring the nation COVID-19 free is false. Ardern visited Auckland-based Radha Krishna Mandir ahead of national elections.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]