["About this rating", "Critics of President Trump's patriotic boosterism have seized upon a viral video of him sporadically singing along with \"The Star-Spangled Banner\" at a January 2018 football game as evidence that he either forgot or doesn't know the words to the national anthem.", "Trump, who in the past has condemned National Football League players for \"disrespecting\" the anthem by \"taking a knee\" in protest during pre-game renditions of the song, appeared to struggle with the lyrics before standing silently at attention through most of the rest of the song:", "Hours before, Trump had delivered a speech in which he said, \"We want our flag respected. We want our anthem respected also. There's plenty of space for people to express their views and to protest, but we love our flag and we love our anthem and we want to keep it that way.\"", "The irony was not lost on TV comedians and talk show hosts, who mocked Trump's performance without mercy:", "Seth Meyers: \"Trump sings the National Anthem the way the rest of us sing 'Despacito' \" https://t.co/XziU3fbHEJ pic.twitter.com/RZCZOjw6ac", "— The Hill (@thehill) January 10, 2018", "After months of chiding NFL players for disrespecting the National Anthem, President Trump finally got his chance to show them how it's done. pic.twitter.com/SnLtymKu0t", "— The Late Show (@colbertlateshow) January 9, 2018", "Let’s be honest, Donald Trump sings the national anthem the way we all sing Rihanna songs. https://t.co/fe7rbtz1h1 pic.twitter.com/djzyKHwapA", "— The Daily Show (@TheDailyShow) January 10, 2018", "Among those who saw no irony at all in Trump's apparent fumbling of the anthem was his son, Donald Trump, Jr., who tweeted:", "And that folks is how it’s done. It’s not that hard. Just show some respect for your country. #nodrama #maga #america #potus #georgia #alabama #football pic.twitter.com/x3I9AvZNXk", "— Donald Trump Jr. (@DonaldJTrumpJr) January 9, 2018", "And, of course, there were those who leaped to Trump's defense, citing the echo-prone acoustics of large arenas as the likely reason for his erratic crooning and asserting (albeit without evidence) that it's \"asinine\" to suppose that the president doesn't know the lyrics to \"The Star-Spangled Banner\":", "Does Trump know the words to the national anthem? @BenShapiro DEBUNKS the leftist narrative.", "FULL VIDEO => https://t.co/OuKqMyISqI pic.twitter.com/86lH6Ud69n", "— The Daily Wire (@realDailyWire) January 10, 2018", "Videos of Trump on other occasions when the anthem was played or sung are mostly inconclusive, showing him sometimes singing along with some of the words, other times not singing at all, and in one instance having to be nudged by First Lady Melania Trump to place his hand over his heart:", "But, for those to whom it matters, we are pleased to report that one video we found, shot during Trump's inaugural prayer service on 20 January 2017, shows him singing along — accurately, as best we can tell — through the entire rendition of \"The Star-Spangled Banner\":", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]