["About this rating", "Almost every detail of the case is presented accurately in the meme.", "There is a significant dispute over whether police shot John Crawford \"before he even knew what was going on.\" The officers involved asserted that he failed to obey instructions to put down what they perceived to be a loaded rifle.", "As the NFL preseason schedule commenced in August 2018, President Donald Trump resumed his fierce criticism of players who protested against racial injustice and police brutality by kneeling or declining to stand on the field during the playing of the U.S. national anthem.", "After similar protests occurred during several games held on 9 August, President Trump the following morning posted a series of tweets claiming that the players themselves did not understand why they were demonstrating and calling for them to be suspended without pay:", "The NFL players are at it again - taking a knee when they should be standing proudly for the National Anthem. Numerous players, from different teams, wanted to show their “outrage” at something that most of them are unable to define. They make a fortune doing what they love......", "— Donald J. Trump (@realDonaldTrump) August 10, 2018", ".....Be happy, be cool! A football game, that fans are paying soooo much money to watch and enjoy, is no place to protest. Most of that money goes to the players anyway. Find another way to protest. Stand proudly for your National Anthem or be Suspended Without Pay!", "— Donald J. Trump (@realDonaldTrump) August 10, 2018", "In response to this tweetstorm, Twitter user Anna Gallardo posted a meme about one particular fatal police shooting of a black man, writing: \"Since Donald Trump doesn't know why NFL players are protesting, let's retweet this.\"", "The meme, which was retweeted 120,000 times within three days, gave the following account of the death of an Ohio man named John Crawford III:", "He was 22 years old. A father to two young sons. He went into Walmart to buy marshmallows, chocolate and graham crackers to make s'mores at a family cookout. While shopping, he picked up an unpackaged BB/pellet air rifle at the store's sporting goods section.", "A customer called 911, claiming that John was pointing the gun at people walking by. Since the security video has been released, the customer has recanted. John was carrying a BB gun in the store that sold the gun, in an open carry state. The police arrived, went directly to John and shot him twice before he even knew what was going on. He died at the hospital soon after. A grand jury decided not to indict the officers.", "John Crawford III mattered. THE INJUSTICE OF HIS MURDER IS WHY THEY KNEEL.", "The text of the meme was a modified version of an account which the progressive political action committee Voters for Equality published on Facebook in October 2017:", "His name was John Crawford III. He was 22 years old, a father to two young sons. He went into Walmart to buy marshmallows, chocolate and graham crackers to make s’mores at a family cookout. While shopping, he picked up a un-packaged BB/pellet air rifle inside the store's sporting goods section.", "Another customer called 911, claiming that John was pointing the gun at people walking by. Since the security video has been released, the customer has recanted, stating “At no point did he shoulder the rifle and point it at somebody.\" John was carrying a BB gun in the store that sold the gun, in an open carry state.", "The police arrived. Crawford was talking on his cell phone while holding the BB/Pellet air rifle when officers shot him; store video shows the officers fired immediately without giving any verbal commands and without giving Crawford any time to drop the bb gun, even if he had heard them.  He died at the hospital soon after. A grand jury decided not to indict the officers.", "John Crawford III mattered. His life matters, and the injustice of his murder is #WhyTheyKneel #WhyWeKneel.", "The widely-shared August 2018 tweet prompted enquiries from readers about the overall veracity of the account presented in the meme. On the whole, the meme is highly accurate, but the claim that Crawford was shot \"before he even knew what was going on\" is a significant point of contention, based on the accounts presented by the police officers involved.", "Crawford's Trip to Walmart", "John Crawford III was shot dead on 5 August 2014 by Sean Williams, a police officer in the city of Beavercreek, Ohio, near Dayton. Crawford was shopping in the Walmart store at 3360 Pentagon Boulevard in the city. As the meme stated, he was indeed the father of two young sons aged five months and under two years old, according to the Cincinnati Enquirer.", "As reported by the Guardian, Crawford's girlfriend Tasha Thomas told police in an interview after the shooting that the couple had gone to the Walmart to buy the ingredients to make s'mores for a family cookout, as the meme stated.", "Multiple news reports confirm the claim in the meme that Crawford picked up an unpackaged pellet gun from a shelf in the Walmart store and walked around with it.", "The 911 Call", "Another Walmart customer, later identified as Ronald Ritchie, called 911 to report Crawford to police. Excerpts from an audio recording of the call were later published by multiple news organizations, in which Ritchie told dispatchers that Crawford had loaded a rifle and was \"pointing it at people,\" including children.", "Ritchie and his wife's initial characterizations of Crawford as a threat to shoppers were significantly discredited when surveillance video footage of the incident was released, and when Ritchie himself told the Guardian that \"At no point did [Crawford] shoulder the rifle and point it at somebody.\"  Several witness statements later seen by the Guardian also negated the notion that Crawford was perceived as a threat by other shoppers:", "Ritchie and his wife, April, claimed afterwards that Crawford was causing panic among fellow shoppers. Yet only one of seven other customers interviewed by Ohio’s bureau of criminal investigation recalled seeing Crawford. The customer, Billie Brewer, told investigators that he was not alarmed and presumed the 22-year-old was a Walmart employee taking a gun on sale at the store to a storeroom.", "Ritchie stated repeatedly on his 911 call that Crawford was pointing the gun at people, including two children in particular. This was relayed to the officers on the ground, and before shooting Crawford, [office Sean] Williams called back to the 911 dispatcher to confirm the gun was being pointed at people. In a written statement to Beavercreek police the following day, Ritchie repeated again that Crawford was “pointing the gun at people as they walked by”.", "Yet Ritchie “later explained that the man with the gun wasn’t actually pointing the gun at the family,” according to a report of his interview with state investigators, but rather “swinging the gun around and flashing the muzzle at children”. Ritchie later made similar remarks to the Guardian in an interview. Later still, the surveillance footage showed Crawford occasionally swinging the gun at his side and pointing it at a shelf, but not in the direction of anyone.", "April Ritchie gave a similar account to investigators, adding that Crawford was acting “very shady\"...[She] said she traveled around warning shoppers about Crawford. No one interviewed by investigators recounted this. Surveillance footage showed Crawford continued to look straight ahead. Yet April Ritchie, who had been standing to his left, “said that despite what the video camera was showing, they maintained eye contact with Crawford”.", "So while Ritchie did not take back every claim he made during his 911 call (he insisted that Crawford was \"waving [the pellet gun] around\"), he did later contradict a very significant claim which likely fuelled the escalated police response: that Crawford was pointing the \"gun\" at other shoppers, including children. The meme is again accurate in this respect.", "A judge in nearby Fairborn later ruled that sufficient grounds existed to charge Ritchie with raising false alarms, but Hamilton County special prosecutor Mark Piepmeier declined to proceed, deciding that the  evidence was not clear that Ritchie knew his descriptions of Crawford's movements and actions were factually inaccurate.", "As the meme stated, Ohio is indeed an \"open carry\" state, meaning the carrying of a visible firearm (even a rifle) in public is lawful. However, the legality of open carry does not extend to using a firearm to threaten others. Although Crawford was apparently not threatening anyone and was carrying only a pellet gun, it's worth noting that police arriving at the scene had only one source of information (Ronald Ritchie) who had told them Crawford was carrying a loaded rifle and pointing it at children.", "The Shooting", "The claim that police shot Crawford \"before he even knew what was going on\" is the most contentious assertion made in the meme. The surveillance footage shows that a relatively very short period of time (mere seconds) elapsed between the arrival on the scene of Officer Sean Williams and Sergeant David Darkow, and Williams' fatal shooting of Crawford.", "However, Williams asserted that within that period of time, Darkow repeatedly shouted at Crawford to drop what the policemen thought was a loaded rifle, and that Crawford failed to do so. Williams also claimed that Crawford made an aggressive motion just before he fired two shots at Crawford. Here's how Williams described the incident in a statement he wrote on 5 August 2014:", "We then made it to the final row of the pet department. Sergeant Darkow checked to the left and I covered his back by checking the long row to the right. As I quickly checked to the right I immediately heard Sergeant Darkow yell, \"Drop the weapon!\" As I turned towards the pet department I immediately saw a black male standing in the center of the aisle. He was holding a rifle.", "I quickly identified that he was holding a rifle and I could see the silhouette of the magazine seated in the weapon. Sergeant Darkow repeatedly yelled, \"Drop the weapon!\" The black male, who matched the description of the black male waving the rifle around (blue pants and blue shirt) did not drop the rifle. After repeated commands to drop the weapon the male turned towards us in an aggressive manner with the rifle in hand.", "At that time the black male was in a position where he could shoot me or Sergeant Darkow. I felt at that moment that my life was in immediate danger, that Sergeant Darkow's life was in immediate danger, and that the lives of all the families, children and customers were in immediate danger. I then fired two rounds at the suspect. As I shot the suspect he began to move from my right to my left. Once I fired the shots he retreated backwards and dropped the rifle. He then fell backwards behind the end of the row and out of sight. At that time the rifle was in the open. I then quickly closed the distance between me and the suspect. As I neared the weapon, which was lying on the floor, I identified it again as being a black rifle with a seated magazine. As I neared the rifle the black male jumped from behind the aisle and charged towards the weapon. He began to reach for it as he neared it and I yelled for him to get on the ground. Just before reaching the rifle he collapsed to the floor ...", "Elements of Williams' account were contradicted both by Darkow and civilian witnesses, as the Guardian reported:", "Reports from interviews of Williams and the other officer who responded, sergeant David Darkow, said that they apparently did not identify themselves as police to Crawford as they turned the corner into the aisle where he was standing. They specified that they shouted at Crawford repeatedly “drop your weapon”, “drop your gun” or “drop the gun”.", "Yet three witnesses separately said they heard one, less specific, command: “Put it down, put it down”. Crawford’s family have said surveillance footage suggests that while speaking on his phone, he may not have heard an order or realised that it was directed at him. One witness said she did hear police say “drop your weapon”; another said that he heard “get down”.", "In a recording of the 911 call, a word that sounds like “down” is shouted as officers round a corner in the Walmart, about a second before two shots ring out. Darkow confirmed to investigators that the time between the “last command” being given and shots being fired was “fairly close”.", "Darkow also told his interviewers that before opening fire, he and Williams separately instructed Crawford to put down the gun. Yet Williams said that he did “not recall personally giving any commands”, and that only Darkow had done so.", "Darkow further said that Crawford “made a movement that seemed to indicate an attempt to run or an attempt to take cover” just before the 22-year-old was shot. This description appears to be supported by the store surveillance footage, which was released last week.", "Williams, however, apparently made no mention of this, telling the officials in his interview that he opened fire after Crawford made an “aggressive” move. He added in a written narrative that the 22-year-old had “turned towards us in an aggressive manner with the rifle in hand”.", "By the time Darkow filed his own written narrative, 10 days after his interview, he described Crawford’s final action differently. Darkow said only that it was a “quick movement”, and did not repeat his earlier remarks that Crawford appeared to be trying to retreat.", "In his 911 call, Ritchie can be heard telling a dispatcher that Crawford was \"on his phone\" thirty seconds before his fatal shooting. It's plausible that Crawford, distracted by his phone call, was not aware of the presence of police or their instructions until it was too late.", "Accounts of two other important details also vary: how clear and specific the order police gave to Crawford was (and who exactly issued that order), and whether Crawford made an aggressive or defensive movement immediately before Williams shot him. At the 8:26:54 mark in the video published by WLWT, a voice can be heard shouting what appears to be \"Down!\" followed by what sounds like \"Put the weapon down,\" but two shots were seemingly fired before the second order was completed. Crawford also appeared to retreat sharply after the word \"Down\" was heard rather than moving towards the officers, who had not identified themselves as police.", "However, it's unclear whether Williams and Darkow issued any earlier instructions not captured in the background of Ritchie's 911 call, or how Crawford's movements and gestures appeared to Williams in person (rather than as seen on somewhat grainy surveillance footage).", "Ultimately, we can't say with certainty whether Crawford was shot \"before he even knew what was going on,\" as the meme claims, but evidence to that effect can be interpreted in various ways.", "Aftermath", "Williams shot Crawford in his torso and left arm, and Crawford died later that day at the hospital, as the meme states. Ohio Attorney General Mike DeWine appointed Hamilton County prosecutor Mark Piepmeier to head a grand jury prosecution in Greene County, and in September 2014 that grand jury decided against indicting either Williams or Darkow on charges of murder, reckless homicide or negligent homicide.", "The U.S. Department of Justice investigated whether the shooting of Crawford involved a civil rights violation but ultimately decided it did not and declined to launch a federal civil rights prosecution against Williams:", "Based on a legal analysis of the investigative materials, the Civil Rights Division and the U.S. Attorney have concluded that there is insufficient evidence to establish that Officer Williams acted with the requisite criminal intent necessary to pursue a federal prosecution. To establish that Officer Williams acted willfully, the government would be required both to disprove his stated reason for the shooting -- that he was in fear of death or serious bodily injury -- and to affirmatively establish that Officer Williams instead acted with the specific intent to violate Mr. Crawford’s rights.", "Williams returned to full duty a few days after the Justice Department announced their decision not to proceed with a civil rights prosecution.", "Crawford's family is suing Sean Williams, the city of Beavercreek, and Walmart in a federal civil wrongful death lawsuit.", "McLaughlin, Sheila.   \"John Crawford III Was 'Figuring Out His Next Step.'\"\r\n    The Cincinnati Enquirer.   5 September 2014.", "Swaine, Jon.   \"Video Shows John Crawford's Girlfriend Aggressively Questioned After Ohio Police Shot Him Dead in Walmart.\"\r\n    The Guardian.   14 December 2014.", "Swaine, Jon.   \"Witnesses Contradict Police Account of Warnings Before Walmart Shooting.\"\r\n    The Guardian.   2 October 2014.", "Cornwell, Lisa.   \"Facts, Questions in Fatal Ohio Wal-Mart Shooting.\"\r\n    Associated Press.   21 September 2014.", "Balko, Radley.   \"After Killing John Crawford, Ohio Police Then Berated His Grieving Girlfriend.\"\r\n    The Washington Post.   17 December 2014.", "WLWT-TV.   \"Surveillance Video and 911 Audio of Beavercreek Walmart Shooting.\"\r\n    WLWT.   24 September 2014.", "Swaine, Jon.   \"Doubts Cast on Witness's Account of Black Man Killed by Police in Walmart.\"\r\n    The Guardian.   7 September 2014.", "Franko, Kantele.   \"911 Caller Won't Be Charged in Ohio Wal-Mart Police Shooting.\"\r\n    Associated Press.   19 April 2016.", "Klarr, Nadia A.   \"Recent Changes to Ohio's Gun Laws -- What You Need to Know.\"\r\n    Ohio State Bar Association.   1 April 2017.", "McLaughlin, Sheila.   \"Family of Man Fatally Shot at Wal-Mart 'Disgusted.'\"\r\n    The Cincinnati Enquirer.   21 September 2014.", "United States Attorney's Office, Southern District of Ohio.   \"Federal Officials Close Review of Fatal Shooting of John Crawford III.\"\r\n    11 July 2017.", "Gokavi, Mark.   \"Beavercreek Officer Who Shot John Crawford III Back on 'Full Duty.'\"\r\n     The Dayton Daily News.   18 July 2017.", "Sherrod, Tressa et al.   \"Complaint for Money Damages -- Sherrod et al v. Williams et al.\"\r\n    U.S. District Court, Southern District of Ohio, Western Division.   16 December 2014.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]