["About this rating", "In May 2019, Delta Air Lines came under scrutiny after a photograph emerged on social media that appeared to show a poster encouraging Delta employees to spend their money on video game consoles rather than union dues.", "Eoin Higgins, an editor and writer at the left-leaning web site Common Dreams, tweeted the photograph on 9 May. The poster contained the following text:", "\"Union dues cost around $700 a year. A new video game system with the latest hits sounds like fun. Put your money towards that instead of paying dues to the union.\"", "The poster featured the Delta logo and the URL of the website Don'tRiskItDon'tSignIt.com:", "lol fuck off @Delta pic.twitter.com/fMNOeW9uFG", "— Eoin Higgins (@EoinHiggins_) May 9, 2019", "The union in question, the International Association of Machinists and Aerospace Workers (IAM), posted photographs of similar fliers encouraging Delta employees to spend their money on watching baseball and football instead of becoming union members:", "Oh wow. There’s another one. And it’s just as bad. Really, @Delta? #GameOverDelta pic.twitter.com/JsSMg1aBRb", "— Machinists Union (@MachinistsUnion) May 9, 2019", "Safe to say @Delta didn’t hit a home run with this one either. Three strikes and you’re out. Let ‘em have it, Twitter. #GameOverDelta pic.twitter.com/veEk8rvtXY", "— Machinists Union (@MachinistsUnion) May 10, 2019", "These photographs prompted multiple inquiries from Snopes readers about whether the fliers were authentic and whether Delta was itself responsible for producing them.", "A spokesperson for Delta confirmed to Snopes that the airline had indeed created all of the flyers mentioned above, including the \"video game\" one, and that Delta was also behind the website Don'tRiskItDon'tSignIt.com, which discourages employees — at times in provocative terms — from becoming IAM members:", "In a statement, the Delta spokesperson wrote:", "\"The direct relationship we have with our employees is at the very core of our strong culture and it has enabled continuous investments in Delta people. Our employees have the best total compensation in the industry, including the most lucrative profit sharing program in the world. They want and deserve the facts and we respect our employees’ right to decide if a union is right for them. Delta has shared many communications, which on the whole make clear that deciding whether or not to unionize should not be taken lightly.\"", "In a press release on 9 May, the IAM criticized what it called Delta's \"union-busting propaganda,\" writing:", "\"Delta Air Lines’ all-out assault on their employees’ legally-protected right to unionize with the Machinists Union is confirmation that our campaign to bring the benefits of IAM-representation to more than 40,000 Delta ground workers and flight attendants is succeeding ...", "Delta has resorted to defaming and spewing lies and misrepresentations about the IAM. They also continually display anti-IAM propaganda in the workplace. These are all hallmark signs of how well the IAM campaigns are doing and how scared Delta is of their employees having a voice in their careers.\"", "International Association of Machinists and Aerospace Workers.   \"Press Release -- IAM Campaigns Strike a Nerve With Delta Bosses.\"\r\n    9 May 2019.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]