["The claim has been shared more than 1,700 times after being published here on Twitter on March 14.", "The Twitter post's caption states: “Cristiano Ronaldo’s @PestanaCR7 hotels will become hospitals next week, where patients in Portugal will be treated free of charge. He will pay all medical staff. #COVID19 What a man.”", "The Pestana CR7 Hotels is co-owned by the Pestana Hotel Group and Portuguese football star Cristiano Ronaldo. It currently operates in Lisbon and Funchal in Portugal.", "Below is a screenshot of the misleading tweet:", "Several European countries have been put on lockdown due to the COVID-19 epidemic that has killed more than 6,606 people and infected some 167,511 others, according to this latest WHO report published on March 16.", "The claim has circulated in multiple languages, including English here, here, here and here; in French here, here, here and here; in Portuguese here, here and here and in Russian here and here.", "Sports network ESPN in Brazil and Kenyan news site Tuko also shared a similar claim on their website and Facebook page.", "The claim is false.", "In a telephone conversation with AFP on March 16, a Pestana Hotel spokesperson said: “The information is inaccurate. We did not receive any indication in this regard.”", "The hotel’s Lisbon branch also told Dutch news site RTL Nieuws on March 15: “We are a hotel. We are not going to be a hospital. It is a day like everyone else, we are and will remain a hotel.”", "Cristiano Ronaldo has been in self-isolation in Madeira, Portugal, after his teammate Daniele Rugani tested positive for COVID-19, according to announcements from Italian football club Juventus on March 11 and 12.", "A search on Ronaldo's social media accounts found that he called for the protection of human lives “above all other interests” during the pandemic in this March 14 Instagram post.", "A post shared by Cristiano Ronaldo (@cristiano) on Mar 13, 2020 at 9:15am PDT", "Apart from sharing the same post on Twitter and Facebook, he has not posted about COVID-19 since its outbreak in January 2020.", "Since the beginning of 2020, he posted twice about the Pestana Hotels. One post on January 22 provided updates on a new hotel project in Madrid, and another post on February 7 promoted the group's hotel in Lisbon.", "A Google keyword search on “Cristiano Ronaldo” between January 1 and March 17, 2020, found no news reports about the footballer’s “plan” to turn his hotels into hospitals.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]