["About this rating", "On 16 November 2017, under the leadership of House Speaker Paul Ryan, the United States House of Representatives passed their version of what would later become the sweeping GOP tax reform bill of 2017. Thirteen days later, Charles and Elizabeth Koch donated $247,000 apiece to Paul Ryan’s fundraising campaign, \"Team Ryan,\" according to filings published by investigative journalism outfit ProPublica.", "\"Team Ryan\" is not a single campaign fund but rather a joint-fundraising committee that raises money for Paul Ryan’s re-election fund (Ryan for Congress), the National Republican Congressional Committee (NRCC), and Paul Ryan's leadership PAC named Prosperity Action. Because of that factor, it is important to be precise about where money given to \"Team Ryan\" is actually going.", "Columbia Law School professor and government ethics expert Richard Briffault told us that only a portion of those donations would benefit Ryan directly, making the contributions \"less a reward for Ryan personally\" and more of a win for House Republicans generally:", "Most of the money cannot have gone to Ryan's campaign committee — the most that committee could legally receive is $10,800 — $5400 from each of the husband and wife Kochs.", "Each could also give $237,000 (or $474,000 for the two of them) — the maximum allowable — to the NRCC — the Congressional Campaign arm of the Republican party, presumably to be used in races other than, or in addition to, Ryan's own.", "The remainder appears to have gone to Prosperity Action, Ryan's Leadership PAC — probably $5000 from each of them. The Leadership PAC can only give to other candidates.", "The Koch donations have raised eyebrows, given the financial benefit that the Kochs and their business ventures would seemingly enjoy under the new tax plan. Adam Smith, communications director at campaign finance reform nonprofit Every Voice, told the International Business Times (IBT) that:", "Republicans never hid the fact that this tax bill was about pleasing their big donors. And it looks like House Speaker [Paul] Ryan is quickly being rewarded for passing this legislation that overwhelmingly benefits the Kochs and billionaires like them.", "Richard Painter, former chief White House ethics lawyer in the George W. Bush administration, co-director of Citizens for Responsibility and Ethics in Washington, and a Professor of Law at the University of Minnesota Law School, concurs. He told us via e-mail that this seemed \"pretty close to an illegal gratuity,\" which in this case would be a payment as thanks for an official action, a lesser but related offense to bribery, according to the Department of Justice.", "Casting aside the massive grey area within the interpretation of laws pertaining to political fundraising, we note it is equally important to point out that the Kochs were far from the only ones to participate in similar political giving activity. Six other $100,000 donations were made to Team Ryan after the passage of the bill, according to the IBT:", "[The Koch] donations were by far the largest sums added to Ryan’s coffers in the fourth quarter of 2017, but they were by no means the only major contributions: Marlene Ricketts, the wife of billionaire TD Ameritrade founder Joe Ricketts, donated $100,000, as did five other individuals.", "When we asked Professor Briffault whether these donations were something to get worked up about or simply \"politics as usual,\" he told us that he rejected the premise of the question, suggesting instead that it could be both: \"I am tempted to suggest that you've made a false opposition — that this is both something to get worked up about and politics as usual,\" he wrote.", "DeBonis, Mike, and Damian Paletta.   \"House Passes GOP Tax Bill, Upping Pressure on Struggling Senate Effort.\"\r\n    The Washington Post.   16 November 2017.", "ProPublica.   \"Receipts by Team Ryan for Filing 1198231.\"\r\n    Accessed 23 January 2018.", "FEC.gov.   \"Citizen’s Guide\"\r\n    Accessed 23 January 2018.", "The Wall Street Journal.   \"Billionaire Koch Brothers Invest Millions More to Promote Tax Overhaul.\"\r\n    21 December 2017.", "Kotch, Alex.   \"After Scoring Huge Tax Cuts, Charles Koch Floods Ryan with Cash.\"\r\n    International Business Times.   19 January 2018.", "Correction [25 January 2018]: Prosperity Action is a leadership PAC, not a super PAC, as a previous version of this article erroneously stated.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]