["About this rating", "This appeal to help a child with cancer is merely yet another reiteration of a long-running class of hoax (often built around like farming), one which lures the gullible into spreading such messages by promising that some entity (such as Facebook) will donate money towards the medical treatment of a child with cancer (or some other disease) every time the message is forwarded, posted, liked, or shared. Multiple charities and companies have been unfairly dragged into such hoaxes over the years by being named in messages like these, causing them to have to spend considerable time and effort disclaiming them.", "The child whose photograph was appropriated for this hoax is not displaying visible symptoms of cancer.\nHe's identified on multiple other online sites as a boy experiencing a reaction to the MMR vaccine and/or a case of rubella.", "Others versions of this hoax positing that Facebook will donate money every time such an item is liked or shared have circulated using a variety of different (unrelated) pictures:", "this child's got a cancer. facebook is ready to pay 3 cent for every share. we don't know is it true or not, but let's everybody share. maybe it's true and then...", ">SHARE< for this baby \nPLEASE SHARE, THANKS! \nBy: 999,999,999 people", "She's suffering form cancer! Facebook has promised\nto give $1.20 Dollars on each share! Please, share and make it.  On the\naccount of:  Imran Khan", "He is terribly sick :(\nWhat if this was your baby?  Would you care at all?\nFacebook will donate $1 for every share", "This child has lost his 4 limbs in a school bus accident.\nFacebook will pay 1$ for every share..... \"", "Cook, Morgan.   \"Mother Works to Stop Exploitation of Child for Online Hoax.\"\r\n     North County Times.   9 February 2012.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]