["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Democratic presidential candidate Sen. Elizabeth Warren, D-Mass., speaks during a Democratic presidential primary debate on Nov. 20, 2019, in Atlanta. (AP)", "In the Nov. 20 Democratic presidential debate, Sen. Elizabeth Warren called for student loan debt forgiveness after citing a startling racial disparity statistic.", "\"Today in America — a new study came out — 20 years out, whites who borrowed money, 94% of them have paid off their student loan debt; 5% of African Americans have paid it off,\" Warren, D-Mass., said.", "There are racial disparities when it comes to student debt.", "But Warren misstated these two figures.", "Warren has proposed that, for anyone making under $100,000, the federal government would pay off up to $50,000 of their debt. The government would also help people making up to $250,000, although on a sliding scale.", "Student loan debt totals nearly $1.5 trillion, according to an August 2019 report from the Federal Reserve Bank of New York. That’s as high as it’s ever been and up about 200% from 2006, we’ve found. It is a result of increases in both the number of borrowers and the loan balances they carry.", "As for race, 17.7% of borrowers who live in black-majority ZIP codes default on their student loans — nearly double the rate (9%) of borrowers from white-majority areas, according to a report from the Federal Reserve Bank of New York released a week before the debate.", "But Warren’s claim alludes to a September 2019 report from Brandeis University in Massachusetts.", "The major finding of the Brandeis study is this:", "\"Twenty years after starting college, the median debt of white borrowing students has been reduced by 94% — with almost half holding no student debt — whereas black borrowers at the median still owe 95% of their cumulative borrowing total.\"", "The problem here is that Warren talked about borrowers, whereas the statistic she tried to cite from the study talked about the amounts borrowed.", "1. Warren claimed that the study said that 20 years out, 94% of white borrowers had paid off their student loans.", "But what the study’s measure of student debt actually found is that, 20 years after starting college, the median debt of white borrowers had been reduced by 94%.", "2. Warren claimed the study said that only 5% of African American borrowers had paid off their student debt.", "But the study found that the median debt of black borrowers had decreased by only 5%.", "We wondered about data for the borrowers.", "Three student debt experts who were not part of the study pointed out another racial disparity finding of the study: 48% of white borrowers had paid off their student loans, compared with 26% of black borrowers.", "A Warren campaign spokesman acknowledged that Warren misquoted the study, saying the study is \"another alarming reminder of why we need to cancel student loan debt and close the racial wealth gap.\"", "One of the study’s authors told us that Warren gets right the broader policy point that there are racial disparities in student debt that should be addressed.", "\"In the important discourse concerning student debt and when race is added, Sen. Warren is right on the mark,\" said Tom Shapiro, director of Brandeis’ Institute on Assets and Social Policy.", "But, as we’ve laid out, the way she stated it in the debate was wrong.", "Warren said: \"Today in America — a new study came out — 20 years out, whites who borrowed money, 94% of them have paid off their student loan debt; 5% of African Americans have paid it off.\"", "There are racial disparities in repaying student loans, but Warren misquoted a Brandeis University study. It found that 20 years after starting college, the amount of debt of white borrowers had been reduced by 94%, versus 5% for black borrowers.", "We rate Warren’s statement Mostly False.", "YouTube, Democratic presidential debate (1:28:50), Nov. 20, 2019", "Interview, Elizabeth Warren campaign spokesman Chris Hayden, Nov. 21, 2019", "Email, Tom Shapiro, director of Brandeis University’s Institute on Assets and Social Policy, Nov. 21, 2019", "Associated Press, \"AP Fact Check: Claims From the Democratic Debate,\" Nov. 21, 2019", "PolitiFact, \"Elizabeth Warren: Does her wealth tax pay for her child care and higher education plans?\" April 25, 2019", "Federal Reserve Bank of New York, \"Racial Disparities in Student Loan Outcomes,\" Nov. 13, 2019", "Federal Reserve Bank of New York, \"Quarterly report on household debt and credit,\" August 2019", "Federal Reserve Bank of New York, \"Who Borrows for College—and Who Repays?\" Oct. 9, 2019", "Email, publisher of Savingforcollege.com Mark Kantrowitz, Nov. 21, 2019", "Email, Urban Institute senior fellow Sandy Baum, Nov. 21, 2019", "Email, Judith Scott-Clayton, Columbia University professor of economics and education, Nov. 21, 2019", "Brandeis University Institute on Assets and Social Policy, \"Stalling Dreams  — How Student Debt is Disrupting Life Chances and Widening the Racial Wealth Gap,\" September 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]