["The vice presidential debate quickly dissolved into Republican Mike Pence and Democrat Tim Kaine interrupting and talking over each other to score points against the top of the ticket candidates. In an exchange about security in Iraq, Pence said, \"Iraq has been overrun by ISIS because Hillary Clinton failed to renegotiate, Hillary Clinton failed to renegotiate a status of forces agreement.\"", "\"No, that is incorrect,\" Kaine shot back.", "The argument centers on a period in 2011, when the Obama administration was negotiating with Iraqi Prime Minister Nouri al-Maliki to keep troops in Iraq. Called a status of forces agreement, it would have kept up to 10,000 troops on the ground beyond Dec. 31, 2011. Obama was working against a deadline signed by President George W. Bush late in 2008. Under the Bush agreement, American troops would be gone by the end of 2011.", "As 2011 began, military commanders in Washington and in Baghdad pushed for a residual force of between 16,000 and 24,000 to conduct counterrorism work and train Iraqi security forces.", "The White House, reports show, was not open to a force that size. Its number was 10,000. But the Iraqis balked as well, so that number shrank.", "The New York Times detailed how the force grew smaller until negotiations failed altogether.", "According to the New York Times, Obama himself ruled out the 10,000-troop option in an Aug. 13, 2011, conference call, dropping the number to about 3,500 troops.", "But even that lower figure hit a brick wall. The agreement failed over a demand that American troops be given immunity from prosecution by Iraqis, a very touchy political issue within the Iraqi Parliament. Some experts said Iraqi leaders may not have been willing to take great political risk with their citizens in exchange for a relatively small American force.", "But no immunity meant no sizable residual troop presence.", "\"When the Americans asked for immunity, the Iraqi side answered that it was not possible,\" al-Maliki said in an October 2011 news conference. \"The discussions over the number of trainers and the place of training stopped. Now that the issue of immunity was decided, and that no immunity to be given, the withdrawal has started.\"", "Austin Long, a Columbia University international and public affairs professor, told PolitiFact in 2015 that al-Maliki allegedly supported the residual force and may have signed a new plan, but the Iraqi Parliament would not. There has been plenty of debate since then on whether it was Washington or Baghdad that was more intractable on a new agreement.", "Christopher Preble, vice president for defense and foreign policy studies at the Cato Institute, said an Iraqi delegation to the institute agreed terms of the planned renewal could not have passed parliament.", "\"They said that the Iraqi government was too weak and unwilling to go against the wishes of those Iraqis who wanted the Americans to leave,\" Preble told us in 2015.", "On Oct. 21, 2011, Obama announced the pullout of the vast majority of American troops in Iraq by Christmas. Staying behind were a couple hundred Marines to train the Iraqi army and provide security for diplomatic personnel.", "Important to this fact-check, the State Department has overall responsibility for leading the U.S. government’s negotiation of status of forces agreements. However, while the U.S. ambassador to Iraq was involved (ambassadors work for the State Department), the key decisions and negotiations with Iraq took place inside the White House. At times, Obama himself was on the phone with al-Maliki.", "Our ruling", "Pence said Clinton failed to negotiate a status of forces agreement with Iraq. It is accurate to say that negotiations failed. However, the claim suffers from a number of flaws.", "It puts too much emphasis on Clinton’s role, when the key decisions and discussions took place between the White House itself and Iraqi leaders.", "The Obama administration wanted to insulate American troops from legal action in Iraq. That was a political minefield in Iraq. While there is room for debate on whether American negotiators could have found a way around that problem, there is no reason to believe the administration simply walked away from a deal to keep U.S. troops in Iraq.", "The claim has an element of truth, but it leaves out much key information that would give a different impression. We rate this claim Mostly False.", "https://www.sharethefacts.co/share/e0674d59-28b4-4206-af4a-35dc9368b0ed", "International Security Advisory Board, Report on Status of Forces Agreements, Jan. 16, 2015", "WhiteHouse.gov, \"Remarks of President Barack Obama – As Prepared for Delivery, Responsibly Ending the War in Iraq, Camp Lejeune, North Carolina,\" Feb. 27, 2009", "Los Angeles Times, \"U.S. willing to leave 10,000 troops in Iraq past year's end, officials say,\" July 6, 2011", "Time, \"Iraq’s Government, Not Obama, Called Time on the U.S. Troop Presence,\" Oct. 21, 2011", "Wall Street Journal, \"Obama's Tragic Iraq Withdrawal,\" Oct. 21, 2011", "The Atlantic, \"U.S. Troops Are Leaving Because Iraq Doesn't Want Them There,\" Oct. 21, 2011", "New York Times, \"In U.S. Exit From Iraq, Failed Efforts and Challenges,\" Sept. 22, 2012", "New York Times, \"Iraq War Haunts Potential Bush Candidacy, as It Did Clinton in 2008,\" May 15, 2015", "New York Times, 2008 Status of Forces Agreement, accessed May 14, 2015", "PolitiFact, Obama wanted to keep 10,000 troops in Iraq, ABC's Raddatz claims, Aug. 24, 2014", "PolitiFact, Obama refused to sign plan in place to leave 10,000 troops in Iraq, Bush says, May 18, 2015", "Interview with Austin Long, Columbia University international and public affairs professor,  May 14, 2015", "Interview with Christopher Preble, vice president for defense and foreign policy studies at the Cato Institute, May 14, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]