["By Eugene Kiely", "Posted on November 22, 2017", "Sen. Bill Cassidy claims he has a way to prevent the Senate tax plan from raising health insurance premiums. He doesn’t.", "In an interview with Fox News’ Neil Cavuto, the Louisiana Republican acknowledged that some in his party — including Sen. Susan Collins — have concerns about passing a Senate tax bill that would increase health insurance premiums on the individual market by 10 percent.", "As we have written before, the Senate tax bill contains a provision that would eliminate the penalty on Americans who don’t buy health insurance. The nonpartisan Congressional Budget Office and the Joint Committee on Taxation have said in a joint report that repealing the individual mandate would increase average premiums on the individual market “by about 10 percent in most years of the decade.”", "But Cassidy, who is a member of the Senate committees that deal with taxes and health care, told Cavuto that he has a solution. He said that concurrently passing the tax bill and the Bipartisan Health Care Stabilization Act of 2017 – a bill introduced by Sens. Lamar Alexander, a Republican, and Patty Murray, a Democrat — would result in “net lower premiums.”", "Cassidy, Nov. 20: The argument will be that it will increase premiums. CBO said — and I have an e-mail from them — that it will raise premiums by 10 percent if you repeal the individual mandate. But if we do the Alexander-Murray bill on the cost-sharing reduction payments, that will actually lower premiums by 25 percent. So we can net lower premiums if we concomitantly put forward the Alexander-Murray bill on cost-sharing reduction payments and lower the deficit. So, I do think there`s a way forward, even if Senator Collins is concerned about the individual mandate.", "Cassidy is wrong on two counts: CBO has not said the bipartisan health care bill will “lower premiums by 25 percent,” so passing both bills would not result in “net lower premiums.”", "Let’s first explain what the bipartisan health care bill would do.", "Under the Affordable Care Act, the federal government provides cost-sharing subsidies that help reduce out-of-pocket costs for those who earn between 100 percent and 250 percent of the federal poverty level and buy their own insurance on the ACA’s state and federal marketplaces. The subsidy payments are made directly to insurance companies.", "The Trump administration last month said that it will no longer make cost-sharing subsidy payments because the Republican-controlled Congress has not appropriated the funds for them. CBO has estimated that ending the subsidies would increase premiums on the individual market by 20 percent in 2018 and 25 percent by 2020.", "The bipartisan health care bill would, among other things, continue to provide cost-sharing subsidies for 2017, 2018 and 2019.", "In a joint analysis of the bipartisan health care bill, CBO and the JCT said the bill would have no impact on premiums in 2018 and 2019, but premiums may rise in 2020 because of the uncertainty about the fate of the subsides that year.", "“CBO and JCT assume that this legislation will not be enacted until after open enrollment for insurance for 2018 begins on November 1, 2017. Therefore, premiums for 2018 plans would already have been finalized and enacting the legislation would not affect premiums for that year,” the joint report says. “Because CBO’s baseline incorporates the assumption that CSRs will be fully funded for 2019, premiums for 2019 would not change under the legislation, relative to that baseline. To the extent that there is uncertainty in 2020 about whether CSRs will be funded, CBO and JCT expect that insurers would increase premiums in that year relative to the baseline projections.”", "In other words, the joint report says the bipartisan bill would not lower premiums; it would prevent premiums from going up by 20 percent in 2018 and 25 percent by 2020. That’s because the CBO and the JCT assume that if the bill passes then cost-sharing subsidies would continue uninterrupted in 2018 and 2019.", "Likewise, the joint report on repealing the individual mandate assumes that the cost-sharing subsidies would “remain in place.” That report says, “For this analysis, CBO and JCT have measured the budgetary effects relative to CBO’s summer 2017 baseline, which underlies the Concurrent Resolution on the Budget for Fiscal Year 2018. In that baseline, the ACA’s other provisions, including premium tax credits and cost-sharing reduction (CSR) subsidies in the marketplaces that the legislation established, are assumed to remain in place.”", "Since both CBO and JCT reports assume that the cost-sharing subsidies would continue, the passage of both bills would not result in “net lower premiums,” as Cassidy claimed. The passage of both bills would result in a net increase. After the cost-sharing subsidies end in 2019, health care premiums would increase even more.", "Cassidy’s office insists that the senator is right. It tells us that the health insurance rates already have gone up for 2018 and passing both bills will result in a 10 percent to 15 percent reduction in rates, citing the CBO reports we discuss above.", "But that’s moving the goalposts. Cassidy’s office is using 2018 as the baseline year, while citing CBO reports that use 2017 as the baseline.", "It’s true that insurance companies have increased premiums on the individual market for 2018 because of the uncertainty surrounding the cost-sharing subsidies. A Kaiser Family Foundation analysis of 2018 insurer rate filings with state regulators found that silver plans on the ACA market increased by 7 percent to 38 percent due solely to ending the subsidy payments to insurers. (Those who are eligible for cost-sharing subsidies must choose a silver plan, as opposed to a bronze, gold or platinum level plan, on the ACA markets.)", "But while the bipartisan health care bill would essentially roll back those increases, it would have no impact on the 10 percent rate hike as a result of the tax bill’s repeal of the individual mandate.", "Eli Zupnick, a spokesman for Murray, said Cassidy’s “point that Murray-Alexander would ‘offset’ the damage done by repealing the individual mandate is off base and wrong.” We agree.", "FactCheck.org Rating:", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]