["About this rating", "Easily the most-watched annual sporting event in the United States, the Super Bowl has grown, from its inception as a championship football game in 1967, into an all-day, nationwide entertainment extravaganza. Today's Super Bowl viewer is as likely to tune in for a glimpse of the most expensive TV advertising on Earth, or to catch the glitzy halftime show featuring top entertainers of the day, as to follow the game itself.", "The roster of pop stars headlining the Super Bowl has included the likes of Beyonce, Paul McCartney, Katy Perry, Bruce Springsteen, and Madonna. Some of the shows have attained legendary status. When Michael Jackson was booked in 1993, his three-song set garnered higher ratings than the first half of the football game. Eleven years later, when his sister, Janet Jackson, performed a duet with Justin Timberlake between halves of Super Bowl XXXVIII, her breast was exposed on live television, earning the CBS network an FCC fine for indecency and introducing the euphemism \"wardrobe malfunction\" to the English lexicon.", "When the flamboyant, outspoken Lady Gaga was hired to perform at the 2017 Super Bowl not long after President Donald Trump was inaugurated, there was speculation that she might use her stage time to make a political statement. Gaga, who supported Hillary Clinton in the election and has made many a public statement in support of LGBTQ rights and against bullying, once described Trump as \"one of the most notorious bullies we've ever seen.\"", "For less coherent reasons, it was also speculated that Gaga was planning to conduct some sort of grotesque Satanic ritual at halftime. Conspiracy theorist and Trump enthusiast Alex Jones issued a video in which he worked himself into a lather detailing alleged connections between Lady Gaga, the \"pizzagate\" scandal, \"spirit cooking,\" meat suits, Satanic rituals, and \"the rise of the robots\":", "... now we hear about Lady Gaga, who admittedly was part of the whole pizzagate situation, with the spirit cooking lady, the Aleister Crowley events, she admits she has someone sleep in her room at night because she believes a demon's going to attack her. Whether you believe in demons or not, when she wears meat suits and does all these rituals, and Madonna does it, too, the organizers of the Super Bowl are deciding to defile America and break our will by having us bow down to this. And she's reportedly going to be on top of the Super Bowl (they're saying she may cancel doing this), on top of the stadium, ruling over everyone with drones everywhere surveilling them in a big swarm, to just condition them that \"I am the goddess of Satan ruling over you with the rise of the robots,\" in a ritual of lesser magic.", "By way of clarification (to the extent that's even possible), the \"pizzagate situation\"\nJones refers to is a thoroughly discredited conspiracy theory (which Jones and his followers nevertheless cling to) holding that former First Lady, U.S. Senator, Secretary of State, and Democratic presidential candidate Hillary Clinton runs a child sex ring out of a Washington, D.C. pizzeria.", "\"Spirit Cooking\" refers to a conceptual art project by performance artist Marina Abramovic which has been misrepresented by Jones and others as an actual \"Satanic\" or \"occult\" ritual in which leaders of the Democratic Party, most notably former Hillary Clinton campaign chairman John Podesta, supposedly participated.", "The only piece of evidence allegedly implicating Lady Gaga in these supposed \"scandals\" is a viral image people say shows her attending a \"spirit cooking ritual\" led by Abramovic:", "However, the photograph depicts no such event. It was taken at the 20th Annual Watermill Center Summer Benefit, an art auction supporting residency programs at the renowned arts facility located near Southampton, New York. Along with more than 1,000 other attendees, including many well-known artists and celebrities, Gaga and Abramovic were both guests at the 27 July 2013 event, which, although its stated theme was \"Devil's Heaven\" and it featured purposely shocking avant-garde installations such as the one seen above, had no connection with Abramovic's \"Spirit Cooking\" oeuvre.", "Based on her own statements and actions, Gaga's spiritual inclinations might best be described as eclectic, inclusive, or, least charitably, confused. Born and raised a Catholic, she says that although she has had disagreements with the Church she is \"very religious,\" believes in Jesus, and prays. But she also finds religion \"bogus,\" she says, in the sense that most, if not all religions, historically, have persecuted minorities. \"I dream of and envision a future where we have a more peaceful religion, or a more peaceful world, a more peaceful state of mind for the younger generation,\" Gaga told Larry King in a 2010 television interview. She has also promoted the teachings of the Dalai Lama, the Tibetan Buddhist leader, and studied meditation with celebrity spiritualist Deepak Chopra, whom she reportedly sought out for counsel after experiencing dreams of being \"haunted\" by the devil.", "Dreaming that one is being chased by devils is not the same as worshiping Satan, we submit, despite what rumor-mongers like Alex Jones would have us believe. Nevertheless, in a classic instance of confirmation bias (defined as the tendency to interpret new evidence as proof of what one already believes), Lady Gaga's actual halftime show, which Variety described as unprovocative and \"overall a little weak,\" was condemned by more excitable observers as a \"Satanic performance\" replete with \"ritualistic Illuminati references\" such as \"pentagrams lining the stage, flames, black clothing, and 666 hand symbols over the eyes.\"", "Others source claimed Gaga's show contained allusions to 9/11, Freemasonry, and the biblical story of the fall of Lucifer:", "A 6 February 2017 Facebook post shared by close to 60,000 people elaborated on the \"fall of Lucifer\" theme, claiming \"We just saw Satan's fall in theatric [sic] form\":", "Let me get this straight:", "So Gaga is standing above all. On the highest point, above all creation in that stadium. Can't get any higher. Stars are lighting up behind her and as the stars are illuminating in the sky she sings about “god” and this nation is made for “you and me”... THEN ...", "She falls from the highest point, from the stars, to the second high point... with the first words out of her mouth being,", "“I'm on the Edge of Glory”...", "Does any of that sound familiar? What scene was just played out? Anyone...", "Here Let me help...", "\"How are you fallen from heaven, O Lucifer, son of the morning!\nHow you are cut down to the ground, you who weaken the nations!\nFor you have said in your heart,", "“I will ascend into heaven, I will exalt my throne above the stars of God; I will sit also on the mount of the congregation, in the recesses of the north; I will ascend above the heights of the clouds, I will be like the Most High.”", "Notice… Nations. stars. Above the congregation (above the stadium of people)... fell from grace (she fell and is on the edge of Glory)…", "While we are all hypnotized by the light, glamor, sound we are singing and children are hearing...", "“I want your love, you vertical stick”", "and lyrics like….", "“I'm beautiful in my way\n'Cause God makes no mistakes;\nI'm on the right track baby I was born this way.\nNo matter gay, straight, or bi\nLesbian, transgendered life\nI'm on the right track baby I was born this way”", "Complete blasphemy of Gods creation, defaming and devaluing the Holyness of the father And who does that? Lucifer. He twist the words of God ALWAYS and makes himself look good and God bad.", "Did the Lord not tell us “For even Lucifer disguises himself as an angel of light” -2 Corinthians 11:14", "Lucifer is the god of this world. He creates all the time reminders about his presence and control over you very frequently. Because most don’t know Gods word they do not recognize it.", "Lady Gaga is not a Christian. She practices many satanic things and because of that her thoughts and ideas come from the fallen kingdom … not the Lord's. We just saw Satan's fall in theatric form and the entire world clapped and for him and his blasphemy… READ THE BOOK AND OPEN YOUR KINGDOM EYES.", "As is obvious from the examples above, anyone can represent themselves as an expert on \"Satanism\" and accuse others of practicing it, but that doesn't mean they know what they're talking about. If you shed such preconceived notions before watching Gaga's actual performance, which opens with her perched on the roof of Houston's NRG Stadium in an acrobatic harness, belting out refrains from \"God Bless America\" and \"This Land Is Your Land\" until she leaps (not falls) to the stage below, you'll wonder how anyone could seriously interpret it as a re-enactment of Lucifer being tossed out of heaven. And those allegedly Satanic \"flashing pentagrams\" adorning the stage? They make much more thematic sense interpreted as five-pointed stars from the American flag.", "Alex Jones' version of \"Satanism,\" if you recall, was Lady Gaga peering down from the top of the stadium, surrounded by flying drones, as if to say, \"I am the goddess of Satan ruling over you with the rise of the robots.\" For what it's worth, we scoured both the old and new testaments of the Bible for references to Satanic robots, and came up empty-handed.", "So, what was the meaning of Gaga's halftime performance? During preparation for the event, she expressed the hope that it would have a unifying effect on the country. When asked at a press conference a few days before the Super Bowl if she still hoped to do that, and whether she would be making any other kind of statements, she said:", "Well, I don’t know if I will succeed in unifying America. You’ll have to ask America when it’s over. But the only statements that I’ll be making during the halftime show are the ones that I’ve been consistently making throughout my career.", "I believe in a passion for inclusion. I believe in the spirit of equality, and the spirit of this country as one of love and compassion and kindness. So my performance will have both those philosophies.", "... Essentially, that kid that couldn’t get a seat at the cool kids table and that kid who was kicked out of the house because his mom and dad didn’t accept him for who he was? That kid is going to have the stage for 13 minutes. And I’m excited to give it to them.”", "Here, courtesy of the National Football League, is Lady Gaga's full Super Bowl LI halftime performance:", "Eisenberg, Dana.    \"Lady Gaga Says Her Super Bowl Halftime Show Will Be About 'Inclusion' and 'Equality.\"\r\nMediaite.     2 February 2017.", "Heyman, Marshall.     \"Avant-Garde Art 'Shocks' the Hamptons.\"\r\nThe Wall Street Journal.     28 July 2013.", "Hughes, Roland.     \"All About Lady Gaga's Super Bowl Show.\"\r\nBBC News.     6 February 2017.", "Saraiya, Sonia.     \"Super Bowl Halftime Review: Lady Gaga Takes Safe Route with Hits and Spectacle.\"\r\nVariety.     5 February 2017.", "Watson, Paul Joseph.     \"Hillary Tied to Bizarre Occult 'Spirit Cooking' Ritual.\"\r\nInfoWars.     4 November 2016.", "CNN.com.     \"Lady Gaga on Catholicism.\"\r\n2 June 2010.", "InfoWars.     \"Lady Gaga to Conduct Satanic Ritual at Super Bowl LI.\"\r\n5 February 2017.", "MTV.co.uk.     \"Lady Gaga 'Haunted by the Devil' in Her Sleep.\"\r\n20 February 2012.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]