["The claim was shared here on Facebook on 13 December 2020 alongside a partial screenshot of a document.", "Part of the Korean-language text in the image translates to English as: “Payment standard. Base payment: 14,600 won (per day).", "“Doctor / Professors, full-time doctors, training doctors treating patients. 14,600 won (100%).", "“Nurse / Nurses, head nurses treating patients. 14,600 won (100%).”", "The post reads: “14,600 won of daily wage for frontline health workers... What the hell is this? Not hourly but daily? 14,600 won per day? [The government] has lost its mind.”", "A similar claim was also shared here, here, here and here on Facebook.", "The claim, however, is false.", "'Extra allowance'", "Yoon Jeong-hwan, the head of the human resources management team at South Korea’s Central Disaster Management Headquarters, told AFP that the figure in the misleading post is the “extra allowance” paid to frontline healthcare workers across the country “to boost their morale”. It does not equate to their daily wage, he said.", "“The subsidy came in place after South Korea approved the third additional budget in July, which included such extra allowances for healthcare workers. While some regions may make the payments at different times, the base payment of 14,600 won is the same across the country,” he told AFP by phone on December 18, 2020.", "Misleading context", "Through a combined keyword search AFP found the image in the misleading Facebook post was taken from this report by South Korean politician Kang Yonggu. It argues the range of subsidies being paid to frontline workers treating Covid-19 patients is “problematic”.", "The December 14, 2020 release included a statement cricitising the country’s health authorities for allowing such a discrepancy in payments among different departments. It also criticised the fact that part-time and administrative staff are not eligible to apply for the government subsidies.", "In response to the misleading posts, he told AFP during a phone conversation on December 17, 2020: “The figures in my report accurately refer to the government subsidies paid to healthcare workers”.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]