["By Saranac Hale Spencer", "Posted on February 28, 2018", "Q: Are the victims of the Sandy Hook Elementary School shooting actually alive?", "A: No. That is a claim made by conspiracy theorists who believe the shooting never happened.", "The tragedy that left 17 dead in a Florida high school on Feb. 14 was almost immediately swallowed up by conspiracy theories — a phenomenon that has led to renewed online interest in similar conspiracy theories about other mass shootings.", "The most popular theory — that the Florida students who survived the shooting and are now advocating changes to gun laws are actually just “crisis actors” — is a reprisal of a claim that originated with the deadly shooting at Sandy Hook Elementary School in Newtown, Connecticut, in 2012.", "That was likely the first mass shooting in which conspiracy theorists used the term “crisis actor.”", "Now, a new story about the Newtown shooting has been circulating on Facebook claiming that the 20 children who were shot dead in their elementary school are actually still alive and the shooter, Adam Lanza, was a “crisis actor.”", "Users of the social media site flagged the story as potentially false. It is.", "The story sums up the general theory this way: “The New World Order wants to disarm the American people. That’s why they created all of these hoax shootings.” It goes on to say later, “Don’t give up your guns. After each one of these fake shootings go buy another gun.”", "It also features photos that were shared by one of the ringleaders of the Sandy Hook conspiracy theorists, Wolfgang Halbig. On Sept. 24, Halbig tweeted pictures of about a dozen smiling adolescents with the claim: “Here are children who died at Sandy Hook live and well.” He reposted one of the photos on Twitter again in December with the sign-off, “Merry Christmas.”", "Reached by phone on Feb. 27, Halbig said that the photos were emailed to him anonymously and that he believed they were sent by three of the students themselves.", "Along with the suggestion that the families of the victims were all “crisis actors,” the Facebook story claims that Adam Lanza, who shot himself after killing 26 in the school, was a “crisis actor.”", "Without any evidence, the story claims that the same person who “played” Adam Lanza also “played” the brother of Christina Grimmie, the pop singer who was shot dead in Orlando, Florida, while signing autographs in 2016.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to help identify and label false stories flagged by readers on the social media network.", "Washington Post staff. “The lives lost in the Parkland school shooting.” The Washington Post. 19 Feb 2018.", "Hale Spencer, Saranac. “School Shooting Spawns Conspiracy Theories.” FactCheck.org. 25 Feb 2018.", "Koebler, Jason. “Where the ‘Crisis Actor’ Conspiracy Theory Comes From.” Motherboard. 22 Feb 2018.", "“Sandy Hook alleged victims alive and well!!! So is Adam Lanza Christina Grimmie’s brother!!!” Steemit.com. 17 Feb 2018.", "Beckett, Lois. “Remembering the 26: how families honor Sandy Hook victims five years later.” The Guardian. 14 Dec 2017.", "Wiedeman, Reeves. “The Sandy Hook Hoax.” New York Magazine. 5 Sep 2016.", "Office of the State’s Attorney, Danbury, Connecticut. “Report of the State’s Attorney for the Judicial District of Danbury on the Shootings at Sandy Hook Elementary School and 36 Yogananda Street, Newtown, Connecticut on December 14, 2012.” 25 Nov 2013.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]