["About this rating", "One of the advantages of campaigning as a political outsider who is new to elective office is that you have no track record to defend -- you can criticize and pick away at the actions experienced politicians and incumbents have taken without fear of having the tables turned on you. That approach only works once, however: once you gain office, you become fair game for the same type of attacks yourself.", "That phenomenon played out quite prominently with U.S. President Donald Trump in June 2019, as tensions between the United States and Iran ratcheted up and news reports suggested the U.S. had come close to launching a Trump-approved military strike on Iran.", "Before gaining the White House (his first elective office), Trump had been particularly critical of incumbent president Barack Obama, repeatedly tweeting over a span of years his prediction that President Obama would \"attack\" or \"start a war\" with Iran. Initially Trump maintained that Obama would do so to boost his re-election chances, then when the 2012 election (which Obama won) passed without an attack on Iran, Trump shifted to offering other reasons. The full list of Trump's proffered rationales for an Obama-led attack on Iran eventually encompassed all of the following:", "As the contretemps with Iran flared up in mid-2019, some of Trump's critics -- many of whom had leveled the very same accusations against him over his conduct of U.S. foreign policy -- took to posting collections of his tweets about President Obama and Iran via social media:", "All of the tweets featured in those collections were in fact posted by Donald Trump's Twitter account and remain undeleted to this day. Here are all of them as they appeared, in chronological order:", "In order to get elected, @BarackObama will start a war with Iran.", "— Donald J. Trump (@realDonaldTrump) November 29, 2011", "I always said @BarackObama will attack Iran, in some form, prior to the election.", "— Donald J. Trump (@realDonaldTrump) August 16, 2012", "Now that Obama’s poll numbers are in tailspin – watch for him to launch a strike in Libya or Iran. He is desperate.", "— Donald J. Trump (@realDonaldTrump) October 9, 2012", "Don't let Obama play the Iran card in order to start a war in order to get elected--be careful Republicans!", "— Donald J. Trump (@realDonaldTrump) October 22, 2012", "I predict that President Obama will at some point attack Iran in order to save face!", "— Donald J. Trump (@realDonaldTrump) September 16, 2013", "Remember what I previously said--Obama will someday attack Iran in order to show how tough he is.", "— Donald J. Trump (@realDonaldTrump) September 25, 2013", "Remember that I predicted a long time ago that President Obama will attack Iran because of his inability to negotiate properly-not skilled!", "— Donald J. Trump (@realDonaldTrump) November 11, 2013", "President Obama ended his two terms in office without initiating or ordering any military attack on Iran.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]