["A new TV ad by a liberal group uses Milwaukee County Sheriff David A. Clarke Jr.’s own words to suggest he’s encouraging gun violence by discouraging use of the 911 emergency response system.", "\"I don’t dial 911,\" Clarke says in a clip featured in the ad. \"I will afterwards, to say ‘Come get this dead guy out of my house, he’s bleeding out and he’s messing up my carpet.’\"", "The ad ends with another excerpt from that interview: \"Point that barrel (at) center mass and pull the trigger.\"", "At the top of the spot, a narrator says: \"Emergency responders. They risk their lives every day to help save ours. But Sheriff David Clarke says 911 is not our best option.\"", "Does the new ad, paid for by the union-backed Greater Wisconsin Committee, accurately reflect Clarke’s views?", "Specifically, has Clarke advised citizens to \"point that barrel center mass and pull the trigger\" because \"911 is not our best option?\"", "A familiar controversy", "Clarke faces Milwaukee Police lieutenant Chris Moews in the Democratic primary for sheriff on Aug. 12, 2014.", "The new ad resurrects a controversy that began in January 2013 when Clarke’s office paid for a radio announcement in which he said: \"With officers laid off and furloughed, simply calling 911 and waiting is no longer your best option. You can beg for mercy from a violent criminal, hide under the bed, or you can fight back. But are you prepared?\"", "That prompted a Milwaukee Journal Sentinel story with this online headline: \"Sheriff David Clarke’s radio ad says 911 not best option, urges residents to take firearms classes.\"", "After Clarke’s radio spot, Milwaukee Mayor Tom Barrett criticized him, saying if there’s an emergency, \"I want people to call 911\" but Sheriff Clarke is \"discouraging people from calling 911, it’s just wrong.\"", "About six weeks later, Clarke sat for a long interview with Project Veritas, a conservative group. that posted it online. The snippets of Clarke speaking in the Greater Wisconsin ad are from this interview.", "In that interview, Clarke said that Barrett had \"contorted\" the message in his radio spot by suggesting that he was advising that nobody call 911.", "The sheriff explained that it’s up to individual citizens to decide for themselves what they will do when confronted with possible harm.", "At the same time, Clarke made it clear not only what he personally would do, but what he would advise as the best course of action for citizens.", "He spoke in the context of potentially immediate danger, an example being an intruder breaking into your home.", "Twice he said the \"advice\" he would give people was based on what he himself would do:", "\"Use cover, because you don’t know if that clown trying to break into your house is armed. Know who and what your target is. Point that barrel center mass and pull the trigger.\"", "He does not mention calling 911 in that sequence.", "Then he concludes: \"You see, the thing is 911 in that situation is not going to help you and that’s why I said it’s not your best option.\"", "So the ad, notably, gets the \"not your best option\" context right.", "The other Clarke quote in the Greater Wisconsin Committee ad is from a section of the Project Veritas interview in which Clarke talks more about what he personally would do in that situation.", "Clarke tells the interviewer that a sign hangs on his own home picturing the head of a Rottweiler and a semiautomatic handgun with the message: \"We don’t dial 911.\"", "\"I don’t call 911,\" Clarke explained. \"I will afterwards, to say ‘Come get this dead guy out of my house, he’s bleeding out and he’s messing up my carpet. And that’s not to sound, you know … that’s just the reality. I’m not going to fool around with that. But that’s the mindset I have but I’ve been a cop for 35 years, so I live with that every day and it becomes second nature...\"", "The sheriff, at that point in the interview, shifts back to what he’d like law abiding residents to consider doing. Government shouldn’t tell them what to do, he said.", "\"I trust them to make those decisions as to what to do,\" Clarke said. \"If they want to blow a whistle, fine, I don’t tell them not to.\"", "But he made clear that he feels the best option is not waiting around for the police, or hiding under the bed, or running away.", "\"I don’t think that’s going to be very effective in some of these situations,\" Clarke said. \"So I want people to think about what’s going to be effective. If you want to run out of your house, fine, I’m not running out of my house unless it’s on fire. That’s my house, and I’m not running from it to give the bad guy carte blanche.\"", "Ad vs. reality", "So how does the Greater Wisconsin ad compare to Clarke’s statements?", "The ad, despite the length limitations, gets Clarke’s message right and places it in the context -- using Clarke’s own words -- of a home invasion situation.", "Neither Clarke nor the ad is saying the sheriff suggests that calling 911 is never a good idea. (Clarke, in the interview, at one point seems to suggest he wants average citizens to call 911 if they can -- but then take matters into their own hands rather than wait for police to arrive).", "The other Clarke quote in the ad -- \"point the barrel center mass and pull the trigger\" -- is in fact Clarke’s advice to citizens. He says a 911 call isn’t  always possible and by itself isn’t effective because of long wait times for police.", "When we asked Clarke to respond to the ad, he said he stands behind what he said to Project Veritas and did not intend to watch the Greater Wisconsin ad.", "Clarke said he suspected the ad twisted his remarks, but he couldn’t recall the specific context of his comments in the interview cited in the ad, and he offered no specific criticisms.", "\"My position is clear,\" Clarke said.", "Our rating", "A Greater Wisconsin Committee ad said Sheriff David Clarke advised citizens to \"point that barrel center mass and pull the trigger\" because \"911 is not our best option.\"", "Clarke did just that in an interview, and made similar comments in an earlier radio spot and in comments to PolitiFact Wisconsin.", "We rate the claim True.", "Greater Wisconsin Committee, TV ad, Aug. 5, 2004", "Interview with Milwaukee County Sheriff David A. Clarke Jr., Aug. 5, 2014", "Project Veritas, video of interview with Milwaukee County Sheriff David A. Clarke Jr., March 11, 2013", "Milwaukee Journal Sentinel, \"Clarke’s provocative rhetoric keeps people guessing,\" April 2, 2013", "Milwaukee Journal Sentinel, \"Sheriff David Clarke’s radio ad says 911 not best option, urges residents to take firearms classes,\" Jan. 25, 2013", "Milwaukee County Sheriff David A. Clarke Jr., radio announcement on 911, published on YouTube, Jan. 26, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]