["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Democratic presidential candidates former Maryland Gov. Martin O'Malley, left, and former Rhode Island Gov. Lincoln Chafee. AP Photo/John Locher", "It was the grandest of stages for a former Warwick mayor turned U.S. senator, turned Rhode Island governor, turned presidential candidate.", "Rhode Island’s Lincoln Chafee was in a nationally televised debate Tuesday night with a chance to shine against just four rivals.", "Chafee set out to distinguish himself in his opening statement, making a number of claims we’ve heard before as well as this boast:", "\"I’m very proud that over my almost 30 years of public service, I have had no scandals,\" Chafee said.", "No scandals? Nothing in almost three decades? A bold claim, especially for a Rhode Island politician.", "It’s true Chafee has never been charged, indicted, convicted or imprisoned. During those 30 years, one governor, the mayor of Providence and a gaggle of others have gone to prison.", "But scandal isn’t strictly a legal term. According to the dictionary, a scandal is a public disgrace. We kept that in mind as we reviewed Chafee’s 30 years of public service.", "One story jumped out at us. A controversy about the purchase of frogs — yes frogs for the mayor’s aquarium — as well as toboggans, theater tickets, flowers and other items totalling thousands of dollars a year.", "Chafee’s office bought the four frogs, which cost $1.99 each in 1997, and the rest of the stuff with taxpayers’ money from a discretionary account for the Warwick mayor’s office.", "The story blew up in 2000 as Chafee ran to keep his U.S. Senate seat. Chafee said other mayors had used the same account. But, he said, he was the first mayor to keep records on expenses.", "Unimpressed, Chafee’s critics charged he had inappropriately spent taxpayer money. One, mayoral candidate, Michael Woods, the 43-year-old brother of actor James Woods, called for a state police investigation.", "The Journal’s archives include two chapters in Chafee’s life that are more personal.", "For some politicians, college escapades involving cocaine or other narcotics, are fodder for scandal, especially when it’s something that’s concealed initially.", "Chafee’s experience with cocaine was still under wraps in the late ’90s and when the much anticipated questions finally came, he took pride in his transparent response. He immediately admitted his use of cocaine. And moved on with his career.", "As governor, there was another controversy surrounding the state’s handling of an underage drinking party thrown by Chafee’s 18-year-old son Caleb Chafee on the family’s Exeter property in 2012.", "The younger Chafee pleaded no contest to a criminal charge of violating the social host law; the state police never released the records on their investigation of the governor’s son. Some suggested that this raised questions about the possibility that there was something to hide.", "As governor, Chafee made an appointment in the final days of his administration that critics saw as a violation of the state’s revolving-door law.", "Chafee nominated a top aide and political ally, Richard Licht, for a state judgeship. The state ethics commission allowed the nomination, but critics argued the law should have been applied to Licht, the state’s director of administration.", "Finally, in the first six months of the Raimondo administration, revelations about the management of the Department of Transportation and the Department of Children, Youth and Families have raised questions about conduct in those departments under Chafee.", "Our ruling", "In his opening remarks Tuesday night Chafee said: \"I’m very proud that over my almost 30 years of public service, I have had no scandals.\"", "We’re not entirely sure what Chafee considers a scandal. We reached out to Chafee’s spokeswoman to get the candidate’s definition, but she said she would need more time to respond.", "The dictionary again says a scandal is a public disgrace. Over the past 30 years, Chafee has had his share of controversy, and an occasional brush with scandal.", "But scandal, a full blown public disgrace? Probably not.", "After all, in the broader scheme of things, is it disgraceful to buy four frogs for $7.96 to amuse visitors to the mayor’s office?", "We rate this claim Mostly True.", "CNN.com, \"Lincoln Chafee: I have had no scandals,\" Oct. 13, 2015, accessed Oct. 14, 2015", "Providence Journal, \"Sen. Chafee criticized over mayor’s account,\" Oct. 14, 2000", "Providence Journal,\"Chafee’s plan for drug query: ‘Just answer it,’\" Aug. 24, 1999", "ProvidenceJournal.com, \"Inside Chafee World,\" May 18, 2015, accessed Oct. 14, 2015", "ProvidenceJournal.com, \"Ex-DCYF director lived well on grant funds, audit shows,\" Oct. 11, 2015, accessed Oct. 14, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]