["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Does a Georgia congressman approve of the sale of sexually deviant videos?\n\nDemocrat Russell Edwards leveled the attack on his website against U.S. Rep. Paul Broun, a Republican from Athens and his opponent in the Nov. 2 election. Edwards' claim is based on Broun's vote against a resolution to prohibit the sale of \"crush videos.\" The videos typically show women wearing high heels stomping on kittens, rabbits or rodents. For some, it is a sexual fetish. To most, it's animal cruelty.\n\n\"Paul Broun Jr. sides with sexual deviants to support sale of 'crush videos,' \" Edwards said.\n\nThe resolution passed 416-3. Broun, a former physician, voted against the resolution, along with Reps. Tom Graves, R-Ga., and Ron Paul, R-Texas. \n\nThe accusation is an eye-opener, so we decided to check it out. Is Edwards right about the congressman?\n\nNo, said Broun, who called the videos \"morally reprehensible.\"", "Bob Barr a former congressman and U.S. attorney from Georgia, agreed that federal officials have advantages over state officials in investigating and prosecuting \"crush video\" type cases. He cited the investigative tools of the FBI and statutes to prosecute mail and wire fraud, which carry longer prison sentences.\n\nStill, Barr is not a supporter of HR 5566 and cited many of the same reasons cited by Broun. Barr, then a Republican House member, voted against the 1999 law. And Supreme Court Justice Samuel Alito noted in his dissent to the April ruling that \"the videos record the commission of violent criminal acts,\" alluding to state animal cruelty laws.\n\nTo say a congressman sides with \"sexual deviants\" is a hefty claim. Broun did vote against the resolution, but he articulated reasons that fall well within his political ideals and record. Whether those reasons trump pragmatic concerns about how best to crack down on distribution of the videos is another question. We had a problem with Edwards saying that Broun \"supports\" the sale of the videos, particularly since Broun condemned them. Voting against the resolution on constitutional grounds is not the same as supporting the sale of deviant material. We rate Edwards' statement about Broun's vote on HR 5566 as False.", "Associated Press, \"Republicans hot, cold on Constitution,\" Aug. 23, 2010\n\nAtlanta Journal-Constitution, The Barr Code, \"Crush video vote in Congress shows silliness runs deep\"\n\nAtlanta Journal-Constitution, \"Lawmaker sorry about Obama slam,\" Nov. 12, 2008\n\nE-mail from Bob Barr, Aug. 25, 2010\n\nGeorgia Politico, \"GA Rep Paul Broun Jr. wants to repeal 16th and 17th amendment,\" July 8, 2010\n\nPaul Broun statement e-mailed to PolitiFact Georgia, Aug. 24, 2010\n\nRussell Edwards for Congress statement, July 22, 2010\n\nTelephone interview with Russell Edwards, Aug. 25, 2010\n\nTelephone interview with Humane Society of the United States official Michael Markarian, Aug. 24, 2010", "Telephone interview with Jason Pye, Aug. 26, 2010\n\nWashington Post, \"Supreme Court overturns anti-animal cruelty law in First Amendment case,\" April 21, 2010\n\nWashington Post, \"Congress should quickly counter court's animal abuse ruling,\" April 25 2010", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]