["About this rating", "The government has provided relief funds to hospitals dealing with COVID-19 cases. Medicare is paying hospital fees for some COVID-19 cases, but the program does not have a one-size-fits-all policy for covering COVID-19 cases.", "No evidence exists that the CDC claimed hospitals are inflating the coronavirus case numbers in order to get government money.", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "As hospitals continued to be overwhelmed in 2020 by a surge in COVID-19 cases across the United States, false information surrounding the management of the disease and patients continued to circulate.", "One post in particular, shared on our Facebook group, Snopes Tips, claimed that the Centers for Disease Control and Prevention (CDC) released a statement alleging that \"anyone who walks into the hospital is counted as a Covid case, no matter why they come to the hospital,” as the government pays the hospital extra money.", "There are two parts to this claim: Firstly, that hospitals are inflating their COVID-19 numbers, and secondly, that the government is allocating more funds based on coronavirus cases.", "Snopes covered the second part of the claim back in April. We learned that it was possible that Medicare was paying hospital fees for some COVID-19 cases, but Medicare stated that it does not make standard, one-size-fits-all payments to hospitals for patients admitted with COVID-19 diagnoses and placed on ventilators.", "The CDC highlighted in a statement how the Coronavirus Aid, Relief and Economic Security Act (CARES), the Paycheck Protection Program, and Health Care Enhancement Act provided $175 billion in relief funds to hospitals and healthcare providers on the front lines of the coronavirus response:", "In the first round of the High Impact Allocation, $12 billion was distributed to nearly 400 hospitals who provided inpatient care for 100 or more COVID-19 patients through April 10, 2020. $2 billion of these payments was distributed to these hospitals based on their Medicare disproportionate share and uncompensated care payments. In the second round of funding, $10 billion will be distributed to hospitals having over 161 COVID-19 admissions between January 1 and June 10, 2020.", "For the first part of the claim, we looked through CDC statements and reports about people admitted to hospitals around the country and were unable to find a case where the CDC said that the hospital was inflating its COVID-19 case numbers in order to get more money. We reached out to the CDC, and the agency referred us to the Department of Health and Human Services (HHS), but did not confirm whether it had ever made such a statement about hospitals counting everyone who enters as a COVID-19 case.", "U.S. President Donald Trump promoted another version of this conspiracy theory at a rally in October, where he said hospitals were inflating the numbers of COVID-19 deaths, and was roundly debunked by news outlets and rejected in a statement by the American College of Emergency Physicians.", "To imply that emergency physicians would inflate the number of deaths from this pandemic to gain financially is offensive, especially as many are actually under unprecedented financial strain as they continue to bear the brunt of COVID-19. These baseless claims not only do a disservice to our health care heroes but promulgate the dangerous wave of misinformation which continues to hinder our nation’s efforts to get the pandemic under control and allow our nation to return to normalcy.", "The dire situation in hospitals paints a very different picture, far-removed from claims that they are profiting financially from the pandemic. A New York Times report from Nov. 27, 2020, highlighted how surging coronavirus numbers were resulting in a crisis-level shortage of beds and staff around the country. In some cases, hospitals were facing shortages in protective equipment, forcing healthcare workers to buy their own. As of Dec. 3, 2020, hospitalizations from the virus topped 100,000 — an all-time high since the pandemic began.", "An April Washington Post report described how hospitals were also suffering from financial losses on account of their deferring or cancelling non-urgent surgeries to free up bed space for the pandemic, cutting off income, and forcing them to lay off workers. At the time, relief packages for hospitals were widely described as insufficient.", "Hospital-reported data on COVID-19 patients have addressed a range of issues around the country. A July 2020 ProPublica report detailed how the Trump administration had told hospitals to stop reporting data to the CDC and instead report it to HHS. The move resulted in widespread confusion. While the number of infected patients was soaring nationally, for a period of time it was unclear how many were being treated in hospitals for COVID-19. A few states like Idaho and South Carolina experienced temporary information blackouts, and the COVID Tracking Project reported issues with its figures.", "A Nov. 29, 2020, investigation by the American Association for the Advancement of Science’s (AAAS) magazine found the federal system for tracking COVID-19 patients was continuing to carry questionable data. HHS collected hospital patient data in two ways — through HHS Protect, and the Office of the Assistant Secretary for Preparedness and Response (ASPR). Their two sources of data on the usage of Intensive Care Unit (ICU) beds for COVID patients conflicted sharply in at least six states. HHS data also diverged sharply from state-supplied data, and showed that over the last two months, COVID-19 in-patient tally in 14 states was consistently lower than HHS Protect’s.", "In at least 27 states, the tally was alternating between being lower and higher than HHS. And recently, in 16 states, the tallies grew closer. The over-arching conclusion for this analysis was that hospitals are going to be over-stressed in the upcoming months, with inaccurate information systems in place.", "We have reached out to the HHS to learn more, and will update this post with more information.", "Additionally, if the language of the claim is taken at face value, CDC guidance for hospitals references providing “necessary in-person clinical services for conditions other than COVID-19 in the safest way possible, minimizing disease transmission to patients [...].” This leads to the conclusion that the CDC itself is not stating that hospitals are classifying everyone who walks in as a COVID-19 case.", "While it is true that the government did provide relief funds in various forms for COVID-19 cases to hospitals in need of aid, little evidence exists that numbers were being inflated by hospitals for this reason. We thus rate this claim as “Mostly False.”", "Nur Nasreen Ibrahim is a reporter with experience working in television, international news coverage, fact checking, and creative writing.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]