["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Fox News host Bill O'Reilly used this statistic to show that certain Central American immigrants are a drag on the country.", "The crisis at the border brought on by thousands of young people seeking entry, some with a parent and many without, has fueled an immigration debate that was already overheated.", "Fox News host Bill O’Reilly took the government’s ad hoc measures to stanch the influx and deal with those who are already here as proof of a broader problem with immigrants from Central America, particularly those from El Salvador, Guatemala and Honduras.", "\"Our welfare system is strained to the limit now, so is the public school system,\" O’Reilly said on his July 8, 2014, show The O’Reilly Factor. \"About 50 percent of them lack a high school education. And more than 50 percent of immigrants from those three countries use at least one major welfare program once they get here. So the Obama administration is allowing millions of people to come in without the skills to compete in the marketplace. That is creating an underclass.\"", "A reader asked us to dig into the claim that more than 50 percent of the people from El Salvador, Guatemala and Honduras use at least one welfare program.", "We asked O’Reilly’s show for the sources behind that statement and did not hear back. But a little before his program, the Center for Immigration Studies, a group that advocates for lower immigration levels, released a fact sheet with the numbers O’Reilly used.", "\"57 percent of households headed by immigrants from El Salvador use at least one major welfare program, as do 54 percent of Honduran households, and 49 percent of Guatemalan immigrant households. Among native households it is 24 percent,\" the fact sheet said.", "The publication relied on Census Bureau data, which counted \"welfare\" programs as including Temporary Assistance for Needy Families (TANF), food stamps (now called the Supplemental Nutrition Assistance Program or SNAP), Medicaid, free and reduced school lunches, Supplemental Security Income (SSI is for poor elderly, blind or disabled people), housing aid, and the Women, Infant and Children (WIC) food assistance program.", "We should note that several of those welfare-type programs are not available to people living here without permission -- including food stamps, TANF, housing subsidies, non-emergency Medicaid and SSI. The fact sheet made no distinction in the legal status of immigrants, nor did O’Reilly.", "That aside, immigration researchers we reached said the statistics presented by the Center for Immigration Studies and repeated by O’Reilly are reasonably accurate.", "Giovanni Peri, a professor of economics at the University California-Davis, said, \"the Center for Immigration Studies probably did it correctly from Current Population Statistics data.\"", "Another economist, Marianne Bitler at the University of California-Irvine, agreed. \"My guess is that their analysis is accurate for the family units they describe,\" Bitler said.", "That said, there are a couple of caveats researchers said are worth mentioning.", "Bitler noted how programs that help children could cause an entire household to be included in the tally. The Census, Bitler said, \"measures whether anyone in the household is getting SNAP, but not whether all residents are getting it. Similarly, I imagine a lot of the Medicaid use they capture is by children.\"", "Leighton Ku, a professor of health policy at George Washington University, gave an example of how this could play out.", "\"Suppose there is a family where the father is a Central American legal immigrant, a small business owner,\" Ku said. \"The wife is a U.S.-born citizen and their two children are U.S.-born citizens. One young child gets Medicaid or CHIP (health insurance for children), another gets school lunch and that is the only assistance they get. The whole household is now considered an ‘immigrant welfare user.’ \"", "The result: a higher percentage.", "Steven Camarota, the author of the Center for Immigration Studies fact sheet, defends his approach. \"It makes sense to calculate welfare by household because eligibility for most programs is based on household income,\" Camarota said.", "Another caveat: This difference in how people coming from El Salvador, Guatemala and Honduras use welfare programs depends on the specific program.", "Camarota himself noted in a 2012 study that immigrants use cash welfare programs -- TANF, SSI and state cash payments -- at about the same rate as people who were born here.", "\"Use of cash tends to be quite similar for immigrant and native households,\" Camarota wrote. \"If by ‘welfare’ one only means cash assistance programs, then immigrant use is roughly the same as that of natives.\" The numbers in that analysis showed 5.4 percent of U.S. natives received such aid, compared to 7.4 percent of Guatemalans, 5.3 percent of Hondurans and 5 percent of Salvadorans.", "The gap substantially widens, however, when you include food aid (which included food stamps and free-reduced school lunches) and health care.", "Our ruling", "O’Reilly said that more than 50 percent of immigrants from El Salvador, Guatemala and Honduras use at least one welfare program. That’s correct when looking at households and use a broad definition of \"welfare,\" experts told us. But looking at individuals would produce a different, lower percentage.", "Also, there is a wide disparity depending on what particular welfare program you’re looking at.", "The statement is accurate but needs additional information. We rate it Mostly True.", "Fox News, The O’Reilly Factor, July 8, 2014", "Center for Immigration Studies, Central American Immigrants in the U.S., July 2014", "Center for Immigration Studies, Immigrants in the United States, 2010: A Profile of America's Foreign-Born Population, August 2012", "U.S. Census Bureau, Public Use Microdata Sample, 2012", "Southern Education Foundation, A new majority: Low income students in the south and the nation, October, 2013", "Social Security Administration, Supplemental Security Income eligibility requirements", "Health and Human Services Department, Office of Family Assistance, Characteristics and Financial Circumstances of TANF Recipients, 2010", "Health and Human Services Department, Welfare indicators and risk factors", "Pew Research Center, Hispanic Poverty Rate Highest In New Supplemental Census Measure, Nov. 8, 2011", "Migration Policy Institute, Central American Immigrants in the United States, March 18, 2013", "Deborah Rho, Immigrant Earnings Assimilation: The role of the firm, Nov. 21, 2013", "Cato Institute, Poor Immigrants Use Public Benefits at a Lower Rate than Poor Native-Born Citizens, March 4, 2013", "Homeland Security Department, Office of Immigrant Statistics, Estimates of the Unauthorized Immigrant Population Residing in the United States: January 2012, April 2014", "Migration Policy Institute, Mexican and Central American immigrants in the United States, June 2011", "PolitiFact, Facebook post says \"less than 2 percent of illegals are picking crops, but 41 percent are on welfare\", June 20, 2012", "Department of Health and Human Services, Summary of Immigrant Eligibility Restrictions Under Current Law, February 25, 2009", "Manhattan Institute, US Laws Keep Immigrants Off Welfare, July 1, 2014", "Social Security Administration, Research on Immigrant Earnings, 2008", "Harriet Orcutt Duleep, U.S. Immigration Policy at a Crossroads, Jan. 19, 2013", "National Center for Education Statistics, Digest of Education Statistics: Poverty status of all persons", "School Nutrition Association, School meal trends and stats, 2014", "Statisticbrain.com, Free and reduced lunch statistics, 2013", "Reason.com, Don’t Believe What You’ve Heard About Immigrants and Welfare, April 16, 2013", "Breitbart, REPORT: MORE THAN HALF OF CENTRAL AMERICAN IMMIGRANTS ON WELFARE, July 8, 2014", "Email interview, Steven Camarota, director of research, Center for Immigration Studies, July 11, 2014", "Email interview, Hilary Hoynes, professor of public policy and economics, University of California-Davis, July 11, 2014", "Email interview, Marianne Bitler, professor of economics, University of California-Irvine, July 11, 2014", "Email interview, Giovanni Peri , professor economics, University California-Davis, July 11, 2014", "Email interview, Ronald Angel, professor, Department of Soiciology, University of Texas - Austin, July 11, 2014", "Interview, Leighton Ku, professor, Deptartment of Health Policy, George Washington University, July 14, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]