["A two-minute-long clip of a man claiming to be Maharashtra MLA Aaditya Thackeray has been going viral on social media platforms. In the video, the individual confesses to murdering Bollywood actor Sushant Singh Rajput. He also states that he was responsible for the demolition of actress Kangana Ranaut’s office in Mumbai. A Facebook page called ‘Ram Rajya Sarkar’ had posted the clip on October 2 where their Hindi caption stated, “This is Sushant’s real killer who just admitted to the murder. Share this widely so that it is broadcasted on Republic TV tomorrow and everyone can know the truth.” The video had racked up 1.2 million views and had been shared 32,000 times at the time of writing. (archived link to the post)", "यह है सुशांत सिंह का असली कातिल जिसने यह कबुला है कि मैने ही मरा है सुशांत सिंह को.👇👇", "सभी ग्रुप में डाल दो कल तक रिपब्लिक भारत पर दिखाई देगा और इसकी असलियत सबको दिखाई देगी…", "Posted by राम राज्य सरकार on Friday, 2 October 2020", "Facebook user Sheetal Kashyap also posted the clip with the accompanying claim. (archive link)", "यह है सुशांत सिंह का असली कातिल जिसने यह कबुला है कि मैने ही मरा है सुशांत सिंह को👇", "यह है सुशांत सिंह का असली कातिल जिसने यह कबुला है कि मैने ही मरा है सुशांत सिंह को.👇👇", "सभी ग्रुप में डाल दो कल तक रिपब्लिक भारत पर दिखाई देगा और इसकी असलियत सबको दिखाई देगी…", "Posted by Sheetal Kashyap on Thursday, 8 October 2020", "This video has since made its way to both Twitter and Facebook.", "It is not difficult to see that the man in the video does not resemble Thackeray in the slightest. This is established when we compare their faces side by side, as shown below. The man in the viral clip also has a visible neck tattoo, whereas the Maharashtra politician has no such markings on his body.", "Alt News was able to identify the man in the clip. He is Saahil Choudhary, a YouTuber and model from Faridabad, Haryana. According to an ABP News report dated September 30, 2020, Choudhary had posted this video to a Facebook page called ‘Justice for Humanity’. The YouTuber also goes by another name, Pradeep Mohinder Singh Chaudhary. Saahil alias Pradeep calls himself a journalist on social media and has made offensive comments against women in the past. After one of these incidents, a woman from Mumbai filed a complaint against him to the Cyber Cell on August 22.", "Furthermore, a report in Navbharat Times states, “Saahil had posted about 60 videos on YouTube in support of Sushant Singh Rajput since the death of the late actor. In many of these videos, he made several controversial comments against Maharashtra CM Uddhav Thackeray and his son Cabinet Minister Aaditya Thackeray. Following this, the Mumbai Police registered a case and arrested him from his home in Faridabad’s Sector 19 on Monday.” On September 29, Jagran also ran a story on Choudhary’s arrest.", "Choudhary had posted a string of speculative videos to his YouTube channel and Facebook page following Sushant Singh Rajput’s suicide. He made many serious allegations against Bollywood, the Mumbai Police and the Maharashtra government. These videos were removed following the complaints filed against him. However, some of the clips are still up on the Facebook page ‘Justice for Humanity’. There are quite a few videos still up on his Instagram account as well where he is seen blaming actress Rhea Chakraborty for Rajput’s death. On June 29, the YouTuber had posted a video on Instagram with the caption ‘Sushant Singh Rajput: Murder or suicide’ where he gave a ‘demo’ of Rajput’s suicide.", "‘Justice for Humanity’ had posted an additional video featuring Choudhary on October 5. In this clip, he is apologising for the false statements he made in his previous videos.", "हम समझ गए", "#sahilchaudhary #justiceforssr #justiceforhumanity #ssr #underpressure", "Posted by Justice For Humanity on Sunday, 4 October 2020", "Therefore, the viral video does not show Aaditya Thackeray confessing to late actor Sushant Singh Rajput’s ‘murder’. The man in the video posing as the Maharashtra MLA is a YouTuber and model named Saahil Choudhary.", "Donate Now", "Kinjal Parmar holds a Bachelor of Science in Microbiology. However, her keen interest in journalism, drove her to pursue journalism from the Indian Institute of Mass Communication. At Alt News since 2019, she focuses on authentication of information which includes visual verification, media misreports, examining mis/disinformation across social media. She is the lead video producer at Alt News and manages social media accounts for the organization.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]