["About this rating", "Keurig machines (and similar products) can become moldy if not regularly cleaned.", "The issue is not limited to Keurig, and cleaning the machine will generally resolve the problem.", "On 1 October 2014, an article (later aggregated to several other sources) titled \"Why I Kicked My Keurig to the Curb\" was published to the alternative health site Underground Health. In it, the author made a case against the use of Keurig coffee makers and their proprietary \"K-cup\" grounds packets for a number of reasons. Most compelling to many readers was a short segue into the issue of mold, bacteria, and algae growth in Keurig brewers.", "The author discussed several of her gripes with the Keurig system, questioning whether the cups were imbued with toxins, whether the coffee in K-cups was fresh, and (oddly) whether the matter of numb and tingly lips was linked with Keurig-brewed coffee. However, of all complaints listed, the one about Keurigs and mold was of the greatest concern to readers.", "According to the author, part of the specific issue with Keurigs and mold related to the impossibility of cleaning those machines:", "Keurig.com states, \"Once your Keurig home brewer has been primed, you cannot empty the water from the inside. The internal tank of the brewer cannot be drained.\"", "The rubber tubing and the internal tank of the Keurig cannot be drained. It is possible that bacteria and mold are happily living inside that hidden water tank where it is nice and dark and warm. Another mold-magnet is that black rubber ring on the bottom of the exterior water container. Look now! Is there green or black slime? ewwwww (biofilm!).", "Donna Duberg, M.A., M.S., an assistant professor of clinical laboratory science at Saint Louis University said, \"Bacteria forms a slick biofilm when grown in moist, dark places, and so do molds.\"", "No, your coffee bean's antibacterial action is not enough to kill these microbes that are floating through the system. Duberg said, \"There is research which shows that it is only about 50 percent effective in killing bacteria, such as Staphylococcus aureus and Streptococcus mutans, and molds.\"", "A number of things stand out in the quoted portion. First and foremost, it's not reasonable to believe a \"coffee bean's antibacterial action\" is sufficient to keep a daily personal use appliance clean and mold free. But as to the part about Keurigs being not drainable, Keurig.com offered the following instructions to clean the cold water reservoir:", "To access the Cold Water Reservoir, lift the lid. Remove the Water Level Guide and then clean inside the reservoir with a damp, non-abrasive lint-free cloth as necessary.", "Replace the Water Level Guide and lower the lid when finished.", "Directly beneath those instructions, Keurig listed information on how to empty the internal tank. Below that, the company explained how to de-scale the tank. As such, the assertion that Keurigs cannot be cleaned is faulty. It may be a hassle to thoroughly drain, descale, rinse, or otherwise perform Keurig maintenance, but not only can Keurig machines be cleaned, Keurig sells products specifically designed for that purpose.", "Even if Keurigs can be cleaned, are they exceptionally more risky than common coffee pot brewers or other similar systems? Consumer health and safety experts cited all coffee makers as mold hideouts in 2011:", "A 2011 study from NSF International found that about half of coffee makers (we're talking the classic, basket-and-carafe kind here) had yeast and mold growing in their reservoirs. About one in ten were home to coliform bacteria. On average, home coffee reservoirs also had higher germ counts than both bathroom door handles and toilet seats.", "And while the study tested only 22 households, germ specialist Kelly Reynolds said she doesn't doubt the results.", "\"(Coffee makers) are certainly a moist environment where mold and bacteria are known to grow in high numbers,\" said Reynolds, who studies household germs at the University of Arizona. \"Our bodies can deal with them, but at some point they'll grow to levels high enough to cause sickness.\"", "Across the web, reports of mold, algae, and other water-based bacterial risks remain rampant. Brita water pitchers are a frequently-cited culprit, along with both classic style and single-cup brewing systems like the Keurig.", "A 2013 article on mold in coffee makers explained coffee cups, not coffee pots, may pose a larger risk:", "\"Germs are present in every corner of our lives,\" says Donna Duberg, M.A., M.S., an assistant professor of clinical laboratory science at Saint Louis University. \"Are there germs in our coffee makers? Yes. Will they make us sick? Maybe, if there are enough of them, and especially if we don't clean our pots often enough.\"", "It's not just the coffee pots that accumulate these germs, either. \"Bacteria forms a slick biofilm when grown in moist, dark places, and so do molds,\" says Duberg, pointing to the coffee maker's water reservoir and piping system as ideal areas for accumulation. \"If there is obvious slimy stuff in the coffee maker ... this is a good sign there is something growing.\"", "\"Coffee mugs are usually [the] worst,\" adds microbiologist Dr. Charles Gerba. \"In our studies, half had fecal bacteria in them. People probably contaminate them when they wipe them out with sponges or cleaning cloths.\"", "Some Keurig owners have experienced issues with mold, bacteria, and algae. But the problem is not exclusive to Keurig; and similar products (particularly those that hold water or wet grounds) have caused similar problems. While Keurigs do have a water reservoir and it can become dirty, they should be regularly cleaned like any other household item.", "Nothing about Keurigs or any other food or beverage device makes them immune from day-to-day grime-collecting, and anything that dispenses consumable food or drink should be regularly examined for signs of grubbiness. Mold growth is not exclusive to the Keurig; and while the water reservoir is a larger cleaning chore, checking regularly will lessen mold and bacteria problems. As the quoted portion above suggested, visible mold in any coffeemaker is a strong signal it needs to be cleaned.", "Bartiromo, Michael   \"How Gross is Your Coffee Maker?\"\r\n    Fox News Magazine.   21 January 2013.", "Strutner, Suzy.   \"Your Coffee Maker Is Full of Mold. Here's How to Clean It.\"\r\n    Huffington Post.   29 September 2014.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]