["About this rating", "Among the most abused sources of data in the anti-vaccine blogosphere (outside of perhaps, retracted papers) are records regularly released  by the National Vaccine Injury Compensation Program (VICP), a federal claims court that settles cases of alleged vaccine injury. The court was established in 1986 as part of a compromise between vaccine producers, who did not want to shoulder the litigation risks of vaccine production, and the federal government, who needed a source of vaccines for national immunization programs. The VICP aims to “ensure an adequate supply of vaccines, stabilize vaccine costs, and establish and maintain an accessible and efficient forum for individuals found to be injured by certain vaccines:", "The National Childhood Vaccine Injury Act of 1986 ... created the National Vaccine Injury Compensation Program (VICP), a no-fault alternative to the traditional tort system. It provides compensation to people found to be injured by certain vaccines. Even in cases in which such a finding is not made, petitioners may receive compensation through a settlement. The VICP was established after lawsuits against vaccine manufacturers and healthcare providers threatened to cause vaccine shortages and reduce vaccination rates. The Program began accepting petitions (also called claims) in 1988.", "This court frequently settles cases through compensation, but that compensation is rarely issued as part of findings that scientifically or medically tie a vaccine to an alleged injury. “Almost 75 percent of all compensation awarded by the VICP comes as result of negotiated settlements between the parties in which HHS has not concluded, based upon review of the evidence, that the alleged vaccine(s) caused the alleged injury,” according to the most recent report by the Department of Health and Human Services (HHS).", "Still, anti-vaccine websites regularly and frequently highlight cases from the VICP in which the government has awarded compensation as purported evidence that vaccines caused the conditions for which damages were awarded -- often citing only the vaccine-injury lawyers who received a cut of the money awarded by the courts in those cases. A common example of this phenomenon can be found in a post from the conspiracy-minded “Health Impact News” website that is at least five years out of date but continues to be shared as if it were a breaking news story: “Flu Vaccine is the most Dangerous Vaccine in the U. S. based on Settled Cases for Injuries.”", "That post highlighted raw VICP data from the final quarter of 2013 without performing any mathematical analysis on, or providing any attempt at context for, that data:", "The last report issued in 2013 by the Department of Justice (Vaccine Court), for compensation made by the Health and Human Services for people injured or killed by vaccines, was released in December 2013, covering the period of 8/16/2013 through 11/15/2013 ... There were 139 claims settled during this time period, with 70 of them being compensated. So, just over 50% of the claims filed for vaccine damages were compensated during this period.", "Once again, the greatest percentage of damages compensated were for the influenza vaccine, and most of those were for Guillain-Barré Syndrome (GBS) ... Of the 70 cases compensated, 42 of them were for the flu vaccine, or 60% of the cases settled where compensation was awarded for injury or death due to the vaccine.", "Despite the fact that this post uses only three months of data collected several years ago, it continues to be re-shared and reused by clickbait factories. On 11 December 2018, for example, the website “NWO Report” used the same statistics described above for their post headlined “Dept. of Justice Admits Flu Shot Is Most Dangerous Vaccine in US”. In fact, the Department of Justice, who oversee the VICP, never “admitted” such a thing, nor do the data support such a statement.", "In our view, it makes more sense to look at the totality of influenza vaccinations before the vaccine court, not a randomly selected three month period from 2013. The most recent data, provided by HHS on 30 November 2018, covers all doses of vaccines administered from 2006 to 2016, along with the number of claims filed and awarded by VICP. Reviewing these data (which we have organized in this document), we find that it is true that the greatest number of cases in which compensation was awarded involved the influenza vaccine. What is not mentioned in anti-vaccine posts is that significantly more flu shots (1.2 billion doses more than the next most commonly administered vaccine) were administered during this time period than any other type of vaccine.", "This context demonstrates why raw data are not terribly meaningful for this sort of exercise (and are of limited use in the first place, since awards of compensation in VICP are based on legal findings and not medical or scientific ones) -- it should be no surprise that the vaccine most commonly administered results in the greatest number of filed claims. A better way to compare these data would be to divide the number of successful claims per vaccine by the number of doses of that vaccine given over the same time period. Such an approach puts the influenza vaccine below several other shots in terms of successful claims awarded per dose:", "Doses", "Successful claims", "Claims per million doses", "Tetanus", "3,836,052", "47", "12.3", "DT", "794,777", "6", "7.5", "Measles", "135,660", "1", "7.4", "Rubella", "422,548", "2", "4.7", "DTaP-HIB", "1,135,474", "3", "2.6", "Influenza", "1,372,400,000", "2,524", "1.8", "Both because the DOJ never asserted that these data were meant to determine the “most dangerous” vaccine, and because the data released by VICP do not support the notion that the influenza vaccine is actually the \"most dangerous\" vaccine, the claim that the DOJ “admitted” to such is rhetorically as well as empirically false.", "The Health Impact News article went on to assert that the reason for this (imagined) increased risk in flu vaccinations stemmed from a link between Guillain-Barré syndrome (GBS) and the flu shot. Because GBS is thought to be caused by an overzealous immune response, and because the influenza vaccine provokes an immune response, a causal connection between flu vaccines and GBS is often asserted in vaccine courts and on blogs. Significant scientific work has been undertaken with an eye towards understanding possible links between GBS and vaccines. While a slightly increased risk of contracting GBS may stem from flu shots, a significantly higher risk of contracting GBS stems from actually contracting the flu, according to a 2013 paper published in the Lancet:", "The relative and attributable risks of Guillain-Barré syndrome after seasonal influenza vaccination are lower than those after influenza illness. Patients considering immunisation should be fully informed of the risks of Guillain-Barré syndrome from both influenza vaccines and influenza illness.", "Waldman, Meredith.   \"Vaccines on Trial: U.S. Court Separates Fact from Fiction.”\r\n    Science.   27 April 2017.", "U.S. Health Resources and Services Administration.   \"Vaccine Injury Compensation Data.\"\r\n    Accessed 17 December 2018.", "Health Impact News.   \"Flu Vaccine Is the most Dangerous Vaccine in the U.S. Based on Settled Cases for Injuries.\"\r\n    Accessed 17 December 2018.", "NWO Report.   \"Dept. of Justice Admits Flu Shot Is Most Dangerous Vaccine in US.\"\r\n    11 December 2018.", "Vellozzi, Claudia et al.   \"Guillain-Barré Syndrome, Influenza, and Influenza Vaccination: The Epidemiologic Evidence.”\r\n    Clinical Infectious Disease.   9 January 2014.", "Kwong, Jeffery C. et al.   \"Risk of Guillain-Barré Syndrome After Seasonal Influenza Vaccination and Influenza Health-Care Encounters: A Self-controlled Study.”\r\n    The Lancet Infectious Diseases.   28 June 2013.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]