["One of the videos, published on YouTube on February 1, 2021, has been viewed more than 120,000 times.", "The footage shows various images of crumbled buildings and emergency workers carrying stretchers.", "The video is titled: “The 6.4 magnitude earthquake in Shanghai, China left more than 700 casualties | Earthquakes in China”.", "“The number of people killed in the 6.4 magnitude earthquake that occurred on January 31 in many cities of Shanghai increased to 231 and 502 people were injured,” the description reads. “Currently, there are still 421 people being treated and monitored at the hospital.”", "A male voice narrating the video can be heard repeating these sentences.", "Very similar videos have been shared on YouTube in recent days, including here, here and here.", "The links to these videos were shared in multiple posts on Facebook and Twitter alongside a similar claim.", "The claim, however, is false.", "A keyword search on Google found that there were no earthquakes reported in Shanghai in January 2021.", "Earthquake tracking websites also show there were no significant quakes in Shanghai during that month.", "A search on the website of the China Earthquake Administration shows there is no record of any earthquake reported in Shanghai in January 2021. The screenshot below taken on February 10, 2021 shows a blank column on the right where the search results for a city or province's earthquake records would otherwise be displayed.", "Below is a screenshot, taken on February 9, 2021, of a search for earthquakes in Shanghai in January 2021 from German-based website, VolcanoDiscovery here, while here is another search for the whole of China within the same period:", "According to VolcanoDiscovery, the largest quake close to China was in Mongolia on January 12, 2021, at a magnitude of 6.7.", "Below is a screenshot of earthquakes in the 30 days leading up to February 9, 2021 from the United States Geological Survey (USGS) website here, which tracks global earthquake activities. There is no marker near Shanghai:", "Below is a screenshot, taken on February 5, 2021, of the real-time interactive earthquake map from the Berkeley Seismology Lab at UC Berkeley in California. There is no marker in Shanghai:", "Reverse image search of the keyframes from the misleading YouTube video, using digital verification tool InVid WeVerify, found the images in the videos came from multiple different sources depicting different disasters from the past in China and elsewhere.", "First image", "A picture of emergency workers clad in orange suits entering a crumbled building was in fact taken in 2017 in the southwestern Chinese province of Sichuan, around 2,000 kilometres (1,200 miles) from Shanghai.", "A reverse image search on Google found it published here by Vietnamese state-run newspaper Vinh Long and credited to the Vietnam News Agency (TTXVN). Its caption, translated from Vietnamese, states: “Rescuers on duty at a building collapsed due to the Sichuan earthquake on August 9, 2017.”", "Twenty-four people were killed and thousands evacuated after a 6.5-magnitude quake struck Jiuzhaigou, a popular tourist destination with a national park, mountains and lakes that has been recognised as a UNESCO World Heritage site.", "Below is a screenshot comparison of the first photo in the misleading slideshow video (L) and the TTXVN photo (R):", "Second image", "Another image showing rescuers scouring among the rubble of a collapsed building was in fact taken in Ecuador in 2016.", "A reverse image search on Google found the image in the archives of Reuters news agency. The photo caption reads: “Rescue team members search for victims at a collapsed store and buildings at the village of Manta, after an earthquake struck off Ecuador's Pacific coast, April 21, 2016.”", "A 7.8-magnitude quake hit Ecuador's Pacific coast on April 16, 2016, leaving at least 660 people dead.", "Below is a screenshot comparison of the second photo in the misleading video (L) and the Reuters photo (R):", "Third image", "The image shows rescuers in yellow and orange helping a person in a brown jacket.", "A reverse image search on Google found the photo was used in a clip on the YouTube channel of Chinese-state run channel New China TV.", "The photo originates from a live broadcast on January 24, 2021. It is titled: “LIVE: Trapped miners rescued two weeks after blast in Shandong, China”. The image circulating in misleading social media posts is visible at the 57-minute 19-second mark.", "The rescue operation on January 24, 2021 saved 11 miners from the Hushan mine in Shandong province after a blast had trapped them hundreds of metres underground for two weeks. Ten miners died in the disaster, AFP reported.", "Below is a screenshot comparison of the third photo in the misleading video (L) and the New China TV video (R):", "Fourth image", "The image shows medical personnel assisting a man stood in front of a van.", "A reverse image search on Google found the photo here on the website of Chinese state-run media Xinhua Net, published on June 18, 2019. The image is credited to Wan Min and its caption reads: “Medical staff help wounded people at a local hospital in Changning County of Yibin City, southwest China's Sichuan Province, June 18, 2019. Two people were killed, one remains missing and another 19 were injured in Yibin City, after a 6.0-magnitude earthquake rattled Changning County of Yibin, at 10:55 p.m. Monday (Beijing Time), according to local authorities.”", "A 6.0-magnitude earthquake struck near Yibin, in Sichuan province on June 18, 2019, killing at least 13 people and injuring 199.", "Below is a screenshot comparison of the fourth photo in the misleading video (L) and the Xinhua Net photo (R):", "Fifth image", "The image shows a maintenance worker inspecting cracks in the road.", "A reverse image search on Google found the photo here on the archives of Japanese news agency Kyodo News, published on June 19, 2019. It is credited to Hironori Asakawa and its caption reads: “A city official inspects the damage of a road in Tsuruoka, Yamagata prefecture, northwestern Japan, Wednesday, June 19, 2019, after an earthquake.”", "The 6.4-magnitude earthquake on June 18, 2019 left at least 16 people injured and triggered a tsunami alert that was later lifted.", "Below is a screenshot comparison of the fifth photo in the misleading video (L) and the Kyodo News photo (R):", "Sixth image", "The image shows a woman standing among the ruins of a building.", "A reverse image search on Google traced the image to AFP’s photo archives, credited to Greg Baker. The caption reads: “A woman stands amid collapsed houses at Longtoushan, in China's southwest Yunnan province on August 5, 2014. Two days after a magnitude 6.1 tremor devastated the once-idyllic mountainside village of Longtoushan in southwest China's Yunnan province, at least 398 people have been confirmed dead, with 80,000 houses destroyed and 124,000 seriously damaged.”", "A 6.1-magnitude quake struck Longtoushan in China’s southwestern Yunnan province on August 3, 2014, killing at least 600 people and injuring more than 2,400 others.", "Below is a screenshot comparison of the sixth photo in the misleading video (L) and the AFP photo (R):", "Seventh image", "The image shows soldiers carrying a person on a stretcher.", "A reverse image search on Google found the photo here in a report by Reuters news agency. It is credited to Chinese state-run newspaper China Daily. Its caption reads: “Chinese paramilitary police carry a survivor after an earthquake in Jiuzhaigou county, Ngawa prefecture, Sichuan province, China August 8, 2017. Picture taken August 8, 2017.”", "A 6.5-magnitude quake devastated Jiuzhaigou in southwest China's Sichuan province on August 8, 2017, killing at least 24 and injuring hundreds of people.", "Below is a screenshot comparison of the seventh photo in the misleading slideshow video (L) and the China Daily photo (R):", "Eighth image", "The image shows a stretch of rubble, with buildings and mountains in the distance.", "A reverse image search on Google found it here by Reuters photographer Jason Lee. Its caption reads: “Ruins of a destroyed old city district and a landslide are seen in the earthquake-hit Beichuan county, Sichuan province, China, May 16, 2008.”", "The 8.0-magnitude earthquake that hit Sichuan on May 12, 2008 killed more than 68,000 people.", "Below is a screenshot comparison of the eighth photo in the misleading video (L) and the Reuters photo (R):", "Ninth image", "The image shows medical personnel wheeling an injured person into a waiting ambulance.", "A reverse image search on Google found it here in a Reuters report. Its caption reads: “Medical personnel transport a victim (C) at a hospital after an explosion at a factory in Kunshan, Jiangsu province on August 2, 2014.”", "A massive explosion at a car parts factory in Kunshan in the eastern province of Jiangsu near Shanghai on August 2, 2014 killed 75 people and left more than 180 injured.", "Below is a screenshot comparison of the ninth photo in the misleading slideshow video (L) and the Reuters photo (R):", "Tenth image", "The image shows medical personnel wheeling away an injured person into a waiting ambulance.", "A reverse image search on Google found it here in an UN Dispatch report. It is credited to the United Nations Development Programme (UNDP) and its caption reads: “Destruction in Port au Prince, Haiti, following the 2010 earthquake.”", "A devastating 7.0-magnitude earthquake in Haiti on January 12, 2010 left more than 200,000 people dead.", "Below is a screenshot comparison of the tenth photo in the misleading video (L) and the UNDP photo (R):", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]