["By Angelo Fichera", "Posted on July 19, 2018", "Q: Is it true that a 1-year-old child has never appeared as a defendant in immigration court — until this year?", "A: No. Unaccompanied children in the U.S. illegally, including those as young as 1, have previously appeared in court. Some children do not have attorneys.", "The Trump administration’s zero-tolerance policy for people illegally crossing the Southwest border, which resulted in the separation of families, brought much attention to the circumstances of young immigrant children. A recent Associated Press story, for example, documented the story of a 1-year-old baby from Honduras who faced a deportation hearing represented by a lawyer but without his father, who had brought him to the U.S.", "The issue has prompted several inquiries from our readers, many curious whether children are in fact appearing in immigration court without a parent, guardian or even legal representation.", "One reader asked whether it was true that “immigrant toddlers” were “ordered to appear in court alone.” Another reader questioned the accuracy of a popular meme on Facebook, which reads: “For the first time in the 242 year history of the United States of America, a one-year-old child appears in court as a defendant.”", "That meme is false. It has happened before.", "“Toddlers appearing in court without an attorney is nothing new, unfortunately,” Megan McKenna, senior director of communications and community engagement at Kids in Need of Defense, told us. The nonprofit group’s lawyers work to represent immigrant children in court.", "The law that created the current program for so-called “unaccompanied alien children” — minors who illegally entered the U.S. alone, or were separated from the adult who brought them — dates to 2002, when the Department of Homeland Security was established and the care and custody for these children was transferred from the former Immigration and Naturalization Service to the Department of Health and Human Services. The unaccompanied minors are housed in shelters — for 57 days, on average — unless or until they are released to a relative or sponsor as they await their immigration hearings.", "Such children facing deportation proceedings are not guaranteed a right to an attorney.", "And while pro-bono services often help fill that void, many children are left without counsel to effectively mount a defense against a government attorney arguing for deportation. Government data indicate that, of all cases from fiscal year 2005 through May 2018, half of juveniles in deportation proceedings were not represented by an attorney. For cases that began in fiscal year 2018 — which now includes all juveniles, not only those found to be “unaccompanied,” due to a reporting change — about 69 percent were not represented.", "Kids in Need of Defense reports that a child with an attorney is five times more likely to gain U.S. protection, such as asylum.", "When the children are babies or toddlers, the lawyers representing them typically work with the adults caring for the children during immigration proceedings to understand the reasons they came to the U.S., McKenna said. In addition to crossing the border alone, children that young may be deemed unaccompanied because they were brought by someone “other than a parent,” McKenna noted, such as a “smuggler or another relative.”", "“The very young kids who come without a parent or legal guardian, it’s often there’s some strong push factor in the home country that is driving this,” she added. “I don’t know of any parents who would want their 1- or 2-year-old, or any age, to make this journey … to the U.S. without someone very close to them.”", "In fiscal year 2016 — from Oct. 1, 2015, to Sept. 30, 2016 — there were 170 new cases for unaccompanied children in which the respondent was a 1-year-old, according to numbers provided to FactCheck.org by the U.S. Department of Justice’s Executive Office for Immigration Review. In fiscal year 2017, there were 172 cases. And, as of June 30, there were 104 such cases in fiscal year 2018.", "The total number of babies younger than age 1 — 70 so far in fiscal year 2018 — is up from the previous two years, according to the office and as Kaiser Health News first reported. That number was 24 in all of fiscal year 2017 and 46 in fiscal year 2016.", "We asked for a breakdown showing how many 1-year-old defendants over the three fiscal years have been without an attorney. Kathryn Mattingly, a spokeswoman for the Executive Office for Immigration Review, told us in an email that such a special request would take several weeks to process; we will inform readers when we obtain that information.", "“Records show that there are respondents in removal proceedings who are juveniles, some as young as one year old, who do not currently have any attorney of record on file,” she said. “Please note that this does not mean that these children will appear before an immigration judge alone or will be unrepresented during their proceedings. All immigration judges provide a list of pro bono legal service providers to respondents during the initial hearing and many of the respondents who are initially unrepresented obtain representation as removal proceedings progress.”", "Mattingly also said unaccompanied children could also have help from others — such as a guardian, sponsor or “friend of the court,” who helps “the respondent navigate courtroom procedures.”", "In the case of 1-year-old Johan from Honduras, highlighted by the Associated Press, the baby was in the custody of the Department of Health and Human Services — his father had already been deported — and an attorney with the nonprofit group The Florence Project represented the child.", "McKenna said immigration judges often issue continuances so that children without counsel can attempt to find it, but judges are not required to do so. She said advocates fear that increased pressure on judges to move expeditiously on these cases could result in fewer continuances.", "The number of unaccompanied immigrant children apprehended at the Southwest border by U.S. Customs and Border Protection fluctuates every year. In fiscal year 2014, that number spiked to 68,541 from 38,759 the year prior. It then dropped to 39,970 in fiscal year 2015, only to increase again to 59,692 the next fiscal year. Fiscal year 2017 logged 41,435 apprehensions.", "So far in fiscal year 2018, CBP reports, there have been 37,450 apprehensions of unaccompanied children as of June 30.", "“A 1-Year-Old Boy Had a Court Appearance Before an Immigration Judge in Phoenix.” Associated Press. 8 Jul 2018.", "“Attorney General Announces Zero-Tolerance Policy for Criminal Illegal Entry.” Press release, U.S. Department of Justice. 6 Apr 2018.", "Gore, D’Angelo. “Trump Blames Own Border Policy on Democrats.” FactCheck.org. 22 May 2018.", "Jewett, Christina and Shefali Luthra. “From Crib To Court: Trump Administration Summons Immigrant Infants.” Kaiser Health News. 18 Jul 2018.", "“Juveniles — Immigration Court Deportation Proceedings.” Syracuse University Transactional Records Access Clearinghouse. Accessed 16 Jul 2018.", "Mattingly, Kathryn. Spokeswoman, Executive Office for Immigration Review. Emails sent to FactCheck.org. 11-13 Jul 2018.", "McKenna, Megan. Senior director of communications and community engagement, Kids in Need of Defense. Phone interview with FactCheck.org. 13 Jul 2018.", "“Southwest Border Migration FY2017.” U.S. Customs and Border Protection. 15 Dec 2017.", "“Southwest Border Migration FY2018.” U.S. Customs and Border Protection. Accessed 16 Jul 2018.", "“United States Border Patrol Southwest Family Unit Subject and Unaccompanied Alien Children Apprehensions Fiscal Year 2016.” U.S. Customs and Border Protection. 18 Oct 2016.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]