["About this rating", "On 28 July 2017, the Christian satire web site Babylon Bee published an article appearing to claim that Elevation Church Pastor Steven Furtnick made a professional athletics-style deal to move to Lakewood Church alongside Joel Osteen:", "CHARLOTTE, NC—In a stunning move that is making waves throughout evangelicalism, Pastor Steven Furtick has announced he has come to an agreement with Lakewood Church to preach alongside Joel Osteen, forming the core of a “superstar preaching team.”", "The contract is worth $110 million over the next six years, Lakewood confirmed, making it the largest the preaching world has ever seen.", "Donning a Lakewood Church hat and suit, an emotional Furtick broke the news in a two-hour televised special on TBN Thursday night, dubbed “The Decision.”", "“I’m going to take my talents to Houston and join Joel’s legendary squad,” Furtick said as hundreds of cameras flashed around Elevation Church’s press conference room. “I wish Elevation the best of luck in the seasons to come, and hope they can find someone as ripped and godly as me.”", "The Babylon Bee is a satire site whose humor is intended for Christian readers with a footer that clearly reads:", "The Babylon Bee is Your Trusted Source For Christian News Satire.", "However, the claim's spread led Furtick to publish a video to Twitter explaining the joke:", "CONSIDER THE SOURCE pic.twitter.com/Jtuv8QoX8u", "— Steven Furtick (@stevenfurtick) July 30, 2017", "Although the Babylon Bee is open about its satirical nature, some jokes about nuanced aspects of Christian culture go over readers' heads. Articles suggesting incarcerated abortion provider Kermit Gosnell was a Democratic National Convention speaker, that Elevation Church acquired a baptismal waterslide, and Californians were required by law to register Bibles as assault weapons all caused confusion among social media users.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]