["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Donna Brazile, former interim chairwoman of the Democratic National Committee, has written a book about her time managing the party. (AP photo)", "The publication of former interim Democratic National Committee chair Donna Brazile’s book has revived conspiracy theories about the 2016 shooting death of Democratic National Committee staffer Seth Rich.", "A headline on the US Political website states, \"Donna Brazile knows Seth Rich was murdered by the Clintons.\" Facebook users flagged the post as being potentially fabricated, as part of the social network’s efforts to combat fake news. Our efforts to reach the writer were unsuccessful.", "\"Why would Brazile have to fear for her life after the Rich murder — if, as we’ve been told, it was simply a robbery gone bad?\" states the article. \"Does she suspect someone of the murder? Does she suspect the Clintons?\"", "We found nothing in Brazile’s recent book that pins the Rich murder on the Clintons.", "Near dawn on July 10, 2016, 27-year-old Rich was found with two fatal gunshot wounds near his home in Washington, D.C. Rich was had been working on voter access projects for the DNC.", "Weeks later, Rich’s death became intertwined with WikiLeaks after it released hacked emails from the DNC. WikiLeaks head Julian Assange suggested in a Dutch television interview that Rich might have been murdered.", "In \"Hacks: The Inside Story of the Break-ins and Breakdowns that Put Donald Trump in the White House,\" Brazile wrote about the grief and fears she felt in the aftermath of Rich’s murder, even closing the blinds in her office so a sniper couldn’t see her.", "Brazile wrote that she felt some responsibility for Rich’s death.", "\"I didn’t bring him into the DNC, but I helped keep him there working on voting rights,\" she wrote.", "She speculated about the motivation behind his shooting but wrote that police believed he was a victim of a robbery.", "\"With all I knew now about the Russians’ hacking, I could not help but wonder if they had played some part in his unsolved murder,\" she wrote, though stating that the FBI told her they didn’t see Russian fingerprints on the case. \"Besides that, racial tensions were high that summer and I worried that he was murdered for being white on the wrong side of town.\"", "She also wondered \"had he been killed by someone who had it out for the Democrats? Likely not, but we still didn’t know.\"", "Brazile dismissed the WikiLeaks conspiracy theory:", "\"Some Trump supporters were promoting the baseless conspiracy theory that Seth had been murdered by the DNC because he was the one who had leaked our emails to WikiLeaks.\"", "We attempted to contact Brazile through her website but did not get a reply.", "The headline on the US Political website states \"Donna Brazile knows Seth Rich was murdered by the Clintons.\" The article refers to Brazile’s book in which she speculates on the motivations behind the DNC staffer’s murder, but she doesn’t point the finger at the Clintons.", "We rate this headline Pants on Fire.", "US Political, \"Donna Brazile knows Seth Rich was murdered by the Clintons,\" Nov. 8, 2017", "Real Clear Politics, \"Donna Brazile: ‘I Hope To God We Find Out Who Murdered Seth Rich,’\" Nov. 9, 2017", "Google books, \"Hacks: The Inside Story of the Break-ins and Breakdowns that Put Donald Trump in the White House,\" Nov. 7, 2017", "L.A. Times, \"How Seth Rich’s death became an Internet conspiracy theory,\" May 24, 2017", "PolitiFact, \"Seth Rich: Separating fact and speculation,\" Aug. 7,  2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]