["About this rating", "In early September 2018, a number of salacious excerpts from reporter Bob Woodward's new book Fear, about President Trump and his administration, started making their way around social media. In one passage, for example, Woodward recounted a conversation in which the president supposedly called his Attorney General Jeff Sessions \"mentally retarded.\" In another, Woodward recalled an incident in which former chief economic adviser Gary Cohn maintained he had removed a document from Trump's desk to prevent the president from signing it.", "As these unnerving anecdotes were swallowed up by social media users, a number of pranksters took advantage of the situation to start spreading their own invented tales under the guise of presenting excerpts from Woodward's reporting. One of the most popular hoax passages involved President Trump, the Oval Office, and the ghosts of past presidents:", "SB Nation writer Grant Bisbee shared his own fake Woodward report which claimed that Defense Secretary Jim Mattis once stole the president's nose in order to distract him from starting a nuclear war:", "Brisbee later admitted that this passage was satire and sarcastically added that he was \"in no way concerned\" that many people thought the excerpt was believable.", "Comedian Stephen Colbert also published his own fake Woodward report. In Colbert's version, the president was recorded having a lengthy conversation about the logical flaws in the Pixar movie Cars:", "None of the aforementioned passages appeared in Bob Woodward's book Fear. We examined a variety of articles from credible news outlets about Woodward's new book and found no record of them.", "This also isn't the first time that we've seen this genre of prank. After the release of Michael Wolff’s book Fire and Fury: Inside the Trump White House, for instance, a fabricated excerpt claiming that President Trump spent the majority of his days watching \"The Gorilla Channel\" went viral.", "Herb, Jeremy.   \"Bob Woodward: Trump's Aides Stole Nis Papers 'To Protect the Country.'\"\r\n    CNN.   5 September 2018.", "Ward, Alex.   \"5 Stunning Trump Foreign Policy Moments from Bob Woodward’s New Book.\"\r\n    Vox.   4 September 2018.", "Breuninger, Kevin.   \"'This is Treason': Read the Most Dramatic Quotes from Bob Woodward's New Tell-All Book About Trump's White House.\"\r\n    CNBC.   4 September 2018.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]