["The video was published here on Twitter on June 24, 2020. It has been viewed more than 79,500 times.", "The 29-second clip shows a man throwing television screens and a computer console on the floor of a property.", "A watermark, “HUAIBEIREN.COM”, can be seen in the video’s bottom right-hand corner.", "The video’s simplified Chinese-language caption translates to English as: “A Tanzanian student studying at Beijing Language Institute smashed the TV while watching a game”.", "The same video was also uploaded here, here and here on Twitter, alongside a similar claim.", "The claim, however, is false.", "A keyword search found a longer version of the video published here on the Facebook page of US comedian Funny Mike, on June 14, 2019.", "The video caption reads: “Golden state pissed me off !!! Instagram @FunnyMike”.", "\"Golden state\" refers to the Golden State Warriors, a US professional basketball team. On June 13, 2019, one day before Funny Mike uploaded his video on Facebook, the Warriors were defeated by the Toronto Raptors in the 2019 NBA championship.", "The video in the misleading Twitter post can be seen from the Facebook video’s 27-second mark.", "Below is a screenshot comparison of the video in the misleading tweet (L) and the video on Funny Mike’s Facebook page (R):", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]