["About this rating", "\"There's a plot in this country to enslave every man, woman and child. Before I leave this high and noble office, I intend to expose this plot.\"", "Conspiracy theories have surrounded the death of President John F. Kennedy ever since he was assassinated in Dallas, Texas, on 22 November 1963.", "Central to nearly all those theories is the notion that Lee Harvey Oswald, who was judged to be a \"lone gunman\" by the Warren Commission, did not really act alone and in fact simply played the most visible role in a far-reaching conspiracy that may have included elements in the United States government itself.", "One bit of evidence regularly put forward in support of that notion is a statement Kennedy allegedly made seven days before he was killed. In it, he spoke of his intention to expose \"a plot to enslave every man, woman, and child\" in the country. The implication is that he was assassinated because the conspirators in that plot did not want it exposed.", "﻿", "Here is the statement in meme form, as shared on social media in 2018:", "But although variants of this quote have been making the Internet rounds for more than a decade, it does not appear in any of Kennedy's transcribed speeches or press conferences, nor in any books by or about the 35th president, nor in any academic or popular histories of the period. It doesn't even turn up in books devoted to JFK conspiracy theories published before the quote became commonplace on the Internet.", "The earliest example anyone has found to date appeared in the signature line of a message board user in a post dated 10 April 2004. That example featured slightly different wording from that of the later meme:", "\"There exists in this country a plot to enslave every man woman and child. Before I leave this high and noble office, I intend to expose this plot.\" - President John F. Kennedy -- 7 days before he was assassinated.", "We looked especially closely at the two speeches Kennedy gave on 15 November 1963, exactly seven days before his assassination, for anything resembling the statement \"There's a plot in this country to enslave every man, woman and child.\" The first, delivered at an AFL-CIO convention in New York, dwelt primarily on economic concerns and contained no mentions of a conspiracy to be quashed.", "The second, much shorter address he gave to the National Convention of the Catholic Youth Organization that day (also in New York City), made reference to an \"ideological gulf\" between democracy and its enemies (by which he presumably meant Communism), but again, Kennedy said nothing about a plot to enslave Americans.", "A search of our own message board archives uncovered an older, somewhat similar quote to \"\"There exists in this country a plot to enslave every man woman and child\" shared with Snopes.com a few weeks after the September 11 terrorist attacks in 2001:", "\"The high office of President has been used to foment a plot to destroy the American's freedom, and before I leave office I must inform the citizen of his plight.\" -- John F. Kennedy at Columbia University, 10 days before his assassination", "There is also this slight variation, still circulating as of November 2018:", "If such a statement were made 10 days before the assassination, that would date it to 12 November 1963. However, according to an archived JFK Library post written in 2006, Kennedy did not speak at Columbia University on that or any other date in November 1963:", "Many references to this fictitious speech exist in assassination theorist material. Supposedly, the President was discussing changes in the Federal Reserve and the gold standard, and this topic was somehow linked to his assassination. Others also claim he said, \"The high office of President has been used to foment a plot to destroy American freedom, and before I leave office I must inform the citizen of his plight.\" But the simple fact is that President John F. Kennedy did not speak at Columbia University in November of 1963.", "Those who believe in the \"fact\" of President Kennedy having made such a speech, either at Columbia or some other place, will simply deny this denial. At best, they will say that because \"all or most records\" have been destroyed, we simply don't know the truth; at worst, they will claim that there is a conspiracy to keep this issue silent. If someone chooses to believe in the existence of this speech, he or she does so as a matter of faith, which is fine, as long as that person realizes that it is religion and not history in which he or she is dealing.", "Conspiracy mongers often resort to the claim that evidence could have been covered up or purposely destroyed, but when the subject matter is an utterance of a President of the United States -- and especially one attended by controversy -- eradicating every trace of it from the historical record would be well-nigh impossible.", "Kennedy, John F.   \"Remarks in New York City at the AFL-CIO Convention.\"     The American Presidency Project.   15 November 2018.", "Kennedy, John F.   \"Remarks in New York City at the National Convention of the Catholic Youth Organization.\"     The American Presidency Project.   15 November 1963.", "West, Mick.   \"Debunked: There's a Plot in This Country to Enslave Every Man, Woman, and Child. JFK.\"     Metabunk.org.   2 December 2011.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]