["The video, which has been viewed more than 5,400 times and shared more than 460 times, was posted on Facebook on March 11, 2019 to a page entitled Gist String. The page has more than 5,000 followers.", "The accompanying caption says in English: “Moments before Ethiopia plane crash as seen by an eye witness. May they find rest and their families and friends find comfort. #Tragic #Africa #EthiopianAirLine #Nairobi #PlaneCrash #Kenya #Nigeria #Canada.”", "Below is a snapshot of the misleading post:", "The video has been viewed thousands more times on Facebook here, and here. It also received more than 2,600 views on Twitter here.", "Here is the AFP story about the Ethiopian Airlines crash on March 10, 2019.", "Here is a tweet from Ethiopian Airlines confirming the accident.", "A Google reverse image search for a screenshot of the footage reveals multiple results for a US cargo plane crash near Bagram airfield in Afghanistan on April 29, 2013.", "This is a video report on the Guardian website about the crash, published on May 1, 2013. In the clip, which shows a wider frame than the misleading clip shared on Facebook, a barbed wire fence can be seen on the right-hand side of the road.", "Here is a screenshot of the clip with the barbed wire fence circled in red:", "This is consistent with other photos of the airbase from media reports, such as this report by the Atlanta Journal-Constitution.", "Here is a screenshot of a photo of the air base by photographer Spencer Platt on the website for the Atlanta Journal-Constitution.", "Here is another report about the crash on the CNN website, dated May 2, 2013.", "Both reports indicated the footage was captured on a motorist’s dashcam, but did not provide the name of the motorist.", "Seven crew were killed in the crash, the BBC reported.", "Here is a link to the National Transportation Safety Board report on the crash, published on September 14, 2015.", "Commenting on the video, the report states: “A dashboard camera from a moving ground vehicle captured video images of the airplane after rotation that showed it in a steep climb with a high pitch attitude before it reached its highest point and entered a roll to the right. At the time of the airplane’s right roll, the camera captured audio similar to engine thrust noise. The images showed that the airplane then began a rapid descent as it rolled back to the left then struck the ground in a nose-down and nearly wings-level attitude”.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]