["“This is the actual results of the election. People in Germany saw this before Dominion servers were seized,” claims a Facebook post that has been shared 1,500 times since December 8, 2020. It has also been shared in German on Twitter.", "The map is attributed to the One America News Network (OAN), which has been consistently positive in its coverage of Trump and his administration, and shows 440 electoral votes for Trump and 128 for Biden.", "It appears to have aired in mid-November, and suggests that the Republican party candidate won most of the electoral votes, which is false. An accurate map of the results of the November 3 election shows that the Democrat candidate won, as seen here:", "All 50 states and the District of Columbia have certified their November presidential election results, and the Electoral College affirmed Biden’s win on December 14, 2020.", "State-by-state results of the Electoral College vote can be found here.", "The post also falsely claims that Dominion Voting servers were seized in Germany. AFP debunked this claim here, with German authorities, the company and the US Army denying that any such operation took place.", "Dominion Voting, which specializes in election technology and was used in multiple states during the US election, has been at the center of baseless theories promoted by Trump and his supporters.", "The Trump team filed numerous unsuccessful lawsuits trying to invalidate the results of the November vote, including in Nevada and Pennsylvania.", "AFP Fact Check has debunked many other false and misleading claims of purported electoral fraud in the 2020 US election here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]