["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The National Republican Senatorial Committee (NRSC) launched the website profiteeringpeters.com as part of its campaign to unseat Sen. Gary Peters (D-MI) this upcoming election. The website attacks Peters’ record on veterans issues.", "Peters is a veteran himself and, in 2017, Vietnam Veterans of America called Peters \"Legislator of the Year.\" But, the NRSC warns voters that Peters’ reputation as a champion for veterans belies his record.", "The NRSC’s list of attacks is long: \"Peters fought against funding for the VA, veterans housing programs, military pay raises, and health care and research for veterans and their families. He also fought against funding for processing veterans’ disability claims.\" The NRSC repeats its claims that Peters fought against veterans housing and funding for disabled veterans as well as opposed military pay raises in a TV ad.", "The attacks are misleading. The NRSC’s claims distort or ignore votes Peters has cast as a member of Congress and his own efforts to introduce and sponsor legislation to support veterans.", "The NRSC disagreed with the findings of this FactCheck and defended its claims. \"It is unfortunate that the Detroit Free Press is using Democrat talking points to carry water for Gary Peters’ Senate campaign,\" said NRSC spokesperson Nathan Brand in response to a request for comment.", "The NRSC points to instances when Peters voted against bills appropriating funding for the Department of Veterans Affairs (VA). But during his time both in the U.S. House and Senate, Peters has consistently supported the final passage of legislation funding the department.", "The NRSC noted that in 2015, Peters voted against ending debate on an appropriations bill that the American Legion and President Obama said underfunded the VA. But Peters ultimately supported the final bill, which included a significant increase in funding for the department from the previous fiscal year.", "The NRSC also said that in 2016, Peters voted three times against shutting off debate on a conference report combining the House- and Senate-passed versions of an appropriations bill that would have restricted funding for family planning services. Preceding these votes, however, Peters supported the Senate-passed version of the bill that actually proposed a higher level of funding for the VA than the conference report.", "After the conference report failed, the Senate considered another appropriations bill funding the VA that Peters voted against. Peters said he could not support the bill because it did not include any assistance for Flint residents during the city’s water crisis.", "This was the second time Peters voted against a final appropriations bill funding the VA. In 2013, Peters — along with many Democrats — voted against a bill that contained large spending cuts across the U.S. government, including funding for implementation of the Affordable Care Act (ACA).", "Besides these two votes, Peters has supported every appropriations bill funding the VA. During Peters’ time in Congress, the VA budget has grown considerably.", "To support the claim that Peters fought against veterans housing programs, the NRSC points to Peters’ participation in a group that aimed to reduce the government’s deficit in 2010. Peters’ group wanted to introduce an amendment rolling back proposed spending for a veterans housing initiative contained in the House appropriations bill that year.", "C.J. Warnke, the press secretary for Peters’ re-election campaign, said the program under consideration was the Department of Housing and Urban Development’s Veterans Affairs and Supportive Housing (HUD-VASH) program, which provides housing and case management support for chronically homeless veterans.", "HUD Secretary Shaun Donovan did not request funding for HUD-VASH, and Obama’s own budget that year did not include funding for the program.", "The House appropriations bill, however, set aside additional funding for HUD-VASH, and at the urging of Democratic party leaders, Peters decided not to offer an amendment cutting the proposed funding for the program.", "More recently, however, Peters has expressed explicit support for funding HUD-VASH. Ahead of the 2020 appropriations process, Peters signed on to a letter requesting funding for the program.", "Peters has also requested funding for other veterans housing programs. Ahead of the last four appropriations cycles, Peters requested \"robust funding\" for the VA’s State Home Construction Grant Program, which provides financial support to state facilities for elderly veterans.", "The NRSC notes that in the summer of 2016, Peters voted twice against shutting off debate on a Defense Department appropriations bill proposing a 2.1% pay raise for military personnel. However, several months later, Peters supported the annual National Defense Authorization Act (NDAA), which included the same proposed pay raise.", "With one exception, Peters has voted for every NDAA containing a military pay increase since he has been in Congress. The past four fiscal years have included military pay increases greater than 2%. In 2012, Peters voted against the NDAA, which included a 1.7% military pay increase. That year, Peters submitted a statement noting his opposition, including his concerns with the direction of the war in Afghanistan.", "As a member of the Senate’s Armed Services Committee, Peters just recently voted to advance the NDAA for fiscal year 2021 to the Senate floor with a proposed 3% military pay raise.", "The NRSC supports the claim that Peters has \"fought\" against funding for health care and research for veterans and their families by pointing to Peters’ 2016 vote against a final appropriations bill. While Peters noted his support for funding the VA, he opposed it because it did not contain aid for Flint residents.", "In addition to the VA appropriations bills Peters has supported, which have included funding for the Veterans Health Administration, Peters has co-sponsored legislation that proposes additional funding and services to meet the health care needs of women veterans.", "Funding for processing veterans’ disability claims", "The NRSC cites Peters’s vote against a joint resolution proposing appropriations for the 2014 fiscal year as evidence that he fought funding for processing veterans’ disability claims. The resolution proposed nearly $2.5 billion for the Veterans Benefits Administration, which oversees the department’s disability compensation program.", "Peters was among the overwhelming majority of Democrats who voted against the resolution because it prohibited the use of federal funds to carry out the ACA.", "But Peters ultimately supported the appropriations bill Obama signed into law that included the original $2.5 billion for the Veterans Benefits Administration.", "Peters has also supported legislation to increase funding and expand eligibility for the VA’s disability compensation program.", "In 2015, Peters co-sponsored the Veterans’ Compensation Cost-of-Living Adjustment Act of 2015 to increase veterans’ disability compensation. In 2016, the companion House bill was ultimately passed by Congress and became law.", "And in December 2019, Peters voted for a bill that included $125 million for processing disability claims from Vietnam War veterans exposed to Agent Orange. Peters had earlier co-sponsored legislation that expanded disability compensation to such veterans.", "The NRSC claims that \"Peters fought against funding for the VA, veterans housing programs, military pay raises, and health care and research for veterans and their families. He also fought against funding for processing veterans’ disability claims.\" Peters’ record reveals otherwise.", "The NRSC’s statements rest on a handful of votes that don’t reflect Peters’ actual positions on the issues. Peters has supported the final passage of every bill funding the VA and its housing, health care, and disability compensation programs with the exception of two votes. One vote was because Democrats opposed spending cuts; another was because Peters wanted assistance for the Flint water crisis that wasn’t included.", "Peters has also voted for every Defense Authorization Act that included a military pay raise with one exception because he was opposed to the direction of the war in Afghanistan.", "Overall, the claims are not accurate. We rate its claims False.", "National Republican Senatorial Committee website, Profiteering Peters", "Gary Peters Senate website, Meet Gary", "Gary Peters Senate website, Peters Honored as Legislator of the Year by Vietnam Veterans of America, 8/11/17", "U.S. Senate, Roll Call Vote 114th Congress - 1st Session, Vote Number 273, 10/1/15", "U.S. Senate, Congressional Record, 10/1/15", "Executive Office of the President, Office of Management and Budget, Statement of Administration Policy, 10/1/15", "U.S. Senate,  Roll Call Vote 114th Congress - 1st Session, Vote Number 339, 12/18/15", "Public Law 114-113, Consolidated Appropriations Act, 2016", "Military Times, \"Budget deal nails down fiscal 2016 spending for DoD, VA,\" 12/16/15", "U.S. Senate,  Roll Call Vote 114th Congress - 2nd Session, Vote Number 112, 6/26/16", "U.S. Senate,  Roll Call Vote 114th Congress - 2nd Session, Vote Number 134, 7/14/16", "U.S. Senate,  Roll Call Vote 114th Congress - 2nd Session, Vote Number 135, 9/6/16", "U.S. House, Congressional Record, 6/22/16", "U.S. Senate, Congressional Record, 6/28/16", "U.S. Senate,  Roll Call Vote 114th Congress - 2nd Session, Vote Number 82, 5/19/16", "U.S. Senate, Amendment to H.R. 2577, 5/19/16", "114th Congress, H.R.5325 - Continuing Appropriations and Military Construction, Veterans Affairs, and Related Agencies Appropriations Act, 2017, and Zika Response and Preparedness Act", "U.S. Senate,  Roll Call Vote 114th Congress - 2nd Session, Vote 151, 9/28/16", "Senator Gary Peters, Peters floor remarks on government funding bill, 9/28/16", "U.S. House, Roll Call 89, 3/21/13", "113th Congress, H.R.933 - Consolidated and Further Continuing Appropriations Act, 2013", "The New York Times, \"House Passes Money Bill and Budget Blueprint,\" 3/21/13", "U.S. Department of Veterans Affairs, Office of Budget, FY 2020 Budget Submission", "Politico, \"Four House Dems revolt,\" 7/20/10", "Politico, \"Budget-cutting Dems are undercut,\" 7/30/10", "Senate Hearing 111-862, \"Housing Our Heroes, An Examination of the Progress in Ending Veterans’ Homelessness,\" 5/20/10", "Office of Management and Budget, \"Budget of the U.S. Government Fiscal Year 2011\"", "111th Congress — 2nd Session, H.R. 5850", "U.S. Senate, Letter to Chairman Collins and Ranking Member Reed, 4/9/19", "U.S. Senate, Letter to Chairman Moran and Ranking Member Schatz, 5/3/17", "U.S. Senate, Letter to Chairman Boozman and Ranking Member Schatz, 4/18/19", "U.S. Senate,  Roll Call Vote 114th Congress - 2nd Session, Vote Number 124, 7/7/16", "U.S. Senate,  Roll Call Vote 114th Congress - 2nd Session, Vote Number 136, 9/6/16", "U.S. House, 114th Congress — 2nd Session, Report of the Committee on Appropriations to Accompany H.R. 5293", "Public Law 114-328, National Defense Authorization Act for Fiscal Year 2017", "Congressional Research Service, \"FY2017 National Defense Authorization Act: Selected Military Personnel Issues,\" 1/23/17", "U.S. House, Roll Call 645, 12/20/12", "Public Law 112-239, National Defense Authorization Act for Fiscal Year 2013", "Congressional Research Service, \"Military Pay: Key Questions and Answers,\" 5/6/19", "Congressional Record, 5/30/12", "Gary Peters Senate website, Peters Votes To Give Servicemembers Pay Raise, Strengthen National Security & Support Michigan’s Defense Sector, 6/12/20", "Senate Armed Services Committee, National Defense Authorization Act Fiscal Year 2021", "Gary Peters Senate website, \"Peters Cosponsors Bill to Improve Health Care Access for Women Veterans,\" 8/31/15", "Gary Peters Senate website, \"Peters Cosponsors Legislation to Improve Access to Care for Women Veterans,\" 4/19/17", "U.S. House, Roll Call 478, 9/20/13", "113th Congress — 1st Session, H.J. Res. 59", "U.S. House, Roll Call 550, 10/16/13", "Public Law 113-46, Continuing Appropriations Act, 2014", "114th Congress, S.1493 - Veterans' Compensation Cost-of-Living Adjustment Act of 2015", "114th Congress, H.R.5588 - Veterans' Compensation COLA Act of 2016", "U.S. Senate,  Roll Call Vote 116th Congress - 1st Session, Vote Number 428, 12/19/19", "Military Times, \"Another big boost for VA funding in latest federal budget deal,\" 12/19/19", "116th Congress, S.1195 - Blue Water Navy Vietnam Veterans Act of 2019", "116h Congress, H.R.299 - Blue Water Navy Vietnam Veterans Act of 2019", "C.J. Warnke, Peters for Michigan Press Secretary, email correspondence, 6/19/20", "Zade Alsawah, U.S. Senator Gary Peters’ Deputy Communications Director, email correspondence, 6/19/20", "Natan Brand, NRSC spokesperson, email correspondence, 6/30/20", "Natan Brand, NRSC spokesperson, email correspondence, 6/29/20", "Natan Brand, NRSC spokesperson, email correspondence, 6/15/20", "Will Goodwin, Director of Government Relations at VoteVets, phone conversation, 6/18/20", "Peters for Michigan, campaign email, 6/10/20", "U.S. Senate,  Roll Call Vote 116th Congress - 1st Session, Vote Number 400, 12/17/19", "116th Congress, S.1790 - National Defense Authorization Act for Fiscal Year 2020", "U.S. Senate, Armed Services Committee, FY2020 NDAA Summary", "U.S. Senate,  Roll Call Vote 115th Congress - 2nd Session, Vote Number 181, 8/1/18", "Public Law 115-232, John S. McCain National Defense Authorization Act for Fiscal Year 2019", "Congressional Research Service, \"FY2019 National Defense Authorization Act: Selected Military Personnel Issues,\" 10/16/18", "U.S. Senate,  Roll Call Vote 115th Congress - 1st Session, Vote Number 199, 9/18/17", "Public Law 115-91, \"National Defense Authorization Act for Fiscal Year 2018\"", "Congressional Research Service, \"FY2018 National Defense Authorization Act: Selected Military Personnel Issues,\" 12/14/17", "U.S. Senate,  Roll Call Vote 114th Congress - 2nd Session, Vote Number 159, 12/8/16", "U.S. Senate,  Roll Call Vote 114th Congress - 1st Session, Vote Number 301, 11/10/15", "Public Law 114-92, \"National Defense Authorization Act for Fiscal Year 2016\"", "Congressional Research Service, \"FY2016 National Defense Authorization Act: Selected Military Personnel Issues,\" 12/17/15", "U.S. House, Roll Call 551, 12/4/14", "Public Law 113-291, \"Carl Levin and Howard P. \"Buck\" McKeon National Defense Authorization Act for Fiscal Year 2015\"", "Congressional Research Service, \"FY2015 National Defense Authorization Act: Selected Military Personnel Issues,\" 12/11/14", "Congressional Research Service, \"Military Pay: Key Questions and Answers,\" 5/6/19", "U.S. House, Roll Call 932, 12/14/11", "Public Law 112-81, \"National Defense Authorization Act for Fiscal Year 2012\"", "U.S. House, Roll Call 650, 12/17/10", "U.S. House, Roll Call 770, 10/8/09", "Public Law 111-84, \"National Defense Authorization Act for Fiscal Year 2010\"", "Public Law 116-93, \"Consolidated Appropriations Act, 2020\"", "U.S. Senate,  Roll Call Vote 116th Congress - 1st Session, Vote Number 415, 12/19/19", "Public Law 116-94, \"Further Consolidated Appropriations Act, 2020\"", "U.S. Senate,  Roll Call Vote 116th Congress - 1st Session, Vote Number 26, 2/14/19", "Public Law 116-6, \"Consolidated Appropriations Act, 2019\"", "U.S. Senate, Roll Call Vote 115th Congress - 2nd Session, Vote Number 207, 9/12/18", "Public Law 115-244, \"Energy and Water, Legislative Branch, and Military Construction and Veterans Affairs Appropriations Act, 2019\"", "U.S. Senate,  Roll Call Vote 115th Congress - 2nd Session, Vote Number 63, 3/23/18", "Public Law 115-141, \"Consolidated Appropriations Act, 2018\"", "Congressional Research Service, \"Department of Veterans Affairs FY2018 Appropriations,\" 3/9/18", "U.S. Senate,  Roll Call Vote 115th Congress - 1st Session, Vote Number 121, 5/4/17", "Public Law 115-31, \"Consolidated Appropriations Act, 2017\"", "Public Law 114-223, \"Continuing Appropriations and Military Construction, Veterans Affairs, and Related Agencies Appropriations Act, 2017, and Zika Response and Preparedness Act\"", "U.S. Senate,  Roll Call Vote 114th Congress - 1st Session, Vote Number 339, 12/18/15", "Public Law 114-113, \"Consolidated Appropriations Act, 2016\"", "U.S. House, Roll Call 563, 12/11/14", "Public Law 113-235, \"Consolidated and Further Continuing Appropriations Act, 2015\"", "U.S. House, Roll Call 21, 1/15/14", "Public Law 113-76, \"Consolidated Appropriations Act, 2014\"", "Public Law 113-6, \"Consolidated and Further Continuing Appropriations Act, 2013\"", "U.S. House, Roll Call 941, 12/16/11", "Public Law 112-74, \"Consolidated Appropriations Act, 2012\"", "U.S. House, Roll Call 857, 11/17/11", "Public Law 112-55, \"Consolidated and Further Continuing Appropriations Act, 2012\"", "U.S. House, Roll Call 268, 4/14/11", "Public Law 112-10, \"Department of Defense and Full-Year Continuing Appropriations Act, 2011\"", "U.S. House, Roll Call 949, 12/10/09", "Public Law 111-117, \"Consolidated Appropriations Act, 2010\"", "S.514 — 116th Congress, co-sponsors to the \"Deborah Sampson Act\"", "S.514 — 116th Congress, \"Deborah Sampson Act\"", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]