["President Donald Trump touted rising earnings for low-wage workers. (Shuttershock)", "Earnings for the bottom 10% seem to be rising faster, but not by much, and there are different ways to crunch the data.", "The measure he used also undercounts the earnings of the top 10%.", "State-level hikes in the minimum wage might have affected the earnings trends.", "One of President Donald Trump’s central promises was to produce a rising economy that lifts all boats. At a rally in Wildwood, N.J., he touted record low unemployment rates, especially for African Americans and Hispanics. His policies of tax cuts and rolling back regulations, he said, had been particularly good for those making the least.", "\"This is a blue-collar boom,\" Trump said Jan. 28. \"Earnings for the bottom 10% are rising faster than earnings for the top 10%.\"", "The Bureau of Labor Statistics has the numbers behind Trump’s statement.", "There’s data for each quarter and each year. The quarterly numbers back Trump up, but the yearly numbers are more reliable — they capture seasonal employment and have a lower standard error. Looking at the changes from year to year, earnings for the lowest 10% grew faster in only one year, 2018. Here’s how that looks:", "So Trump is right for only one out of the three years of his presidency.", "We also looked at the change between 2016, the year before Trump took office, and 2019. Viewed that way, the numbers support Trump’s statement. Between 2016 and 2019, the low-wage earners saw a 14.6% rise, compared with 13.5% for the top earners.", "This data has limitations.", "The earnings data misses income from a second part-time job that many low-wage earners rely on. But more significant are the dollars it misses on the high end.", "It doesn’t count the self-employed at all –– about 10% of the workforce –– which in the higher income group includes lawyers, engineers, financial advisers and other lucrative professions.", "\"The earnings growth in that group could be very high, because that’s where we’ve seen some of the highest income growth over the past 30 years,\" said Erica Groshen, the former head of the Bureau of Labor Statistics.", "Plus, this survey doesn’t count earnings over $150,000. Someone making $250,000 would be entered as earning $149,999. That makes the high-end number in the data artificially low.", "This measure is not well suited to the comparison at the extremes that Trump made.", "Trump pushed for the tax cuts and signed spending bills that spurred growth (and rising deficits) so he can take some credit for a steady economy.The growth has led employers to boost wages to attract and keep workers.", "But Trump has not supported raising the minimum wage, and that’s also a plausible driving factor. The federal minimum wage of $7.25 an hour hasn’t changed since 2009, but 29 states have increased it on their own, including very large states such as New York and California.", "\"The minimum wage absolutely could be at play,\" said economist Elise Gould with the Economic Policy Institute, a group focused on gains for low and middle income workers. \"In states that raised the minimum wage, lower income wages rose faster than in those that didn’t.\"", "Between 2010 and 2018, in states that raised the minimum wage faster than inflation, the bottom 10% of workers saw their wages go up nearly 10%. For states that didn’t act, wages rose too, but by less than 6%.", "So tax and regulation cuts are only part of the story. Deficit spending and hikes in the minimum wage also played a role.", "Trump said that \"earnings for the bottom 10% are rising faster than earnings for the top 10%.\" Earnings for the bottom 10% seem to be rising faster, but not by much, and there are different ways to crunch the data.", "Also, the weekly earnings measure misses a lot of income at the high end and produces an artificially low estimate for the top 10%. It is a poor measure for the comparison Trump made.", "The claim is partially accurate but lacks important context. We rate this claim Half True.", "Donald Trump, Rally in Wildwood, N.J., Jan. 28, 2019", "U.S. Bureau of Labor Statistics, Quartiles and selected deciles of usual weekly earnings, Jan. 17, 2020", "Wall Street Journal, Rank-and-File Workers Get Bigger Raises, Dec. 27, 2019", "USA Today, What are the 25 lowest paying jobs in the US? Women usually hold them, June 7, 2019", "Bureau of Labor Statistics, Self-employment In The United States, March 2016", "Congressional Budget Office, How the 2017 Tax Act Has Affected CBO’s GDP and Budget Projections Since January 2017, Feb. 28, 2019", "Congressional Budget Office, The Budget and Economic Outlook: 2020 to 2030, Jan. 28, 2019", "Economic Policy Institute, Low-wage workers are suffering from a decline in the real value of the federal minimum wage, Aug. 27, 2019", "Associated Press, Trump’s compulsive claims of ‘biggest’ ever, Jan. 18, 2020", "Email exchange, Press office, Trump for President, Jan. 29, 2020", "Email exchange, Press office, U.S. Bureau of Labor Statistics, Jan. 31, 2020", "Email exchange, Harry J. Holzer, professor of public policy, Georgetown University's McCourt School of Public Policy, Jan. 30. 2020", "Interview, Elise Gould, senior economist, Economic Policy Institute, Jan. 30, 2020", "Interview, Erica Groshen, former head of the U.S. Bureau of Labor Statistics, and research fellow, Upjohn Institute for Employment Research, Jan. 31, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]