["The claim was made in a graphic published on Facebook here on August 29, 2020. The post has been shared more than 200 times since.", "The text in the graphic reads: \"Let that sink in. The Covid-19 death rate without a vaccine is lower than the flu death rate with a vaccine.\"", "The claim was also shared on Facebook here, here and here; and on Twitter here, here and here.", "The claim is false, according to multiple international health experts.", "“Doctors and scientists are working to estimate the mortality rate of COVID-19, but at present, it is thought to be substantially higher (possibly 10 times or more) than that of most strains of the flu,” Dr. Lisa Maragakis, senior director of infection prevention at Johns Hopkins University, said in a September 2020 report here.", "Maragakis added that Johns Hopkins, a leading source of Covid-19 data in the US, estimates that there have been approximately 869,306 Covid-19 deaths worldwide from January 2020 and September 4, 2020. The flu, however, only kills roughly 290,000 to 650,000 people worldwide every year, Maragakis wrote citing the World Health Organization (WHO).", "Peter Julian Cayton, an associate professor of statistics and member of the University of the Philippines Pandemic Response Team, also refuted the claim about Covid-19’s death rate.", "\"For influenza-like illnesses in the Philippines, the case fatality ratio is at 0.014% last 2018. As it stands right now, COVID-19 is estimated to have 1.6%, but this (is) still preliminary for many reasons, like the year not yet over and some data pending processing and validation,” he told AFP in a Facebook message September 7, 2020.", "As early as March 2020, international experts determined that Covid-19’s death rate was higher than that of the flu.", "“Mortality for COVID-19 appears higher than for influenza, especially seasonal influenza,” the WHO stated here on March 17, 2020.", "At the time, the WHO determined that “the crude mortality ratio (the number of reported deaths divided by the reported cases) is between 3-4%, the infection mortality rate (the number of reported deaths divided by the number of infections) will be lower. For seasonal influenza, mortality is usually well below 0.1%.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]