["About this rating", "A page on WhiteHouse.org summarizing the United States Constitution used the word \"citizens\" instead of \"persons\".", "This wording has been used since at least the Obama administration; It does not affect the actual wording of the United States Constitution.", "On 30 January 2017, a rumor started circulating on social media that United States President Donald Trump had rewritten the United States Constitution, changing the words \"people\" or \"persons\" to the word \"citizens\":", "Republicans care so much about the Constitution they let Trump rewrite it. Changing the Bill of Rights on Whitehouse.gov to say \"citizens\" everywhere it says \"people\" or \"person\" in the original text.", "As evidence of this change, two images were presented.  One purported to show the text of the Constitution as it appears on WhiteHouse.gov, and the other showed the text as it appears on ConstitutionUS.com:", "The images are both real, but the conclusion that Trump and his administration have changed the text of the Bill of Rights is false. The text on the left from WhiteHouse.gov is not a reproduction of the Bill of Rights; it is a summary. The White House did use informal language to explain the purpose of each amendment. but it did not simply swap the word \"person\" for \"citizen.\" Rather, they summarized each amendment, making them easier to read and understand.", "For example, here is the text of the Fourth Amendment:", "The right of the people to be secure in their persons, houses, papers, and effects, against unreasonable searches and seizures, shall not be violated, and no Warrants shall issue, but upon probable cause, supported by Oath or affirmation, and particularly describing the place to be searched, and the persons or things to be seized.", "By comparison, here is how it appeared on WhiteHouse.gov (changes bolded):", "The Fourth Amendment protects citizens from unreasonable search(es) and seizure(s). The government may not conduct any searches without a warrant, and such warrants must be issued by a judge and based on probable cause.", "These summaries are not new, and are not a creation of the Trump administration; they first appeared on WhiteHouse.gov during President Obama's administration. Here is a comparison of how the Constitution appeared on WhiteHouse.gov with Trump in office, and how it appeared on the web site (archived at ObamaWhiteHouse.gov) when Obama was in office:", "It is true that the White House web site uses the word \"citizens\" instead of \"persons\" on its page summarizing the Constitution. However, this page contains a summary of the Bill of Rights,  not a verbatim reproduction, and appeared on the government web site during President Obama's administration.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]