["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "President Donald Trump’s homeland security adviser Tom Bossert said that the military has taken unprecedented steps in response to Hurricane Irma.", "By the time of this briefing Sept. 11, Hurricane Irma had weakened to a tropical storm as it made its way up the Florida peninsula.", "\"The mobilization of our military in response to the storms in Puerto Rico and the U.S. Virgin Islands is the largest ever mobilization of our military in a naval and marine operation, and we now have an Air Force carrier deployed in this effort; this was the first-ever as well,\" Bossert said.", "Was the military’s response to Irma the largest naval operation ever and the first time an aircraft carrier has been deployed after a natural disaster?", "For one, the Navy actually operates aircraft carriers, not the Air Force. More to the point, it is too soon to say that the U.S. response to Irma was the largest response to a hurricane, and it definitely was not the first time an aircraft carrier was deployed for that reason.", "Hurricane Irma struck the U.S. Virgin Islands as a Category 5 storm and skirted along Puerto Rico’s coast with 185 mph winds. The storm continued on a track towards Florida, where it hit the Keys as a Category 4 hurricane in the Florida Keys and then again on Marco Island as a Category 3. The storm caused major, widespread damage from Miami to Naples to Tampa and Jacksonville.", "In response to Irma, the Defense Department said on Tuesday that it had dispatched 10,000 service members to the U.S. Virgin Islands and Puerto Rico, and 20,700 in the eastern United States.", "The National Guard reported Sept. 12 that it had deployed more than 15,500 guardsmen in response to Irma. In addition to service members, the Pentagon has deployed nine ships and the USS Abraham Lincoln, a nuclear-powered aircraft carrier controlled by the Navy.", "These numbers could change as the department assesses what is needed.", "Still, by numbers alone, the response to Irma at the time of this claim doesn’t quite stack up against the Pentagon’s response to Hurricane Katrina.", "By Sept. 7, 2005, nine days after Katrina made landfall, operations included 17,417 active-duty troops, 42,990 National Guardsmen, 20 U.S. ships, 360 helicopters and 93 military planes, according to a Congressional Research Service report.", "\"Whether the Irma efforts become the largest deployment of U.S. military forces after a natural disaster remains to be seen, but it’s worth noting that more than 12,000 Department of Defense personnel assisted with Unified Assistance, and thousands were deployed after Hurricane Katrina,\" said Lance Janda, a military historian at Cameron University.", "More broadly, if you consider all naval and Marine operations (not just hurricane relief), then Bossert’s claim is even more inaccurate.", "\"Clearly this was nowhere near the biggest naval/Marine operation ever—it was dwarfed by big wartime operations from World War II and the Korean war and even Operation Desert Storm,\" said Michael O’Hanlon, a senior fellow at the Brookings Institution.", "The Navy Office of Information confirmed that this was not the first time an aircraft carrier has been deployed to help hurricane recovery efforts.", "After Hurricane Katrina, the USS Harry S. Truman deployed for rescue and recovery operations.", "In addition, the USS Saipan was deployed after Hurricane Hazel in 1954. And it’s not only hurricanes. In 1959, the USS Kearsarge deployed to Japan to help with relief efforts related to Typhoon Vera. The USS Abraham Lincoln was also sent to Sumatra to provide support for Indonesia after the 2004 tsunami.", "#70YearsOfService 1959: USS Kearsarge responds to #Typhoon Vera in #Japan w/ airlifts & #SearchAndRescue ops. Story: https://t.co/FBYJJqAixE pic.twitter.com/pAcKlTYzO8", "Bossert said the Defense Department had put together \"the largest-ever mobilization of our military in a naval and Marine operation.\" He also added that for the first time ever an \"Air Force carrier\" had been deployed in the effort.", "Bossert misspoke when he said \"Air Force\" carrier, but it’s still not the first time an aircraft carrier has been used after a natural disaster.", "Most importantly, it is too soon to say that the military response to Hurricane Irma was the largest ever. At this point, the response to Irma doesn’t quite stack up against the Pentagon’s response to Hurricane Katrina.", "We rate this claim Mostly False.", "Email exchange on background with James Holmes, U.S. Naval War College professor of strategy, Sept. 13, 2017", "Email exchange on background, Steven Cheung, President Donald Trump spokesman, Sept. 13, 2017", "Email exchange with Michael O’Hanlon, a senior fellow at the Brookings Institution, Sept. 13, 2017", "Email exchange,  Phil Klotzbach, Research Scientist Department of Atmospheric Science at Colorado State University - Fort Collins, Sept. 13, 2017", "Interview, Lt. Marycate Walsh, Navy Office of Information, Sept. 13, 2017", "Interview, Lance Janda, military historian at Cameron University, Sept. 13, 2017", "Interview, Defense Department spokeswoman Heather Babb, Sept. 13, 2017", "U.S Department of Defense, \"Update: DoD Response to Hurricane Irma September 12, 2017 (5:00 pm EDT),\" Sept. 12, 2017", "Washington Post, \"White House says its military response to Irma is unprecedented, but there’s a history of similar operations,\" Sept. 11, 2017", "America’s Navy, \"U.S. 7th Fleet First to Provide Naval Support to Aceh Province,\" Jan. 1, 2005", "CRS Report for Congress, \"Hurricane Katrina: Department of Defense Disaster Response,\" Sept. 19, 2005", "White House, \"Press Briefing by Press Secretary Sarah Sanders and Homeland Security Advisor Tom Bossert,\" Sept. 11, 2017", "U.S. Pacific Command‏ tweet, Nov. 5, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]