["About this rating", "A theory posited by a law professor argued that there is a “loophole” to judicial boundaries within Yellowstone National Park — a region that overlaps parts of Wyoming, Idaho, and Montana — that would make it difficult or impossible to prosecute crimes that require a jury in a court of law.", "To date, a crime committed in this region has not been brought forth in a court of law, and it is unlikely that prosecutors would forgo pursuing a case because of the disputed boundaries. In particular, it is not accurate to say that murder is legal in this zone, despite what some publications have reported.", "There is no legal precedent for criminal prosecutions in this area. As such, it is unknown exactly how a court proceeding might go.", "A legal loophole is rumored to make it possible to “get away with murder” in a 50-square-mile stretch of isolated land in Yellowstone National Park. Colloquially known as the “Zone of Death,” the area located on the border of Wyoming and Idaho is said to be a no-man’s land where the law is unenforceable and crimes have the potential to go unpunished.", "This so-called death zone was first introduced in a research paper titled \"The Perfect Crime,\" written by law professor Brian Kalt and published in the November 2005 issue of the Georgetown Law Journal. In the years since, some commentators went so far as to argue that it is possible to “get away with murder” in the area. And while it is true that a potential legal loophole does exist, Kalt told Snopes that such a statement is overly generalized and largely inaccurate.", "“Most of the clickbait stories about the Zone overstate it — they make it sound like it is settled as a matter of law. They leave out all of the limits that would apply even if the loophole were upheld,” he said.", "In his 2005 research, Kalt described a constitutional loophole found in a section of the Sixth Amendment known as the Vicinage Clause. The Sixth Amendment of the Constitution establishes the right to be tried before a jury, of one’s peers and that during some criminal proceedings, a trial shall be formed “by an impartial jury of the State and district wherein the crime shall have committed, which district shall have been previously ascertained by law.”", "In other words, the jurors in federal criminal cases must be people from the state and judicial district in which the crime was committed and that the district be previously ascertained.", "In short, a person charged with a crime has the right to appear before a jury summoned from the state and district in which the crime was committed.", "Here’s the \"Zone of Death\" catch: Yellowstone National Park was established in 1872 -- more than a decade before the states of Idaho, Wyoming, and Montana now found within its boundaries were formed. And though nearly all of Yellowstone is found within Wyoming state lines, 9% of the park stretches into Montana (260 square miles) and Idaho (50 square miles). When the two were eventually granted statehood in 1889 and 1890, respectively, leaders surrendered their legal jurisdiction to the federal government.", "Later, Congress established the United States District Court for the District of Wyoming, which placed the entirety of Yellowstone under the District of Wyoming — the only district to be found in multiple states.", "“Yellowstone National Park is one of only a few federal areas in which the feds have exclusive jurisdiction, meaning that the states cannot prosecute crimes that occur there, only the feds can,” said Kalt.", "In theory, any crime committed in the District of Wyoming must summon a jury from the said district. But under Kalt’s argument, a crime committed in Idaho or Montana must require a jury to be summoned from its respective state. And if a crime is committed in the Idaho portion of Yellowstone, the jury would have to be from the state (Idaho) and the judicial district (District of Wyoming) in which the crime was committed. The only place that meets both criteria (state and district) is the Idaho portion of Yellowstone, so the jurors would have to be from there.", "“The solution may seem simple. The jury should be summoned from the Idaho portion of Yellowstone park — where the district of Wyoming and Idaho overlap,” wrote the Public Lands History Center in a blog post. “The only problem is, according to the 2000 Census, this area has a population of exactly zero (the Montana portion has a small population).”", "The courts may or may not agree with Kalt’s assessment, and the professor does not encourage individuals to go out and commit crimes, instead suggesting that if the loophole does exist, it should be closed and not ignored.", "Kalt told Snopes that his intention in writing the paper was to highlight the legislative discrepancy and ultimately get it fixed, and he is confident that it’s not too late. And, according to the law professor, a legal remedy would be a simple and easy remedy.", "“All Congress would need to do is to redraw the judicial district boundaries to follow state lines, just like every other district in the country,” he said, adding that such reinstatement would not require a constitutional amendment.", "Update [Jan. 28, 2021]: This article was updated to clarify language regarding the Sixth Amendment and Article III, Section 2 of the Constitution.", "Update [Sept. 13, 2021]: Further clarified and corrected constitutional references.", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]