["Since the last two days, reports have emerged that according to an Enforcement Directorate report, Popular Front of India (PFI) mobilised Rs 120 crores during protests against the Citizenship Amendment Act (CAA). According to an Economic Times report, the agency was investigating the Kerala-based political outfit under the Prevention of Money Laundering Act (PMLA) since 2018. ED has reportedly found that at least Rs 1.04 crore was deposited in several bank accounts across the country linked to the organisation between December 4 last year and January 6, 2020. However, PFI has condemned the news reports and dubbed the allegations “baseless”. Meanwhile, several mainstream media outlets also claimed that ED has named senior lawyers in their report and funds were transferred to them by PFI during the anti-CAA protests.", "On January 27 at 12:32 PM, Times Now levelled a series of allegations against prominent Supreme Court lawyers Dushyant Dave, Indira Jaising and Kapil Sibal linking them with the case of money laundering alleged by the Enforcement Directorate. The channel anchor said, “ED draws sensational link to the lobby”. The official Twitter handle of Indira Jaising and Kapil Sibal were tagged in the Times Now tweet.", "#TukdeFundedCAAStir#BREAKING | It’s out –‘Islamist radicals funded violence.’ Rs 120 crore, 73 syndicate bank accounts REVEALED. @Dir_ED draws sensational link to Lobby. @KapilSibal, @IJaising, PFI named by ED. Sabotage-‘syndicate’ behind CAA stir. | Navika Kumar with details. pic.twitter.com/6lyLORR1ec", "— TIMES NOW (@TimesNow) January 27, 2020", "At 4:12 minutes in the broadcast, Navika Kumar says, “That’s right. There are names that have been mentioned here. These we don’t know if the Enforcement Directorate has concluded whether these have any linkages to do with PFI. The fact is these are lawyers of the Popular Front of India. Kapil Sibal who has received money worth Rs 77 lakh from for the cases, he has represented them in. Indira Jaising and the other name that is known opposed to the Modi government. Four lakhs have gone to her, Dushant Dave 11 lakhs in payment.”", "“It’s clear now anti-CAA protests are being funded by PFI. There is a clear link between the bank transfers and anti CAA protests, their timing and location. Also, read the names of the liberal leaders who are getting funds from PFI,” tweeted Zee News anchor Sudhir Chaudhary while posting a screenshot of a document. It is important to note here that the document was unsigned and undated. The tweet has now been deleted. An archived version of the tweet can be accessed here.  “PFI mobilised Rs 120 crore during anti-CAA protests, Kapil Sibal, Indira Jaising among recipients: Report”, read the headline of a report published by Daily News Analysis (DNA) on January 27, 2020. The report claimed that “according to sources quoted by Zee News”, Kapil Sibbal has received Rs 77 lakh whereas Indira Jaising got Rs 4 lakh.", "Zee News too reported, “The source said that Sibal received Rs 77 lakh, Jaising received Rs 4 lakh, Dushyant A Dave received Rs 11 lakh and Abdul Samad Rs 3.10 lakh.” Zee News Twitter handle posted the report with the following words, “How much did PFI pay Kapil Sibal, Indira Jaising, Dushyant A Dave and Abdul Samand for anti-CAA protests”. However, the tweet was later taken down.", "According to an ANI report, ED has drawn a correlation between dates of monetary deposits in bank accounts and the dates of anti-CAA protests. However, the agency is reportedly investigating the matter. Alt News will limit the fact-check to the allegation of money received by senior lawyers during the anti-CAA protests.", "Alt News found that the allegation raised against senior lawyers, of receiving money from the political outfit, is from March 2018 and unrelated to the recent anti-CAA protests. In 2018, Kerala state committee of the Popular Front of India (PFI) had revealed the details of the amount it had collected and spent on the legal battle of during the Hadiya case. Hadiya, a 25-year-old woman from Kerala, had converted to Islam and married a Muslim man named Shafin Jahan. The conversion was first annulled by the high court based on a petition filed by her father and later restored by the Supreme Court. She won the case in the apex court on March 8, 2018.", "According to a statement released by PFI, it had spent a total of Rs 99,52,324 while fighting Hadiya’s case, dubbed as ‘love jihad case’, for 10 months. PFI had declared that it had paid Rs 93,85,000 as lawyers fees to Kapil Sibal, Dushyant Dave, Indira Jaising and Marzook Bafaki, including others who had appeared in the Supreme Court in the matter.", "Alt News spoke to the lawyers and confirmed the details about the payment. Kapil Sibal vehemently denied the allegation and provided us with a copy of the statement issued by him. “The statement that I was paid Rs. 77,00,000/- is with respect to litigation in SLP (Crl.) No. 19702 of 2017 titled “Shafin Jahan (Petitioner) Versus Asokan K.M. & Ors. (Respondents)”. This is related to Hadiya’s marriage to Shafin Jahan, which was challenged right up to Supreme Court with the NIA and the father of Hadiya being parties. In that litigation, I represented Hadiya, the wife. Ultimately, the marriage was upheld and Hadiya was given the liberty to live with her husband Shafin Jahan.”, reads the statement.", "Below is a video of the press conference where Sibal rubbished the allegations and explained how legal fees for the Hadiya case have been falsely linked with anti-CAA protests.", "अगर गोदी मीडिया चैनलों ने मेरे बिल की ख़बर CAA से जोड़ कर फिर चलाई, और जिन पत्रकारों ने इस बाबत ट्वीट किए उन्होंने ट्वीट नहीं हटाए तो उनको क्रिमिनल कोर्ट में लेकर जाऊँगा : @KapilSibal pic.twitter.com/GSThr0z7iN", "— Umashankar Singh उमाशंकर सिंह (@umashankarsingh) January 27, 2020", "Dushyant Dave also spoke with Alt News and rubbished the claims floated by media outlets. He said that he appeared thrice (3/10/17, 9/10/17, 30/10/17) in the Hadiya case on behalf of the petitioners.", "Indira Jaising took to Twitter and denied having received any money from PFI in relation with anti-CAA protests. Speaking with Alt News, she said, “I received money for August 4, 2017 appearance in Hadiya case. I continued to appear for Hadiya till the date the judgement was delivered by Justice Dipak Misra, Justice Ajay Manikrao Khanwilkar, Justice Dhananjaya Y. Chandrachud. However, I have not raised any bills for subsequent appearances.”", "My statement denying receipt of money from PFI in relation to anti CAA protests or for any other reason or purpose whatsoever. @PTI_News @ZeeNews @ndtv @CNNnews18 @LiveLawIndia @barandbench @AltNews @scroll_in @thewire_in @the_hindu pic.twitter.com/HM1ECWDmxI", "— Indira Jaising (@IJaising) January 27, 2020", "OpIndia published an article with a misleading headline, “Nexus between Congress and Islamists in stoking anti-CAA riots? PFI spent over 120 crores, transferred huge sums to Kapil Sibal and Indira Jaising: Read details”. Ironically, the report also states that both Dave and Sibal have clarified that the amounts were transferred by PFI for their legal services.", "Interestingly in 2018, OpIndia also reported about PFI spending close to Rs 1 crore for Hadiya’s case. The report refers to the fact that Kapil Sibal had appeared for the petitioner in the case.", "Swarajya too reported that Kapil Sibal had received a “whopping Rs 77 lakh” from PFI during anti-CAA protests. Same as OpIndia, the media outlet had also published about PFI paying close to Rs 1 crore in March 2018.", "Kapil Sibal, Indira Jaising Among Others Paid Close To Rs 1 Crore By Islamist PFI In Hadiya Case https://t.co/N7kqpRESg6", "— Swarajya (@SwarajyaMag) March 28, 2018", "Several other prominent Twitter users including BJP spokesperson Suresh Nakhua, BJP’s Priti Gandhi, BJP MP Shobha Karandlaje, and Mohandas Pai have shared the misinformation of senior lawyers receiving funds from PFI during anti-CAA protests.", "In conclusion, media outlets falsely reported that senior lawyers received funds amidst the on-going anti-CAA protests across the country.", "[Update: Zee News anchor Sudhir Chaudhary deleted his tweet after this report was published. Subsequently, a screenshot of the tweet was later added to this report.]", "Donate Now", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]