["About this rating", "On Sept. 15, 2020, shortly after 2020 presidential candidate Joe Biden landed in Tampa, Florida, for a campaign event, a video started to circulate on social media that supposedly showed him \"waving to an empty field\" as he exited the plane. While this video was initially spread by a number of smaller accounts, it was later shared on Facebook by Fox News host Sean Hannity, where it racked up more than 2 million views:", "This is a genuine video of Biden descending the stairs of an airplane in Tampa, Florida. However, the claim that Biden was \"waving to an empty field\" is false.", "While not immediately obvious in the above-displayed video due to the angle of the camera, Biden was waving to a group of firefighters and ground personnel that were stationed just out of frame. These firetrucks can be seen around the 10-second mark of the footage above as Biden walks toward his motorcade.", "An Associated Press reporter who was traveling with Biden confirmed that the presidential candidate was waving to \"firefighters and other ground personnel\" as he exited the plane.", "Sarah Mucha, a CNN reporter who is covering the Biden campaign, posted a video that more clearly shows the events that transpired during this moment. In Mucha's video, it's clear that Biden walks down the stairs, spots the firetrucks, turns to wave, and then heads toward his motorcade.", "Biden was not \"waving to an empty field,\" as claimed by multiple social media users and Fox News host Sean Hannity. Biden was actually waving to a group of firefighters.", "Swenson, Ali.   \"Video Does Not Show Biden Waving to an Empty Field.\"\r\n    Associated Press.   16 September 2020.", "Contorno Steve; Najarro Ileana; Solomon, Josh.   \"In Tampa, Joe Biden Vows to Military 'I'll Always Have Your Back.'\"\r\n    Tampa Bay Times.   15 September 2020.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]