["About this rating", "President Donald Trump is no stranger to charges of racism, leveled both before and since he entered politics, and he faced renewed allegations of prejudice against African-Americans in August 2018 when former White House staffer Omarosa Manigault Newman accused him of wanting to start a \"race war\" and claimed a videotape exists which captures him using the word \"nigger.\"", "In numerous interviews surrounding the publication of her White House memoir Unhinged, Manigault Newman (who was fired from her role in the Trump administration in December 2017) alleged that \"at every single opportunity [Trump] insults African-Americans\" and that she had personally heard the tape in which Trump allegedly uttered the racial slur while on the set of The Apprentice. (Manigault Newman first came to prominence as a contestant on that NBC reality TV show hosted by Trump.)", "The latter claim, which Manigault Newman made in an interview with National Public Radio, contradicted sections of her book in which she claimed that she had only  heard from others about the existence of the tape, rather than having personally heard it herself.", "President Trump has denied the existence of any such tape, and White House Press Secretary Sarah Huckabee Sanders said Manigault Newman's book was \"riddled with lies and false accusations.\"", "Manigault Newman has faced a backlash against her claims: President Trump himself referred to her as a \"crazed, crying lowlife\" and \"that dog\" (further fueling allegations of racism), and White House Deputy Press Secretary Hogan Gidley described Manigault Newman's recording of conversations with other White House officials as \"disgraceful.\"", "On 17 August 2018, several viral social media posts sought to attack the integrity of Manigault Newman while defending President Trump from allegations of racism by claiming that Trump had borne the cost of his then-adviser's April 2017 wedding. Above a wedding photograph of Manigault Newman and her husband Pastor John Allen Newman, one widely-shared post stated:", "Donald Trump \"the racist\" comped, free of charge, Omarose [sic] Manigault's $200,000 wedding at Trump Tower. Meanwhile, she was taping him, and, like a snake, working the whole time to stab him in the back.", "Another similar post read:", "AMERICA: This is Omarosa at her $200,000 wedding reception at Trump Tower, giving [sic] to her free of charge by that racist Donald Trump!!!", "None of the social media posts on this subject offered any sources or information documenting that President Trump bore the cost of Manigault Newman's wedding, or that hosting the couple's rehearsal dinner and brunch reception at a Trump-branded venue cost upwards of $200,000.", "Furthermore, these posts were inaccurate in stating that Manigault Newman was married at Trump Tower, which is in New York. Her rehearsal dinner and brunch reception took place at Trump International Hotel in Washington, D.C., on 8 April 2017. The tweeted wedding photograph used in posts promoting the rumor even notes the location at which it was taken -- \"Trump International Hotel\":", "? Just Married! ?#HappilyEverNewman pic.twitter.com/P66lcrfSeT", "— OMAROSA (@OMAROSA) April 8, 2017", "Additionally, multiple individuals with certain knowledge of the situation told us that neither President Trump nor the Trump Organization covered the cost of the wedding, while the White House declined to respond to our request for comment.  Barring any additional information, this claim appears to be a fabricated one.", "Evon, Dan.  \"Was Donald Trump Never Accused of Racism Before Running Against Democrats?\"\r\n  Snopes.com.  18 May 2016.", "Lucey, Catherine; Haines Whack, Errin.  \"Trump-Omarosa Feud Rooted in Her Allegations of Racism.\"\r\n  The Associated Press.  15 August 2018.", "Keith, Tamara.  \"Omarosa Tells NPR She Heard Trump 'N-Word Tape,' Contradicting Her Own Tell-All Book.\"\r\n  National Public Radio.  10 August 2018.", "Mangan, Dan.  \"White House Says Omarosa's Book is 'Riddled With Lies' After She Claims Trump is 'Racist.'\"\r\n  NBC News.  10 August 2018.", "Singman, Brooke; Re, Gregg.  \"Omarosa Slammed for 'Disgraceful' Conduct After New Release of Secretly Taped Trump Call.\"\r\n  Fox News.  13 August 2018.", "Andrews-Dyer, Helena.  \"Inside Omarosa's Wedding Weekend in Washington.\"\r\n  The Washington Post.  9 April 2017.", "Manigault, Omarosa.   \"Executive Branch Personnel, Public Financial Disclosure Report.\"\r\n    U.S. Office of Government Ethics.   31 March 2017.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]