["About this rating", "On 2 May 2016, disreputable web site American News published an article with a sensational title (\"Obama To Replace National Bird The Bald Eagle With THIS\").  Despite the clickbait claim, the text of this article made no such argument:", "According to recent reports, our nation is about to get a new animal—and it’s quite a departure from the bald eagle, which has been the sole symbol of the United States for 234 years.", "Reports indicate that the National Bison Legacy Act has just been passed by Congress, and is expected to pass through the Senate next week. The act denotes the bison as America’s national mammal and a “historical symbol of the United States.”", "The eagle will reportedly still represent the nation, but it will no longer be the sole animal doing so. If passed, the bison will join the bald eagle, the oak, and the rose as a symbol for our country.", "Despite the title, the actual story was primarily based on factual information. The National Bison Legacy Act, which designated the bison as the national mammal of the United States, was passed by Congress at the end of April 2016. But while this legislation will give the United States its first national mammal, it will have no effect on the bald eagle's status as the United States' national bird, nor as its national symbol.", "The text of the bill stated that the purpose of the National Bison Legacy Act is to adopt \"the North American bison as the national mammal of the United States.\" The legislation made no mention of changing or replacing the bald eagle's status.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]