["“Voter Fraud in Wisconsin -- Massive Dump of Over 100,000 Ballots for Biden All the Sudden Appear Overnight,” reads the headline of a November 4, 2020 article by far-right website Gateway Pundit, before projections showed Biden winning the Midwestern state.", "The article is based on a graph from analysts at FiveThirtyEight (scroll down to 8:27 am), which shows a sudden surge in votes for Biden between midnight and 6:00 am on November 4. This led to speculation online that votes had been artificially added to his tally once everyone had gone to sleep.", "The graph was also shared on Instagram, Twitter, and Facebook alongside claims Democrats wanted to steal the election. Former Republican candidate and conservative commentator DeAnna Lorraine also shared the graph.", "However, the results shown in the graph do not point to fraud.", "The graph was published on FiveThirtyEight’s election live feed in the morning of November 4 by reporter Maggie Koerth, based on data from ABC News as of 6:23 am that day.", "As Koerth pointed out, the sharp increase in votes was due to Milwaukee absentee ballot results announced at 3:56 am on November 4.", "“There's nothing \"magical\" about these vote drops: counties simply released a large batch of results all at once,” Curt Villarosa, a publicity manager for ABC News, which owns FiveThirtyEight, told AFP in an email.", "“And these batches were NOT 100% Biden votes,” he added. “Behind the blue line, there is also a red line representing the thousands of votes Trump GAINED.”", "Indeed, the unofficial results for Milwaukee county, which includes the namesake city and 18 other municipalities, show that Biden secured 69.13 percent of those votes, while Trump received 29.28 percent, as of 3:56 am on November 4.", "“There were no ballots found in the middle of the night,” Wisconsin Elections Commission Director Meagan Wolfe said during a November 5 conference call with reporters.", "Such jumps in vote tallies do not always benefit Biden. “There are also counter examples, where Trump’s line shoots up suddenly when a favorable batch of results are reported,” ABC News’s Villarosa said.", "This tweet from FiveThirtyEight editor Laura Bronner shows that Trump took the lead due to similar vertical increases in Kansas (around 9:30 pm), Montana (midnight), and Ohio (around 10:00 pm).", "To be clear, *it doesn't matter* who is leading before all the ballots are counted. Biden led early on in Iowa, Kansas, Montana and Ohio, but when more votes were counted, they were called for Trump. Trump's claim of victory is outright wrong. Votes are still being counted. pic.twitter.com/h7TTej2ErD", "False claims of voter fraud are circulating across the US, spurred by Donald Trump, his campaign and supporters who have repeatedly made unfounded allegations of irregularities as Biden moves closer to victory.", "Officials faced a deluge of absentee and mail-in ballots spurred by the Covid-19 pandemic, causing delays in counting. President Trump has repeatedly and falsely claimed mail-in voting leads to widespread fraud.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]