["The origins, utility and ownership of potential coronavirus treatments are an increasingly discussed subject online, making the topic a ripe target for conspiracy theories.", "The drug remdesivir has emerged as a centerpiece of many theories claiming that various groups and individuals stand to benefit from the drug's use as a treatment for COVID-19.", "“Isn’t it just an interesting coincidence that Remdesivir is made by Gilead and is the 'CURE' for COVID-19 … . And here’s where it gets interesting China holds the patent on the drug through an agreement with Gilead’s drug patent sharing subsidy branch called UNITAID who has an office near Wuhan,” a graphic on Facebook shared more than 300 times reads.", "“And you’ll never guess who are the main financial investors in UNITAID…none other than George Soros, Bill & Melinda Gates, and WHO,” the post continues.", "Remdesivir is an antiviral drug developed by the firm Gilead Sciences, which maintains the U.S. patent on the drug as a coronavirus treatment. No Chinese institution has a recognized patent for the drug.", "Fact check: What's true and what's false about coronavirus?", "Remdesivir has been researched by Gilead as far back as 2009 as a treatment for viruses ranging from hepatitis C and respiratory syncytial virus to Ebola and now COVID-19.", "Gilead first received a patent for the drug as a treatment for Ebola in 2017. In fall 2015, Gilead applied for two patents for remdesivir, one for combating coronaviruses and another for filoviruses, the family of pathogens that includes Ebola. Both were approved in spring 2019.", "In April, a National Institutes of Health study found the drug to speed the recovery time of critically ill COVID-19 patients by 31%. Gilead has since said that, with federal assistance, it will begin deploying remdesivir to hospitals around the country.", "Gilead Sciences remains the only organization in the world entitled to intellectual property rights over remdesivir as a treatment for COVID-19.", "In January, Chinese researchers at the Wuhan Institute of Virology filed for a patent to use remdesivir as a treatment against COVID-19. At the time, no research had been published showing that remdesivir was effective. Even so, the drug was already being deployed for clinical trials in Wuhan and elsewhere.", "In early February, the Chinese company BrightGene Bio-Medical Technology also said that it had been approved to produce remdesivir by the Chinese government, though regulators eventually said the company had not received approval from the government nor Gilead Sciences.", "The Chinese government has not approved a patent for the drug, a move that would likely draw further criticism from the United States and others concerned about Chinese violations of international norms regarding intellectual property.", "Given the severity of the pandemic globally, however, several international groups have made repeated calls for the sharing of intellectual property rights relating to medicines and vaccines that can combat the new coronavirus.", "Video:What to know about antiviral drug remdesivir and COVID-19", "Unitaid is not a subsidiary of Gilead Sciences but rather a global health research initiative backed by the United Nations and World Health Organization to fund research projects combating a range of viruses.", "Founded by the French government in 2006, the group is headquartered in Geneva and funded by the governments of Brazil, Chile, France, Norway, South Korea, Spain and the United Kingdom, as well as the Bill & Melinda Gates Foundation.", "Unitaid has no financial ties to George Soros or the Open Society Foundations, which Soros founded and manages.", "The Bill & Melinda Gates Foundation also does not have a patent for the remdesivir and doesn't stand to profit from its use.", "Fact check:Dr. Anthony Fauci, Bill Gates won't profit from drug remdesivir", "In late March, Unitaid’s chair Marisol Touraine told the Financial Times that “extraordinary circumstances” warranted “extraordinary solutions,” while endorsing a WHO-backed plan for companies to voluntarily pool intellectual property governing any treatments or research that can be used in the fight against COVID-19.", "“I welcome his initiative & call for pooled rights to #COVID19 diagnostics, drugs & vaccines,” Tedros Adhanom, director-general of the World Health Organization, said of the proposal, which would allow companies around the world to share intellectual property rights and produce patented goods with the consent of other members in any such initiative.", "The strategy is an attempt to temper competition between firms and countries as the race to find treatments and a potential vaccine for the new coronavirus intensifies.", "On April 24, the WHO launched a cooperative initiative called “Access to COVID-19 Tools Accelerator,” which would coordinate and fund support for coronavirus research by member states and institutions. Unitaid and the Bill & Melinda Gates Foundation are listed as cosignatories.", "The United States and China are not members of the coalition, which may ultimately include a patent pooling resolution. Gilead Sciences has not licensed the production of remdesivir to any other firm as it continues to ramp up production of the drug.", "Fact check: Price didn't drive promotion of remdesivir over hydroxychloroquine", "No Chinese firm has an approved claim to a patent for remdesivir. No international organizations – including the Gates Foundations, Unitaid, the Open Societies Foundation, or the WHO – hold patents for the antiviral drug either. While there are efforts to pool patents for potential treatments, and thus alter the financial incentives of the parties to such pooling arrangements, the United States and China are not obligating their domestic firms to join these movements. Gilead Sciences, which owns the U.S. patent for promising COVID-19 treatment remdesivir, solely maintains the intellectual property rights to the drug. We rate this claim FALSE because it is not supported by our research.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app, or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook."]