["A tweet (here's an archive link) by popular political commentator Kayode Ogundamisi questioned why the UAE would punish law-abiding Nigerians after five of their compatriots were allegedly involved in a robbery in the country last week.", "On Facebook, another political commentator, Deji Adeyanju, shared a news item by the This Day newspaper headlined: \"UAE Suspends Three-month Tourist Visa to Nigerians after Dubai Robbery\".", "The post by the newspaper’s Facebook page and Adeyanju has been shared more than 1,000 times on the social network.", "The This Day article cited an Instagram post by Lagos-based travel operator Africholidays which said Nigerians were now restricted to one month, 96-hour and 48-hour tourist visas in the UAE. The post has more than 600 likes.", "The Herald newspaper also ran the story based on the Instagram post while another news source, AllAfrica, shared the THISDAY story on its verified Facebook page.", "Police in Sharjah, just north of Dubai, said on Sunday that five Nigerians were arrested on suspicion of robbing a Bureau De Change in the city. Local media reported that robbers had made away with 2.3 million dirhams ($626,000). The Nigerians were reported to have entered the Gulf country on March 18 and are accused of carrying out the robbery two days later.", "AFP contacted the visa processing office of the UAE in Dubai. An agent said Nigerian passports were still being processed like those from any other country, indicating no ban had been imposed. A UAE government source also confirmed to AFP that rumours of a ban on Nigerian three-month visas were “fake news”.", "On Thursday night, the UAE embassy in Abuja further announced that reports of visa restrictions were “inaccurate” and advised people of “the importance of sourcing news from its official channel”.", "Press Statement\n\n\t\tIn light of the press reports published today alleging that the UAE has suspended issuing tourist visas to Nigerian nationals, the UAE Embassy in Abuja announces that these news are inaccurate and stresses the importance of sourcing news from its official channel pic.twitter.com/Eu9UsNlIla", "Dubai is a popular vacation destination for Nigerians, drawn by luxury hotels and shopping opportunities, good weather and strong transport links.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]