["About this rating", "Jared Kushner’s brother, Joshua, is co-founder of the health insurance start-up Oscar, which recently released an online tool to locate COVID-19 testing centers in some areas. At least in the past, Jared Kushner has had a financial interest in Oscar.", "Oscar is not involved in the actual process of COVID-19 testing or in the manufacturing of such a test. Oscar created a website — open to the public — that screens users to see if they qualify for a test and then provides a list of testing sites nearby.", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "Compared to the output of most other developed countries, the United States' ability to test for COVID-19, the disease caused by the novel coronavirus, has been extremely limited. This reality has led to rumors that President Donald Trump's administration, or some of its members, have a financial interest in promoting specific tests as opposed to others that would be more widely available or more easily distributed.", "One claim that has emerged in this vein came from a report by Raw Story that asserted \"the Kushner family is trying to cash in on the pandemic that could kill millions of us.\" The basis for this claim concerns the health insurance startup Oscar co-founded by Jared Kushner’s brother, Joshua Kushner. Jared Kushner is the son-in-law of and special adviser to Trump.", "On March 13, 2020, Oscar announced that it would be launching a testing-center locator for COVID-19:", "Today, Oscar, a tech-driven health insurance company, launched the first testing center locator for COVID-19 in the U.S., featuring more than 100 centers today. It is accessible to the general public and more testing centers are being added every day.", "However, the details of Oscar's testing locator have been described incorrectly in several viral social media posts alleging profiteering from the Kushners during the coronavirus pandemic. A well-shared post by a user named \"Boston Judy,\" for example, asserted that \"we didn't have testing because the Trump family circle wanted to wait till they could make a profit.\"", "Even if this assertion had merit, the actions Oscar took merely help locate unaffiliated testing centers. As an insurance company, Oscar does not manufacture, perform, analyze, or sell any actual COVID-19 test. Further, the test-center locator that Oscar developed is open to the general public and is not limited to people who get insurance through Oscar. Once a user has taken a short survey, the locator will provide the closest locations for testing in areas in which they operate. While the service also acts as a promotion for the company, it can serve as a testing center locator for any interested party.", "\"Boston Judy\" later clarified that Oscar was not producing tests, but that the company would get to \"bill the feds for evaluating people for COVID and referring them to a testing center if they meet the criteria [for testing].\" While the legislation that would allow for such a reimbursement likely will include a fund for covering the cost of these tests, the legislation has not yet been finalized, and it's unclear that it would really be a windfall for Oscar, either.", "On March 13, 2020, U.S. House Democrats and the White House reached a deal on a package of legislation that included a requirement that insurance companies cover the full cost of COVID-19 with no cost sharing. As described by the Brookings Institute, this legislation, if and when it is passed by the Senate and signed by the president:", "Would offer financial support to state governments by temporarily increasing the share of Medicaid spending financed by the federal government, require almost all forms of health insurance to cover COVID-19 testing without cost-sharing, and create mechanisms to pay for COVID-19 testing for uninsured people.", "In other words, while the government will likely be subsidizing insurance companies like Oscar, they are doing so to cover losses incurred by the requirement for full reimbursement to members. These laws, and the federal reimbursement they would authorize, would apply to any health insurance company in America, not only Oscar.", "Joshua Kushner co-founded Oscar in 2012. His venture capital firm, Thrive Capital, holds a significant ownership share. According to financial-disclosure forms released by Jared Kushner and his wife, Ivanka Trump, covering the year 2018, the couple owned and received profit from shares of Thrive:", "This document also appears to assert that the couple divested from Thrive during the 2018 financial year:", "Under federal law, executive branch employees are eligible to defer paying capital gains taxes on investments sold to comply with conflict of interest requirements. To take advantage of this benefit, the employees must obtain a Certificate of Divestiture from the Office of Government Ethics prior to selling the asset. Jared Kushner received a certificate of divestiture for, among other things, four Thrive-associated funds in February 2017.", "In a narrow legal sense, this removed the conflict of interest associated with his financial ownership in his brother’s companies, according to Virginia Canter, who serves as chief ethics counsel for the nonpartisan Center for Responsibility and Ethics in Washington (CREW), which also provided us with Kushner’s Certificate of Divestiture. But, she told us, his divestment does little to alter the appearance of a conflict of interest or reduce the risk of potential corruption, especially if he is using his public office to promote the private interests of his brother or giving him “preferential access.” The similarities between the Trump Administration’s announcement of a website designed to locate COVID-19 testing centers and the website released by Oscar have been a source of speculation about undue access on Joshua Kushner’s part.", "That being said, the assertion that the Kushners as a family are involved in the business of COVID-19 testing is not entirely accurate. The company's coronavirus response so far is limited to an online form that allows users to find a testing location if their symptoms call for it. Health insurance companies are likely to be reimbursed for covering the cost of COVID-19 testing once legislation is passed, but this would apply to all insurance providers, not just Oscar. For these reasons, we rank the truth of this claim as a \"Mixture.\"", "Kenen, Joanne.   \"How Testing Failures Allowed Coronavirus to Sweep the U.S.\"\r\n    Politico.   6 March 2020.", "Okeson, Sarah.   \"Here’s How the Kushner Family Is Cashing in on the Coronavirus.\"\r\n    Raw Story.   15 March 2020.", "Oscar Health.   “Oscar Launches First Testing Center Locator for COVID-19.\"\r\n    Accessed 13 March 2020.", "Okeson, Sarah.   \"Here’s How the Kushner Family Is Cashing in on the Coronavirus.\"\r\n    Raw Story.   15 March 2020.", "Fiedler, Matthew, et al.   \"What are the Health Coverage Provisions in the House Coronavirus Bill?\"\r\n    Brookings Institute.   13 March 2020.", "Bertoni, Steven.   \"Oscar Health Gets $400 Million And A $2.7 Billion Valuation from Fidelity.\"\r\n    Forbes.   22 February 2016.", "U.S. Office of Government Ethics.   \"Jared Kushner — Executive Branch Personnel Public Financial Disclosure Report (OGE Form 278e) - 2018.\"\r\n    Accessed 16 March 2020.", "U.S. Office of Government Ethics.   \"Ivanka Trump — Executive Branch Personnel Public Financial Disclosure Report (OGE Form 278e) - 2018.\"\r\n    Accessed 16 March 2020.", "Update [18 March 2020]: Updated to include documentation of Kushner's Certificate of Divestment and added comments from Virginia Canter.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]