["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "While announcing her child care plan, Georgia Democratic gubernatorial candidate Stacey Abrams claimed that the average cost of childcare in Georgia is more than the average in-state tuition.", "The claim first appeared on Nov.15 in a Tweet promoting \"The Bold Action for a Bright Future Plan\".", "\"The average cost for infant care in GA is almost $7,700/yr – more than average in-state college tuition,\" read the post.", "The Abrams campaign pulled this information from the Economic Policy Institute, a left-leaning think tank that researches economic trends. The EPI's data says that in Georgia, infant care costs an average of $7,644 a year, 15.6 percent more than the state’s annual average in-state tuition.", "The EPI’s estimated infant costs come from Child Care Aware of America’s 2015 \"Parents and the High Cost of Child Care\" report. The report calculates the averages of two types of infant care, care offered at a facility and care offered at someone’s home.The $7,644 used by the EPI is the more expensive type of infant care, care offered at a facility. According to the report, the average cost of childcare provided in a caregiver’s home in Georgia is $5,980 a year.", "According to EPI, Georgia's average in-state tuition estimate was taken from a 2014 survey conducted by the National Center of Education Statistics, a division of the U.S. Education Department. The total cost of tuition and required fees in a public university in Georgia averages out to $6,614 a year.", "So Abrams' number is accurate if the comparison is between child care at a facility and in-state college tuition. But it’s not correct if the comparison is with child care provided in a home.", "Abrams is not the first, and possibly not the last politician to make this type of comparison. Back in 2014, PolitiFact checked President Barack Obama's claim that in 31 states \"decent\" childcare cost more than college tuition. Back then, Obama also used Child Care Aware of America as a source. We rated his claim as Mostly True.", "Abrams tweeted, \"The average cost for infant care in GA is almost $7,700/yr – more than average in-state college tuition.\"", "Abrams is correct if the comparison is between child care at a facility and college tuition, at $7,644 vs. $6,614. But child care offered in someone’s home -- at $5,980 -- is less that in-state college tuition.", "The statement is partially accurate but leaves out important facts. We rate this statement Half True.", "Stacey Abrams, Twitter,  Nov. 15, 2017.", "Abram’s \"The Bold Action for a Brighter Future\" child care plan, accessed Nov. 20, 2017", "EPI, The Cost of Childcare in Georgia, accessed Nov. 20, 2017.", "Email interview with Priyanka Mantha, Director of Communication for Stacey Abrams for Governor, Nov. 20, 2017.", "Email interview with Dan Crawford, Media Relations Director for the Economic Policy Institute, Nov. 20, 2017.", "Child Care Aware of America, \"Parents and the High Cost of Child Care 2015 Report\"", "National Center for Education and Statistics, \"Average undergraduate tuition and fees and room and board rates charged for full-time students in degree-granting postsecondary institutions, by control and level of institution and state or jurisdiction: 2012-13 and 2013-14\", accessed Nov. 21, 2017.", "PolitiFact, \"Barack Obama says, 'In 31 states, decent child care costs more than college tuition'\", Jun. 27, 2014.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]