["By Robert Farley", "Posted on May 6, 2016 | Updated on June 17, 2016", "Donald Trump continues to make the puffed-up assertion that Russian President Vladimir Putin called him a “genius.” Russian language experts tell us that Putin described Trump as “colorful” or maybe “bright,” depending on how one translates Putin’s words, but he never called Trump a genius.", "Glenn Kessler of the Washington Post Fact Checker wrote on May 3 that Trump’s repeated claim that Putin called him a genius was based on a mistranslation of Putin’s words. Nonetheless, Trump continued to mischaracterize Putin’s praise the following day in an interview with CNN’s Wolf Blitzer.", "“So far, we’re off to a good start,” Trump said of his relationship with Putin. “He said ‘Trump is a genius,’ OK?”", "Trump frequently claims that Putin called him a genius. He said it in an interview with Bill O’Reilly on Fox News on April 28. And in an April 29 radio interview with Michael Savage. And during a town hall interview with Fox News’ Sean Hannity on April 4. And during a campaign event in South Carolina in February.", "Trump is basing his claim on comments Putin made during a press scrum in December, when Putin was asked what he thought about Trump.", "According to a translation by Russia Insider, which uploaded the video, Putin responded, “He’s a very colorful person. Talented, without any doubt. But it’s not our affair to determine his worthiness — that’s up to the United States voters. But he is absolutely the leader in the presidential race. He wants to move to a different level of relations, to more solid, deeper relations with Russia. And how can Russia not welcome that — we welcome that. As for his internal political issues and the turn of speech which he uses to raise his popularity, I repeat, it’s not our affair to evaluate them.”", "It’s the word “colorful” in the first sentence of that translation that is at issue here.", "The Washington Post‘s Kessler found various media outlets provided slightly different translations of it. Some said Putin called Trump “colorful,” others “lively” or “flamboyant.” One outlet, the Hill, translated Putin’s praise of Trump as “really brilliant.”", "The Guardian newspaper initially wrote that Putin called Trump “bright,” but then revised its item with this explanation: “An earlier version quoted Putin as saying ‘bright and talented.’ To clarify: The word he used was ‘yarkii’ (яркий), which can mean bright or brilliant, but not in the sense of intelligent; it can also be translated as colorful, vivid or flamboyant.”", "Of note, none of those news reports say Putin called Trump a “genius.”", "We reached out to several Russian language experts, and they all agreed that Trump was inflating Putin’s rather guarded praise. But there is some disagreement about the precise meaning of Putin’s phrase.", "“The adjective “яркий” in this context is a carefully selected word and it means here ‘not ordinary’ or ‘impressive,’ ” Constantine Muravnik, a professor in the Department of Slavic Languages and Literatures at Yale, told us via email. ” ‘Extraordinary,’ ‘remarkable,’  or ‘outstanding’ would be too positive, ‘colorful’ or ‘eccentric’ – too negative, ‘brilliant’ or ‘bright’ —  simply wrong. This is why Putin added a phrase, ‘talented beyond any doubt,’ just to push the otherwise neutral and ambiguous word in a slightly more positive direction. He also compensated this ambiguity with his overall positive and respectful intonation.”", "“Trump is slightly twisting his words by adding the connotation of admiration always associated with the word ‘genius,’ ” Muravnik added. “There’s no admiration in Putin’s words, just a respectful acknowledgement of some of his ‘impressive’ traits. Also, Putin emphatically, even if a bit slyly, refrained from any comments on the internal US affairs.”", "Edna Andrews, professor of linguistics and cultural anthropology at Duke University, told us Putin definitely did not call Trump a genius.", "“I believe ‘colorful’ is a very good translation of the use of this term in the given context,” Andrews said. “Putin also clearly stated that it was not his business to get involved in the choice of a U.S. elected official, but he did welcome a deepening of US/Russian relations.”", "“Putin called Trump ‘bright,’ ” Ilya Vinitsky, chair of the Department of Slavic Languages and Literature at the University of Pennsylvania, told us via email. “Genius in Russian is ‘genii.’ Putin didn’t use this word.”", "And finally, Boris Gasparov, a professor of Russian and East European studies at Columbia University, told us that “if he [Putin] said яркий it means, applied to a politician, definitively a compliment, although by far not such ravishing as that of the ‘genius.’ It does not mean ‘colorful’ (that is, it is by no means tinged with ambiguity), but it is not entirely unqualified either. The meaning lingers somewhere between ‘standing out,’ ‘unusual,’ ‘bold,’ ‘unpredictable, but hopefully for the better.’ ”", "So there is a bit of disagreement among Russian language experts about the precise translation of Putin’s words. But not one of them agreed with Trump’s translation of “genius.”", "Update, June 17, 2016: In a speech in St. Petersburg, Russia, on June 17, Putin clarified that he had only described Trump as “flamboyant.” According to Reuters, Putin added, with a smile, “He is, isn’t he? I did not give any other assessment of him.”", "https://www.sharethefacts.co/share/3885c8ff-7435-4a01-b64f-8fdb66bd66d1", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]