["About this rating", "Club 33, open only to members and their guests, has been a part of New Orleans Square since 1967.", "Originally intended as a private facility where Walt Disney could entertain park sponsors and lessees, Club 33 did not open until several months after Disney's death. The club's facilities were made available to the public through limited memberships, and Club 33  operated unobtrusively in Disneyland's New Orleans Square -- until the advent of social media made information about what was once a somewhat-secret facility easy to find. Club 33 is also the only place inside the park itself where alcohol is available, although properties such as California Adventure and Downtown Disney serve alcoholic beverages.", "In July 2010, the Disney Parks blog mentioned the establishment in two Disney history items. The site published a lengthy Club 33 profile in August 2011, providing a \"brief history\" of the venue:", "According to Disneyland Food and Beverage General Manager Matt Gray, Walt Disney was attempting to attract new sponsors for Disneyland park while he was at the New York World’s Fair in 1964. He noticed the fair had executive lounges for corporate sponsors and felt that Disneyland should offer similar amenities. He envisioned an exclusive setting – elegant, featuring fine cuisine and a uniquely Disney atmosphere. Matt says that it was actually one of the Disneyland sponsors who suggested that club invites be extended to select individuals.", "... The club opened at number 33 Royal Street in New Orleans Square on June 15, 1967 – sadly, six months after Walt Disney passed away. It would go on to be known as Club 33 – the most exclusive address in all of Disneyland.", "In 2012, the blog announced that Club 33's waiting list was open to a \"limited number\" of new applicants:", "As we announced earlier today, a limited number of new members will be offered Club 33 membership in honor of the 45th anniversary of the Club (June 15 [2012]) and the completion of the five-year expansion of the Disneyland Resort. Those interested in Club 33 membership may request more information by sending an email to club33interest@disneyland.com.", "LA Weekly described Club 33 as quite possibly \"Disneyland's worst kept secret\" in 2013, reporting that non-members could access the venue in one of two ways (and confirming prices were steep to those with connections):", "The Club is open for lunch and dinner and costs approximately $100, which does not include entrance to the theme park -- that costs another $100 ... There are two ways to get into the club: You or your company must have a membership, or you must know a member willing to personally book you a table as one of their guests (which is how we got in).", "According to the staff, memberships are limited to around 500 members to keep crowds to a minimum. Unfortunately with an ever-growing wait list, new applicants can be on hold for about 14 years just for the chance to pay the exorbitant $25K initiation fee with an additional $10K annual membership fee. Applicants must also pass a rigorous background check. Even money does not guarantee you an invitation.", "In 2016, an extensive profile of Club 33 was published by Insider. Several details and images for the piece were gleaned from an Instagram account (@disneyland33member), operated by a Club 33 member and devoted to documenting its offerings. And in April 2017, a Disney spokesperson confirmed to the Orlando Sentinel that four additional Club 33 locations were set to open (in addition to versions at Tokyo Disneyland and Shanghai Disneyland).", "On 19 December 2017, outlets reported a lawsuit filed against Club 33 (following a similar suit brought in 2015) which provided \"a rare peek at the strict rules and code of conduct for members of the exclusive club, which has operated in Disneyland’s New Orleans Square since 1967\":", "An Arizona couple who joined Club 33 in 2012 sued the theme park in Orange County Superior Court, saying Disneyland revoked their membership because they had been speaking out about bullying and harassment of other members at the club.", "Disneyland rejected the allegations, implying that the couple, Scott and Diana Anderson, were kicked out because they had misbehaved.", "Although Club 33 is no longer the enigma it once was, widespread documentation of the venue didn't eliminate its allure entirely. The \"secret spot\" remained a hot topic on Disney-centric blogs and forums, and entry to the expanding number of properties still required hefty fees and connections to those wishing to experience it firsthand.", "Bevil, Dewayne.   \"Club 33 Coming To Walt Disney World's Theme Parks.\"\r\n    Orlando Sentinel.   13 April 2017.", "Bricker, Tom.   \"Disneyland Bar Crawl Guide.\"\r\n    DisneyTouristBlog.   Accessed 20 December 2017.", "Glover, Erin.   \"Inside Club 33 At Disneyland Park.\"\r\n    Disney Parks Blog.   18 August 2011.", "Glover, Erin.   \"A Look Inside The Exclusive 1901 In Carthay Circle Theatre At Disney California Adventure Park.\"\r\n    Disney Parks Blog.   4 May 2012.", "Hang, Kristie.   \"Club 33: Disneyland's Secret $25,000 Dining Club.\"\r\n    LA Weekly.   13 March 2013.", "Johnson, Kevin.   \"No Mickey Mouse Club Here.\"\r\n    Los Angeles Times.   8 September 1991   (p. B1).", "Koenig, David.   Mouse Tales: A Behind-the-Ears Look at Disneyland.\r\n    Irvine, CA: Bonaventure Press, 1994.   ISBN 0-9640605-5-8   (pp. 53-58).", "Mather, Kate.   \"Disney To Add Members To 'Secret' Club 33 And Open New Club.\"\r\n    Los Angeles Times (L.A. Now).   7 May 2012.", "Martin, Hugo.   \"Man Sues Disneyland For Ending Membership To Exclusive Club 33.\"\r\n    Los Angeles Times.   24 June 2015.", "Martin, Hugo.   \"Club 33 Members Sue Disneyland, Saying They Were Booted For Speaking Out On Harassment.\"\r\n    Los Angeles Times.   19 December 2017.", "Oswald, Anjelica.   \"What It's Like Inside The Secret, Members-Only Club Hidden In Disneyland.\"\r\n    Insider.   28 July 2016.", "Perko, Marko.   Did You Know That . . .?\r\n    New York: Berkley Books, 1994.   ISBN 0-425-14343-0   (pp. 234-236).", "Poundstone, William.   Bigger Secrets.\r\n    Boston: Houghton Mifflin, 1986.   ISBN 0-395-45397-6   (pp. 221-222).", "Club 33 Information Sheet and Membership Application.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]