["\"BREAKING: My Source with whom I have great trust says MN AG Ellison is coordinating w/Antifa... Antifa has been bussed in and are being paid $20/hour with BONUSES paid to those looting and destroying. Soros,\" reads a May 29, 2020 post on Facebook.", "The text is accompanied by an image of Ellison holding a copy of “Antifa: The Anti-Fascist Handbook.”", "The claim also appears on Facebook here, here and here and on Instagram here.", "Floyd, 46, died when a white police officer knelt on his neck for nearly nine minutes in Minneapolis, Minnesota, sparking days of largely peaceful demonstrations against police brutality toward black Americans.", "Addressing the claim that Ellison is coordinating with Antifa, the attorney general’s Deputy Chief of Staff John Stiles said in an email that the “allegation is pure fantasy: it is completely fabricated out of whole cloth and contains no facts whatsoever.”", "Open Society Foundations, a philanthropic organization funded by Soros, rejected the claim about its founder.", "“We don’t fund Antifa and denounce violence of any kind, against people or property,” an Open Society Foundations spokesman said by email.", "The Foundations also said on Facebook: “We do not pay protesters. Neither does our founder George Soros. Claims that we do serve to delegitimize those who are exercising their Constitutionally-protected right to protest peacefully and petition their government for redress of grievances.”", "A search of the Foundations’ database detailing the grants it has awarded in 2020 does not show support for protest actions.", "And Lieutenant Gordon Shank said by email that Minnesota State Patrol is “not aware of any occurrence” related to the claims in the Facebook posts.", "The posts appear to be screenshots of a tweet from the @sevareidcbsnews Twitter account, giving the impression that CBS reported the information.", "But Eric Sevareid of CBS News died in 1992. The account bearing his name has been suspended for violating Twitter’s platform manipulation and spam policy, a company representative told AFP in an email.", "However, the image accompanying the false posts that shows Ellison holding the book on Antifa is legitimate.", "Ellison, then US Representative for Minnesota’s 5th Congressional District, tweeted the photo on January 3, 2018 with the caption: “At @MoonPalaceBooks and I just found the book that strike fear in the heart of @realDonaldTrump.”", "The tweet has since been deleted, but it is archived here.", "Stiles said that “as Attorney General Ellison has said on multiple occasions, he picked up a book in a Minneapolis bookstore that had a title that appealed to him and tweeted it before he had ever even heard of the anti-fascist organization.”", "Mark Bray, a historian at Rutgers university and author of “Antifa: The Anti-Fascist Handbook,” which Ellison is holding in the photo, told AFP that taking money to protest would be antithetical to anti-fascist creed.", "“They wouldn't accept money from millionaires and billionaires because they oppose millionaires and billionaires,” Bray said by phone.", "“The whole ‘George Soros is behind it’ is an anti-Semitic far-right conspiracy theory that’s used to slam every kind of left protest there is all over the world,” he said.", "AFP Fact Check has debunked two other Antifa and George Soros-related claims here and here, as well as other false information related to Floyd and the protests here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]