["By Angelo Fichera", "Posted on January 24, 2019", "Facebook posts claim that Martin Luther King Jr. was a Republican. That’s a longstanding, unsupported claim that his children have denied.", "On the week of Martin Luther King Jr. Day, and days after what would have been his 90th birthday, social media posts have revived an evidence-free claim about the civil rights icon.", "“MLK was Republican,” one such post reads, “and would’ve MAGA’d today.”", "Along with a doctored photo of King wearing a hat that reads, “Make American Great Again” — President Donald Trump’s campaign slogan — the post repeats the unsupported claim that King was a member of the GOP. Among those to previously debunk it, PolitiFact thoroughly dissected the claim in 2011.", "In reality, transcripts show King often openly rejected the party binary.", "In a 1956 speech, for example, he said: “Actually, the Negro has been betrayed by both the Republican and the Democratic Party.” The same year, in a letter citing his uncertainty about for whom he would vote for president, he wrote that, “In the past I have always voted the Democratic ticket.”", "And in 1958, he noted: “I don’t think the Republican party is a party full of the almighty God nor is the Democratic party. They both have weaknesses. And I’m not inextricably bound to either party.”", "The unsupported assertion that King was a Republican has cropped up numerous times, sometimes citing King’s niece, Alveda King, who once declared her uncle was a Republican.", "But Alveda King in a 2013 Newsmax column said that her earlier statement was made “without having all the facts” and that “Uncle M. L. tended to vote Democrat, but remained independent because he found weaknesses in both parties.”", "Likewise, two of King’s children, Martin Luther King III and Bernice King, have both denied that their father was a Republican.", "In a statement provided to the Associated Press in 2008, King III said: “It is disingenuous to imply that my father was a Republican. He never endorsed any presidential candidate, and there is certainly no evidence that he ever even voted for a Republican. It is even more outrageous to suggest that he would support the Republican Party of today, which has spent so much time and effort trying to suppress African American votes in Florida and many other states.”", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on the social media network.", "“‘Desegregation and the Future,’ Address Delivered at the Annual Luncheon of the National Committee for Rural Schools.” The Martin Luther King, Jr. Research and Education Institute, Stanford University. Accessed 24 Jan 2019.", "Farrington, Brendan. “Group claims MLK was a Republican.” Associated Press. 16 Jul 2008.", "“Interview at Bennett College.” The Martin Luther King, Jr. Research and Education Institute, Stanford University. Accessed 24 Jan 2019.", "King, Alveda. “Put Political Strife Out to Pasture.” Newsmax. 14 Oct 2013.", "Letter to Viva O. Sloan. Martin Luther King, Jr. The Martin Luther King, Jr. Research and Education Institute, Stanford University. Accessed 24 Jan 2019.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]