["“Lo Behold! #Church allegedly behind the divisive scheme of separating #Lingayats from #Hindus. A leaked of email supposedly sent by SecGen CBCI to Archbishop Bangalore….this says much”. The tweet by a twitter user Swami Nishchalanand (@swamijitweets) was also retweeted by BJP leader and Rajya Sabha MP, Subramanian Swamy.", "The email attached to the tweet was titled ‘Our Prayers have been answered’. The email addressed to Archbishop Bangalore from His Eminence Oswald Cardinal Gracias, Secretary General of Catholic Bishop’s Conference of India (CBCI), celebrated the granting of separate religious status to Lingayats and urged him to work hard for the “rich harvest of souls in Karnataka.”", "The letter circulated by him had some fairly outlandish points that perhaps only the most gullible would believe as true. On its own, it may not have gained much traction, but it got circulated widely as it was retweeted by Subramanian Swamy who has close to 7.3 million followers in Twitter. Since the user @swamijitweets has deleted his tweet, the retweeted tweet cannot be seen on Subramanian Swamy’s Twitter timeline anymore. However, Swamy’s tweets get pushed to his official Facebook page which still carries evidence of him having retweeted the tweet.", "Retweeted Swami Nishchalanand (@Swamijitweets):", "Lo Behold! #Church allegedly behind the divisive scheme of separating…", "Posted by Dr. Subramanian Swamy on Wednesday, 9 May 2018", "A website called rightactions.in also published the above claim and was shared over 5000 times on Facebook including Francois Gautier of the fake Nostradamus claims fame.", "Leaked email proves that the Lingayat separation was all master minded by christian groups", "…", "Posted by Francois Gautier on Wednesday, May 9, 2018", "Bishop Theodore Mascarenhas, Secretary General, Catholic Bishops Conference of India dismissed the claims as fake and diabolic.", "Absolutely malafide malicious and diabolic. So sad that people can stoop to this level to malign others https://t.co/tJKp4wJQwX", "— Catholic ChurchIndia (@indianbishops) May 9, 2018", "Though initially @swamijitweets claimed that his sources were reliable, the original tweet was deleted by him after bishop Mascarenhas issued an official clarification and warned possible legal action against those involved in making and promoting the letter.", "Yes, the source is very reliable.", "— Swami Nishchalanand (@Swamijitweets) May 9, 2018", "In his letter, bishop Mascarenhas stated that “a very malicious fake letter is being circulated in social media and in Karnataka on the eve of the elections”. He added that “the false letters makes wild allegations about the Church involvement in the Lingayat issue”. The response of the bishop is reproduced below.", "pic.twitter.com/xrBiNA2tCV", "— Catholic ChurchIndia (@indianbishops) May 9, 2018", "There were several elements about the fake letter that gave a clue that it was nothing more than pure malice. It is perhaps only in the wonder world of fake news peddlers that bishops email each other rejoicing and setting targets to harvest souls. Here are some inconsistencies in the letter, some of which were pointed out by Bishop Mascarenhas:", "Bishop Mascarenhas asserted that “Catholic Bishops Conference of India or Cardinal Gracias will never ever indulge in divisive tactics as indicated in that letter.” He ended his letter saying “May God bless Karnataka and may God bless our beloved country, India. Jai Hind”. We have seen in the last few weeks how the Karnataka has been the target of the fake news brigade. Discerning social media users are now well familiar with their divisive strategies.", "Donate Now", "Follow @free_thinker", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]