["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Employees at the Volkswagen plant in Chattanooga, Tenn., assemble Passat sedans on July 12, 2013. (AP/Erik Schelzig)", "During a June 28 visit to Mount Pleasant, Wis. -- the site of a planned Foxconn manufacturing facility -- President Donald Trump defended his hard line on international trade, which has included the imposition of tariffs against both historical friends and adversaries.", "At one point, he singled out German cars.", "\"The European Union … they send us Mercedes, they send us -- by the millions -- the BMWs -- cars by the millions,\" Trump said.", "This assertion is wrong. (The White House did not respond to an inquiry.)", "We turned to data from the Center for Automotive Research, an Ann Arbor, Mich., think tank.", "In 2017, the Center for Automotive Research found, BMW sold 354,110 cars in the United States, while Daimler sold 375,311, mostly Mercedes-Benzes. That’s 729,000 vehicles -- not even one million, much less \"millions.\"", "Volkswagen, another German automaker that Trump didn’t mention by name but which is also based in the European Union, sold 625,068 cars in the United States that year.", "Adding the three companies together, that works out to 1.35 million German cars sold in the United States last year.", "That’s not exactly \"millions,\" either -- but the problem with Trump’s assertion runs deeper than that.", "The big three German automakers all have operations in the United States as well as overseas. So care needs to be taken to clarify where the German cars are made before they are labeled \"imports.\"", "BMW’s largest assembly plant in the world is in Spartanburg, S.C., while Mercedes has a facility in Tuscaloosa County, Ala., and Volkswagen has a factory in Chattanooga, Tenn. Production levels for German cars in the United States have risen in recent years, with some of those cars sold in the United States and some exported overseas.", "When we inquired with Edmunds.com, an automotive website and analytical group, they sent us data showing that about 330,000 of the 1.35 million German cars sold in the United States in 2017 had been built here. That leaves about 980,000 German cars built elsewhere but sold in the United States.", "To take one example, according to the Center for Automotive Research, BMW made 371,000 cars in the United States in 2017, exported 272,000 of these, sold the remaining 99,000 U.S.-built cars in the U.S. market, and imported roughly 255,000 cars for U.S. buyers in 2017.", "\"For sure, the raw number of imports are nowhere near ‘millions,’ \" said Jacob Funk Kirkegaard, senior fellow at the Peterson Institute for International Economics.", "German carmakers didn't just ship cars from Germany, but also from Mexico, Slovakia, the United Kingdom, South Africa, Hungary, Spain, Brazil, Argentina, France and Italy, said Kristin Dziczek, vice president for industry, labor and economics at the Center for Automotive Research. A little less than half of German car imports to the United States actually came from Germany directly, she said.", "It’s also worth noting that even U.S. carmakers import cars into the United States. In fact, collectively, they import cars on a larger scale than the German companies do.", "Specifically, Ford imported 100,000 cars into the United States on net, while General Motors imported 760,000 cars on net and Fiat-Chrysler imported 920,000 on net.", "For the record, sales by the the three German carmakers are modest in the U.S. market, accounting for 8.5 percent of all sales in 2017, according to the Center for Automotive Research. By contrast, the Big Three U.S. automakers accounted for about 48 percent of U.S. sales that year.", "Meanwhile, Trump’s formulation also leaves out the economic benefits of having German automakers operating factories in the United States.", "Collectively, these plants employ an estimated 50,000 workers, and they have spillover effects on the local, regional and national economies.", "\"American workers are building some of the most popular vehicles with U.S. shoppers: SUVs,\" said Ivan Drury, senior manager of auto industry analysis with Edmunds.com. \"As more and more Americans opt to trade in their sedans for an SUV, the percentage of U.S.-built German vehicles on the road is on the rise.\"", "Trump said, \"The European Union … they send us Mercedes, they send us -- by the millions -- the BMWs -- cars by the millions.\"", "Together, Mercedes, BMW and Volkswagen imported less than a million cars into the United States in 2017, not \"millions.\"", "More importantly, Trump ignores that a large proportion of German cars sold in the United States were also built here, using American workers and suppliers whose economic fortunes are boosted by Germany’s carnakers. Other U.S.-built German cars were sold as exports.", "We rate the statement False.", "Donald Trump, remarks in Mount Pleasant, Wis., June 28, 2018", "BMW Group, \"BMW Manufacturing Continues as Largest U.S. Automotive Exporter,\" Feb 13, 2018", "CNNMoney.com, \"Made in America: The German cars Trump doesn't want,\" June 12, 2018", "CNBC, \"Trump's tariff threat on European cars could spell big trouble for Germany,\" March 5, 2018", "Email interview with Ivan Drury, senior manager of auto industry analysis with Edmunds.com, June 29, 2018", "Email interview with John Vignolo, assistant director for global media relations at Ernst & Young LLP, June 29, 2018", "Email interview with Jacob Funk Kirkegaard, senior fellow at the Peterson Institute for International Economics, June 29, 2018", "Email interview with Kristin Dziczek, vice president for industry, labor and economics at the Center for Automotive Research, June 29, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]