["About this rating", "The claim that \"Liquor and wine are illegal in the U.S. unless they are radioactive\" stems from an excerpt that appears in multiple books authored by Berkeley physicist Richard Muller, including \"Energy for Future Presidents\". Muller also posted the text of this claim on a Quora thread “What are some mind-blowing facts that sound like BS but are actually true?”", "Here are the points Muller laid out in that post:", "Liquor and wine is [sic] illegal in the U.S. unless it is radioactive. When tested, drinking alcohol is required to have at least 400 radioactive decays per minute for each 750 ml.", "Explanation: The United States government has decided that alcohol for consumption must be made from “natural” materials, such as grains, grapes, or fruit. That rules out alcohol made from petroleum. [...]", "How can you tell the difference between natural alcohol and alcohol made from petroleum? There’s no chemical difference. The United States Bureau of Alcohol, Tobacco, Firearms and Explosives, charged with enforcing the natural alcohol rule, has only one reliable test: check for radioactivity", "Natural alcohol gets its carbon from plants; the plants got the carbon from atmospheric carbon dioxide. Atmospheric carbon dioxide is radioactive because of the continued bombardment of cosmic rays – particles coming from space that collide with nitrogen molecules and turn it into C-14, radiocarbon. Only one atom in a trillion carbons in the atmosphere is radiocarbon, but that’s enough to be detectable. (One of the authors of this book, RM, invented the most sensitive way to detect C-14, called “Accelerator Mass Spectrometry.”)", "Petroleum was also made from atmospheric carbon, but it was buried hundreds of millions of years ago, isolated from the radioactive atmosphere. Radiocarbon has a half-life of about 5700 years, and after a hundred million years, there is nary an atom of C-14 left.", "The science in the above-stated claim is an accurate explanation for why alcohol derived from plants would be radioactive whereas synthetic alcohol derived from petroleum products would not.", "What is not supported by any available evidence are the two non-scientific claims associated with this story: That synthetic alcohol is prohibited in beverages and that they federal government tests beverages for compliance based on this law. The only official policy statement that directly touches this topic is a memo, termed a “compliance policy guide” issued in response to a 1957 internal inquiry between the Alcohol, Tobacco and Firearms taxation and enforcement offices:", "Questions have been raised as to whether we can or should continue to consider synthetic alcohol unsuitable for food use. In order to secure more information, we wrote to the Alcohol, Tobacco and Firearms Division, Internal Revenue Service. Their reply included the following paragraphs:", "Presently, we authorize the manufacture of vinegar from ethyl alcohol synthesized from natural gas or petroleum derivatives. It is our opinion that most of the distilled spirits used in the production of vinegar are derived from natural gas and petroleum. When such alcohol is used in the production of vinegar, we would consider any reference to 'grain alcohol' or 'neutral grain spirits' would be misleading for the alcohol and also the name 'grain vinegar' would be misleading, except for connoting strength, e.g., 40-grains.", "When alcohol is used in the production of beverage products, our regulations require that the source of the alcohol be shown on the label except for cordials and liqueurs. Incidentally, I might add that most of the alcohol used in the production of medicinal preparations and flavors is synthetic.\"", "Practically and scientifically, pure ethyl alcohol synthesized from natural gas or petroleum products does not differ from that obtained by fermentation with subsequent distillation. Furthermore, foods in which one is used cannot be distinguished objectively from those in which the other is used.", "Based on this inquiry, the FDA issued the following policy statement, which does not outlaw the use of synthetic alcohol (derived from petroleum) so long as it is labeled accordingly:", "Synthetic ethyl alcohol may be used as a food ingredient or in the manufacturing of vinegar or other chemicals for food use, within limitations imposed by the Federal Food, Drug, and Cosmetic Act, the Alcohol Administration Act, and regulations promulgated under these acts.", "Any labeling reference to synthetic alcohol as \"grain alcohol\" or \"neutral grain spirits\" is considered false and misleading.", "We asked the Tobacco and Alcohol Tax Bureau, the group that would currently be in charge of enforcing such a ban, if any current laws that would prohibit the use of synthetic alcohol in beverages. Thomas Hogue, the Director of Congressional and Public Affairs for the Alcohol and Tobacco Tax and Trade Bureau, provided this response:", "I'm not aware of anything that prohibit you from using synthetic alcohol to produce a beverage alcohol product.", "He added that it is up to the FDA to determine what is safe, but up to the Tobacco and Alcohol Tax Bureau to prevent consumers from being misled. In that respect, he stated that while it would be legal to use synthetic alcohol, it would have to be labeled accordingly:", "I think you can reasonably assume that most consumers are going to expect that any beverage alcohol product they're drinking comes from fermentation of grains, fruits, or other plant materials. They're not going to automatically assume that it comes from a synthetic alcohol derived from petroleum or something like that. With that in mind, we would be requiring anybody who makes any product along those lines to label it with a truthful statement of composition. That label would need to have some sort of statement on it that it's synthetic alcohol derived from petroleum or something very similar to that, and make sure the consumer is not misled about what it is that they're purchasing.", "There is, as well, an established protocol to test a carbon-based substance for its relative fraction of petroleum versus biologically derived material, and this test, ASTM D6866, is indeed based on carbon-14 radioactivity. However, this is not a test that the Tobacco and Alcohol Tax Bureau utilizes, per Hogue:", "We do regularly test beverage alcohol. We pull product from the marketplace. Every year we pull a representative sample from the marketplace and test it for a variety of things, but not to determine whether or not it's synthetic.", "Ultimately, this is a cool bit of counterintuitive science that presents a less common use for carbon-14 analysis. However, the evidence that this scientific information is currently used by the United States federal government to prevent synthetic alcohol in beverages is lacking.", "Muller, Richard A..   Physics and Technology for Future Presidents.\r\n     Princeton University Press, 2010.   1400835313", "PubChem Open Chemistry Database.   \"Carbon-14.\"", "U.S. Food and Drug Administration.   \"CPG Sec. 555.100 Alcohol; Use of Synthetic Alcohol in Foods.\"\r\n    25 July 1969.", "astm.org.   \"ASTM D6866 - 16: Standard Test Methods for Determining the Biobased Content of Solid, Liquid, and Gaseous Samples Using Radiocarbon Analysis.\"\r\n    2016.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]