["Recently, Madhu Purnima Kishwar tweeted a video from UP and falsely claimed that it pertained to a Congress rally in Rajasthan where ‘Pakistan Zindabad’ slogans were raised. After being pointed out that the video was misleading, Kishwar retweeted another video claiming that ‘Pakistan Zindabad’ chants were made at another Congress event. The tweet by @Offenssiv that was retweeted by Kishwar is now deleted, but it’s archived version can be accessed here and its screen recording can be viewed here.", "Based on the video, Kishwar appealed to Jaipur Police to take action.", "Has @JaipurPolice taken action against these Pakistan Zindabad slogan shouters. From here to “Bharat Tere Tucked Honge, Insha Allah, Insha Allah” is the logical next step! No angst against such subversive elements @free_thinker ? For sure, they are good pay masters! https://t.co/4bJJFyMX0u", "— MadhuPurnima Kishwar (@madhukishwar) December 15, 2018", "Several other individuals circulated the same video with identical claims.", "Congress Party workers in Rajasthan are shouting slogans of Pakistan Zindabad!#Shamecongressshame pic.twitter.com/7tO5lJTQin", "— Aashu🚩 (@AashuSpeak) December 2, 2018", "Ironically, the video shared by Kishwar to defend her earlier misleading video was also misleading.", "The above video has been doing rounds on social media since before the start of the recent assembly elections. It has already been debunked by multiple media outlets, including BBC Hindi, AFP, The Times of India and India Today.", "In one watches the video carefully, a banner placed on the stage reads – ‘Nagar Congress Committee Rajsamand’, and the crowd of Congress workers actually chants – “Mai lai lalkar hai, hamaki sau ke paar hai. Bhati Saab Zindabad (We have accepted the challenge. This time we will score more than 100. Long live Bhati Saab).”", "Narayan Singh Bhati was the Congress candidate from Rajsmand, Rajasthan. Alt News has broken down that part of the video where the crowd chanted his name. When heard multiple times over, “Bhati Saab Zindabad” is audible more clearly.", "Madhu Kishwar has been found circulating misinformation several times in the past (1, 2, 3, 4, 5). She was also pulled up by J&K police for sharing fake news. Despite the multiple attempts to point out the truth, Kishwar continues to circulate disinformation through her Twitter account.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]