["About this rating", "The student-run university paper published a story on Nov. 22, 2020, and retracted and deleted it four days later to “stop the spread of misinformation” that was seen on social media. The decision was made after the article’s author incorrectly claimed that there was “no evidence that COVID-19 created any excess deaths” and that total death numbers were “not above normal death numbers.”", "However, in a Nov. 27 update, an editor’s note with a link to the original article in PDF form was published online in accordance with the newspaper’s standards for transparency.", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "An article titled \"COVID-19 Deaths: A Look at U.S. Data\" that was published on Nov. 22, 2020, in Johns Hopkins’ student-run newspaper The News-Letter was retracted after it claimed that COVID-19 has had “relatively no effect on deaths in the United States.”", "The retraction was reported by fringe conservative media outlets like the London Daily and Just the News, as well as the pro-science website Retraction Watch, and made social media waves when users posited that the retraction was censorship of scientific findings that evidenced COVID-19 may not be as deadly as public health officials made it seem to be.", "While it is true that The News-Letter retracted and unpublished the article on Nov. 26 over concerns that key points were inaccurately reported and contributed to the spread of misinformation, the publication shared an editorial update the following day explaining its decision and sharing a link to the article as a PDF with an overlay that reads “Retracted by The News-Letter. (For reference, a PDF of the article can be viewed here, and a web version has been archived here.)", "The article in question was written by science and technology writer Yanni Gu, who was a research assistant at the Johns Hopkins University School of Medicine at the time. Gu interviewed Genevieve Briand, assistant program director of the Applied Economics master’s degree program, who was said to have “critically analyzed” the effect of COVID-19 on U.S. death using data from the Centers for Disease Control and Prevention in a webinar given the same title of the article, \"COVID-19 Deaths: A Look at U.S. Data.\"", "According to Gu’s article, Briand sourced data from mid-March to mid-September that reported a total of 1.7 million deaths, about 200,000 of which were related to COVID-19. A link to this data was not made available in the article, but data published by the Johns Hopkins Coronavirus Research Center showed that at least 200,000 people had reportedly died from the virus as of Sept. 21 (for comparison, total deaths had reached over 268,000 people at the time of this writing, Dec. 2). The article went on to push a narrative that has circulated since the onset of the novel coronavirus pandemic that argues the CDC has falsely classified any death that could be related to COVID-19 simply as COVID-19 deaths, rather than accounting for other potential causes or underlying conditions. (See other examples of similar falsities here, here, here, and here.)", "“Even patients dying from underlying diseases but are infected with COVID-19 count as COVID-19 deaths,” wrote Gu. “This is likely the main explanation as to why COVID-19 deaths drastically increased while deaths by all other diseases experienced a significant decrease.", "Briand said in an interview with The News-Letter that her findings point “to no evidence that COVID-19 created any excess deaths,” and that “total death numbers are not above normal death numbers. When asked whether COVID-19 deaths can be called misleading by this presumed inflation, Briand responded by saying that the way in which the data was reported “doesn’t give us a choice but to point to some misclassification.”", "“In other words, the effect of COVID-19 on deaths in the U.S. is considered problematic only when it increases the total number of deaths or the true death burden by a significant amount in addition to the expected deaths by other causes,” wrote Gu.", "Editors at The News-Letter wrote in a Nov. 27 note that Genevieve Briand’s presentation had been “used to support dangerous inaccuracies that minimize the impact of the pandemic. In response to criticism following the editorial staff’s decision to retract the article, the paper issued the following statement:", "In accordance with our standards for transparency, we are sharing with our readers how we came to this decision. The News-Letter is an editorially and financially independent, student-run publication. Our articles and content are not endorsed by the University or the School of Medicine, and our decision to retract this article was made independently.", "Briand’s study should not be used exclusively in understanding the impact of COVID-19, but should be taken in context with the countless other data published by Hopkins, the World Health Organization and the Centers for Disease Control and Prevention (CDC).", "As assistant director for the Master’s in Applied Economics program at Hopkins, Briand is neither a medical professional nor a disease researcher. At her talk, she herself stated that more research and data are needed to understand the effects of COVID-19 in the U.S.", "The staff noted other inaccuracies in Briand’s claims that have been debunked and refuted by the broader medical community. For one, her claim that there is no evidence that COVID-19 created any excess deaths did not take into account the spike in raw death count from all causes when compared to previous years. Furthermore, the CDC reported on Oct. 23 that an estimated 299,028 excess U.S. COVID-19 deaths occurred between late January through Oct. 3.", "“Additionally, Briand presented data of total U.S. deaths in comparison to COVID-19-related deaths as a proportion percentage, which trivializes the repercussions of the pandemic,” continued The News-Letter in its editor’s note. “This evidence does not disprove the severity of COVID-19; an increase in excess deaths is not represented in these proportionalities because they are offered as percentages, not raw numbers.”", "Removing misreported content has been a source of controversy in the journalism world, with groups like the Society of Professional Journalism and The Pointer Institute arguing that such actions reduce the transparency and credibility of a publication that does so.", "Media publications will typically set forth its editorial policies for retractions and updates. At Snopes, for example, our policy is to promptly correct errors of fact and to clarify any potentially confusing or ambiguous statements in our articles. Whenever we correct or modify a substantive supporting fact or add substantial new information to an existing article, those changes are noted and explained in an “update” box at the foot of the article.", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]