["The video has been viewed more than 2,300 times in this Facebook post published on April 22, 2019.", "Below is a screenshot of the post:", "The misleading Facebook post’s Indonesian language caption translates to English as: “It can be confirmed that Jokowi has lost the election, according to Article 6A, point 3, of Indonesia’s 1945 Constitution.", "“The article states three requirements candidates must fulfill to win a presidential election: 1) the candidate has more than 50 per cent of the votes, 2) the candidate wins in one-half of the total provinces (meaning 17 provinces), 3) In each of the 17 provinces where the candidate lost, the candidate has to have at least 20 percent of the votes. There requirements are made to ensure that an elected president has a wide acceptability in many regions.”", "“Jokowi” is President Joko Widodo’s popular nickname.", "He ran against his sole opponent, Prabowo Subianto, in Indonesia’s April 17, 2019 election. This is an AFP report about the polls.", "The video in the misleading Facebook post shows a series of images inside Indonesia’s Constitutional Court while an Indonesian-speaking narrator reads a report that was published on April 20, 2019, by Indonesian news portal Tribunnews.", "The footage in the misleading Facebook post is identical to this YouTube video posted April 22, 2019 which has been viewed more than 800,000 times and makes a similar claim.", "The same video was shared in Facebook posts here, here and here alongside a similar claim.", "The claim is false; the caption in the misleading Facebook posts refers to “Article 6A, point 3, of Indonesia’s 1945 Constitution”. Here is the article on the nation’s House of Representatives’ website.", "Below is a screenshot of the article:", "The Indonesian language text of Article 6A, point 3 translates to English as: “A Presidential and Vice Presidential candidate pair who obtains more than fifty per cent of the total votes in an election, with at least twenty per cent of votes in each of more than one-half of the total number of provinces in Indonesia, is sworn in as President and Vice President”.", "But the requirements listed in Article 6A, point 3 only apply in presidential elections with more than two pairs of candidates, as ruled by the Indonesia Constitutional Court in 2014.", "The court’s ruling can be seen in this document on the court’s website.", "On page 40 of the ruling, the court says the article in the 2008 law does not apply to elections “which only has two pairs of presidential and vice presidential candidates”.", "Here is an official General Elections Commission (KPU) announcement which states there are only two presidential candidates in the 2019 election.", "The final vote count for Indonesia’s April 17, 2019, elections has not been completed.", "According to the KPU's official schedule which can be seen here, the official vote count for the 2019 elections will finish on May 22, 2019.", "President Joko Widodo is on course to win his second term in office after the 2019 presidential election, according to this AFP report and predictions from Indonesian pollsters, for example here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]