["The misleading posts, like this one published March 10, 2019 by a page called \"Zambian Accurate Information\", which has more than 90,000 followers, contain an image with two photos side-by-side: one of a grey-haired man in a suit, and one of a grey-haired woman.", "This post's caption states in part: \"The World of Wonders!! MAN PRETENDED TO BE DEAF AND DUMP [sic] FOR 62 YEARS TO AVOID QUARELLING [sic] WITH HIS WIFE.\"", "Below is a screenshot of the post:", "The same photo has been shared repeatedly with a similar claim for example here, here and here on Facebook, and here on Twitter.", "In some of the posts, the image is accompanied by a headline and text from this article published by satirical news website worldnewsdailyreport.com on March 4, 2019.", "The article's headline says: \"MAN FAKED BEING DEAF AND DUMB FOR 62 YEARS TO AVOID LISTENING TO HIS WIFE\".", "The image below compares a screenshot of one of the misleading posts (L) and a screenshot of the World News Daily Report article (R):", "In a disclaimer page on its website here, World News Daily Report states it assumes \"all responsibility for the satirical nature of its articles and for the fictional nature of their content\".", "It states: \"All characters appearing in the articles in this website – even those based on real people – are entirely fictional and any resemblance between them and any persons, living, dead, or undead is purely a miracle.\"", "Here is a screenshot of the disclaimer:", "A Google reverse image search found that the misleading photo is actually a mirror-image version of a photograph credited here to Lannis Waters of The Palm Beach Post, a local newspaper in Florida.", "The accompanying article published on July 13, 2017 reports on the divorce of a wealthy couple, Burt and Lucille Handelsman, after 67 years of marriage.", "The article's headline says: “Palm Beach divorce to end 67-year marriage shakes up Worth Ave. empire”.", "Here is a screenshot of the Palm Beach Post article:", "AFP found other media reports about the same court case which use different photos of the couple, for example here and here.", "UPDATE: This story was updated 15/03/2019 to amend the wording of the headline and first paragraph.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]