["About this rating", "The so-called Tide Pod Challenge, a bizarre viral social media phenomenon involving teens sharing videos of themselves consuming liquid laundry detergent pods, crossed over into fake news territory in mid-January 2018 with the publication of an article stating that members of the Marine Corps have taken up the fad.", "An 18 January post on the satirical Duffel Blog said that the Corps' top leaders had issued a warning to junior troops to stop eating the pods after an unspecified number were hospitalized as a result of doing so:", "WASHINGTON — The Marine Corps’ top leaders have warned junior troops to stop eating Tide Pods after a number of Marines have been hospitalized due to poisoning, sources confirmed today.", "“I don’t care what you guys do. Hell, you can even go back to drunken driving. Just stop eating laundry detergent, for Christ’s sake,” said Gen. Robert Neller, the Marine Commandant.", "Top officials have expressed concern in recent days over a number of incidents involving enlisted troops taking part in the “Tide Pod Challenge,” a viral internet campaign that challenges people to put laundry detergent in their mouth in order to raise awareness for Charles Darwin.", "While we do not doubt that youthful military personnel are as susceptible as anyone else to idiotic fads, we've found no reports in reliable news sources of U.S. troops hospitalized for laundry detergent poisoning.", "A disclaimer on the Duffel Blog web site describes its content as entirely fictitious:", "We are in no way, shape, or form, a real news outlet. Everything on this website is satirical and the content of this site is a parody of a news organization. No composition should be regarded as truthful, and no reference of an individual, company, or military unit seeks to inflict malice or emotional harm.", "All characters, groups, and military units appearing in these works are fictitious. Any resemblance to real persons, living or dead, or actual military units and companies is purely coincidental.", "Just days before the Duffel Blog article appeared, the American Association of Poison Control Centers issued an alert warning that the health consequences of ingesting detergent pods can be severe, possibly leading to seizures, respiratory arrest, and even coma. It also reported that the rate of self-inflicted poisonings by this means had increased dramatically during the first two weeks of 2018:", "According to AAPCC data, in 2016 and 2017, poison control centers handled thirty-nine and fifty-three cases of intentional exposures, respectively, among thirteen to nineteen year olds. In the first fifteen days of 2018 alone, centers have already handled thirty-nine such intentional cases among the same age demographic. Ingestion accounted for ninety-one percent of these reported exposures.", "Facebook and Google (which owns YouTube) announced on 18 January that they are deleting Tide Pod Challenge videos from their platforms because they encourage dangerous activities, a violation of community guidelines.", "Toh, Michelle.  \"Tide Pod Challenge: YouTube Is Removing 'Dangerous' Videos.\"\r\n  CNN.  18 January 2018.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]