["About this rating", "An image purportedly showing a group of people golfing dangerously close to a large forest fire was widely circulated on social media in September 2017:", "\"I was actually going to drive up to the Bridge of the Gods,\" McCluer said. But she saw a parking lot and decided to pull in. After being told she couldn't park there because it was actually a road, she found a real parking lot that was nearly empty.", "\"Around the corner was this golf course ,\" she said, \"and you could see the fire.\"", "So she started snapping pictures.", "\"It's a real photo,\" she confirmed, of the picture of people golfing as the fire roars. She did lighten it a little bit, but other than that, the photo captures the moment.", "But the golfers were in less danger than they appear to be in the viral photograph. Mark Mayfield, Beacon Rock's operations manager, told CNN that the fire was further away than it appears and that the Columbia River provided a buffer between the blaze and the golf course:", "Staff at the golf course -- located in Washington state, just across the Columbia River from the fire -- posted pictures on Wednesday to Facebook of golfers carrying on as the massive wildfire raged through trees on a nearby hillside.", "[...]", "Taken Monday evening, the photos' and captions' apparent lack of panic owes to the fact that the Columbia River provides a buffer between the fire and the golf course, Mark Mayfield, Beacon Rock's operations manager, told CNN.", "\"The fire was a mile and a half away,\" he said.", "Brandon Crawford, who identified himself as the man putting in the viral photograph, elaborated on the bizarre scene:", "\"They were definitely not faked,\" Crawford said over the phone.", "\"When we first started there was a fire maybe the size of a grocery store,\" he said. \"By the end of hole two, it was just crazy. The big one you're seeing on the internet was on hole nine.\"", "Though the fire was across the river, Crawford said ash the size the soccer balls was falling around them. He and his friends would golf and then stare at the fire, and then golf some more.", "The massive fire shown in these pictures ravaged the Eagle Creek area of Oregon in early September 2017. Police believe that the blaze started after a teenager set off a smoke bomb. According to Oregon Live, the fire spread across more than 30,000 acres and destroyed 3 homes during the first six days.", "Green, Aimee.   \"Public Demands Consequences for 15-Year-Old Eagle Creek Fire Suspect.\"\r\n    The Oregonian.   7 September 2017.", "Crombie, Noelle.   \"Eagle Creek Fire by the Numbers.\"\r\n    The Oregonian.   7 September 2017.", "Criss, Doug.   \"Golfers Finish a Round as Massive Oregon Wildfire Rages Behind Them.\"\r\n    CNN.   7 September 2017.", "Acker, Lizzy.   \"We Found the Photographer Who Took These Dramatic Pictures of Golfers in Front of a Hill on Fire in Oregon.\"\r\n    The Oregonian.   7 September 2017.", "Acker, Lizzy.   \"These Terrifying Pictures of People Golfing While a Hill Goes up in Flames Behind Them are Real.\"\r\n    The Oregonian.   6 September 2017.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]