["“DR. FAUCI, MELINDA GATES AND BARACK OBAMA AT THE WUHAN LAB IN 2015...!!!!” says text accompanying the photo in a July 14, 2020 Facebook post.", "The image shows the former president conversing with a woman in a white lab coat in what appears to be a laboratory. Fauci stands in the background with another woman.", "Below is a screenshot of a no-longer-available tweet from user @gmcgonigle replying to @JoeBiden: “You mean this Dr Fauci who was with Obama in 2014 in the WuHan lab where they paid the lab 3.7 million for a ‘bat’ project?”", "More examples of the post, which has been circulating since at least July 9, are available on Facebook here, here and here and on Instagram here. Versions of the post were also shared in Spanish here, here and here.", "Fauci, the director of the National Institute of Allergy and Infectious Diseases and a member of the coronavirus task force, has been increasingly drawn into conflict with President Donald Trump, and is a popular target for disinformation.", "Bill Gates and his wife, Melinda, leading voices on the push for a vaccine to combat COVID-19, the disease caused by the coronavirus, have also been the target of multiple conspiracy theories during the crisis.", "A reverse image search for the photo reveals that it was first published on US National Institutes of Health NIAID’s Flickr account on December 2, 2014. It was also published the same day on NIH director Francis Collins’ blog.", "The photo caption on Flickr reads: “Dr. Nancy Sullivan of NIH’s National Institute of Allergy and Infectious Diseases discussing Ebola research with President Barack Obama as NIAID Director Dr. Anthony Fauci and HHS Secretary Sylvia Burwell look on,” and is credited to NIH.", "Melinda Gates did not participate in the 2014 visit to NIH, which was related to ebola vaccine trials; instead Sylvia Burwell, secretary of US Department of Health and Human Services during the Obama administration, is the woman pictured in the background.", "Burwell now serves as the president of American University in Washington, DC.", "Also present was AFP photographer Mandel Ngan, who documented the encounter.", "Photo metadata confirms that the image was taken in Bethesda, Maryland on December 2, 2014.", "The US government did fund a years-long research project in China run by nonprofit EcoHealth Alliance aimed at helping identify coronaviruses and preventing future outbreaks. The grant was renewed for $3.7 million last year, about 10 percent of which was slated for the Wuhan Institute.", "However, Trump in April called for the termination of the funding in response to conspiracy theories blaming the institute for the pandemic.", "AFP has previously fact checked claims that the novel coronavirus is not naturally occurring and that US funding for China coronavirus experiments contributed to the outbreak.", "Overall, AFP Fact Check has debunked more than 560 examples of false and misleading information about the novel coronavirus, available here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]