["“No words 🙏 True Indian can never ignore this pic. This is our army… They will do anything for us🙏.” This text accompanies a picture of a soldier bending down so a woman can use his back to step out of a truck. It has been shared by Facebook pages that routinely use themes of nationalism and Indian Army to strike an emotional chord with their readers. Post Card Fans, India against Paid Media, My India and Narendra Modi – True Indian are some of the pages that have posted this image, which has a combined share count of over 18,000.", "No words 🙏 True Indian can never ignore this pic. This is our army… They will do anything for us🙏🇮🇳", "Posted by Narendra Modi – True Indian on Sunday, 19 August 2018", "There are enough clues in the photograph that point out it is not of rescue operations in Kerala. However, as always, the emotional appeal of the message clouds judgement and the picture is currently viral on the internet.", "A Twitter user, Jitendra Pratap Singh, who is followed by Prime Minister Narendra Modi has tweeted, “इतनी भी तमीज नही की जवान के पीठ पर पैर रखने के पहले जूती उतार लें ..जूती के सोल की नोक कितनी चुभी होगी ..इनके मां बाप कभी इन्हें तमीज सलीका सँस्कार नही सिखाते” (She doesn’t even have the manners to take off her shoes….the heel of the shoe must have hurt him so much…their parents never teach them manners, principles and values – translated)", "इतनी भी तमीज नही की जवान के पीठ पर पैर रखने के पहले जूती उतार लें ..जूती के सोल की नोक कितनी चुभी होगी ..इनके मां बाप कभी इन्हें तमीज सलीका सँस्कार नही सिखाते @ShayarImran @RifatJawaid @LambaAlka @ShefVaidya @pooja303singh @Shehla_Rashid pic.twitter.com/6FR9w6jit0", "— Jitendra pratap singh (@jpsin1) August 20, 2018", "A simple Google reverse search reveals some interesting details about the picture. It is of a member of the Iraqi PMU (Popular Mobilization Units) helping a civilian after the city of Fallujah was freed from ISIS in June 2016.", "The image has been at the center of an international fake news controversy. In December 2016, the Syrian envoy to the United Nations was widely criticized for using it to show how pro-government forces were ‘liberating’ city of Aleppo. “Syria UN ambassador caught using fake photo at council” ran an Al Jazeera headline at the time. The photograph has now traveled around the world and reached India.", "Syria’s UN Ambassador Used A Photo From Iraq And Claimed It Was From Aleppo https://t.co/E9Ty4KP5CR via @rose_catb", "— Borzou Daragahi 🖊🗒 (@borzou) December 14, 2016", "The same image was also circulated during Kashmir floods, claiming it as that of Indian army.", "These pictures speaks itself how Indian army is killing innocent kashmiris. Some of the picture is taken during floods. I Salute them 💞 pic.twitter.com/esHZMkAeHr", "— Ibn -i- Sina (@Ibne_Sena) July 16, 2017", "In the past, it has also been shared claiming that the image is of Turkish army.", "Both armies are now the targets of massive Information War, Psy-Ops & propaganda. Enemies know that unless these two armies remain in the Muslim world, Zionists can never achieve their expansion projects. Arab/Iran armies are not a threat for Israel or India…. pic.twitter.com/AzaKiEO80L", "— Zaid Hamid (@ZaidZamanHamid) March 13, 2018", "The Indian army is playing a stellar role in Kerala flood rescue operations. It doesn’t need those circulating misleading images to whip up support.", "Donate Now", "Follow @free_thinker", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]