["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Pope Francis delivers a blessing during the Angelus prayer in St. Peter's Square at the Vatican, Sunday, March 5, 2017. (AP)", "Did Pope Francis say that the rights of Muslim migrants are more important than any country’s safety concerns about them?", "That’s what a largely plagiarized story on the website opreminfo.com claimed. But what he said was more nuanced.", "Facebook flagged this story as part of the company’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "So we decided to investigate.", "It turns out that a large part of the article is copied, word-for-word, from a 2017 Reuters article titled, \"Pope says migrants’ rights should override national security concerns.\" The only differences between the two are that the opreminfo.com article omits the final two paragraphs of the Reuters story, and it also has a different headline singling out Muslim migrants.", "Reuters is a reputable source, and a 2017 Guardian article corroborates much of their story.", "But this recently posted article has a few problems.", "First, there's an issue of timing.", "The story begins with the statement, \"Pope Francis urged political leaders on Monday to defend migrants.\" The Reuters article began with those same words, but it was published in August 2017, and was referring to a message the pope put out that same month, ahead of the Roman Catholic Church’s World Day of Migrants and Refugees.", "In it, the pope reiterates an earlier address and says, \"Our shared response may be articulated by four verbs: to welcome, to protect, to promote and to integrate.\"", "He then goes on to describe the task of \"welcoming\" as follows:", "\"Once again, I want to emphasize the importance of offering migrants and refugees adequate and dignified initial accommodation … The principle of the centrality of the human person, firmly stated by my beloved predecessor, Benedict XVI, obliges us to always prioritize personal safety over national security … The situation of migrants, asylum seekers and refugees requires that they be guaranteed personal safety and access to basic services. For the sake of the fundamental dignity of every human person, we must strive to find alternative solutions to detention for those who enter a country without authorization.\"", "The opreminfo.com article, published July 10, 2018, refers to that message. However, it says the pope \"urged political leaders on Monday,\" even though the pope’s remarks were published nearly a year ago.", "Secondly, the Reuters article makes no reference to \"Muslim migrants.\" Rather, it mentions that the pope called for \"broader options for migrants and refugees to enter destination countries safely and legally.\"", "We didn’t find any reference to Muslim migrants in the pope’s message.", "An article on Facebook claimed, \"Pope says that the rights of Muslim migrants trump any safety concerns that you might have with them in your country.\"", "The pope discussed ensuring all migrants' \"personal safety over national security.\" But this article cherry-picked a subgroup of migrants to make it seem like he was only talking about Muslims.", "In addition, the text of the article is copied from a 2017 Reuters article, even though it is framed as though the speech happened recently.", "For a partially accurate claim that takes things out of context, we rate this headline Half True.", "Opreminfo.com, \"Pope says that the rights of Muslim migrants trump any safety concerns that you might have with them,\" July 10, 2018", "The Holy See, \"Message of His Holiness Pope Francis for the 104th World Day of Migrants and Refugees 2018,\" August 15, 2017", "The Holy See, \"Address of His Holiness Pope Francis to Participants in the International Forum on ‘Migration on Peace,’\" February 21, 2017", "Reuters, \"Pope says migrants' rights should override national security concerns,\" August 21, 2017", "The Guardian, \"Pope Francis: prioritise migrants' dignity over national security,\" August 21, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]