["The photo was posted on Facebook here on September 28, 2020.", "It shows a 1,000 Philippine pesos ($20.7) banknote, and is captioned in part: “Instead of 'Rodrigo Roa Duterte,' the banknote says 'Rodrigo Boa Duterte.'\"", "Identical photos have also been shared alongside a similar claim on Facebook here and here; on Twitter here, here and here; on Reddit here; in this Wikipedia post; and in this website post.", "The purported misprint was also reported by local newspaper Manila Bulletin here and Esquire magazine here.", "The claim is misleading; the image has been doctored.", "A closer analysis found the photo in the misleading posts had been digitally altered to insert the letter “B” instead of the original “R” in the word “Roa”.", "Below is a screenshot comparison of the photo in the misleading posts (L) and a photo of a genuine 1,000 Philippine pesos banknote (R), with the alteration circled in red by AFP:", "The central bank, which maintains sole authority to legally issue currency in the Philippines, also denied issuing the banknote.", "This statement posted September 30, 2020 on the bank’s website states: “The 1000-Piso banknote with the alleged misspelled middle name of President Rodrigo Roa Duterte featured in a story in a website is not legal tender. The serial number shown in the said banknote does not match any of the ones issued by the BSP for the 1000-Piso Enhanced New Generation Currency banknote.”", "Asked if the photo shows a counterfeit banknote, a representative for the bank told AFP in an email on October 2, 2020: “The Currency Analysis group cannot determine the authenticity/genuineness of the banknote based only on a photo; the actual note needs to be submitted to the BSP for examination.”", "Multiple Philippine news organisations, for example ABS-CBN here and GMA News here, reported on the central bank’s clarification about the purported misprint.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]