["An image featuring Prime Minister Narendra Modi and BJP chief Amit Shah purportedly sitting in front of a jam-packed crowd is circulating on social media. “Modi and his well-wishers.”, reads the caption attached to the same image posted by a Facebook page We Support Dr Subramanian Swamy. This post has been shared more than 700 times and liked more than 3,400 times. Few more individuals on Facebook and Twitter have shared the image with the identical text.", "Modi and his well wishers.", "Posted by We Support Dr Subramanian Swamy on Sunday, 7 April 2019", "One Bijay Dutta also posted the image saying, “In support of Champion of the Earth Narendra Modi jee tsunami start with huge waves Namo again”.", "Alt News found that the enormous crowd shown in the image is digitally manipulated. We were able to establish that the image has been doctored through a simple reverse image search on Google, which led to the original picture.", "Alt News traced the image back to December 2017, when Amit Shah and PM Modi were seen sharing a dais at the swearing-in ceremony of Himachal Pradesh Chief Minister Jai Ram Thakur.", "PM Shri @narendramodi at the swearing-in ceremony of the Council of Ministers of the Himachal Pradesh Government in Shimla. pic.twitter.com/6vdGNfHOm4", "— BJP LIVE (@BJPLive) December 27, 2017", "Amit Shah’s attire in the original image can be matched with the other photographs, featuring him, from the same event.", "Shimla: Virender Kanwar and Vikram Singh take oath as cabinet ministers of Himachal Pradesh government pic.twitter.com/Dgbqg012XV", "— ANI (@ANI) December 27, 2017", "In the image posted below, the photoshopped image has been juxtaposed with the original picture.", "A digitally manipulated image was circulated on social media to bolster a ‘tsunami’ of people supporting Prime Minister Narendra Modi.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]