["Democratic leaders applied a double standard to Black Lives Matter protesters and  supporters of President Donald Trump who breached the U.S. Capitol building on Wednesday, according to a Facebook post.", "The Jan. 6 post features a meme with images of Rep. Ayanna Pressley, D-Mass.; Rep. Maxine Waters, D-Calif.; House Speaker Nancy Pelosi; and Vice President-elect Kamala Harris superimposed over images of buildings on fire. Text overlays of quotes purportedly from last summer's BLM protests are attributed to each.", "\"Direct quotes when BLM was BURNING down cities and killing people in the streets! 'Peaceful protests' the media called it,\" user Kyle Rubenstein wrote. His post has over 600 shares.", "Actions taken by insurgents who infiltrated the Capitol on Wednesday while results of the 2020 presidential election were certified were labeled differently, according to Rubenstein.", "\"Trump supporters take to the capital, dont burn or loot. News calls it domestic terrorism. This is why we are fed up!!!!\" the caption ends.", "In an email response to USA TODAY, Rubenstein elaborated on his post.", "\"Let's see all the lies the media 'news' has been feeding the country about the political non sense going on in the world today and the fact you fake fact checkers are hiding or trying to hide the truth or blocking freedom of speech just bc one agrees with oneside not the other seems some folks need to put their big boy pants on and grow up,\" Rubenstein wrote.", "A similar meme was posted to Facebook on Jan. 8 using the same quotes; it has received 3,500 shares.", "Another posted that day to the page American Kool-Aid Drinkers included additional remarks from former Attorney General Loretta Lynch and CNN host Chris Cuomo. All quotes are compared to an excerpt from Trump's now deleted tweet to his supporters on Jan. 6: \"Go home with Love & in Peace. Remember this day forever!\"", "\"Much of our material is, 'unoriginal,' in that it comes from another source, i.e. various social media sources. With that said, AKD is more an aggregator of humorous memes, Mike Hunt American Kool-Aid Drinkers told USA TODAY.", "USA TODAY reached out to the other user for comment.", "More:Fact check: NPR posted story early, updated live amid Capitol riot", "The claims were posted after violence at the U.S. Capitol that led to the deaths of five people. Clashes between Trump supporters and Capitol police recalled images from Black Lives Matter-led racial justice demonstrations last summer, some of which turned violent.", "Several incidents preceded the BLM protests, including the deaths of George Floyd and Breonna Taylor — two unarmed Black citizens — at the hands of police and the killing of Black jogger Ahmad Aubrey by white supremacists early last year, according to USA TODAY.", "But the quotes used in the claims are either related to BLM protests and incomplete, or have nothing to do with them at all.", "Here's a breakdown of circumstances surrounding each quote.", "Harris has gone on record as supporting peaceful anti-violence demonstrations after police officers in Kenosha, Wisconsin, shot Jacob Blake, a Black man, several times in the back on Aug. 23.", "Harris said that \"protesters should not let up!\" according to the claim. That abbreviated quote has been fodder for social media claims before, USA TODAY has reported.", "More:Fact check: Kamala Harris said protests aren't going to stop, but condemns violence", "The full statement is more nuanced. During a June 17 interview on \"The Late Show with Stephen Colbert,\" Harris told Colbert that protests — not riots — should not let up.", "Colbert observed that reporting on protests happening in major cities across the country appeared to be dwindling, to which Harris responded: \"That's right. But they're not gonna stop. They're not gonna stop, and this is a movement, I'm telling you.", "\"They're not gonna stop, and everyone beware, because they're not gonna stop,\" she continued. \"They're not gonna stop before Election Day in November, and they're not gonna stop after Election Day.", "\"Everyone should take note of that, on both levels, that they're not going to let up — and they should not. And we should not,\" Harris concluded, according to USA TODAY.", "The vice president-elect made a distinction between rioting and protesting in a rebuttal to Trump's acceptance speech at the Republican National Convention in September, CBS News reported.", "\"We must always defend peaceful protest and peaceful protesters. We should not confuse them with those looting and committing acts of violence, including the shooter who was arrested for murder,\" Harris said. \"Make no mistake, we will not let these vigilantes and extremists derail the path to justice.\"", "Pressley's statements about last summer's BLM protests were similarly taken out of context.", "\"There needs to be unrest in the streets,\" Pressley said, according to the claim.", "The quote, grabbed from Pressley's Aug. 15 interview on MSNBC's \"AM Joy,\" is incomplete. A clip with her full remarks was posted to BlackEnterprise.com.", "More:Rep. Ayanna Pressley: 'What do you do when your very existence is resistance?'", "\"Don’t let up, send emails, make phone calls,\" the congresswoman told host Tiffany Cross in reference to the protests. \"There needs to be unrest in the streets for as long as there's unrest in our lives. And unfortunately, there's plenty to go around,\" she concluded.", "Pressley's statement was shared widely in conservative social media circles. After the interview, thousands of messages, some \"ominous,\" were sent to her office, according to The 19th News.", "More:Fact check: Joe Biden has condemned protest-related violence from the left and the right", "Unlike Harris and Pressley, Waters' charged statement about \"pushing back\" against Cabinet officials predates last year's BLM protests.", "\"If you see anybody from that Cabinet in a restaurant, in a department store, at a gas station, you get out and create a crowd and you push back on them and you tell them they're not welcome anymore, anywhere,\" Waters said, according to the claim.", "The California congresswoman's remarks were in response to the Trump administration's 2018 \"zero tolerance\" family separation policy at the U.S.-Mexico border, CNN reported on June 25, 2018.", "Waters called for reuniting migrant families in her full statement.", "\"Let’s make sure we show up wherever we have to show up. And if you see anybody from that Cabinet in a restaurant, in a department store, at a gasoline station, you get out and you create a crowd. And you push back on them. And you tell them they’re not welcome anymore, anywhere. We’ve got to get the children connected to their parents,” she said, according to CNN.", "Trump said Waters called for \"harm to his supporters\" in a tweet later that day.", "\"Congresswoman Maxine Waters, an extraordinarily low IQ person, has become, together with Nancy Pelosi, the Face of the Democrat Party. She has just called for harm to supporters, of which there are many, of the Make America Great Again movement. Be careful what you wish for Max!\" the president tweeted.", "Waters made no reference to Trump's supporters and underscored that she had no sympathy for members of the current administration in an MSNBC interview that same day.", "“The people are going to turn on them. They’re going to protest. They’re going to absolutely harass them until they decide that they’re going to tell the President, ‘No, I can’t hang with you,’” Waters said of administration officials, according to CNN.", "Pelosi was also referring to the Trump administration's family separation policy with her statement about nationwide uprisings.", "\"I just don't know why there aren't uprisings all over the country. Maybe there will be,\" Pelosi said, according to the claim.", "During a June 14, 2018, press conference, Pelosi was asked about former House Speaker Paul Ryan's comment about legislation being the best way to change the separation policy. She disagreed.", "\"This is an act of the administration. They have been planning this for a while,\" Pelosi said, according to a video provided by C-SPAN.", "Near the end of a lengthy response, Pelosi expressed surprise that there weren't uprisings in the street.", "\"When we had a had a hearing on a subject related to this asylum seeker, refugees, etc., the (National) Association of Evangelicals testified that refugees and asylum ... they called it the crown jewel of America's humanitarianism,\" she said. \"And in order to do away with that crown jewel, they're doing away with children being with their moms.", "\"This is ... I just don't even know why there aren't uprisings all over the country. Maybe there will be,\" Pelosi continued.", "The remarks about uprisings were in no way tied to BLM protests.", "We rate this claim MISSING CONTEXT, based on our research. Two quotes attributed to members of the Democratic Party that allegedly referenced last summer's Black Lives Matter protests actually predate the events. The two remaining quotes were not provided in full. None of the people mentioned in the claim called for violence over peaceful protest, according to sources.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook."]