["On May 18, 2020, Kenyan television station NTV broadcast a story about Interpol naming the town of Juja as a cybercrime hotspot. The media outlet also promoted its TV report on Facebook and Twitter. The posts featured screenshots of the TV story with the strapline \"Juja: A Cyber Crime Hot-Spot\".", "A Google search for the keywords “Interpol Juja cybercrime hotspot” revealed this article published on a website called PostaMate on May 15, 2020 -- three days before NTV aired its report.", "A tagline on the frontpage clearly identifies PostaMate as a satirical website.", "While Kenya police on May 14, 2020 confirmed the arrest of two university students in Juja over cybercrimes , Interpol told AFP Fact Check it had not released a report about cybercrimes in Kenya or identified Juja as a hotspot.", "“We can confirm that we have not released a statement claiming this. From additional reports we have seen, this claim appears to have originated from a satirical website,” Interpol’s Press office said in an email.", "“The Interpol General Secretariat does not normally issue such public reports.”", "A search on Interpol’s website did not reveal any cybercrime report in Kenya. In fact, the last such website report dates back to February, 17 2020 and was about Southeast Asia.", "Cybercrime in Kenya", "There has been a rise of cyber-related criminal activities in Kenya and a report by the country’s  Communication Authority (CA) indicates that about 37.1 million cyber threats were detected between October and December 2019. The four main threats were categorised as malware, botnet, web application attacks and system vulnerabilities.", "CA estimates that the number of cybercriminals in the country lies between 16,000 and 17,000.", "AFP Fact Check Kenya has debunked several online scams here and here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]