["About this rating", "In September 2015, social media users in Europe and the United States debated the merits of accepting an influx of refugees from war-torn regions such as Syria.", "While some expressed sympathy and willingness to help, others fostered and spread rumors claiming asylum seekers were Islamic State operatives in disguise. An expression of the latter viewpoint was published to a Facebook group based in Malta on 13 September 2015, along with three photographs:", "Users of forums on which the rumors were spread pointed out logical inconsistencies with the information as it was presented, such as the notion that folks fleeing regions beset by war would so soon be sending for the delivery of patio sets via freight:", "This seems rather strange to me and I'd like to know more, if you have anything further. Such as which refugee camps have been long-enough established and are able to make international orders for plastic furniture? Surely the refugees themselves aren't ordering it up, and national governments are probably running any refugee camps and Germany is buying IKEYA beds in quantity, in Germany, for example. If a few thousand placcy garden chairs and tables are required, they are widely-available in every country on the planet and are probably manufactured in China and shipped direct from there in sealed containers with a lead time of several weeks.", "To me this all sounds a little implausible, but I could be wrong, it wouldn't be the first time.", "Versions of this rumor were accompanied by still frames taken from the mislabeled video embedded above, which did not depict material being shipped to refugees in Greece (or elsewhere in Europe), but rather embargoed arms being smuggled from Turkey to Libya that were interdicted by the Greek coast guard:", "Greek authorities have seized a freighter carrying an undeclared shipment of weapons en route from Turkey to Libya, coast guard officials said on Wednesday.", "A coast guard patrol boat raided the vessel on Tuesday, 20 nautical miles northeast of Crete. The freighter, with a crew of seven and which had sailed from the Turkish port of Iskenderun, was escorted to Heraklion port on the island.", "The United Nations has imposed an embargo on weapons shipments to Libya, which is plagued by factional conflict.", "A Turkish foreign ministry spokesman confirmed the cargo included weapons but said it was fully documented and was destined for the Sudanese police force. The vessel was also carrying building materials for Libya, he said.", "\"If investigations by the Greek authorities show that the consignment is going to receivers other than those stated in the documentation, and if that is shared with us, naturally measures could be taken,\" foreign ministry spokesman Tanju Bilgic said.", "A 6 September 2015 article from the Independent similarly reported that:", "A huge stash of weapons and ammunition has been found hidden aboard a cargo ship understood to be bound for Libya.", "Videos released by the Hellenic Coast Guard show officers uncovering the arms, which it said had no accompanying documents and were concealed by furniture and gym mats.", "So while the photographs shown here were captured from video of a September 2015 Greek coast guard weapons seizure, the arms in question were heading to Libya, not to refugee camps in Europe.", "In September 2016, the images resurfaced on social media with a slightly different purported context:", "If you have doubts about Muslim immigration, this might clear them up...", "Greek Border guards found 52 tons of guns and ammunition in 14 Conex shipping containers disguised as \"furniture\" for Muslim immigrants. Note the discretion on the outside of the boxes.", "FOR YOUR INFORMATION--YAVEX USA IS A TURKISH ARMS MANUFACTURING COMPANY THAT IS LICENSED TO DO BUSINESS IN FORT MEYERS, FLORIDA!!!", "Brand new and still in their wrappers. All Automatic weapons!!!", "Yeah, keep letting them into our country", "If this doesn’t convince you that this IMMIGRATION is nothing less than an ARMED INVASION then nothing will.", "Wonder still why all those young (military age) men without children or wives are taking on the task of traveling all those miles posing as refugees?", "This is one of the first things I noticed and found odd.....why aren't these \"young men\" fighting for THEIR country??? Then the Trojan Horse theory kicked in!!!", "These are the same tactics they tried to pull when we were in Iraq...nothing has changed!!!", "Most western nation Main Stream media won’t cover this …", "SO PLEASE LIKE, SHARE AND RE-POST...", "The smuggled arms had a compelling purported connection to Yavex USA and Fort Meyers, Florida in their September 2016 iteration, and some additional images were added to the original set. However, the original claim and images remained misrepresented, albeit with a novel hook inspiring American social media users to again share the rumor.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]