["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Lt. Gov. Casey Cagle has pitched his candidacy for Georgia governor as a promise to maintain Georgia’s reputation as one of the most business-friendly states in the country.", "\"Keep Georgia the No. 1 state to do business,\" the Republican's campaign website says.", "\"There is no doubt. When you look today, for four years in a row we are the No. 1 state to do business in, and there is room to grow,\" Cagle told small-business owners in Thomasville, Ga., June 22, according to WALB news.", "Is that true?", "In saying Georgia is the No. 1 state to do business, Cagle was citing a list put together by Site Selection, a magazine that specializes in business relocation and expansion, campaign spokesman Joseph Hendricks told us.", "Site Selection said Georgia had the best business climate in the country for the fourth year in a row.", "As evidence of Georgia’s success, the Site Selection article pointed to growth in foreign direct investment and the film, health and auto industries. It also listed several major corporations that have recently decided to expand in Georgia: athletic shoes manufacturer Adidas, health benefits company Anthem, diversified technology company Honeywell, and tire manufacturer Sentury Tire.", "Site Selection is the \"go-to magazine for site selection professionals,\" said Jeff Humphreys, director of the Simon S. Selig Center for Economic Growth at the University of Georgia Terry College of Business.", "Cagle is far from the only Georgia official to reference the Site Selection ranking. It's been touted by the Georgia Department of Economic Development, Gov. Nathan Deal and the Georgia Chamber of Commerce.", "Site Selection is a credible source, experts told us — but they added it’s not the only one.", "Among the better-known and respected rankings, CNBC places Georgia second, while Forbes places it seventh. Those aren’t first-place rankings, but they’re still pretty high.", "Other credible rankings, though, have Georgia lower. The Beacon Hill Institute for Public Policy Research, for instance, placed Georgia 24th.", "Indeed, when researchers at Ball State University created a composite score for each state using a number of these best-state-for-business rankings, their measure placed Georgia No. 15 in 2016. That’s basically in the top one-third of states.", "\"The problem with rankings always lies in the factors they include,\" said John E. Gnuschke, director of the Sparks Bureau of Business and Economic Research at the University of Memphis. \"No standard scale exists for saying that one state is better.\"", "The Site Selection methodology gives half its weight to a survey of corporate site selectors, and the other half to an index of seven metrics, including facility locations and expansions, total projects, and tax burdens.", "\"This topic is an enormous can of methodological worms,\" said Lee McPheters, an economist at the W. P. Carey School of Business at Arizona State University.", "As researchers at Arizona State University noted in a 2014 report, the list of factors important in siting a headquarters or research and development facility \"can be quite different from the most important factors in locating a manufacturing plant or some other type of facility.\"", "In addition, experts said, the question of how much weight to give to low business taxes and regulation ultimately owes something to a value judgment about what’s important.", "Michael Leeds, who chairs the economics department at Temple University, cautioned that \"the best place ‘to do business’ is not always the best place to work.\"", "Cagle, talking about his state of Georgia, said, \"for four years in a row, we are the No. 1 state to do business in.\"", "A well-regarded business magazine, Site Selection, has listed Georgia as its best state for business for the past four years. But that’s just one publication’s ranking; others offered different ratings, and it’s impossible to say that one methodology is the perfect one.", "Cagle's statement is partially accurate. We rate it Half True.", "WALB News, \"Lt. Governor Casey Cagle visits Downtown Thomasvile,\" June 22, 2016", "Site Selection, \"The Gold Standard: How Georgia Wins a Fourth Consecutive Top Business Climate Billing,\" November 2016", "Georgia Office of the Governor, \"Georgia ranked No. 1 state for business for fourth consecutive year,\" Nov. 2, 2016", "Ball State University, \"Ranking States’ Business Climates: Developing an Average Index of State Business Climate Rankings,\" June 17, 2016", "Business Insider, \"The best and worst states to start a business,\" Oct. 22, 2016", "24/7 Wall Street, \"The Best (and Worst) States for Business,\" Feb. 17, 2016", "WalletHub, \"2017’s Best & Worst States to Start a Business,\" July 5, 2017", "Chief Executive, \"2017 Best & Worst States For Business,\" accessed July 16 2017", "CNBC, \"America's Top States for Business 2017,\" July 11, 2017", "Forbes, \"Best States For Business,\" Nov. 16, 2016", "UGA Today, \"UGA experts predict a bright economy for 2017,\" Dec. 14, 2016", "Site Selection, methodology, accessed July 17, 2017", "Arizona State University, \"Overview of Economic Competitiveness, Business and Individual Location Factors, with a Focus on Arizona,\" November 2014", "Beacon Hill Institute, \"Some things rarely change: Massachusetts again retains top ranking in BHI competitiveness index,\" July 29, 2016", "Interview, Jeffrey Humphreys, director of the Center for Economic Growth at the UGA Terry School of Business, July 16, 2017", "Email interview with Jeffrey Michael, director of the Center for Business and Policy Research at the University of the Pacific, July 18, 2017", "Email interview with Lee McPheters, economist at the W. P. Carey School of Business at Arizona State University, July 18, 2017", "Email interview with Michael Leeds, chair of the economics department at Temple University, July 18, 2017", "Email interview with John E. Gnuschke, director of the Sparks Bureau of Business and Economic Research at the University of Memphis, July 18, 2017", "Email interview with Joseph Hendricks, communications director for Casey Cagle, July 18, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]