["About this rating", "Voting in the 2020 U.S. Election may be over, but the misinformation keeps on ticking. Never stop fact-checking. Follow our post-election coverage here.", "On Nov. 15, 2020, former U.S. President Barack Obama sat down for an interview on \"60 Minutes\" with CBS reporter Scott Pelley. The interview took place about a week after Obama's former vice president, Joe Biden, was named the winner of the 2020 election and while incumbent U.S. President Donald Trump was still refusing to concede defeat to his political opponent.", "At one point, Pelley asked Obama if he had any advice for the outgoing president.", "Scott Pelley: What is your advice in this moment for President Trump?", "Barack Obama: Well, a president is a public servant. They are temporary occupants of the office, by design. And when your time is up then it is your job to put the country first and think beyond your own ego, and your own interests, and your own disappointments. My advice to President Trump is, if you want at this late stage in the game to be remembered as somebody who put country first, it's time for you to do the same thing.", "Obama's advice to Trump in 2020 was similar to the advice he gave to Trump when he first took office in 2017. CBS reporter Geoff Bennet noted the similarities on Twitter:", "This is a paraphrased quote from Obama's letter to Trump in 2017.", "Outgoing presidents often leave messages of advice or encouragement to their successors. In 2017, when Obama left office following Trump's election victory, he continued this tradition by leaving a note for the incoming president. CNN obtained a copy of this letter in Sept. 2017, the text of which is reproduced below. He emphasized the relevant portion in this text:", "Dear Mr. President,", "Congratulations on a remarkable run. Millions have placed their hopes in you, and all of us, regardless of party, should hope for expanded prosperity and security during your tenure.", "This is a unique office, without a clear blueprint for success, so I don't know that any advice from me will be particularly helpful. Still, let me offer a few reflections from the past 8 years.", "First, we've both been blessed, in different ways, with great good fortune. Not everyone is so lucky. It's up to us to do everything we can (to) build more ladders of success for every child and family that's willing to work hard.", "Second, American leadership in this world really is indispensable. It's up to us, through action and example, to sustain the international order that's expanded steadily since the end of the Cold War, and upon which our own wealth and safety depend.", "Third, we are just temporary occupants of this office. That makes us guardians of those democratic institutions and traditions -- like rule of law, separation of powers, equal protection and civil liberties -- that our forebears fought and bled for. Regardless of the push and pull of daily politics, it's up to us to leave those instruments of our democracy at least as strong as we found them.", "And finally, take time, in the rush of events and responsibilities, for friends and family. They'll get you through the inevitable rough patches.", "Michelle and I wish you and Melania the very best as you embark on this great adventure, and know that we stand ready to help in any ways which we can.", "Good luck and Godspeed,", "BO", "Obama, of course, was not the first president to write his successor a note welcoming to the White House. Here is the letter that U.S. President George W. Bush wrote to Obama in 2009. You can view an image of this letter here.", "Dear Barack,", "Congratulations on becoming our President. You have just begun a fantastic chapter in your life.", "Very few have had the honor of knowing the responsibility you now feel. Very few know the excitement of the moment and the challenges you will face.", "There will be trying moments. The critics will rage. Your “friends” will disappoint you. But, you will have an Almighty God to comfort you, a family who loves you, and a country that is pulling for you, including me. No matter what comes, you will be inspired by the character and compassion of the people you now lead.", "God bless you.", "Sincerely,", "GW", "Here is the letter President Bill Clinton wrote to Bush in 2001. You can view a copy of this letter here.", "Dear George,", "Today you embark on the greatest venture, with the greatest honor, that can come to an American citizen.", "Like me, you are especially fortunate to lead our country in a time of profound and largely positive change, when old questions, not just about the role of government, but about the very nature of our nation, must be answered anew.", "You lead a proud, decent, good people. And from this day you are President of all of us. I salute you and wish you success and much happiness.", "The burdens you now shoulder are great but often exaggerated. The sheer joy of doing what you believe is right is inexpressible.", "My prayers are with you and your family. Godspeed.", "Sincerely, Bill", "And here's a letter President George H.W. Bush wrote to Clinton in 1993. You can view a copy of this letter here.", "Dear Bill,", "When I walked into this office just now I felt the same sense of wonder and respect that I felt four years ago. I know you will feel that, too.", "I wish you great happiness here. I never felt the loneliness some Presidents have described.", "There will be very tough times, made even more difficult by criticism you may not think is fair. I’m not a very good one to give advice; but just don’t let the critics discourage you or push you off course.", "You will be our President when you read this note. I wish you well. I wish your family well.", "Your success now is our country’s success. I am rooting hard for you.", "Good Luck — George", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]