["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Former Florida Gov. Jeb Bush speaks at a town hall in Concord, New Hampshire Oct. 14, 2015. (Concord Monitor)", "A high school student at a New Hampshire town hall quizzed Jeb Bush on how he will close tax loopholes for the rich.", "Bush said that although tax brackets are progressive -- meaning the more you earn, the more you pay -- they end up being regressive because rich people invest in the stock market and then have less taxable income.", "\"On taxes, we do have a progressive tax rate when you consider that the top 1 percent pay 45 percent of all taxes in the country,\" Bush said during the Oct. 14 town hall in Concord. \"That is a fairly disproportionate amount.\"", "Bush then summarized his tax proposal, which includes a tax break for the rich as well as the middle class and cuts the corporate tax rate. Also under Bush’s plan, a family of four that earns $40,000 or less would pay no federal income taxes.", "We wanted to look at Bush’s comment about how much the wealthy pays in taxes. Does the top 1 percent pay nearly half the taxes in the country?", "Income taxes vs. all federal taxes", "We found that the accuracy of Bush’s comment depends on what type of federal taxes we consider. (Our analysis won’t cover state and local taxes, which vary across the country.)", "The Tax Policy Center, home to widely quoted nonpartisan experts on taxes, calculated in June that the top 1 percent will have 16.5 percent of total income in 2015 and pay 43.6 percent of federal income taxes.", "So Bush would have been very close to correct if he had specified income taxes, but instead he said \"all taxes.\"", "If we consider all federal taxes, the proportion paid by the top 1 percent is less than what was cited by Bush: 27.9 percent. That calculation by the Tax Policy Center includes a slew of federal taxes that includes income, payroll, corporate, estate and excise taxes.", "\"It’s the difference between all taxes and federal income taxes,\" said Mike Tanner, a tax expert at the libertarian Cato Institute. \"He didn’t say federal income tax, but if he is talking about federal income tax he is right.\"", "It’s important to note that while both calculations show an overall progressive federal tax system -- meaning the more you earn, the more you pay -- certain types of taxes are regressive, including payroll and excise taxes. The top 1 percent pay just 5.5 percent of payroll taxes even though they earn about 16.5 percent of total income. In contrast, the middle quintile has 13.8 percent of total income but pay 15.8 percent of payroll taxes.", "We found another calculation that shows slightly lower numbers than the Tax Policy Center for how much the wealthy pay in taxes. The Congressional Budget Office found that for 2011, the top 1 percent received 14.6 percent of before-tax income and paid 24 percent of all federal taxes and 35.4 percent of all individual income taxes. (The November 2014 report is the office’s most recent one, but it looks at numbers that are a few years older than the Tax Policy Center report.)", "We sent a spokesman for Bush’s campaign a summary of our findings. Matt Gorman said that Bush was responding to questions about the progressivity about federal income tax brackets.", "The student did talk about \"tax brackets\" and closing \"tax holes for rich people,\" but he didn’t directly ask a question about \"federal income tax rates.\" (Here is PolitiFact’s transcript of their exchange.)", "Our ruling", "Bush said, \"the top 1 percent pay 45 percent of all taxes in the country.\"", "Bush was answering a question about taxable income, the progressivity of our tax system and closing loopholes for the rich. So part of the question he faced related to income taxes. And part of his answer related to income taxes, because he talked about his own plan for income tax cuts.", "But Bush could have been more specific in his reply. The 45 percent number applies to federal income taxes, not all taxes. Bush spoke generically about \"all taxes,\" so if we look at all federal taxes, the share for the top 1 percent was 27.9 percent.", "We rate this claim Half True.", "Tax Policy Center, Share of federal taxes, June 23, 2015", "Congressional Budget Office, \"The distribution of household income and federal taxes in 2011,\" November 2014", "Pew Research Center, \"High-income Americans pay most income taxes, but enough to be ‘fair?’\" March 24, 2015,", "Tax Foundation, Details and analysis of jeb Bush’s tax plan, Sept. 10, 2015", "New York Times, \"Jeb Bush’s tax plan is a large tax cut for the wealthiest,\" Sept. 9, 2015", "CNBC, \"The top 1 percent pay nearly half of all federal income taxes,\" April 14, 2015", "PolitiFact, Transcript of a tax question posed at a Jeb Bush town hall in Concord, New Hampshire, Oct. 14, 2015", "Interview, Michael Tanner, Cato Institute senior fellow, Oct. 19, 2015", "Interview, Roberton Williams, Tax Policy Center Sol Price Fellow, Oct. 19, 2015", "Interview, Matt Gorman, Jeb Bush spokesman, Oct. 19, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]