["The video, which has been viewed more than a million times in this July 9, 2019 tweet, shows an airplane coming into land as an oil tanker parks across the runway, prompting the airplane to take off again, narrowing avoiding a collision.", "The Spanish-language tweet translates to English as: “Terrorist attack in Algeria, which fails to work because of the pilot's immense skill”.", "Below is a screenshot of the tweet:", "The 51 second video has also been viewed more than 34,000 times in this Twitter post uploaded on July 6, 2019.", "The caption of the post says: “Mis-coordination between departments working at any airport in the world can lead to a major disaster. In this clip an oil tanker was crossing runway and at the [sic] same time an aircraft fully loaded with passengers landed. One must appreciate [as] how pilot save lives of the passengers”.", "Below is a screenshot of the misleading tweet:", "The video has been viewed thousands of times here and here on Facebook, here and here on Twitter, and here on YouTube with an almost identical claim.", "The claim is false; the video does not show a real-life event, it has been taken from a simulation video game.", "AFP conducted keyword and reverse image searches on Google and found a very similar clip, in much higher-definition, at the one minute 32 seconds mark in a video published here on a gaming YouTube channel on June 20, 2019.", "The video, entitled “GTA5 -- An \"Oil Tanker\" Accidentally Came in the Runway during landing of A380…”, shows a pilot i.e. gamer’s success in “averting” a plane-oil tanker collision.", "GTA5 refers to Grand Theft Auto V, an action-adventure video game published by American video game company Rockstar Games.", "Below is a screenshot comparison of footage in the misleading tweet (L) and the YouTube video (R):", "A journalist in AFP's Delhi bureau contacted the creator of the YouTube, Pakistan based gamer Umer Imran.", "He told AFP in an email on July 10: \"This is just a game clip of GTA5.\"", "Other GTA5 gamers’ attempts to “land” an A380 can be seen in similar YouTube videos here and here.", "France 24 and VICE reported in July the false claim started gaining attention after Pakistani politician Khurram Nawaz Gandapur tweeted the video on July 5, 2019.", "Khurram Nawaz Gandapur, Secretary-General of the Pakistan Awami Tereek party, wrote in the caption of the post: “Narrow escape of an aircraft which could have ended in a great disaster. Miraculous save by the pilot’s presence of mind.”", "The now-deleted tweet can be viewed here on digital archive site archive.today.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]