["About this rating", "Static electricity can touch off refueling fires at gas stations.", "Static electricity has not definitively been identified as the cause of a number of gas station refueling fires.", "[Collected on the Internet, 2002]", "Bob Renkes of Petroleum Equipment Institute is working on a campaign to try and make people aware of fires as a result of \"static\" at gas pumps. His company has researched 150 cases of these fires. His results were very surprising:", "1) Out of 150 cases, almost all of them were women.", "2) Almost all cases involved the person getting back in their vehicle while the nozzle was still pumping gas, when finished and they went back to pull the nozzle out the fire started, as a result of static.", "3) Most had on rubber-soled shoes.", "4) Most men never get back in their vehicle until completely finished. This is why they are seldom involved in these types of fires.", "5) Don't ever use cell phones when pumping gas", "6) It is the vapors that come out of the gas that cause the fire, when connected with static charges.", "7) There were 29 fires where the vehicle was reentered and the nozzle was touched during refueling from a variety of makes and models. Some resulting in extensive damage to the vehicle, to the station, and to the customer.", "8) Seventeen fires that occurred before, during or immediately after the gas cap was removed and before fueling began.", "Mr. Renkes stresses to NEVER get back into your vehicle while filling it with gas. If you absolutely HAVE to get in your vehicle while the gas is pumping, make sure you get out, close the door TOUCHING THE METAL, before you ever pull the nozzle out. This way the static from your body will be discharged before you ever remove the nozzle.", "As I mentioned earlier, The Petroleum Equipment Institute, along with several other companies now, are really trying to make the public aware of this danger. You can find out more information by going to https://www.pei.org . Once here, click in the center of the screen where it says \"Stop Static\".", "I ask you to please send this information to ALL your family and friends, especially those who have kids in the car with them while pumping gas. If this were to happen to them, they may not be able to get the children out in time.", "Unlike many Internet-circulated warnings, this one had a fair bit of substance to it: fires at gas pumps were on the rise, and static electricity was considered one of the likely culprits in that increase. However, there's a great deal wrong with the summary quoted in the example above, a situation that illustrates the danger of accepting as gospel whatever turns up in your inbox. We'll take you through it, sorting information from misinformation.", "For starters, although Robert N. Renkes, Executive Vice President & General Counsel of the Petroleum Equipment Institute, did prepare a summary of refueling fires which appears on the PEI web site, most of the statements in the text of the circulating message quoted above grossly misrepresent that summary:", "The summary appearing on the PEI site states that \"To date over 150 refueling fires have been documented that appear to be caused by a discharge of static electricity\"; it does not say data from those 150 fires were used in preparing the summary (and it includes information about only 81 gas station fire incident reports).   More specifically, neither the summary nor any of the incident reports makes any statement about or identifies the gender of persons involved in gas station fires.", "The PEI summary states:", "Twenty (20) reports described fires before the refueling process began, when the fueler touched the gas cap or the area close to it after leaving the vehicle. Twenty-nine (29) fires occurred when the fueler returned to the vehicle during the refueling process and then touched the nozzle after leaving the vehicle. Fifteen (15) fires do not involve either of these two fact situations. We received insufficient information on seventeen (17) fires reported by NHTSA to confidently categorize them.", "In other words, 29 out of 81 cited cases of gas station fires involved fires reported to have occurred when drivers returned to their cars during the refueling process.  A 36% figure is rarely equated with the term \"almost all.\"", "The summary states that \"Rubber-soled shoes were worn by the refuelers in 94% of the accidents where footwear was identified (emphasis ours).  Whether this figure is representative of all persons involved in gas station fires and whether footwear is a contributory factor to gas station fires is not stated.", "As noted above, neither the PEI summary nor the cited incident reports makes any statement about or identifies the gender of persons involved in gas station fires.", "At this point we have to wonder whether the author of this piece was reading the same summary we are. The PEI's summary states quite plainly that No cell phones were involved in any reports of gas station fires.", "Mr. Renkes states in his summary that \"In many of the reports we received, the refueler became charged prior to or during the refueling process through friction between clothing and the car seat to such an extent that electrostatic discharges to the vehicle body, fuel cap or dispensing nozzle occurred,\"  but he makes no statement about whether or not drivers should return to their vehicles during the refueling process.  (\"Never re-enter your vehicle\" is one of the \"Three Rules for Safe Refueling\" listed on the PEI's Stop Static page; it is not a part of Mr. Renkes' summary.)", "Are gas station fires caused by static discharge a real danger to motorists?  As the PEI notes, \"the dispensing of gasoline into the fuel tank of a motor vehicle is a safe operation,\" and  \"Americans pump gasoline into their cars between 16 and 18 billion times a year generally without incident,\" but fires related to refueling at gas stations seem to be on the rise, and many of these fires are apparently not the result of the usual causes: open flames (mostly from cigarette smokers), sparks from the engine compartments of automobiles (primarily from drivers refueling cars with their motors running), or a lack of electrical continuity between nozzles and grounded dispensers.  The PEI states that they \"don't have any definitive answers\" about the reasons for this increase, but they're trying \"to collect information on similar incidents so the industry can get a better handle on the cause(s) of the problem.\"", "Since virtually all the reported fires not attributable to the usual causes cited above have occurred during exceptionally dry weather, the working theory is that static electricity was the source of ignition.  Why fires touched off by static electricity may have increased significantly of late remains undetermined, however, and groups such as the PEI are investigating several possible explanations:", "News reports of gas station fires caused by static electricity are a mixed bag of claims, warnings, and skepticism.  In 2001, for example, automaker BMW announced a recall to refit cars they said had been responsible for two static-related fires:", "BMW AG said it is recalling all of its new Mini cars sold in Britain to fix a design fault that already has caused two fires — days before the relaunched classic car goes on sale across Europe.", "The improved grounding is to prevent static electricity from producing a spark when the fuel nozzle is inserted into the gas tank, BMW spokesman Rudolf Probst said. The company blamed static electricity for igniting fuel vapor and causing two small fires, one in a car at a dealership and the other during testing.1", "Two gas station fires in Missouri that same year were attributed to static as well, prompting a warning from the officials at the state's agriculture department:", "In Macon, about 60 miles north of Columbia, a minivan burned up at a Casey's Store on Nov. 17. Five children inside the van escaped safely.", "The Macon Fire Department said the fire probably began when the motorist touched the nozzle at the end of fueling, making a static spark that ignited fumes. She was wearing a wool sweater and told firefighters she had been bothered by static all day.", "In Hannibal, 100 miles north of St. Louis, a pickup was damaged Dec. 26 in a similar fire. The motorist dropped the flaming nozzle onto the ground, spreading the flames.", "\"The guy went to grab the nozzle, and the next thing he knew there was fire everywhere,\" said Hannibal Assistant Fire Chief David Hymers. \"He had been sitting in his truck because of the cold. The spark could have come from him sliding across his seat.\"2", "Cold, dry air causes more static electricity, and gasoline vapors naturally are released during fueling, said Ron Hooker, administrator of the [state agriculture] department's fuel program. \"Combine that with the fabric friction caused by people getting in and out of their cars when filling their tanks, and you have the potential for static sparks,\" Hooker said.", "Last year, state inspectors investigated 14 gas station fires. In each case, customers got out from their vehicles, placed gasoline nozzles in the fuel tanks, began fueling and then got back into their vehicles. When the pumps shut off, the customers got out of their vehicles and reached for the gas nozzles, causing a spark that ignited the vapors, Hooker said.", "To reduce the risk of static electricity fires, Hooker said motorists should touch the metal part of their vehicle doors while getting out to put gas in their vehicles. That should discharge any built-up static electricity before the fueling begins, he said.", "After fueling, motorists should again touch their vehicles far away from the gas nozzles before returning the nozzles to the pumps, Hooker said. 3", "Portable fuel containers have also been claimed as one of the leading causes of static-caused fires:", "Do you know how to use a portable fuel container safely?", "It's a task that must always be done with safety in mind, according to the National Highway Traffic Safety Administration, the American Petroleum Institute and other safety and fuel experts. \"Gasoline fumes are volatile. Static electricity can create a spark that could cause a fire if it's near gasoline fumes,\" said Commissioner Harold Hairston of the Philadelphia Fire Department. He is a past chairman of the Metropolitan Fire Chiefs Association.", "\"Even many safety conscious people may not be aware of the proper way to fill a portable fuel container,\" Hairston said.", "\"Grounding is essential to avoid any build-up of static electricity that could pose a risk,\" Hairston said.", "Grounding, simply put, provides a path for an electric current to discharge safely — the electricity is dissipated in the ground, when a portable fuel container is grounded.", "\"Every time you pump gasoline, a charge of electricity builds up on gasoline as it flows through a pipe or hose and this charge takes several seconds to several minutes to dissipate after the gasoline has reached the tank or container,\" explains Bob Renkes, executive director of the Petroleum Equipment Institute. \"That risk is avoided when you pump gasoline into your car, because both the gasoline dispenser and the vehicle are grounded.", "\"But a portable fuel container may not be grounded. For safety, you need to place the container on the ground and fill it on the ground,\" he said. \"Placing the container on the ground makes it easier for the electrical charge to escape.\"", "\"To help avoid risks, follow safety procedures every time you use a portable fuel container. Don't take any chances,\" Hairston said.4", "Some claims of static-triggered fires have been disputed by investigating officials:", "A man filling his motor home with gasoline narrowly escaped serious injury yesterday after an explosion in the gas tank set his vehicle on fire, sent nearby pumps up in flames and charred the exterior of the gas station.", "[Manor Township Fire Chief Dan Dunmire] said static electricity on the car might have sparked in the gas tank and caused it to catch on fire. He admitted his explanation might cause concern to people who pump gas.", "\"It could happen at any gas pump, at any time,\" he said, \"to cars, pick-up trucks, anything.\"", "But Randy Brozenick, director of Armstrong County's Emergency Management Agency, called the static electricity explanation \"speculation.\"", "\"This one's got me baffled,\" said Brozenick, who has investigated explosions at gas stations before. \"There really wasn't anything near that gas tank.\"", "Damages to the gas station, which is owned and operated by Lockard Co. of Indiana, Pa., could reach the \"six figures,\" said Ron McLean, retail sales manager of Lockard.", "Like Brozenick, McLean said he was also unconvinced by the static electricity argument. He said heating units inside the motor home might have contributed to the fire.5", "Even reports that maintain that \"static-induced fires are well documented\" point out that no case of a fire triggered by a cell phone — a commonly-cited cause of gas station fires — has ever been confirmed:", "During recent months, reports of flash fires during refueling have increased so much that industry executives and engineers find it necessary to alert the public. BP Amoco has posted an advisory on its Web site, and other gasoline retailers are considering pump-side warnings similar to QT's. The incidents most often involve flames shooting from a vehicle's gas tank opening. The primary culprit appears to be static electricity.", "In many cases, the victims got in and out of their vehicles during fueling. Rubbing against fabric creates an electric charge just like the one that causes a shock when you touch something metal after shuffling across carpet.", "Injuries have included burns and singed hair. At least one woman was killed when she removed a flaming nozzle from a gas tank and accidentally doused herself with gasoline, according to Bob Renkes, executive vice president of the Petroleum Equipment Institute.", "Considering that Americans pump gasoline into their cars more than 16 billion times per year, flash fires at the tank are rare. Metro Atlantans have even less to worry about. Since the region doesn't meet federal air quality standards, gas pumps here are required to have vapor recovery systems that suck the gasoline fumes back into the nozzle. Travel season is near, however, so Atlantans should still beware.", "Unlike recent warnings about cell phones igniting fires at gas pumps — a case of which has never been confirmed — the static-induced fires are well documented.6", "For those who feel the possibility of static-caused fires warrants caution at the gas pumps, the Oklahoma Corporation Commission offers the following tips:", "Tips for safe refueling:", "Avoid spills:", "<!--\nAdditional information:", "Statistics on Fueling Station Fires Caused by Static    (Petroleum Equipment Institute)", "-->", "5.   Abels, Caroline.   \"Man Filling Motor Home with Gas Narrowly Escapes Serious Injury.\"\r\n    Pittsburgh Post-Gazette.   25 March 1998   (p. B1).", "Hill, Mary Jo.   \"Fire Damages Car, Garage.\"\r\n    [Worcester] Telegram & Gazette.   16 February 2002   (p. A4).", "McGinn, Molly.   \"Cut Engine to Pump Gas, Firefighters, Mechanics Say.\"\r\n    [Greensboro] News & Record.   5 December 2000   (p. A1).", "7.   Mulkins, Phil.   \"Don't Blow Yourself Up at the Filling Station.\"\r\n    Tulsa World.   6 July 2000   (p. A1).", "Rhee, Susan.   \"Quick Flick Nearly Ignites Catastrophe.\"\r\n    The [Durham] Herald-Sun.   23 January 2000   (p. B1).", "6.   Stanford, Duane D.   \"Beware: Static Charge at Pump May Be More Than Shocking.\"\r\n    The Atlanta Journal and Constitution.   1 December 2000   (p. B1).", "Associated Press.   \"Customer Engulfed in Flames at Gas Pump.\"\r\n    1 December 2000.", "Associated Press.   \"Static Electricity to Blame for Fires at Gas Pumps.\"\r\n    12 December 2000.", "3.   Associated Press.   \"Ag Department Warns Motorists About Static Electricity Fires.\"\r\n    18 January 2001.", "2.   Associated Press.   \"Fires Blamed on Static Electricity at the Gas Pumps.\"\r\n    31 January 2001.", "1.   Associated Press.   \"BMW Recalling New Mini for Modifications After Report of Fires.\"\r\n    3 September 2001.", "4.   Chicago Sun-Times.   \"Fill Gas Containers with Safety in Mind.\"\r\n    2 July 2000   (Homes News; p. 3).", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]