["About this rating", "The order states, “Children should be able to learn without worrying about whether they will be denied access to the restroom, the locker room, or school sports.” The order also calls for protection against discrimination based on gender identity or sexual orientation.", "However, the order does not explicitly address transgender women in sports. Its main clause could be challenged in numerous states where bills are being pushed that restrict the participation of transgender students in athletics.", "U.S. President Joe Biden signed a flurry of executive orders after his inauguration on Jan. 20, 2021. In one order, titled “Executive Order on Preventing and Combating Discrimination on the Basis of Gender Identity or Sexual Orientation,” he called on federal agencies to enforce a 2020 U.S. Supreme Court decision that expanded the definition of sex discrimination to include discrimination based on sexual orientation as well as gender identity.", "This particular order stated: “Every person should be treated with respect and dignity and should be able to live without fear, no matter who they are or whom they love. Children should be able to learn without worrying about whether they will be denied access to the restroom, the locker room, or school sports.”", "The order cites the case of Bostock v. Clayton County (2020), where the “Supreme Court held that Title VII’s prohibition on discrimination “because of ... sex” covers discrimination on the basis of gender identity and sexual orientation.” It mandates that every federal agency must act to ensure the enforcement of this new rule within 100 days of Jan. 20. The order states that the Supreme Court ruling should apply to Title IX, the federal law that prohibits discrimination in federally funded schools.", "This means that the executive order could apply to the protection of transgender athletes in schools, who are being prevented from participating in sports that align with their gender identities. But the order does not explicitly state that as such.", "Meanwhile, lawmakers in dozens of states including Montana are pushing bills that restrict transgender athletes' participation in sports. Such bills could put federal funding for schools in those states at risk. The issue is also being litigated in Connecticut, where several girls are challenging a state policy that allows transgender athletes to compete in sports in line with their gender identity. They argue that transgender female runners have an unfair physical advantage.", "Given that the order does not explicitly address the issue of transgender women in sports, but does argue that school sports should not discriminate against students on the basis of their gender identity, we rate this claim a “Mixture.”", "Nur Nasreen Ibrahim is a reporter with experience working in television, international news coverage, fact checking, and creative writing.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]