["Among those sharing the image was a Facebook account in the US called “Rogue Nasa”, which changed its name from “Rogue News Media” in 2017. The post has been shared more than 21,000 times since it was published on September 27, 2020.", "“Earth, Venus and Jupiter as seen from Mars,” reads the caption on the post featuring an image that appears to be cropped out from a similar but larger version.", "The same claim also circulated on social media in Spanish (here and here), Portuguese, Arabic and German.", "False and misleading posts claiming to show Mars have proliferated on social media since NASA’s Perseverance rover landed on the Red Planet on February 18, 2021. AFP reported on the historic mission.", "However, AFP Fact Check found that the image claiming to show the trio of planets visible from Mars is computer-generated and has been shared out of context.", "A search of NASA’s website failed to turn up the image. Instead, AFP Fact Check traced the photo to a July 2010 post on Riofrio Spacetime, a blog owned by scientist Louise Riofrio.", "She told AFP Fact Check that she had published the image in a blog post as an illustration.", "“I am the sole creator of the Mars illustrations first posted on my blog in June 2010,” Riofrio wrote in an emailed response. “I calculated and created them with the Apple iBook computer in my home.”", "While the original 2010 post did not carry a caption, Riofrio republished the image on her blog on July 15, 2020, explaining: “This is the view you would see looking East from Gusev Crater at local sunrise, 1:14 PM Universal Time.”", "Gusev Crater is a 144 kilometre-wide (90 miles) depression created on the surface of Mars billions of years ago when an asteroid crashed into the planet.", "Riofrio is currently a Crew Candidate for the #DearMoon mission to travel around the Moon on a SpaceX Starship in 2023. But at the time her 2010 blog post was published, she was working as a scientist at NASA Johnson Space Center in Houston.", "“I worked with the researchers who in 1996 discovered signs of fossil life on Martian Meteorite ALH84001,” she said.", "Multiple reverse image searches found that the photo has been circulating alongside the claim since at least 2012 when American astronomer Phil Plait reviewed the image and confirmed it was computer-generated.", "In an article for Discovery Magazine, Plait explained that the symbol for northeast (NE) visible in the lower left-hand corner of the viral image matches with photos digitally produced with planetarium computer software such as Starry Night and SkySafari to display the sky.", "The symbol indicates the cardinal direction the viewer of the generated image is facing, according to Plait.", "“It’s clear that’s what we have here: a rendered view from Mars using planetarium software,” he wrote. “Mind you, the picture itself isn’t a hoax! It’s just a computer-generated image probably meant to represent a real scene. But it got spread around the net, and before you know it people think it’s real.”", "He added that his simulation on the positions of the planetary bodies in mid-2010 using the planetarium software found that the view from Mars right after sunset would show Venus, Earth, and Jupiter lined up in a similar way to the viral photo.", "While the image does not show a true picture of Earth, Venus and Jupiter from Mars, NASA has previously documented similar views of some planets from Mars.", "NASA’s Mars Exploration Rover Spirit captured the first image ever taken of Earth in 2004 on the website of its Jet Propulsion Laboratory. The agency’s Mars Curiosity Rover also took a 2014 view of the Earth and Moon in the Martian night sky, as well as Earth and Venus in 2020.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]