["“Turns out 118 year old ‘William Bradley’ voted via absentee ballot in Wayne County, Michigan. William Bradley died in 1984,” said a November 5, 2020 tweet that has been retweeted tens of thousands of times.", "The claim about Bradley -- which has also been made on Facebook, YouTube and Reddit -- is circulating online as US President Donald Trump insists without evidence that Democrats cheated to help Joe Biden in the election, and that he in fact won.", "Some social media posts encouraged people to input Bradley’s details into the Michigan Voter Information Center site, which returns a record of an absentee ballot being sent to him on September 19 and received on October 2.", "But “no ballot for the 118-year-old Mr. Bradley was ever requested, received or counted,” Lawrence Garcia, Detroit Corporation Counsel, said in a statement sent to AFP by email.", "“A man with a nearly identical name requested a ballot and voted properly in both the primary and general elections. When his ballot was initially logged, however, it was incorrectly attributed to the William Bradley born 118 years ago through a clerical error,” Garcia said.", "Tracy Wimmer, director of media relations for Michigan’s secretary of state, said that “there are 2 William Bradleys in the Qualified Voter File” registered at the same address, “one born 1902 and one born 1959.”", "“The 1959 Bradley is a regular voter. In this election, the 1902 Bradley is recorded as having voted and the 1959 is not,” she said by email.", "Wimmer also said that ballots cast on behalf of deceased voters would not be accepted.", "“Ballots of voters who have died are rejected in Michigan, even if the voter cast an absentee ballot and then died before Election Day,” she said.", "AFP Fact Check has debunked a series of inaccurate claims of fraud in the 2020 general election, which can be viewed in English here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]