["The photo was shared on Facebook here on December 18, 2020.", "The post’s Urdu-language caption translates as: “Islamic Republic of Free State Pakistan. Government of honests and contractors of democracy and this is the condition of Member National Assembly Ali Wazir.”", "The image was shared alongside another image of opposition lawmaker Ali Wazir in handcuffs.", "Wazir was arrested on December 16, 2020, in the northwestern city of Peshawar for allegedly making “derogatory remarks against state institutions” and “hatching a criminal conspiracy”, Pakistani newspaper Dawn reported here.", "The first photo showing Wazir being escorted by a police officer was published in The Pakistan Daily here on December 18, 2020.", "The photo has been shared more than 950 times after it was also published alongside a similar claim on Facebook here and here; and on Twitter here, here and here.", "The claim, however, is false.", "A Google reverse image search found the photo of a person sleeping on the floor was posted by the Australian Broadcasting Corporation (ABC) here on October 14, 2008. The title reads: “Homelessness”. The caption reads: “Homeless person sleeps under blanket in Brisbane street,” and the photo is credited to ABC TV News.", "Below is a screenshot comparison of the photo on the ABC website (L) and the photo shared in the misleading post (R) – AFP has marked the corresponding features in red:", "The image was published again in ABC reports about homelessness in Australia in here in March 2018 and here in April 2020.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]