["About this rating", "In late September 2019, the anti-Muslim hate site Frontlines News published a bogus story reporting that \"Muslims in Switzerland are demanding that the white cross be removed from the Swiss national flag because as a Christian symbol it 'no longer corresponds to today’s multicultural Switzerland.'\"", "The story contains a thumbnail image of men holding up a flag and burning it.\n\nThe image was not taken recently and it wasn't taken in Switzerland — in fact, the flag being burned is Danish, not Swiss. The photograph in question was taken by Agence France-Presse photographer Rizwan Tabassum in February 2006 in Karachi, Pakistan. According to the picture's caption, it depicts men burning a flag in response to outrage over cartoons in European newspapers depicting the Prophet Muhammad, the central figure of Islam. Generally, depicting Muhammad in images and statues is forbidden for observant Muslims.", "Frontlines News quotes and links to a story that was originally published by the Gatestone Institute, an anti-Muslim, non-profit organization that, as NBC News reported in April 2018, \"promoted misleading and false anti-Muslim news, some of which was amplified by a Russian troll factory\" in the lead-up to the 2016 U.S. presidential elections.", "The Gatestone story cited by Frontlines News quotes only one source, Ivica Petrusic, who was the vice president of the Swiss social justice advocacy group Second@s Plus. Petrusic was quoted saying the cross should be removed from the flag to reflect a separation between church and state and the country's growing cultural diversity.", "Petrusic makes no mention of Muslim people making that demand. The only element of the story linking to Muslims is Gateway's unfounded assertion that Second@s \"represents mostly Muslim second-generation foreigners in Switzerland.\"", "Because the image took place at a different time and in a different place than Frontlines News reported, and because the underlying story originated in 2011 from an already-unreliable source, we rate this claim \"False.", "Przybyla, Heidi. \"John Bolton Presided Over Anti-Muslim Think Tank.\"\r\n  NBC News. 23 April 2018.", "McManus, John. \"Have Pictures of Muhammad Always Been Forbidden?\"\r\n  BBC. 15 January 2015.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]