["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "When Republican nominee Donald Trump met with GOP congressional leadership in May, U.S. Rep. Luis Gutierrez, D-Ill, took to the House floor to denounce Trump and his plans to deport illegal immigrants.", "Gutiérrez followed up with a tweet to his followers reading, \"Every single strawberry that is served to Members of Congress will have passed through the rough hands of an undocumented immigrant.\"", "That statement caught our attention. Could such an expansive claim be verified? We decided to look into it.", "Farm worker demographics", "A Gutiérrez staff member told PolitiFact that the tweet was a quote from the speech delivered that same day. In the speech, Gutiérrez said, \"Whether it was growing them, picking them, packing them, shipping them, unloading them, or some other part of the process, Strawberry Festival Month really means undocumented farmworker month.\"", "Based on various surveys and studies done over the years, it is safe to say that much agricultural work in the United States is dependent on undocumented workers.", "A report by the U.S. Department of Agriculture’s Economic Research Service found that \"over the past 15 years, about half of the hired workers employed in U.S. crop agriculture were unauthorized, with the overwhelming majority of these workers coming from Mexico.\"", "Some representatives of farm workers say that estimate may even be on the low side.", "\"Undocumented farmworkers may not feel comfortable answering this question accurately when responding to a government study,\" said Giev Kashkooli, political director of the United Farm Workers of America. Furthermore, many workers \"may choose not to participate in the survey due to fear of responding to a government study.\"", "What about the strawberry industry, specifically?", "Gutiérrez’s statement was in direct reference to strawberries, so we wanted to know how strawberry farm workers compare to the larger agriculture industry.", "Another U.S. Department of Agriculture’s Economic Research Service publication cites a report by the U.S. Department of Labor from 2005-09 which shows that 67 percent of fruit and nut hired workers do not have work authorization in the United States, compared to the overall figure of 50 percent.", "Furthermore, if you consider just new entrants in the fruit and nut industries, those first working on a farm for less than two years, the percentage without authorization is 97 percent, which is 25 points higher than the overall figure for new entrants.", "Kashkooli and the United Farm Workers of America also shared that the number of H2A (the documented and legal guestworker program) workers in the berry industry is much lower than other agriculture industries.", "California has a higher rate of undocumented workers than other states, which may further suggest a higher rate of undocumented workers in the strawberry industry since California accounts for over 88 percent of total U.S. strawberry production according to the California Strawberry Commission.", "Florida has the second-largest strawberry industry in the United States, producing between 10 and 15 percent of the national supply.", "The Department of Labor directed us to the Florida Strawberry Growers Association for information regarding the status of the state’s strawberry workers. We did not receive a reply from our inquiry.", "Generally, the berry industry attracts more undocumented workers due to the grueling nature of the work. The necessity of hand-picking each individual berry prompts many to look for work in other industries.", "It is important to note that not all strawberries consumed in the United States are produced in the United States.", "According to the USDA’s most recent data, in 2012, if U.S. strawberry exports were subtracted from the total number of strawberries produced in the United States, 2.66 billion pounds of strawberries were consumed in the U.S. market. The United States imported about 566.4 million pounds of strawberries in that same year. So, in terms of percentage, approximately 21.2 percent of strawberries consumed in the United States were imported from other countries, mostly from Mexico.", "Since over one-fifth of strawberries are not produced in the United States, Gutiérrez’s claim has less viability.", "Our ruling", "Gutiérrez stated to the House that, \"Every single strawberry that is served to Members of Congress will have passed through the rough hands of an undocumented immigrant.\"", "The evidence says that about 50 to 70 percent of farm workers in the United States are undocumented. While most data and experts agree that the figure is higher for the strawberry industry, there is no clear way to deduce a solid estimate that would back Gutiérrez’s claim. Since PolitiFact puts the burden of proof on the speaker, we rate this claim Half True.", "Luis Gutiérrez, tweet, May 12, 2016", "Gutiérrez website, \"Rep. Gutiérrez speaks about taco salads, strawberries, and GOP leader’s visit to Congress,\" May 12, 2016", "Email Interview, Douglas Rivlin, Communications Director for Gutiérrez, July 9, 2016", "United States Department of Agriculture’s Economic Research Service, \"Immigration Policy and Its Possible Effects on U.S. Agriculture,\" June 5, 2012", "Email Interview, Giev Kashkooli, second vice president and political and legislative director of United Farm Workers of America, July 11, 2016", "TIME, \"Bitter Harvest: U.S. Farmers Blame Billion-Dollar Losses on Immigration Laws,\" September 21, 2012", "U.S. Department of Agriculture’s Economic Research Service, \"Immigration and the Rural Workforce,\" last updated May 8, 2013", "California Strawberry Commission, \"About Strawberries\"", "University of Florida’s Institute of Food and Agricultural Sciences, \"Florida Crop/Pest Management Profiles: Strawberries,\"", "United States Department of Agriculture, \"U.S. Strawberry Industry (95003),\" updated June 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]