["About this rating", "In 2018, U.S. Border Patrol apprehended 6,259 immigrants in between ports of entry who had been “convicted of crime, whether in the United States or abroad.\" Custom and Border Patrol's Office of Field Operations, which monitors ports of entry, encountered another 10,572 immigrants with a previous criminal record. Additionally, ICE deported 5,872 gang members in fiscal year 2018.", "Only 1.7% of individuals encountered by the U.S. Border Patrol crossing between ports of entry had a criminal record. No credible evidence has been provided to support the claim that a “major number” of those 6,000 gang members deported by ICE belonged to MS-13.", "In the run-up to an 8 January 2019 primetime address by President Trump on border security and the government shutdown, the Republican National Committee (RNC) released a set of seven facts on a page titled “borderfacts.com.” This article addresses their third claim, which states (in full): \"In 2018, over 17,000 adults arrested at the border had prior criminal records. This included over 6,000 gang members, a major number of those members were from MS-13.\"", "U.S. Customs and Border Protection (CBP) considers someone as having a criminal record if that person has “been convicted of crime, whether in the United States or abroad, so long as the conviction is for conduct which is deemed criminal by the United States.” Broadly speaking, the \"over 17,000 adults arrested at the border had prior criminal records\" claim holds up, but context is important. Of the 17,000 adults referenced here, 63 percent were not attempting to cross the southern border on land between ports of entry, and therefore their inclusion in a “wall” fact post is misleading, as explained by Public Radio International (PRI):", "A full 63 percent of those individuals were “encountered” by the Office of Field Operations (OFO). Those are the people you meet at the airport and at border crossings. In other words, the “criminal aliens” they encountered were travelers who failed routine checks at legal entry ports and were denied entry.", "Those “encountered” individuals would have been immediately deported, thanks to fingerprinting efforts at ports of entry. In terms of individuals encountered crossing the U.S.-Mexico border where a wall might one day exist, only 6,259 individuals with criminal records were encountered by agents in between ports of entry in 2018, according to U.S. Border Patrol statistics.", "Those 6,259 or so individuals represent just 1.7% of the 361,993 total number of people encountered by U.S Border Patrol between ports of entry in 2018. Furthermore, nearly 50% of the crimes related to this list of “criminal alien” encounters involved individuals whose criminal status stemmed from past failed attempts to cross the border:", "While the number of “criminal alien” arrests is reasonably documented, the actual number of violent criminals encountered crossing between ports of entry is a remarkably small fraction of the overall population of people encountered by U.S. Customs and Border Protection.", "The most questionable aspect of this RNC “fact” is the suggestion that the nearly 6,000 gang members deported in 2018 included a “major number” of people belonging to the violent gang MS-13. We don’t know what the RNC means by the term “major number,” but what we do know is that Immigration Customs and Enforcement (ICE), a different agency than the U.S. Border Patrol, deported 5,872 gang members in fiscal year 2018. Those individuals were not caught crossing the border, nor is it certain they got to the U.S. by crossing the southern border initially. Instead, they were caught up in ICE enforcement activities in 2018:", "ICE removals of known or suspected gang members and known or suspected terrorists (KST) are instrumental to ICE’s national security and public safety missions, and the agency directs significant resources to identify, locate, arrest, and remove these aliens. ICE identifies gang members and KSTs by checking an alien’s background in federal law enforcement databases, interviews with the aliens, and information received from law enforcement partners. This information is flagged accordingly in ICE’s enforcement systems.", "ICE data does not provide any breakdown of gang membership, and therefore the assertion that a \"major number\" of the deported persons were MS-13 appears to rest on several claims made by President Trump, as reviewed by the Washington Post:", "Before Trump brought it up in the State of the Union, he claimed that MS-13 had “infiltrated our schools” (April 29); that authorities had removed “50 percent” of MS-13 members in the United States, or 6,000 of them (June 29); and that “we’re throwing them out so fast; they never got thrown out of anything like this” (Aug. 22).", "Using a range of data from ICE, the Department of Justice, and the Government of Guatemala from the previous fiscal year (2017), the Washington Post concluded that Trump’s claim of “thousands” of MS-13 members captured under his watch was highly overblown:", "A range of data shows Trump’s crackdown on MS-13 has had a discernible impact. But there’s nothing showing that “thousands and thousands” of the gang’s members have been deported or imprisoned since the president took office.", "At most, there were 1,241 deportees with gang ties who re-entered El Salvador in 2017, according to that country’s government. Meanwhile, according to a patchwork of reports from ICE and the Justice Department, several hundred MS-13 members were arrested or charged in the United States in 2017.", "All told, the statistics provided by CBP, ICE, and others indicate that criminal aliens have been caught crossing the southern border, but they are a small subset of a much larger population of individuals caught crossing the border. The deportation of gang members is a separate issue in terms of border protection, as these people are typically not caught in the act of crossing the border. It is factual to say that nearly 6,000 gang members were deported by ICE in 2018, but unreasonable to assume that a “major number” of them (an inherently vague term in the first place) belonged to the gang MS-13.", "BorderFacts.com.   \"Check The Facts”\r\n    Accessed 8 January 2018.", "U.S. Customs and Border Protection.   \"CBP Enforcement Statistics FY2018”\r\n    Accessed 8 January 2018.", "Woolf, Christopher.   \"Have '17,000 Criminals' Really Been Apprehended at the US-Mexico Border?”\r\n    PRI.   4 January 2019.", "U.S. Immigration and Customs Enforcement.   \"Fiscal Year 2018 ICE Enforcement and Removal Operations Report”\r\n    Accessed 8 January 2018.", "Rizzo, Salvador.   \"President Trump’s Claim That ‘Thousands and Thousands’ of MS-13 Members Are off the Streets.”\r\n    The Washington Post.   8 February 2018.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]