["By Saranac Hale Spencer", "Posted on May 31, 2018", "Q: Did a 79-year-old woman with an AK-47 save two police officers?", "A: No. That made-up story was written as satire and dates back to 2015.", "A story originally published as a joke in 2015 has now been copied and presented as serious news. It’s not.", "The story claims that a 79-year-old woman in Los Angeles — specifically, in the Watts neighborhood infamous for the 1965 riots — shot gang members with an AK-47 assault rifle after they had opened fire on two police officers.", "The website that posted the story as though it were news also shared it on Facebook, where users wrote comments like, “Guns save thousands and thousands of people’s lives a year good going granny keep it up,” and, “Way To Go Grandma!!! Crooks can’t win with an even playing ground!!!”", "But other Facebook users were skeptical and flagged the story as being potentially false. They are right.", "The story first appeared on World News Daily Report in September 2015. That website includes a disclaimer that says: “World News Daily Report assumes all responsibility for the satirical nature of its articles and for the fictional nature of their content. All characters appearing in the articles in this website – even those based on real people – are entirely fictional and any resemblance between them and any person, living, dead or undead, is purely a miracle.”", "Although the Canadian publisher of World News Daily Report has been criticized for being a major source of misinformation, he maintains that his intent is to get people to think differently about important issues by using satire, as he explained in a French-language interview on Radio-Canada.", "But, as is a common problem with false stories like this one, pieces written as satire are copied and posted on websites that don’t have a disclaimer. In this case, it was the site patriotswalk.com, which is registered to an owner in Kosovo. At least four other clickbait websites are registered to the same owner.", "In addition to questionable domain ownership, the story that the website copied also has some tell-tale signs that it’s not true. To start, the photo of the elderly woman wearing camouflage and holding a gun has been making the rounds online since at least 2013, when it was featured in a Guns & Ammo caption contest.", "The story also shows a picture of two police officers — who were misidentified — that dates back to 2010. It was posted on a neighborhood blog for a different area of the city than Watts.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk false stories flagged by readers on the social media network.", "“GRANDMOTHER WITH AK-47 SAVES COPS BEING ATTACKED BY STREET GANG.” Patriotswalk.us. 28 May 2018.", "Edy, Jill. “Watts Riots of 1965.” Encyclopaedia Britannica. Accessed 30 May 2018.", "Yates, Jeff. “Interview with a Quebecer responsible for one of the worst sources of misinformation in the world.” Radio-Canada. 27 Mar 2017.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]