["About this rating", "While it's entirely possible the Democratic Party may in the future call a meeting to discuss replacing Hillary Clinton in the event she steps down as party nominee, no such meeting has yet been called.", "The DNC is not holding an \"emergency\" meeting to \"replace\" Clinton.", "On 11 September 2016, multiple viral web sites — such as Occupy Democrats and Bipartisan Report — posted stories reporting that the Democratic National Committee was planning an \"emergency\" meeting to \"replace\" presidential nominee Hillary Clinton due to recent health scares.", "The posts all linked back to a tweet by journalist David Shuster, who claimed to have the inside scoop from an unnamed Democratic Party source:", "Clarification from dem operatives @HillaryClinton pneumonia: Expect emergency DNC meeting to CONSIDER replacement. #HillarysHealth", "— David Shuster (@DavidShuster) September 11, 2016", "The tweet Shuster was \"clarifying\" was apparently the following tweet (now deleted, but screencapped):", "@MattMurph24 And he already deleted it. @DavidShuster pic.twitter.com/jsp2Pvqtqy", "— KinTX (D) (@yourltldogtoo) September 11, 2016", "The assertions sparked commentary from pundits across the political spectrum, leading web sites to publish articles with misleading headlines such as, \"BREAKING: DNC Holding Emergency Meeting to Discuss Replacing Clinton as Presidential Nominee.\"", "The Democratic national party cannot unilaterally \"replace\" Clinton. The DNC's bylaws allow the committee to fill \"vacancies in the nominations for the office of President and Vice President,\" according to Article Three, Section 1(c). That means that if Clinton removes herself from the race, the party leadership can select a replacement — but only if she chooses to do so. Further, according to its bylaws, the DNC can't meet or vote on an item without considering public engagement. All meetings must be open to the public and no votes can be taken by secret ballot, according to Article Nine, Section 12:", "All meetings of the Democratic National Committee, the Executive Committee, and all other official Party committees, commissions and bodies shall be open to the public, and votes shall not be taken by secret ballot.", "Neither the DNC nor Clinton's campaign replied to our requests for comment. The most recent public statement by the committee does not allude to any plans to replace Clinton, nor does it call a meeting to select a replacement. Party chair Donna Brazile said in a statement made 11 September 2016:", "I am glad to learn that Secretary Clinton is already feeling better and I wish her a speedy recovery. I look forward to seeing her back out on the campaign trail and continuing on the path to victory.", "The DNC has also not announced a meeting (which by its own bylaws would be open to the public) in which they will choose a nominee in the event that Clinton vacates her presidential nomination. That is not to say some within the party have not been alarmed by several incidents, including a highly-publicized stumble while leaving a 9/11 memorial event on 11 September 2016. Don Fowler, who headed the DNC in the 1990s, told Politico that the party would be wise to quickly set rules, in case Clinton is forced out of the race by health issues.", "Democratic National Committee. The Charter and Bylaws of the Democratic Party of the United States.\r\n\r\n  28 August 2015", "Cheney, Kyle. \"Former DNC chairman calls for Clinton contingency plan.\"\r\n\r\n  Politico. 12 September 2016.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]