["Following president Trump’s state visit to the U.K., France and Ireland in early June 2019, a curious quotation from none other than Queen Elizabeth II started to circulate around social media.", "The post features a photo of the two together, with the following quote about Trump attributed to the queen:", "\"He’s really just an amazing person. So thoughtful, you know. We’ve had some private talks and he is very genuine. I have a sense about people, and the president has a good heart. In another life, he could be my son.\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The queen does not give interviews nor publicly comments on politics, Buckingham Palace’s website says, and there is no evidence that she made such a statement.", "Other versions of the post take it further and say that journalists suppressed and scrapped an entire interview with Queen Elizabeth after she gave Trump such glowing praise.", "The quote appeared on the Clover Chronicle, a conservative website that has a conspiracy section on its homepage. The article claimed that an \"unnamed MSM (mainstream media) news outlet in the United Kingdom is claiming they were recently involved in an interview with Queen Elizabeth II where she unexpectedly complimented U.S. President Donald Trump … The alleged insider said executives at the organization are ‘fuming’ because they couldn’t salvage the piece due to her relentless praise of the POTUS.\"", "That \"insider\" was an anonymous member of online forum 4Chan, who posted the account on June 4 (which has since been deleted) on the forum’s \"politically incorrect\" board.", "There is no evidence that the queen ever said this and the story contains no legitimate sources.", "The statement attributed to her appears to have originated in an anonymous post on an online forum, and according to Buckingham Palace’s media center, the queen does not give interviews nor does she speak publicly about political matters.", "We rate this claim Pants on Fire!", "Facebook post, June 7, 2019", "Buckingham Palace Media Centre, interviews, Accessed June 18, 2019", "Clover Chronicle,  Insider: Queen Elizabeth Praised Trump In Now-Deleted Interview, Called Him An \"Amazing Person\" With A \"Good Heart\" And Said \"In Another Life, He Could Be My Son\", June 4, 2019", "Check Your Fact, ‘IN ANOTHER LIFE, HE COULD BE MY SON’ – DID QUEEN ELIZABETH CALL TRUMP ‘AN AMAZING PERSON’?, June 7, 2019", "Snopes, Did the Queen Call President Trump an ‘Amazing Person’ with a ‘Good Heart’?, June 7, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]