["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Gov. Scott Walker signed his first state budget at a factory on June 26, 2011.", "From Madison to Tomah, from Janesville to Milwaukee, as Mary Burke has introduced herself to Wisconsin voters, she tells them about her concern over how much Gov. Scott Walker has increased the state budget.", "Wait -- don’t Democrats usually rip the Republican governor for his budget cuts?", "In a Madison interview on Nov. 5, 2013, Burke was asked how she would provide tax relief to the middle class if she is elected governor in 2014.", "\"Well, I think we have to make sure that we are living within the means of our taxpayers and I know people are struggling,\" the Madison school board member and former Trek Bicycle Corp. executive said on WMTV-TV (Channel 15).", "\"So, we need to balance the state budget, we need to make sure the money that we're spending is utilized well. I'm concerned that the state budget has actually grown by $4.6 billion under this administration, which makes it harder and harder to keep taxes lower.\"", "You would think Burke’s figure, which she repeated in a Madison speech on Nov. 20, 2013, could be checked with a simple comparison of two numbers.", "But you’d be like the guy who proposes to his girlfriend while slipping a ring on her right hand:", "Well-intentioned, but a little misguided.", "Burke’s numbers", "Burke’s phrasing could be taken to mean she was claiming the two-year state budget has grown $4.6 billion since Walker succeeded Democrat Jim Doyle in January 2011.", "Or that it has grown by that amount at some point during Walker's tenure.", "Initially, even Burke's own campaign wasn't clear on what she meant.", "When we asked spokesman Joe Zepecki for evidence to back Burke’s claim, he compared the size of Walker’s first budget, for 2011-’13, to Walker’s second budget, for 2013-’15. He provided a PolitiFact Wisconsin article, which made reference to the first budget being $66 billion; and a reference by the nonpartisan Wisconsin Taxpayers Alliance, which said the second budget \"authorizes the state to spend\" $70.4 billion.", "But the two figures are apples and oranges: the $66 billion figure for 2011-’13 was for the general fund budget -- operations funded with state revenue; the $70.4 billion for 2013-’15 is an \"all funds\" figure that includes federal funding as well as $2 billion in borrowing.", "Zepecki then said his staff had made a mistake and that Burke’s statement actually compared Walker's current budget to Doyle's final budget.", "Zepecki cited figures from the nonpartisan Legislative Fiscal Bureau showing an increase of $4.6 billion, from $65.8 billion in 2009-’11 to $70.4 billion in 2013-’15.", "But both of those figures are \"all funds\" appropriations -- not the general fund budget, which comes from state tax dollars and typically is the focus of lawmakers, the news media and others when talking about the state budget.", "So, let’s review some other numbers.", "Other numbers", "We put Burke’s claim to Robert Lang, director of the nonpartisan Legislative Fiscal Bureau, the state agency in charge of scoring budgets and other money matters.", "Lang said that looking strictly at biennial general fund budgets -- the ones funded with state revenue -- Doyle’s final spending plan for 2009-’11 was $62.19 billion and Walker’s current budget, for 2013-’15, is $67.5 billion.", "That’s an increase of $5.31 billion.", "Lang also said that whenever his agency is asked to compare biennial spending, it considers not only the budget itself, but any other legislation that becomes law during the two-year period. For example, a $100 million property tax relief law approved under Walker after the 2013-’15 budget was adopted would be tallied.", "Using that method, Doyle’s final spend was $62.95 billion and Walker’s spend in the current biennium -- as of Nov. 15, 2013 -- is $67.62 billion.", "An increase of $4.67 billion.", "So, by the two official figures, Burke’s number claim is on target, or even conservative.", "But what about the rest of her statement, that Walker is responsible for the growth in the budget?", "Perspective", "The growth in Walker’s first budget was driven largely by increased expenditures on Medicaid; in his second budget, the increases were in large part for Medicaid and school aids.", "Walker's press secretary, Tom Evenson, contended the increase since Walker took office is $4.4 billion -- slightly less than Burke’s $4.6 billion claim -- but said it is misleading to say Walker decided to increase spending by that amount.", "\"These are commitments the state cannot easily back out of and stem from decisions largely made prior to Gov. Walker taking office,\" Evenson said of the federal- and state-funded Medicaid program.", "Medicaid costs are driven by many factors, from how many people are eligible for the program to the cost of treatment and what recipients are asked to contribute in co-pays. That's much different than a governor simply deciding to boost spending on various programs.", "Indeed, the highlights of Walker’s first budget included a nearly $800 million cut from public schools, tax cuts for investors and businesses, and clamp-down on property taxes. His second budget included a $651 million income tax decrease, a two-year university tuition for freeze and an increase in property taxes on the typical home limited to 1% in each of the two years.", "Our rating", "Burke said the state budget \"has actually grown by $4.6 billion under\" Walker’s administration, suggesting Walker had boosted the spending.", "The figure is accurate, but it is due almost completely to Medicaid costs, not budget decisions Walker made.", "For a statement that is partially accurate but takes things out of context, we give Burke a Half True.", "YouTube, WISC-TV interview of Mary Burke (quote at 3:00), Nov. 5, 2013", "Wisconsin Legislative Fiscal Bureau, \"State budget process,\" January 2013", "Milwaukee Journal Sentinel, \"Scott Walker issues 57 vetoes, signs $68 billion Wisconsin budget,\" June 20, 2013", "Business Journal, \"Gov. Scott Walker signs $68 billion state budget,\" June 30, 2013", "Wisconsin State Journal, \"State budget a mixed bag,\" July 7, 2013", "Wisconsin Reporter, \"Walker signs Wisconsin’s $70.1 billion budget, powered by veto pen,\" June 30, 2013", "Milwaukee Journal Sentinel, \"Walker signs budget bill, vetoes just 50 items,\" June 26, 2011", "Oshkosh Northwestern, \"Gov. Scott Walker to sign budget Sunday at Ashwaubenon metal company,\" June 24, 2011", "Associated Press, \"With minor changes, Doyle signs Wisconsin's budget,\" June 30, 2009", "Appleton Post-Crescent, \"Gov. Jim Doyle says budget painful, but he’ll stay the course,\" June 30, 2009", "Interview, Wisconsin Legislative Fiscal Bureau director Robert Lang, Nov. 15, 2013", "Email interview, Mary Burke campaign communications director Joe Zepecki, Nov. 15, 2013", "Email interview, Gov. Scott Walker press secretary Tom Evenson, Nov. 15, 2013", "Email interview, Wisconsin Taxpayers Alliance president Todd Berry, Nov. 15, 2013", "Wisconsin Taxpayers Alliance, \"Window on the Wisconsin State Budget,\" August 2013", "PolitiFact Wisconsin, \"Gov. Scott Walker says Wisconsin is broke and $3 billion in debt,\" Sept. 22, 2011", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]