["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The Bell House is a tourist attraction in Macon and houses the McDuffie Center for Strings, sometimes referred to as the \"Julliard of the South.\" AJC file photo", "A new nightly $5 fee on hotel stays in Georgia won’t be collected for another six weeks, but the question remains just who will be paying it.", "Conservative estimates show the fee will pay close to 20 percent of the roughly $900 million that the transportation bill, House Bill 170, is expected to raise annually to tackle a backlog of transportation needs.", "Former state rep. Jay Roberts, R-Ocilla, who spearheaded the bill, said about 85 percent of the hotel guests who pay the fee will be from outside Georgia.", "\"This shifts some of the burden to visitors who will have to share the costs to modernize the transportation network in Georgia,\" said Roberts, now a planning director for the state Department of Transportation, during floor debate on the final bill.", "The state’s hospitality industry, though, was blindsided by the last-minute addition of the fee and has claimed it will hurt business and Georgians.", "The Georgia Convention and Visitors Bureau points to a survey of hoteliers that shows about a third of leisure guests are in-state tourists. Those people will already be paying an average of 6 cents more a gallon for gas when the law takes effect July 1.", "So who is right? PolitiFact Georgia decided to check.", "First, remember we already checked a claim that the fee will hurt Georgia’s convention business by adding extra costs for large groups coming to the state.", "We ruled Mostly True with a caveat: There is nothing that says the new fee must be passed along to hotel guests.", "In fact, looking at data from Savannah-area hotels, those businesses would be better off absorbing the cost – about $18.7 million a year, based on published occupancy rates – than passing it along and potentially chasing away 7.5 percent of room nights. That would cost hotels about $22.5 million.", "But if hotels pass them along to guests, where are those folks from?", "Roberts said he cited his figure based on memory of lawmakers’ debates on funding for the new Falcons stadium.", "\"I remember … that we were told that approximately 85 percent of the people that stay in the metro Atlanta motels/hotels are from out of state,\" Roberts said.", "In fact, Roberts underestimated slightly.  According to a website run by stadium advocates, 86 percent of overnight guests in the state’s largest hotel market are from outside Georgia.", "So where does the Georgia CVB get its figures?", "From the 2013 Georgia Longwood study that looked at both statewide figures as well as Atlanta, which has 94,000 of the state’s 177,000 hotel rooms.", "That report concluded 31 percent of leisure guests – that is, not including business travelers, conventioneers or people traveling with social groups like a church or school trip – were in-state travelers. For the Atlanta region, in-state travelers accounted for only 20 percent of the total.", "\"Almost half of the state’s hotel rooms are in the Atlanta metro, so you need to look at the figures in other regions to get a more clear picture of how many Georgians are affected by this fee,\" said Julie Ford Musselman, head of the Georgia CVB.", "That picture is a bit fuzzy, given that there is no single way that regions reported where their guests were from and what kind of guests they were.", "Hotels in the Lake Lanier area, for instance, reported based on the number of leisure and group bookings, with Georgians making up 73 percent and 56 percent, respectively.", "\"We have not done an aggregate study for every category, but looking at what we have, we can say that most definitely the $5 fee impacts Georgians more heavily than anyone realized when they passed this transportation bill,\" Musselman said. \"The ability to book business and keep our existing customer base, in every market, is our concern.\"", "Bruce Seaman, an economics professor at Georgia State University who had helped PolitiFact Georgia with the business costs in our previous fact check, agrees.", "More specifically, he said, the question of how the fee affects every region of the state is a salient economic point.", "And, while the hospitality industry cannot provide verifiable answers, neither could state lawmakers before passing the bill that included the fee.", "Even Atlanta, while less susceptible to the fee, could potentially see increased competition from out-of-state tourist or business spots.", "No one can say for sure, Seaman said, because there was no study.", "\"There has not been enough careful analysis done on this,\" Seaman said. \"There are clearly going to be differential regional effects. The numbers are plausible, but we don’t know what they will mean.\"", "Our ruling", "The state lawmaker who helped Georgia pass a nearly $900 million bill to tackle the state’s backlog of road and bridge work said a hotel fee in the bill would help shift the burden to out-of-state visitors.", "Jay Roberts was correct with his numbers, at least in the largest hotel market in the state.", "But hoteliers have a point that the fee could hit more Georgians in the state’s smaller cities and regions, even if the numbers vary by the type of visitors staying.", "Roberts implied the 85 percent out-of-state figure was statewide, even if his citation was clearly only for metro Atlanta.", "He was accurate, but the statistic needs more information to be fully understood.", "We rate his claim Mostly True.", "Georgia Public Broadcasting, 2015 Legislative session, House Day 39, (PM session), March 31, 2015", "Georgia Department of Audits,Senate Revised Fiscal Note on HB 170, March 23, 2015", "Atlanta Journal-Constitution, \"Nightly charge could impact state's tourism, industry warns leaders,\" April 27, 2015", "WABE radio, \"Added Fee at Ga. Hotels May Cause Drop in Business, Some Fear,\" May 1, 2015", "Atlanta Journal Constitution, Political Insider blog, May 5, 2015", "New Atlanta Stadium Project, FAQ, accessed May 20, 2015", "Georgia Convention and Visitors Bureau, 2015 Visitor Origin Study, Statewide", "Georgia Department of Community Affairs, List of Georgia governments imposing a hotel-motel tax, May 1, 2015", "Phone interview, Julie Ford Musselman, executive director, Georgia Association of Convention and Visitors Bureaus, May 20, 2015", "Phone interview, Bruce Seaman, professor of economics, Andrew Young School of Policy Studies of at Georgia State University, May 20, 2015", "Email interview, Jay Roberts, former state representative, R-Ocilla, May 7, 2015 to May 20, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]