["About this rating", "In April 2016, a contributor to Forbes financial magazine's website reported that the Internal Revenue Service (IRS) was encouraging \"illegals,\" a pejorative term for undocumented immigrants, to \"steal\" Social Security numbers. Under the headline, \"IRS Admits It Encourages Illegals To Steal Social Security Numbers For Taxes,\" attorney Robert Wood wrote:", "\"This time, [then-IRS Commissioner John Koskinen] was talking about illegal immigrants, and about the IRS turning a blind eye. Or maybe worse. The IRS actually wants illegal immigrants to illegally use Social Security numbers, he suggested. IRS Commissioner John Koskinen made the surprising statement in response to a question from Sen. Dan Coats, R-Ind., at a Senate Finance Committee meeting.\"", "The article began re-circulating on social media in mid-January 2019. It's unclear why, but it may be because the federal government has been in a protracted, partial shutdown over an impasse between President Donald Trump and Congress over funding for U.S.-Mexico border-wall construction. That coupled with growing anxiety over how tax season will play out with IRS workers on furlough due to the shutdown perhaps launched the story back into the Internet's bloodstream.", "But the headline is exaggerated and misleading. We tracked down the Senate Finance Committee hearing in question, which took place on 12 April 2016, entitled \"Cybersecurity and Protecting Taxpayer Information.\" The question from Dan Coats, the current director of national intelligence, who at the time was a Republican senator from Indiana, was addressed to J. Russell George, treasury inspector general for tax administration (TIGTA) and then to Koskinen.", "According to a transcript of the hearing, Koskinen never admitted that the IRS \"encourages\" undocumented people to \"steal\" Social Security numbers. In the relevant exchange below, Koskinen said many undocumented people were using 9-digit Individual Taxpayer Identification Numbers (ITIN) on their tax forms but then using someone else's Social Security number to get a job.", "In many of those cases, he said, the worker was using a Social Security number that belonged to a friend or relative — and this person was aware that their Social Security number was being used for that purpose. In other words, such cases are not clear-cut identity theft cases, and the crime/victim relationship was less black and white. Here is a transcript of the relevant portion of the hearing:", "Commissioner Koskinen: ... The question is whether the Social Security number they are using to get the job has been stolen, though it is not the normal identity theft situation. We did run a pilot, and we are looking at — and I appreciated your discussions about this — whether there is a way we could simply advise people.", "A lot of times, those Social Security numbers are, in fact, borrowed from friends or acquaintances and people know they have been used. Other times, they do not. So we are looking at — and one of the reasons for the pilot was — what is the most effective way to deal with this without necessarily having people decide not to file their taxes — obviously a priority for taxpayers and the IRS, which is collecting those taxes.", "The bill in question, the Social Security Identity Defense Act of 2017, was introduced on 20 July 2017 and was referred to the Senate Finance Committee.", "The full hearing can be viewed here. Coats' questioning begins at the 1:17-minute mark.", "Wood, Robert R. \"IRS Admits It Encourages Illegals to Steal Social Security Numbers for Taxes.\"\r\n  Forbes. 13 April 2016.", "Senate Committee on Finance. \"Cybersecurity and Protecting Taxpayer Information.\"\r\n  12 April 2016.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]