["About this rating", "On 15 February 2017, left-of-center web site BipartisanReport.com posted a story with a misleading clickbait headline: \"Donald Trump Impeachment Process Begins – FEC Paperwork Filed – Tantrum Imminent.\" The story then went on to report that a California Democrat, Boyd Roberts of Laguna Beach, had announced plans to challenge the sitting Republican, Rep. Dana Rohrabacher, and has simultaneously launched a political action committee called \"Impeach Trump\":", "Boyd Roberts, a Democrat in California, has officially registered with the Federal Election Commission (FEC) to run against Rohrabacher, and he has an interesting plan to do so.", "Roberts has submitted the required paperwork to the FEC to establish an “Impeach Trump” leadership political action committee (PAC). The PAC is meant to raise money, which will be donated to help candidates and lawmakers. Based on the paperwork, however, his own campaign is the only beneficiary of it at this time.", "Counter to what the story implied, the impeachment process does not involve the FEC. Instead, impeachment proceedings are initiated by the House of Representatives, and the trial is carried out by the Senate. The Constitution states:", "The House of Representatives shall choose their speaker and other officers; and shall have the sole power of impeachment...", "The President, Vice President and all civil officers of the United States, shall be removed from office on impeachment for, and conviction of, treason, bribery, or other high crimes and misdemeanors.", "Although no formal process had actually begun to impeach President Donald Trump, the idea had been bandied about since he was sworn in on 20 January 2017. Two liberal groups, Free Speech for People and Roots Action, began gathering signatures and organizing support for impeachment of the 45th president, asserting that his business ties violate the emoluments clause of the Constitution. Norman Solomon, a co-founder of Roots Action, described the process in an op-ed for The Hill:", "The Constitution states that to start impeachment proceedings, a document or “resolution calling for a committee investigation of charges against the officer in question” must be introduced in the House of Representatives. Such a move would have been appropriate from the moment that Trump became president.", "As documented in depth on the ImpeachDonaldTrumpNow.org website — where more than 600,000 people have already signed a petition for impeachment — the president continues to violate two “emoluments” clauses in the Constitution. One prohibits any gifts or benefits from foreign governments, and the other prohibits the same from the U.S. government or any U.S. state.", "Impeachment proceedings, which are formal charges of misconduct brought against elected officials, are extremely rare occurrences. In recent history, they were brought against Bill Clinton — but that failed to sink his presidency. Richard Nixon left office before the process could be carried out to completion. The only other president to face impeachment was Andrew Johnson in 1868. He was acquitted.", "Formal impeachment proceedings against President Donald Trump commenced for real on 24 September 2019 when Speaker of the House Nancy Pelosi announced the opening of an impeachment inquiry. According to a New York Times report, Pelosi accused Trump of \"betraying his oath of office and the nation’s security by seeking to enlist a foreign power to tarnish a rival for his own political gain.\"", "Fandos, Nicholas. \"Nancy Pelosi Announces Formal Impeachment Inquiry of Trump.\"\r\nThe New York Times. 24 September 2019.", "Mayhew, Eliza. \"Donald Trump Impeachment Process Begins – FEC Paperwork Filed – Tantrum Imminent.\"\r\nBipartisan Report. 15 February 2017.", "Solomon, Norman. \"The House Should Start Impeachment Against Trump Now.\"\r\nThe Hill. 6 February 2017.", "Panzar, Javier. \"Laguna Beach Real Estate Broker Who Hopes to Unseat Rep. Dana Rohrabacher Launches Impeach Trump PAC.\"\r\nThe Los Angeles Times. 14 February 2017.", "Sullivan, Sean, et al. \"Senators From Both Parties Pledge to Deepen Probe of Russia and the 2016 Election.\"\r\nThe Washington Post. 14 February 2017.", "The Heritage Guide to the Constitution. \"Standards for Impeachment.\"", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]