["About this rating", "On 20 March 2016, the Now8News web site published an article reporting that a woman claiming to be pregnant and in distress had a dead kitten removed from her vaginal canal in the emergency room:", "Police were called out to a Las Vegas hospital today after a woman entered the emergency room screaming, “Help my baby.” The 38-year-old woman, Janice Warmington, entered the East Las Vegas hospital complaining of pains in her stomach, telling the nurses she was in her first trimester of pregnancy. They immediately placed her in one of the emergency room beds and performed an ultrasound examination. What doctors found, was absolutely repulsive and shocking.", "“We began with an ultrasound examination so we could see the condition of the baby,” said attending physician Robert Steinberg. “However, what we saw on the screen had us confused so we proceeded with a vaginal examination. What we pulled out of her ... I’ve never experienced in my 32 years in the medical field.” Steinberg said they retrieved a kitten from Warmington’s vaginal cavity. And when they pulled it out, the woman went even more insane.", "Warmington reportedly told the nurses that she is unable to have children and just wanted to “Feel what it was like to have a living being… life, moving around inside of her.”", "The  report was reproduced by dozens of fly-by-night \"viral news sites\" after its initial appearance:", "The article (like all of Now8News' content) was entirely fabricated.  Now8News is a clickbait fake news site that masquerades as a local television news outlet's web presence.   The photograph purportedly depicting the dead kitten in a surgical environment was in fact a stock image of surgeons' tools, blurred to suggest the original photo contained something graphic (it did not):", "Previous Now8News hoax articles (often replicated by other \"viral news\" sites) include similar claims a man had sexual relations with a pig in a Walmart bathroom, aborted fetuses were discovered in McDonald's Chicken McNuggets, Walmart bananas were contaminated with a deadly parasitic worm, a woman engaged in a sex act with a sausage at a Walmart, a separate woman was arrested for sampling feminine hygiene items in an aisle at a Walmart, a man fed his unfaithful fiancee's remains to her unsuspecting parents, and a woman gave birth to twins in a casket after being buried alive by her husband.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]