["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "President Barack Obama's recently announced plan to cut greenhouse gas emissions from coal-fired power plants 30 percent by 2030 isn’t going over so well in coal states.", "Both senate candidates in Kentucky -- the country’s third-largest coal producer -- are speaking out against the plan and the danger it poses to Kentucky jobs.", "Democratic candidate Alison Lundergan Grimes jumped at the opportunity to remind voters of a comment by her opponent, incumbent and Senate Minority Leader Mitch McConnell, R-Ky., about bringing jobs to Kentucky.", "In a 60-second radio ad, Grimes first chastises Obama for the emissions plan, then turns to her competitor.", "\"Coal supplies 92 percent of our state's electricity,\" the narrator says. \"(Obama's) new regulations will lead to severe rate increases, shortages of power and the loss of even more coal jobs. Kentucky already has the fifth-highest unemployment rate in the country. It's bad enough we've lost 18,000 jobs since Mitch McConnell became senator. It's even worse that Senator McConnell says it's not his job to bring jobs to Kentucky.\"", "With jobs and unemployment the most important issues for many Americans -- and with Kentucky experiencing 7.7 percent unemployment, which is well above the national average -- we wondered whether McConnell really said this.", "It turns out that the claim references an interview McConnell gave to The Beattyville Enterprise, a weekly newspaper in Lee County, Ky., with a circulation of about 1,200 and no website, back in April. The six-paragraph-long story ran with the headline, \"McConnell says not his job to bring jobs.\" The Grimes campaign pounced on the headline and ran, giving the comment far more attention than the paper’s original circulation.", "Here’s the full text of the story:", "U.S. Senator Mitch McConnell said Friday that it is not his responsibility to bring jobs to Kentucky.", "Appearing in Beattyville, McConnell was asked by The Beattyville Enterprise what he was going to do to bring jobs to Lee County.", "\"Economic development is a Frankfort issue,\" McConnell said. \"That is not my job. It is the primary responsibility of the state Commerce Cabinet.\"", "Asked about public works projects, McConnell said he is interested in bringing public works to the state. \"Most comes from the state, though,\" he said.", "He did say that he is responsible for protecting jobs by \"pushing back\" against the Obama Administration's restrictions on the coal industry.", "\"Oil and gas are big here,\" he said of Lee County. \"They (the Obama Administration) are making it hard on them, too,\" he said.", "In an interview with PolitiFact, Edmund Shelby -- the reporter, as well as the paper’s editor and general manager -- said the interview was quick, taking place in a hallway before McConnell spoke at a luncheon at the town's community center. McConnell’s point, Shelby said, was that the responsibility for creating Kentucky jobs lies with the state government in Frankfort and the Commerce Cabinet (which is actually now known as the Cabinet for Economic Development).", "So, while McConnell did say the phrase, \"that is not my job,\" in response to a question about bringing jobs to his home state, he said his comments were taken out of context. At a May press conference, McConnell said he thought Shelby was asking him about specific industries in Lee County that are \"obviously a job of the state Commerce Department.\"", "\"This April, I visited Lee County to talk about a top priority of mine: jobs,\" McConnell said in an April statement. \"Unfortunately, it seems my message got lost in translation, and I was surprised to see a headline about my visit that sent the exact opposite message to the one I was trying to convey.\"", "Shelby didn't electronically record the exchange, and he didn't stay for the luncheon -- where McConnell made remarks about the economy and jobs. However, Shelby stands by his story and said it is impossible that the comments were taken out of context because the interview was only long enough for the questions included in the article.", "The Grimes campaign has shrugged off McConnell’s \"out of context\" defense and has sought to make hay of what McConnell was reported to have said.", "\"Clearly McConnell made a major error and used the ‘lost in translation’ excuse to blame a local news editor for accurately reporting on his comments,\" the Grimes campaign said.", "However, the \"not my job\" statement isn’t the only comment McConnell makes in the piece. His later comment that part of his responsibility is to protect Kentucky's jobs from the threat of over-regulation from the federal government and the Obama administration is an argument he often makes in his campaign.", "\"In my travels across the Commonwealth, I hear too often how government is blocking job creation,\" he said in the April statement. \"It’s up to all of us -- at the federal, state and local levels -- to fix that. We must ensure that our utility and tax rates remain low and we must enact a right to work law. The better the atmosphere the state sets for job creators, the more effectively Kentucky can compete against other states to add and retain jobs.\"", "Al Cross, director of the Institute for Rural Journalism and Community Issues at the University of Kentucky, said McConnell can point to a record to support his view. McConnell has a \"long history of doing earmarks and other legislation that helps create and preserve jobs in the state,\" he said.", "McConnell spokesman Don Stewart pointed to several pieces of job-protecting legislation that McConnell has sponsored or supported, such as the 2013 Freedom to Fish Act, which supported tourism and hospitality jobs in the Barkley Lake region, which he said brings in $3 million in fishing-related tourism to the state each year.", "In fiscal year 2010, McConnell was one of the top-10 solo earmarkers in the Senate, securing more than $60 million for 38 projects, according to Taxpayers for Common Sense, a Washington-based advocacy group. Congress banned earmarks soon after the 2010 election.", "Grimes has used McConnell’s Beattyville Enterprise comments to promote her own jobs plan, in which she devotes significant attention to criticizing McConnell’s record.", "Shelby said he thinks McConnell was saying what he actually thought. It’s possible that McConnell thought he was talking to a \"small-town, bumbling editor,\" which Shelby is not, he said.", "\"In my opinion, Sen. McConnell committed the cardinal sin of career politicians by giving an honest answer to a reporter,\" said Shelby, a former president of the Kentucky Press Association.", "Our ruling", "Grimes said, \"Sen. McConnell said it’s not his job to bring jobs to Kentucky.\" She took this comment from a brief interview McConnell gave to a small-town newspaper in April.", "We have no reason to doubt the accuracy of the news report, but while the Grimes campaign has a point that McConnell used that particular phrase, they are glossing over some nuances in what he said by selectively quoting the report. McConnell also told the paper that he has a responsibility to protect jobs, and that some of his work in Congress has led to job creation in Kentucky. In addition, McConnell’s legislative record shows a concern for local employment. We rate this claim Half True.", "Alison for Kentucky, \"Mr. President\" radio ad, June 2, 2014", "Beattyville Enterprise, \"McConnell says not his job to bring jobs,\" April 24, 2014", "Los Angeles Times, \"Kentucky Senate battle focuses on McConnell’s comments about jobs,\" April 25, 2014", "Courier-Journal, Alison Grimes attacks Obama in radio ad, June 4, 2014", "WHAS 11, \"Powers that be,\" May 24, 2014", "Richmond Register, \"Keeping them fishin’,\" June 6, 2013", "Taxpayers for Common Sense, TCS FY2010 Earmark Analysis, Feb. 18, 2010", "Energy Information Administration, Kentucky state profile and energy estimates, Dec. 18, 2013", "Team Mitch, \"Hero\" ad, May 6, 2014", "Alison for Kentucky, \"Kentucky Jobs Action Plan, Jan. 2014", "Environmental Protection Agency, Clean Power Plan proposed rule, June 2, 2012", "Gallup, \"Most Important Problem,\" May 11, 2014", "Bureau of Labor Statistics, Regional and State Employment and Unemployment, April 2014", "Email interview, McConnell spokesman Don Stewart, June 4, 2014", "Phone interview, Edmund Shelby, editor and general manager of The Beattyville Enterprise, June 5, 2014", "Phone and email interview, Grimes spokeswoman Charly Norton, June 5, 2014", "Email interview, Al Cross, director of the Institute for Rural Journalism and Community Issues at the University of Kentucky, June 5, 2014", "Email interview, Laura Glasscock, Kentucky Gazette editor, June 5, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]