["An image of two stacks of paper has been shared widely on social media alongside the claim that one large pile depicts \"illegal\" votes for President-elect Joe Biden.", "Next to the large pile is a smaller stack of alleged \"legal votes for Biden\" with the papers wrapped in a red ribbon.", "\"FACTS,\" the user captioned the image, which has over 1,600 shares and has also been posted to Twitter. The user behind the post has not returned USA TODAY's request for comment.", "Fact check: Biden got record number of popular votes despite small campaign events", "The photo has been doctored from a 2017 image in which President Donald Trump posed next to stacks of papers representing government regulations and touted his administration’s deregulatory efforts.", "The original photo was taken on Dec. 14, 2017, by Carolyn Van Houten of the Washington Post and is visible through Getty Images. In it, Trump is holding a pair of gold scissors to cut the ribbon that links the two piles of papers; Trump has been removed from the Facebook photo. The social media image has also altered the pile on the right to be significantly larger than the stack in the original photo.", "At the event, the large stack was about 70.6 inches high and the small stack was 13.2 inches high, according to estimates from The Washington Post, which found the piles to be an inaccurate representation of regulations. The papers were labeled \"1960\" and \"TODAY\" in  an attempt to visualize the growth of regulations in American government. The 1960 pile had about 20,000 pages and the today pile had more than 185,000, USA TODAY reported.", "\"The never-ending growth of red tape in America has come to a sudden, screeching and beautiful halt,\" Trump said. \"We're going to cut a ribbon because we're getting back below the 1960 level, and we'll be there fairly quickly.\"", "The altered image has changed the signs to read \"Legal Votes for Biden\" on the short stack and \"Illegal Votes For Biden\" on the tall one.", "There is no evidence to support the allegation in the photo that votes were illegally cast for Biden.", "USA TODAY has previously debunked the claim that Trump won the 2020 election based on \"legal\" votes and found that there is no evidence of cheating, illegal voting or software glitches in the presidential election.", "Fact check:Alleged ‘backdated’ ballots wouldn’t have been counted even if USPS claim true", "The claim that an image shows a large stack of illegal votes for Biden next to a small stack of legal votes, is ALTERED, based on our research. The image is from a 2017 event where Trump spoke about deregulation goals and cut a ribbon across stacks of paper that represented current regulations and 1960 regulations.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]