["A video of a teacher sexually violating female students is being shared on Indian social media with the claim suggesting that the incident took place inside a madrasa. Twitter user Gopal Goswami whose bio reads “lifetime learner of Sanatana” shared the video and wrote, “Think before you send daughters to madrasas, send them to government schools where they get can a scientific education. After all the world will teach them all of this. (बेटियों को मदरसा में भेजने से पहले विचार करें, उन्हें सरकारी विद्यालयों में भेज कर विज्ञान की शिक्षा दें, ये सब तो दुनियाँ सिखा ही देगी.)” Goswami’s tweet was quote-tweeted by BJP supporter Shefali Vaidya.", "This article does not contain any links to the video to protect the identity of minors.", "Several people believe that the incident took place in India. While some are calling for a nationwide National Register of Citizens (NRC) drive same as Assam, others have tagged Prime Minister Modi and Home Minister Amit Shah to demand a ban on madrasas. One of the users has also shared a news clipping of a 2017 incident where 52 girls were rescued from a Lucknow madrasa following allegations of sexual assault.", "This slideshow requires JavaScript.", "The video is also circulating on Facebook with the same claim.", "A reverse-image search of the video’s keyframes took us to a YouTube channel that shared the video on July 8, 2020. Its description said that allegations of sexual harassment were levelled on Nurul Haque, headteacher at Sonar Bangla Secondary School in Wazirpur, Barisal district of Bangladesh.", "A keyword search in Bengali ‘বরিশাল জেলার উজিরপুর সোনার বাংলা নুরুল হক’ took us to the same video shared across Bangladeshi Facebook pages in July. From Dhaka-based page Kutubdiar News, the clip gathered nearly 5 million views.", "The incident was also reported by Bangladeshi news organisations after the video began circulating widely in July.", "According to a report by Kaler Kantho, the viral video dates back to 2016 and headteacher Nurul Haque Sardar was dismissed from Sonar Bangla Secondary School after locals protested against his actions.", "The report further said that Nurul is a known sexual offender. He used to work in a secondary school in Shikarpur before moving to Wazirpur. He was accused of engaging in an illicit relationship with a student in Shikarpur and forced to marry her when locals discovered.", "An old video of a school teacher in Bangladesh sexually violating female students is being shared in the Indian social media ecosystem with the false claim that the incident took place in a madrasa. The claim does not specify that the clip pertains to Bangladesh thus leading many to assume that it happened in India", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A purported video of a Muslim man beating a temple priest with a bat is…", "A picture depicting the Pakistani flag apparently bigger in size and apparently placed higher than…", "Amid the ongoing war between Israel and Hamas, a video of a fleet of cars…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "A clip featuring Pakistan men’s Cricket team captain Babar Azam is viral on social media…"]