["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Sen. Richard Durbin, D-Ill. | Ashlee Rezin/Sun-Times", "Democratic U.S. Sen. Richard Durbin said President Donald Trump‘s hardline stance on immigration has driven the nation’s current refugee crisis to all-time highs.", "\"What we’ve seen at the border in the last several months has been shocking and unprecedented,\" Durbin said in a speech on the Senate floor.", "\"This get-tough president who says he’s going to cut off foreign aid to countries in Central America and get tough at the border with his almighty wall has ended up attracting larger numbers of people coming to the United States presenting themselves for asylum status at our border than we’ve ever seen,\" the four-term Illinois senator said. \"Dramatic increases we haven’t seen for decades in people at the border.\"", "It’s been widely reported that undocumented migrants are being intercepted by federal border agents or surrendering themselves along the border at levels not seen in decades, despite the president’s continued calls to curtail immigration.", "But has that rapid surge — still well below the 1.6 million peak in southwest border apprehensions 19 years ago — been accompanied by an unprecedented rise in migrants seeking asylum protections? And, if so, is it possible to say whether Trump played the central role in drawing them here? We decided to find out.", "To examine Durbin’s assertions, we took a look at what is known as \"credible fear\" claims, the first step undocumented migrants at the border must take to seek asylum by claiming to fear racial, political, social or religious persecution at home.", "Data on the U.S. Customs and Border Patrol’s website shows the number of migrants making such claims at the southwest border rose from 55,584 in 2017 to 92,959 the following fiscal year, a nearly 70% increase. The Customs site didn’t have data for previous years.", "A Durbin spokesperson referred us to an article about those recent CBP numbers, but did not provide any historical data. Still, there are other ways of tracking fear claims that suggest Durbin may be correct on this count.", "We looked at more data from the U.S. Department of Homeland Security, the U.S. Citizenship and Immigration Services (USCIS), which screens migrants who make credible fear claims, and other sources.", "By all those measures, the claim that asylum seekers are arriving at record levels seems to check out, though not all track fear claims made at the southwest border specifically.", "The USCIS numbers, for instance, show that in 2006 about 5,000 migrants made credible fear claims. In 2018, that total surged to more than 99,000. Those figures include claims of credible fear at all borders and ports of entry, but a majority come from Central American migrants, who are likely to enter at the southwest border.", "The upward trend began under President Barack Obama when in 2014 a migration surge occurred, driven in part by unaccompanied children fleeing violence and insecurity in Central America. But in none of those years did total claims pass the highs reported by USCIS for 2018.", "The Trump administration highlighted the USCIS claims numbers — which represent a nearly 1,800% increase between 2006 and 2018 — as part of its justification for a new rule that bars most migrants who arrive at the U.S.-Mexico border from applying for asylum if they have not first sought refuge in one of the countries they traveled through. Announced earlier this month, that rule is temporarily blocked by a court challenge.", "The shifting demographic profile of migrants showing up at the border today also suggests greater numbers of asylum seekers, experts told us.", "For decades, most crossing the southwest border without permission were single men from Mexico looking for work. Today, migrants are more likely to come from a violence- and poverty-stricken region known as the Northern Triangle that includes El Salvador, Guatemala and Honduras.", "And the number of border apprehensions involving families has hit record levels, according to the CBP. Groups that include at least one child with parent or guardian now account for more than half of those seeking to cross. Unaccompanied minors arriving at the border are also on the rise, although that total has yet to surpass 2014’s numbers.", "While there’s a case for Durbin’s argument that asylum claims at the border are at a record high, it’s not possible to prove or disprove his argument drawing a direct line between Trump and his policies and the leap in asylum seekers or even the overall surge in migration.", "\"It’s always hard to pinpoint the cause of migration flows because there are so many factors that go into these decisions to migrate,\" said Jessica Bolter, an analyst with the Migration Policy Institute.", "Bolter and other experts described myriad \"push factors\" leading migrants from the Northern Triangle to leave their homes, including gang violence, a precarious economy, pressures from climate change and widespread government corruption. Meanwhile, brighter economic opportunities in the strong U.S. job market and the chance to reunite with family members now living in the U.S. account for some of the main draws.", "Experts also said it is difficult to pinpoint what began attracting asylum seekers in higher numbers this year and last.", "\"It’s a little bit of a mystery because it kind of came out of nowhere,\" said Pia Orrenius, an economist at the Federal Reserve Bank of Dallas who studies regional economic growth and demographic change. She said those countries’ economies and job situation have not changed much, and crime, while significant, hasn’t worsened.", "Meanwhile, more lenient policies implemented under Mexico’s new president could play a role, she and other experts suggested.", "Smugglers may also be capitalizing on the backlogged asylum system, which has allowed many migrants to stay in the U.S. as their cases are processed, some experts said. That’s another avenue the Trump administration has worked to cut off.", "Several experts also suggested Trump’s rhetoric, along with his administration’s moves to discourage immigration, might be driving refugees to the U.S. border by giving smugglers ammunition to persuade families to migrate now before more restrictive policies are implemented.", "\"When Trump came in and announced his hardline policy and intention to build a border wall, I think that itself started people heading northward to get in before the wall was built,\" said Douglas Massey, a professor at Princeton University’s Office of Population Research, who has studied border migration for decades. \"So I think to some extent Trump actually encouraged the flow with his hardline tactics.\"", "However, Massey added, \"there’s no really strong analytic way to show if that’s true or false.\"", "On the other hand, Andrew \"Art\" Arthur, a former immimigration judge and an advocate for more restrictive border enforcement, argued that record high asylum claims suggest Congress is at fault for stymying the president’s attempts at reform.", "\"It’s not the president’s rhetoric but Congress’ inaction, both with respect to plugging the loopholes and with respect to providing sufficient resources that’s caused this huge influx of people coming to the border,\" said Arthur, a fellow at the Center for Immigration Studies, which favors lower immigration levels. \"People are taking advantage of the situation and Congress has failed to act.\"", "Experts we interviewed also questioned Durbin’s argument that Trump’s move to cut foreign aid is to blame, noting the measure is just beginning to take effect and would have preceded the recent migration surge, which began in late 2018.", "Durbin said Trump \"has ended up attracting larger numbers of people coming to the United States presenting themselves for asylum status at our border than we’ve ever seen.\"", "Despite some limitations, federal data does suggest the number of credible fear claims made by migrants seeking asylum at the southwest border has hit a record high.", "However, Durbin’s argument that Trump caused the increase remains unproven and overlooks many other factors experts said could be at play.", "We rate his claim Half True.", "HALF TRUE – The statement is partially accurate but leaves out important details or takes things out of context.", "Click here for more on the six PolitiFact ratings and how we select facts to check.", "Correction: A previous version of this fact-check identified Durbin as a three-term senator. It has been updated to reflect he is currently serving his fourth term.", "Video: Sen. Durbin on Trump’s plan for mass deportations, posted to YouTube July 11, 2019", "\"Thousands Are Targeted as ICE Prepares to Raid Undocumented Migrant Families,\" New York Times, July 11, 2019", "\"Migration Surge From Central America Was Spurred, in Part, by Mexican Policies,\" New York Times, April 1, 2019", "\"‘The Conveyor Belt’: U.S. officials say massive smuggling effort is speeding immigrants to — and across — the southern border,\" Washington Post, March 15, 2019", "\"Border apprehensions hit 12-year high in March as Trump vows 'tougher direction,'\" USA Today, April 9, 2019", "Total southwest border apprehensions: FY1960-2018, U.S. Border Patrol, accessed July 26, 2019", "Southwest border migration: FY2019, U.S. Customs and Border Protection, accessed July 26, 2019", "Email interview: Emily Hampsten, Durbin spokesperson, July 16-18, 2019", "Q&A: Credible fear screening, U.S. Citizenship and Immigration Services, accessed July 26, 2019", "Claims of credible fear at the southwest border: FY17-18, U.S. Customs and Border Protection, accessed July 26, 2019", "\"Asylum Claims Jump Despite Trump’s Attempt to Limit Immigration,\" New York Times, Dec. 10, 2018", "Report: Border Security Metrics, U.S. Department of Homeland Security, May 1, 2018", "Credible fear workload summaries, FY2006-FY2019, U.S. Citizenship and Immigration Services, accessed July 24, 2019", "Defensive asylum applications, Executive Office for Immigration Review, accessed July 26, 2019", "Interim final rule, Federal Register, July 16, 2019", "\"Trump moves to eliminate nearly all asylum claims at U.S. southern border,\" Los Angeles Times, July 15, 2019", "\"Trump’s Latest Attempt to Bar Asylum Seekers Is Blocked After a Day of Dueling Rulings,\" New York Times, July 24, 2019", "\"Does America face a refugee or an immigration problem?\" PolitiFact, June 29, 2018", "Press release, U.S. Customs and Border Protection, March 5, 2019", "\"As Trump rallied for border wall Monday, migrant families arrived in record numbers,\" Washington Post, Feb. 12, 2019", "Phone interview: Douglas Massey, professor of sociology and public affairs at Princeton University, July 22, 2019", "Phone and email interviews: Jessica Bolter, analyst at the Migration Policy Institute, July 18-26, 2019", "Phone and email interview: Pia Orrenius, vice president and senior economist at the Federal Reserve Bank of Dallas, July 18 & 26, 2019", "Phone interview: Andrew Arthur, resident fellow at the Center for Immigration Studies, July 22, 2019", "Report: Recent Migration to the United States from Central America: Frequently Asked Questions, Congressional Research Service, Jan. 29, 2019", "Report: The U.S. Asylum System in Context, Migration Policy Institute, September 2018", "Email interview: Gail Montenegro, spokesperson for the U.S. Department of Justice Executive Office for Immigration Review, July 17 & 19, 2019", "Email interview: Genevieve Billia, spokesperson for the U.S. Citizenship and Immigration Services, July 17 & 24, 2019", "Phone interview: Alex Nowrasteh, director of immigration studies at the Cato Institute, July 22, 2019", "Phone interview: Nestor Rodriguez, professor of sociology at the University of Texas-Austin, July 22, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]