["Sen. Ted Cruz said a string of rival Sen. Marco Rubio’s attacks at the Republican presidential debate in South Carolina were \"flat-out false.\"", "One attack pinpointed Cruz’s record on military spending.", "\"The only budget you have ever voted for, Ted, in your entire time in the Senate is a budget for (Sen.) Rand Paul that brags about how it cuts defense,\" Rubio said.", "Cruz shook his head and said Rubio knowingly made an inaccurate claim.", "\"The attack he keeps throwing out on the military budget. Marco knows full well I voted for his amendment to increase military spending to $697 billion,\" Cruz said. \"What he said, and he said it in the last debate, is simply not true.\"", "Rubio has criticized Cruz’s record on military spending before, as Cruz voted for a proposed Paul budget that would have resulted in lower defense spending than current projections.", "But on his specific point about voting for Rubio’s amendment, Cruz is right. (We're not fact-checking whether Rubio \"knows full well\" about Cruz's vote.)", "Trying to counteract defense spending cuts over the past few years, Rubio put forth an amendment to increase military spending in March 2015. If passed, the amendment would have raised projected defense spending outlays through 2022 in Congress’ proposed budget.", "Cruz voted for the amendment. The measure failed 32-68.", "Cruz mentioned $697 billion, specifically, but it’s a little unclear exactly how much Rubio’s amendment would increase spending. On the Senate floor, Rubio said defense funds should reflect the Department of Defense’s 2012 fiscal year request, which projected $611 billion in spending in 2016. But Sen. Tom Cotton, R-Ark., who backed the amendment, said it would increase military spending to $697 billion.", "The very same day, the Senate voted on a Paul amendment that would have increased military spending to a similar level as the Rubio amendment, but it offset those costs with cuts to education, research and more. Cruz and Rubio both voted against the amendment, and it failed 4-96.", "Our ruling", "Cruz said Rubio \"knows full well I voted for his amendment to increase military spending to $697 billion.\"", "Cruz did indeed vote for a failed Rubio amendment that would have increased military spending after years of spending cuts.  While the amendment didn’t specifically say spending would be increased to $697 billion, that figure was part of the discussion among the bill’s proponents.", "Cruz’s point is right on, so we rate his statement True.", "PolitiFact, \"Marco Rubio says Ted Cruz voted for defense cuts in Rand Paul's budget,\" Dec. 22, 2015", "Congress.gov, S.Amdt.940 to S.Con.Res.11, March 26, 2015", "Congress.gov, S.Amdt.423 to S.Con.Res.11, March 26, 2015", "Time, \"Rand Paul Proposes Boosting Defense Spending,\" March 26, 2015", "Politico, \"2016 brawl breaks out on Senate floor,\" March 26, 2015", "Congressional Research Service, \"Defense: FY2012 Budget Request, Authorization and Appropriations,\" Nov. 25, 2011", "Tom Cotton Facebook, Senate floor remarks video, March 25, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]