["As the oil spill in the Gulf of Mexico continues to threaten the coastline, Savannah's Eric Johnson, a Republican gubernatorial candidate, remains steadfast in his support for offshore drilling. He dedicated a blog post to his position on his campaign Web page. \"Predictably, liberal activists call the Gulf disaster a warning of things to come if we expand drilling, but this incident is an unfortunate exception to the rule. The last major oil spill from a drilling accident in America happened over 40 years ago in 1969. In fact, oil spills from tankers are far more common than the very rare leaks from rigs or pipelines.\"An earlier PolitiFact item ruled that Johnson's claim that the last major oil spill from a drilling accident in America took place in 1969 was False. This one deals with whether oil spills from tankers are far more common than \"very rare leaks\" from rigs or pipelines. We looked at a 2009 report produced by the American Petroleum Institute, an industry group, that catalogs oil spills. Indeed, the number of spills from tankers in U.S. waters is nearly two-and-a-half times higher than those of offshore oil pipelines and oil platforms combined. Tankers also dump more than three times more oil. Two scientists who study the ocean and environment also confirmed that tankers are responsible for more spills. Here's how the numbers from the American Petroleum Institute break down:    U.S. offshore pipelines, 1969 to 2007: 506 spills, 182,355 barrels  p24    U.S. platforms, 1969 to 2007: 1,035 spills, 277,033 barrels p24    Oil tankers in U.S. waters: 3,774 spills, 1962 through 2007; 1,596,638 barrels p31U.S. Coast Guard figures on spills differ from API data but back up the overall point that tanker spills are far worse polluters than offshore oil pipelines or platforms. But are leaks from rigs or pipelines \"very rare\"?  The petroleum industry's own figures indicate the U.S. has averaged more than 13 pipeline spills and 27 platform spills a year. They're certainly less common than tanker spills, as Johnson stated. But platform and pipeline spills still take place roughly 40 times annually. That's a little more than three times per month. That's not rare at all. That's chronic. We rule this claim Half True.", "Eric Johnson for Governor Web site, \"Despite the spill, we still need to drill,\" June 7, 2010. American Petroleum Institute, \"Analysis of U.S. Oil Spillage,\" August 2009. U.S. Coast Guard, \"Pollution Incidents in and Around U.S. Waters a Spill/Release Compendium: 1969 - 2004,\" 2007Scripps News, \"Offshore oil drilling: cleaner than Mother Nature,\" July 24, 2008. Interview, Judith McDowell, senior scientist, Biology Department, Woods Hole Oceanographic Institution, June 8, 2010Interview, Felicia Coleman, director, Florida State University Coastal and Marine Laboratory, June 8, 2010Interview, Ben Fry, Eric Johnson Campaign for Governor, June 8, 2010The Atlanta Journal-Constitution, \"Spill could prolong search for Georgia oil,\" April 30, 2010.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]