["In a debate with his Democratic foe, Republican gubernatorial nominee and Texas Attorney General Greg Abbott said Texas’ voter-identification law is needed because voter fraud does occur. Cocaine may have even been traded for votes, he said.", "Abbott said during the Sept. 19, 2014, debate against state Sen. Wendy Davis: \"Voter fraud is real. It must be stopped. And voter identification is one of the tools to put a stop to it.\" State lawyers this week finished defending the law against a federal challenge heard in U.S. District Court in Corpus Christi.", "A moment later, Abbott said: \"I almost hesitate to bring this up, but you know that one of the challenges that’s going on as we speak is the fact that the FBI is involved in an investigation about people in the Rio Grande Valley who are using cocaine to buy votes. We cannot accept or tolerate this kind of lack of integrity in the election process.\"", "We wondered: Is the government checking into ongoing trades of cocaine for votes?", "For starters, the McAllen Monitor newspaper reported on the investigation and the arrests of two women in a Sept. 1, 2014, news story. The story was based on court filings indicating the FBI was looking into allegations that a Hidalgo County commissioner’s campaign manager had used cocaine to draw votes in the 2012 primary election.", "Neither the commissioner nor campaign manager was identified in news story or the filings, which were posted online by Breitbart.com, the conservative news website. But, the Monitor reported, Veronica Saldivar and Belinda Solis, who worked as politiqueras – paid political campaign supporters who have been known to drive voters to the polls and even pay for votes – had just appeared before U.S. Magistrate Judge Peter Ormsby in McAllen.", "In one of the filings, dated Aug. 28, 2014, Brandon Cook, an FBI special agent, said Solis had told him in a January 2014 interview that a campaign manager gave ziplock bags containing \"dime bags of cocaine to politiqueras\" to give to voters in exchange for their votes.", "In the other filing, Cook said that in early 2014, a person identified as \"Campaign Worker 1\" said he worked for a county commissioner in the 2012 primary election and bought $50 worth of cocaine, split it up and gave it to Saldivar and a person identified as \"Campaign Worker 2\" to give to voters in exchange for their votes; that worker, Cook said, told the FBI a campaign manager for a candidate gave ziplock bags containing cocaine to Saldvivar and to them to give to voters for votes.", "Cook said Saldivar recalled giving baggies of cocaine to two voters. Cook also said Saldivar gave authorities a list of individuals she recalled paying with cash, beer, cigarettes or cocaine in exchange for votes.", "We asked Michelle Lee, an FBI spokeswoman in San Antonio, if trades of cocaine for votes remain under investigation. \"Until a case if fully adjudicated, we view it as still under investigation,\" Lee said by phone.", "Lee noted, too, Justice on Sept. 19, 2014, issued a press release revealing the arrest in Illinois of a campaign manager, Francisco \"Frankie\" Garcia, of Donna, who had been charged with conspiring to buy votes, paying for votes and aiding and abetting others to buy votes.", "A federal indictment returned Sept. 16, 2014 said Garcia worked as a campaign manager for four candidates to the Donna School Board up to the November 2012 general election. After the voters at issue cast their votes, the indictment says, some would be brought to Garcia, who would himself pay in cash or baggies of cocaine.", "\"During that time, he allegedly bought votes and worked with other campaign workers to pay voters and to offer to pay voters in this election to vote for particular candidates,\" Justice said. \"The indictment alleges that Garcia paid voters by giving the voters either cocaine or cash in exchange for their votes.\"", "Justice said three campaign workers – Rebecca Gonzalez, 44, and Diana Balderas Castaneda, 48, both of Donna, Texas, and Guadalupe Escamilla, 72, of Weslaco, Texas – previously pleaded guilty to vote-buying charges stemming from this election.", "Our ruling", "Abbott said the FBI is \"involved in an investigation about people in the Rio Grande Valley who are using cocaine to buy votes.\"", "This statement referenced a cocaine-for-votes investigation resulting in several recent arrests. Given Abbott’s phrasing, though, it’s worth clarifying the alleged incidents occurred two years ago. Notably too, the investigation has yet to indicate anything about the voter ID law.", "We rate this claim Mostly True.", "MOSTLY TRUE – The statement is accurate but needs clarification or additional information.", "Click here for more on the six PolitiFact ratings and how we select facts to check.", "News story, \"Campaign workers tell FBI they gave voters cocaine for commissioner’s 2012 bid,\" the McAllen Monitor, Sept. 1, 2014 (accessed Sept. 22, 2014)", "Documents, \"Criminal Complaint, U.S. vs. Belinda Solis,\" and \"Criminal Complaint, U.S.vs. Veronica Saldivar,\" Brandon Cook, special agent, FBI, Aug. 28, 2014 (posted online by Breitbart.com, accessed Sept. 23, 2014)", "Telephone interview, Michelle Lee, public affairs officer, Federal Bureau of Investigation, San Antonio, Sept. 24, 2014", "Press release, \"Campaign Manager Charged with Buying Votes in a Donna, Texas, School Board Election,\" U.S. Department of Justice, Office of Public Affairs, Sept. 19, 2014 (accessed Sept. 24, 2014)", "Federal indictments of Francisco \"Frankie\" Garcia, U.S. District Court, Southern District of Texas, McAllen, Sept. 16, 2014 (obtained via PACER, Sept. 24, 2014)", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]