["The first photo was published on Facebook here on October 27, 2020. The post has been shared 4,700 times.", "The post’s Urdu-language caption translates to English as: \"Allah may protect all religious schools.\"", "The text above the image reads: “The nation is totally silent because funerals are of religious students. #Peshawarblast.”", "The post circulated the same day a bombing was detonated at a religious school in Peshawar, killing at least seven students and wounding scores more, AFP reported here.", "The photo was also shared alongside a similar claim on Facebook here, here and here and on Twitter here.", "The claim is false.", "A reverse image search on Google found the photo has circulated online since 2018, two years before the Peshawar bombing.", "It can be seen here and here in reports published in August 2018 about a road accident in Bangladesh.", "Below is a screenshot comparison of the misleading post (L) and the 2018 blog post (R):", "The second photo showing a wounded child was published on Facebook here on October 27, 2020. The post has been shared 476 times.", "The post’s Urdu-language caption translates to English as: “Today the tearful eyes of this martyred child in a bomb blast at the religious seminary in Peshawar are asking the rulers of the state what was his fault?”", "The photo was also shared alongside a similar claim on Facebook here and here.", "The claim is false.", "A reverse image search on Google found the photo was published by Getty Images here in January 2020, ten months before the Peshawar bombing.", "The photo's caption states it shows a child in Syria who was wounded in an airstrike.", "The photo’s caption reads: “EDITORS NOTE: Graphic content / An injured Syrian child cries after being transported to a clinic for treatment following an air strike by pro-regime forces on the nothwestern city of Idlib on January 11, 2020. (Photo by Omar HAJ KADOUR / AFP) (Photo by OMAR HAJ KADOUR/AFP via Getty Images).”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]