["About this rating", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "On April 2, 2020, U.S. President Donald Trump's senior adviser and son-in-law Jared Kushner told reporters that the Strategic National Stockpile was \"our stockpile,\" meaning the U.S. government's, and that it wasn't \"supposed to be states' stockpiles that they then use.\" This seemed to contradict the description of the stockpile on the government's own Public Health Emergency website.", "At least it did for a time. Shortly after Kushner made this remark, the text on this government website was changed.", "Washington Post reporter Laura Bassett was one of the first to point out this discrepancy. On April 2, Bassett shared a video of Kushner's press conference along with a screenshot from the Strategic National Stockpile website:", "Kushner said on April 2: \"The notion of the federal stockpile was it's supposed to be our stockpile. It's not supposed to be states stockpiles that they then use.\"", "But the website read on April 2: \"When state, local, tribal, and territorial responders request federal assistance to support their response efforts, the stockpile ensures that the right medicines and supplies get to those who need them most during an emergency.\"", "Shortly after Kushner's remarks, however, the text of this website was changed.", "On April 3, the website read instead: \"The Strategic National Stockpile's role is to supplement state and local supplies during public health emergencies. Many states have products stockpiled, as well. The supplies, medicines, and devices for life-saving care contained in the stockpile can be used as a short-term stopgap buffer when the immediate supply of adequate amounts of these materials may not be immediately available.\"", "Bassett, as well as several other journalists, posted screenshots showing how the website appeared before and after Kushner's remarks.", "These screenshots genuinely show how this website appeared on April 2, before Kushner's remarks, and on April 3, after his remarks. These changes can also be seen on the Internet Archive. Here's a link to the Strategic National Stockpile page archived before Kushner's comments, and a link to the page that was archived after his comments.", "A spokesperson for the U.S. Department of Health and Human Services' Office of the Assistant Secretary for Preparedness and Response (ASPR), which manages the stockpile, told CNN that these changes were in the works before Kushner's comments. The spokesperson would not comment on the record and gave this statement to CNN on condition of anonymity:", "This is language we have been using in responding to inquiries for weeks now. ASPR first began working to update the website text a week ago to more clearly explain to state and local agencies and members of the public the role of the SNS.", "Blake, Aaron.   \"The Trump Administration Just Changed its Description of the National Stockpile to Jibe with Jared Kushner’s Controversial Claim.\"\r\n    The Washington Post.   April 2020.", "Dale, Daniel.   \"Trump Administration Edits National Stockpile Website a Day After it Contradicted Jared Kushner.\"\r\n    CNN.   3 April 2020.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]