["About this rating", "In a 2019 video announcing his presidential candidacy, Joe Biden praised protesters who clashed with white supremacists in Charlottesville in 2017 as a \"courageous group of Americans.\" Anti-fascists were among those protesting.", "However, other groups and individuals, not just antifa, protested against white supremacy in Charlottesville, and Biden didn't single out antifa in his praise.", "In June 2020, photographs of Democratic presidential candidate Joe Biden began circulating on Facebook that included quotes alleging he referred to antifa (anti-fascists) as \"courageous Americans.\"", "This quote first appeared in 2019 and re-emerged during ongoing protests against the May 25, 2020, death of a Black man named George Floyd while in custody of a white police officer.", "Biden did laud protesters in general who were resisting a white supremacist rally in Charlottesville, Virginia, in August 2017. But during his April 2019 presidential candidacy video, he did not specifically refer to antifa, an anti-fascist movement that sometimes resorts to violence.", "Biden’s 2019 comments referred to the events of August 2017, when violence broke out in Charlottesville between counter-protesters and white supremacists who were marching against the planned removal of a Confederate statue. A paralegal was killed, and dozens injured after a car rammed into demonstrators.", "Biden in the video condemned U.S. President Donald Trump's comments after the violence; Trump had said there were \"very fine people on both sides.\" Biden also rejected what he called Trump's moral equivalency between the white supremacists who \"spread hate\" and the protesters who stood against it, saying:", "[In Charlottesville] in August of 2017 we saw Klansmen and white supremacists and neo-Nazis come out in the open, their crazed faces illuminated by torches, veins bulging, and baring the fangs of racism. Chanting the same anti-Semitic bile heard across Europe in the 30s. And they were met by a courageous group of Americans, and a violent clash ensued, and a brave young woman lost her life.", "In other words, the graphic featuring Biden is a misquote. While antifa was part of the counter-protests in Charlottesville, Biden did not mention the group by name. Therefore, we rate this claim as \"Mostly False.\"", "BBC News.   \"Charlottesville: Who was victim Heather Heyer?\"\r\n   14 August 2017.", "Coaston, Jane.   \"Trump’s new defense of his Charlottesville comments is incredibly false.\"\r\n   Vox.   26 April 2019.", "D'Abrosca, Peter.   \"Biden: Antifa 'Courageous Group of Americans'.\"\r\n   The Rundown.   1 July 2019.", "Ibrahim, Nur.   \"Can Trump Designate Antifa as a ‘Terrorist Organization’?\"\r\n   Snopes.   3 June 2020.", "Lord, Jeffrey.   \"Biden’s First Campaign Gaffe.\"\r\n   The American Spectator.   26 April 2019.", "Stockman, Farah.   \"Who Were the Counterprotesters in Charlottesville?\"\r\n   The New York Times.   14 August 2017.", "Strickland, Patrick.   \"Unite the Right: White Supremacists Rally in Virginia.\"\r\n   Al Jazeera English.   13 August 2017.", "Nur Nasreen Ibrahim is a reporter with experience working in television, international news coverage, fact checking, and creative writing.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]