["President Donald Trump", "A list of Wisconsin voters who state officials believed recently moved was a source of ongoing controversy in the runup to the 2020 election.", "The state planned to use this information to update the voter rolls by 2021 — knowing the list contained errors — but many conservatives pushed to have those people pulled off the rolls of registered voters before this year’s election. That didn’t happen.", "But now President Donald Trump is raising the matter again amid a flurry of other baseless voter fraud claims.", "Trump took aim at the Wisconsin system — built by Republicans — in a Dec. 2, 2020, speech, including this callback to the contested cleanup of the Wisconsin voter rolls:", "\"In Wisconsin, the state’s Board of Elections could not confirm the residency of more than 100,000 people, but repeatedly refused to remove those names from its voter rolls before the election,\" Trump said. \"They knew why, nobody else did. I knew why. They were illegal voters.\"", "Trump raises a new issue here, going so far as calling the people on this list illegal voters.", "So let’s look back at what we know.", "And why that description is wrong.", "This controversy dates to October 2019, when the Wisconsin Elections Commission sent mailers to 232,000 people saying it believed they may have moved, asking them to update their voter registration or confirm if they lived at the same address. The commission planned to remove people from the roll in 2021 if the resident took no action.", "But three voters — represented by Wisconsin Institute for Law & Liberty — filed a lawsuit in November 2019 arguing the state had to remove the names from the rolls faster. Ozaukee County Judge Paul Malloy agreed and ordered the names be stricken from the voter rolls.", "An appeals court later ruled against Malloy, keeping names on the rolls, and an appeal of that is pending before the state Supreme Court.", "RELATED: Are dead people among the names in Wisconsin voter roll purge?", "In the meantime, the list shrunk — both from people updating their addresses and from thousands confirming they were wrongly listed as having moved. As of May, about 4,700 voters who were flagged as moving reported they were actually still at their same address.", "The list of potential movers was down to 129,000 as of early 2020.", "That brings us to the core of Trump’s claim: That those remaining on the list at the time of the Nov. 3 election were \"illegal voters.\"", "This is simply wrong.", "No officials ever asserted these people were unqualified to vote. Even if they had been removed from the list, these voters could have cast a ballot in November by simply re-registering at the polls or anytime before.", "And we know from voting records that most people in this group were regulars at the polls. Records show 72% of the original 232,000 on the movers list had voted in the 2016 presidential election, and 89% had voted in at least one election since 2006.", "We have seen no evidence that people included on the list voted improperly in the Nov. 3 election.", "Among those left on the list prior to the election, those who moved would have been able to register and vote at their new address. And those who hadn’t moved would have been able to vote at their usual polling place, since they remained registered there.", "Trump said in a speech that residents the Election Commission suspected of moving are \"illegal voters.\"", "But there’s absolutely no factual or logical basis to this claim.", "Most people on this list have been regular voters, and nothing about being on the list makes them ineligible to vote.  It was just an effort to clarify where voters lived.", "We rate this False.", "Donald Trump, speech, Dec. 2, 2020", "Milwaukee Journal Sentinel, Thousands of Wisconsin voters wrongly flagged as having moved, but no one knows extent of errors, Nov. 13, 2020", "Milwaukee Journal Sentinel, Most of the Wisconsinites targeted for removal from voter rolls cast ballots in 2016, Feb. 10, 2020", "Milwaukee Journal Sentinel, Wisconsin appeals court rules voters targeted for purge will remain on the rolls, Feb. 28, 2020", "PolitiFact Wisconsin, Are dead people among the names in Wisconsin voter roll purge?, Jan. 30, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]