["“Fr Thomas Haake of Washington DC was brutally attacked last night simply for being a Catholic priest,” says a June 28, 2020 Facebook post shared more than 80,000 times. It included a photo of a man wearing a priest’s collar, with bruising around his eye and on his face.", "The post did not suggest who was responsible but said, “the assault has begun on priests.”", "Another post on Instagram a day earlier, which described Haake as “my friend,” blamed an unnamed “movement” for assaulting him.", "Liked more than 16,000 times, it was the first reference to the attack, a search using the CrowdTangle social media analysis tool showed.", "“It was a crime motivated by hatred and malfeasance,” said the post, which did not elaborate on which “movement” it blamed.", "Some social media users, however, accused Black Lives Matter, which has gained broad support since the May 25 police killing of George Floyd in Minneapolis, a death that sparked weeks of nationwide protests against racism and police brutality.", "“Fr. Thomas Haake was assaulted by #BLM in the streets of Washington #DC while praying his Rosary,” one tweet said.", "Another claimed: “BLM DID THIS TO THIS 80 year old Catholic priest dressed in his cassock & collar.”", "A few, including this Facebook post, claimed it was a racial hate crime.", "But police say this is inaccurate.", "“Right now it is not being investigated as a hate-bias crime,” Kristen Metzger, deputy director of the Metropolitan Police Department office of communications, told AFP by telephone on July 6.", "Hate-bias would include being targeted because he was a priest, she said.", "As for claims that BLM was involved, Metzger said: “We don't have any information at this time to suggest that.”", "According to a police report obtained on July 3, Haake said he was walking on the John Philip Sousa Bridge at about 6:15 am on June 9 when “he fell to the ground and hit his face on the sidewalk.” Haake later woke up to find his right eye swollen and his wallet and cell phone missing, the report said, listing the items as stolen.", "It said Haake was taken to hospital after the robbery, which was committed with “personal weapons”, such as hands or feet.", "Black Lives Matter has been targeted by online disinformation, including the false claim that it issued “rules” for white protesters, which AFP Fact Check has debunked.", "The robbery occurred in Washington’s Ward 7 which, along with a neighboring ward, had the most violent crimes in the city over the past two years.", "Police data accessed on July 5 showed that, in the month prior, there were four robberies and one assault with a dangerous weapon in the immediate area where Haake was robbed.", "In a July 2 email to AFP, the Archdiocese of Washington said it was  “unable to confirm the facts” due to Haake's request for privacy.", "“He has declined interviews at this this time because he is in the midst of the ongoing investigation by DC Police,” wrote Emma Restuccia, the archdiocese manager of media relations.", "She described Haake as a member of the Oblates of the Virgin Mary, “a visiting priest serving in the Archdiocese of Washington for a few months.”", "AFP visited the Catholic residence where Haake lived, roughly a mile from the scene of the attack, but was told he was no longer there and was staying elsewhere “with the church.”", "Ernest Bengtson, 52, who is not a priest but who lives at the residence, told AFP that Haake had recounted to him what happened.", "As he walked across the bridge in the early morning “there were guys who were passing by” on motorbikes or scooters, “passing back and forth,” he said.", "“And then they came up behind him and they knocked him down, took, you know, his wallet and all that stuff,” Bengtson said.", "“He just takes these long walks in the morning and he prays as he walks,” Bengtson said, confirming Haake is the man pictured in social media posts.", "“This was not anything in the way of a hate crime. Period. It was just street crime.”", "Have you seen content that you would like AFP USA to verify?", "Contact us  E-mail", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]