["The image appeared here on Facebook on August 5, 2020. It was shared more than 370 times before it was deleted.", "The post's Indonesian-language caption translates to English as: “La Vida en 2022", "“Walter Molino is an Italian comic artist and illustrator born on November 5, 1915, in Reggio Emilia, Italy. And died on December 8, 1997, in Milan, Italy. One of his works published in 1962 titled ‘La Vida en 2022’ or ‘Life in 2022’ has recently got a special concern from netizens.", "“The painting which tells about life in 2022 shows people walking by using a machine covered by a glass protector. It was as if humans in that year could not breathe outside air freely without protection, as we experienced during this pandemic.”", "Additional Indonesian-language text superimposed on the image translates to English as: “A painting by Walter Molino in 1962 entitled ‘La Vida en 2022’ or ‘Life in 2022’ suddenly caught the public's attention. This painting is expected to predict the future of the world in the year 2022.”", "Walter Molino was an Italian artist, considered to be one of the country’s greatest illustrators and cartoonists of the 20th century.", "The image was also shared on Facebook here, here, here and here; on Twitter here and here; and here on Instagram, alongside a similar claim.", "The same picture was also posted with a similar claim in English here and here, in Spanish here and here, in Italian here, and in Portuguese here.", "The claim, however, is false.", "A reverse image search on Google found a blog post published in 2014 here. It explains the picture was an illustration of “la singoletta”, a one-person transportation mode as imagined by Molino in 1962.", "The illustration appeared on the back cover of a now-defunct Italian weekly newspaper the Domenica del Corriere on December 16, 1962.", "In the bottom right-hand corner of the image, the Italian text translates to English as: “Will cities be like this? Here's how the traffic problem in cities could be reduced, if not solved completely. Instead of the current bulky cars, we have singolettas, small single-seater cars that occupy a minimum surface area. Walter Molino imagines the street view here if the new solution was adopted on a large scale.”", "AFP contacted the archives department of the Corriere della Sera, an Italian daily newspaper to which the weekly Domenica del Corriere belonged, via e-mail. Francesca Tramma, head of the archives department, explained that “the image was on the back cover” of the newspaper, which was in circulation from 1899 to 1989.", "In response to the misleading posts, Tramma said the image did not allude to the year 2022. \"The drawing imagines the future, replicating the same street in New York that can be seen on the cover of the Domenica del Corriere, in which a man goes crazy in a traffic jam,\" she said.", "The cover of the magazine shows a man stepping on top of a car. The Italian text says: “The nightmare of traffic jams. On a street in New York City, postal clerk George A. Compton, immobilised with his car in a traffic jam, after an exasperating wait went berserk. He got out of the car and took off his shoes and started to climb the river of motionless cars, leaping easily from car to car.”", "This June 4, 2020, blog post, titled: “The Singoletta of 1962: How it was made and who conceived it”, included a photo of the article about the futuristic vehicle from the same 1962 weekly.", "Translated from Italian to English, the 1962 article is titled: “To solve the traffic problem, we propose the ‘singoletta’.”", "After the 1962 back cover went viral with misleading interpretations, newspaper Corriere della Sera published this article on May 18, 2020. It says: “The Singolettas, which move in traffic, as illustrated by Walter Molino, seems ‘prophetic’. In the time of crisis due to the coronavirus, they are a reminder of the importance of redesigning urban travel, from the new rules for public transport to bicycle lanes.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]