["About this rating", "Magnetic resonance imaging (MRI) is, in the words of the Mayo Clinic, a technique used in radiology that employs \"a magnetic field and computer-generated radio waves to create detailed images of the organs and tissues in your body.\"", "We typically associate MRI scans with detection of various unpleasant medical maladies, such as tumors, blocked blood vessels, torn ligaments, and spinal injuries. However, one MRI scan featured in a popular meme is said to have captured a heart-warming image — the physical manifestations of feelings of affection and attachment appearing in the brains of a mother and her child:", "The meme is indeed based on an MRI image of a mother and her child, specifically Dr. Rebecca Saxe, a professor of cognitive neuroscience and associate department head at the Department of Brain and Cognitive Sciences at MIT, and her son. As Saxe explained to Smithsonian Magazine, she undertook this MRI of herself and her infant son not for any diagnostic or scientific purpose, but simply because she believed no one had yet \"ever made an MR image of a mother and child\":", "To some people, this image was a disturbing reminder of the fragility of human beings. Others were drawn to the way that the two figures, with their clothes and hair and faces invisible, became universal, and could be any human mother and child, at any time or place in history. Still others were simply captivated by how the baby’s brain is different from his mother’s; it’s smaller, smoother and darker -- literally, because there’s less white matter.", "As for me, I saw a very old image made new. The Mother and Child is a powerful symbol of love and innocence, beauty and fertility. Although these maternal values, and the women who embody them, may be venerated, they are usually viewed in opposition to other values: inquiry and intellect, progress and power. But I am a neuroscientist, and I worked to create this image; and I am also the mother in it, curled up inside the [MRI] tube with my infant son.", "However, that original MR image looked like this:", "'", "Saxe later, as she explained in a lengthy Twitter thread, overlaid the MR image of herself and her son with information gleaned from a functional magnetic resonance imaging (fMRI) study. That study involved a comparison of the activity produced in infants' brains when they were shown different types of visual images:", "A few years ago, I was doing an fMRI study of infant brains. The scientific questions we were asking were about the organization of functional activity in infant brains when viewing meaningful visual images, like faces and natural scenes.", "At some point we thought: would it be cool to overlay the activation (from our actual science study on watching face movies) onto this picture? So, we did.", "The activations are real fMRI results, of hemodynamic responses while looking at a movies of faces, compared to movies of scenes. They really are from that baby.", "This was the resulting image after the overlay was applied:", "However, someone else then created the meme seen at the head of this page by grafting text onto the overlaid MR image asserting that the colored regions captured the results of a mother's kiss, which \"caused a chemical reaction in her baby's brain that released a burst of oxytocin (a hormone that produces feelings of affection and attachment).\" But that explanation was inaccurate, Saxe noted, stating that the pictured brain activations \"have nothing to do with oxytocin, hormones, kissing, or breastfeeding\":", "As described by Live Science, what the enhanced image actually represented was that even in infants, different types of visual images appear to trigger activity in different parts of their brains, in a pattern consistent with that observed in adults:", "[R]esearchers at the Massachusetts Institute of Technology (MIT) and Harvard Medical School have managed to capture crisp fMRI scans of nine squirming, gurgling, burping or otherwise unruly infants.", "The scans revealed that the visual cortex of 4- to 6-month-old human infants is clearly spatially organized, with distinct regions responding preferentially to human faces versus natural scenes. Additionally, the results showed that the babies' responses to these images resembled those observed in adults. That is, brain activity extended throughout the cerebral cortex, from the front to back of the brain, the researchers wrote in their study, published today (Jan. 10) in the journal Nature Communications.", "[T]he new findings support the hypothesis that specification in the brain at birth provides a sort of scaffolding that ultimately leads to precise category-selective brain regions in adults, the researchers said.", "What this image provides us is not visual confirmation of brain activity produced by the emotion of affection, but data useful in the debate of \"how much of the structure of the brain is specified at birth and how much of that structure arises from experience.\"", "Saxe, Rebecca.   \"Why I Captured This MRI of a Mother and Child.\"\r\n    Smithsonian Magazine.   December 2015.", "Wanjek, Christopher.   \"Peekaboo! Baby Brains Process Faces Just Like Adult Brains Do.\"\r\n    Live Science.   10 January 2017.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]