["About this rating", "On Sept. 13, 2017, the web site EBUZZ.buzz published a video on loop that it claimed was being aired \"live\" in \"Florida after Hurricane Irma!\":", "The site has already shown a tendency to appropriate natural disasters such as Hurricane Irma — which has killed at least 23 people in the United States — for unrelated content, which it then describes as \"live footage\" and plays on a loop to rack up views.", "Both that video and a post featuring a video EBUZZ claimed was a \"cloud face\" generated by the hurricane appear to have been taken down as of Sept. 14, 2017.", "Also, while U.S. Fish and Wildlife Service has confirmed crab migrations in the central part of the state, those involve giant land crabs, commonly known as \"blue crabs\". The ones featured in EBUZZ.buzz's video, however, more closely resemble the crustaceans that travel en masse across regions such as Christmas Island or Cuba's Bay of Pigs on their annual spawning migration.", "We reached out to both USFWS and the Florida Fish and Wildlife Conservation Commission seeking comment, but have yet to hear back.", "Wolf, Colin. \"Central Florida's Giant Land Crabs Are Now Emerging From The Earth.\"\r\nOrlando Weekly. 15 September 2015.", "YouTube. \"Million Crabs Migrating On The Road In Cuba Never Seen Before Amazing Animals Intro.\"\r\nUploaded by Aut Amazing. 24 April 2017.", "PBS. \"Cuban Crab Invasion.\"\r\n30 March 2008.", "Osborne, Mark and Shapiro, Emily. \"Irma Death Toll Continues to Rise, 90 Percent of Homes Damaged in Florida Keys.\"\r\nABC News. 13 September 2017.", "Updated to note that EBUZZ's video featuring the crabs has been removed from its Facebook page.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]