["About this rating", "An Australian jeweler offers parents jewelry embedded with ashes of unused embryos left over from in-vitro fertilization.", "A gruesome image showing a woman with an earring made from an intact fetus is fake.", "On 9 June 2017, click bait web sites posted stories reporting that an Australian company called Baby Bee Hummingbirds has been selling jewelry made from human fetuses, outraging the anti-abortion community. The story is accompanied by a gory photograph of a model wearing a large earring in the shape of a fetus:", "Human embryos “left over” from IVF fertilization are now being used to create jewelry, shocking and angering many.", "The Australian company, Baby Bee Hummingbirds, is known for creating keepsakes out of things such as umbilical cords and breast-milk. The company’s founder, Amy McGlade said:", "“I don’t believe there is any other business in the world that creates jewelry from human embryos, and I firmly believe that we are pioneering the way in this sacred art, and opening the possibilities to families around the world.”", "The story is factual, but the photograph is very misleading. An Australian business named Baby Bee Hummingbirds has indeed created a line of jewelry in which parents treated with in vitro fertilization procedures can have unused embryos cremated and incorporated in jewelry like bracelets, earrings and pendants. But the display image of a woman wearing a large fetus as an earring is altered (very obviously, and rather sloppily). Baby Bee Hummingbirds doesn't make any such item.", "The original image can be found on various online shopping outlets, and was used to sell the gold-colored choker necklace worn by the model. The fetus earring was superimposed on the original.", "The pieces sold by Baby Bee Hummingbird are far more subdued, generally including a crystal or opal-like stone in which cremated \"loved one's ashes\" can be incorporated, company founder Amy McGlade confirmed in an e-mail to us:", "We do offer to craft our line of keepsake jewelry with the ashes from unused Embryos. It's a very special & unique service which offers a lot of comfort to many families.", "In a longer Facebook post published in April 2017 to the company's official page, a representative wrote:", "Please only read with love & respect. The families we craft for are truly aware of the various world wide options for Embryos in storage. They are informed, educated & loving people who have made an educated decision.", "We are absolute experts & true original leaders in Embryo Ashes • DNA Jewellery. This is an exclusive concept unique Baby Bee Hummingbirds.", "We are working with a number of local & international fertility clinics to raise awareness of this option for families.", "The next step in to create educational tools & information packs suitable reflective of this exclusive art.", "We are therefore offering 15% off all Embryo Ashes Jewellery. We hope this will make the process more affordable & easier on families. It is our wish that we can have these pieces professionally photographed & used for our resources.", "The jewelry first came to the public's attention via a 3 May 2017 story published by the Australian parenting blog KidSpot, which interviewed McGlade and a family that purchased her jewelry after struggling over the decision about what to do with their unused IVF embryos. As the company's web site notes, jewelry can also be made from other organic materials like breast milk, placentas, umbilical cord stumps and first teeth.", "The KidSpot story did touch off a round of outrage, and was aggregated by a large number of anti-abortion web sites. Although the sensational and doctored image shared by Bunker Buster News is fake and the story itself seems outlandish, it is indeed true that the company is incorporating cremated embryo ashes in jewelry.", "Mayoh, Lisa.   \"Couples Are Turning Extra IVF Embryos Into Jewellery.\"\r\n     KidSpot.com.   3 May 2017.", "Graham, Ruth.   \"Just How Creepy Is “Embryo Jewelry,” Exactly?\"\r\n    Slate.   5 May 2017.", "Bunker Buster News.   \"Company Is Turning “Extra” Human Embryos Into Jewelry.\"  \r\n    9 June 2017.", "Lawrence, Lianne.   \"Company Receives Backlash for Turning Frozen Embryos Into ‘Jewelry.’\"\r\n  LifeSiteNews.com.   8 May 2017.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]