["Several social media users have shared a video that shows a flooded hospital ward. As per social media claims, this is Nalanda Medical College and Hospital in Patna. “JDU-BJP’s gift to the people of Bihar,” tweeted @i_theindian in view of the upcoming Bihar elections.", "World-class superspeciality hospital in smart-city of Patna: JDU-BJP’s gift to the people of Bihar.#बिहार_में_बहार_हैpic.twitter.com/rHzW1cAGzc", "— Rofl Republic (@i_theindian) July 27, 2020", "This video has been shared with Hindi text on Facebook. A page Bihar Ki Baat shared the video along with a similar claim. It has been viewed over 6,000 times (archived link). Another Facebook user also shared the video believing that this is the recent situation. (archived link)", "(Hindi text पटना के स्मार्ट-शहर में एक विश्व स्तरीय सुपरस्पेशलिटी अस्पताल है NMCH, बिहार के लोगों को चुनाव से पहले मिला ये तोहफ़ा..)", "It is noteworthy that a person behind the camera can be heard saying, “See the condition of NMCH (NMCH का हाल देखिये)” which is the abbreviation for Nalanda Medical College and Hospital.", "Alt News performed a keyword search on Google and found that in September 2019, The Guardian included some sections of the viral video in their report. “Videos shared on social media show submerged roads and heavy flooding at one of the big hospitals in Patna, the state capital of Bihar, where patients lie on beds barely above dirty water. More than 100 people have died in flooding in eastern India, where vast areas have been inundated by delayed monsoon rains,” as per the report.", "A report by Times of India, published on September 28, 2019, carried an image of the same ward. The report stated that knee-deep water entered the intensive care units of NMCH.", "Last year, more than 100 people had died due to floods in Bihar. The death toll in the ongoing floods has reached 10 while the situation worsens. However, the video being shared does not represent the present situation of Nalanda Medical College and Hospital. It was taken during floods in Bihar last year.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]