["The one-minute, 45-second video was posted on December 21, 2020 on Facebook here. It has been viewed thousands of times.", "Translated to English, the post’s Malaysian-language caption reads: “Are Fake Needles used to give Covid-19 Vaccines to World Leaders …”", "The video splices a clip of a man explaining how a retractable syringe works with shots of people receiving vaccinations. The text overlaid on the video in English and Malaysian reads: “Fake needle used to inject world leaders (global elite).”", "The misleading video has also been shared alongside a similar claim here and here on Facebook.", "It has also appeared with a similar claim in Indonesian on Twitter here and on YouTube here.", "But all the claims made by the video are false and most of the clips used have nothing to do with Covid-19 vaccinations.", "Stage props", "The first video actually shows prop master Scott Reeder showing how a retractable syringe and other stage props work in this video he posted on September 2, 2020 on TikTok.", "He also uploaded the same video onto his Instagram account on September 15, 2020.", "A post shared by Scott Reeder (@scottpropandroll)", "Below is a screenshot comparison of the video in the misleading post (L) and Reeder’s TikTok video (R):", "Canada vaccinations", "The clip then cuts to a second video with text overlaid in Malaysian saying: \"These fake injections have been done to several world leaders to convince the society to want to be injected with Covid-19 vaccine\".", "The footage has been taken from this report published on December 14, 2020 by Canadian news site Global News. It is headlined: “Ontario begins COVID-19 vaccination rollout”.", "Below is a screenshot comparison of the video in the misleading post (L) and the Global News video (R):", "The lady in the pink uniform in the video clip is identified as Cecile Lasco, a support worker from the Rekai Centre.", "Here is a photo taken from another angle of her being vaccinated.", "The same event was also covered by other Canadian media, for example CBC News here and CityNews Toronto here.", "In the CityNewsToronto video, from the one-minute 18-second mark, the needle can be seen going into Lasco's skin.", "Ontario health minister", "The misleading video then cuts to a clip of Christine Elliott, the health minister for the Canadian province of Ontario. Text superimposed over the video in English reads: \"Ontario Health Minister Promotes Flu Vaccine... But why is she giggling... lol cuz it's a FAKE NEEDLE.\"", "The clip is actually from 2019 and shows Elliot receiving a routine flu shot, not a Covid-19 vaccine.", "Here is a report posted on the Facebook page of Canadian news channel CP 24 on October 31, 2019.", "There are multiple reports on 2019 flu vaccinations in Ontario and on Elliott getting a flu shot, which she tweeted about herself.", "Below is a screenshot comparison of the video from the misleading post and CP24’s Facebook post:", "Fox News hosts", "The video then cuts to a segment of hosts from Fox & Friends, a morning news show on US-based network Fox News, getting vaccinated. The text on the video reads: \"Don't feel bad Canucks. Fox news host Brian Kilmeade was caught in the same scam.\"", "But again, the video used actually shows Kilmeade, a Fox & Friends co-host, getting a flu shot in 2019.", "A keyword search on Google found this video report titled “‘Fox & Friends’ hosts get their flu shots on Fox Square” from Fox News, dated September 16, 2019.", "Below is a screenshot comparison of the video from the misleading post (L) and the Fox News video (R):", "AFP has debunked other similar false claims that fake needles were used to stage the Covid-19 vaccinations of world leaders, for example here and here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]