["By Jessica McDonald", "Posted on February 21, 2020 | Updated on December 22, 2021", "Q. Is it true that federal agents arrested Harvard professor Charles Lieber for creating the coronavirus?", "A: No. Lieber, a nanoscientist, was charged for lying about his participation in a Chinese recruitment program and his affiliation with a Chinese university. He is not accused of being a spy and has no connection to the new coronavirus.", "Did Charles Lieber and two Chinese students get arrested for creating the virus?", "Did Dr. Charles Lieber, chair of Harvard University’s Dept of Chemistry and Chemical Biology, get caught lying to the Dept of Defense about paying money to China surrounding the Coronavirus?", "Is the story about federal agents arresting Dr. Charles Lieberman true? It also alleges the Coronavirus started at the location of a biological warfare development lab in China. Is that true?", "We’ve received more than a dozen inquiries asking about the veracity of social media posts and memes that tell the story of Charles Lieber, a prominent Harvard scientist who was charged by the Department of Justice on Jan. 28 for repeatedly making false statements about his ties to China.", "The posts, some of which have been shared upwards of 6,500 times on Facebook and are accompanied by a photo of Lieber, make a series of statements that falsely suggest the Harvard scientist is linked to the COVID-19 outbreak that began in Wuhan, China, at the end of 2019.", "Facebook post: In case you missed it, yesterday, Federal Agents arrested Dr. Charles Lieber, chair of Harvard University’s Department of Chemistry and Chemical Biology, with lying to the Department of Defense about secret monthly payments of $50,000.00 paid by China and receipt of millions more to help set up a chemical/biological “Research” laboratory in China.  Also arrested were two Chinese “Students” working as research assistants, one of whom was actually a lieutenant in the Chinese Army, the other captured at Logan Airport as he tried to catch a flight to China – smuggling 21 vials of “Sensitive Biological Samples” according to the FBI.", "Oh, almost forgot.  The research lab the good professor had helped set up? It’s located at the Wuhan University of Technology.  Wuhan China is ground zero to the potentially global pandemic known as the “Coronavirus”which is both spreading rapidly and killing people.", "This is Stephen Coonts international spy novel stuff happening in real life – and it has barely made the news.", "While each individual statement of the post is largely accurate, the main takeaway — that Lieber, possibly working with two students, had something to do with the new coronavirus  — is false.", "In fact, neither Lieber nor the two other individuals, each of whom were charged in separate cases in connection with aiding the People’s Republic of China, have any known link to the new virus. And as we have written before, there is no evidence that the novel coronavirus was engineered in a lab.", "On Jan. 28, the Department of Justice announced the charges against Lieber and the two Chinese nationals in a single press release. But as the title of the release says, the three cases are “separate.”", "As chair of Harvard’s chemistry and chemical biology department, Lieber is the most high-profile of the three. According to the complaint, Lieber lied to both the Department of Defense and the National Institutes of Health about his affiliation with Wuhan University of Technology, or WUT, and his involvement with China’s “Thousand Talents Plan,” a program designed to recruit Chinese ex-pats and foreign scientists to China.", "Lieber also allegedly failed to disclose large sums of money he received from the Chinese government, including more than $1.5 million to start a lab at WUT and a salary of up to $50,000 per month, plus living expenses for his work at WUT.", "The post’s summary gets most of this right, but suggests with quotation marks that Lieber’s lab in China may not have been focused on legitimate research. There is no evidence that’s true.", "According to the charging document, Lieber’s three-year Thousand Talents contract required him to carry out the typical job functions of academic scientists, such as publishing in top journals, advising students and organizing conferences.", "The concern for investigators, as a Science magazine article details, is not that Lieber was acting as a spy, but that he could be vulnerable to Chinese pressure in the future. “It was the amount of money involved that drew our attention,” Andrew Lelling, one of the prosecutors leading the case, told Science. “That is a corrupting level of money.”", "There is nothing inherently wrong with Lieber participating in the Chinese program, but he needed to disclose those relationships and funds to Harvard and when receiving grant money from U.S. agencies. Lieber allegedly failed to do so on multiple occasions, including when he was asked about his Chinese ties from curious investigators. Lieber has not been charged with sharing intellectual property with the Chinese.", "The social media post goes on to imply that Lieber is somehow connected to the new coronavirus because the Chinese university he was involved with was located in Wuhan, where the COVID-19 outbreak began. But there is no evidence that is anything more than a coincidence. When we asked about any connection between Lieber and the new coronavirus, a DOJ spokesperson told us in an email, “The Department of Justice has made no such allegation.”", "Lieber is a nanoscientist who studies and develops extremely small materials on the nanometer scale. (A nanometer is one-billionth of a meter; a strand of DNA is about 2.5 nanometers thick.) While his work has recently focused on coming up with novel ways of using nanowires in cells, he is not a biologist, nor does he have expertise in viruses.", "Lieber’s affiliated school, Wuhan University of Technology, also does not appear to do work with viruses, according to a list of research projects on its website. WUT is primarily an engineering school, focused on subjects such as material science, transportation and logistics.", "Furthermore, Lieber is charged with making false statements to the Department of Defense in 2018 and to the NIH in January 2019, well before the COVID-19 outbreak at the end of last year. The timing of the announced charges just happened to overlap with news of the outbreak.", "Neither of the other cases the Department of Justice announced on Jan. 28 has a connection to the new coronavirus, either.", "In one, Yanqing Ye, a 29-year-old who studied at Boston University from October 2017 to April 2019, admitted to being a lieutenant in the Chinese army. She allegedly lied about her ongoing position in the military to get her visa, and while in the U.S. researched American military projects and compiled online information about two professors working in the fields of computer security and intelligent robotics. Ye was indicted on four counts, including visa fraud, making false statements, acting as an agent of a foreign government and conspiracy.", "As with Lieber, Ye, who is currently in China, does not have expertise in virology. The single paper we found that Ye published as a researcher at Boston University’s Center for Polymer Studies was about a computational method for analyzing data; it has nothing to do with viruses.", "The other case involves Zaosong Zheng, a 30-year-old Chinese national who had conducted cancer research at Harvard’s Beth Israel Deaconess Medical Center and attempted to smuggle 21 vials of biological specimens out of the country.", "On Dec. 9, 2019, Zheng allegedly tried to fly to Beijing with the vials hidden in a sock in his luggage. Federal agents at Boston’s Logan airport, however, stopped him, and Zheng eventually admitted that he had stolen the vials from a Beth Israel lab. He told officers that he planned to continue doing research with the samples in his own lab in China, taking credit for the results and publishing under his name.", "Zheng was charged with smuggling goods from the U.S. and making false statements to Customs and Border Protection officers. He remains in custody, according to the DOJ release.", "The post claims that Zheng smuggled 21 vials of “Sensitive Biological Samples,” but the word “sensitive” does not appear in the charging document or the FBI agent’s affidavit. The affidavit notes that the vials contained a brown liquid and that Zheng said he had stolen eight of the vials from the lab and then worked to replicate the remaining 11 without the knowledge of Beth Israel.", "The Beth Israel lab in which Zheng had worked is focused on basic research about cancer, and studies, for example, the molecular details of how cancerous cells are able to overcome the normal checks on the cell cycle to form tumors.", "Oddly, the post concludes by saying, “This is Stephen Coonts international spy novel stuff happening in real life – and it has barely made the news.” In fact, each of the stories has received considerable news coverage, including in-depth reporting in science news outlets on Lieber and a New York Times story devoted to Zaosong Zheng’s airport antics.", "Of course, there has been no mention of the coronavirus in these news stories because there is no legitimate connection to the new virus. While the social media post for the most part does not overtly misstate the facts, the prevailing message it sends is false.", "Update, Dec. 22: After a six-day trial, a federal jury on Dec. 21 found Lieber guilty of two counts of lying to federal authorities “in an attempt to hide his participation in the Chinese Thousand Talents Program,” and his affiliation with the Wuhan University of Technology, according to the Department of Justice. “China’s Thousand Talents Plan is one of the most prominent Chinese talent recruitment plans designed to attract, recruit and cultivate high-level scientific talent in furtherance of China’s scientific development, economic prosperity and national security,” a DOJ release said. The jury also found Lieber guilty of submitting a false income tax return and failing to file IRS reports disclosing his foreign financial accounts.", "“Harvard University Professor and Two Chinese Nationals Charged in Three Separate China Related Cases.” Press release. Department of Justice. 28 Jan 2020.", "McDonald, Jessica. “Baseless Conspiracy Theories Claim New Coronavirus Was Bioengineered.” FactCheck.org. 7 Feb 2020.", "Charles M. Lieber. Lieber Research Group website. Accessed 20 Feb 2020.", "Jia, Hepeng. “China’s plan to recruit talented researchers.” Nature. 17 Jan 2018.", "Mervis, Jeffrey. “U.S. prosecutor leading China probe explains effort that led to charges against Harvard chemist.” Science. 3 Feb 2020.", "Brumfiel, Geoff. “Harvard Professor’s Arrest Raises Questions About Scientific Openness.” NPR. 19 Feb 2020.", "Coronavirus disease (COVID-19) outbreak. World Health Organization. Accessed 20 Feb 2020.", "Lieber Research Group. Accessed 20 Feb 2020.", "Raimondi, Marc. National Security Spokesman, U.S. Department of Justice. Email sent to FactCheck.org. 21 Feb 2020.", "“Nanoscience.” National Science Foundation. Accessed 20 Feb 2020.", "“Size of the Nanoscale.” National Nanotechnology Institute. Accessed 20 Feb 2020.", "Service, Robert F. “Why did a Chinese university hire Charles Lieber to do battery research?” Science. 4 Feb 2020.", "Wuhan University of Technology. Accessed 20 Feb 2020.", "Ye, Yanqing et. al. “Heterogeneous Graph Based Similarity Measure for Categorical Data Unsupervised Learning.” IEEE Access. Vol. 7, 2019.", "Spice, Kara D. Affidavit for case no. 19-mj-4532-DHH. 10 Dec 2019.", "Phillips, Kristine. “DOJ: Harvard University professor lied about work for the Chinese government.” USA Today. 28 Jan 2020.", "“U.S. charges target alleged Chinese spying at Harvard, Boston institutions.” Reuters. 28 Jan 2020.", "Barry, Ellen. “U.S. Accuses Harvard Scientist of Concealing Chinese Funding.” New York Times. 28 Jan 2020.", "Fernandes, Deirdre. “Chinese medical student accused of trying to smuggle cancer research material out of Boston.” Boston Globe. 30 Dec 2019.", "Subbaraman, Nidhi. “Harvard chemistry chief’s arrest over China links shocks researchers.” Nature. 3 Feb 2020.", "Halford, Bethany and Andrea L. Widener. “Harvard chemist Charles Lieber charged with fraud.” Chemical & Engineering News. 28 Jan 2020.", "Barry, Ellen. “Stolen Research: Chinese Scientist Is Accused of Smuggling Lab Samples.” New York Times. 31 Dec 2019.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]