["Rep. Matt Gaetz, R-Fla., arrives for a closed door meeting on Capitol Hill, Oct. 14, 2019, as former White House advisor on Russia, Fiona Hill, is scheduled to testify before lawmakers as part of the House impeachment. (AP)", "U.S. Rep. Matt Gaetz has dominated national TV in defense of President Donald Trump amid the Democratic-led impeachment inquiry.", "Now social media users are firing back with an unfactual post about the arrest record of the second-term North Florida Republican congressman.", "\"Fun fact for ya,\" reads an Oct. 27 Facebook post. \"Republican Matt Gaetz has had numerous DUIs and his dad got him off each time. He was part of a company that had to pay 75 million in hospice fraud. They stole from dying people. He is the swamp.\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The Facebook post takes a single arrest for DUI, inflates it and omits that the case was dropped. Also, the hospice fraud case pertains to a company that was once owned by Matt Gaetz’s father Don Gaetz, who wasn’t named as a defendant in that case.", "Matt Gaetz was arrested for DUI in 2008. In 2014, when he was a state representative, Gaetz mentioned the incident publicly when a fellow lawmaker called for preventing law enforcement from releasing booking photos unless the suspect is convicted.", "Here’s what happened, according to the Tampa Bay Times:", "When Gaetz was 26, he was driving back from a nightclub on Okaloosa Island in a BMW registered to his father, then-Florida Sen. Don Gaetz. Okaloosa County Deputy Chris Anglin clocked Gaetz traveling 48 mph in a 35 mph.", "Anglin reported that Gaetz’s eyes were watery and bloodshot, and he swayed and staggered when he got out of the car and smelled of alcohol.", "Gaetz, a lawyer, admitted he had consumed two beers but declined field sobriety tests. He was arrested and refused the breath test.", "We did not find evidence that Gaetz’s father Don \"got him off\" of the arrest, as the post says.", "The prosecutor at the time asked to be removed from Gaetz’s case, saying his stepson was friends with Matt Gaetz. The case was then assigned to Steve Meadows, a prosecutor in a neighboring circuit.", "Gaetz’s lawyer filed a motion to drop the case. The prosecutor agreed to drop the case in December 2008, court records show.", "We searched Gaetz’s name on Nexis and did not find any other DUI arrests. Florida Department of Law Enforcement records note only one arrest for Gaetz, in October 2008, related to a DUI misdemeanor traffic offense. Snopes, which debunked a meme about Gaetz’s DUI record in July, found that the earliest version of the claim stemmed from a 2016 post by a conspiracy theorist.", "The Facebook post goes on to say \"he was part of a company that had to pay 75 million in hospice fraud.\"", "That leaves the impression that \"he\" refers to Matt Gaetz, which is wrong. It was Don Gaetz’s former company, Vitas Healthcare Corporation, that was involved in litigation involving fraud. It didn’t involve Matt Gaetz, and the elder Gaetz was not named as a defendant in the lawsuit.", "In 2013, the U.S. Justice Department filed a lawsuit against Chemed Corporation and hospice subsidiaries, including Vitas Hospice Services LLC and Vitas Healthcare Corporation, alleging false Medicare billings for hospice services. The government accused the company of engaging in Medicare fraud between 2002 and 2013.", "At the time the lawsuit was announced, Don Gaetz told the Northwest Florida Daily News that he remained active in the management of Vitas until 2000. Then Gaetz stepped aside when he was elected superintendent of the Okaloosa County School District.", "\"I gave up all management responsibilities in 2000, though I continued as a shareholder and attended about four board meetings a year,\" Gaetz told the newspaper.", "Don Gaetz sold Vitas in 2004 to Chemed. He was elected to the Senate in 2006. Gaetz was not named as a defendant and denied wrongdoing.", "In 2017, the government settled the case for $75 million.", "A Facebook post said, \"Matt Gaetz has had numerous DUIs and his dad got him off each time. He was part of a company that had to pay 75 million in hospice fraud. They stole from dying people.\"", "This post is wrong. Gaetz had one DUI arrest in 2008, and the case was dropped.", "The post also includes a sloppy reference to a hospice company that Matt Gaetz’s father, Don Gaetz, previously owned. Don Gaetz sold Vitas in 2004. In 2013, the federal government announced a lawsuit that resulted in a $75 million settlement in 2017. The case did not name either Matt or Don Gaetz as a defendant.", "We rate this claim False.", "Facebook post, Oct. 27, 2019", "Tampa Bay Times, Lawmaker's talk of mug shot raises questions about DUI arrest, Feb. 18, 2014", "Tampa Bay Times, In House mug-shot debate, Gaetz recalls his brush with the law, Feb. 12, 2014", "Tampa Bay Times, Lawsuit accuses Senate President Don Gaetz's former company of Medicaid fraud, May 10, 2013", "Northwest Florida Daily News, Sen. Gaetz's son charged with DUI, Nov. 4, 2008", "Northwest Florida Daily News, DUI charge dropped against Matthew Gaetz, Dec. 24, 2008", "Northwest Florida Daily News, Justice Department sues hospice care service co-founded by Don Gaetz, May 9, 2013", "AP, Largest US hospice company sued for Medicare fraud, May 9, 2013", "U.S. Department of Justice press release, Chemed Corp. and Vitas Hospice Services Agree to Pay $75 Million to Resolve False Claims Act Allegations Relating to Billing for Ineligible Patients and Inflated Levels of Care, Oct. 30, 2017", "Mother Jones, How Matt Gaetz Used Daddy’s Money to Become Trump’s Favorite Congressman, September/October 2019", "Bradenton Herald, Senate President Don Gaetz sold his ownership in Vitas Hospice Services in 2004 but federal officials say the company was engaged in Medicare fraud before that, May 10, 2013", "Factcheck.org, Misleading Posts Target GOP Rep. Matt Gaetz, Oct. 31, 2019", "Snopes, Matt Gaetz Mug Shot Memes, July 12, 2019", "U.S. Rep. Matt Gaetz office, Statement to PolitiFact, Nov. 1, 2019", "Florida Department of Law Enforcement, Search for Matt Gaetz, Nov. 2, 2019", "US District Court for the Western District of Missouri, United States of America v. VITAS Hospice Services, L.L.C. et al, May 2, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]