["About this rating", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "In late December 2020, social media users shared a copy-and-pasted meme that falsely claimed pharmaceutical company Pfizer recommended that members of the public receiving its COVID-19 vaccine should use birth control because \"genetic manipulation\" resulting from the vaccine could lead to birth defects.", "Here's an example of the meme:", "The accompanying link did not lead to safety instructions accompanying the Pfizer vaccine, which has been approved by the U.S. government for emergency use, as the meme insinuates. Instead, the link led to a publicly available document outlining the methods used in a crucial Pfizer/BioNTech clinical trial for the vaccine that is currently in use. The trial is ongoing.", "Further, page 132 of that study does not state that unprotected sex should be avoided due to risk of birth defects resulting from \"genetic manipulation.\" There is no mention of birth defects or genetic manipulation resulting from the vaccine on page 132.", "The Pfizer document instead recommended that study participants take measures to avoid pregnancy for 28 days after the last vaccine dose during the trial, a time period \"which corresponds to the time needed to eliminate reproductive safety risk\" of the vaccine. This is a broad recommendation for all clinical trials of new pharmaceuticals with unknown reproductive risks. The broad guidance for such clinical trials can be seen outlined by the National Institutes of Health.", "This boilerplate precaution for clinical trials isn't evidence that the COVID-19 vaccine currently in use in the U.S. harms pregnant women or fetuses.", "The U.S. government has so far approved for emergency use two mRNA vaccines against COVID-19 developed by both Pfizer and Moderna. The vaccines do have side effects like fatigue, fever and headache, as well as localized pain.", "The claim that the Pfizer vaccine, which is given in two doses, results in birth defects from \"genetic manipulation\" is likely influenced by viral, false claims that COVID-19 vaccines alter or damage human DNA. Per the Centers for Disease Control and Prevention (CDC), \"Women who are trying to become pregnant do not need to avoid pregnancy after receiving an mRNA COVID-19 vaccine.\"", "As the CDC noted, \"experts believe that mRNA vaccines are unlikely to pose a risk to the pregnant person or the fetus. However, the potential risks of mRNA vaccines to the pregnant person and the fetus are unknown because these vaccines have not been studied in pregnant people.\" If pregnant people are among high-risk groups currently being vaccinated, like medical personnel, they can still receive the vaccine, per the CDC.", "No major safety concerns have been reported to be associated with the Pfizer and Moderna vaccines.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]