["About this rating", "Misinformation spread online in the lead-up to the Jan. 20, 2020, pro-gun rally at the Virginia state Capitol. Amid fears that the rally could be a repeat of the deadly \"Unite the Right\" white supremacist rally in Charlottesville in 2017, Virginia Gov. Ralph Northam declared a temporary state of emergency, banning protesters from carrying firearms on state Capitol grounds.", "About 22,000 demonstrators went to Richmond to rally against new proposed gun regulations, and although the event was organized by a self-described extremist, no official reports exist of any major violence or fights at the event.", "Prior to the protest, Tom Deweese, who has a track record of spreading incendiary misinformation and conspiracy theories, created a Facebook post in which he claimed that he had learned from a source that \"antifa,\" which is the shortened phrase denoting anti-fascist activists, had \"rented seven buses\" and were planning to disguise themselves as pro-gun protesters and cause violence.", "Nevertheless, a number of conspiratorial and right-wing websites ran with the story that antifa activists were renting buses in a plot to commit violence and make gun-rally attendees look bad, citing only Deweese's Facebook post as their source.", "A single source, and unreliable one at that, taking to Facebook to post information he learned from an alleged unnamed source, can hardly be used as the foundation to make a legitimate claim that, if true, could have been a mass-casualty incident. Although hindsight is 20/20, no known buses full of undercover antifa brawlers materialized at the rally in Richmond, Virginia. We therefore rate this claim \"False.\"", "Southern Poverty Law Center.  \"Tom Deweese.\"", "Tavernise, Sabrina. \"Virginia Gun Rally Live Updates: 22,000 Protesters Oppose New Gun Laws.\"\r\n  The New York Times. 20 January 2020.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]