["Media take pictures of a U.S., front, and a Russian plane, rear, believed to be carrying candidates for a 14-person spy swap as part of the largest spy swap since the Cold War have parked on the tarmac at Vienna's Schwechat airport, on July 9, 2010. (AP)", "A headline points the finger at former President Barack Obama for releasing Russian agents.", "\"Obama released 10 Russian agents from U.S. custody in 2010 during Hillary’s uranium deal,\" stated the Nov. 26 headline in Puppet String News.", "Facebook users flagged the post as being potentially fabricated, as part of the social network’s efforts to combat fake news. While Puppet String News is a fake news website, in this case the headline stems from real news.", "The Puppet String story linked to an October 2010 New York Times story which stated that Russian sleeper agents, arrested in the United States in the summer of 2010 and deported to Russia as part of a prisoner exchange, later received top government honors from President Dmitri Medvedev.", "In exchange for the Russian prisoners, Medvedev signed pardons for four men Russia considered spies who had been held for many years.", "\"The agreement we reached today provides a successful resolution for the United States and its interests,\" Attorney General Eric H. Holder Jr. said at the time.", "The Puppet String News story included information from the New York Times story recapping the prisoner swap, which involved the arrest of the agents in the suburbs of New York, Boston and Northern Virginia in the summer of 2010. The agents had been directed to gather information in the U.S. on nuclear weapons, American policy toward Iran and other topics.", "The agents were \"widely lampooned in the West as bumbling caricatures of a bygone era\" for using outdated methods, but in Russia they were praised by top leaders, the New York Times wrote.", "There was nothing in the New York Times story that mentioned Hillary Clinton or uranium.", "The Puppet String News article then added it’s own speculation -- without any evidence -- that the swap involved Russia providing millions of dollars to the Clinton Foundation in exchange for Obama releasing the Russian agents.", "\"As this sounds like the case with these 10 Russian agents being deported back to Russia in 2010 at the same time of the Uranium One deal,\" Puppet String News wrote.", "PolitiFact has previously explained the complex tale which pertains to a company with significant U.S. uranium assets, the Clinton Foundation, and a decision by several federal agencies to allow greater Russian influence in the United States’ uranium market.", "Some have alleged that, as secretary of state, Clinton approved the sale of U.S. uranium assets to Russia’s nuclear energy agency in exchange for donations to the Clinton Foundation. While the connections between the Clinton Foundation and the Uranium One deal may appear fishy to some, there has been no proof of quid pro quo. And it’s not accurate to say that Clinton approved the sale herself.", "Most of the Clinton Foundation donations in question occurred before and during Clinton’s 2008 presidential run, before she could have known she would become secretary of state.", "The decision in 2010 to greenlight the Uranium One deal was approved by a panel comprising multiple governmental agencies, so it’s misleading to conclude the State Department, then headed by Clinton, acted unilaterally.", "We sent a message to Puppet String News via Facebook and did not get a reply.", "By all indications, the prisoner release is no more connected to the Uranium One deal than any number of other events that occurred in 2010. We rate this claim Mostly False.", "Puppet String News, \"Obama released 10 Russian agents from U.S. custody in 2010 during Hillary’s uranium deal,\" Nov. 26, 2017", "New York Times, \"Agents Deported by U.S. Are Honored in Moscow,\" Oct. 18, 2010", "New York Times, \"Russian Spy Suspects Plead Guilty as Part of a Swap,\" July 8, 2010", "Washington Post, \"U.S., Russia negotiating swap of spy suspects,\" July 8, 2010", "Los Angeles Times, \"A quick, mysterious swap on the tarmac,\" (Accessed in Nexis) July 10, 2010", "PolitiFact, \"What you need to know about Hillary Clinton, Russia, and uranium,\" Oct. 24, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]