["About this rating", "The survey question appeared to exist, survey-takers often mocked the question from outside the United States, and were not Obamacare applicants.", "The survey question was not related to Obamacare enrollment or Healthcare.gov.", "In late April 2016, an image began circulating on Facebook, depicting a screenshot of a survey question asking whether you've ever been in an accident resulting in your death. Early versions of the question consisted of just a screenshot, and often came from outside the United States:", "However, as the meme gained traction in late April and early May 2016, the popular image accumulated a new detail. According to some users, the question was an example of the purported ineptitude of the Affordable Care Act (also known as Obamacare). By 6 May, that assertion was overwhelmingly commonplace:", "Verbal descriptions of the question circulated earlier than that, going back to mid-2015.  Again, many of those social media users were from outside the United States, often in the UK:", "One survey taker captured a partial URL in her share of the perplexing question:", "While that user didn't specify what site asked the question, a closer look at the image revealed a web address for a survey company and an open tab for similar activity:", "On 26 April 2016, a Twitter user claimed the question was an \"actual health insurance question\":", "An actual health insurance question pic.twitter.com/04r5f8Gti2", "— Rabih Alameddine (@rabihalameddine) April 26, 2016", "In response, other users said that the question was for quality control and originated with a specific online survey company:", "@rabihalameddine This is from Your-Surveys, search it, they have questions like these all the time.", "— StormzSR (@StormzSR) April 26, 2016", "The survey question appears to have been authentic, and was initially found at a site called Your-Surveys.com. It is probable that initial use of the viral image was satirically attributed to the ACA by critics of the program, but it wasn't long before people (mostly from outside the United States) began to genuinely believe that the question was part of online enrollment for health insurance under the Affordable Care Act.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]