["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A website claiming to be \"exposing one truth at a time\" deceptively says citizens will soon need to be microchipped in order to receive government benefits.", "\"All Citizens Who Want to Receive Gvt Benefits Must Agree to Be Microchipped in the Near Future,\" said a Jan. 12 story on unseen-pedia.com, operating under the banner Anti News Network.", "But Anti News Network’s headline is not supported by its story and we found no indication of this being in the works.", "The U.S. Department of Agriculture oversees the federal Supplemental Nutrition Assistance Program, a program formerly known as food stamps that helps low-income individuals. USDA told PolitiFact it has no plans to require microchipping to receive program benefits.", "Facebook users flagged Anti News Network’s post as being potentially fabricated, as part of the social network’s efforts to combat misinformation.", "Anti News Network’s story includes accurate information about a software and breakroom kiosks company in Wisconsin, Three Square Market, which offered its employees the ability to get a microchip under their skin. By waving their microchipped hand on sensors, employees can get access into the company’s building, sign on to their computers and pay for snacks.", "Anti News Network also includes a legitimate quote from a professor at the University of Wisconsin-Milwaukee, who said the concept of microchips will likely become more common in the future.", "The post also said that \"the idea of using microchips in order to track the financial situations of welfare recipients has already been suggested by one politician in Finland.\" (The Independent reported about that in 2015.)", "But there’s no mention in the story about this being a settled matter of policy across the United States. Instead, the story raises concerns about microchipping and calls on Americans to be vigilant.", "\"But regardless of how good the intentions may be, there are still a lot of questions that must be answered before the people of our country and elsewhere embrace the use of surgically implanted microchips. … If Americans are serious about holding on to our Fourth Amendment right to privacy, then these are questions that we should all demand be answered before more advancements in microchip technology are made,\" the post said.", "It’s not the first time we’ve fact-checked claims about governments microchipping their citizenry. We’ve rated as Pants on Fire another claim giving the false impression that the Australian government is implanting microchips in its citizens.", "Anti News Network published a headline that’s inconsistent with its own story and not supported by facts.", "We rate Anti News Network’s statement Pants on Fire.", "Anti News Network, All Citizens Who Want to Receive Gvt Benefits Must Agree to Be Microchipped in the Near Future, Jan. 12, 2018", "KSTP.com, Wisconsin Company to Implant Microchips in Employees, July 24, 2017, KSTP Year in Review: 2017's Top 5 Most Talked About Stories, Dec. 28, 2017", "CNBC, Why most of Three Square Market's employees jumped at the chance to wear a microchip, Aug. 13, 2017", "Email interview, U.S. Department of Agriculture press office, April 9, 2018", "USA Today, You will get chipped — eventually, Aug. 9, 2017, updated Aug. 10, 2017", "The Independent, Finnish politician advocates implanting benefit claimants with microchips to track them, Aug. 12, 2015", "PunditFact, No, the Australian government is not installing microchips in citizens, July 6, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]