["About this rating", "In early March 2021, readers inquired about a claim involving immigrants who tested positive for COVID-19 in Texas. On March 2, Gov. Greg Abbott blamed the Biden administration for what he called a \"callous act.\" On the same day, the state as a whole recorded 7,822 new COVID-19 cases.", "The Associated Press reported that Abbott was unable to provide evidence that \"illegal immigrants\" were a significant factor in the current spread of the virus. AP published that \"the focus by Abbott and other Republicans on migrant families has drawn criticism about invoking a long history in the U.S. of wrongly suggesting migrants spread diseases.\"", "Abbott's tweet came one day after he announced a mask mandate had been lifted in Texas. He also said that all businesses could fully reopen.", "ABC News Political Director Rick Klein asked White House Press Secretary Jen Psaki about Abbott's tweet. She responded that it was \"not factual\":", "We reached out to Abbott's press office about his tweet, but did not hear back. According to The Texas Tribune, Abbott's claim was in reference to events in the city of Brownsville.", "On March 1 and 2, Telemundo (Spanish) and NBC News (English) published a story about migrants who entered Brownsville, Texas by way of the U.S.-Mexico border. It stated that 108 of the migrants tested positive for COVID-19 after they were released by the U.S. Border Patrol. The \"hundreds\" referred to by Abbott appear to be those 108 immigrants who crossed the border between Jan. 25 and March 1, for an average of about three positive cases of COVID-19 per day.", "According to The New York Times and The COVID Tracking Project, Texas as a whole recorded more than 400,000 new cases in that same time period.", "The Texas Tribune reported on the release process for the migrants, describing them as asylum-seekers with pending cases:", "Migrants released from custody while their asylum cases are pending are given notices to appear for court, a document that, when issued, signals the beginning of removal proceedings for migrants if they cannot convince federal authorities they have the right to stay. The office of Customs and Border Protection in South Texas did not respond to a request for comment seeking more information about the testing process.", "The testing in Brownsville was reportedly administered by the city. NBC reported that 6.3% of the migrants tested were confirmed to have the coronavirus. That rate is smaller than the positivity rate statewide, in which an average of 8.3% of tests came back positive over the past seven days. The 108 tests over the past five weeks is a small share of the more than 3,800 confirmed cases in Cameron County reported by the state since Jan. 25.", "The Telemundo/NBC News article said that the COVID-19 tests on the migrants had been performed at the local bus station:", "The city of Brownsville administers these rapid tests at the bus station, after migrant families are released by the Border Patrol. A spokesperson for Brownsville confirmed that, since they began doing these tests Jan. 25, 108 migrants have tested positive for Covid-19, which is 6.3 percent of those who took the test.", "In response to Noticias Telemundo Investiga, a spokesperson for the city said in an email that Brownsville does not have the authority to retain these migrants who plan to travel to dozens of cities throughout the country. The city assured that municipal workers recommend to those who test positive to keep quarantine as indicated by the Centers for Disease Control and Prevention. The city employees suggest to families they go to nongovernment organizations (NGOs) and nonprofits in the the border area who can take them in and isolate them in order to keep quarantine.", "We reached out to Felipe Romero, the director of communications and marketing with the city of Brownsville. He confirmed to us that 108 migrants did indeed test positive there between Jan. 25 and March 1.", "However, he also provided information that undermined the claim that the migrants were released \"recklessly.\" Those who tested positive were offered resources: A shelter or hotel would be provided if they agreed for the time that they would quarantine; whether or not they accepted that assistance, they were also given instructions to social distance and quarantine away from other individuals. He said local officials followed guidelines set out by the CDC and Texas DSHS (the Texas Department of State Health Services).", "\"The City of Brownsville continues to follow all guidelines provided by the CDC and DSHS for COVID-19,\" Romero said. \"The migrants who test positive at the B-Metro facility are advised of quarantine procedures and are asked to socially distance. There are several NGOs providing resources to a positive case. For example, organizations help with quarantine either in a shelter or at a hotel.\"", "Telemundo acknowledged that some of the 108 asylum-seekers who tested positive were planning to travel to their destinations anyway. While local officials provided guidance and resources to them, they were not detained against their will.", "We contacted the U.S. Department of Homeland Security to ask what happens when a migrant crosses the U.S.-Mexico border in the time of COVID. They told us that U.S. Customs and Border Protection (CBP) personnel \"conduct initial inspections for symptoms or risk factors associated with COVID-19 and consult with onsite medical personnel, the U.S. Centers for Disease Control and Prevention (CDC), or local health systems as appropriate.\"", "Basically, CBP delegates \"appropriate testing, diagnosis, and treatment\" of migrants to local health facilities.", "The statement also noted that these methods are \"consistent with longstanding CBP procedures for preventing the spread of communicable diseases.\"", "U.S. President Joe Biden was sworn in on Jan. 20, 2021. We asked Romero if there were any new guidelines or procedures for infected individuals since Biden's inauguration. \"I can tell you, we have been following CDC and DSHS guidelines since the start of the pandemic last year,\" he said.", "There are a few important dates to note in relation to all of the hubbub. On Oct. 3, 2020, former Vice President Mike Pence and the Trump administration closed the U.S.-Mexico border due to COVID-19. When Trump was still in office, that closure was extended through Feb. 21, 2021. Under Biden, it was extended again through March.", "On Feb. 12, under the Biden administration, the U.S. Dept. of Homeland Security announced \"a process to address individuals in Mexico under its Migrant Protection Protocols (MPP).\" It went into effect on Feb. 19. Previously, on Biden's first full day in office, his administration had announced it would stop new enrollments under the \"Remain in Mexico\" policy. (MPP and \"Remain in Mexico\" referred to the same policy.)", "The Texas Tribune also spoke with Ruben Garcia, the director of the Annunciation House shelter network. Garcia confirmed that MPP arrivals are tested for COVID-19 before entering.", "According to reporting from Telemundo, NBC News, and The Texas Tribune, the 108 migrants who tested positive for COVID-19 in Brownsville were not MPP arrivals. Instead, they had been apprehended by the Border Patrol after crossing over the border. Following protocols that CBP described as \"consistent with longstanding CBP procedures for preventing the spread of communicable diseases,\" the 108 migrants were released. After that, they were tested, purportedly for the first time, by local officials at a bus station in Brownsville. It was there that some of them boarded buses for their final destinations, only after being offered a shelter or hotel and being advised to quarantine and social distance, per CDC and Texas DSHS guidelines.", "A variety of factors were at play. First, there was a flurry of combative and contradictory statements between Biden and Abbott. We were unable to find a source that corroborated Abbott's claim that \"hundreds\" of migrants with COVID-19 were released. Moreover, his characterization of their release from federal custody as \"reckless\" and \"callous\" was entirely subjective, unsupported by evidence of negligence or harm. Also at play were larger immigration policy disagreements and debates over federal vs. local funding of COVID-19 testing for migrants. For these and other reasons, including the lack of clarification from Abbott's office, we have rated this claim as \"Unproven.\"", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "Jordan Liles is a Senior Reporter who has been with Snopes since 2016.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]