["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "California Republican Congressman Doug LaMalfa claimed H.R. 1 “would force states to restore the voting rights of convicted felons—including violent felons convicted of murder or rape.”", "The bill would restore voting rights for people convicted of a crime but only once they’re out of jail or prison.", "The vast majority of states including California already restore voting rights for people convicted of a crime, either automatically upon their release or after a period of time.", "Would the Democratic-led voting rights legislation H.R. 1 allow murderers and rapists to vote?", "That’s the dramatic message Republican California Congressman Doug LaMalfa of Northern California wrote in a recent email to a constituent.", "The constituent asked PolitiFact to fact-check the congressman’s claims.", "The U.S. House of Representatives passed the sweeping legislation on a party-line vote Wednesday, but the bill faces an uphill battle in the evenly divided Senate, where it will require 60 votes to pass. It includes provisions to require states to enact automatic and same-day voter registration and make it easier to obtain a mail ballot. It also has provisions to increase transparency in campaign financing.", "Republican lawmakers oppose the bill and have stepped up attacks against it in recent days in interviews and on social media as it moved closer to a vote.", "Last month, PolitiFact fact-checked several misleading claims about H.R. 1, including statements similar to LaMalfa’s.", "The congressman was one of seven California GOP House members who voted to object to certifying last November’s electoral votes from Arizona and Pennsylvania. Supporters of former President Donald Trump alleged election fraud and irregularities in the two swing states, despite a lack of evidence and legal challenges that went nowhere.", "Here’s the specific statement from LaMalfa on H.R. 1 that caught our attention:", "\"H.R. 1 would also mandate significant changes in election processes that would overrule election practices that have been tailored to thousands of localities across the country. For example, it would force states to restore the voting rights of convicted felons—including violent felons convicted of murder or rape.\"", "We focused on that last part for this fact check.", "Our Research", "Language in H.R. 1 doesn’t expressly mention murderers or rapists. But LaMalfa’s statement is at least partially correct as the bill states that citizens convicted of a crime shall still be allowed to vote \"unless such individual is serving a felony sentence in a correctional institution or facility at the time of the election.\"", "The congressman omitted that last part about needing to be out of prison.", "His statement also ignores the fact that many states already restore voting rights to people convicted of felonies at the end of their sentence.", "In 18 states including California, felons lose their voting rights only while incarcerated and receive automatic restoration upon release, according to the National Conference of State Legislatures. In 19 more, felons lose their voting rights while incarcerated but regain them after completing parole or probation. In Maine and Vermont, people who are incarcerated never lose the right to vote.", "A spokesperson for LaMalfa did not respond to requests for comment.", "We asked voting rights experts to assess the congressman’s claim.", "\"I think it’s accurate, but also incomplete and out of context,\" said Justin Levitt, a professor at Loyola Law School in Los Angeles, where he teaches constitutional law with a focus on election administration.", "Myrna Pérez is director of voting rights and elections at the nonpartisan Brennan Center for Justice, which supports H.R. 1.", "Pérez called LaMalfa’s claim \"misleading,\" given that many states already allow convicted felons to vote after their sentence.", "\"The criminal justice system has decided that these people are safe enough to be living and working among us,\" Perez said, adding that people convicted of crimes are expected to work, pay their bills and take care of their children upon release. \"Why is not one of the expectations voting and contributing to your society?\"", "Our Ruling", "California Republican Congressman Doug LaMalfa claimed H.R. 1 \"would force states to restore the voting rights of convicted felons—including violent felons convicted of murder or rape.\"", "His statement is partly correct but omits some significant points.", "The proposed legislation would restore voting rights for all people convicted of a crime but only once they’ve completed their sentence and been released from incarceration.", "LaMalfa also ignores the fact that the vast majority of states including California already restore voting rights for people convicted of a crime, either automatically upon their release or after a period of time.", "Given these key omissions, we rated LaMalfa’s claim Half True.", "HALF TRUE – The statement is partially accurate but leaves out important details or takes things out of context.", "Rep. Doug LaMalfa, email to constituent, March 2, 2021", "H.R.1 - For the People Act of 2021, text of the bill, accessed March 2021", "Justin Levitt, professor at Loyola Law School in Los Angeles, email exchange March 3, 2021", "Myrna Pérez, director of voting rights and elections, Brennan Center for Justice, phone interview March 2, 2021.", "National Conference of State Legislatures, Felon Voting Rights, accessed March 2021.", "PolitiFact, Fact-checking misleading attacks on HR 1, Democrats’ voting rights bill, Feb. 3, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]