["About this rating", "In October 2020, The Beaverton published an article positing that the Proud Boys, whose members have openly advocated violence and white supremacy, changed their group name to the \"Leather Men\" after Twitter users flooded the hashtag \"#ProudBoys\" with images celebrating proud, gay couples.", "As Gay Twitter reclaims #ProudBoys hashtag, Proud Boys change name to “Leather Men”", "OTTAWA – In response to a demonstration by gay twitter users to reclaim the #ProudBoys hashtag, hate group the Proud Boys have distanced themselves from the LGBTQA+ community by renaming their group the “Leather Men”.", "In response to President Trump’s seeming-endorsement of the Proud Boys, a group classified by the FBI as “an extremist group with ties to white nationalism”, Gay Twitter took action. The hashtag #ProudBoys was flooded with images of gay male service members, as well as other same sex couples, prompting the actual Proud Boys to change their name.", "This item was not a factual recounting of real-life events. The article originated with a website that describes its output as being humorous or satirical in nature, as follows:", "\"The Beaverton is a news satire and parody publication. All articles contained within this website and on its social media accounts, however similar to real events, are fictitious. When public figures or actual businesses are mentioned by name, the corresponding story details are invented. In all other cases, any resemblance to actual persons, businesses or events is entirely coincidental.\"", "Proud Boys, described as a hate group by the Southern Poverty Law Center, received national attention after a controversial moment during the first 2020 U.S. presidential debate, when President Donald Trump did not condemn white supremacist and militia groups when asked if he would.", "For background, here is why we sometimes write about satire/humor.", "Macintrye, Ian.   \"As Gay Twitter Reclaims #ProudBoys Hashtag, Proud Boys Change Name to 'Leather Men.'\"\r\n    The Beaverton.   5 October 2020.", "Lee, Jessica.   \"Who Are the Proud Boys Trump Told To ‘Stand Back and Stand By’?\"\r\n    Snopes.   7 October 2020.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]