["The 11-minute video was shared here on Facebook on January 29, 2020. It has been viewed more than 1.2 million times.", "Below is a screenshot of the misleading Facebook post:", "The man seen in the clip can be heard speaking Tagalog. From the one-minute five-second mark, he can be heard saying: “The coronavirus does not have an antibiotic yet. Even if I’m not a scientist, I have a right to do research. I have a right to contribute what I know. And I found out that the coronavirus is from the skin and crawls to the eyes, infecting humans who quickly die.”", "“Makabuhay is the number one antibiotic. Very great antibiotic. It is bitter but not poisonous. It’s more effective if its sap is dropped directly on both eyes.”", "At the four-minute 28-second mark, he says: “If there are diseases in the throat, there are microbes, viruses in the throat, the makabuhay can kill these if it is dropped on the eyes.”", "Makabuhay is the local name of tinospora crispa, a popular medicinal plant in Southeast Asia, sometimes used to treat a variety of health conditions, according to this medical journal.", "The misleading video’s Tagalog-language caption translates to English as: \"I WENT TO THIS FOREST ON PURPOSE BECAUSE OF CORONAVIRUS. It passes through the Eyes and this cure IS ALSO DROPPED ON THE EYES. Find out why\".", "The novel coronavirus epidemic, now declared a global health emergency by the World health Organization (WHO), first emerged in the Chinese city of Wuhan in December 2019. At least 490 people have died and some 24,000 have been infected in China since the outbreak, according to this AFP report dated February 5, 2020.", "The virus has spread to at least 20 other countries, including the Philippines, which reported the first death from the virus outside China.", "The same video was also shared here and here on Facebook, here on YouTube, and here on Twitter, alongside a similar claim.", "The claim is misleading; Philippine health experts told AFP there is no evidence the sap of tinospora crispa is effective in treating or preventing novel coronavirus infections.", "Dr. Ferdinand De Guzman, a spokesperson for Philippines’ San Lazaro Hospital, a national center for infectious diseases, told AFP on February 4, 2020 that online claims about using the sap of tinospora crispa to treat novel coronavirus were inaccurate.", "He said: “The novel coronavirus is a virus so an antibiotic would have no effect.”", "Dr. Jaime Purificacion from the University of the Philippines’ Institute of Herbal Medicine told AFP by phone on February 3, 2020 there was no scientific basis in claims that tinospora crispa was effective in treating novel coronavirus.", "“Our indication for [medical benefits of] makabuhay is [only] for scabies,” he said.", "He also strongly advised the public against putting plant sap in the eyes.", "“The eyes are a sensitive organ of the body. It’s dangerous because there are no safety studies,” he added.", "This WHO information sheet also says antibiotics are ineffective in treating the new coronavirus strain.", "It states: \"No, antibiotics do not work against viruses, only bacteria. The new coronavirus (2019-nCoV) is a virus and, therefore, antibiotics should not be used as a means of prevention or treatment.\"", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]