["News outlets in Philadelphia have recently reported some looting in the wake of the death of Walter Wallace Jr., a Black man killed by police on Oct. 26.", "On social media, a new claim about Democratic vice presidential nominee Kamala Harris has also emerged.", "\"HARRIS says Looters are just feeding their hungry kids? ..I didn’t know they could eat shoes and TV’s??\" a Facebook post says.", "It was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Harris and her running mate, Democratic presidential nominee Joe Biden, put out a joint statement on Oct. 27 in response to the shooting. They said that their hearts are broken for Wallace’s family \"and for all those suffering the emotional weight of learning about another Black life in America lost.\"", "However, they wrote, \"no amount of anger at the very real injustices in our society excuses violence. Attacking police officers and vandalizing small businesses, which are already struggling during a pandemic, does not bend the moral arc of the universe closer to justice. It hurts our fellow citizens. Looting is not a protest, it is a crime. It draws attention away from the real tragedy of a life cut short.\"", "This isn’t the first time that Harris has condemned looting.", "In August, she addressed protests over the shooting of Jacob Blake in Kenosha.", "\"We must always defend peaceful protest and peaceful protesters,\" she said. \"We should not confuse them with those looting and committing acts of violence.\"", "Back then, a claim spread that Harris wants riots to continue even after the election. We rated that False.", "This Facebook post gets the same rating — False.", "This fact check is available at IFCN’s 2020 US Elections #Chatbot on WhatsApp. Click here, for more.", "Facebook post, Oct. 28, 2020", "The Philadelphia Inquirer, Ahead of National Guard arrival in Philly, tensions flared for a second night after police killed Walter Wallace Jr., Oct. 28, 2020", "CBS Philly, Joe Biden, Kamala Harris react to fatal police shooting of Walter Wallace Jr., condemn looting in Philadelphia, Oct. 27, 2020", "Business Insider, Kamala Harris came out in defense of peaceful protesters in Kenosha, condemning looting and violence in ‘prebuttal’ to Trump’s RNC speech, Aug. 27, 2020", "PolitiFact, No, Kamala Harris didn’t say she wants riots to continue, Sept. 4, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]