["About this rating", "On Dec. 16, 2019, the night before the U.S. House of Representatives was scheduled to vote on two articles of impeachment against U.S. President Donald Trump, people gathered around the United States to hold impeachment rallies:", "Hours before the House votes on whether to impeach President Donald Trump, hundreds of demonstrators gathered in Times Square Tuesday night chanting \"Tell me who's above the law? Nobody is above the law!\"", "They weren't alone. Rallies sprang up from Oregon to Florida on the eve of the vote on two articles of impeachment against Trump, charging him with abuse of power and obstruction of Congress. Democrats say Trump pressured Ukraine to investigate his political rivals in exchange for security aid and that he obstructed a congressional investigation by refusing to allow key officials to testify.", "Trump has asserted that Democrats' attempt to impeach him is part of a larger effort to avenge the results of the 2016 election.", "As photographs of these crowds started to circulate on social media, some people started to share a picture that supposedly showed an impeachment rally held in Toronto, Canada:", "This is a genuine photograph of a large crowd gathered in Toronto, but it has nothing to do with the impeachment of Trump.", "The picture comes from a video taken on June 17, 2019, by 680 News reporter Momin Qureshi, and shows thousands of people at a parade in honor of the recent NBA champions, the Toronto Raptors:", "That said, a rally in support of the impeachment of Trump was indeed held in Toronto, Canada, but it was nowhere near as large as the crowd pictured above. The group Democrats Abroad held a small protest in the Canadian city to call for the president's impeachment:", "Rush, Curtis.   \"Toronto Raptors Draw Massive Crowds to Victory Parade and Rally.\"     Forbes.   17 June 2019.", "Holcombe, Madeline.   \"Pro-Impeachment Protests Span the Country Ahead of Historic Vote.\"\r\n    CNN.   18 December 2019.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]