["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "While munching on a raw carrot stick last month, we noticed a quote in a Providence Journal story from Rhode Island Governor Lincoln Chafee regarding the importance of farming in Rhode Island.", "\"Fifteen years ago, you wouldn’t have thought that farming would be an important part of the Rhode Island economy, but it’s one of the fastest growing areas of our economy,\" Chafee said. \"Restaurants are looking for fresh food, and so times change and we have to adapt to that.\"", "We know the so-called \"farm to table\" movement -- the use of locally sourced foodstuffs -- has taken root here. But in our travels around the state, we still don’t see many farms. Is farming really growing as quickly as Chafee said?", "It seemed that it would be simple to find out. But a search for information took us on a frustrating odyssey through five state agencies and offices and two federal departments.", "We began with an e-mail to Christine Hunsinger, Chafee’s communications director, asking for  the governor’s backup. She cited U.S. Department of Agriculture data from 2007 -- the latest available -- that shows the number of farms in Rhode Island had increased from 858 to 1,219 between 2002 and 2007, a 42 percent increase. A farm is defined as \"any place from which $1,000 or more of agricultural products were produced and sold\" in a year.", "Impressive, yes. But just because the number of farms increased by that rate, it doesn’t mean that the overall economic impact of farming increased at the same rate. The report doesn’t say whether the new farms were substantial or only large gardens. And there are no comparisons with other sectors of the economy.", "We called the Rhode Island Economic Development Corporation, but a spokesman said the corporation had no statistics regarding the economic profile of farming.", "We also contacted the Division of Agriculture of the state Department of Environmental Management, where division chief Kenneth Ayars directed us to \"The Economic Impact Study of Plant-Based Industries and Agriculture in Rhode Island.\"", "University of Rhode Island researchers estimated in the study that agriculture, which they defined to include plant crops and animal production as well as nurseries, greenhouses, floriculture and sod production, generated $170.6 million in gross sales in 2012.", "The study was motivated, in part, by critics’ contention that federal government statistics understate Rhode Island farming. But it was only a snapshot and didn’t tell whether agriculture is growing, shrinking or static.", "In a second e-mail, Hunsinger referred us to the U.S. Census for the same period as the USDA data, 2002-2007. Unlike the USDA, the Census compared farming to 18 other business sectors in Rhode Island as defined by the North American Industry Classification System. That is a standard used by federal statistical agencies to analyze the economy.", "The 42 percent increase in the number of farms did, indeed, place farming in the upper ranks of our economy -- if all you are counting are places that call themselves farms. During the period in question, only one sector, management businesses, grew its numbers by a larger percentage, from 120 to 175, or 45.8 percent, according to the U.S. Census.", "The worst was manufacturing, where the number of businesses shrank from 2,131 to 1,825, or minus 14.4 percent.", "Ultimately, we found the most timely data from the U.S. Bureau of Economic Analysis, which tracks the nation’s economic output with the famous measure called the Gross Domestic Product, and also reports on each of the Gross State Products.", "According to its report, \"Regional Data; Real GDP by state,\" during the most recent five-year period available, from 2007 through 2011, Rhode Island’s gross product from crop and animal production fell from $27 million to $17 million, adjusted for inflation, or by 37 percent. The gross product is the total value of goods and services produced annually.", "If you define the industry more broadly, under the federal classification system, as \"agriculture, forestry, fishing and hunting,\" the picture is still negative. It contracted during the period, from $74 million to $67 million.", "This was a time of economic stagnation in Rhode Island. And by this measure, contrary to Chafee’s impression, farming was withering, not growing.", "In fact, if you accept the federal figures, it was next to last among the 19 Rhode Island business sectors identified under the federal classification system. Only mining, which plummeted 52.9 percent, was worse.", "The leading sector was Information, including data processing and telecommunications, with 34.9 percent growth.", "Our ruling", "Governor Lincoln Chafee said that farming  is \"one of the fastest growing areas\" of the Rhode Island economy.", "Six-year-old figures cited by Chafee’s spokeswoman did show an increase in the number of farms in Rhode Island. But fresher and more relevant figures on Rhode Island from the federal Bureau of Economic Analysis showed that the economic value of farming has actually fallen in recent years.", "The judges rule Chafee’s statement Mostly False.", "The Providence Journal, \"Chafee says he’s ready to ‘drive’ EDC,\" June 5, 2013", "U.S. Department of Agriculture,  \"Historical Highlights: 2007 and Earlier Census Years,\"  accessed June 14, 2013 and July 10, 2013", "U.S. Census Bureau, \"All sectors: Core Business Statistics Series: Comparative Statistics for the United States and the States: 2002-2007,\" accessed July 10-11, 2013", "U.S. Bureau of Economic Analysis, \"Regional Data; Real GDP by state,\" 2007-2011, accessed July 9-11, 2013", "Interview, Thomas Dail, spokesman, Bureau of Economic Analysis, U.S. Department of Commerce, July 9-10, 2013", "Interview, Jeannine Aversa, spokeswoman, Bureau of Economic Analysis, U.S. Department of Commerce, July 11, 2013", "Interview, Kenneth Ayars, chief of the Division of Agriculture, R.I. Department of Environmental Management, July 9, 2013", "Interview and e-mails, Christina Hunsinger, spokeswoman, governor’s office, June 13-July 11, 2013", "Interview and e-mails, Thomas W. Sproul, University of Rhode Island assistant professor, Department of Environmental and Natural Resource Economics, July 9-10, 2013", "\"The Economic Impact Study of Plant-Based Industries and Agriculture in Rhode Island,\" study published 2013 by Thomas W. Sproul and Brandon Elsner, accessed July 9-July 10, 2013.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]