["In 2016, pop singer Miley Cyrus really did threaten to leave the United States if Donald Trump was elected president. New rumors have circulated on the Internet that Cyrus is now revisiting that promise and that Trump fans are ruining her career.", "\"Singer Miley Cyrus: ‘Trump fans are destroying my career, I can’t stand them and I decided to move to…’\" read the headline on Daily Washington Report, a blog providing no information about the nature of its content.", "The story was flagged by Facebook users as being potentially fabricated, as part of the social media’s efforts to combat online hoaxes.", "The story cites real quotes by Cyrus from an interview she gave to Billboard magazine in 2017 where she openly spoke about becoming more political following the 2016 election. But the story then makes up new information regarding comments about Trump supporters.", "In the article, Cyrus claims to be dissatisfied with her career and blames Trump supporters for her not being a top-selling artist anymore. We found no evidence that Cyrus ever made those comments.", "Cyrus is also falsely quoted as saying that she believes the amount of hate she has received has to do with Trump supporters and that she will leave the United States if it continues. When searching for the quotes attributed to Cyrus, we found no results of the statements. Celebrity news fact-checking site Gossip Cop  also confirmed that Cyrus never accused Trump supporters of hurting her album sales.", "We did find an actual recent interview with Wonderland Magazine where Cyrus was featured on the cover. In that interview, she talked about expanding her career to work on different project, and being in a good place in her life right now.", "Cyrus’s latest album, Younger Now, released in September 2017, hit a peak of No. 3 on the Billboard charts.", "Even though last year Cyrus threatened to leave the United States if Trump was elected president, she recently backtracked, calling it \"ignorant\" to leave the country because of the president.", "Our ruling", "A fake news story said that Miley Cyrus is blaming Trump supporters for her discontentment with her career and that she is planning to leave the United States. Cyrus has recently expressed satisfaction of her career and life, and she specifically reversed her prior feelings on leaving the country.", "We rate this claim False.", "Rolling Stone, Miley Cyrus: 'Donald Trump Is a F--king Nightmare', March 2, 2016", "Daily Washington Report, Singer Miley Cyrus: ‘Trump fans are destroying my career, I can’t stand them and I decided to move to…’, March 8, 2018", "Billboard Magazine, Miley Cyrus breaks silence on rootsy new music, fiance Liam Hemsworth and America: ‘Unity is what we need’, May 3, 2017", "Wonderland Magazine, Iconique! It’s Miley!, Spring 2018 cover", "ET Online, Miley Cyrus reveals how her infamous VMA performance changed her life forever, March 1, 2018", "Billboard, music charts", "Gossip Cop, Miley Cyrus did not say Donald Trump supporters ‘are hurting my career’ despite report, Nov. 28, 2017", "Hollywood Reporter, 20 stars who pledged to flee the country if Trump was elected: where are they now?, November 10, 2016", "The Hill, Miley Cyrus mocks previous pledge to leave US if Trump won: ‘That’s dumb’, September 29, 2017", "NME, Miley Cyrus on why she didn’t leave America after Donald Trump became president, September 29, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]