["About this rating", "In mid-2017, an article published on the web site Women's News (WNews.world) gained notoriety among social media users, thanks to its outlandish claim that an Indonesian woman deceased for three years not only returned to life and walked among the living, but was actually photographed doing so:", "The text of the article makes reference to a \"special rite\" used by the locals to bring the corpse back to life:", "In Indonesia, in the town of Toraja, a woman leaves her grave after being dead for 3 years.", "Fortunately, this event was caught on camera and it’s the evidence of how this woman was resurrected after that much time.", "There is no doubt that this is a frightening and surprising fact.", "They say that in order to bring her back to life, a special rite is performed in the place of the woman’s tomb.", "The premise struck us as both preposterous and familiar, so we dug deeper and found many other versions, including one that was posted to the snopes.com message board in September 2010:", "We found an even older version posted on an Indonesian blog in November 2009. It included the writer's personal reminiscences around witnessing a \"walking corpse\" in his or her youth (although the narrative suffers a bit due to machine translation):", "The story of a dead corpse has been around since time immemorial. Hundreds of years ago it was said that there was a civil war in Tana Toraja namely the Toraja West fought against the East Toraja people. In the battle the West Toraja was defeated because most of them were killed, but at the time of going home their entire corpse of the Toraja West was walking, while the East Toraja people though only a few were killed but they took the corpses of their dead brother, Then the war is considered a series. On the next offspring the Toraja people often bury their corpses by way of the corpse walking alone to the grave.", "The phenomenon of \"Walking bodies\" that I myself have witnessed directly. The incident occurred around the year 1992 (I'm new grade 3 elementary). At that time in my village there was a man named Pongbarrak whose mother died. Such as Toraja custom the corpse is not directly buried but still has to go through a customary procession of burial (signs solo '). At that time after bathing the dead body of the mother is placed in bed in a special room before it is inserted into the coffin. On the third night the whole family gathered to talk about how the funeral procession would take place. At that time I sat on the porch of the house understand the children so like to pace. But after the meeting is over (around 10 pm), suddenly there is a noise in the house where some mothers shout. Out of curiosity I tried to look into the house and the dead man was walking out of the room, just cash me and my friends screamed hysterically and ran down the stairs. I ran and got my dad hysterically scared. After that I was taken home by father and I do not know what happened next.", "Common to every variant we've encountered are references to the Tana Toraja region of South Sulawesi, an island in Indonesia. (If you've ever tasted any of the earthy, subtly spicy coffees imported from Sulawesi, odds are the beans were grown and hand-harvested in Tana Toraja.) Nor is it a coincidence that virtually every travel guide offering information about the remote location spotlights certain \"peculiar,\" \"complex,\" and purportedly \"gruesome\" funerary practices found there (practices that are indeed so unusual and elaborate that entire books have been written about them and tourists flock to record them on their mobile devices). The more we learned about these traditions, the more we became convinced they were the inspiration for tales about Indonesia's so-called \"walking dead.\"", "It's unclear precisely how long the Toraja people, who descended from Austronesian speakers living in central Sulawesi well before Europeans arrived in the 1500s, have inhabited the island. During the 1700s, the Toraja population was driven into the southern mountains (where the majority of them are still concentrated) by another ethnic subgroup, the Buginese. Although most Toraja now identify as Christian or Muslim, many still honor beliefs and customs handed down from their ancestors — beliefs and customs in which death takes center stage.", "Anthropologist Kelli Swazey described the Torajans' intimate, intricate relationship with the dead in a 2013 TED Talk entitled \"Life that Doesn't End with Death\":", "In Tana Toraja, the most important social moments in people's lives, the focal points of social and cultural interaction are not weddings or births or even family dinners, but funerals. So these funerals are characterized by elaborate rituals that tie people in a system of reciprocal debt based on the amount of animals — pigs, chickens and, most importantly, water buffalo -- that are sacrificed and distributed in the name of the deceased. So this cultural complex surrounding death, the ritual enactment of the end of life, has made death the most visible and remarkable aspect of Toraja's landscape. Lasting anywhere from a few days to a few weeks, funeral ceremonies are a raucous affair, where commemorating someone who's died is not so much a private sadness but more of a publicly shared transition. And it's a transition that's just as much about the identity of the living as it is about remembrance of the dead.", "In Toraja society, Swazey explains, death is seen as a process -- and a lengthy process, at that -- rather than as a singular event:", "So where we see an unquestionable reality, death as an irrefutable biological condition, Torajans see the expired corporeal form as part of a larger social genesis. So again, the physical cessation of life is not the same as death. In fact, a member of society is only truly dead when the extended family can agree upon and marshal the resources necessary to hold a funeral ceremony that is considered appropriate in terms of resources for the status of the deceased. And this ceremony has to take place in front of the eyes of the whole community with everyone's participation....", "Until the funeral ceremony, which can be held years after a person's physical death, the deceased is referred to as \"to makala,\" a sick person, or \"to mama,\" a person who is asleep, and they continue to be a member of the household. They are symbolically fed and cared for, and the family at this time will begin a number of ritual injunctions, which communicates to the wider community around them that one of their members is undergoing the transition from this life into the afterlife known as Puya.", "So I know what some of you must be thinking right now. Is she really saying that these people live with the bodies of their dead relatives? And that's exactly what I'm saying.", "A National Geographic video shot in 2016 provides brief glimpses into Tana Toraja death and burial rites (warning: includes graphic scenes of animal sacrifice):", "Of particular interest with regard to the \"walking dead\" tales we're investigating is the ma'nene ceremony, in which the mummified corpses of dead family members are exhumed, washed, reclothed, and walked through the center of town, examples can be seen both in the latter half of the National Geographic video above and this tourist video uploaded to YouTube in 2016:", "Bringing our investigation full circle, Loyola University anthropology professor Kathleen Adams, who spent two years in Tana Toraja observing the lives and culture of its people, confirmed in an interview with Loyola Magazine that the \"walking dead\" stories represent a corrupted version of the truth:", "“What started happening, as best as I can piece together, was migrants who had moved to Jakarta and other parts of Indonesia, who were often second-generation migrants, were coming back,” Adams says. “The city folk would want a picture next to their deceased relatives, and the images started circulating on Facebook. Toraja became suddenly internationally associated with this idea of the ‘walking dead’ and zombies.”", "That's not to say that concept is entirely foreign to the culture. \"Torajans also tell stories about corpses that walk on their own to their final resting place,\" Kelli Swazey told us via e-mail:", "Many Torajans relate that in the past, powerful ritual practitioners could make a corpse walk on its own. This practice is not done anymore, according to many Torajans, because it is a kind of magic that is not appropriate for modern Christians, and the majority of Torajans identify as Protestant Christians today. In addition, there are many stories of other kinds of revenants that the living encounter in Indonesia, so the circulation of these kinds of stories is quite common in the Indonesian media.", "So, folklore and media sensationalism notwithstanding, do the deceased really rise from their graves and walk in Tana Toraja, Sulawesi? Yes, but no — not literally. They do so only with the help of surviving family members, who continue to demonstrate their love and devotion long after the physical bodies of their loved ones have gone quiet.", "The photograph does not show an actual zombie.", "Bennett, Amanda.   \"When Death Doesn't Mean Goodbye.\"\r\n    National Geographic,   March 2016.", "Gaynor, Anna.   \"One Culture's Unique Rituals for the Dead Have a Lot to Teach Us About Life.\"\r\n    Loyola Magazine.   Accessed 12 July 2017.", "Kugel, Seth.   \"In Indonesia, A Region Where Death Is a Lure.\"\r\n    The New York Times.   30 July 2015.", "Swazey, Kelli.   \"Life that Doesn't End with Death.\"\r\n    TED Talks.   April 2013.", "Tomkiw, Lydia.   \"Funeral Tourism in Sulawesi: Is It Ethical?\"\r\n    CNN.   27 March 2013.", "WB, Stephen.   \"Walking Dead Version Toraja.\"\r\n    Mamasa Online.   10 November 2009.", "Encyclopaedia Britannica.   \"Toraja.\"\r\n    Accessed 12 July 2017.", "Lonely Planet.   \"Introducing Tana Toraja.\"\r\n    Accessed 12 July 2017.", "Women's News.   \"Woman Comes Out from Her Grave and Walks After 3 Years of Being Dead.\"\r\n    Accessed 12 July 2017.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]