["Photos have been circulating on social media in Kenya with the claim that the images show security officers stationed at the Lee Funeral Home in Nairobi on March 19, 2021. Some speculated that the heightened security indicated that a prominent official in Kenya had died. This is false; these photos were taken in February 2020 following the death of former Kenyan president, Daniel Moi. His body was taken to the Lee Funeral Home.", "“BREAKING NEWS: Military Takes Over Lee Funeral Home Ahead Of This Official Declaration”, reads the caption of a Facebook post that has been shared over 70 times. The post links to an article with the headline, “Speculation As Military Police Take Over Lee Funeral Home, Former President Feared Dead”.", "A similar version of the same claim was also shared here. Both posts allege that the photos show military personnel at the Lee Funeral Home on March 19, 2021.", "Lee Funeral Home is a high-end morgue in Kenya that offers funeral arrangements for many prominent people.", "However, these photos are more than a year old. A keyword search on Google led to a Facebook post from TUKO, a Kenyan online media outlet, from February 3, 2020, the day that the former Kenya president Daniel Moi died. The photo is credited to Kevin Philips of TUKO.", "The second photo circulating with the false Facebook posts was also taken the same day at the funeral home when former president Moi died. The picture is credited to Bebeto Ogola of TUKO.", "Although the false posts do not name anyone specifically, a tweet by the son of former president Mwai Kibaki, suggests that the rumours were directed at his father, who was president of Kenya after Moi.", "On March 19, 2021, Jimmy Kibaki tweeted: “My Father is Safe and healthy. Ignore the rumors about Lee Funeral Home (sic)”. Furthermore, the Kenyan government made no official announcements on March 19, 2021 about the recent deaths of any former politicians.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]