["About this rating", "In early January 2021, Snopes readers asked about social media posts falsely claiming that U.S. President Donald Trump had a stolen laptop belonging to U.S. House Speaker Nancy Pelosi, and that he was at the Cheyenne Mountain military base in Colorado Springs, Colorado, viewing \"evidence\" on the laptop.", "Although the claim spread on various platforms, it appears to have originated on Parler, the site favored by far-right extremists, until Amazon pulled Parler's web hosting on Jan. 11, 2021, due to violent threats posted on it:", "If the text in the above meme is difficult to read, it states, in sum, that because of \"evidence\" on Pelosi's laptop viewed by Trump, Pelosi had headed to the \"border\" (unclear which one) but was stopped just before midnight, and was being held at an undisclosed location \"pending tribunals and trials.\" Because Parler is down, we don't know the exact date of the above post, but we know that it was posted shortly after the Jan. 6, 2021, pro-Trump Capitol riot, during which a laptop really was stolen from Pelosi's office.", "It also states that Trump's conspiracy theory-minded lawyers Sidney Powell and Lin Wood were in front of a military judge and securing 195,000 sealed indictments that would lead to mass arrests. It goes on to warn readers that they should stock up on supplies to \"hunker down\" for 10 to 12 days while Trump installs a new government.", "The Parler post above appears to have been written by Ron Watkins, the administrator of the message board that hosts Q, the fictional prophetic figure in the Qanon conspiracy theory. The story spread on various other social platforms. But, it's not true.", "We'll first debunk the laptop conspiracy theory. Then the claim about Powell, Wood, and indictments.", "One of the most widely seen images from the Jan. 6, 2021, Capitol riot shows a rioter sitting in Pelosi's office with his feet up on her desk in a violent day that left five people dead. Congress was meeting that day to certify Electoral College votes for President-Elect Joe Biden.", "Contrary to the idea that the stolen laptop was full of incriminating evidence, Pelosi's Deputy Chief of Staff Drew Hammill tweeted that it was \"only used for presentations.\" And Pelosi had never headed to a border, only to be detained at an undisclosed location. She was instead at the Capitol and in the House Chamber the night of Jan. 6 to finish certifying Electoral College votes. On Jan. 13, 2021, she was again in the chamber, where she voted to impeach Trump for the second time for inciting an insurrection.", "Per Trump's public schedule, he hasn't left Washington, D.C., since the Capitol riot, save for one trip to Alamo, Texas, on Jan. 12 to visit the U.S.-Mexico border wall. There is no indication he visited the military base at Cheyenne Mountain.", "There's also no evidence for the fabulist claim that discredited attorneys Powell and Wood, who had aggressively pursued failed court cases seeking to overturn the 2020 presidential election on behalf of Trump and made numerous outlandish statements in the process, had secured any indictments from any judge, let alone 195,000. We note that the weekend since the riot took place came and went, with no mass arrests of Trump's political opponents. Law enforcement, however, has commenced a nationwide manhunt for rioters who committed crimes during the Capitol riot.", "Trump and his supporters for months have been aggressively promoting a disinformation campaign alleging the November 2020 election was beset by a massive scale voter-fraud conspiracy. These claims culminated with speeches by Trump and others given in D.C. at a rally that incited supporters to march to the Capitol in an event that ended with mass violence.", "Trump's own administration countered the election-fraud claim, observing that the election was \"the most secure in American history.\" Trump's political rival President-elect Joe Biden won the election and will be inaugurated on Jan. 20, 2021.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]