["About this rating", "In May 2020, a video (below) supposedly showing Microsoft Co-founder Bill Gates briefing the CIA about a mind-altering vaccine was circulated on social media.", "But the presenter in this footage is not Gates. Furthermore, this is not a genuine presentation to the CIA in 2005. This is a hoax video that was likely created for an uncompleted film project from director Ryan Harper called \"FunVax.\"", "This video has been circulating since 2011 under the assumption that it showed an authentic CIA briefing. Since then, a number of outlets examined and debunked this claim. Metabunk, for instance, noted that the brain scans displayed around the 45-second mark of the video are presented as if they show a \"religious brain\" and a \"non-religious brain\" from \"two different individuals.\" These scans, however, were actually taken from a 2010 study about a 43-year-old woman with a history of methamphetamine abuse. The filmmaker simply took the original scan, added some red and yellow coloring, and then claimed it showed the brain scan of a religious person.", "Here's the doctored brain scan as shown in the video (left), and the original scan taken from the 2010 study in the medical journal Neurology (right):", "We also examined this footage in 2015 and discovered the following: that this video did not \"leak\" from the Pentagon but rather started spreading to promote the film project, and that the general \"God gene\" theory was unproven. You can read our original report here.", "How do we know the person in the video isn't Gates?", "As stated earlier, the person in the video is not Gates. Here is how we know that: Gates' name wasn't attached to this video until 2020, when the Microsoft co-founder ended up at the center of several conspiracy theories related to vaccines and the COVID-19 coronavirus pandemic. Gates' name is not mentioned in the video, on this alleged documentary's failed Kickstarter page, or in any of the social media posts we encountered about this video prior to 2020.", "A higher quality version of this film (which can be viewed here) makes it a bit more obvious that the person presenting in this video does not resemble Gates. A spokesperson for the Bill & Melinda Gates Foundation also told Reuters recently that Gates was not featured in this video.", "You can read Snopes' original report on this video here.", "Reuters.   \"False claim: Video shows Bill Gates Presenting Vaccine for Religious Fundamentalists to Pentagon.\"\r\n    13 May 2020.", "West, Mick.   \"Debunked: FunVax, Pentagon Briefing on Removing the God Gene [Hoax].\"\r\n    MetaBunk.   1 December 2011.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]