["About this rating", "A popular bit of “too crazy to be a coincidence” trivia suggests that the location of the Great Pyramid of Giza is in some way cosmically aligned with the universe (or, perhaps, that the Egyptians themselves aligned their pyramids with the universe) because its latitude in decimal degrees is 29.9792458 N and the speed of light in a vacuum as expressed in the contemporary metric system is 299,792,458 meters per second:", "It is true that the latitude 29.9792458 N intersects the Great Pyramid of Giza (at the selected longitude of around 31.134667 E). However:", "1) If a point of latitude's merely crossing a structure at any point is the bar to meet for revealing a hidden meaning to its location, then the latitudes between 29.980150 and 29.978150 (all of which intersect the same pyramid) also fit the bill, leaving a coincidence-monger roughly 2,000 numerical latitude formulations to choose from with respect to the Great Pyramid of Giza.", "2) If the apex of the pyramid were meant to represent an homage to the fundamental laws of the universe, the correct latitude would actually be closer to 29.9791750 N, which would bear less resemblance to the speed of light in a vacuum expressed in meters per second.", "3) Although the Great Pyramid of Giza was constructed around 2550 BC, the notion that light \"traveled\" at all (though discussed theoretically in ancient Greek times and by early Arab scholars) was not firmly established until the first estimate of the speed of light was made in 1676.", "4) The unit of measurement on which the speed of light is based in this meme -- meters -- was not defined until 1771, making it a highly anachronistic one for the ancient Egyptians to have been referencing.", "5) Egyptians of that time would have been more likely to express such a theoretical concept as the speed of light in “cubits” per second. Using 0.525 m as the estimated length of one ancient Egyptian cubit puts the speed of light at 571,033,253 cubits per second. Converting this number into latitude expressed in decimal degrees via the same approach would require the pyramid to be somewhere in western Russia in order for its location to correspond to the speed of light.", "6) Our system of referencing locations on the globe via latitude didn't come into being until long after the construction of the Great Pyramid of Giza. And decimal degree mapping at the level of precision implied by the meme relies upon exacting measurements of our globe that were not possible until the late 1900s.", "All in all, this \"coincidence\" depends upon people who lived thousands of years ago having knowledge of concepts that weren't discovered or created until much, much later in human history, and referencing systems of measurement that did not exist in their time and place.", "World-Pyramids.com.   \"Great Pyramid - Pillar of Light.\"\r\n    Accessed 7 February 2018.", "National Institute of Standards and Technology.   \"Speed of Light in Vacuum.\"\r\n    Accessed 6 September 2018.", "Handwerk, Brian.   \"Pyramids at Giza.\"\r\n    National Geographic.   Accessed 6 September 2018.", "Watson, Bruce.   Light: A Radiant History from Creation to the Quantum Age.\r\n     Bloomsbury Publishing, 2016.   ISBN 9781620405611.", "Al-Khalili, Jim.   \"In Retrospect: Book of Optics\"\r\n    Nature.   12 February 2015.", "Romer, M.   \"On the Motion of Light\"\r\n    Philosophical Transactions of the Royal Society of London,  1677.", "Cardarelli, François.   Encyclopaedia of Scientific Units, Weights and Measures.\r\n     Springer Science & Business Media, 2003.   ISBN 9781852336820.", "Bagnall, Roger, S.   The Oxford Handbook of Papyrology.\r\n     Oxford University Press, 2011.   ISBN 9780199843695.", "ESRI.   \"FAQ: Projection Basics: What the GIS Professional Needs to Know.\"\r\n    Accessed 6 September 2018.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]