["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Texas Sen. Ted Cruz, shown here at a September 2017 Texas Tribune event, later made a Half True claim about changes in federal tax law (Nick Wagner, Austin American-Statesman).", "The nation’s new tax laws put in place by ruling Republicans won’t leave everyone paying less to Uncle Sam forever, projections show, mainly because nearly all legislated individual income-tax reductions expire after 2025.", "But Sen. Ted Cruz, R-Texas, stirred our curiosity when he asserted that certain rich Americans would face increased taxes off the bat.", "\"By the way,\" Cruz said in Senate debate Dec. 19, 2017, \"there is one subset of people whose taxes will go up under this, the rich people in high-tax Democratic states. The irony of all the high dudgeon from our Democratic friends pounding the table about ‘this is a tax cut for the rich,’ the only people whose taxes are going up are the really rich,\" Cruz said.", "Cruz, seeking re-election in 2018, was even more specific, saying: \"The middle class, their taxes are all going down. The working class, their taxes are going down. Every taxpayer, their taxes are going down,\" Cruz said, \"except rich people in Manhattan and San Francisco. Some of them, their taxes may go up.\"", "We unsuccessfully queried Cruz about how he reached his conclusion about higher taxes solely hitting plump cats in the Big Apple and The City (which--honest--is what San Francisco residents call their town).", "To be sure, studies of the plan signed into law by President Donald Trump suggest that many wealthy Americans will see tax cuts--while some will pay more. We didn’t confirm, though, that those likely paying more live only in San Francisco and Manhattan. But experts told us wealthier workers in high-tax states and cities are at risk of higher tabs in the main because the law limits to $10,000 how much anyone may deduct in state and local income taxes.", "Two studies signal plan’s 'winners, losers'", "Toward the end of 2017, PolitiFact in Washington looked at impact studies of the adopted tax plan by the Joint Committee on Taxation, the nonpartisan group that analyzes tax bills for Congress, and the Urban Institute-Brookings Institution Tax Policy Center, an independent group that models the effects of tax legislation.", "According to the committee, taxpayers stand to enjoy reductions in 2019 (the first year of its analysis) with the average tax rate decreasing in each of 11 income groupings. Yet not everyone is projected to see lower taxes every year. In 2027, the committee’s analysis says, taxpayers earning up to $75,000 a year would face average tax rates higher than what they faced under existing law with people in higher brackets still paying less than they would if the law hadn’t changed.", "Why the big changes before 2027? The primary reason is that the law phases out some of the individual tax cuts after 2025. Also, some inflation adjustments imposed by the law are less generous than previous ones.", "Separately, the center’s analysis indicates that from the get-go, some taxpayers within each income bracket will likely pay more in taxes--though 95 percent will see reductions or not lose ground.", "By phone to our inquiry, the center’s Mark Mazur pointed out that the analysis shows a subset of taxpayers in each quintile stand to pay more in taxes in the plan’s first year, 2018. At the low end, Table 4 states, 1.2 percent of taxpayers in the lowest income quintile will pay more; at the high end, the table indicates, 6.2 percent of taxpayers in the highest income quintile stand to pay more in taxes than if the law hadn’t changed.", "Also, the center’s breakdown suggests, nearly one in five of the nation’s tip-top wealthiest will see higher taxes. To be precise, the analysis says 16.2 percent of taxpayers in the top tenth of 1 percent in income will pay an average of $387,610 more in federal taxes in 2018 than if the law had gone unchanged:", "Income range", "Percentage with a tax cut in 2018", "Average tax cut for those with a cut", "Percentage with a tax increase in 2018", "Average tax increase for those with an increase", "Lowest 20 percent", "53.9 percent", "- $130", "1.2 percent", "$810", "20th to 40th percentile", "86.8 percent", "- $480", "4.6 percent", "$740", "40th to 60th percentile", "91.3 percent", "- $1,090", "7.3 percent", "$910", "60th to 80th percentile", "92.5 percent", "- $2,070", "7.3 percent", "$1,360", "80th to 90th percentile", "92.3 percent", "- $3,370", "7.6 percent", "$1,800", "90th to 95th percentile", "94.4 percent", "- $4,910", "5.5 percent", "$1,890", "95th to 99th percentile", "97.3 percent", "- $13,890", "2.7 percent", "$8,260", "Top 1 percent", "90.7 percent", "- $61,940", "9.3 percent", "$93,910", "Top 0.1 percent", "83.7 percent", "- $285,490", "16.2 percent", "$387,610", "SOURCE: Report, Urban Institute-Brookings Institution Tax Policy Center, \"Distributional Analysis of the Conference Agreement for the Tax Cuts and Jobs Act,\" Dec. 18, 2017", "Factors behind higher taxes ‘idiosyncratic’", "We asked Mazur to explain why some Americans will pay more in taxes.", "Broadly, Mazur said, those paying more in 2018 will end up doing so for idiosyncratic reasons.", "For instance, Mazur said by email that larger \"families with lots of dependents who are not eligible for the child tax credit (for example because the children are too old or because the dependents are not children) could see a tax increase because the loss of personal exemptions could be greater than the increase in the standard deduction.", "\"In addition, some taxpayers with large amounts of deductions (e.g., moving expenses, casualty losses, alimony paid) could be made worse off under the new law,\" Mazur wrote.", "Also, Mazur and other experts said the $10,000 limit on deductible state and local tax payments could leave some taxpayers confronting higher federal taxes--though Mazur said that would apply across the country, not just to residents of San Francisco or Manhattan.  \"This can occur anywhere in the country, though states and localities with higher taxes generally would be the most likely to bump up against the $10,000 annual limit,\" he wrote.", "All this said, Mazur added, most people will still be better off tax-wise in 2018.", "We also heard back about Cruz’s claim from John Buhl of the Tax Foundation, a conservative-leaning think tank that has posted sample forecasts of the law’s effect on different earners. By email, Buhl said the \"people most likely to see some increase in taxes are higher income earners in high-tax states and localities who\" have heavily relied on state and local tax deductions. \"Generally speaking, those most likely to be impacted are in the 90th to 99th income percentiles,\" Buhl said.", "Buhl noted a wrinkle when it comes to the nation’s super-wealthy in that, he said, the top 1 percent of taxpayers hail from households that typically don't benefit from the state and local deduction; they instead face the federal alternative minimum tax levied on higher-income households that take a lot of deductions to ensure that they pay at least a minimum amount of tax. \"Given that, only some wealthier taxpayers will end up paying more,\" Buhl said.", "Experts in New York, California", "Tax experts in the states singled out by Cruz each told us that most taxpayers will pay less in the plan’s first years, but there will be people paying more.", "In New York, Edmund J. McMahon of the Albany-based Empire Center for Public Policy, a nonpartisan think tank that advocates policy reforms based on free-market principles, took note in a Dec. 13, 2017, blog post that despite the new law reducing tax rates for the nation’s highest earners, the combined federal, state and local income tax rate on the wage, salary, bonus and self-employment incomes of the highest-earning New York City residents would be going up by about a percentage point.", "By phone and email, McMahon called Cruz’s claim generally correct—though McMahon said that what the Texan said applies to wealthy residents in all of New York’s boroughs, not just Manhattan where \"income millionaires are most concentrated,\" McMahon said.", "The effects also will extend beyond the wealthiest residents of San Francisco, McMahon said, in that high earners across California will be affected by the cap on deductible state and local taxes. McMahon otherwise speculated that Cruz with his locale-specific claim \"was playing to the stereotypes people have\" about where the very wealthiest Americans abide.", "Annette Nellen, a San Jose State University expert on tax law, provided us with a document she drafted spelling out the likely tax effects on different taxpayers. Generally, Nellen’s presentation states, most individuals will see tax reductions though individual results will depend, in part, on types of income and amounts; the ages of dependent children; and whether lost deductions drive up taxes more than savings attributable to reduced rates.", "Our ruling", "Cruz said that under the tax changes, every \"taxpayer, their taxes are going down, except rich people in Manhattan and San Francisco. Some of them, their taxes may go up.\"", "Cruz clearly engages in hyperbole here, though the gist of his statement holds water in that most taxpayers are projected to enjoy lower federal taxes through 2025. Also, those most likely to see their taxes go up include wealthy wage earners in high-tax states and cities.", "Still, projections show that across income groups, not every taxpayer will see lower taxes, contrary to what Cruz said, and many of those who do see tax savings are likely to lose them after 2025. It’s also so that residents of high-tax states and cities at risk of higher taxes aren’t limited to Manhattan and San Francisco.", "We find this statement partially accurate but lacking in some important context. That makes it Half True.", "HALF TRUE – The statement is partially accurate but leaves out important details or takes things out of context. Click here for more on the six PolitiFact ratings and how we select facts to check.", "C-SPAN video of Sen. Ted Cruz speaking in favor of the tax plan, U.S. Senate, Dec. 19, 2017 (Cruz’s claim is made about the 9:22:40 mark)", "Remarks of Sen. Ted Cruz, U.S. Senate floor, Dec. 19, 2017, Congressional Record", "Story, \"Who wins and who loses from the tax bill?,\" PolitiFact, Dec. 19, 2017", "Report, Joint Committee on Taxation, \"Distributional Effects Of The Conference Agreement For H.R.1, The Tax Cuts And Jobs Act,\" Dec. 18, 2017", "Report, Urban Institute-Brookings Institution Tax Policy Center, \"Distributional Analysis of the Conference Agreement for the Tax Cuts and Jobs Act,\" Dec. 18, 2017", "Phone interview and email, Mark J. Mazur, Robert C. Pozen Director, Tax Policy Center, Jan. 2, 2017", "Email, Abigail Salvatore, communications director, Empire Center for Public Policy, Dec. 28, 2017", "Phone interview, Edmund J. McMahon, research director, Empire Center for Public Policy, Jan. 2, 2017", "Document, \"Examples of Changes in Tax Liabilities for Varied Individual  Fact Patterns,\" (received by email from Annette Nellen, professor and director of the Master of Science in Taxation Program, College of Business, San José State University, Jan. 5, 2018)", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]