["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "On May 22, 2020, walkers pass American flags flying at half-staff at the Washington Monument in Washington. (AP/Semansky)", "Recent data from Johns Hopkins University shows the U.S. has had approximately 30 COVID-19 deaths per 100,000 people. Kernen got that basically right.", "But only a handful of countries are performing worse by that metric, and even fewer — three — have recorded more than 60 deaths per 100,000 people.", "Various databases show the U.S. has more COVID-19 deaths per capita than the vast majority of countries.", "On the day the U.S. topped 100,000 COVID-19 deaths, CNBC hosts Joe Kernen and Andrew Ross Sorkin shouted over each other about the threat of the virus and its impact on the stock market.", "After Kernen said Sorkin had panicked about the coronavirus and spooked investors, Sorkin accused Kernen of dismissing the virus as a way to defend President Donald Trump.", "\"You didn’t panic about anything,\" Sorkin said during the May 27 dust-up on CNBC’s \"Squawk Box.\" \"100,000 people died, Joe, and all you did was try to help your friend, the president.\"", "Kernen responded that he has been trying to help investors \"keep their cool, keep their heads,\" adding that \"as it turned out, that’s what they should’ve done.\" Then he explained why.", "\"We’re down near the low end of per capita deaths,\" Kernen said. \"… Most places are at 60 deaths per 100,000. We're at 29.\"", "The next day, the two told viewers that they had made amends, with Sorkin saying they were \"having the conversation that’s happening at everybody’s dinner table.\"", "In case you’re having the same argument over dinner tonight, we wanted to arm you with the facts: Kernen’s claim on deaths per capita isn’t completely accurate.", "While the U.S. is close to 29 deaths per 100,000 people, it is not \"near the low end of per capita deaths,\" we found. Only a handful of countries have had more deaths per capita.", "RELATED: Trump’s comparison of COVID-19 deaths in Germany, US is wrong", "A CNBC spokesperson cited data from Johns Hopkins University tracking deaths per 100,000 people, a metric that public health experts generally consider useful.", "As of May 26, the day before Kernen’s claim, the U.S. had recorded 30.23 deaths per 100,000 people, according to Johns Hopkins.", "That was better than 10 countries. It was worse than more than 130 others, including many nations of similar size.", "Specifically, the U.S. had more deaths per 100,000 people at the time of Kernen’s comment than all but a handful of European countries: San Marino, Belgium, Andorra, Spain, the United Kingdom, Italy, France, Sweden, the Netherlands and Ireland.", "Only San Marino (pop. 34,000), Belgium (pop. 11.6 million) and Andorra (pop. 77,000) had more than 60 deaths per 100,000 people. Spain, the United Kingdom and Italy had over 50 deaths per 100,000.", "Those figures have hardly changed as of May 27. The U.S. is at 30.69 deaths per 100,000 people, behind the same 10 European nations but ahead of the rest.", "Three other sources public health experts told us are reliable — the Kaiser Family Foundation, Our World in Data and Worldometer — show similar numbers.", "Each source shows the U.S. performing worse than the vast majority of countries.", "\"We have a very high death rate here compared to most countries in the world, and some of our states have among the highest death rates in the world,\" said Brooke Nichols, assistant professor of global health at Boston University.", "The U.S., in particular, is \"a patchwork epidemic\" because of its \"expansive, diverse geography and populations,\" Nichols said.", "Different geographic areas experience varying outbreaks and death tolls due to a number of factors, such as the age of the population, how far along the epidemic curve the area is and how well the local health care systems have been able to manage, she said.", "If you compare individual U.S. states to other countries, Nichols said, the situation looks worse. Eleven states plus Washington, D.C have more deaths per million people than the U.S. as a whole, according to Worldometer data for May 28.", "Some states are comparable to the worst countries.", "As we’ve noted, another way to compare countries is to consider recent — rather than total — death counts per capita. But as of May 28, numerous countries have also had fewer daily deaths per capita based on a seven-day average than the U.S., per Our World in Data.", "Kernen said: \"We’re down near the low end of per capita deaths … Most places are at 60 deaths per 100,000. We're at 29.\"", "The U.S. has hovered slightly above 29 COVID-19 deaths per 100,000 people in recent days, but it is far from being \"down near the low end of per capita deaths.\"", "Only a handful of countries are performing worse by that metric, and just three have recorded more than 60 deaths per 100,000.", "We rate this statement Mostly False.", "Mediaite, \"CNBC Segment Explodes as Andrew Ross Sorkin Accuses Joe Kernen of Being in the Tank for Trump During Crisis: ‘100,000 PEOPLE DIED!’\" May 27, 2020", "Mediaite, \"WATCH: After Explosive On-Air Battle, CNBC Anchors Make Up for the Cameras,\" May 28, 2020", "Johns Hopkins University, \"Mortality Analyses,\" accessed May 28, 2020", "Kaiser Family Foundation, \"COVID-19 Coronavirus Tracker – Updated as of May 28,\" May 28, 2020", "Our World in Data, \"Total confirmed COVID-19 deaths per million people,\" accessed May 28, 2020", "Worldometer, \"COVID-19 Coronavirus Pandemic,\" accessed May 28, 2020", "PolitiFact, \"Trump’s comparison of COVID-19 deaths in Germany, US is wrong,\" May 13, 2020", "Email correspondence with Brian Steel, executive vice president for CNBC public relations, May 28, 2020", "Email correspondence with Jeffrey Shaman, professor of environmental health sciences at Columbia University, May 28, 2020", "Email interview with Brooke Nichols, assistant professor of global health at Boston University, May 28, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]