["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Then-Gov. Jeb Bush is shown in his office at the Capitol, Thursday, Oct. 25, 2006, in Tallahassee, Fla. (AP photo)", "Jeb Bush, otherwise known as \"Veto Corleone\" in Florida, says he has the fiscal conservative track record to back up his nickname.", "\"I cut state spending more than anybody. I’ll do it in DC too,\" Bush tweeted on Aug. 31, with an accompanying chart.", "I cut state spending more than anybody. I’ll do it in DC too. pic.twitter.com/8rXnJwBomb", "Louisiana Gov. Bobby Jindal, who’s No. 2 in spending cuts according to the chart but No. 14 in the polls, begged to differ and tweeted at Bush with a different chart that shows the former Florida governor was actually the top spender in the field. (Jindal has used this chart to tout his own conservative bonafides before.)", ".@JebBush may claim to have cut government spending, but FL’s budget grew 52% under his watch https://t.co/BFGM4URs0a pic.twitter.com/VG5NUc6e7t", "We were curious about Bush’s claim that he’s the top spending cutter. We found that neither Bush’s chart nor Jindal’s chart is a perfect way to compare state budgets — but Jindal’s chart is less perfect.", "Bush’s chart", "The Bush campaign told us his source was a Fox News fact-check that compared the track records of the GOP governors in the race. It looked at changes in state spending, expressed as a percentage change in each state’s budget. Here’s the original chart from Fox:", "\"The chart above shows that Bush cut spending the most. Though he's criticized by conservatives as ‘too moderate,’ the former Florida governor cut spending by an average of 1.39 percent each year he was in office. Most cuts came from ‘public assistance,’ higher education, and state discretionary spending,\" the fact-check reads.", "Fox’s data comes from a National Association of State Budget Officers report, which breaks up state spending into four spending pools: general fund (the main fund and typically most flexible), federal funds, other state funds (which includes targeted revenue, such as gasoline taxes for transportation spending), and bonds.", "According to Brian Sigritz, the association’s director of state fiscal studies, Fox tallied up two of the pools — general fund and other state funds — and adjusted the numbers for inflation and population.", "We ran Fox’s analysis by a few experts who told us that while it’s a fair analysis, it’s not flawless. (We’ll get to its imperfections later.) On the positive side, taking the different population sizes of different states into consideration is a good start, according to Alan Auerbach, a professor of public finance at the University of California at Berkeley.", "It’s also fair to leave out federal funds and bonds. David Crane, who researches state fiscal policy at Stanford University, told us he also excludes those categories when crunching the numbers in California’s state budget.", "\"If the goal is to learn if a governor cut spending, why would you include funds provided by a third party?\" he said. \"(Bonds) are generally issued for infrastructure, not operating costs.\"", "Overall, the analysis created a way to measure spending that is mainly under the control of state officials.", "\"It is pretty close to a concept of ‘tax supported spending,’ but still imperfect,\" said Don Boyd, who analyzes state and local fiscal issues at the Rockefeller Institute of Government. \"Overall, based on what Fox said they did, I think they did a pretty good job.\"", "Jindal’s chart", "What about Jindal’s retort? According to his chart, Bush was the top spender out of the eight governors in the 2016 race, and his budget increased by an average of 6.08 percent every year.", "We noted in a recent fact-check that it’s a more simplistic, and thus more imperfect, way to look at the state budget picture.", "For one, the analysis does not adjust for inflation. That’s not an issue if you’re comparing the same years for everybody, but the numbers may be distorted when comparing different time periods. (Bush was governor from 1999 to 2007, while Jindal took office in 2008.)", "\"If you're looking at different time periods, inflation surely would have been different and it can't possibly be an accurate reflection of the consequences of policy choices,\" Boyd said.", "For another, Jindal’s numbers only consider the general fund. Given that some governors may spend more out of other state funds, just looking at one pool of money makes it more difficult to compare across states, according to Boyd.", "Limitations all around", "Experts, however, emphasized that there’s no one way or perfect way to compare budgets across states.", "\"There is not one single measure of state fiscal conditions that we recommend using,\" said Sigritz of the state budget officers’ association. \"There are pluses and minuses with using each indicator.\"", "Then there are limitations with the data itself. The association’s numbers are self-reported by the budget offices of each state, which Boyd said may affect the quality of the data. Moreover, the numbers also reflect spending that’s not supported by taxes, such as higher education spending supported by tuition.", "And because the governors all served at different times, it’s unfair to compare them because they were working with different economic conditions. Bush, for example, governed during an economic boom, and Jindal held office during a recession.", "\"The Bush claim has some merit, but there are additional things one would want to control for — like economic conditions in Florida relative to other states — to get a better picture,\" said Auerbach. \"And, of course, what any governor does depends on the state legislature to a reasonable extent.\"", "He and Sigritz both noted that economic downturns have significant impacts on state budgets, and spending usually decreases during recessions. To its credit, Fox tried to address the disparity by comparing each candidate to his contemporaries (i.e. Bush to other governors of the 2000s and Jindal to sitting governors). By that measure, Bush was still the top cutter.", "Beyond the question of who cut the most spending, experts said we shouldn’t ignore how they did it.", "\"If, for example, a governor cut spending by underpaying pension contributions, or by deferring maintenance on roads and bridges, then look out below,\" said Boyd.", "As Fox notes, Bush’s cuts came from public assistance, higher education and state discretionary spending. Much of the reduction under Jindal, reported the Times-Picayune in 2011, is \"explained by waning hurricane recovery appropriations and the end of federal stimulus aid.\"", "Our ruling", "Bush tweeted, \"I cut state spending more than anybody.\"", "He cited a chart by Fox News that experts told us was a valid way of looking at budget reductions. It’s not perfect nor is it the only way to measure spending cuts.", "Bush’s claim is partially true but leaves out context. We rate it Half True.", "Jeb Bush, Tweet, Aug. 31, 2015", "Bobby Jindal, Tweet, Aug. 31, 2015", "Email interview with Kristy Campbell, spokesperson for Jeb Bush, Sept. 3, 2015", "Email interview with Brian Sigritz, director of state fiscal studies for the National Association of State Budget Officers, Sept. 1, 2015", "Email interviews Alan Auerbach,  professor of public finance at the University of California at Berkeley, Sept. 3, 2015", "Email interview with David Crane, lecturer in public policy at Stanford University and president of Govern for California, Sept. 3, 2015", "Email interview with Don Boyd, director of fiscal studies at the Rockefeller Institute of Government, Sept. 3, 2015", "Email interview with Matt Yglesias, executive editor of Vox, Sept. 3, 2015", "PolitiFact, Bobby Jindal: 'I'm the only candidate that has actually reduced the size of government’, Aug. 30, 2015", "Fox News, Fact Check: Which Republican candidates actually cut spending?, Aug. 28, 2015", "National Association of State Budget Officers, State Expenditure Report, 2014", "The Time-Picayune, Gov. Bobby Jindal says he's 'beginning to turn this state around', Oct. 12, 2011", "Vox, Stat check: Jeb Bush says he \"cut state spending more than anybody\", Sept. 1, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]