["Voters in Ohio are enduring a deluge of fundraising emails from political groups ahead of the November election, like one from Friends of Sherrod Brown. The senator, in the middle of his second term, is hoping to garner support for fellow Democrat Ted Strickland.", "\"Outside special interests like to spend money in Ohio,\" Brown’s email said. \"Back in 2012, they spent $40 million trying to buy my seat in the Senate. … Right now, the special interests are up to $30 million spent against Ted -- with the Koch network spending more money in Ohio than anywhere else in the country.\"", "Strickland, the former Ohio governor, is running for Senate against incumbent Republican Sen. Rob Portman in one of the tightest races in the country.", "The billionaire brothers Charles and David Koch, of Koch Industries, are tied as the sixth-richest people in the world, each worth an estimated $42 billion. As political and policy influencers advancing a free-market agenda, their network includes the nonprofit Americans for Prosperity and the super PAC, Freedom Partners Action Fund", "The Kochs can usually be counted on to fund conservative causes, but they have recoiled from the 2016 presidential race.", "Is down-ballot spending in Ohio the Koch’s biggest imprint so far in the 2016 elections?", "We turned first to the nonpartisan Center for Responsive Politics for its tallies of outside contributions.", "The Koch brothers, through their political action network, have spent approximately $8 million in the senate race in Ohio, with almost $2 million from Americans for Prosperity and a little over $6 million from Freedom Partners Action Fund. That is more than the Koch-backed groups have spent in any other race in the country, according to OpenSecrets records.", "The Koch network’s next-largest spending, by comparison, is in North Carolina, where Americans for Prosperity has spent a mere $200,000 against Rep. Renee Ellmers, and in Pennsylvania, where Freedom Partners Action Fund has spent almost $3 million in opposition to Katie McGinty.", "In opposition spending by Freedom Partners, Strickland has \"taken the most punishment\" in 2016 to date, the Center for Responsive Politics reported.", "So the Koch network is contributing substantially to help Portman keep his seat. But where did Brown get the \"$30 million spent against Ted\"?", "Here are the numbers for outside spending contributions in the Ohio senate race, according to OpenSecrets.org:", "If you add the total outside spending for Portman, and the spending against Strickland, you get $19,232,784. (We’re leaving out the primary race spending for the other Democratic candidate, P.G. Sittenfeld, who Strickland beat -- that’s the difference between our total and the $19,990,270 above.)", "Where does the other $10 million come from?", "Strickland spokesman David Bergstein told PolitiFact Ohio that, in tracking money spent against the candidate, the campaign monitors announcements of advertising purchases, some of which come from 501(c)(4) organizations that don’t have to report to the Federal Election Commission. Those dollars, therefore, don’t appear on sites like OpenSecrets.org. Counting announcements of spending from these nonprofits, the conservative estimate is closer to $30 million, the campaign said. Bergstein provided a spreadsheet confirming that figure.", "Strickland’s campaign isn’t suffering from a lack of outside spending as much as Brown’s email might suggest. Senate Majority PAC, a super PAC dedicated to putting Democrats in Senate seats, has spent $8.4 million against Portman and $1.8 million for Strickland.", "We shared our analysis with Freedom Partners Action PAC, and the group did not dispute our findings.", "Our ruling", "A fundraising email in support of Strickland said that the billionaire-backed Koch network has devoted the most money to oppose the Ohio senate candidate than in any other race in the country.", "Americans for Prosperity and the Freedom Partners Action Fund have spent about $8 million to oppose Strickland, which is more than they’ve dropped in any other race this election season to date.", "Strickland’s campaign, while hardly immune to special interests, is the Koch network’s biggest target in an election year that has seen conservative benefactors steer clear of the main ticket.", "We rate the claim True.", "Interview, David Bergstein, Strickland for Senate, July 29, 2016", "Slate.com, \"The Koch Brothers were supposed to buy the 2016 election,\" May 18, 2016", "Center for Responsive Politics, \"Ohio Senate race attracts highest outside spending in Congress, big share of dark money,\" Jun. 20, 2016", "Politico, \"What the Kochs think about Trump now,\" May 5, 2016", "USA Today, \"Charles Koch has no plans to back a candidate in the Republican primary,\" Nov. 11, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]