["One of these Facebook posts, published April 7, 2020, has been shared more than 480 times. It reads, in part: “BREAKING NEWS# The president Cryill Ramaphosa has asked all foreign nations to depart south Africa before 21 june 2020 due to increasing cases of COVID 19 (sic).”", "The claim has been repeated numerous times in other Facebook posts, such as here and here.", "In a tweet, Minister in the Presidency Jackson Mthembu refuted the posts’ claim about foreign nationals being asked to leave, as well as the claim about the country’s lockdown being extended by three months.", "We are working with the police , social media providers to unmask the person who posted these fake news . The law will take it’s course thereafter . #Stayhome #Staysafe #doyourpart #Savelives #lockdown #Stopcovid19SA .", "The Department of Home Affairs also tweeted the claim with a “fake” banner across it.", "#FakeNews pic.twitter.com/ip77geFjeM", "Multiple misleading claims have been shared in South Africa regarding an extension of the current 21-day lockdown, as debunked here by AFP Fact Check. The lockdown is slated to end on April 30.", "The South African government recently approved for the national carrier to start repatriating some international citizens who were stuck in the country during the lockdown, such as Germany.", "pic.twitter.com/Oep4CjAEyF", "Belgian citizens will also be repatriated on April 9, according to a tweet by South African Airways.", "As of April 9, South Africa had recorded 18 deaths from COVID-19, with 1,845 people infected.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]