["About this rating", "An American sign-making company prompted legal questions about using the presidential seal for commercial gain when it acknowledged in March 2018 that it was manufacturing golf tee markers bearing the official seal for use at Trump-owned properties.", "ProPublica first reported the story in early March for their Trump, Inc. podcast in which reporters investigate Trump's various business ties and deals. A photograph of the markers appeared on Eagle Sign & Design's Facebook page in late February:", "Facebook", "An Instagram photo (since deleted) shared on 4 March showed one of the markers in place at Trump International Golf Course in West Palm Beach, Florida, a short drive from Trump's Mar-a-Lago resort:", "Instagram", "And an image making the rounds on Twitter after ProPublica's article was published allegedly shows an example of merchandise sold in the Trump Tower gift shop sporting a reproduction of the presidential seal:", "Worth noting, in light of @ProPublica's reporting this week on use of the presidential seal for commercial purposes, that the Trump Tower gift shop has been selling various tchotchkes bearing the presidential seal. pic.twitter.com/mQYqdgLmbm", "— Steve Reilly (@BySteveReilly) March 6, 2018", "These tees and tchotchkes came under scrutiny because a federal statute prohibits certain uses of the presidential seal:", "18 U.S. Code § 713", "(a) Whoever knowingly displays any printed or other likeness of the great seal of the United States, or of the seals of the President or the Vice President of the United States, or the seal of the United States Senate, or the seal of the United States House of Representatives, or the seal of the United States Congress, or any facsimile thereof, in, or in connection with, any advertisement, poster, circular, book, pamphlet, or other publication, public meeting, play, motion picture, telecast, or other production, or on any building, monument, or stationery, for the purpose of conveying, or in a manner reasonably calculated to convey, a false impression of sponsorship or approval by the Government of the United States or by any department, agency, or instrumentality thereof, shall be fined under this title or imprisoned not more than six months, or both.", "ProPublica cited legal experts who suggested that the Trump Organization's commercial appropriation of the seal for marketing or branding purposes falls outside what would be considered acceptable use under the law:", "Ethics experts have long been on the lookout for signs that the Trump Organization would exploit the office of the presidency for commercial gain. Several said that using the presidential seal on the company’s golf courses would fall into this category.", "A law governs the manufacture or use of the seal, its likeness, “or any facsimile thereof” for anything other than official U.S. government business. It can be a criminal offense punishable by up to six months in prison.", "The “law is an expression of the idea that the government and government authority should not be used for private purpose,” said Kathleen Clark, a law professor at Washington University specializing in government and legal ethics said. “It would be a misuse of government authority.”", "In the wake of the ProPublica story, a spokesperson for the Trump Organization told Associated Press that the tees were a gift from golf club members:", "\"The plaques were presented to the club by a small group of members, who are incredible fans of the president, in honor of Presidents’ Day weekend,\" said Trump Organization spokeswoman Amanda Miller. \"They were temporary and have since been removed.\"", "The Trump Organization did not respond to a request for clarification on who ordered the plaques, the names of the members who “presented” them, how they were displayed and at what club.", "But reporters from ProPublica and WNYC said they had examined the order form, which listed the purchaser as Trump International. Reportedly, Eagle Sign & Design has done other work for Trump International in the past.", "Despite the Trump Organization's claim that the replicas were temporary and had been removed, the nonprofit watchdog group Citizens for Ethics and Responsibility in Washington (CREW) issued a statement saying they had nevertheless violated the law:", "There does not appear to be any legal interpretation that says it's okay to violate the law if it's only for a holiday weekend. If anything, it raises more questions as to whether they knew they were violating the law, so intentionally tried to do it for a short time to see if it would get noticed.", "Previous presidents, including Barack Obama, George W. Bush, and Ronald Reagan, had items such as golf balls and sets of China made that featured the presidential seal, but they were for personal use or to give out as gifts, not commercial marketing.", "Still, legal experts weren't unanimous in the opinion that the Trump Organization's use of the seal was against the law. Yale law professor Stephen L. Carter wrote that although the commercial appropriation of the symbol can be criticized as \"tacky,\" it doesn't rise to the level of a crime:", "The statute regulating (not “barring” or “prohibiting”) use of the presidential seal is drafted with care. Under Section 713, one commits a crime only by displaying the seal “in a manner reasonably calculated to convey, a false impression of sponsorship or approval by the Government of the United States or by any department, agency, or instrumentality thereof.” This language, borrowed from the law of unfair competition, is narrowly drafted to avoid trampling on First Amendment rights. Displaying a likeness of the seal is prohibited only when the use will create that “false impression of sponsorship or approval” — what courts in other contexts call “confusion as to source.”", "\"The federal statute is constitutional only so long as we read it to ban uses of the seal that are either deceptive or misleading, and nothing else,\" Carter observed, noting that any number of items bearing the seal can be purchased (and legally so) on Amazon.com. \"What the Trump Organization is doing, or what Amazon is doing, or what a publisher touting a book is doing, involves uses that are neither deceptive nor misleading.\"", "The extent to which expert opinions differ on this is probably best reflected in the fact that Trump International announced the removal of the markers within days of their legality being questioned.", "Carter, Stephen L.  \"Is Using the Presidential Seal on Trump Merchandise Criminal or Just Tacky?\r\n  The Washington Post.  7 March 2018.", "Condon, Bernard.  \"Trump Org: Presidential Seals at Golf Club Came from Members.\"\r\n  Associated Press.  6 March 2018.", "Moore, Mark.  \"Trump International Ordered Golf Course Markers with Presidential Seal.\"\r\n  New York Post.  5 March 2018.", "Sommerfeldt, Chris.  \"Trump Organization Removes Presidential Seal Replicas Amid Complaints that They Could Be Illegal.\"\r\n  New York Daily News.  6 March 2018.", "Sullivan, Katherine.  \"The Trump Organization Ordered Gold Course Markers with the Presidential Seal. That May Be Illegal.\"\r\n  ProPublica.  5 March 2018.", "Sullivan, Katherine.  \"Trump's Company Removes Presidential Seal from Golf Course.\"\r\n  ProPublica.  6 March 2018.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]