["\"Today I learned that when pelicans are hot, they can take their spine out of their mouths to cool down,\" says a March 15, 2021 Facebook post shared thousands of times.", "Other examples of the claim circulated on social media here and here.", "Kaeli Swift, a postdoctoral researcher at the University of Washington, where she teaches about ornithology and wildlife ecology, debunked the claim in a video on her YouTube channel.", "\"Birds cannot eject their internal organs under any circumstances,\" she told AFP by email. \"It's just doing a big stretch, perhaps after a meal or just because stretching feels good. The most typical way birds cool down is by doing something that's akin to panting.\"", "\"When these birds yawn -- and I just mean yawn, as like, a big mouth stretch -- they 'snake' their heads back... they open big and wide and this tissue on the bottom mandible is getting stretched out over the neck,\" she explains in her video.", "\"That is what is really going on in those wild photos.\"", "Sharon Stiteler, a park ranger who has written books about birds, said via direct message on Twitter: \"One of those birds isn't even a pelican.\"", "The top left photo actually shows a type of stork called a shoebill, she said, \"although the Internet likes to call it the Murder Stork.\"", "\"All of those birds are yawning and stretching their head back. The way their body is shaped, their pouch under their beak stretches over their neck...which technically contains their spine, but it is not coming out of their body,\" Stiteler said.", "\"Pelicans always get the weird stories. Once someone told me that pelicans pierce their own breast when they are starving so their chicks can feed on their blood. That is not true either.\"", "The fibrous skin under a pelican's bill is called the \"gular pouch,\" the Chicago Zoological Society's Brookfield Zoo tweeted.", "\"You've probably seen them expand it while feeding. But have you ever seen them invert their pouch? No one is sure why they do it but it's thought it might be the pelican stretching to prepare for a big meal,\" it says.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]