["About this rating", "On 13 July 2017, the America's Last Line of Defense web site published article reporting that the \"Clinton killing machine\" was about to get a new enrty, as a pilot named Dimitri Noonan had revealed information about a secret meeting between former President Bill Clinton, former Attorney General Loretta Lynch, and House Speaker Paul Ryan:", "The Clinton killing machine is about to get a new name to chew up and spit out.", "The pilot who flew the plane for the secret meeting between Bill Clinton, Loretta Lynch and, recently disclosed, Paul Ryan is breaking his silence for a $2 million payday that is sure to put his life in danger.", "Dimitri Noonan, a pilot who has worked for the Justice Department for 25 years, has codeword clearance but says none of the meeting was classified, since officially it didn’t happen.", "There was no truth to this story, which originated with America's Last Line of Defense, a fake news site with a long history of spreading misinformation.  The site carries a disclaimer identifying its content as satire and stating that only a \"real dumbass\" would believe their stories:", "America’s Last Line of Defense is a satirical publication that may sometimes appear to be telling the truth. We assure you that’s not the case. We present fiction as fact and our sources don’t actually exist. Names that represent actual people and places are purely coincidental and all images should be considered altered and do not in any way depict reality.", "In other words, if you believe this crap you’re a real dumbass.", "The article's included picture purportedly showing pilot Dmitri Noonan was actually a stock photograph of a pilot:", "America’s Last Line of Defense also stated that Noonan would reveal more information about the \"secret meeting\" during an interview on Fox News, but they linked to a Facebook page called \"Fox News Sucks\" and not the cable news channel's actual social media page.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]