["About this rating", "Over the last two decades, Starbucks has been a constant presence in the world of hoaxes and rumors. There's the debunked story from 2004 about Starbucks purportedly refusing to donate coffee to U.S. Marines, the false story from 2019 that claimed the coffee chain threatened to fire employees for saying \"Merry Christmas,\" and another one from 2020 that claimed the company supported defunding police departments.", "We've also covered a number of scams related to Starbucks. So when we came across claims that Starbucks employees could see drive-thru customers on a camera and that multiple staff members can hear drive-thru orders being placed via headsets, it didn't sound too surprising. However, after noticing quite a few surprised TikTok commenters, we decided to take a look.", "On Dec. 20, 2020, TikTok user @zandergjura published a pair of videos that purported to reveal two things: \"I'm going to show you a couple of things that you didn't know about ordering at a Starbucks drive-thru.\"", "In the first video, @zandergjura showed that at least one employee could see customers as they drive up to order at the drive-thru menu:", "https://www.tiktok.com/@zandergjura/video/6908119157691223302", "The second video purported to show that multiple Starbucks team members listen in on drive-thru orders:", "https://www.tiktok.com/@zandergjura/video/6908491924710132997", "In the video, @zandergjura said of Starbucks drive-thru headsets: \"As you can see, she's wearing one. He's also wearing one. I'm wearing one. And the two people in the back are wearing one. That means we can all hear you while you order your drink at the drive-thru. Good luck ordering at your next drive-thru.\"", "Both videos were real, and captured inside a Starbucks cafe. In total, both videos had been viewed 2 million times in less than 48 hours.", "Yes, customers who visit the drive-thru at a Starbucks cafe can both be seen by use of a camera and also be heard by multiple employees as they prepare orders. However, both the drive-thru camera and usage of multiple headsets are not unique to Starbucks, as fast food employees confirmed in multiple reddit threads.", "The vast majority of the comments — and the thousands of \"heart\" likes on the comments — on the second video expressed anxiety at the idea of knowing that multiple employees could listen to drive-thru orders. \"Yay the last thing I needed when I order at Starbucks is anxiety,\" one commenter submitted. \"My social anxiety will no longer let me go to a drive-thru,\" another person posted.", "One TikTok user asked: \"Do y'all collectively make fun of us while we order?\" Others answered that, yes, under some circumstances there may be some chatter amongst employees.", "While it's widely known that customers can be heard at drive-thrus via headsets so that orders can be taken, it's also true that fast food employees can hear customers before and after the employee-customer interaction occurs. Other TikTok users commented that multiple headsets were also in use at In-N-Out, Popeyes Fried Chicken, McDonald's, Raising Cane's Chicken Fingers, Wendy's, and Taco Bell.", "As for the drive-thru camera, this wasn't the first time that someone on TikTok posted videos that showed that Starbucks employees could see drive-thru customers. In February 2020, TikTok user @xoxobritttt also posted videos that showed Starbucks employees had access to a drive-thru camera. InTheKnow.com reported that she published multiple clips of customers being surprised at being sung to from the drive-thru headsets:", "https://www.tiktok.com/@xoxobritttt/video/6793474178612841734", "For further reading, we previously reported that, despite claims about Starbucks purportedly being a part of the \"War on Christmas,\" the coffee chain has sold a \"Christmas Blend\" since 1984.", "Jordan Liles is a Senior Reporter who has been with Snopes since 2016.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]