["About this rating", "In early 1998, de Niro was questioned in a large-scale French investigation of \"procuring\" prostitution after his name was mentioned by a woman questioned separately in the case.", "De Niro was not otherwise involved with the case or any other like it in 1998 or at any other time; the case centered around the charge of \"procuring\" and did not involve any children; no articles published at the time reported on a \"child sex ring\"; his connection to the case was tenuous at best.", "On 11 June 2018 a social media rumor spread that suggested actor Robert De Niro had been involved in a child sex trafficking ring:", "Robert De Niro was a client of an international prostitution ring that hired underage children for wealthy, high-profile clients.", "Given the crackdown on sex slave rings here in the states, it sheds more light on De Niro's seething hatred for Trump.#KAGhttps://t.co/Xe9b3Kl8BZ", "— ? V ? (@vannsmole) June 11, 2018", "An international prostitution ring, whose call-girls entertained the actor Robert de Niro, specialized in tricking, or trapping, star-struck teenage girls as young as 15 into selling their bodies with the promise of careers as models or actresses. Fuck De Niro. from r/The_Donald", "Clickbait sites often attach pedophilia charges to celebrities in the news to generate traffic, and in this case it was framed as the reason De Niro \"hated\" President Donald Trump. De Niro made headlines for remarks about the President delivered at the Tony Awards on 10 June 2018:", "By 12 June 2018, the \"pedophilia\" claim was virally popular on social media sites and forums. Trend-monitoring site Trendolizer flagged the rumor as having originated with the extremely dubious (and pedophilia-focused) Your News Wire:", "It appeared that De Niro's expletive-littered Tony Awards speech was the sole reason the story became popular, as the \"trending\" article was published in July 2017. It held that the actor was once linked to a prostitution ring that victimized children:", "According to court records from 1998, Independent journalist John Lichfield discovered that the prostitution agency routinely ensnared girls as young as 15, forcing them to have sex with Hollywood’s rich and powerful elite.", "While it is not clear whether or not De Niro was supplied with underage girls, his involvement in the ring received little to no media coverage.", "On 11 June 2018, the True Pundit blog published an article with the headline \"Attorney Denies Robert De Niro Was Client of Prostitution Ring With Underage Girls; Police Interrogated Star for Nine Hours.\" Readers might have missed the post's first paragraphs: \"We travel back to 1998 and things get very interesting indeed... Actor Robert De Niro’s attorney denied his client’s involvement in an international prostitution ring.\"", "As the excerpt noted in its first few paragraphs, the referenced events were cited in court documents from 1998. Your News Wire linked to a 15 November 1998 Independent article about the prosecution of six individuals in Paris, none of whom were De Niro:", "... But the evidence to be presented to a criminal court in Paris [in November 1998] also has a disturbing side — or, rather, two disturbing sides.", "The case uncovers the brutal methods used to snare young women — some as young as 15 — into a call-girl agency specialising in wealthy, high- profile clients. It also exposes attempts by the French government machine to block an investigation which might embarrass senior politicians and damage French interests abroad.", "Six people are charged with the running of an international prostitution ring, whose call-girls entertained the actor Robert de Niro, the former tennis player, Wojtek Fibak, two senior (but unnamed) French politicians and several Gulf princes. The agency specialised in tricking, or trapping, star-struck teenage girls into selling their bodies with the promise of careers as models or actresses...", "The two principal accused are Jean-Pierre Bourgeois, 51, a failed fashion and glamour photographer and Annika Brumark, 50, a Swedish former model and one-time beauty queen. They, and four others, will be charged before the Tribunal Correctionel in Paris tomorrow with procurement or complicity in procurement. (Prostitution is legal in France; procurement is not.) Mr Bourgeois also faces possible additional charges of rape.", "De Niro was referenced as a possible client of the individuals being prosecuted — evidently because his name was mentioned by one of the girls — but he was mentioned only once in passing, with no additional details provided. News articles rarely mentioned him, and in June 1997 the Associated Press reported that the charges related primarily to \"pimping\":", "While prostitution is legal in France, pimping is not.", "... Former model Annika Brumark and Jean-Pierre Bourgeois, a photographer for the soft-porn magazines Lui and New Look, have been accused of receiving fees from young prostitutes.", "The two, considered the architects of the ring, which charged between $500 and $8,600, have been in detention since January [1997], Le Monde reported.", "In February 1998, the London Independent published statements made by the actor's lawyer about his questioning by French authorities:", "French police questioned Oscar-winning actor Robert De Niro for more than nine hours in connection with the investigation of a deluxe prostitution ring and then released him without pressing charges, justice sources said.", "De Niro's attorney, former French Justice Minister Georges Kiejman ... said he would sue investigating magistrate Frederic N'Guyen for violation of secrecy during an investigation and for unlawfully hampering De Niro's movements.", "\"I was shocked and upset by the way in which he was treated in a case in which his name came up only incidentally,\" Kiejman said.", "On 6 January 1999, the BBC reported a defendant in the case was convicted of \"procuring\":", "Jean-Pierre Bourgeois, 51, was also required to pay $40,000 in damages to five young women who filed the charges that led to his arrest.", "Investigators say the ring's leaders recruited dozens of young women — described as models, students and aspiring actresses. Clients are said to have included movie producers, sports stars and Middle Eastern businessmen.", "Robert De Niro's June 2018 Tony Awards speech re-renewed interest in a 1997 and 1998 \"procuring\" prostitution case in France. Archived news items from 1997 and 1998 indicated that De Niro was questioned at length in early 1998 \"after his name was mentioned by one of the call girls,\" and the number of articles that remained accessible showed that the case did in fact receive extensive media attention and coverage... in 1998.", "None of the reporting indicated that De Niro was among the ring's clients, and although 2017 and 2018 rehashes of the case described a \"child sex ring,\" a BBC article reported that the youngest sex workers in the case were 15 and 16 years old. The age of consent in France is 15, but the word \"minors\" is used for anyone under the age of 18.", "Adl-Tabatabai, Sean.   \"Robert De Niro Was Client Of Prostitution Ring That Used Children.\"\r\n    Your News Wire.   11 June 2017.", "Lichfield, John.   \"The Sex Scandal That Wouldn't Lie Down.\"\r\n    The Independent.   15 November 1998.", "Lichfield, John.   \"Cops Grill De Niro On Prostitution Ring.\"\r\n    The Independent (via SFGate.com).   11 February 1998.", "Trendolizer.   \"Robert De Niro Was Client Of Prostitution Ring That Used Children.\"\r\n    12 June 2018.", "Associated Press.   \"Report: French Investigation Uncovers Prostitution Ring For Royalty.\"\r\n    11 June 1997.", "BBC News.   \"Prostitution Boss Jailed In France.\"\r\n    6 January 1999.", "BBC News.   \"De Niro Furious Over French Grilling.\"\r\n    24 February 1998.", "True Pundit.   \"Attorney Denies Robert De Niro Was Client of Prostitution Ring With Underage Girls; Police Interrogated Star for Nine Hours.\"\r\n    11 June 2018.", "Wikipedia.   \"Ages Of Consent In Europe, France.\"\r\n    Accessed 12 June 2018.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]