["This one-minute, eight-second video, which shows a street sign that reads “President Joko Widodo St”, has been viewed more than 1,200 times after it was posted on Facebook here on October 20, 2020.", "Translated to English, the post’s Indonesian-language caption reads: “President Joko Widodo is not a cleric and not the offspring of the Prophet...", "“He was once a carpenter from Solo, but then he was trusted by Indonesian people to be the nation's leader...", "“When Saudi Arabia names one of its major streets after Joko Widodo’s name, it is not because he is a descendant of the Prophet who is visiting the country, but it is because Saudi Arabia sees Joko Widodo as a leader of a Muslim-majority country that has now a bigger political and economic role globally...", "“Please go on, Mr President Jokowi...\n\tYou're such a great man...!!”", "“Jokowi” is the popular nickname of Indonesian President Joko Widodo.", "The video has also been shared with a similar claim on Facebook here and here.", "A pair of photos showing “President Joko Widodo St” was posted with a similar claim on Facebook here.", "The claim, however, is misleading.", "The upper left-hand side of the video shows the logo of Indonesian news portal medcom.id and the logo of the Indonesian Embassy in Abu Dhabi.", "The first few seconds of the video shows a text that says: “The UAE government inaugurates President Joko Widodo street in Abu Dhabi.”", "A keyword search found that the footage was taken from this video that was posted on the YouTube channel of medcom.id on October 19, 2020. The post is titled: “A street in Abu Dhabi named after President Joko Widodo.”", "The same video was posted on Instagram by the Indonesian Embassy in Abu Dhabi here.", "A post shared by KBRI Abu Dhabi (@kbriabudhabi) on Oct 19, 2020 at 10:51am PDT", "Abu Dhabi is the capital of the United Arab Emirates.", "Below is a screenshot comparison of the video in the misleading post (L) and the Medcom.id footage (R):", "Emirates News Agency, UAE’s official news agency, reported on October 20, 2020, about the renaming a street in Abu Dhabi in honour of Jokowi.", "The inauguration of the new street name was also reported by Indonesian state news agency Antara and English-language newspaper The Jakarta Post.", "A photo of President Joko Widodo Street was also posted on Jokowi’s official Instagram account on October 20, 2020. The caption partly says: “The street that divides the Abu Dhabi Exhibition Center district and the Embassy Area, where a number of diplomatic representatives’ offices are located, uses my name.”", "A post shared by Joko Widodo (@jokowi) on Oct 19, 2020 at 7:21pm PDT", "Below is a screenshot comparison of a photo in the misleading post (L) and the photo on Jokowi’s Instagram account (R) – AFP has circled some of the same features in green:", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]