["White House Press Secretary Jay Carney tweeted this meme about who would benefit from a minimum-wage hike. How correct is it?", "White House Press Secretary Jay Carney did his part last week to promote President Barack Obama’s proposal to raise the minimum wage from $7.25 an hour to $10.10.", "In a tweet on April 3, 2014, Carney forwarded a meme created by the White House. It read:", "\"Who will raising the minimum wage actually help? You might be surprised that: More than half are women. More than half work full-time. The average worker is 35 years old.\"", "We recently checked a similar claim about women and the minimum wage and found it Mostly True. But we thought it would be worth checking the claims that more than half of those who’d be helped by a minimum-wage increase currently work full-time, and that the average worker who would be helped is 35 years old.", "When we first looked at the data, we were suspicious. Numbers from the Bureau of Labor Statistics we had used in previous fact checks seemed to tell a different story. But as we’ll see, the White House has found another way to look at the numbers.", "When we asked the White House for their supporting data, they pointed us to a slideshow from the White House’s Council of Economic Advisers and a study by the Economic Policy Institute, a liberal group. The specific data points in the meme appear be drawn from the institute’s study.", "The Economic Policy Institute study made its calculations using data from the Bureau of Labor Statistics. Rather than studying just the people earning the minimum wage today, it looked at anyone earning less than $10.10 an hour.", "There’s some logic behind this. Raising the minimum wage to $10.10 doesn’t just raise wages for those earning $7.25 an hour, but rather for everybody earning less than $10.10.", "In addition, David Cooper, the author of the report, told PolitiFact that his calculations actually included everyone currently earning up to $11.10. That’s a dollar more than Obama’s proposed minimum wage level, but this decision was based on the assumption that anyone earning slightly above $10.10 at the time of the minimum-wage hike would also get a small boost, in order to keep them nestled correctly in a company’s wage hierarchy.", "Reasonable people can differ about the wisdom of these assumptions, but the important point for this fact-check is that doing it EPI’s way produces a starkly different image of the low-income workforce than one would get from looking just at people who earn the minimum wage today. (This data is available in a Bureau of Labor Statistics report released last month, \"Characteristics of Minimum Wage Workers, 2013.\")", "To see these distinctions in action, let’s start with the question of full-time versus part-time work.", "Hours worked per week", "EPI data (workers earning up to $11.10)", "BLS data (workers currently earning minimum wage or less)", "Less than 20", "14.2%", "22%", "20-34 hours", "32.0%", "43%", "More than 35 hours (\"full time\")", "53.8%", "35%", "This chart shows that, according to the study cited by the White House, almost 54 percent of workers earning up to $11.10 worked more than 35 hours a week, which is considered \"full time.\" That helps the White House create a sympathetic image -- a person working long hours to support themselves, rather than someone just looking for some extra spending money.", "If, however, you use the BLS report, which looks at people who currently earn the minimum wage, a much smaller share of minimum-wage workers -- just 35 percent -- worked \"full time.\" Using this data, almost two-thirds of minimum-wage workers work part time, more closely fitting the preferred image of wage-hike opponents.", "Now let’s look at age.", "First, we should note that the White House did a bit of cherry-picking. It cited EPI’s \"average\" age of 35, when the median age -- the exact midpoint in the distribution of ages -- is several years younger at 30, Cooper told PolitiFact. Now, here is the full breakdown:", "Age", "EPI data (workers earning up to $11.10)", "BLS data (workers currently earning minimum wage or less)", "Less than 20", "12.5%", "40%", "20-29", "36.5%", "31%", "30-39", "16.6%", "11%", "40-54", "20.8%", "12%", "55 and over", "13.7%", "6%", "The numbers from EPI and the White House show a noticeably older skew to low-income workers. A slight majority of workers earning under $11.10 are at least 30 years old, according to their favored data. But if you look just at minimum wage workers using the BLS data, a full 71 percent are younger than 30.", "So the White House can paint a picture of middle-aged and older Americans getting a boost from the proposal, since a majority of the people helped by a $11.10 minimum wage are at least 30 years old. At the same time, opponents of the wage hike can counter that today’s minimum-wage earners are basically kids just starting out, since a plurality of current minimum-wage earners are younger than 20.", "In other words, the predominant image of who benefits from a minimum-wage hike depends on whether you factor in, or leave out, Americans who earn between $7.25 and $10.10 an hour.", "Weighing the value of both models", "In reality, both approaches have some pitfalls.", "Even as the White House asks, \"Who will raising the minimum wage actually help?\" the meme sidesteps any mention of who might be hurt from raising the wage to $10.10.", "In February, the independent Congressional Budget Office looked at the impact of the $10.10 proposal and found both positives and negatives. On the upside, the change would raise salaries for 16.5 million people and lift 900,000 out of poverty. On the downside, total employment could be reduced -- possibly by as much as 1 million, but more likely by around 500,000. By not acknowledging this estimate, the White House presents a one-sided view of its policy proposal.", "Yet those who would cite the BLS study also have their own shortcomings to acknowledge.", "The BLS report on minimum wage workers describes only those workers making exactly the federal minimum wage of $7.25 and below. It doesn’t include workers in states with higher state minimum wages, Cooper said -- even the \"minimum wage\" worker in Missouri who makes $7.35 per hour.", "Because 21 states and the District of Columbia have state minimums that exceed the federal minimum, slightly more than half the nation’s workforce is excluded from the BLS study, making the usefulness of its data somewhat questionable.", "\"Although both approaches present reasonable ways of describing the characteristics of those that will be affected by a raise in the minimum wage, neither one necessarily properly characterizes who will be helped by a raise in the minimum wage,\" said Tara Sinclair, a George Washington University economist.", "Our ruling", "The White House meme asked, \"Who will raising the minimum wage actually help? … More than half work full-time. The average worker is 35 years old.\"", "The White House’s math is credible because it carefully framed the question as \"who gains from a minimum-wage hike to $10.10,\" rather than \"who currently earns the minimum wage\" -- a common yardstick used by its opponents. Still, the White House’s portrayal is somewhat one-sided because it leaves out the negative impacts of raising the minimum wage, which have been pointed out by such independent groups as the CBO. We rate the claim Half True.", "Jay Carney, tweet, April 4, 2014", "Economic Policy Institute, \"Raising the Federal Minimum Wage to $10.10 Would Lift Wages for Millions and Provide a Modest Economic Boost,\" Dec. 19. 2014", "White House, \"The Economic Case for Raising the Minimum Wage,\" Feb. 12, 2014", "Bureau of Labor Statistics, \"Characteristics of Minimum Wage Workers, 2013,\" March 2014", "Congressional Budget Office, \"The Effects of a Minimum-Wage Increase on Employment and Family Income,\" February 2014", "PolitiFact, \"Mitch McConnell says the minimum wage is for young people in entry-level jobs,\" Jan. 26, 2014", "PolitiFact, \"Cokie Roberts: Two-thirds of minimum-wage earners are women,\" April 2, 2014", "Email interview with David Cooper, economic analyst at the Economic Policy Institute, April 7, 2014", "Email interview with Gary Burtless, senior fellow at the Brookings Institution, April 7, 2014", "Email interview with Tara Sinclair, economist at George Washington University, April 7, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]