["About this rating", "A single study published in 2002 observed a reduction in women's brain volume during  pregnancy.", "One study is not necessarily representative of a real pattern, the sample size of the study was small, the study was designed, for a different purpose,  and there have been no efforts to replicate its results.", "In January 2002, the American Journal of Neuroradiology published a study titled “Change in Brain Size during and After Pregnancy: Study in Healthy Women and Women with Preeclampsia,” which, based on before-during-after-pregnancy MRI scans of 14 women’s brains, concluded that \"The brain decreases in size during pregnancy and increases in size after delivery. The changes follow a consistent time course in each woman.\" A six-month time period for a postpartum brain’s return to its pre-pregnancy size is also referenced in this study, so it is therefore likely that this paper was the primary source of information for the image reproduced above.", "What is less clear is how relevant this limited study is to a broader population of pregnant women. The study was originally set up to test differences in brain volume through pregnancy between nine healthy women and five women with a condition known as preeclampsia (a pregnancy disorder whose primary symptoms are high blood pressure and large amounts of protein in the urine). Lead researcher Dr. Anita Holdcroft discussed this in a 1997 New Scientist article that shared her group’s preliminary results:", "The research into brain size and pregnancy started with women who developed pre-eclampsia, a syndrome involving high blood pressure and fluid build-up that affects some pregnant women, causing their faces, legs and arms to swell. If untreated, it can lead to fatal seizures.", "“We assumed that their brains would also swell, but last year we found that they shrink,” says Holdcroft. The new research suggests that this is not a symptom of pre-eclampsia, but a normal feature of pregnancy.", "This research focus, however, demonstrated that the  limited sample size was not intended to be representative of the population at large.", "Furthermore, a 2016 review paper that (in part) searched for any study relating to changes in the shape or structure of the brain during pregnancy did not mention a single subsequent study that replicated — or attempted to replicate — the 2002 study.", "One of the main reasons the finding of pregnant brain shrinkage seems to have resonated so well on the Internet (in spite of the sparse amount of research on the topic) is that it serves, incorrectly, as a simple and tidy explanation for the mental cloudiness or forgetfulness women sometimes report during pregnancy.", "Dr. Holdcroft hinted at this connection in the New Scientist article, but the final 2002 paper published by her team five years later conceded that “the mechanism and physiologic importance of these findings are speculative at the present time.” She also mentioned in that article that the culprit for reduced brain volume was likely not caused by a reduction in the number of brain cells, but by decreases in each cell’s individual volume.", "While research has documented impairment to some cognitive functions in pregnant women, it is important to note this body of research has not demonstrated an actual decline in mental capacity. It is equally important to note that these studies do not suggest that a shrunken brain is the culprit for this effect, either.", "This subject remains one of those many gray areas (pun retroactively intended) in science — far too gray for the certainty implied by a two-sentence social media image.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]