["With his first \"state of the state\" address the night of Feb. 1, 2011, Wisconsin Gov. Scott Walker likely will tout some of his early legislative victories.\n\nAmong them: Three tax breaks worth an estimated $140 million.\n\nBut one of Walker’s political antagonists, Madison-based One Wisconsin Now, has slammed the three bills. In a Jan. 28, 2011, news release, the liberal advocacy group said:\n\n\"Gov. Scott Walker and the Republican-controlled state legislature have added over $140 million in new special interest spending.\"\n\nSo, which is it? Tax cuts or spending?\n\nWe know that state government folks are pretty crafty. But is it really possible for them to spend money they’ve decided not to tax in the first place?\n\nOne Wisconsin Now’s statement cites three of the measures taken up by lawmakers since Walker called them into special session just hours after being inaugurated on Jan. 3, 2011.\n\nHere’s a look at each of the bills and their financial impact as estimated by the Legislative Fiscal Bureau, the Legislature’s non-partisan research agency.\n\nEconomic development tax credit\n\nSigned into law Jan. 31, 2011, this bill increases the state’s economic development tax credit fund to $98.1 million, up from $73.1 million. The fund provides a tax credit for job creation, capital investment or related activity. The additional $25 million in credits is not expected to be claimed during the 2011-2013 biennium.\n\nSo, if employers create new jobs and claim the credits, they would pay less in taxes to the state. No spending would be involved.\n\nHealth Savings Account deduction\n\nAlso signed into law, this measure allows people to deduct contributions they make to Health Savings Accounts from their state income taxes, as they can from their federal income taxes. Nearly every other state already allows this.\n\nThe deductions will reduce state revenue by an estimated $20.7 million in 2011-2012 and $27.3 million in 2012-2013.\n\nTax deduction for creating jobs\n\nUnder this bill, which is awaiting Walker’s signature, employers would receive a tax deduction for each job they create. They would pay an estimated $33.5 million less per year in income and franchise taxes.  \n\nIn other words, the bill doesn’t result in any spending, but the state would take in less tax money.\n\nSee a pattern here?\n\nThe bills in question don’t create any expenditures -- those are done in budget bills, which Walker has yet to introduce. But they do mean the state will take in less money.\n\nOne Wisconsin Now says they apply to \"special interests.\" They may be targeted for specific purposes, but they also hit a wide range of people, including small business owners and any working person who has an HSA.\n\nWe asked Scot Ross, One Wisconsin Now’s executive director, how his organization could say the state would be spending $140 million when the effect of the three bills would be that the state would have $140 million less to spend.\n\nHis reply: \"When money would otherwise be in the treasury which is no longer going to be there as a result of legislative action, that is the definition of spending.\"\n\nActually, it’s just the Legislature making the treasury smaller. But we decided to ask the question again.\n\nRoss: \"If no action had been taken, this money would have been in the treasury. It will now no longer be in the treasury. We feel that is a form of spending.\"\n\nHmmm.\n\nRoss is no dummy. He has a B.A. from the University of Pittsburgh and an M.A. from George Washington University, according to a political bio. He’s worked for a number of Democratic politicos, including Wisconsin congressman Ron Kind. He even worked as a journalist.\n\nAnd Ross isn’t alone with his spending notion.\n\nDavid Riemer, who was budget director under Democratic Gov. Jim Doyle, said the concept of a \"tax expenditure\" dates back some 50 years to Stanley Surrey, an assistant U.S. treasury secretary. The idea, Riemer said, is that tax breaks with a particular purpose that could be accomplished by direct spending should be considered expenditures.\n\n\"Their way of viewing this,\" Riemer said of One Wisconsin Now, \"is a legitimate, honestly grounded approach. But there’s also legitimate arguments on the other side.\"\n\nOK, let’s go to the other side.\n\nGeorge Lightbourn, who was secretary of administration under two Republican Wisconsin governors, said that what One Wisconsin Now is claiming is \"ridiculous\" -- \"there’s nothing being spent, there’s not an appropriation being made.\"\n\n\"From a political standpoint, I could see where you’d make that argument,\" Lightbourn said, referring to One Wisconsin Now. \"But it wouldn’t hold water with the accountants.\"\n\nOr with the average taxpayer.\n\nWe decided to try Ross a third time. This time, he tried to make his case by pointing out that Walker had described the federal stimulus bill as spending, even though the bill included tax cuts.\n\nTax cuts and credits did make up about one-third of the $862 billion stimulus-- but two-thirds was spending.\n\nThree strikes is enough.\n\nOne Wisconsin Now called $140 million in state tax breaks \"spending.\" It’s estimated that the three bills in question would bring in $140 million less to state coffers. But that’s not spending. You can’t spend what you don’t have.\n\nWe rate the statement Pants on Fire.", "Update: The day this PolitiFact item, One Wisconsin Now executive director Scot Ross modified the way he described the three tax break bills. Rather than calling them spending, he said in a news release issued by the liberal Citizen Action of Wisconsin that the bills are \"deficit-hiking corporate giveaways.\"", "One Wisconsin Now, news release, Jan. 28, 2011\n\nInterview, Scot Ross, One Wisconsin Now executive director, Jan. 28, 2011\n\nE-mail interview, Cullen Werwie, Gov. Scott Walker spokesman, Jan. 28, 2011\n\nWisconsin Legislative Fiscal Bureau, Health Savings Accounts bill memo, Jan. 18, 2011\n\nWisconsin Legislative Fiscal Bureau, job creation tax breaks memo, Jan. 20, 2011\n\nWisconsin Legislative Fiscal Bureau, economic development tax credit, Jan. 7, 2011\n\nMilwaukee Journal Sentinel, Walker signs bill limiting court awards in injury cases, Jan. 27, 2011\n\nMilwaukee Journal Sentinel, Walker signs HSA measure; budget repair bill planned, Jan. 25, 2011\n\nMilwaukee Journal Sentinel, Tax cut for job creators advances, Jan. 25, 2011\n\nWall Street Journal, Why I’m not lining up for stimulus handouts, Feb. 28, 2009\n\nThe New York Times, The stimulus plan: How to spend $787 billion, Jan. 29, 2011\n\nInterview, Ron Shanovich, Wisconsin Legislative Fiscal Bureau analyst, Jan. 31, 2011\n\nInterview, Rick Olin, Wisconsin Legislative Fiscal Bureau analyst, Jan. 31, 2011\n\nJSOnline.com, Walker signs bill that eliminates taxes for relocated businesses, Jan. 31, 2011\n\nCongressional Budget Office, The American Recovery and Reinvestment Act of 2009\n\nInterview, David Riemer, former state budget director under Democratic Gov. Jim Doyle, Jan. 31, 2011\n\nInterview, George Lightbourn, former State of Wisconsin Department of Administration secretary under Republican governors Tommy Thompson and Scott McCallum, Jan. 31, 2011", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]