["About this rating", "In April 2020, we started receiving queries from readers who were under the impression that Alex Trebek, the long-time host of the game show Jeopardy, had died and left a large portion of his fortune to U.S. President Donald Trump's 2020 re-election campaign. We were concerned at first — Trebek, after all, has truly been battling cancer for the last year. But then we noticed this rumor was a little too familiar.", "In January 2020, for instance, we debunked a false rumor claiming that Bob Barker had died and left his fortune to Trump. We've also covered similar japes about politician Ross Perot and actor Lee Majors.", "These stories all come from America's Last Line of Defense (LLOD), a network of \"satire\" websites that includes URLs such as PotratriotsUnite.com, Tatersgonnatate.com, and ConservativeTears.com.  While these sites have all trafficked in LLOD's trademark brand of conservative trolling, the latter website now seems primarily focused on mad lib-style death hoaxes.", "The formula appears to go something like this: \"[Celebrity name] dies and makes [pro-Trump action] after death.\" The most common \"pro-Trump action\" in these hoaxes appears to be the bequeathment of a personal fortune to Trump's re-election campaign.", "We perused the pages of Conservative Tears and found pro-Trump death hoaxes that unceremoniously killed celebrities such as Bill Murray, Arsenio Hall, Ringo Starr, and Tom Hanks:", "These are not genuine news stories about pro-Trump celebrities passing away and leaving their fortunes to the president's 2020 re-election campaign. These stories all come from a website that labels itself as satire.", "A disclaimer on Conservative Tears reads:", "Everything on this website is fiction. It is not a lie and it is not fake news because it is not real. If you believe that it is real, you should have your head examined. Any similarities between this site’s pure fantasy and actual people, places, and events are purely coincidental and all images should be considered altered and satirical. See above if you’re still having an issue with that satire thing.", "The website also carries a banner that notes the site is full of \"death hoaxes for your thoughts and prayers.\"", "In short: If you hear a rumor about a celebrity dying and leaving a fortune to Trump's re-election campaign, it may be a false rumor that originated with the website Conservative Tears.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]