["The photos were published here on Facebook on June 23, 2020. The post has been shared more than 1,400 times.", "The caption reads: “Singapore today due to heavy rain from morning till afternoon”.", "The photos were also published alongside similar claims on Facebook here and here.", "However, the claim is misleading; most of the photos have circulated in reports about flooding since at least 2009.", "The first image of a man stretching out of a vehicle on a flooded street has circulated in reports since at least November 2009.", "Reverse image searches on TinEye and keyword searches on the National Library Board, Singapore's national archive, found that the photo was published in the November 20, 2009 edition of The Straits Times newspaper.", "The photo was also published here on image-hosting platform Flickr on November 20, 2009. According to the photo's caption, the picture was taken in Bukit Timah, is a district in central Singapore.", "Below is a screenshot comparison between the first photo in the misleading Facebook post (L) and the 2009 The Straits Times photo (R):", "A reverse Google image found the second photo, which shows a car driving through a flooded street, published here in a 2018 article by the Singapore-based news outlet AsiaOne.", "The January 8, 2018 article is titled “Vehicles stuck in flash floods that hit several parts of Singapore”. The photo's caption reads: “Vehicles on the flooded road at the junction of Upper Changi and Bedok North Ave 4.”", "The junction can be seen here on Google Street View.", "Below is a screenshot comparison between the second photo in the misleading Facebook post (L) and the 2018 AsiaOne photo (R):", "A Google reverse image search found that the third photo was published here in a 2017 The Straits Times article headlined “Flash floods and jams as rain blankets Singapore”.", "The January 24, 2017 report’s photo caption reads: “Flash floods occurred in several places yesterday, including the area near Haw Par Villa MRT station. Experts say the rain is typical for this time of the year, when the region is in the grip of the north-east monsoon.”", "The station can be seen here on Google Street View.", "Below is a screenshot comparison between the third photo in the misleading Facebook post (L) and the 2017 The Straits Times photo (R):", "A reverse image search on Tineye found that the photo of several vehicles driving through deep waters was published in this The Straits Times article titled “$1.2b FLOOD CONTROL”, which was published on January 18, 2018.", "The photo caption reads: “Heavy rains in Singapore caused flooding at junction of Upper Changi and Bedok North Ave 4 on Jan 8, 2018.”", "The image is credited to The Straits Times photographer, Alvin Ho.", "Below is a screenshot comparison between the fourth photo in the misleading Facebook post (L) and the 2018 The Straits Times photo (R):", "A reverse image search on TinEye found this photo was published on a Singapore-based blog called Mr.Brown.com on June 16, 2010.", "The blog post is titled: “Someone call the Minister of Freak Incidents! Orchard Road flooding!”. The post credits the photo to Twitter user @peiwenl.", "Below is a screenshot comparison between the fifth photo in the misleading Facebook post (L) and the 2010 photo on Mr.Brown.com (R):", "This photo of a blue car at a flooded junction has circulated in reports about recent floodings.", "A Google reverse image search found this article published by Berita Harian Singapura, a Singapore-based Malay newspaper, on June 24, 2020.", "The article’s Malay headline translates into English as: “Some parts of Singapore were flooded”. It credits the photo to a Singapore-based Facebook page, Singapore Road Accident.", "The photo caption translates to English as: “AFFECTED: Among the flooded areas are Upper Changi Road and Bedok North Ave 4”.", "Below is a screenshot comparison between the sixth photo in the misleading Facebook post (L) and the Berita Harian Singapura photo (R):", "Singapore did experience widespread flooding on June 23, 2020. Singapore’s National Water Agency issued this statement on its official Facebook page the same day regarding the relief operations.", "AFP also debunked another photo that was used to make a similar claim that it showed flooding in Singapore.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]