["Rep. Ilhan Omar, D-Minn., speaks as she introduces the Zero Waste Act at the Capitol in Washington, Thursday, July 25, 2019. (AP Photo/J. Scott Applewhite)", "The Progressive, a 110-year-old national magazine based in Madison, Wis., calls itself \"a voice for peace, social justice, and the common good!\"", "It published an article Dec. 1 about Rep. Ilhan Omar saying the Democratic Minnesota congresswoman \"wants to redefine U.S. foreign policy as we know it.\"", "Omar elaborated on her philosophy by addressing military spending.", "\"We can fight to have our Green New Deal. We can certainly get Medicare for All. We can cancel out student debt. We can certainly pass our Housing for All bill. We can get a universal school meals program up and running,\" she said.", "\"But in order to do all of those things, we have to stop policing the world, right? We have to not have over 800 military bases around the world. We have to not spend 57 cents on the dollar on defense.\"", "Omar’s major claim is wrong.", "Defense spending accounts for only 15% of the federal budget.", "In 2015, we rated as False a claim that 57% of federal spending goes to the military and just 1% goes to food and agriculture, including food stamps.", "Rather than being dominated by the military, the budget was actually dominated by spending on Social Security, Medicare and Medicaid, we found.", "At the time, military spending, including spending on homeland security, accounted for 54% of discretionary spending — that is, not-mandatory spending.", "But it accounted for only 16% of federal spending overall.", "\"This is a common mistake,\" Robert Bixby, executive director of the centrist Concord Coalition, which works for fiscal responsibility, said about Omar’s claim.", "In fact, a spokesman for the congresswoman said Omar was referring to discretionary funding. He cited a Washington Post article that says defense would be 57% of discretionary spending in the 2020 federal budget request unveiled by President Donald Trump in March 2019.", "The percentage of the total federal budget spent on defense has been in the same range for years.", "2007: 19%, FactCheck.org found", "2011: About 25%, according to the Washington Post Fact Checker", "2017: 15% according to the liberal Center on Budget and Policy Priorities", "Currently, about 17% of the federal budget goes toward defense, according to the nonpartisan Congressional Budget Office — a figure confirmed to us by Marc Goldwein of the Committee for a Responsible Federal Budget.", "The Peter G. Peterson Foundation puts the figure there, too, at 15%.", "As for the dollars, the 2018 federal budget contained, according to a June 2019 report by the Congressional Budget Office:", "• $1.3 trillion went to discretionary spending, including $600 billion for defense. That would be about 46%.", "• Total outlays were $4.1 trillion, with defense getting $623 billion. That’s 15%.", "The 15% figure also holds true for 2019, as well.", "Omar said the U.S. spends \"57 cents on the dollar on defense.\"", "Overall, defense accounts for about 15% of the federal budget.", "Her figure is roughly in the ballpark when considering only discretionary federal spending, but she did not say that.", "We rate Omar’s statement False.", "The Progressive, \"Ilhan Omar and the Politics of ‘Radical Love,’\" Dec. 1 2019", "Email, Rep. Omar Ilhan spokesman Jeremy Slevin, Dec. 13, 2019", "PolitiFact, \"Pie chart of 'federal spending' circulating on the Internet is misleading,\" Aug. 17, 2015", "FactCheck.org, \"Ben & Jerry’s Misleading Spending Chart,\" Dec. 9, 2007", "Washington Post Fact Checker, \"Fact-checking Americans on the budget,\" March 12, 2011", "Center on Budget and Policy Priorities, a liberal think tank, \"Policy Basics: Where Do Our Federal Tax Dollars Go?\" Jan. 29, 2019", "Congressional Budget Office, \"Defense and National Security,\" Dec. 13, 2019", "Congressional Budget Office, \"Discretionary Spending in 2018: An Infographic,\" June 18, 2019", "Congressional Budget Office, \"The Federal Budget in 2018: An Infographic,\" June 18, 2019", "Congressional Budget Office, \"Monthly Budget Review: Summary for Fiscal Year 2019,\" Nov. 7, 2019", "Peter G. Peterson Foundation, a fiscal policy-focused think tank, \"U.S. Defense Spending Compared To Other Countries,\" May 3, 2019", "Email, Marc Goldwein, senior vice president and senior policy director for the Committee for a Responsible Federal Budget, Dec. 13, 2019", "Washington Post, \"What Trump proposed in his 2020 budget,\" March 12, 2019", "Email, Robert Bixby, executive director of the centrist Concord Coalition, which works for fiscal responsibility, Dec. 13, 2019", "Email, Steve Ellis, executive vice president of Taxpayers for Common Sense, which tracks federal spending, Dec. 13, 2019", "Email, former U.S. Senate Budget Committee staff member Gordon Gray, who is director of fiscal policy at American Action Forum, which describes itself as a center-right think tank, Dec. 13, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]