["“सुना है कि ब्रह्मांड के इकलौते ईमानदार पत्रकार रविश कुमार की बहन भ्रष्टाचार मामले में नौकरी से सस्पेंड हो गई है। बेचारे का भाई पहले ही सेक्स रैकेट में आरोपी है। (Have heard that universe’s only honest journalist, Ravish Kumar’s sister got suspended in a matter of corruption. Poor brother is already an accused in sex racket case -translated)”", "This is the message which has been posted by India 272+, a Facebook Page which was part of the BJP’s 2014 election campaign. It has been shared more than 10,000 times and ‘liked’ more than 7,700 times since it was posted on September 20.", "ब्रह्मांड के इकलौते ईमानदार पत्रकार", "Posted by India272+ on Thursday, 20 September 2018", "Many individual Facebook users have also shared the same claim.", "Alt News had debunked the claim about Ravish Kumar’s sister getting suspended on charges of corruption in April last year, when fake news websites like Newsloose, TrollIindianpolitics, and Dainik Bharat had circulated a fake news story.", "In a conversation with Alt News, Madhukar Pandey, brother of Neeta Pandey, the woman claimed to be Ravish Kumar’s sister who had been suspended for graft, asserted that the woman in this picture is his elder sister and is not in any way related to Ravish Kumar. Pandey had clarified the same on his Facebook account.", "Prashant Patel Umrao, who is known for peddling misinformation on social media had also tweeted the same claim, which he has not deleted yet.", "Nita Kumari Pandey, Sister of Ravish Kumar who was working as District Program Officer in Muzaffarpur, is suspended on Corruption charges.", "— प्रशान्त पटेल उमराव (@ippatel) April 1, 2017", "With regard to the allegation that Ravish Kumar’s brother is involved in a sex racket, the page is probably referring to the sexual offence registered against Brajesh Kumar. An article published by Business Standard on October 30, 2017 had reported, “In December 2016, an FIR was registered by the alleged victim for outraging her modesty, criminal intimidation and various other sections of IPC, SC/ST Act and Protection of Children from Sexual Offences Act (POCSO). The name of Brajesh Kumar subsequently figured during the investigation in the statements made by the complainant.” Brajesh Kumar, brother of Ravish Kumar was granted interim anticipatory bail by the Supreme court on the ground that his name had not been mentioned in the FIR. Furthermore, there was lack of material against the accused to disqualify him to the relief of anticipatory bail said the bench of Justices A K Sikri and Ashok Bhushan. The matter is currently sub-judice.", "Ravish Kumar has regularly been targeted by several entities who attribute false quotes to him on social media. The right-wing social media army works overtime to malign Kumar, often posting the same content intermittently, which is subsequently shared by thousands of social media users. Despite clarifications to the contrary, this activity is unceasing.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]