["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Gov. Scott Walker, shown here visiting a plant in Platteville, has touted his jobs record. (Milwaukee Journal Sentinel photo)", "Jobs have been a constant theme for Gov. Scott Walker -- and a persistent point of attack from his opponents.", "In the run-up to the state Democratic Party convention, Gov. Scott Walker issued a string of 10 claims about the state’s economy on Facebook and Twitter.", "The first one caught our attention.", "\"FACT CHECK: Despite the rhetoric from Democrat politicians, more people are employed this year than at any point in the history of Wisconsin,\" Walker tweeted June 3, 2016.", "We’re in the fact-checking business, of course. And we closely followed Walker’s 2010 campaign promise to create 250,000 private-sector jobs in his first term. In the end, the number totaled 146,795. We rated it Promise Broken.", "So, is employment really at an all-time high?\n\nLooking at the numbers", "When asked for backup, Walker’s team sent us to the U.S. Bureau of Labor Statistics and its Local Area Unemployment Statistics report, the gold standard for statewide employment data. We looked at employment numbers going back to the 1930s.", "The agency counts someone as employed if during the week examined they did any work as a paid employee, work for their own business or farm, or worked 15 or more hours unpaid for an enterprise operated by a family member. People who had a job but were not working because of vacations, illness or other reasons are counted as employed.", "In March of 2016, the most recent date for which figures are available, more than 3 million people were employed -- the highest ever. Previously, the employment number peaked in 2008 at around 2.9 million.", "We wondered how many other states could make the same claim.", "Of the 12 states in the Midwest, six others are also at their highest number of employed persons, for seven in all. (Wisconsin, Minnesota, South Dakota, Indiana, Missouri, Kansas, Nebraska.)", "Some of that can be attributed to population growth. In 2015, the U.S. Census Bureau estimated Wisconsin’s population at 5.7 million, up from 5.6 million in the 2010 census and up from 5.3 million in 2000.", "During the last 10 years, Wisconsin’s population grew 3.7 percent, while over the same period employment grew 2.4 percent. In the last five years, population grew 1.1 percent and employment increased 6.3 percent.", "\"Population growth plays a role in driving employment higher, which is why many economists like looking at things like the unemployment rate as a measure of the health of the labor market,\" said Brian Jacobsen, chief portfolio strategist for Wells Fargo Funds Management.", "As of March, the state’s unemployment rate sat at 4.5 percent, down from recession highs of over 9 percent.", "The unemployment rate itself is an imperfect measure. The rate does not include people who have dropped out of the labor force and stopped looking for work, nor does it consider job quality -- that is people who are considered \"underemployed.\"", "By that measure, in the late 1990s and early 2000s, employment was down in the 3 percent range.", "Our rating", "Walker said \"more people are employed this year than at any point in the history of Wisconsin.\"", "Employment figures from the Bureau of Labor Statistics back up his point, but the picture is more complex than he suggests and economists generally prefer a different measure -- the unemployment rate -- that accounts for population growth over time.", "We rate the claim Mostly True.", "Twitter, Tweet from Scott Walker, June 3, 2016.", "PolitiFact Wisconsin, Walk-O-Meter, create 250,000 new jobs, accessed June", "New York Times, Which labor market data should you believe?, June 13, 2016.", "Phone interview with Tom McDonald, economist, Office of economic analysis and information, Chicago, Bureau of Labor Statistics, June 13, 2016.", "Phone interview with Laura Dresser, associate director, Center on Wisconsin Strategy, June 16, 2016.", "Email exchange with Tom Evenson, Deputy communications director, Gov. Scott Walker, June 2016.", "Email exchange with Steve Durlauf, professor of economics, University of Wisconsin-Madison, June 2016.", "Email exchange with Tyler Tichenor, Department of Workforce Development, June 2016.", "Email exchange with Brian Jacobsen, Chief portfolio strategist, Wells Fargo, June 2016.", "United States Census Bureau, Quick Facts Wisconsin, accessed June 15, 2016.", "Department of Workforce Development, news release, BLS data: Wisconsin unemployment rate drops to 4.4%, May 19, 2016.", "Center on Wisconsin Strategy, Wisconsin Job Watch, April 2016.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]