["About this rating", "The speaking appearance of Muslim attorney and Gold Star father Khizr Khan at the 2016 Democratic National Convention, at which he criticized Republican nominee Donald Trump for his lack of empathy for immigrants, unleashed a firestorm of rebukes and attempts to discredit him, including unsubstantiated allegations that Khan has \"deep legal and financial connections\" to Democratic nominee Hillary Clinton.", "One of those attempts hinged on an image (see below) purporting to show a Wells Fargo bank statement in the name of Khan's law firm which lists a $375,000 wire transfer from The Clinton Foundation, Bill Clinton's nonprofit organization devoted to addressing global issues. Exactly how and where it originated is unknown, but the image made one of its first appearances on a page dated 4 August 2016 on the Get Off the BS web site, where it was introduced as follows:", "Well now with some help from a member of the awesome freedom fighter group Anonymous, we have some more interesting information about Mr. Khan and his unethical connection with Crooked Hillary and her charitable money laundering foundation–did we say that?", "Due to litigation concerns [no doubt a lawsuit is forthcoming – screw you Khan] we are not going to make other comments than to use your own imagination what this payment is for.  We will open up comments so that you can discuss this matter among yourselves.", "“Hey girl, we have been monitoring one of several bank accounts for Khan’s law firms.  Attached, please take a hard look at the payment from Clinton’s foundation to Khan’s law firm.  Should not take a MBA to figure what he was paid for.  Enjoy.”", "The document appears to be a Wells Fargo Business Market Savings account statement for the KM Khan Law Office, address listed as 415 Madison Ave., Suite 1500, New York, NY. In the transaction history is an 8/1 \"Clinton foundation incoming wire\" entry credited in the amount of $375,000. One of the first things you'll note about the document, however, is that it's heavily redacted — so heavily that you can't even find a complete date on it anywhere. The second thing you'll notice, if you look carefully, is that the business name is listed twice in the document, and the listings don't match.", "First it's listed as \"KM KHAN LAW OFFICE\":", "Then it's listed as \"JM KHAN LAW OFFICE\":", "At some point as the image was being passed around and reposted, someone noticed the discrepancy and created a new version:", "But if you'll notice, the new version has a defect as well: \"KM KHAN LAW OFFICE\" — singular — has now become \"KM KHAN LAW OFFICES\" — plural.", "This forged document — pick your favorite version, it doesn't matter — would have been laughed out of a court of law. Indeed, the \"evidence\" is so inconsistent that it's hard to believe anyone could mistake it, much less try to pass it off, as real. Needless to say, it doesn't prove that Khizr Khan received $375,000 from the Clinton Foundation; all it proves is that someone wants you to think he did.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]