["About this rating", "In November 2017, during Veteran's Day weekend, a photograph showing a group of former U.S. military members who had been deported from the United States went viral. Some viewers regarded the image with equal parts skepticism and dismay: Was the United States really deporting veterans?", "Although the photograph went viral during the 2017 Veteran's Day holiday, it was actually taken a few months prior, on 29 May (during another remembrance-related holiday, Memorial Day weekend) by Herika Martinez, a photographer and published by the international news agency Agence France-Presse (AFP). At the time, AFP shared the image on Twitter with the following description:", "Mexicans who served in US Army with the promise of becoming citizens but ended up being deported, protest on Memorial Day in Ciudad Juarez pic.twitter.com/nRSpFAx8Ie", "— AFP news agency (@AFP) May 30, 2017", "Getty Images used a similar caption for this photograph and added that the men pictured were veterans of the Vietnam and Iraq wars.", "Sgt. Ivan Ocon, who is standing at the front in this photograph, was born in Juarez but came to live in New Mexico as a child. He served in the U.S. Army from 1997 to 2004 and was deployed with Operation Iraqi Freedom in 2003. He was deported in 2016 and now heads the Deported Veterans Support House in Juárez.", "Ocon told us that the Memorial Day photograph captured the group of veterans honoring other fallen soldiers:", "Our intention was to pay honors to our fallen comrades, and give honor to all the fallen soldiers, brothers in arms. We're still veterans, and we would celebrate that holiday in the United States, but because we are here we just celebrated in our own way, you know? The irony is, the American Flag is right over the bridge -- but we can't go there.", "Ocon said that being deported means that even honorably discharged veterans cannot access government benefit programs they may desperately need, such as those offering educational opportunities and health care. They still qualify for those benefits, but to use them they have to appear at hearings and meetings in person -- in the United States. \"When you get deported they basically cut you off from everything,\" he told us. \"We're still veterans at the end of the day, and [we] served a country that wasn't truly ours.\"", "The Juárez chapter has about twenty active members, but more such veterans need help. Donations of money or clothes are always welcome, said Ocon: \"If people are in the Las Cruces or El Paso area and they want to donate clothes, contact us and we'll arrange something. If we don't use it we can donate it to other people that need it.\"", "Serving in the United States military does fast-track citizenship applications under some circumstances, but it is not an automatic guarantee of such, which many non-citizen military members do not realize until it is too late for them to take advantage of the program.", "Furthermore, although this photograph (as well as the term \"deported veterans\") may be jarring to many, it does not depict a recent development. In 2004, the Deported Veterans Support House -- also known as \"The Bunker\" — was established in Tijuana, Mexico to provide aid and financial, health, and emotional support to veterans who have been deported from the United States:", "Since 1996, the United States Government has been deporting veterans who, as legal permanent residents, joined the United States Armed Forces and served their country proudly. Veterans who have been deported served in wars such as Vietnam, Persian Gulf, Kosovo, Iraq & Afghanistan, and served in both combat and peacetime. The deported veterans support house has come into contact with over 100 veterans who have been deported or being deported to over 30 countries of origin around the world. All of these veterans had legal residency status, Veterans Administration (VA) Benefits as well as strong ties to the United States prior to deportation. All of the veterans whom we have met maintain a strong desire to return to the United States, as many have hardly known any other home throughout their lives and have been forced to leave behind children, spouses, parents, and siblings as well as firmly established lives and communities in the United States.", "Several other Deported Veterans Support Houses have been established, from across the northern Mexico border to Haiti and Jamaica.", "TaskandPurpose.com, a military web site, published an article about the issue in 2015, and other news outlets such as CNN, the Los Angeles Times, NPR, and Fox News, have been covering the issue for years.", "We have also received queries about whether it is true in general that the United States is deporting veterans of its military forces. The answer, as you might have guessed, is yes, it is.", "Clark, James.   \"Desperate To Return Home, Deported Veterans Face Exile.\"\r\n    Task and Purpose. 17 December 2015.", "Ramirez, Gabe.   \"Deported Veterans Fight to Return 'Home' from Mexico.\"\r\n    CNN. 26 April 2016.", "Duara, Nigel.   \"When Serving in the U.S. Military Isn't Enough to Prevent Deportation.\"\r\n    Los Angeles Times. 27 March 2016.", "Sager, Rebekah.   \"U.S. Veterans Deported to Mexico Organize Near Border, Look for a Way Back Home.\"\r\n    Fox News.   13 April 2016.", "ACLU.   \"ACLU Report Details How U.S. Has Failed Deported Veterans.\"\r\n    6 July 2016.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]