["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "• The situation is not similar to Hunter Biden’s appointment to the board of a Ukrainian energy company, Burisma.", "• Paul Pelosi Jr. once served on the board of an American energy company, Viscoil. After he left the board, the company dissolved and re-formed in Singapore under a different name.", "• Pelosi Jr. had no part in the new entity, which is not is not based in Ukraine. It’s unclear to what extent the company has done any business in Ukraine.", "Does House Speaker Nancy Pelosi, D-Calif., have a Ukraine problem? Conservative social media is saying so.", "\"Nancy Pelosi's Son Paul Jr. Was Exec at 'Ukraine-Based Gas Company,' Similar to Hunter Biden,\" reads a headline on the website founded by conservative radio host Wayne Dupree on Oct. 4, 2019.", "The story asserts the following:", "The Democrats are treating the Ukraine like \"Ziprecruiter.com\" for their lazy, do-nothing privileged kids.", "A new report out reveals that Nancy Pelosi’s son Paul Pelosi also worked as an exec at a gas company with strong ties to the Ukraine, similar to Hunter Biden.", "How deep does the Dem/Ukraine corruption go, for crying out loud? We’re going to need bigger shovels to dig through this never-ending mess.", "The bombshell report reveals that Paul Pelosi Jr. visited Ukraine in 2017 to meet with government officials in regards to a business initiative.", "In recently unearthed records, we now know that Paul Pelosi Jr. was an executive of a gas industry company that did a lot of business in Ukraine – a lot – and his mother Nancy Pelosi was even featured in one of the company’s promotional videos.", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "We previously fact-checked a similar claim and found it to be incorrect. Here too, we found no evidence that Pelosi Jr. served as an executive for a Ukraine-based gas company.", "• The situation is not similar to Hunter Biden’s appointment to the board of a Ukrainian energy company, Burisma.", "• Paul Pelosi Jr. once served on the board of an American energy company, Viscoil. After he left the board, the company dissolved and re-formed in Singapore under a different name.", "• Pelosi Jr. had no part in the new entity, which is not is not based in Ukraine. It’s unclear to what extent the company has done any business in Ukraine.", "WayneDupree.com did not respond to an inquiry for this article.", "The source appears to be an Oct. 3 tweet from Patrick Howley, a conservative writer who publishes material at the website nationalfile.com.", "\"BOOM: Nancy Pelosi's son Paul Pelosi Jr. (who went to Ukraine in 2017) was a board member of Viscoil and executive at its related company NRGLab, which DID ENERGY Business in UKRAINE!\" Howley said in the tweet, which has been retweeted almost 14,000 times. \"And Nancy Pelosi appeared in a promotional video for the company!\"", "As evidence, Howley linked to two YouTube videos published March 5, 2013. The first shows Paul Pelosi Jr. speaking at an event in Washington.", "The video opens with clips of a speech from Nancy Pelosi and then shows Paul at an XPRIZE Foundation competition in September 2010. The nonprofit group organizes public competitions with businesses to encourage their technological development.", "RELATED STORY: PolitiFact's Trump-Ukraine-Biden coverage in one place", "\"My name’s Paul Pelosi, of course I’m on the board of Viscoil, and Viscoil’s here today to talk about accelerating the future,\" he says during the video.", "Viscoil was a California-based holding company that dissolved in 2010. An old version of the company's website said the company was created to \"engage in research and in the commercial development of hydrocarbon production methods and technologies.\"", "After it shuttered, Viscoil was folded into NRGLab, a Singapore-based company \"specializing in different areas of scientific research.\" It appears to have published the YouTube videos.", "The second video Howley posted shows Walter Afanasieff, a Brazilian-American musician, talking about how technology could improve oil extraction. The caption lists other artists that had promoted Viscoil’s work, including Mika Newton, a Ukrainian singer and actress.", "\"Mika Newton helped to secure the rights to build a plant for the production of SH-boxes in Ukraine,\" the caption reads. An SH-box is a kind of environmentally friendly generator, according to NRGLab.", "We found a Facebook page on which Newton has promoted NRGLab’s work, but we could find no news coverage about the company's dealings in Ukraine. NRGLab does not mention the country on its website. We reached out to the company for more information but did not get a response.", "Drew Hammill, a spokesman for Nancy Pelosi, told PolitiFact last year that Paul Pelosi Jr. worked for Viscoil for a short time. He denied that it had any dealings in Ukraine when he was working for the company.", "\"The company was based in Southern California and focused solely on U.S. business,\" he told PolitiFact in an email. \"The company later reorganized under a different name, but Paul Pelosi Jr. played no role in the new entity.\"", "The timeline Hammill offered fits the evidence we’ve seen.", "In addition, the WayneDupree.com article cited a TV appearance Pelosi Jr. made on Ukrainian television in 2017.", "But while Pelosi was indeed in Ukraine at the time, there is no evidence to support that he was there while working as an executive for a Ukraine-based gas company.", "Paul Pelosi Jr. appears on Ukrainian television in 2017", "For starters, the TV interview did not mention anything about energy or gas companies.", "On the Ukrainian show, Pelosi Jr. said that it was his first visit to Kyiv, and it involved his employment as executive director of the Corporate Governance Initiative, specifically a partnership on youth soccer involving the World Sports Alliance and the Ukrainian government. The Corporate Governance Initiative says its mission is to help organizations \"adhere to a system of guidelines, practices, and procedures by which a company is directed and controlled.\"", "Pelosi Jr.’s mention of the World Sports Alliance came about two years before one of its top executives, Asa Saint Clair, was indicted in November 2019 for using the \"World Sports Alliance, a sham affiliate of the United Nations, as a vehicle to defraud lenders\" through a cryptocurrency scheme, according to the Justice Department.", "In a 2016 news release, Saint Clair touted the Corporate Governance Institute’s governance principles and described Pelosi Jr. as \"a longtime associate, both business and personal.\" Pelosi Jr. is quoted at length in the news release.", "Nancy Pelosi’s office confirmed that at the time of the Ukraine trip, Pelosi Jr. was working for the Corporate Governance Institute, and that the connection to the World Sports Alliance came from the alliance’s endorsement of the institute’s corporate governance principles. Her office said that Pelosi Jr. did not do any work for the World Sports Alliance and was not paid by them.", "None of this changes the claim in the headline — that \"Nancy Pelosi's Son Paul Jr. Was Exec at 'Ukraine-Based Gas Company,' Similar to Hunter Biden.\"", "Social media posts said that \"Nancy Pelosi's Son Paul Jr. Was Exec at 'Ukraine-Based Gas Company,' Similar to Hunter Biden.\"", "Pelosi Jr. served on the board of Viscoil, a company that was not based in Ukraine. After Pelosi Jr. was off the board, a Ukrainian singer is alleged to have promoted the company. Separately, Pelosi Jr. visited Ukraine, but there is no indication that he went there to conduct energy business.", "We rate the statement False.", "WayneDupree.com, \"Report: Whoops, Nancy Pelosi's Son Paul Jr. Was Exec at 'Ukraine-Based Gas Company,' Similar to Hunter Biden,\" Oct. 4, 2019", "PolitiFact, \"Pelosi, Romney and Kerry don’t have sons working for companies linked to Ukraine,\" Oct 10, 2019", "The American Mirror, tweet, Sept. 27, 2019", "Press release, \"CEO of the VO2 Group Asa St. Clair officially endorses the Corporate Governance Initiative calling for collaboration from the World Sports IGO and its 33 member nation,\" Dec. 23, 2016", "Press release, \"The Corporate Governance Initiative Picks Paul Pelosi Jr As Its New Executive Director,\" Feb. 1, 2017", "Justice Department, \"President Of Purported Intergovernmental Organization Indicted For Cryptocurrency Scheme,\" Nov. 6, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]