["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Remember when you could roll around in the grass and not have to worry that a tick bite would leave you with aching joints that make you feel like you’re 80 years old?\n\nLyme disease changed that. Now we have to worry that a tick the size of a poppy seed might cause an infection that mimics the flu and can cause muscle and joint pain. It can also lead to serious long-term health problems.\n\nTo help combat Lyme disease, state Sen. Susan Sosnowski of South Kingstown proposed legislation that would authorize the Rhode Island Lottery to sell \"Scratch-A-Tick\" scratch tickets, with the proceeds going toward prevention and research.\n\nWhat caught our eye was the assertions in her news release that \"Lyme disease is one of the fastest growing infectious diseases in the United States, and Rhode Island has the second-highest incidence of this disease in the country.\"\n\nThe Centers for Disease Control and Prevention in Atlanta, which tracks diseases in the United States, doesn't rank infectious diseases by growth rate.\n\nBut the CDC does release annual reports on the number of cases. We took their numbers and did some additional math.  We picked 2008 -- the most recent online report -- and looked at growth rate of infectious diseases from 2004. While there were higher growth rates for much rarer diseases, such as measles, in terms of the actual number of additional cases, Lyme ranked third.\n\nBecause she couched her language, the first part of Sosnowski’s statement was true.\n\nThe second question is whether Rhode Island really ranks second in incidence of Lyme cases nationwide. We were intrigued by that figure because we had heard that the disease has become very common in other parts of the country. (Lyme was first identified in 1975 in Lyme, Conn., but scientists believe it has been around for at least a century -- and maybe since the last Ice Age.)\n\nThe CDC gave us state statistics from 2005 to 2009, and we found earlier numbers, showing that Rhode Island isn't even near the top among states where Lyme is common.\n\nThe numbers showed that Rhode Island was number two in the country in 2002 (behind Connecticut) and number one in 2003.\n\nBut since then, our ranking has declined. Six states -- Delaware, Connecticut, Pennsylvania, New Jersey, New York and Massachusetts -- beat us out in 2004. We went back up to fourth in 2006, but in the other years after 2004, we ranked 13th or lower.\n\nIn 2009, the CDC numbers showed, a dozen states had a higher rate of confirmed cases of Lyme than Rhode Island. Nine states had rates that were double our rate of 142 cases per million people.\n\nIn other words, these days we're not even close to being second.\n\nSo we contacted Sosnowski. She said her statement was based on a July 2003 news release from the Lyme Disease Association of Rhode Island. \"It might be out of date,\" she acknowledged.\n\nThomas Mather, director of the University of Rhode Island’s TickEncounter Resource Center, who asked Sosnowski to submit the legislation, contended that the CDC numbers are not accurate. He believes Sosnowski, if not correct, is close.\n\nThe problem: Rhode Island, which supplies the numbers to the CDC, stopped making a rigorous count years ago for budget reasons. That's why, he said, in 2004 the number of Rhode Island cases reported to the CDC plummeted from 736 to 249, even though there was no evidence that the problem had diminished. (The numbers have since rebounded, but most years they are far below pre-2004 levels.)\n\nJust based on the tick population in Rhode Island, he said, the state’s infection rate must be extraordinarily high. And, he said, it’s widely believed by people in the field that for every case reported, there are probably five other people who have been infected.\n\n\"We are certainly in the top five\" for Lyme disease cases, said Mather. \"Before 2004, we sort of were second. Then in 2004, states like Rhode Island and Connecticut suspended new case surveillance because we couldn't afford to do it.\"\n\nAnd in the intervening years, \"nothing has changed in Rhode Island to take away our ticks or our human exposure to ticks,\" he said. \"I'm fairly certain Rhode Island is right near the top of the list, if not at the top of the list, in the real number of cases of Lyme disease, if we could only count them.\"\n\nAnnemarie Beardsworth, a spokeswoman for the Rhode Island Department of Health, said the state’s Lyme disease numbers dropped from 2005 to 2007 because the Health Department didn’t have anyone to evaluate the data. That subsequently changed, she said, and the numbers have been reliable since 2008.\n\n\"Our sense is it is now fair to compare from state to state,\" she said. \"Doctor Mather may be looking at ticks, but we're looking at diagnosed, laboratory-confirmed cases.\"\n\nWe found that for 2009, even if you took all 85 \"probable\" cases of Lyme in Rhode Island and added them to the 150 \"confirmed\" cases (and only do it for Rhode Island), we would be ranked 11th in the nation, not second.\n\nFrom a broader perspective, Dr. Paul Mead, a chief of epidemiology and surveillance activity at the CDC, discourages people from focusing on state rankings because such numbers aren't as precise as you might expect. He said the uncertainty varies from disease to disease, and there may be more uncertainty in the numbers from some states than others.\n\n\"Lyme disease advocates will often push the idea of counting every case and surveillance is terrible,\" said Mead. \"I think much of that is borne from the notion that if you get your case count up, people will take it seriously and the disease will get more recognition.\"\n\nIn the end, CDC data confirm that, even though Sosnowski was citing outdated information, it's still fair to say that Lyme is \"one of\" the nation’s fastest growing infections.\n\nBut when she says that Rhode Island ranks second when it comes to the incidence of Lyme, she is giving a very precise statistic, citing it with authority, and using the present tense to make it sound current.\n\nYet there's no data to support her claim.\n\nBoth Sosnowski and Mather expressed fear that, when people hear what the latest numbers are, they will falsely conclude that Lyme disease is no longer a big deal. In fact, it is.\n\nAnd so is the truth, so we rate Sosnowski's statement Half True.", "News release, \"Sen. Sosnowski proposes lottery game to benefit Lyme disease prevention,\" Feb. 3, 2011, accessed Feb. 14, 2011\n\nBrown.edu, \"BI160: Development of Vaccines to Infectious Diseases -- Lyme disease - history,\" accessed Feb. 14, 2011\n\nYaleClimateMediaForum.org, \"The Ongoing 30-Year Lyme Disease War: Case Study of a Failure to Communicate,\" Nov. 25, 2008, accessed Feb. 14, 2011\n\nScienceDaily.com, \"Lyme Disease Bacterium Came From Europe Before Ice Age,\" June 30, 2008, accessed Feb. 14, 2011\n\nCDC.gov, \"Summary of Notifiable Diseases -- United States, 2004,\" June 16, 2006, accessed Feb. 16, 2011\n\nCDC.gov, \"Summary of Notifiable Diseases - United States, 2008,\" June 25, 2010, accessed Feb. 16, 2011\n\nE-mails, Kristen Nordlund, public affairs specialist, Centers for Disease Control and Prevention, Feb. 14 and 15, 2011\n\nCDC.gov, \"Lyme Disease Incidence Rates by State, 2005-2009,\" accessed Feb. 14, 2011\n\nCDC.gov, \"Lyme Disease Incidence Rates by State, 2004-2008,\" accessed Feb. 18, 2011\n\nCDC.gov, \"Lyme Disease -- United States, 1999,\" March 16, 2001, accessed Feb. 18, 2011\n\nCDC.gov, \"Lyme Disease -- United States, 2001-2002,\" May 7, 2004, accessed Feb. 19, 2011\n\nCDC.gov, \"Lyme Disease -- United States, 2003-2005,\" June 15, 2007, accessed Feb. 19, 2011", "CDC.gov, \"Reported Lyme disease cases by state, 1995-2009,\" accessed Feb. 18, 2011\n\nInterview, Susan Sosnowski, state senator from South Kingstown, Feb. 15, 2011", "Interviews and e-mail, Thomas Mather, director, TickEncounter Resource Center at the University of Rhode Island, Feb. 15, 2011\n\nInterviews, Annemarie Beardsworth, spokeswoman, Rhode Island Department of Health, Feb. 16 and 17, 2011\n\nInterview, Dr. Paul Mead, chief of epidemiology and surveillance activity, bacterial diseases branch, Centers for Disease Control and Prevention, Feb. 17, 2011\n\nTickEncounter.org, \"Rhode Island Tick Encounter Risk Map,\" accessed Feb. 15, 2011\n\nCDC.gov, \"Lyme Disease (Borrelia burgdorferi): 2011 Case Definition,\" accessed Feb. 17, 2011", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]