["About this rating", "Following the inauguration of the U.S. President Joe Biden, internet observers began commenting on images of the new leader's security detail, including an agent of Asian descent apparently in charge of the presidential protection team. For some, this lead them to the racist and baseless conclusion that this agent was from the Chinese Communist Party, who was there to \"protect their property:", "There are several things wrong with this conclusion, including the implicit statement that anyone of Chinese descent, including American citizens, is an agent of the Chinese Communist Party (CCP). More problematic for this specific instance of xenophobia, however, is the fact that the agent in question is a decorated Korean-American Secret Service agent who has also served in former president Donald Trump's protective detail. As reported by The Washington Post in late December 2020, Cho was recently selected to be the lead agent for Biden's detail:", "The Secret Service ... plans to name a new special agent to lead the Biden presidential detail, David Cho, according to the people familiar with the changes. Known as a perfectionist supervisor, he had risen to become the second-in-command of the protective detail during the Trump administration.", "Cho was awarded the Department of Homeland Security’s gold medal for exceptional service in 2019 for his negotiations with North Korean officials to arrange security for Trump’s historic visit there, while still overseeing security planning at the White House complex.", "Because Cho is an American citizen of Korean descent, and a long-serving and decorated member of the U.S. Secret Service, the claim that he is Chinese and an agent of the CCP is \"False.\"", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]