["About this rating", "In May 2018, a Twitter user shared a photograph showing a San Bernardino County sheriff's deputy praying before his shift, along with text suggesting that the department's posting of the picture had brought \"scrutiny\" upon them:", "This picture is indeed a photograph of a San Bernardino County sheriff's deputy kneeling in prayer. But although a handful of social media users posted comments in response to its posting that invoked concerns about the separation of church and state, the overwhelming majority of users expressed positive comments that did not result in any additional \"scrutiny\" being brought upon the department.", "This photograph was originally posted to the social media pages of the San Bernardino Sheriff's Department and the SBSD's Yucaipa Police Station on 1 May 2018. The Yucaipa Police post included a message stating that the photograph captured Deputy Wedge praying for the safety of his partner and the community:", "This picture is now often shared as if it became the center of a raging controversy, but in fact the majority of comments posted on the social media pages of these law enforcement agencies were positive. The San Bernardino Sheriff's Department even published a response on Facebook thanking the community for their support:", "Lt. Porter of the Yucaipa Police Station also responded to one Facebook user who was curious about the \"controversy\" surrounding this image. Porter explained that the photograph had originally been accompanied by a Bible verse and that a few people had posted comments referencing separation of church and state issues. However, Porter also noted that the overall response to the image had been \"overwhelmingly positive and supportive\":", "Examining the edit history of the San Bernardino County Sheriff's post reveals that it was originally posted in conjunction with the Bible verse “Blessed are the peacemakers, for they will be called children of God” -- Matthew 5:9.\" (This verse was later removed when the post was edited.)", "We were able to find only a handful of vaguely critical messages out of the 2,000-some-odd comments posted in response to this photograph on the two aforementioned Facebook pages. These comments tended to focus more on separation of church and state issues (particularly the use of a Bible verse) and less on criticism of religion, the deputy, or his employer:", "In general, the majority of users voiced support for the officer, a handful expressed sentiments similar to the one displayed just above, and the rest complained about how this photograph shouldn't really be controversial.", "Cynthia Bachman, the Public Information Officer of the San Bernardino County Sheriff's Department, told us in an email that there were \"many comments regarding the separation of church and state.\" And while Bachman said that \"scrutiny\" might be an appropriate word for the situation, she added that this controversy didn't warrant any changes to the department's social media policies:", "When this was originally posted it included the bible verse Matthew 5;9 - Blessed are the peacemakers: for they shall be called the children of God. This is a common verse used in law enforcement.", "I guess ‘scrutiny’ is accurate, as I’m told this post went viral. There were many comments regarding the separation of church and state and the verse was removed from the post, but the photo remained. I was told my our social media team that the positive/negative comments were split.", "It wasn’t necessary to change any of our social media policies due to this post.", "Updated [13 August 2018]: Added statement from Public Information Officer of the San Bernardino County Sheriff's Department.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]