["Liberal lawmakers and other supporters of Social Security protested outside the White House when President Barack Obama proposed in his budget a change that would result in smaller increases in future Social Security benefits.", "In a move that upset liberals, President Barack Obama proposed in his 2014 budget a change to something called \"chained CPI,\" which would result in smaller increases in future Social Security benefits.", "Among those objecting -- at a news conference outside the White House a day before Obama officially made the proposal -- was U.S. Rep. Mark Pocan, D-Wis.", "The freshman congressman elaborated on his position a week later, in an April 16, 2013 interview with John \"Sly\" Sylvester, a liberal talk show host on WEKZ-FM (93.7) outside of Madison.", "And he made this statement:", "\"Social Security didn't cause our deficit. Not one dime gets added to the deficit because of Social Security. It's not allowed to, by law.\"", "The one-dime claim -- likely to be repeated in one form or another as Congress debates Obama’s proposal -- is about as absolute as it gets.", "Is Pocan right?", "‘Chained CPI’", "Currently, cost-of-living adjustments to Social Security benefits are calculated using the traditional Consumer Price Index, a measure of overall inflation.", "Obama wants to switch to the so-called chained CPI, which some analysts believe is a more accurate measure. It accounts for how people change their behavior when costs rise -- if the price of pasta goes up, you might buy cheaper rice instead.", "Chained CPI would save the government some money because it would trigger smaller Social Security benefit increases than the traditional CPI.", "If chained CPI were put in place in 2014, according to the nonpartisan Congressional Budget Office, the average Social Security benefits would be roughly 2 percent lower -- $30 a month -- by 2023.", "Pocan’s evidence", "Pocan, a former state legislator, arrived in Congress in January 2013. He won election to the House seat vacated by Democrat Tammy Baldwin, who ran successfully for the U.S. Senate.", "To support Pocan’s claim, Pocan spokesman Samuel Lau cited federal documents from the nonpartisan Congressional Budget Office and Congressional Research Service to make two points:", "1. Social Security runs a surplus, and therefore doesn’t contribute to the overall federal deficit.", "2. Social Security benefits can be paid only from the Social Security trust fund, not general funds.", "But there is more to the story.", "Andrew Biggs, a scholar at the American Enterprise Institute and former principal deputy commissioner of the Social Security Administration, explains it this way:", "Budget experts use two main measures of the budget deficit: the \"on-budget\" balance, which includes everything except Social Security and the postal service, and the \"unified budget,\" which merges the on- and off-budgets.", "The unified budget approach is by far the most common for budget experts and the media -- and when the Obama White House talks about a 2013 budget deficit of $901 billion, it's the unified budget deficit that's being cited.", "On a unified budget basis, when Social Security's financial position worsens, the budget deficit grows. Social Security contributes about $53 billion to the budget deficit.", "But let’s go a little deeper, relying on experts such as the Tax Policy Center’s Howard Gleckman and the work of our PolitiFact colleagues and the Washington Post Fact Checker.", "Social Security’s red ink", "Although Social Security used to run surpluses, over the past few years it hasn’t collected enough in taxes to pay in benefits.", "And the trust fund consists not of prior Social Security surplus funds, but of interest-bearing securities provided through federal government borrowing -- thus the link to the deficit.", "Social Security is a pay-as-you-go system: Payroll taxes paid by current workers and their employers go to pay benefits to current retirees and other Social Security recipients.", "From 1984 to 2009, Social Security collected more money in payroll taxes than it paid out in benefits. That surplus was transferred from the Social Security program to the federal government's general fund. In return, the Treasury gave Social Security bonds that it could redeem to pay future benefits.", "The government, in turn, incurred obligations to repay the bonds, plus interest, to the Social Security trust fund.", "Since 2010, Social Security has been paying more in benefits than it has collected in payroll taxes. To meet its payments, Social Security began redeeming the bonds, plus interest, from the federal government.", "In other words, money was transferred from the government’s general fund to Social Security.", "That has an impact on the government’s deficit because the Treasury has had to borrow money in order to make such a transfer.", "Pocan noted that in the fiscal year that ended June 30, 2012, Social Security had a $36 billion surplus. But he ignores the fact that Social Security had to tap its trust fund.", "A closer look shows that Social Security actually had a cash flow deficit and used roughly $110 billion in interest to help make benefit payments.", "Because the government had to borrow money in order to pay the interest to Social Security; that contributes to the federal deficit.", "Indeed, White House figures show the Social Security shortfalls contributing to the overall federal deficit. And Obama has acknowledged that Social Security adds to -- though isn’t the primary driver of -- the deficit.", "Our rating", "Pocan is not the first to claim that Social Security does not contribute to the federal government’s budget deficit. Nor even the most recent. Two days after Pocan made his statement, Baldwin said on C-SPAN: \"Social Security has not contributed one penny to our current deficit or debt.\" But unlike Pocan, she noted the government has used \"other taxpayer funds\" when payroll taxes weren’t enough to pay Social Security benefits.", "In 2011, 2012 and 2013, our colleagues at PolitiFact Texas, Georgia and New Hampshire examined claims similar to Pocan’s. Each reached the same rating: Mostly False.", "And that’s what we rate Pocan’s statement.", "WEKZ-FM, interview quote at 7:45) with U.S. Rep. Mark Pocan, April 16, 2013", "Email interview, U.S. Rep. Mark Pocan spokesman Samuel Lau, April 17, 2013", "PolitiFact Ohio, \"Rep. Dennis Kucinich says Social Security didn't cause the debt crisis,\" Aug. 2, 2011", "PolitiFact Georgia, \"Congressman’s claim mostly misses the mark,\" Jan. 22, 2013", "PolitiFact New Hampshire, \"Social Security doeesn’t contribute to the debt and the deficits,\" Dec. 10, 2012", "PolitiFact Texas, \"Retiree group says Social Security doesn’t contribut a penny to U.S. deficit,\" Aug. 2, 2011", "Washington Post Fact Checker, \"Social Security and its role in the nation’s debt,\" Nov. 30, 2012", "Congressional Budget Office, \"Combined OASDI trust funds\"", "Congressional Research Service, \"Social Security: What would happen if the trust funds ran out?\" June 15, 2012", "Email interview, American Enterprise Institute resident scholar Andrew Biggs, April 24, 2013", "Email interview, resident fellow at the Urban Institute and editor of the Tax Policy Center's TaxVox blog Howard Gleckman, April 25, 2013", "Real Clear Markets, \"Social Security 'never added a dime to the deficit.' Really?,\" Oct. 3, 2012", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]