["This is false; the man in question spoke to AFP on Friday March 22, 2019 -- about two weeks after he was reported dead.", "After the Independent National Electoral Commission (INEC) declared Buhari winner of the February 23 presidential election, a picture of a man from Bauchi in northeast Nigeria, named in reports as \"Bala Haruna\", went viral as he celebrated the victory by immersing himself in a roadside drainage channel and drank from it.", "One of Nigeria’s most popular bloggers, Linda Ikeji, and Legit -- the most visited online newspaper in the country, according to a ranking by internet analysis site Alexa -- were among the first platforms to report the news.", "A few days later, a Twitter account called \"NaijaVirals\" -- which has since been suspended -- shared the image again, but this time with the caption: “Bala Haruna, the boy who vowed to drink gutter water if Buhari wins the election has died. He was rushed to a hospital after complaining about abdominal pains & stooling of blood, After series of tests, it was found out that he had Gastrointestinal bleeding.\"", "The same claim of his death was shared by Nigerian Senator Ben Murray-Bruce on Facebook and Twitter, and published by some of the most-read newspapers in the country, including The Guardian Nigeria.", "Friends of the man named as “Bala Haruna” tried to debunk the news but the pictures they put up could have been taken at any time in the past.", "AFP tracked down and spoke to the man in question, tracing contacts in Bauchi who were familiar with the situation. He told us his name was actually Ali Mohammed Sani, and that he is also known as Ali Gayu. He said he was 23 and works as painter. He lives with his parents in the Kofar Gombe neighbourhood of Bauchi city's Unguwar Doya area.", "Before the presidential election, Sani promised “to plunge into a drainage and drink from its water if Buhari won the election” -- and kept his word.", "\"I did it to prove to some opponents in my neighborhood how much I love Buhari. I was their object of ridicule and insult because of my intense support for Buhari,” he told AFP.", "Buhari has wide support across the Muslim-majority north of Nigeria -- his home region -- where he is seen as a man of the people and not part of the monied ruling elite.", "Sani said most of the people in his neighbourhood supported Atiku Abubakar, Buhari’s main challenger from the opposition Peoples Democratic Party (PDP).", "“I told them before the election that I would do what they had never anticipated once Buhari won. I didn't tell them what I had plan I had in mind,” he added.", "“And as soon as it was announced Buhari had won the election I came out of my house and fulfil the promise I made to myself by plunging into the drainage and drinking from its water.", "“I did that to prove to them how much I love Buhari for which they kept ridiculing and insulting me. I wanted to prove to them that my love for Buhari is not just words of mouth but is deeply rooted in my heart.\"", "Sani said he knew those who took his pictures in his neighbourhood, but he had no idea they shared the pictures on social media.", "Speaking about his rumoured death, Sani said he believed the misinformation was “aimed at portraying Buhari in bad light\".", "“The report of my death was obviously concocted by PDP supporters who wanted to dent the image of my hero Buhari by telling the world that the person who plunged into the drainage for the love he had for the Buhari died, and Buhari did nothing to check on his health and show appreciation for the love the man had for him,” he said.", "Public drains in Nigeria are often used for urination and defecation and fill up with rubbish in the absence of regular household waste collection services. Immersing oneself in gutter water and drinking it is certainly not advised.", "Sani said he had not had any health problems afterwards, apart from eye irritation.", "“Fortunately it stopped after two days and the reddening has substantially cleared. This is contrary to the rumour that I had internal bleeding which led to my death,\" he said.", "Goke Akinrogunde, a medical doctor and public health commentator, told AFP that Sani could have become ill, depending on his level of immunity to the germs carried in the water.", "“Our human gastrointestinal tract… is not sterile, and contains some microbes which deal with situations like this,\" Akinrogunde said.", "Sani could also have suffered more harm if he had had broken skin before immersing himself in the gutter, Akinrogunde added.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]