["About this rating", "In late January 2021, the Aquas Aquarium in Shimane prefecture in southern Japan posted a video on Twitter showing a giant squid that was found washed up in the city of Izumo.", "Giant squid sightings are somewhat unusual, so the video created a lot of excitement. The squid was real, but didn't appear to be in good health. Smithsonian biologist Mike Vecchione, who specializes in cephalopods, told us in a phone interview that it appeared in a second video posted by the aquarium that the squid was breathing — but that it was probably near death.", "Vecchione told Snopes that giant squids don't have a very long life in relation to humans. A typical giant squid may live one to two years, and the maximum is three to four years. He also said he wasn't surprised that the squid was found in Japan, because the Sea of Japan, a relatively narrow body of water between the western coast of Japan, part of Russia, and North and South Korea acts as a natural trap, particularly during the winter.", "Vecchione said that giant squid live in submarine canyons, or deep sea slopes where continents drop off, usually at depths of 600 to 1,000 meters, which is why sightings in shallower waters are uncommon in most places.", "The size of this animal is unknown to us — the aquarium didn't specify. But the largest giant squid ever recorded by scientists was 43 feet long. Vecchione said that squids are invertebrates, and their maximum size in the wild isn't known.", "In a follow-up video posted by the aquarium in Japan, it appeared the squid was tangled in rope.", "The last time a live giant squid made international news in Japan was in 2015. In that well-documented case, the squid was found in Toyama Bay on Christmas Eve, and was assisted back out to sea by a diver.", "https://www.youtube.com/watch?v=eOXkUrhclcc&t=5s", "That squid was spotted when it swam under fishing boats in Toyama Bay. According to CNN, the squid was just over 12 feet long and appeared to be a juvenile: \"Giant squid are thought to grow as large as 13 meters (43 feet) long. They typically inhabit deep waters, and it is unclear why this one wandered into the bay.\"", "Updated to include additional reporting.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]