["About this rating", "On 14 February 2017, many were rattled by a spate of media reports that seemed to demonstrate aggressive activity by the Russians, including news of a Russian spy ship spotted off the coast of Delaware.", "The ship's sighting coincided with reports that Russia had deployed cruise missiles in violation of a 1987 treaty with the U.S. brokered by President Ronald Reagan and Mikhail Gorbachev and reports that National Security Adviser Michael Flynn resigned under a cloud of accusations that he had spoken with Russian envoys about sanctions before assuming his official role in the Trump administration.", "While there has been no confirmation the Valentine's Day events are connected, the Department of Defense confirmed to us that they are aware of the vessel but did not provide any details, such as how far off the coast it is, what its current position is or what type of ship it is. In a brief statement, Defense Department spokeswoman Lt. Col. Valerie Henderson told us:", "We are aware of the vessel's presence. It has not entered U.S. territorial waters.  We respect freedom of navigation exercised by all nations beyond the territorial sea of a coastal State consistent with international law.", "Both Fox News and CBS News cited unnamed U.S. officials on 14 February 2017 and reported that the Russian AGI (Auxiliary, General Intelligence) was traveling north, and then would probably turn and head south again:", "Currently the ship is off the coast of Delaware, well in international waters. It is expected to continue north until it gets to the sub base at New London, Conn., then turn around and head south toward Cuba.", "The presence of foreign vessels and aircraft near U.S. territory is nothing new. In 2015, there was a flap about a Russian spy ship hanging out in a spot where the transatlantic cables are laid.", "Fox News reported further details about the vessel, also citing an unnamed source:", "The ship, the SSV-175 Viktor Leonov, last sailed near the U.S. in April 2015, an official said. It was also seen in Havana in January 2015.", "Capable of intercepting communications or signals, known as SIGINT, the ship can also measure U.S. Navy sonar capabilities, a separate official said.", "The Russian spy ship is also armed with surface-to-air missiles.", "“It’s not a huge concern, but we are keeping our eyes on it,” one official said.", "If it is indeed the Viktor Leonov, the ship made news in 2014 when it docked unexpectedly in Cuba just before Russia annexed Crimea (a peninsula that had been under Ukrainian control).", "The Viktor Leonov SSV-175, part of the Vishnya class of intelligence ships, quietly entered Cuban waters earlier this week and was docked at a cruise ship terminal on Thursday, its crew casually taking in the view of the old colonial section of the Cuban capital as passers-by gawked.", "Russian warships have come and gone in Cuba since the collapse of the Soviet Union, usually with much publicity and the opportunity for Cubans to visit the ship. This time there was no mention in the Cuban state-run media.", "The ship's sighting comes alongside reports that Russia is violating the 1987 Intermediate-Range Nuclear Forces Treaty (INF) with the United States by deploying cruise missiles:", "The new Russian missile deployment also comes as the Trump administration is struggling to fill key policy positions at the State Department and the Pentagon — and to settle on a permanent replacement for Michael T. Flynn, the national security adviser who resigned late Monday. Mr. Flynn stepped down after it was revealed that he had misled the vice president and other officials over conversations with Moscow’s ambassador to Washington.", "The ground-launched cruise missile at the center of American concerns is one that the Obama administration said in 2014 had been tested in violation of a 1987 treaty that bans American and Russian intermediate-range missiles based on land.", "The Obama administration had sought to persuade the Russians to correct the violation while the missile was still in the test phase. Instead, the Russians have moved ahead with the system, deploying a fully operational unit.", "A quick search of news stories makes it clear that sightings of similar Russian vessels happen with some regularity. In July 2016, the U.S. Navy reported seeing a spy ship in international waters off the Hawaiian coast. In January 2015, the Viktor Leonov was seen docked in Havana on the eve of a historic visit by senior U.S. delegates to Cuba.", "Naveed Jamali, a former intelligence operative who worked undercover for the FBI against Russian intelligence, told us the sighting isn't surprising because it's nothing new, and in the minds of the Russians, the U.S. is an adversary:", "I spent four years working against the Russians undercover and I can say that for the Russians, the Cold War never ended and the U.S. is still their main adversary. They see that hurting the United States is in their national interest. They can’t compete with us militarily and economically and it’s easier for them to bring us down than for them to build up those capabilities, so in essence, weakening the U.S. by extension strengthens Russia. They want to be a world power again, so showing that they can reach out and touch us is a way of making that point.", "Tomlinson, Lucas. \"Russia Sends Spy Ship Near US Coast, Deploys Banned Missiles at Home, Officials Say.\"\r\nFox News. 14 February 2017.", "CBS News.&nbsp;\"Russian Spy Ship Patrolling Off U.S. East Coast.\"\r\n14 February 2017.", "Gordon, Michael R. \"Russia Deploys Missile, Violating Treaty and Challenging Trump.\"\r\nThe New York Times. 14 February 2017.", "Miller, Greg, and Rucker, Phillip. \"Michael Flynn Resigns As National Security Adviser.\"\r\n  The Washington Post. 14 February 2017", "Valdés, Rosa Tania. \"Russian Spy Ship Makes Surprise Visit to Havana.\"\r\nReuters. 27 February 2014.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]