["About this rating", "Army Reserve and National Guard enlistment for I-551 card holders is currently \"on hold.\"", "I-551 card holders may join other branches of the military, but they cannot begin basic training until after they complete a background check.", "Lawful permanent residents of the U.S. (popularly known as \"green card\" holders) enlisting in the Army or any other service branch will face an extended delay before entering active duty as of October 2017.", "U.S. Army Recruiting Command (USAREC) said in a statement on 24 October that enlistees holding a Form I-551 card (a green card) will be placed in the Army's existing delayed entry program for recruits awaiting their boot camp assignment dates.", "According to USAREC, green card holders who enlist will now have to complete their background checks, which could take up to a year, before being allowed to begin boot camp. Previously they were eligible to begin their training as soon as their background check began. Stephanie Miller, director of accessions for the Department of Defense, is quoted as saying:", "Effective immediately, all green card holders must complete a background investigation and receive a favorable military security suitability determination prior to entering any component of the armed forces", "Enlistments by green card holders into the Army Reserve, however, are \"temporarily on hold,\" according to USAREC's statement, while a separate delayed entry pool is created for those recruits to be placed in while their background checks are completed.", "Jennie Pasquarella, director of immigrants' rights for the American Civil Liberties Union (ACLU) of California, told us that while the policy is not an outright ban, it would discourage enlistment on the part of green card holders. She also said that even if enlistees' background checks took less than a year, it represented a significant delay:", "When you combine that with the fact that most people are enlisting when they're coming out of high school. They're teenagers. A year is a very long time in the scope of a person's life when they're graduating from high school and trying to figure out the next step in their life. Either way, it's going to have an enormous impact on the number of [green card holders] who are able, ultimately, to enlist in the military.", "A Pentagon spokesperson, Maj. David Eastburn, told us on 26 October 2017 that the policy shift would provide better continuity of service for enlistees:", "A service member would leave and sometimes these background checks take a really long time. So these guys would complete basic training and then they couldn't go on to their tech school or their specialty school because the background check wasn't complete. They would end up sitting there for months, or they would have to choose a different job with a lower security requirement because it wasn't complete yet. The new policy allows the recruit to have that complete prior to entering service so when they finish they can go on to their tech school and they can progress naturally throughout their military career. There's no speed bump, for lack of a better term.", "On 13 October 2017, the Department of Defense (DOD) said that green card holders enlisted in military reserve components like the Army Reserve and National Guard would be eligible to apply for U.S. citizenship if they completed their background checks and served for one year:", "For example, the individual drilled successfully, he achieved all of his points, he did his two weeks of annual training and as a result, achieved one good federal year. At that time, the department would render that person's service as honorable, and then the department would sign the form that he would include in the naturalization packet for U.S. Citizenship and Immigration Services.", "Current green card holders, USAREC said, can still enlist for active duty \"with the understanding that they will be part of the Delayed Entry Pool until the screening process is complete.\"", "Before that statement, a Mic.com article reported that the Army Reserve had banned green card holders from enlisting entirely, quoting from an email sent to recruiters by Gregory C. Williamson, chief of the Accessions Suitability Office Guard Strength Division:", "EFFECTIVE IMMEDIATELY DO NOT ‘SHIP’ OR ‘ENLIST’ ANY FOREIGN NATIONAL’S (ALL I-551 CARD HOLDERS) UNTIL FURTHER NOTICE.", "Such a ban would have violated federal law allowing for any \"alien who is lawfully admitted for permanent residence\" to enlist for military service.", "On 18 October 2017, it published the following update:", "On Wednesday, an Army public affairs officer responded to Mic’s Tuesday report, clarifying that “for the time being,” green card holders cannot enlist in the Army Reserve specifically, rather than barring enlistment in the Army overall.", "According to the Immigration and Naturalization Act, active and retired U.S. service members are eligible to become naturalized citizens if they served for at least one year and, if applicable, were discharged honorably.", "In 2016 the Pentagon suspended the Military Accessions Vital to the National Interest program (MAVNI), which offered an expedited path to U.S. citizenship for green card holders in exchange for six years of service.", "Two separate lawsuits have been filed by recruits in connection with the move, and some recruits have reported that their enlistment contracts have been terminated.", "On 25 October 2017, the United States District Court for the District of Columbia granted a preliminary injunction to the three plaintiffs in one suit. The court determined that Mahlon Kirwa, Santhosh Meenhallimath, and Ashok Viswanathan \"are suffering, and will continue to suffer, irreparable harm due to DOD's inaction\" and stated that DOD may not refuse to certify MAVNI enlistees \"who have served for one day or more in the Selected Reserve as having honorable service.\"", "Defense Secretary Jim Mattis said on 13 October 2017 that the MAVNI program may be revived:", "We are taking the steps obviously to save the program, if it can be saved. And I believe it can.", "We contacted U.S. Army Recruiting Command seeking further comment. A spokesperson for the U.S. Navy, Lt. Cmdr. Nick Sherrouse, told us:", "All green card holders must complete a background investigation and receive a favorable military security suitability determination prior to entering any component of the armed forces. A recruiting suspension remains in effect while current personnel complete vetting requirements -- no new accessions have signed enlistment contracts since June 2016. However, we will continue to process existing Military Accessions Vital to the National Interest (MAVNI) Pilot Program recruits who successfully clear all security screening requirements and are determined to be vital to the national interest.", "United States Army Recruiting Command. \"DoD Issues New Guidance That Affects Recruiting Green Card Holders.\"\r\n   24 October 2017.", "Singer, Emily and Edwards, Ashley. \"Exclusive: Army Reserve Bans Green Card Holders From Enlisting, a Move That May Break Federal Law.\"\r\n   Mic. 17 October 2017.", "Jordan, Miriam. \"Fast Track to Citizenship Is Cut Off for Some Military Recruits.\"\r\n   New York Times. 15 September 2017.", "Horton, Alex. \"The Pentagon tried to kill a program for immigrants. Mattis thinks it can be saved.\"\r\n   Washington Post. 13 October 2017.", "Garamone, Jim. \"DoD Announces Policies Affecting Foreign Nationals Entering Military.\"\r\n   U.S. Department of Defense. 13 October 2017.", "Update [26 October 2017]: Updated with comment from a U.S. Navy spokesperson.", "Update [26 October 2017]: Updated with comments from a Pentagon spokesperson and an attorney with the American Civil Liberties Union. Also added a mention of a preliminary court injunction granted by a federal court on 25 October 2017.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]