["Relations between Russia and the United States have been decidedly frosty recently, and the international spirit of the Olympics doesn’t seem to have delivered much of a thaw. Or at least, that is one way to read the roster of the official delegation to the games in Sochi.", "Former Homeland Security director Janet Napolitano leads the group named by the White House. CNN’s Candy Crowley reminded Napolitano of how administrations have handled this before.", "\"I'm sure it's been noted to you, that it's been 14 years since a president or a vice president or a member of their family has not gone and attended at least an event at the Olympics,\" Crowley said on CNN’s State of the Union. \"Can you tell me as a practitioner of both policy and politics why Sochi is different for the U.S.?\"", "Napolitano denied that any snub of Russian President Vladimir Putin was intended. Obama, she said, had sent a group that \"represented the broad values of the United States.\"", "The Obama administration has made it clear that acceptance of gays and lesbians ranks prominently among those values. When the White House announced the delegation list, a spokesperson said it \"represented the diversity that is the United States.\" The list included the gay tennis star, Billie Jean King. Russia’s anti-gay bias has become a sticking point between the two nations.", "The president himself said his schedule doesn’t allow him to attend.", "The meaning behind the make-up of the delegation is a matter for diplomats and students of international relations. In this fact-check, we will look at whether the tradition that Crowley suggested actually has been in place since 2000.", "As this table shows, the record speaks for itself.", "Year", "City", "Who went", "1998", "Nagano, Japan", "Tipper Gore", "2000", "Sydney, Australia", "Chelsea Clinton", "2002", "Salt Lake City, Utah", "George W. Bush", "2004", "Athens, Greece", "George H.W. Bush, Barbara Bush", "2006", "Turin, Italy", "Laura Bush", "2008", "Beijing, China", "George W. Bush", "2010", "Vancouver, Canada", "Joe Biden, Jill Biden", "2012", "London, England", "Michelle Obama", "While it’s uncommon for an American president to attend, the White House has reliably extended the personal touch. Crowley’s statement includes the important catch-all category of family member to make her claim accurate.", "As far back as 1998, the then-wife of Vice President Al Gore, Tipper Gore, represented the White House at the Winter games in Nagano, Japan. For the 2000 Summer games in Sydney, Australia, President Bill Clinton’s daughter, Chelsea, took time off from college to watch the competition. In 2004, it was the president’s father and mother, former President George H. W. Bush and Barbara Bush, who made the family connection in Athens, Greece.", "George W. Bush stands out for having personally attended twice. The first time, the games took place on American soil in Salt Lake City, Utah, and the leader of the host country pretty much always attends. But Bush also made the trip to Beijing in 2008 where he memorably bumped a volleyball to a bikini clad member of the U.S. beach volleyball team.", "Our ruling", "Crowley said \"a president or a vice president or a member of their family\" has attended every Olympic games since 2000. That is accurate. In fact, the tradition goes back 16 years to 1998.", "We rate Crowley’s claim True.", "CNN, State of the Union, Feb. 9,2014", "Yahoo Sports, President Obama explains to Bob Costas why he didn’t attend the Sochi Olympics, Feb. 7, 2014", "USA Today, Obama sends message by naming Sochi Olympic delegation, Dec. 20, 2014", "White House, President Obama Announces Presidential Delegations to the Opening and Closing Ceremonies of the 2014 Olympic Winter Games, Dec. 17, 2013", "Politico, For U.S. Sochi delegation: Diversity, not diplomacy, Dec. 17, 2013", "Olympic Games, List of past Olympics", "White House, Tipper Gore in Nagano, Japan, at end of games", "CNN, It’s offiicial: Mrs Obama is going to the Olympics, June 22, 2012", "White House, Vice President Biden, Dr. Jill Biden to Lead U.S. Delegation to Opening Weekend of the Vancouver 2010 Olympic Winter Games, Feb. 2, 2010", "CNN, Past presidential Olympic delegations: photo gallery, Dec. 17, 2013", "White House, Mrs. Bush to lead presidential delegation to Olympic Games in Turin, Italy, Jan. 30, 2006", "UPI, Bush names delegation to Athens Olympics, July 15, 2004", "Sports Illustrated, Olympics open with celebration of American heros, Feb. 9, 2002", "AP Archives, Australia: Sydney Olympics: Chelsea Clinton arrival, Sept. 14, 2000", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]