["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "New York Gov. Andrew Cuomo briefs the media during a coronavirus news conference in New York City on May 9, 2020. (New York Post via AP)", "• Cuomo did raise the idea of increased online learning efforts during a May 5 press conference.", "• Parlato left the incorrect impression that Cuomo opposed reopening brick-and-mortar schools once the coronavirus pandemic is over.", "• Cuomo later walked back his comment amid a backlash from teachers, students and parents.", "Beth Parlato, a Republican candidate for Congress in New York’s 27th District, recently took a shot at Democratic Gov. Andrew Cuomo on Twitter.", "In a May 7 tweet, Parlato shared a video she had made as part of her \"Table Talk\" series. In it, she spotlighted comments Cuomo had made about education during a May 5 press conference.", "According to Parlato, Cuomo \"said gone are the days when we have one classroom with a teacher in the front. With all the technology we have, we don't need actual classrooms. He said we have the internet to teach our kids.\"", "Table Talk: Have you heard @NYGovCuomo on NYS Education?! pic.twitter.com/fmvMNaXuoK", "Parlato, a lawyer and former judge, is running in the Republican primary for a seat in the suburbs of Buffalo and Rochester that was vacated in 2019 by Republican Chris Collins.", "Did Cuomo say what Parlato said he did? He said something close. But Parlato exaggerated some of his comments, and Cuomo later amended them.", "During Cuomo’s May 5 daily press briefing, he addressed the effect the coronavirus pandemic was having on traditional education methods.", "\"The old model of everybody goes and sits in the classroom and the teacher is in front of that classroom and teaches that class and you do that all across the city, all across the state, all these buildings, all these physical classrooms — why, with all the technology you have?\"", "Cuomo said the internet has changed education and that traditional teaching practices may need to be reevaluated, especially considering how unprepared many districts were for online learning.", "Cuomo spoke about working with the Bill and Melinda Gates Foundation to \"reimagine\" education in New York state given the need for online learning during the pandemic. (Parlato also mentioned this in her video.)", "And on May 6, Cuomo asked Google’s former CEO, Eric Schmidt, to help lead a new commission to redesign the state’s educational systems.", "So Parlato had a point that Cuomo was envisioning a future in which brick-and-mortar classrooms were less important. But she exaggerated somewhat. Cuomo didn’t explicitly say he wanted to rule out traditional learning tactics or that \"we don’t need actual classrooms.\"", "In fact, Cuomo talked about reopening schools in New York state once the pandemic has subsided enough to ensure safety.", "\"It’s not about just reopening schools,\" Cuomo said in the May 5 press conference. \"When we are reopening schools, let’s open a better school and let’s open a smarter education system.\"", "Cuomo’s May 5 comments sparked a backlash from teachers, students and parents, with many interpreting Cuomo’s message in the same way Parlato did. And in the weeks after Parlato sent her tweet, Cuomo backed off his comments.", "\"‘Reimagine education’ means let's go through, let's look at what happened,\" Cuomo said on May 20. \"What can we learn that’s positive? I would agree with the teachers who say, ‘There is no substitute for classroom teaching.’ There is no substitute.\"", "Instead, he said, \"what happened to us here was you couldn’t do the classroom experience, because of the coronavirus, etc., so you have to go to remote learning. I don’t believe every school district was ready for this abrupt shift to remote learning. And how could they be? Nobody was ready for this abrupt shift of this coronavirus.\"", "Cuomo’s office confirmed statements made at his May 5 and May 20 press conferences and didn’t comment further on Parlato’s video.", "Parlato said Cuomo had said that \"with all the technology we have, we don't need actual classrooms.\"", "That’s close to what Cuomo said during his May 5 press conference, although Parlato left the impression that Cuomo was opposing reopening brick-and-mortar schools once the coronavirus pandemic is over, which is incorrect.", "Cuomo later walked back his comment amid a backlash from teachers, students and parents.", "We rate the statement Mostly True.", "Beth Parlato, tweet, May 7, 2020", "Washington Post \"Cuomo partners with Bill Gates to 'reimagine education,'\" May 6, 2020", "Syracuse.com, \"No technology can replace schools: CNY teachers, parents react to Cuomo,\" May 8, 2020", "Rev.com, Andrew Cuomo New York May 20 COVID-19 Press Conference Transcript May 20, 2020", "Rev.com, Andrew Cuomo New York COVID-19 Briefing Transcript May 5 May 5, 2020", "Email interview with Kelsey Good, Campaign Manager at Beth for Congress, June 6, 2020", "Interview with Jason Conwall, Deputy Communications Director for Cuomo, June 10, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]