["The GOP tax plan is fodder for campaign ads from both sides in Pennsylvania's special House election and races across the country.", "By Eugene Kiely and Lori Robertson", "Posted on March 7, 2018", "In a preview of this fall’s midterm elections, Democrats and Republicans are airing TV ads in Pennsylvania’s special House election and in swing congressional districts across the country that stretch the facts about the impact of the new tax law:", "The Tax Cuts and Jobs Act — a Republican-crafted tax bill that President Donald Trump signed into law on Dec. 22 — is emerging as one of the major issues of the 2018 midterm congressional elections. Both parties are using the tax law to attack each other, and they’re stretching the facts in the process.", "Ads attacking Republicans in three states use the misleading Democratic talking point that 83 percent of the tax cuts go to the wealthiest 1 percent. As we’ve written before, that’s true for 2027 but only because most of the individual income tax changes are set to expire by then.", "In 2025, a quarter of the tax cuts go to the top 1 percent.", "Republicans wrote the legislation with sunsetting tax cuts to meet Senate rules that enabled them to pass the bill with a simply majority (and no Democratic votes). They expect a future Congress to extend the individual income tax cuts, they say.", "The Senate Majority PAC, a Democratic group, is making the claim in ads airing in Indiana, where Democratic Sen. Joe Donnelly is running for reelection, and Missouri, where Sen. Claire McCaskill could face the state’s attorney general, Josh Hawley, who’s named in the ad.", "In Iowa, the liberal group Not One Penny is using this talking point in ads in the 1st and 3rd Districts, now represented by Republican lawmakers Rod Blum and David Young, respectively.", "The claim that 83 percent of the tax cuts go the top 1 percent has been used repeatedly by Democratic leaders in Congress. We’ve written before that one might argue Republicans basically wrote this talking point for the Democrats by structuring the legislation with sunsetting individual tax cuts. But the claim still leaves a misleading impression that the law is more lopsided than it actually is.", "In 2018, one-fifth of the tax cut benefits goes to the top 1 percent of income earners, according to an analysis by the Tax Policy Center. In 2025, a quarter goes to the top 1 percent — a sizable percentage but far below the 83 percent figure. Those wealthy taxpayers in 2025 would earn more than $837,800 and get an average tax cut of $61,090, the TPC says.", "Senate Majority PAC sent us support for the ad, which includes a Dec. 18 Vox article that notes: “[E]ven in the first years of the bill’s implementation, when it’s an across-the-board tax cut, the benefits of the law would be heavily concentrated among the upper-middle and upper-class Americans, with nearly two-thirds of the benefit going to the richest fifth of Americans in 2018.” That’s correct, per the TPC analysis, and it’s still the case in 2025.", "But Democrats instead have focused on the most lopsided figures for 2027, when the percentage of benefits going to the top 1 percent more than triples to 82.8 percent, “because almost all individual income tax provisions would sunset after 2025,” says the TPC. The corporate tax cuts remain in effect, including the drop in the top corporate rate from 35 percent to 21 percent, and wealthy individuals still get some benefits from those remaining cuts.", "Republicans included sunsetting individual income tax cuts in their bill so they could pass it through budget reconciliation, which requires only a majority vote in the Senate. Under reconciliation, lawmakers couldn’t add more than $1.5 trillion to the deficit over 10 years, or add to the deficit beyond those 10 years.", "GOP lawmakers say they expect a future Congress to extend those cuts.", "Not One Penny is running another ad in Iowa’s 1st and 3rd Districts that claims: “For people who have to work for a living, Rod Blum’s [or David Young’s] vote raises taxes on the majority of Americans.” The ad shows a CNBC headline that reads, “GOP plan will ultimately raise taxes on 50% of Americans, nonpartisan assessment says.”", "But that again pertains to the year 2027, “largely because the legislation’s personal tax cuts expire in 2026,” as the Associated Press story on CNBC’s website says. Before that year, the vast majority of Americans get a tax cut under the law.", "In 2018, 80.4 percent of all taxpayers get a tax cut, and in 2025, 75.5 percent get a tax cut, according to the Tax Policy Center analysis.", "It’s worth noting that the average tax hike on 50 percent of Americans in 2027 isn’t particularly large. In the middle fifth of taxpayers, those earning between $54,700 and $93,200, 70 percent would see a tax increase that year, compared with what they would have paid in the absence of the new tax legislation. That group would pay an average of $150 in higher taxes.", "In Pennsylvania’s 18th Congressional District, Conor Lamb, a former federal prosecutor, and Rick Saccone, a Republican state legislator, face off in a March 13 special election for a seat vacated by former Rep. Tim Murphy, who resigned in October after it was reported that he encouraged a woman with whom he had an extramarital affair to get an abortion.", "The race has given both parties a chance to test run their attack lines on the Tax Cuts and Jobs Act.", "In an ad called “Wiped Out,” Lamb’s campaign says the GOP tax plan will increase the deficit by $1.5 trillion. That’s correct. The tax bill is expected to increase the deficit by $1.46 trillion over 10 years, according to the nonpartisan Joint Committee on Taxation.", "The ad goes on to say that the Republicans’ “next step is to cut Medicare and Social Security.” The Senate Majority ads in the Missouri and Indiana Senate races also make this claim. The Missouri ad says that “to pay for the tax giveaway, there’s a plan to cut Medicare for seniors,” showing an elderly woman looking concerned.", "But there’s no “plan” being debated in Congress, and GOP leaders say they don’t think lawmakers will address these issues in 2018. Lawmakers have talked about the need to cut the growth of spending in these programs in order to reduce deficits, and reducing Medicare spending was part of the president’s budget proposal.", "It’s not unusual to hear politicians of both parties talk about reducing the growth of Medicare in particular, as we’ve explained before. The nonpartisan Congressional Budget Office estimated last year that deficits will continue to rise over the next three decades, “because spending growth is projected to outpace growth in revenues.” Charts on the spending growth show that Social Security and major health care programs make up about half of that spending growth. “In particular, spending as a share of GDP increases for Social Security, the major health care programs (primarily Medicare), and interest on the government’s debt,” the CBO said, citing the aging of the population for much of the growth in Social Security and Medicare.", "The Tax Cuts and Jobs Act is expected to exacerbate the problem. The Hill wrote in a Dec. 3 story: “The projected increase in the debt from the tax package could make the situation worse, budget experts say.” William Hoagland, senior vice president at the Bipartisan Policy Center, told the newspaper that “[i]f we are talking about the kinds of deficits” that are projected from the tax bill, “entitlement cuts are definitely on the table.”", "Republicans have said that the tax cuts will produce significant economic growth, and therefore revenue. But even taking into consideration macroeconomic effects, the Joint Committee on Taxation estimates the tax cuts would add $1.1 trillion to the deficit over 10 years.", "The story cited in the Senate Majority ads is a December article in U.S. News and World Report and is based on Democrats expressing concern with some remarks made by House Speaker Paul Ryan and Florida Sen. Marco Rubio.", "“We’re going to have to get back next year at entitlement reform, which is how you tackle the debt and the deficit,” Ryan said on Dec. 6 on The Ross Kaminsky Show on talk radio, adding that “it’s the health care entitlements that are the big drivers of our debt.”", "But by January, Ryan said he didn’t think the House would address Medicare changes (or Social Security) this year, adding that he wants a “bipartisan consensus” on those issues.", "The Lamb ad points to a Newsweek article from Dec. 1, on Rubio’s comments. He spoke generally about making changes in Medicare and Social Security for “future beneficiaries” to reduce the growth of the debt and deficits.", "Here’s the fuller quote from Rubio, made in an interview with Politico when he was asked about concerns that the GOP tax plan would increase the deficit. The part in bold appeared in the Newsweek story:", "Rubio, Nov. 29, 2017, Politico interview (starting at the 21:46 mark): The argument would be we can’t cut taxes because it will drive up the deficit. That assumes that somehow we can fix the deficit through higher taxes, and we can’t. The only way you’re going to deal with the debt is you have to do two things. … You have got to, you have got to generate economic growth, because growth generates revenue. But you also have to bring spending under control. And not discretionary spending. That isn’t the driver of our debt. The driver of our debt is the structure of Social Security and Medicare for future beneficiaries.", "We still have time not just to save those programs but to responsibly structure them in a way that doesn’t impact current retirees or people about to retire, but in a way that would probably impact it for me and people younger than me — in ways that quite frankly you wouldn’t really notice and you wouldn’t really object to, because it’s reasonable. And if we did that in combination with growth, you can begin to bring the trajectory of the debt to a responsible and acceptable level. That is the only way forward.", "The Florida senator’s remarks make clear he wasn’t talking about a concrete plan to cut Medicare and Social Security, but rather his thoughts in general on reducing the debt.", "After that interview, in late December, Senate Majority Leader Mitch McConnell said changes to Medicare and Medicaid were off the table for 2018. “I think Democrats are not going to be interested in entitlement reform, so I would not expect to see that on the agenda,” he said, according to the Washington Post. “What the Democrats are willing to do is important, because in the Senate, with rare exceptions like the tax bill, we have to have Democratic involvement.”", "The Post story noted that “Democrats are already warning Republicans against attempting to force any reductions to entitlement spending, making it almost certain that if the GOP goes ahead with such changes, they will be doing so without any Democratic support — and exposing themselves to attacks on the campaign trail.”", "But they’re being attacked on this point anyway, despite not moving ahead with such spending cuts.", "In its support for the ads, Senate Majority also points to the president’s proposed budget for fiscal 2019. It would reduce Medicare spending by $236 billion over 10 years, Reuters reported. But the news service noted: “There is little chance of those cuts becoming real, as presidential budgets are rarely enacted by the U.S. Congress, which controls federal purse strings.”", "The Associated Press reported that Trump’s proposed changes to Medicare’s prescription drug program would “create winners and losers,” with some seniors saving money and others paying more.", "We don’t know whether Congress will move forward on such a prescription drug plan. McConnell has said he doesn’t expect Medicare to be on the Senate’s agenda this year.", "So, there’s no “plan” to cut Medicare, or Social Security, as these campaign ads claim. Nor have Republicans said they’d “pay” for their tax cut with such spending reductions. But the Democrats have a point that Republican lawmakers have discussed the need to reduce spending on those programs to lower long-term deficits — deficits that the tax cuts are expected to boost.", "Republican groups have been proactive in promoting the benefits of the new tax law — not only in Pennsylvania’s special election but across the country, mostly in competitive districts.", "American Action Network, a Republican political group organized as a 501(c)(4) nonprofit, announced on March 5 that it would spend $1 million on a TV ad campaign in 24 House districts in 16 states.", "The ad features Natalie Mihalek, a young mother of three small children, who thanks Congress for passing the tax bill, which she says increased her take-home pay because her employer is now withholding less in federal income tax. (Mihalek is a Republican who ran for the Pennsylvania Senate in 2015 and lost.) On the screen, the ad displays these words: “$2,000 middle class tax cut.”", "The ad offers no source for the $2,000 claim, but it is a familiar Republican talking point developed by the Republican staff of the tax-writing House Ways and Means Committee. The GOP staff estimates that “the typical family of four earning the median family income of $73,000” will save $2,059.", "House Speaker Paul Ryan frequently cites the $2,059 figure, which is displayed prominently on his website. Trump cited the figure in remarks on March 7 to a Latino business group.", "The estimate is accurate, but only for certain families – specifically those that have younger children and do not itemize their deductions. And even for that family, the tax savings will dwindle over time.", "The nonpartisan Tax Policy Center released a report on Dec. 22 that looked at how “representative families” would fare under the new law. Two of those families had adjusted gross incomes of $75,000 – which is close to the “typical family” that Republicans say will save $2,059.", "The Tax Policy Center calculated that a family of four with two young children (younger than 17 years old) and an adjusted gross income of $75,000 would see a tax savings of $2,119 in 2018. But the savings would be nearly half that ($1,119) for a couple earning the same amount ($75,000) but with two older children (17 and 18 years old). That’s because of changes to the child tax credit and elimination of the personal exemptions.", "As we explain in our guide to the tax changes, the new law increases the standard deduction from $12,700 to $24,000 for a married couple filing jointly. It also doubles the child tax credit from $1,000 to $2,000. But the new law eliminates the personal exemption, which is $4,050 per person.", "The couple with the younger children would benefit from the increased child tax credit. But that tax credit is only for children 16 years old and younger. For older children, parents would receive $500 per dependent — which cuts deeply into their tax savings.", "Also, the couple with the younger children would see their $2,059 tax cut reduced over time. That’s because the child tax credit — unlike the old personal exemption — is not indexed to inflation, and it expires in 2025. “While the higher CTC would help many families today, inflation would erode the additional benefit over time,” Howard Gleckman, a senior fellow at the Tax Policy Center, writes.", "Tax Policy Center, Dec. 22, 2017: Over time, the net benefit of the combination of an expanded CTC and the loss of personal exemptions would narrow because the personal exemption amount is indexed for inflation but the CTC is not. Because all the individual income tax provisions of the TCJA would expire after 2025 except for the less generous inflation measure for indexing the tax system, both families would see a modest tax increase in 2027.", "By 2027, both of the couples would be paying $150 more in taxes, the Tax Policy Center says. TPC did not provide estimates for years other than 2018 and 2027.", "In Pennsylvania’s 18th Congressional District, the Congressional Leadership Fund has aired several ads that attack Lamb, the Democratic candidate, for opposing the GOP tax law changes.", "One ad (below) starts by saying, “Conor Lamb isn’t telling you the truth. Lamb doesn’t support a middle class tax cut. Fact: Lamb opposed the $2,900 middle class tax cut, calling it a ‘complete betrayal.’”", "Lamb says he supports a middle-class tax cut, just not this tax cut.", "On Dec. 1, Lamb did call the Republican tax bill “a complete betrayal,” because he said it gives too much of a tax break to the wealthy. Lamb tweeted this in response to Sen. Claire McCaskill’s complaint that lobbyists had written amendments for the Republican tax bill at the 11th hour: “Complete betrayal of the middle class. We were promised infrastructure & jobs, instead we get big tax cuts for the rich written by & for corporate lobbyists. People in #PA18 are tired of being lied to. We’ll put an end to this hypocrisy on March 13th.”", "As it did in other ads airing in the Pennsylvania race, the Congressional Leadership Fund says in this ad that the new tax law will provide a “$2,900 middle-class tax cut” for taxpayers in Pennsylvania’s 18th Congressional District. That’s more than a third higher than the Republicans say the “typical family” in the U.S. would receive.", "The ad provides no information on which families might see a $2,900 tax cut — except for a footnote that gives the source as the House Ways and Means Committee. On its website, the Republican committee staff says it estimated how much the tax cut would save families in every congressional district based on the U.S. Census median household income for a family of four in that district.", "For the 18th Congressional District in Pennsylvania, the committee based its estimate on a household income of $100,920. But the median household income for a family with children under 18 years old in the 18th District is $91,983, according to the U.S. Census. The median family income — which takes into account all family types — is $81,024 for that district.", "The $2,900 savings is also subject to the same caveats as the $2,000 savings for the “typical” U.S. family. The tax cut would be less for families with children 17 years and older, and the tax savings would be smaller over time as certain provisions of the law take effect or expire.", "As we have said before, the impact of the tax bill varies, depending on each taxpayer’s income, tax credits, deductions and expenses. For personalized estimates, the IRS has developed a tool that allows taxpayers to estimate how much they should withhold in federal taxes in 2018 — which will give taxpayers an indication of how much their tax liability has changed since last year.", "H.R.1. An Act to provide for reconciliation pursuant to titles II and V of the concurrent resolution on the budget for fiscal year 2018. 115th Congress (2017-2018). Enacted 22 Dec 2017.", "Robertson, Lori. “Democrats’ Misleading Tax Line.” FactCheck.org. 26 Jan 2018.", "Senate Majority PAC. “MP LAUNCHES AD CAMPAIGN IN MISSOURI AND INDIANA TO COMBAT THE KOCH BROTHERS’ WAR AGAINST MIDDLE-CLASS FAMILIES.” Press release. 15 Feb 2018.", "Gurdus, Elizabeth and John Schoen. “Here are 3 key Senate races that show why Democrats are at risk of losing seats in 2018.” CNBC.com. 21 Feb 2018.", "Tax Policy Center. “Distributional Analysis of the Conference Agreement for the Tax Cuts and Jobs Act.” 18 Dec 2017.", "Matthews, Dylan. “The Republican tax bill got worse: now the top 1% gets 83% of the gains.” Vox. 18 Dec 2017.", "Stein, Jeff. “Republicans explain why their tax cuts are temporary, but not really temporary.” Washington Post. 30 Nov 2017.", "CNBC.com. “GOP plan will ultimately raise taxes on 50% of Americans, nonpartisan assessment says.” Associated Press. 20 Nov 2017.", "Deto, Ryan. “Pennsylvania Democrats criticize the new tax cuts for overwhelmingly benefiting the wealthy.” Pittsburgh City Paper. 28 Feb 2017.", "Bade, Rachael and Sherman, Jake. “Tim Murphy resigns from Congress.” Politico. 5 Oct 2017.", "Ward, Paula Reed. “Rep. Tim Murphy, popular with pro-life movement, urged abortion in affair, texts suggest.” Pittsburgh Post-Gazette. 3 Oct 2017.", "Joint Committee on Taxation. “Estimated Budget Effects Of The Conference Agreement For H.R.1, The ‘Tax Cuts And Jobs Act.'” 18 Dec 2017.", "Robertson, Lori. “A Campaign Full of Mediscare.” FactCheck.org. 22 Aug 2012.", "Congressional Budget Office. “The 2017 Long-Term Budget Outlook.” 30 Mar 2017.", "Weixel, Nathaniel. “Tax bill could fuel push for Medicare, Social Security cuts.” The Hill. 3 Dec 2017.", "Joint Committee on Taxation. “Macroeconomic Analysis Of The Conference Agreement For H.R. 1, The ‘Tax Cuts And Jobs Act.‘” 22 Dec 2017.", "Soergel, Andrew. “After Tax Overhaul, GOP Sets Sights on Medicare, Social Security.” U.S. News and World Report. 7 Dec 2017.", "Stein, Jeff. “Ryan says Republicans to target welfare, Medicare, Medicaid spending in 2018.” Washington Post. 6 Dec 2017.", "Pramuk, Jacob. “Paul Ryan says he doesn’t think the House will pass Social Security, Medicare reform this year.” CNBC.com. 12 Jan 2018.", "Goodkind, Nicole. “Republicans will cut Social Security and Medicare after tax plan passes, says Marco Rubio.” Newsweek. 1 Dec 2017.", "Politico. Full video of Playbook Interview: Sen. Marco Rubio. 29 Nov 2017.", "Demirjian, Karoun. “McConnell: Entitlement reform is a nonstarter in the Senate in 2018.” Washington Post. 21 Dec 2017.", "Gibson, Ginger and Oliphant, James. “Trump budget seeks cuts to domestic programs, Medicare, favors military and wall.” Reuters. 12 Feb 2018.", "Alonso-Zaldivar, Ricardo. “Winners and losers under Medicare drug plan in Trump budget.” Associated Press. 13 Feb 2018.", "Press release. “New $1 Million AAN Ad Campaign Promotes Tax Cuts For Middle-Class Families.” American Action Network. 5 Mar 2018.", "Hardison, Lizzy. “SD-37: Natalie Mihalek Seeks Republican Nomination in Special Election.” PoliticsPA. 19 Jun 2015.", "O’Toole, James. “GOP nominates Reschenthaler for Pennsylvania Senate in 37th.” Pittsburgh Post-Gazette. 11 Jul 2015.", "Press release. “By the Numbers: Tax Cuts and Jobs Act Delivers Tax Cuts for Families in Every Congressional District.” House Ways and Means Committee, Republican staff. 21 Dec 2017.", "Press release. “$2,059: Speaker Ryan Talks Tax Cuts on the Morning Shows.” House Speaker’s Office. 20 Dec 2017.", "“Updated Effects of the Tax Cuts and Jobs Act on Representative Families.” Tax Policy Center. 22 Dec 2017.", "Kiely, Eugene. “A Guide to the Tax Changes.” FactCheck.org. 20 Dec 2017.", "Gleckman, Howard. “The Hidden Tax Increase In The Big Six Tax Outline.” Tax Policy Center TaxVox. 3 Oct 2017.", "U.S. Census Bureau. “Median income in the past 12 months (in 2016 inflation-adjusted dollars). Congressional District 18 (115th Congress), Pennsylvania.” Accessed 6 Mar 2018.", "U.S. Internal Revenue Service. “IRS Withholding Calculator.” IRS. Undated. Updated 7 Mar 2018.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]