["About this rating", "Some of the mailboxes at the Disneyland theme park in Southern California can be used to send mail, such as postcards, from inside the park.", "The mailboxes aren't serviced by the U.S. Postal Service. Park employees collect the contents and take it to a post office in Anaheim.", "If you've visited Disneyland in California, you've probably noticed that the park is set up to mimic a miniature metropolis, with themed areas like Tomorrowland and Adventureland. So some may have assumed that mailboxes adorning the park are just decorations.", "Some of them are. But some of the mailboxes are in fact useable. According to the website for D23, the Disney company's official fan club, \"There are real functioning mailboxes spread around the resort and themed to blend in with the surroundings. They’re perfect for sending a postcard to commemorate your trip!\"", "But you might not want to put your tax payments or car registration renewal in there. The park was, of course, built before smartphones with cameras that can send images in an instant via text messages. The intent of the boxes was for park guests to drop postcards off, as the Disney history blog Yesterland notes.", "If one looks closely at photographs of the Disneyland mailboxes provided in the D23 post, the boxes carry notices saying their contents are picked up by park employees and taken to the U.S. Post Office in Anaheim, the city where the park is located. Here's what Yesterland had to say about the park's mailboxes:", "As with the park’s trash cans, the mailboxes are often designed to match the themes of their specific locations—for instance, the one at the Briar Patch (shown) has a rustic design appropriate for Critter Country. Some of the boxes are oriented vertically, others horizontally; some have lids that lift up, others that pull down.", "All of them, however, have their mail collected the same way, as noted on some of the boxes themselves: “This Collection Box is Served by Disneyland Personnel, and Taken to Anaheim Post Office.” Disneyland itself doesn’t stamp or postmark the mail, though an official “Disneyland U.S. Post Office” mailing items with an official “Disneyland, California” postmark was mentioned in the 1953 prospectus that pitched the park to potential investors.", "The Disneyland park in Southern California is currently closed due to the COVID-19 pandemic and is not expected to reopen until 2021, according to park officials.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]