["About this rating", "White House press secretary Sarah Huckabee Sanders was criticized online after she posted a photograph following a U.S. airstrike against Syria, an image that viewers claimed was misleading but Sanders asserted was not", "On 14 April 2018, the night after the U.S. launched a missile strike against chemical weapons facilities in war-torn Syria, Sanders posted a statement via Twitter saying that \"Last night the President put our adversaries on notice: when he draws a red line he enforces it.\" The tweet was accompanied by a photograph which was taken inside the White House Situation Room by official photographer Shealah Craighead:", "Last night the President put our adversaries on notice: when he draws a red line he enforces it. (Inside the Situation Room as President is briefed on Syria - Official WH photos by Shealah Craighead) pic.twitter.com/GzOSejdqQh", "— Sarah Sanders (@PressSec) April 15, 2018", "However, observers noticed that Vice President Mike Pence could be seen in the background of the photograph, even though at the time of the missile strike he was in Peru attending a summit of leaders from Latin American countries.", "Sanders was subsequently accused of attempting to mislead the public by posting an image that did not correspond with the wording of her tweet, so the following day she clarified the origins of the photograph, noting that it had been taken during a briefing the day prior to the missile strike:", "As I said, the President put our adversaries on notice that he enforces red lines with the strike on Syria Friday night. The photo was taken Thursday in the Situation Room during Syria briefing.", "— Sarah Sanders (@PressSec) April 15, 2018", "Sanders also told the news site Politico that the photograph was taken on 12 April 2018, adding, \"So no, not misleading at all.\" Her story was corroborated by Kelly O'Donnell, White House correspondent for NBC News.", "The 13 April 2018 strikes by the U.S., Great Britain, and France, reportedly targeted chemical weapon-making facilities in Syria, in response to a purported chemical attack by Syrian President Bashar al-Assad's forces against civilians in the town of Douma.", "BBC News.   \"Syria Air Strikes: US and Allies Attack 'Chemical Weapons Sites.'\"\r\n    14 April 2018.", "Griffiths, Brent D.   \"Sarah Sanders Clarifies Syria Strike Photo Tweet.\"\r\n    Politico.   15 April 2018.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]