["A CCTV footage shared by several on social media shows three men forcefully putting two children in a car. The widely used message circulated with the claim suggests that the incident took place near Bablu Sandwich on Manik Bagh road in Indore, Madhya Pradesh – “अगर आप इंदौर के हो तो इंदौर के सारे ग्रुप में शेयर करो माणिकबाग रोड बबलू सैंडविच के पास की घटना है.”", "अगर आप इंदौर के हो तो इंदौर के सारे ग्रुप में शेयर करो माणिकबाग रोड बबलू सैंडविच के पास की घटना है", "Posted by Shahil Malviya Magicion on Saturday, 3 August 2019", "Another claim floated along with the video says that kids were kidnapped while returning from school. Cars with tinted glasses are used for the crime. “स्कूल से छुट्टी होती है तो सभी सावधान रहें …..ऐसे काले शीशे वाली कार बैन होनी चाहिए . सभी के बच्चे अनमोल होते हैं . देखें बच्चा चोर कैसे अपहरण करते हैं बच्चों का ..सावधान रहें !”", "बच्चा चोर", "स्कूल से छुट्टी होती है तो सभी सावधान रहें ….. ऐसे काले शीशे वाली कार बैन होनी चाहिए . सभी के बच्चे अनमोल होते हैं . देखें बच्चा चोर कैसे अपहरण करते हैं बच्चों का .. सावधान रहें !", "Posted by Sir Arvind Kejriwal Jokes on Tuesday, 30 July 2019", "A Facebook user Anjali Sharma had shared the video with a message that did not make any specific claim but warned people to stay alert.", "The video pertains to an incident that took place in May this year when a father kidnapped his own children who were living with his separated wife. According to Dainik Bhaskar, the incident occurred in Panchkula sector-19, Haryana. A case was lodged against the father, Gurmeet Singh, by the grandfather of the children who said that his daughter and son-in-law were not getting along. The couple stayed separately. On May 16, when the grandfather was returning home after picking up the kids from school, Singh came with two other men and kidnapped his children.", "The incident was also reported by Amar Ujala which said that Gurpreet Singh and his wife had filed for divorce. The report added that the police were on the lookout for the accused on the basis of the CCTV footage.", "The video was earlier debunked by Vishwas News.", "Thus, an old case where a father kidnapped his children who were staying with their mother, is being used on social media for fear-mongering. The incident did not take place in Indore, MP but in Haryana. With child-kidnapping rumours on a rise, irresponsible posts on social media might add to the panic.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]