["A video is floating across social media platforms with the claim that a landslide occurred in Malshej Ghat, Maharashtra. It is noteworthy that the state is currently experiencing heavy rainfalls. The message most commonly used to share the video says, “Malshej Ghat..plz Do not travel in this side . forward all groups.”", "Malshej Ghat..plz Do not travel in this side . forward all groups", "Posted by Yog Tikam on Tuesday, 30 July 2019", "Other messages used to circulate the clip are – Malshej ghat… Be careful…, Malshej ghat kindly do not travel on this route, Land scape on malshej ghat.", "Alt News also received verification requests on its mobile app.", "The video does not depict landslide on Malshej Ghat but the Jammy-Srinagar national highway. According to a report by The Tribune, “The Jammu-Srinagar National Highway was closed for traffic due to shooting stones at various places between Ramban and Banihal stretch of the highway, falling in Ramban district of the state” on July 28. The report further stated that “all types of vehicular movement on the highway was stopped, including the Amarnath yatra, after heavy rain lashed the region, due to which Panthal area witnessed shooting stones”.", "The incident was also reported by Greater Kashmir, India Today and Aaj Tak among others,", "Alt News recently debunked similar misinformation where old, unrealted images of flooding were shared as roads blocked in Gujarat due to heavy rainfall.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]