["About this rating", "A new sensation hit the internet in late January 2018: shower rat.", "A video purporting to show a rat \"showering like a human\" racked up millions of views on social media (and a few hundred thousand extra on subsequent YouTube postings), but the anthropomorphized footage may not be as appealing as it seems at first glance:", "It is difficult to pinpoint some of the specifics for this video, such as where and when it was taken — although the person who put up the earliest video we could find, DJ Jose Correa, is from Peru. Dallas Krentzel, an evolutionary biologist who studies rodent diversity at the University of Chicago at the Field Museum, told Newsweek that's a strong clue that this animal is actually a pacarana: \"There is just no other rodent that would fit all of those features, and the fact that this video was taken in Peru where pacaranas are known just seals the deal.\"", "Karen Robbins, president of the American Fancy Rat and Mouse Association, agrees that the \"shower rat\" does not appear to be a rat at all:", "That is not a rat (rattus norvegicus nor rattus rattus). It does look like a rodent, just not sure on species (can't tell if it has a tail or spots on the sides like a paca or pacarana has) ...", "If it was someone's pet or in a zoo and they were giving it a bath because it got dirty, they should show the rinsing off part. Pet rats will groom/wash themselves several times a day like cats so don't normally need to be bathed, but they can be if they get dirty, get a greasy coat, etc. They will then groom/wash themselves after a bath because you messed up the coat (they will also wash themselves after being handled to get off the \"people\" smell). So, this wouldn't be \"showering\" but grooming to get rid of the soap in the coat. I'm sure they called it \"showering\" because people have to constantly humanize animals.", "In a response to a comment on his Facebook post, Correa explained that the \"rat\" in the video was not his pet: \"Hi Lisa, the rat is a free creature, it was just captured on camera while taking a shower, afterwards he went for some food somewhere.\"", "The idea of a rodent's stopping in an apartment for a quick shower before grabbing lunch is, for lack of a better word, adorable. However, that scenario raises many questions, not least of which is who provided the soap? Tuomas Aivelo, an urban rat researcher at the University of Helsinki in Finland, told Gizmodo that whoever applied the soap may have caused the rat some pain or irritation: \"The movements are pretty strange... a rat wouldn’t do that unless there's something it really wants to get rid of. I think it's soapy all over. That's probably a problem for the rat. It just wants to get rid of the soap.\"", "We don't know what type of shampoo or soap was used in the viral video. But since Correa said that this animal was not a pet, it's unlikely that it was a specialty soap designed for rodent care:", "The viral video of rattus saponicus was circulated with the claim that it showed a rat showering like a human. However, it appears that a more appropriate caption would be \"pacarana struggles to remove irritant from fur.\"", "This assessment was challenged when Chile's Energy Ministry weighed in on the issue on 31 January 2018, showing a pacarana cleaning itself and clarifying that this is, indeed, how one cleans itself:", "Para quienes criticaron que pusimos a la Pacarana? bañándose en una gráfica, les contamos que es normal ese movimiento que hacen, además ese Shampoo que le pusieron es para mascotas ?\nRecuerda, en tus duchas #CuidaElAgua ? pic.twitter.com/tFyIPPNVi6", "— Ministerio Energía (@MinEnergia) January 31, 2018", "The tweet says, essentially, that the pacarana is in a shower and that the water is temporarily off as it grooms: \"For those who criticize us for putting this pacarana in this video, tell them this is a normal movement of theirs that they do, and also this is pet shampoo. Remember, in your showers #CuidaElAgua\"", "Chile has experienced record-breaking droughts in recent years.", "Hugo, Kristin.   \"Viral 'Shower Rat' Video Is Not What We Think -- For Starters, It's Not a Rat.\"\r\n    Newsweek.   29 January 2018.", "Mandelbaum, Ryan.   \"The 'Shower Rat' Is Very Obviously Not Showering.\"\r\n    Gizmodo.   29 January 2018.", "3 February 2018, 8:58 A.M.: Added clarification from the Chilean government.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]