["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A TSA agent speaks to travelers passing through an empty security queue at Love Field airport in Dallas on March 12, 2020, amid concerns of the coronavirus pandemic. (AP)", "Older Americans and those with chronic conditions are advised to reconsider all travel plans to avoid COVID-19.", "The State Department is advising all citizens to reconsider travel abroad. China and Iran have been issued Level 4 travel advisories because of the virus.", "If you do have to travel via airplane, you’re unlikely to get sick on board as long as you practice good hygiene.", "Since the outbreak of COVID-19, airline stocks have plummeted. Companies like Delta, American and United have cut or reduced flights. Photos show empty airport terminals around the world.", "On March 13, Fox & Friends co-host Ainsley Earhardt took those signs to mean that now is a great time to take a trip.", "\"It’s actually the safest time to fly,\" she said during the Fox News morning show. \"Everyone I know that’s flying right now, terminals are pretty much dead — ghost towns.\"", "As of March 12, more than 125,000 people have been infected with COVID-19 in 117 countries, with 4,613 deaths. In the United States, there have been 1,629 confirmed cases in 46 states, with 41 deaths.", "In a March 11 address, President Donald Trump announced a sweeping ban on travel from 26 European countries. While the White House maintains the move will slow the spread of the coronavirus, some experts doubt the restrictions will have much of an effect.", "PolitiFact wanted to know whether Earhardt was correct to say that now is the safest time to fly.", "We reached out to Earhardt for evidence, but we haven’t heard back. Official guidance on COVID-19 contradicts what she said on Fox News.", "Officials are advising older Americans and those with chronic health conditions to reconsider their domestic and international travel plans to avoid COVID-19.", "On its website, the Centers for Disease Control and Prevention says there are \"several things you should consider when deciding whether it is safe for you to travel\" in the U.S., including:", "Is COVID-19 spreading where you’re going?", "Will you or someone you’re traveling with be in close contact with others during your trip?", "Are you or someone you’re traveling with at risk of severe illness if you get COVID-19?", "Do you live with someone who is older or has a severe chronic health condition?", "Is COVID-19 spreading where you live?", "If the answer to any of those questions is yes, then you may want to reconsider your travel plans to avoid potentially spreading or contracting the virus.", "\"CDC’s recommendations differ depending on the location,\" said agency spokeswoman Leslie Dorigo in an email. \"CDC recommends that older adults and people of any age with serious chronic medical conditions should consider postponing nonessential travel because they are at increased risk for severe disease.\"", "That’s because older and immunocompromised people, as well as those with chronic conditions like diabetes and hypertension, are more at risk of suffering complications from COVID-19. Younger people, even though they may not be as susceptible to the coronavirus, can still serve as carriers for the virus, potentially infecting new communities through travel.", "RELATED: Fact-checking Donald Trump’s mistakes about European travel due to coronavirus", "The World Health Organization has similar guidance for international travelers, although it advises against travel bans like the one implemented by the Trump administration.", "\"It is prudent for travellers who are sick to delay or avoid travel to affected areas, in particular for elderly travellers and people with chronic diseases or underlying health conditions,\" read its recommendations. \"General recommendations for personal hygiene, cough etiquette and keeping a distance of at least one metre from persons showing symptoms remain particularly important for all travellers.\"", "The U.S. State Department is advising all citizens to reconsider travel abroad due to the spread of COVID-19. Other countries have issued similar travel warnings.", "Since January, the State Department has issued several travel advisories related to the COVID-19 outbreak. As of March 13, China and Iran had \"Level 4: Do Not Travel\" advisories — the highest issued by the State Department — while countries like Azerbaijan, Italy and South Korea were labeled as \"Level 3: Reconsider Travel.\"", "On March 11, the State Department also issued a global health advisory asking Americans to reconsider traveling abroad.", "Source: WHO", "\"Many areas throughout the world are now experiencing COVID-19 outbreaks and taking action that may limit traveler mobility, including quarantines and border restrictions,\" reads the Level 3 advisory. \"Even countries, jurisdictions, or areas where cases have not been reported may restrict travel without notice.\"", "Other countries, such as the United Kingdom and Australia, have issued similar travel advisories.", "\"It may not be safe to fly, especially if you’re going to one of the COVID-19 hotspots,\" said Richard Watanabe, professor of preventive medicine at the University of Southern California, in an email. \"Generally speaking, it is just unwise to be traveling in any form right now.\"", "If you do have to travel via airplane, you’re unlikely to get sick while on board, officials say — as long as you practice good hygiene.", "The WHO says there is little risk of disease transmission during a flight, mostly due to the way cabin air is filtered. During the outbreak of Severe Acute Respiratory Syndrome (SARS), another human coronavirus, in 2003, the risk of disease transmission on airplanes was found to be very low.", "Plus, airlines are taking extra steps to clean airplanes and slow the spread of COVID-19.", "\"Airlines are being more cautious about passengers, they’re doing extra cleaning and disinfecting and they are restricting flights,\" Watanabe said. \"So one might consider flying to be safer than ever.\"", "Still, it is possible to catch something from an infected person seated in the same area as you.", "RELATED: Stop sharing myths about preventing the coronavirus. Here are 4 real ways to protect yourself", "According to the CDC, COVID-19 spreads in two primary ways: close person-to-person contact (within about six feet) and respiratory droplets in coughs and sneezes. If someone with the virus sneezes, those germs could land on surfaces around them, such as airplane seats and armrests. Then, an uninfected person who touches that same surface and then touches their nose, eyes or mouth could contract the virus.", "If you do need to travel by plane, public health officials advise practicing good personal hygiene. The ways to prevent the spread of the coronavirus include washing your hands with soap and water, covering coughs and sneezes, disinfecting frequently touched surfaces, and avoiding people who are sick.", "\"We are trying to understand the ‘rules’ that govern transmission of COVID-19 and relative risk from people at different stages of disease, and/or contaminated surfaces and more,\" said Dr. Myron Cohen, director of the Institute for Global Health and Infectious Diseases at the University of North Carolina, in an email. \"It seems unwise for commentators to offer travel advice until we who are more expert know far more.\"", "Earhardt said that \"it's actually the safest time to fly.\"", "Officials from the CDC and WHO are advising older people and those with chronic health conditions to reconsider travel in order to prevent the spread of the coronavirus. The State Department has issued travel advisories for several individual countries, as well as a global health advisory, related to the disease outbreak. Other countries have taken similar steps. While the disease transmission on airplanes is thought to be a low risk, it is still possible to contract the coronavirus through close personal contact and respiratory droplets.", "Earhardt’s statement is inaccurate. We rate it False.", "Business Insider, \"Photos of deserted, nearly empty airports around the world show how coronavirus has decimated air travel,\" March 1, 2020", "Centers for Disease Control and Prevention, Coronavirus and Travel in the United States, accessed March 13, 2020", "Centers for Disease Control and Prevention, Coronavirus Disease 2019 (COVID-19) in the U.S., March 13, 2020", "Centers for Disease Control and Prevention, How COVID-19  Spreads, accessed March 13, 2020", "Email from Leslie Dorigo, spokeswoman for the Centers for Disease Control and Prevention, March 13, 2020", "Fox & Friends, March 13, 2020", "Ireland Department of Foreign Affairs and Trade Travel Advice, Updated Travel Advice on the Coronavirus, accessed March 13, 2020", "The New York Times, \"‘Almost Without Precedent’: Airlines Hit Hard by Coronavirus,\" March 5, 2020", "PolitiFact, \"Fact-checking Donald Trump’s mistakes about European travel due to coronavirus,\" March 12, 2020", "PolitiFact, \"Stop sharing myths about preventing the coronavirus. Here are 4 real ways to protect yourself,\" March 5, 2020", "SmartTraveller.gov.au, Coronavirus (COVID-19) – information for Australian travellers, accessed March 13, 2020", "Time magazine, \"Why Public Health Experts Say Trump's Travel Ban Won't Curb the Spread of COVID-19 in the U.S.,\" March 12, 2020", "The Today Show, \"Coronavirus airplane travel: How US airlines are cleaning planes,\" March 5, 2020", "U.K. Foreign & Commonwealth Office, Travel advice: coronavirus (COVID-19), accessed March 13, 2020", "USA Today, \"Coronavirus travel fallout: American, Delta cutting flights as demand sinks, joining United and others,\" March 10, 2020", "U.S. Department of State, Azerbaijan Travel Advisory, accessed March 13, 2020", "U.S. Department of State, China Travel Advisory, accessed March 13, 2020", "U.S. Department of State, Global Level 3 Health Advisory – Reconsider Travel, March 11, 2020", "U.S. Department of State, Iran Travel Advisory, accessed Mach 13, 2020", "U.S. Department of State, Italy Travel Advisory, accessed March 13, 2020", "U.S. Department of State, South Korea Travel Advisory, accessed March 13, 2020", "U.S. Department of State, Travel Advisories, accessed March 13, 2020", "World Health Organization, Coronavirus disease 2019 (COVID-19) Situation Report – 52, March 12, 2020", "World Health Organization, Q&A on coronaviruses (COVID-19), March 9, 2020", "World Health Organization, Transmission of communicable diseases on aircraft, accessed March 13, 2020", "World Health Organization, Updated WHO recommendations for international traffic in relation to COVID-19 outbreak, Feb. 29, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]