["About this rating", "An organization called the Satanic Temple seeks to institute After School Satan Clubs in public elementary schools to counter what they see as religious \"indoctrination\" by Christian programs such as the Good News Club. However ...", "As described by the organization, After School Satan Clubs would not be aimed at teaching children to believe in a supernatural being named Satan, perform Satanic rituals, or introduce children to a \"religion of darkness.\"", "In late July 2016, the Washington Post and other mainstream media reported that a New York-based group called the Satanic Temple was petitioning public school administrators around the U.S. to allow the introduction of After School Satan Clubs in elementary schools. The Temple's co-founder, Doug Mesner (aka Lucien Greaves), an atheist, said the group's agenda is to promote multiple points of view and was conceived of in response to the proliferation in schools of Good News Clubs, which promote evangelical Christianity:", "“While the Good News Clubs focus on indoctrination, instilling children with a fear of hell and God’s wrath, After School Satan Clubs will focus on free inquiry and rationalism,” Greaves said. “We prefer to give children an appreciation of the natural wonders surrounding them, not a fear of an everlasting other-worldly horror.”", "Some on social media reacted to the news by expressing their fears about children being taught to worship the devil and participate in Satanic rituals, but the Satanic Temple — whose activities are described as a \"blend of political activism, religious critique and performance art\" — does not subscribe to or promote a literal belief in the devil, the Washington Post explained:", "The Satanic Temple doesn’t espouse a belief in the existence of a supernatural being that other religions identify solemnly as Satan, or Lucifer, or Beelzebub. The Temple rejects all forms of supernaturalism and is committed to the view that scientific rationality provides the best measure of reality.", "According to Mesner, who goes by the professional name of Lucien Greaves, “Satan” is just a “metaphorical construct” intended to represent the rejection of all forms of tyranny over the human mind.", "Those who do subscribe to a literal belief in Satan may find the group's \"promotional video\" somewhat disturbing, however, in that it incorporates well-known tropes associated with devil worship in pop culture, such as Satanic symbolism, demonic music, backmasking and horror film sound effects:", "In case it isn't sufficiently obvious, there's a political dimension to the After School Satan Club campaign, namely spotlighting the encroachment of religion into public schools in the form of the Good News Clubs, of which there are thousands across the U.S.:", "Greaves is blunt: “We are only doing this because Good News Clubs have created a need for this. If Good News Clubs would operate in churches rather than public schools, that need would disappear. But our point is that if you let one religion into the public schools you have to let others, otherwise it’s an establishment of religion.”", "The Satanic Temple's seven fundamental tenets, which include \"One should strive to act with compassion and empathy towards all creatures in accordance with reason,\" and \"The freedoms of others should be respected, including the freedom to offend,\" are listed on the group's website.", "Bugbee, Shane.  \"Unmasking Lucien Greaves, Leader of the Satanic Temple.\"\r\n  Vice.  29 July 2013.", "Stewart, Catherine.  \"An After School Satan Club Could Be Coming to Your Kid's Elementary School.\"\r\n  The Washington Post.  30 July 2016.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]