["About this rating", "Mike Pence's father worked for a company that operated a chain of gas stations.", "A purported photograph of Mike Pence at one of those stations is not a picture of him, and we found no evidence the stations in question were 'whites only.'", "In October 2016, a photograph purportedly showing current Indiana governor and Republican vice Presidential candidate Mike Pence standing in front of a \"whites only\" gas station owned by his parents began circulating online:", "This image does not show Mike Pence, nor does it depict a \"whites only\" gas station run by Pence's family in Indiana.  This picture was taken in South Carolina circa 1950 (Pence himself wasn't born until 1959) and has nothing to do with the Pences.", "Although the photograph is unrelated to the Pence family, it is true that the Indiana governor's father did have a hand in running a string of gas stations. Several news outlets, including ABC, Indinapolis Star, and CNN have mentioned this fact since Mike Pence was chosen to be Donald Trump's running mate in July 2016. None of these sources reported that the gas stations run by Pence's father, Edward Pence, were \"whites only,\" however.", "According to a September 2016 Forbes  article, Edward Pence did not own the gas stations himself; rather, he worked for the Kiel Brothers Oil Company:", "Kiel Brothers Oil Company and a related C corporation KP Oil Inc ran over 200 convenience store gas stations in Indiana and surrounding states. Edward Pence, Mike’s father had spent his career there and Gregory Pence, Mike’s brother, was CEO towards the end.  It was a family business, but not really a Pence family business. The original Kiels were still around.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]