["NC Sen. Dan Bishop of Mecklenburg County shakes hands with President Donald Trump before speaking Wednesday, July 17, 2019 at a rally in Greenville, NC. Bishop ran for Congress against Democrat Dan McCready in North Carolina's 9th District and won.", "President Trump says he might lose the election because of fraud.", "And a couple of his supporters in North Carolina say they believe the unproven claims about fraud could be true. U.S. Rep. Dan Bishop, a Republican who represents a southern swath of the state, says he’s seen hints of wrongdoing in his own district.", "\"Well, I’m echoing the President’s claims. Indications of grossly improper conduct from election officials right here in my district,\" part of his Nov. 5 tweet said.", "Is it true that there are \"indications of improper conduct from election officials\" in his district?", "We reached out to Bishop’s office and asked what he meant. Spokeswoman Hannah Hummelberg cited complaints about campaign volunteers at the lone early voting site in Anson County, which have been reported by WBTV and WFAE-FM public radio in Charlotte.", "These claims were investigated and addressed. But the actions in question were done by a candidate and his campaign volunteers -- not election officials.", "The complaints: Officials received complaints that supporters of an Anson County Register of Deeds candidate, Dannie Montgomery, broke the law during early voting by assisting voters into the site and allegedly the voting booth. One voter said she was specifically told to vote for Montgomery, WBTV reported.", "\"As soon as I pulled up and exited my vehicle a campaign worker came up to me and forced me to vote for Dannie Montgomery and told me not to vote Greg Eudy (the unaffiliated candidate). As a first time voter I felt it wasn’t fair to me,\" the voter said in the complaint.", "What the law says: A voter can receive help only from close relatives — unless that voter has a disability. Voters who have a disability may ask for help from any person, with a couple exceptions. The law also prohibits assistants from influencing someone’s vote.", "A response: On Oct. 23, the Anson County elections board held an emergency meeting to discuss the allegations. Meeting minutes show the board warned campaign volunteers about the behavior going forward.", "The Anson board received and investigated more complaints after that meeting but could not substantiate the allegations, according to Gina Clarke, the board’s temporary assistant director. The state board of elections issued a press release on Oct. 31 to clarify North Carolina’s laws about assisting voters", "The outcome: No Anson County election observers or board staff were found to have done anything wrong, according to Clarke and Pat Gannon, spokesman for the state elections board.", "Unofficial election results show Montgomery losing to Eudy, the other Register of Deeds candidate, and underperforming compared to Democrats at the top of the ballot. Montgomery appears to trail by more than 500 votes. Meanwhile, Joe Biden, Cal Cunningham and Roy Cooper all lead their respective Republican opponents in Anson by at least 400 votes.", "Bishop has tweeted about the Anson County allegations several times.", "On Oct. 29, Bishop tweeted a video of the alleged campaign volunteer in question. On Nov. 1, Bishop tweeted a letter that he sent to top state and Anson County election officials. He asked them to produce video showing the campaign worker’s actions while inside the polling site.", "The same day, the North Carolina Republican Party sent a letter to Sherry Melton, director of the Anson County election board.", "The NC GOP noted that there had been 18 incident reports about Montgomery and her supporters. The party asked for the alleged rule-breakers to be banned from the polling site.", "The Anson board investigated complaints about the campaign volunteers, said Clarke, the board’s temporary assistant director. She spoke to PolitiFact by phone on Nov. 10. Complaints filed after the Oct. 23 meeting were \"unfounded,\" she said.", "\"We looked into each one of them,\" Clarke said. She added: No election officials were found to have committed any misconduct.", "The distinction between campaign volunteers, who greet people outside polling sites, and actual election officials, who conduct elections and count ballots, is an important one.", "We pointed out to Bishop’s office that his tweet omitted this key context and asked if Bishop is aware of any direct misconduct by Anson County election officials.", "Hummelberg, the spokeswoman, said the congressman is \"just suggesting\" that the county elections officials have been \"permitting\" campaign workers to \"buttonhole voters in the buffer zone, accompany them into the voting enclosure and into the voting booth, and to direct them how to vote.\"", "As we mentioned: the county and state boards addressed the complaints — just not in a manner that Bishop or the state GOP might have preferred. Anson officials held an emergency meeting, issued warnings and investigated the complaints,while the state elections board issued a press release.", "Bishop said there are \"indications of grossly improper conduct from election officials right here in my district.\" His spokeswoman cited complaints about campaign volunteers outside a polling place.", "Complaints were filed against Anson County campaign volunteers accusing them of trying to coerce people into voting a certain way. And Bishop thinks local election officials didn’t do enough to stop campaign volunteers from improperly assisting voters with their ballots.", "But the North Carolina elections board says it’s not aware of any direct misconduct by Anson County election officials. We rate this claim False.", "Tweets by U.S. Rep. Dan Bishop, a Republican representing North Carolina’s 9th Congressional District, on Oct. 29, Nov. 1 and Nov. 5, 2020.", "Email correspondence with Hannah Hummelberg, spokeswoman for U.S. Rep. Dan Bishop.", "Email correspondence with Patrick Gannon, spokesman for the North Carolina State Board of Elections.", "Telephone interview with Gina Clarke, temporary assistant director for the Anson County elections board.", "Story by WBTV, \"N.C. elections board investigating after flurry of complaints in Anson County,\" posted Oct. 31, 2020.", "Story by WFAE, \"NC State Board Of Elections Looking Into Early Voting Complaints In Anson County,\" posted Oct. 30, 2020.", "Press release from the North Carolina State Board of Elections, \"Guidelines for Assistance to Voters,\" posted Oct. 31, 2020.", "Unofficial election results posted on the North Carolina State Board of Elections website.", "A letter from Philip Thomas, chief counsel for the North Carolina Republican Party, to Sherry Melton, the Anson County elections director, on Oct. 29, 2020.", "Complaints filed with the Anson County Board of Elections.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]