["A video of Bakhshish Singh Virk, BJP candidate from Haryana’s Assandh constituency, was shared on social media where Singh can be heard making comments about voting machines – “Whichever button you press, the votes will automatically go to flower (BJP’s election symbol)”. He further suggested that BJP leaders Narendra Modi and Manohar Lal Khattar can sense which voter voted for whom and from which constituency. Congress MP Rahul Gandhi tweeted the viral video and wrote, “The most honest man in the BJP”.", "The most honest man in the BJP. pic.twitter.com/6Q4D43uo0d", "— Rahul Gandhi (@RahulGandhi) October 21, 2019", "Several media organisations like Punjab Kesari and The Tribune also reported on the video, however, without verifying the speech. In an interview with BBC Punjabi, Singh claimed that his speech was doctored by the opposition for political gains.", "Alt News found that this video is mischievously clipped, however, a part of it is unadulterated. The video is 39 seconds long but close observation reveals a jump-cut at the 24th second. India Today was able to access the full video of about seven minutes which can be viewed below.", "From 44 to 71 seconds in the video, Singh can be heard saying, “5 second di ghalti 5 saal pugatni pavegi. Ajj jis bande ne jithe vote paayi hai na, saanu oh bhi pta chal jaana hai. Ki kede bande ne kithe vote paayi hai, taan ae galatfehmi bhi nahi honi chahindi, assi jaan ke dasde vi nahi. Agar koi puchhega taan assi das bhi dvange, ki kede bande ne kithe vote paayi hai. Kyonki Modiji diyan nazraa badiyan tezz ne, Manohar laalji diyan nazraa badiyan tezz ne.”", "Translation: “You have to suffer for 5 years if you make a mistake in those 5 seconds. We find out which person has voted for whom and from where. So, you must not have any misconception about that. Actually, we deliberately don’t tell anything. If somebody asks, we can tell them who a person has voted for. Because Modiji’s eyes are very sharp, Manoharlalji’s eyes are also very sharp.”", "This portion of his speech, which lasts for about 27 seconds, is not altered. At 2:16 minutes, he refers to the opposition and says, “hun pta ki kenhde o, ki vote jithe marzi paa lo aakhir vich nikalegi phool ch hi hai. Button jeda marzi dabba do nikalna phool ch hi hai. Asi machine ch esa purja fit kita haiga”.", "Translation: “Now, you know what they (opposition) are saying. Where ever you cast your vote, the vote will automatically go to flower (BJP). Whichever button you’ll press, the vote would go to flower. Because we have fixed such a device in the voting machines.”", "The first sentence, where he refers to the opposition, was clipped. He says that the opposition thinks that the BJP has fixed such devices in voting machines that all votes are recorded in the party’s name. Here, he is talking about opposition claims of rigging EVMs. BJP had also put out a clarification tweet about the clipped portion of the video.", "In conclusion, a video of BJP Haryana candidate Bakhshish Singh Virk was mischievously clipped. However, while Singh did not claim that the BJP has rigged voting machines, he suggested that PM Modi and CM Khattar have the intuition to discern voting patterns.", "Donate Now", "Ritesh Gautam is currently pursuing a degree in M.Phil. from Punjabi University, Patiala. Previously, he's finished his Masters in Mass Communication. He also has a Masters in Theater and has been working in the theater industry in Chandigarh for over 10 years.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]