["About this rating", "In October 2017, Juli Briskman lost her job at a marketing firm after images showed her flipping off the motorcade of then-U.S. President Donald Trump while she was cycling. Two years later, she was elected to a position as a district supervisor in northern Virginia’s Loudoun County.", "Loudoun County", "Following the Jan. 20, 2021, inauguration of U.S. President Joe Biden, rumors circulated that Briskman's position was in the same jurisdiction as the Trump National Golf Club of Washington, D.C. (D.C. is bordered to the south by Virginia and to the north by Maryland, with many of those residing in either state commuting to the city for work. Colloquially, this region is known as the “DMV.”) Turns out, her elected seat is indeed in both the same county and district as the golf club.", "The Trump National Golf Club of Washington, D.C., is at 20391 Lowes Island Boulevard in Sterling, Virginia — a city of about 28,000 residents in Loudoun County. Snopes spoke with Rey Banks, chief of staff for Briskman, who confirmed that the jurisdiction of the golf club is overseen in part by Briskman's elected seat in Algonkian District.", "\"The mailing address of the golf course is Sterling, VA but it resides in the Algonkian District. Over time, the Sterling District was divided along Algonkian Blvd. West of Algonkian is Sterling (more or less) and East is the Algonkian District,\" wrote Banks in an email to Snopes. \"[The club] is near Supervisor Briskman’s home, which accounts for why she was riding her bike near there.\"", "Briskman went viral in October 2017 after flipping off the Trump motorcade while she was riding her bike in Sterling, Virginia. Briskman’s story again picked up speed in early 2021 when a meme depicting her gesture was again shared on Facebook in a Feb. 6 post by the political meme page Call to Activism, a group that \"strive[s] to counter Right-Wing lies with indisputable facts and decency.\" As of this writing, the picture had been shared more than 10,000 times.", "Brendan Smialowski/AFP via Getty Images", "The photograph was posted to the website aggregator Getty Images with a publication date of Oct. 28, 2017. A White House pool report submitted by The Guardian reporter David Smith on the same day noted that the motorcade passed two pedestrians at 3:12 p.m., one of whom gave a thumbs-down sign. The cars then drove past a female cyclist “wearing a white top and cycling helmet, who responded by giving the middle finger.”", "“The motorcade had to slow and the cyclist caught up, still offering the finger, before turning off in a different direction. Motorcade is now gathering speed and heading for D.C.,” read the pool report.", "While many chalked the gesture up to a good laugh, the photograph captured by White House photographer Brendan Smialowski cost the Virginian her job. In an interview with The Washington Post, the mother of two said that she was fired from Akima, a government contracting firm, just a few days after the photograph of her went viral because it violated internal policies.", "\"I wasn't even at work when I did that, but they told me I violated the code-of-conduct policy,” Briskman told the publication. Banks told Snopes that Briskman went to her employer and self-identified as the person in the picture after she saw that the photo was being circulated.", "Two years after her “little birdie” photograph went viral, Briskman went on to win a seat in the Algonkian District on the Loudoun County Board of Supervisors in November 2019— marking the first time she had been elected to public office. Under Virginia law, one person from each district of each county is elected to serve on the board of supervisors for a term of four years. Briskman was sworn in in January 2020.", "In early 2021, the former journalist and federal government employee sat on the Board of Supervisors’ Finance/Government Operations and Economic Development Committee and the Joint Board and School Board Committee.", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]