["About this rating", "An internet advertisement depicted a place called Jacob's Well in California as a dangerous and popular vacation spot where people have lost their lives in the past.", "Jacob's Well is located in Hays County, Texas, not California. It was also false to claim that no one realizes its dangers.", "In late 2020, an online advertisement that appeared to be clickbait showed a girl jumping into what looked like a vertical hole in a lake. The photograph of what turned out to be Jacob's Well included the text: \"No One Realizes How Dangerous This Popular Vacation Spot in California Actually Is.\"", "The image was real, but it had nothing to do with the state of California. Jacob's Well is a popular destination for swimming in Hays County, Texas. It is the second-largest fully submerged cave in the state. The image of Jacob's Well had also appeared on Reddit and Pinterest in the past. We were unable to find the name of the photographer.", "Internet advertisements that include phrases like \"you won't believe what happens next\" and \"doctors hate him\" have dominated the online landscape for years, often failing to deliver on their promises, and leaving readers clicking through endless slideshows with no payoff.", "The advertisement that claimed \"no one realizes how dangerous this popular vacation spot in California actually is\" was hosted by Outbrain, and the landing page after clicking the advertisement went to Icepop. Outbrain facilitated the technology that allowed Icepop to run the advertisement. However, Icepop created the content. Icepop's strategy appeared to be what has become known as advertising arbitrage. We described arbitrage in a previous story that falsely claimed \"Jeopardy\" host Alex Trebek's net worth \"left his family in tears\" following his passing. The basic idea is to make more money by displaying advertisements on each Icepop slideshow page than it had cost to run the Outbrain advertisement that led readers to the slideshow in the first place.", "In the case of Jacob's Well, it appeared on page two of the slideshow, which is quite early compared to other instances of arbitrage. However, the image was quite different than the one that appeared in the advertisement, and since it did not feature California, Icepop's strategy for the advertisement may have been to keep readers clicking until they found the image from the advertisement. The image from the advertisement did not make an appearance in the slideshow story.", "The Hays County website described the history of Jacob's Well, including how it earned the name:", "Jacob's Well Natural Area consists of five land surveys that all use the spring as a corner to tie the properties together. These surveys were conducted in 1847 by a prominent surveyor names Bartlett Sims. In the early 1850's William C. Winters, a San Jacinto veteran and early settler of Wimberley, hiked up Cypress Creek searching for its source and found an overflowing spring. It is said that Mr. Winters exclaimed \"like unto a well in Bible times.\" Thus it was named ‘Jacob's Well'. The property changed hands many times over the next 100 years and became a popular recreational destination. Jacob's Well Natural Area remains a popular recreational destination today.", "The county also noted that the deepest part of the cavern system is 140 feet deep, and that the main cavern length is 4,341 feet.", "Wimberley Valley Watershed published an informative video on Jacob's Well Natural Area, which included details on its Native American history.", "It is true that a handful of people have drowned at Jacob's Well, but it is false that \"no one realizes how dangerous\" it is. On top of Jacob's Well being featured on Reddit and Pinterest, tales of its dangers also appeared in San Antonio Express-News, Discovery, Swimmer's Daily, All That's Interesting, and others.", "On Nov. 26, 1983, an Associated Press story was published in Salisbury, Maryland's, The Daily Times. It detailed a number of drownings at Jacob's Well:", "In 1984, Wayne W. Russell, Jr. became the ninth fatality at Jacob's Well.", "Treehugger linked to a particularly frightening video that purported to show someone freediving around 100 feet (30 meters) into the water without scuba gear.", "A Reddit post claimed to show a sign near the entrance to the cave below where swimmers jump into the water.", "However, that sign didn't appear in any diving videos, and may have been shot at Eagle's Next Sinkhole in Florida, where multiple people have died in the past. The sign also appeared in a YouTube video from a cave dive in Mexico.", "In sum, Jacob's Well is a real and dangerous tourist attraction that has led to multiple drownings in the past. However, it's false to say that it's located in California, and also not true that \"no one\" is aware of its dangers.", "Hays County announced on its parks department phone line that Jacob's Well would be closed for the remainder of 2020 for \"aquatic restoration,\" and would not reopen for swimming until May 2021.", "Snopes debunks a wide range of content, and online advertisements are no exception. Misleading ads often lead to obscure websites that host lengthy slideshow articles with lots of pages. It's called advertising \"arbitrage.\" The advertiser's goal is to make more money on ads displayed on the slideshow's pages than it cost to show the initial ad that lured them to it. Feel free to submit ads to us, and be sure to include a screenshot of the ad and the link to where the ad leads.", "Jordan Liles is a Senior Reporter who has been with Snopes since 2016.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]