["The image was published in this Facebook post on September 3, 2019. It has been shared more than 500 times.", "The traditional Chinese language text in the bottom left corner translates to English as \"Lai Chi Kok Road in Hong Kong’s Prince Edward neighbourhood\". The text in the bottom right corner translates as “police officers want to rape me.”", "The logo for local Hong Kong media company i-CABLE can be seen at the top left corner, opposite the numbers “00:45:44”, representing a time mark.", "Below is a screenshot of the misleading Facebook post:", "The traditional Chinese language text at the top of the image translates to English as: “This woman said police officers want to rape her. I don’t believe if there’s any police officer with that heavy taste…! Do you believe so?”", "The post's caption translates in part: “(She) forgot to take medicine after coming out of psychiatric hospital!”", "Hong Kong has seen three months of street protests sparked by a proposed legislation that would have allowed extraditions to mainland China, as this AFP report explains. The protests have sparked occasionally violent clashes between demonstrators and police.", "The image was also shared in Facebook posts here, here and here, as well as on Weibo here, here and here with a similar claim.", "The claim is false; the image of the woman has been taken from a local media outlet's video interview in which she told a journalist that police officers had pepper sprayed her boyfriend.", "The interview can be seen in this video which was livestreamed on i-CABLE’s YouTube channel on September 2. It shows riot police gathered in the Hong Kong neighbourhood during a protest of Prince Edward. The video is embedded below.", "The image in the misleading posts corresponds with the i-CABLE footage at the two hour 48 minutes mark. Below is a screenshot of the footage at this point:", "At this moment in the footage, a journalist can be heard speaking the woman in Cantonese. Her comments translate to English as: “The one in the white shirt that was just taken away. Do you know if he/she was arrested?”", "Several other journalists filmed the same woman as she spoke to the media.", "This livestream by local media Stand News has a more audible record of the discussion than the i-CABLE footage. The footage is embedded below.", "Below is a transcript of the interview with a group of journalists, several of whom are heard asking questions. The interview starts at the one hour, 25 minutes and nine seconds mark of the video:", "Reporter (off screen): \"Why did you get pepper sprayed?\"\n\tWoman: \"We just passed by, but my boyfriend’s having some issues.\"\n\tFirst aider: \"Does he need any saline?\"\n\tWoman: \"Yes, you can help him with that. Wash his eyes. Thank you.\n\tMy boyfriend and I were just walking by...He came to pick me up knowing there were clashes in the area. Our home is just a block away, and we were surrounded by police and pushed against the wall. \n\tReporter (off screen): \"Did they pepper spray you when chasing after you?\"\n\tWoman: \"They did not pepper spray until we were pushed against the wall.\"\n\tReporter (off screen): \"Did you do anything excessive to the police at that time?\" \n\tWoman: \"No, (but) they pulled us.\" \n\tReporter (off screen): \"Did the police officers explain why they pushed you against the wall?\" \n\tWoman: \"I'm not sure.\" \n\tReporter (off screen): \"Have you and your friend been released?\"\n\tWoman: \"Yes, because we live nearby. We really just passed by. There’s nothing on us to accuse us of anything.\"\n\tReporter (off screen): \"The president of Hong Kong Baptist University’s student union Fong Chung Yin was possibly here just now, do you know him?\"\n\tWoman: \"I don’t know that person. I graduated a year or two ago.\"\n\tReporter (off screen): \"The one in white shirt who was just taken away. Do you know if he was arrested?\" \n\tWoman: \"I'm not sure. White shirt… Do you mean the one to my right?\"\n\tReporter (off screen): \"The first one who stood up. The one who was arrested for the second time.\" \n\tWoman: \"I've heard the news about him being arrested for the second time, but didn't know where he was taken to.\" \n\tReporter (off screen): \"So that means it’s very possible he was arrested, or you are not sure?\"\n\tWoman: \"I’m not sure.\"", "The woman is then seen walking away from the camera before she speaks to another group of reporters, where she describes her encounter with police in the same terms.", "One journalist is heard asking her if the police said anything insulting to her.", "“No. A female cop searched me,” she replies. “Apart from being pepper sprayed without any reason, it wasn't too bad. It was fine.”", "The same photo has been debunked here by Hong Kong's local fact checking team Kauyim Media.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]