["The claim was published here on Facebook on February 11, 2021.", "“(Breaking News) Italian police and army raided the Vatican City and arrested scores of paedophile cardinals. Reported by UN News,” reads the Korean-language post.", "The claim was shared alongside a link to a purported news report published on February 10, 2021, by UN News, a Seoul-based online newspaper that is not affiliated with the United Nations.", "Part of the Korean-language report translates to English as: “Italian law enforcement arrested scores of Cardinals early yesterday morning. The Italian military shortly afterwards swept into Vatican City.", "“The Italian parliament voted overwhelmingly to merge Vatican City into the city of Rome, effectively ending Catholicism’s reign over the city-state.", "“Everyone knew Vatican City was the centre of an international paedophile ring.", "“The operation was code-named Spotlight after the 2015 movie about clergy sex abuse scandal in Boston, Massachusetts.”", "The same purported report containing similar claims was shared on Facebook here, here and here.", "The claims are false: the text in the purported report originates from a satirical blog.", "Satirical website", "UN News, which published the false claim, uses a logo to purport that it has a connection with the UN.DPI.NGO International Environment Medical Services Corps (UNIONKO).", "A spokesperson for UNIONKO told AFP on February 17, 2021, that the organisation has no affiliation with UN News.", "The same story was published in English in this January 17, 2019, post on the satire blog Laughing in Disbelief. The post is headlined: “Italy Arrests Cardinals And Seizes Vatican City.”", "On the blog’s introduction page, the author notes: “You probably clicked a link to a story and you’re here. The story you were reading is satirical.”", "As of February 19, 2021, there were no credible media reports that the article was genuine.", "AFP reported here in September 2019 about a separate case involving allegations of sex abuse within the Vatican. Gabriele Martinelli, an Italian priest, was accused of sexually abusing altar boys in a seminary over a five-year period starting from 2007. The former rector of the pre-seminary, Father Enrico Radice, faces accusations he facilitated that abuse.", "Martinelli professed his innocence in a Vatican court on February 10, 2021, AFP reported here. It is the first time that the Vatican has criminally prosecuted acts believed to have happened within its territory.", "Unrelated photo", "The photo at the top of the misleading UN News’ report, which shows Italian armed forces wearing maroon berets, has been taken from this post by Naples-based online newspaper Fanpage.it published on May 23, 2017.", "The Italian-language caption of the photo translates in English as: “Security levels skyrocket in Rome, where US President Donald Trump is expected to arrive.”", "Below is a screenshot comparison between the image in the misleading post (L) and the photo on Fanpage.it (R):", "The former US President Donald Trump visited Rome on May 24, 2017, for a high-profile meeting with Pope Francis, according to this AFP report.", "AFP Fact Check previously debunked a similar false claim that Pope Francis was arrested on January 9, 2021.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]