["The photo was published on Facebook here on January 6, 2020.", "The Tagalog-language caption translates to English as: \"BREAKING NEWS - Submarine of Britain, to fire missiles at Iran in case war breaks out; Britain promised they support any moves by America; a British submarine is already positioned in a place where their missiles could reach the mainland of Iran; they only await the go signal of America\".", "Below is a screenshot of the misleading post:", "A US drone strike in Baghdad killed top Iranian commander Qasem Soleimani on January 3, 2020, in the most dramatic episode of escalating tensions between the two countries yet, AFP reported here.", "Yet the photo in the misleading Facebook post is being used out of context; it actually shows a US missile test off the coast of Southern California on June 27, 2018.", "A reverse image on Google found the photo published on this US Navy page. According to the website, the launch demonstrates the Navy’s “ability to conduct forceful military operations in the Pacific.”", "Below is a screenshot of the US Navy photo:", "The US Navy photo is captioned: “PACIFIC OCEAN (June 27, 2018) The crew of the Los Angeles-class fast attack submarine USS Annapolis (SSN 760) launch a Tomahawk Land Attack Missile (TLAM) off the coast of Southern California as part of a Tomahawk Flight Test (TFT). This launch was a demonstration of strike capabilities from the sea and showed the Navy's ability to conduct forceful military operations in the Pacific. (U.S. Navy photo by Mass Communication Specialist 1st Class Ronald Gutridge)”.", "Below is a screenshot comparison of the photo in the misleading post (L) and the US Navy photo (R):", "The US Navy photo also appears with the correct context in this Business Insider report.", "Contrary to the misleading post’s claim about the UK response to the US killing of Soleimani, the UK government called on parties to “de-escalate” and said “further conflict is in none of our interests”.", "“We have always recognised the aggressive threat posed by the Iranian Quds force led by Qasem Soleimani. Following his death, we urge all parties to de-escalate. Further conflict is in none of our interests,” UK Foreign Secretary Dominic Raab said in a statement published here on January 3, 2020.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]