["Several photographs have been shared on social media, especially by Pakistani handles, to portray brutality in Kashmir. In this article, we will debunk four such images that were shot in Kashmir, but do not represent the recent unrest following the abrogation of key provisions of Article 370.", "Where are you @UNHumanRights are you dead too#SaveKashmir pic.twitter.com/q84SlNrAfy", "— Malik Abdul Basit Awan (@AbdullBasiit) August 29, 2019", "This photograph was taken in 2017 and was uploaded by AP Images. “Kashmiri village women and young girls wail as the body of Indian policeman Tasveer Ahmad arrive for his funeral at Surasyar village about 38 kilometres (24 miles) southwest of Srinagar, Indian controlled Kashmir Saturday, June. 17, 2017,” reads the description of the photograph.", "Kashmiris have been kept in captivity in a state of hunger and thirst for 28 days, Seeing all this, the UN is silently watching the spectacle, it is sad that human rights are also silent, because everyone is silent that the dead are Muslims#28daysofkashmirshutdown pic.twitter.com/Az32rbB6gq", "— Parvez Pathan پرویز پٹھان (@parvezpathon1) September 1, 2019", "The image on the left was traced back to 2010 uploaded by Reuters and described as, “Women and a child watch the funeral of Mohammad Iqbal, a Kashmiri youth, from the window of a house in Srinagar August 4, 2010.”", "The bottom right image has already been debunked by Alt News. It is of a Gaza teen who was wounded by a pellet gun in the 2014 Gaza war.", "Yes I’m kashmir #28DaysOfKashmirShutdown@UN @BBCHindi @AJEnglish @aajtak @PMOIndia pic.twitter.com/NwS3niVCGS", "— Saleem Haneef (@saleemhaneef1) September 1, 2019", "The image of a young boy behind barbed wires was traced back to 2010. It was uploaded by Getty Images described as, “A Kashmiri child stands besides a stretch of barbed wire during a curfew in Srinagar on July 18, 2010.”", "Old images were shared on social media in an attempt to pass them off as representative of the recent unrest in Kashmir. Alt News has debunked many such images in an earlier article as well.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]