["About this rating", "In May 2020, as demonstrators in various parts of the U.S. continued to advocate for the lessening of social-distancing measures and forced business closures enacted to combat the spread of the coronavirus pandemic, social media users circulated the following photograph, said to have been taken at an \"end the lockdown\" protest:", "Many viewers found the protester's sign equating the mandatory wearing of personal protective equipment (PPE) such as face masks to muzzles worn by dogs or slaves to be insulting, and they questioned whether this image was authentic or whether the wording of the sign had been digitally altered.", "But the photograph is indeed real, and was taken at a protest on May 15, 2020, against California's stay-at-home order staged at the Humboldt County courthouse in Eureka, California. Kym Kemp's Redheaded Blackbelt blog features the original photograph, along with a snapshot of another demonstrator holding the same sign.", "Gretha Stenger, the woman in the red scarf pictured above, apologized afterwards and maintained that the sign was not hers and had been handed to her:", "Gretha Stenger held the sign at a protest in front of the Humboldt County courthouse, where she was photographed for a post in Redheaded Blackbelt, the community news blog in Southern Humboldt.", "In a statement, Stenger apologized for the image, which was shared thousands of times on Twitter and garnered hundreds of reactions on Facebook from people criticizing the sign’s message. Stenger said the sign was not hers but handed to her by another protester at the demonstration.", "“Holding that sign up at the lockdown protest was a grave mistake and I ask forgiveness from all those who I have caused pain. As I had no sign of my own, it was handed to me by another protester and a photographer took the picture before I considered the racist implications. My intent was to take a stand for the freedom of all human persons and I mistakenly held a sign that conveyed the opposite. Please know that I respect the dignity of all people and I sincerely regret any suffering it has caused.”", "We note that the function of a muzzle is to prevent the wearer from being able to talk, bite, and or eat, none of which is precluded (literally or figuratively) by the wearing of a face mask used to minimize the transmission of infection.", "Kemp, Kym.   \"At the Courthouse Friday, A Group Protested Against Stay-at-Home Orders.\"\r\n    Redheaded Blackbelt.   16 May 2020.", "Mukherjee, Shomik.   \"Humboldt County Coronavirus Protester’s ‘Slaves’ Sign Goes Viral.\"\r\n    [Eureka] Times-Standard.   18 May 2020.", "This article was updated on May 21, 2020, to incorporate additional information from the Times-Standard.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]