["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Retiring Senate Minority Leader Harry Reid spent what is likely his last turn in the national spotlight throwing shots at the Republican presidential ticket.", "Reid, speaking at the Democratic National Convention in Philadelphia on July 27, warned that the ticket of Donald Trump and Indiana Gov. Mike Pence would roll back Democratic accomplishments and de-stabilize Social Security.", "\"Donald Trump and Mike Pence want to gamble with your retirement benefits in the stock market,\" Reid said. \"Republicans want to tear down the pillars of middle-class security.\"", "Democratic warnings about Republicans meddling with Social Security benefits are a well-trodden line of attack, and one we’ve fact-checked before. But does it apply to Trump and Pence?", "Strange bedfellows", "Trump has been somewhat unusual among major Republicans in flatly rejecting any calls for entitlement reform, including Social Security.", "\"We're gonna save your Social Security without making any cuts,\" he told a crowd in Georgia in February. \"Mark my words.\"", "He responded to a June AARP questionnaire on making Social Security solvent in the future by essentially focusing on economic reforms, and didn’t mention any proposals to change the structure of the entitlement program.", "\"If we are able to grow the economy, increase the tax base, bring capital and jobs back to the United States and encourage foreign direct investment, we will shore up our entitlement programs for the time being,\" he said.", "Though he’s been consistent on the issue during this presidential run, Trump sung a different tune back in 2000, when he called for privatizing the entitlement program and compared it to a Ponzi scheme.", "Entitlement reform, including changes to Social Security, is one of the major policy areas where Pence’s past record hasn’t matched up with Trump’s promises on the campaign trail.", "Pence has strongly supported several attempts to modify Social Security, but it is an exaggeration to call it \"gambling\" with benefits in the stock market because the choice would be up to workers. While in Congress, Pence backed the 2005 Social Security reform proposal, which would have allowed workers to invest some of their payroll taxes into private accounts and reduced the benefit growth rate for future high-income retirees.", "Pence even sent a letter to President George W. Bush in 2005 asking him to avoid compromising on the proposal.", "He told a CNN interviewer in 2010 that he’d be open to cutting the existing program and raising the retirement age, saying, \"We need look at everything on the menu.\"", "Our ruling", "Reid said Pence and Trump \"want to gamble with your retirement benefits in the stock market.\"", "Pence may have a record of supporting Republican proposals to change Social Security to allow for more investment into private funds, but Trump has clearly and repeatedly said this campaign cycle he has no plans to modify Social Security or introduce elements similar to the Bush’s failed 2005 attempt to restructure the entitlement program.", "We rate this statement as Mostly False.", "https://www.sharethefacts.co/share/0fffc816-07eb-429e-82a2-aa2c173824cf", "CNN, \"On Social Security, Trump and Pence couldn't be more different,\" July 15, 2016", "Associated Press, \"Trump, Pence don't agree on key social, economic policies,\" July 15, 2016", "AARP Bulletin, \"Trump & Clinton: Find Out Where They Stand On Social Security,\" June 27, 2016", "PolitiFact, \"Clinton exaggerates Republicans' plans to 'privatize' Social Security,\" April 15, 2016", "WALB, \"Donald Trump rallies in Valdosta,\" Feb. 29, 2016", "BuzzFeed, \"Trump On Social Security In His 2000 Book: A Ponzi Scheme We Must Privatize,\" Sept. 29, 2015", "The Hill, \"House conservatives oppose add-ons,\" April 19, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]