["The 26-second clip was published here on Facebook on June 28, 2019, where it has been viewed more than 286,000 times and shared more than 12,000 times.", "The video shows a woman with a bloodied face, leaning against a wall with a baby in her arms. At around the 18 seconds mark, an older woman can be seen lying on the ground.", "Below is a screenshot of the misleading post:", "A Tamil-langugage audio commentary on the video translates to English as: “Hello, vanakkam! Friends, the terrorists are recently putting a poison called HTC in cool drinks such as Maaza and Coca-Cola. Many people are dying as a result. Beware and forward urgently.”", "Vanakkam is a greeting in Tamil; Maaza is a popular mango-flavoured drink in India.", "The video has been shared thousands of times, especially among Sri Lankan and Indian users, with a similar claim including here on Twitter and here on YouTube.", "The claim is false; the video has circulated online since August 2018 in local media reports about a domestic violence incident in India.", "Through a reverse image search on Google and a keyword search on YouTube, AFP found the same video footage used in this report published on the official YouTube account of Indian news channel Mirror Now on August 31, 2018.", "The same footage from the misleading posts can be seen at around the 36 seconds mark and the 52 seconds mark of the Mirror Now report.", "Below are screenshot comparisons of the video in the misleading post (L) and the corresponding scenes in the Mirror Now segment (R):", "The title of the Mirror Now report on YouTube states: “Caught on Camera: Telangana Cop thrashes wife and mother in law”.", "The caption states: \"A sub-inspector was caught on camera beating his wife and mother in law. He was in an illicit affair with another woman and when his wife got to know, she decided to confront him with the help of women's rights activist.", "\"The cop is absconding and a case of assault has been registered against the cop from a town in Bhadradri, Telangana.\"", "The video report is embedded below:", "Bhadradri Kothagudem district is located in the eastern region of Telangana, a state in southern India.", "The same clip can also be seen at around the 53 seconds mark in a video published at the top of this September 1, 2018, report by Indian newspaper The Times of India.", "The report states that Sub-Inspector Jitendra attacked his wife Parveen and their three-month-old son, as well as his mother-in-law, who then suffered a head injury.", "The report states: “The cop and his lover are on the run, and an FIR [first information report] has been registered. The victims have been admitted to a local hospital.”", "Below is a screenshot of the clip in the Times of India report:", "AFP contacted Inspector Ramesh Babu from the Manuguru Police Station in Manuguru, Telangana – the lead investigator in the case – who told AFP by telephone on July 16, 2019 that Telangana Police Sub-Inspector Samudrala Jitendra had been suspended.", "“There is an ongoing internal investigation about the case and a criminal case filed against him in the local court for harassment,” Inspector Babu said.", "In a separate phone conversation on July 16, 2019, police chief of the Bhadradri Kothagudem district, Deputy Superintendent R. Saibaba, added that Jitender will remain suspended until the investigation is completed.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]