["On February 25, a 44-year-old Italian man flew from Italy to Lagos, Nigeria. He slept at a hotel in Lagos and travelled to Ewekoro in neighbouring Ogun state, where he met staff from cement manufacturing company Lafarge Africa Plc.", "After falling ill, he was tested for coronavirus based on his travel history. He tested positive, and became the first confirmed novel coronavirus case in Nigeria, fuelling false reports.", "Less than 24 hours after Nigerian authorities announced the case,  Facebook page AIT Nigeria News claimed that the Italian man's taxi driver had also contracted the virus and was at large, threatening to spread it across the country if his family was not paid N100 million ($275,000).", "The post, archived here, has been shared more than 2,700 times alongside what was said to be a picture of the driver in question.", "We archived similar posts here, here, and here.", "African Independent Television (AIT), owned by DAAR Communications, is one of the most popular TV stations in Nigeria. It has sparked Facebook parody pages, including this one with the name “AIT Nigeria News”.", "After the post went up, Johnson Onime, spokesperson of DAAR Communications Plc released a statement, branding it  “fake news”.", "He added that the network’s official Facebook page is “OfficialAITlive”.", "AFP traced the image in the post to a December 2018 report by BuzzFeed News about modern-day slavery in Libya. The man in the picture is Jude Ikuenobe, who was sold into slavery in Libya, after leaving his hometown in southern Nigeria for a better life in Europe.", "Ikuenobe, who made it back from Libya to Benin, also released a video, saying he had not been in Lagos for two years and was not the Italian man's cab driver.", "VIDEO: 'I've not been to #Lagos in 2 years' — man in viral post as Uber driver to #coronavirus patient debunks fake news#COVID-19 #COVID19Nigeria #FakeNews pic.twitter.com/vGk6swGnX6", "Segun Soyoye, industrial director of Lafarge Africa Plc, said all the 39 people who had contact with the Italian patient have been quarantined, including the driver who drove him to Ewekoro from Lagos.", "Nigeria's Minister of Health Osagie Enahire confirmed this in a press conference in the nation’s capital Abuja on March 2, 2020.", "He said authorities were still trying to trace all 156 passengers on the aircraft which brought him to Nigeria.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]